{
  "data/reddit-books/r/books/comments/qjxggn/the_ruins_by_scott_smith_is_a_great_horror_story.json": "I just finished this book today and I really enjoyed it! I thought it was very\nwell written and am extremely creepy concept, very disturbing in parts. I loved\nthe authors writing style, and how the characters felt like real people. I'm\nabout to watch the film this evening to see how it compares. I'm…",
  "data/reddit-books/r/books/comments/qk129m/listening_to_audiobooks_has_made_normal_reading.json": "Recently I did a reread of the Bartimeaus Trilogy (an amazing story about magic\nin London that should have gotten the hype HP did) to see if it held up past my\nhigh school self.\n\nMy fiancé was reading it at the same time and we discussed how much of a Sass\nthe narrator is, which was something I…",
  "data/reddit-books/r/books/comments/qk29yo/i_dont_understand_a_tale_of_two_cities_by_charles.json": "I've never really read a Charles Dickens book and a couple days ago I checked \"A\nTale of Two Cities\" out of my school library and started reading it. And I'm\nfrustrated; it's not really the book's fault, it's mostly mine.\n\nI heard good things about this book and I really wanted to like it. But…",
  "data/reddit-books/r/books/comments/qk4pvy/how_can_a_book_published_in_1984_not_be_available.json": "I read a lot books on the history of intelligence / covert operations and for\nyears have been trying to find a copy of \"Beyond the CIA: The Frank Terpil\nStory\" by Richard Lloyd and Antony Thomas (Seaver Books, 1984, ISBN =\n086579023X). But I have yet to have found this book for sale anywhere…",
  "data/reddit-books/r/books/comments/qk6j5w/anyone_interested_in_starting_a_book_club_over.json": "Of my friends I’m the only one that’s REALLY into reading. I’ve tried to get a\nfew ppl in my life to read with me so we can discuss the books but the plans\nalways fall through. I like a variety of genres and if anyone wants to start a\nbook club let me know!! I’d be willing to set one up if others…",
  "data/reddit-books/r/books/comments/qkcggk/i_finished_stephen_kings_it_on_halloween.json": "What a ride, an incredible book front to back. Really a shame how the movies\ndon't do it justice. A mini-series would probably work better really.\n\nAmazing characters, memorable moments, images to forever haunt your mind. What's\nnot to love? I'll miss the Loser's Club and the Terror of Derry.. truly…",
  "data/reddit-books/r/books/comments/qkfvr7/im_neal_shusterman_author_of_the_arc_of_a_scythe.json": "Hi Reddit, this is Neal Shusterman, bestselling author of 40 award-winning books\nfor teens, and adults. My books include the Arc of a Scythe trilogy, the Unwind\ndystology, Challenger Deep (2015 National Book Award winner), the Skinjacker\ntrilogy, and Dry—which I co-wrote with my son Jarrod—and with…",
  "data/reddit-books/r/books/comments/qki0kt/the_cursed_child_is_a_cursed_book.json": "So, I finished the Harry Potter series (the OG 7 books) some months ago and I\nabsolutely fell in love with it. Now recently, a friend of mine gave me the\n'Cursed child'. I had never heard about that book before and had 0 idea then\nabout how it would turn out to be. I got excited as usual and read…",
  "data/reddit-books/r/books/comments/qkne5x/do_you_easily_pick_up_grammatical_or_punctuation.json": "I’m talking “New York Times Bestsellers” books that have sold millions of copies\nwith errors, not a self-published novel on Wattpad. It drives me nuts!! I\nquestion how many eyeballs read the same thing and skipped over it. Idk, I just\nfeel like if you are a successful and widely published author,…",
  "data/reddit-books/r/books/comments/qksbit/halloween_tree_by_ray_bradbury.json": "So, I am an English teacher and have routinely taught various works by Bradbury\nover the years. But this title was totally new to me. I didn’t even know he’s\nwritten a Halloween book.\n\nI grabbed it to read, a bit each night, with my oldest two kids (12 and 8) and\nwe LOVED it.\n\nIt surprises me that…",
  "data/reddit-books/r/books/comments/ql1d41/the_machine_stops_a_short_story_by_em_forster.json": "I read this short story maybe 12 years ago and wondered if we might end up in a\nsimilar world the story posits - one where people exist in pod-like enclosures,\nonly connected to one another through a fantastical \"mirror\" which shows\n\"satisfactory approximations\" of peoples likenesses. Facebook, and…",
  "data/reddit-books/r/books/comments/ql3sy7/a_canticle_for_leibowitz.json": "Just read it, what a classic! Great for anyone who likes books about sci fi, the\nmiddle ages, or religion.\n\nIt's set in the aftermath of a cataclysmic nuclear war. The survivors blamed\nscience, and killed intellectuals and burned all the books they could get their\nhands on. A monastery in the desert…",
  "data/reddit-books/r/books/comments/ql5ue7/dont_completely_disregard_audiobooks_especially.json": "I've been a stay at home mom for nearly 5 years, and have struggled to find the\ntime and energy to read books since my daughter was born, despite a deep love\nfor the written word and an aspiration to write books myself. By the time she's\nin bed, my eyes and brain itch for sleep. Even when she did…",
  "data/reddit-books/r/books/comments/qln6ul/which_book_changed_your_life.json": "It was The Godfather for me. I had anger management issues, I had a strong\nsuperiority complex and it vanished almost overnight. From being a snob, I\nbecame a people's person. A total U-Turn. For me the clincher was, how the Don\nshowed respect to his people, how he greeted them with warmth and also…",
  "data/reddit-books/r/books/comments/qlqu3c/what_bookseries_do_you_love_that_no_one_else.json": "For me it’s Wolf by Wolf, and it’s sequel Blood for Blood by Ryan Graudin. I got\nthe first book from a friend the year it was released after Christmas as she got\n2 copies of it. It’s now one of my favourite series and whenever I talk about\nit, no one else seems to have heard of it or read it. But in…",
  "data/reddit-books/r/books/comments/qltn77/unpopular_opinion_movie_covers_and_tv_tie_ins.json": "There are a lot of posts on here and other social media talking about how movie\ntie in covers and \"now on netflix\" circles/stickers ruin books for you. It's\namusing because there are so many books I may have never heard of if they hadn't\nbeen movies or tv adaptations.\n\nI think it's important to draw…",
  "data/reddit-books/r/books/comments/qluiaz/dad_passed_away_before_finishing_wheel_of_time.json": "My pops died in a motorcycle wreck about fifteen years ago. He was my best\nfriend, and I get my love of all things sci-fi and fantasy from him. The year or\nso before he died, I remember him getting a new book series from a work buddy.\nIt was WoT. He devoured it. He would miss his sleep schedule (he…",
  "data/reddit-books/r/books/comments/qlyuf9/narrators_of_audiobook_can_really_make_a_world_of.json": "The last couple of years I've really gotten into audiobooks and one thing I\nreally noticed is that I have to like or at least tolerate the narrator to that\nthough the book. One example for me is the Witcher series, I was really excited\nbecause I've Heard so much good about it but not even ten…",
  "data/reddit-books/r/books/comments/qm1bky/wow_just_finished_carl_sagans_the_demon_haunted.json": "I personally think this book should be required reading to graduate high school.\nI have heard about this book for years but never got around to reading it until\nnow and was blown away by how relevant and timely it is to today's world despite\nbeing 25 years old.\n\nHe covers all the logical fallacies…",
  "data/reddit-books/r/books/comments/qm91tk/what_ive_learnt_from_reading_the_worlds_oldest.json": "Just finished The Tale of Genji, written by Murasaki in about 1000 AD. Here are\nthe key learnings I've taken away through constant repetition. I hope others\nwill find this as useful as I have:\n\n * There isn’t a single sleeve in Japan capable of containing the tears shed by\n   a broken hearted…",
  "data/reddit-books/r/books/comments/qmgte3/how_do_yall_manage_an_addiction_to_social_media.json": "I work six days a week, currently. I am almost always on social media especially\nreddit and instagram. Reddit eats up most of my free time. I notice there are\nmany people on r/52book [/r/52book] who managed to read almost 100 books and\nstill be on Reddit. I guess I lack self-discipline. I would love…",
  "data/reddit-books/r/books/comments/qmi0c2/i_just_finished_reading_shirley_jacksons_the.json": "My thoughts (disguised as a film quote): Yes, it is. In '48, Jackson released\nthis; The Lottery !, her most accomplished piece. I think her undisputed\nmasterpiece. A story so boring, most people probably don't get to the ending.\nBut they should, because it's not just about the pleasures of…",
  "data/reddit-books/r/books/comments/qmnvk8/how_much_character_description_do_you_need.json": "I can make do with very little physical description of a character. Take Terry\nPratchett, for instance. I know Carrot is tall, broad-shouldered, red-haired,\ntanned, and very attractive, but I have no idea what he actually looks like in\nterms of specific facial features. Somehow that's enough,…",
  "data/reddit-books/r/books/comments/qmrm9d/slaughter_house_five_reading_the_first_chapter.json": "I read this book for the first time and liked it a lot. But the end of the book\nfelt like it was so sudden and everything just comes to a halt. It wasn't until\nI reread the first chapter again that everything just clicked. The tweeting of\nbirds was more chilling at the realization that these were…",
  "data/reddit-books/r/books/comments/qmsr8s/sometimes_theres_a_moment_where_a_book_reminds.json": "I’m reading The One Hundred Years of Lenni and Margot, and the fifth chapter has\na paragraph that genuinely gave me butterflies.\n\nThe paragraph is about a woman who’s forced moved on from a project she loved.\nLenni, one of the two protagonists, has her life changed by this woman. And\nthere’s…",
  "data/reddit-books/r/books/comments/qmuoyh/i_think_i_might_know_why_people_hate_emma.json": "I love Emma. I think it might be my favorite Jane Austen novel (but who can\npick?). However, a lot of my friends hate the namesake character. I mean really\nhate her. One friend of mine reads like crazy and has read every Austen novel\nexcept Emma--she simply can't bring herself to finish it because…",
  "data/reddit-books/r/books/comments/qn0h0n/never_before_have_i_felt_so_understood_by_a_book.json": "The bleak depiction of a loner who sits by himself all day, reading and\ncomparing himself to others.\n\nFeeling like an outcast - looking down upon, and simultaneously admiring, men\nwho don't think so much: men who can go through life and be brave, charging\nforth in stupidity without a deep sense of…",
  "data/reddit-books/r/books/comments/qn987t/whats_a_book_that_really_gets_at_the_heart_of_the.json": "After finishing Dostoevsky's Brothers Karamazov earlier in the year, I've\nfinished reading Tolstoy's Anna Karenina today and it was brilliant. It was\nindeed quite comprehensive of the human condition, but not quite comprehensive\nenough; I feel like it skipped or censored through ellipses some more…",
  "data/reddit-books/r/books/comments/qncjys/who_else_has_given_up_on_patrick_rothfuss.json": "Im done. I enjoyed his first two books but the wait for the third is too much.\nEven if he eventually publishes the third I won't be buying it or reading it. It\nalso started to feel like Kvothe was becoming the neckbeards ideal vision of a\nman. I was worried that I would dislike him intensely by the…",
  "data/reddit-books/r/books/comments/qndqa3/just_finished_issac_asimovs_the_caves_of_steel.json": "Just finished it today, picked up a copy for less than £2 in a charity shop last\nweek and wow! What a great book! Found the story very captivating whilst still\nhaving the inferable depth that makes sci-fi great! Before this had read Asimov\nand Silverberg's \"Nightfall\" so was already expecting good…",
  "data/reddit-books/r/books/comments/qnf6sr/whats_the_last_book_that_brought_you_to_tears.json": "What was it about the book? Was it sadness? Ecstatic resolution? Maybe a deeply\nnurtured connection to a character, a bond just slightly transcending the\nboundary between the reader and the word, severed by the permanence of The End.\n\nOnly once have I really cried reading, and the book was The Fault…",
  "data/reddit-books/r/books/comments/qnmmv3/i_just_finished_the_three_body_problem_trilogy.json": "I knew this series was well regarded when I started reading it, and I hate to be\nhyperbolic, but it exceeded all of my expectations. It was such a unique work of\nart, so broad and expansive, so imaginative and yet so anchored in realistic\npossibilities. It's one of those series that's left me sad to…",
  "data/reddit-books/r/books/comments/qnyr91/is_the_imagery_very_vivid_in_your_head_when_you.json": "My suspicion is that people who are able to envision clearly and imaginatively\nwhat they are reading are the ones who continue to read throughout their\nchildhood, teens and adulthood. I've read a few threads on Reddit and there\nseems to be the typical reader response that in their mind they have an…",
  "data/reddit-books/r/books/comments/qo1ijt/how_has_reading_affected_your_empathy.json": "I wanted to open a discussion on how reading has affected your empathy? For\nbetter or worse, I'm curious to hear the different perspectives that people\nhave. I was originally going to post this with my opinions and hoping people\nagreed with me and everything would be fine. So I hope people respond…",
  "data/reddit-books/r/books/comments/qoagbt/the_worst_part_about_lolita_for_you_for_me.json": "is how much I like Dolores' character archetype. I absolutely love reading about\nsassy, bratty, filthy, wild, and naive and yet precocious little girl characters\n(though I sure don't appreciate the sort in real life all that much). There's\nsomething really compelling about these characters in…",
  "data/reddit-books/r/books/comments/qod0j3/should_i_keep_reading_classic_books_even_though.json": "As much as I don’t like to admit this but YA books are my guilty pleasure and I\nlike to read a lot of them. However recently I’ve been wanting to delve into\nmore classic literature but when I try to read it, I find it hard to fully\ncomprehend what I’m reading and understand the plot which makes…",
  "data/reddit-books/r/books/comments/qodnfs/what_is_your_favorite_book_to_read_before_bed.json": "I have read David Copperfield quite a few times so I enjoy reading it before\nbed. Why? Because I've read it before so there are no surprises. I've tried\nreading new books but they keep me up because I get excited about what happens\nnext. Then I tried reading boring books and of course then I lose…",
  "data/reddit-books/r/books/comments/qojj16/i_read_siddhartha_five_months_ago_and_i_still.json": "Quoth Siddhartha: “What should I possibly have to tell you, O venerable one?\nPerhaps that you’re searching far too much? That in all that searching, you\ndon’t find the time for finding?”\n[...] “When someone is searching,” said Siddhartha, “then it might easily happen\nthat the only thing his eyes…",
  "data/reddit-books/r/books/comments/qoyp74/authors_who_describe_every_single_female_that.json": "It's just lazy.\n\nI dont care how down to earth or likeable a main character is. When the\nperspective comes across like every woman they encounter is either lusting after\nthem, or being sized-up and put into different categories of dream-girl\narchetypes, it turns the otherwise relatable main…",
  "data/reddit-books/r/books/comments/qozijb/do_we_think_there_will_be_anything_even.json": "For context, I was born in 95 so I was there for the Harry Potter, Twilight &\nHunger Games craze, and to be honest I miss it. The closest I can think of would\nbe the mid 2010’s Game of Thrones phenomena, which was due in large part to the\nvery successful HBO show.\n\nI know that the world was pretty…",
  "data/reddit-books/r/books/comments/qpb09x/the_iron_dream_by_norman_spinrad_and_the.json": "The Iron Dream is about a hero who finds himself drawn into an epic struggle\nagainst an evil empire of mind-controlling mutants who seek to destroy the\nforces of good. After rooting out one of the mutants, he gets in a fight with a\nbunch of rogues and wins a powerful, mystical weapon of old that…",
  "data/reddit-books/r/books/comments/qpi0zs/books_you_wanted_to_like.json": "A while ago, I read The Only Good Indians by Stephan Gram Jones that was\nrecommended to me by an employee at my local book store. I bought it because it\nlooked interesting and because she said it was good, and I didn't bother\nfinishing it even though I was a hand full of pages left from finishing…",
  "data/reddit-books/r/books/comments/qpnbhf/what_is_your_favorite_epigraph_or_dedication.json": "I don't have a favorite dedication - although I'm sure there are some\ngreat/creative ones out there - but my favorite epigraph is the from Steve\nKoll's Directorate S (2018), which chronicles \"The CIA and America's Secret Wars\nin Afghanistan and Pakistan, 2001-2016\" with a focus on the role of…",
  "data/reddit-books/r/books/comments/qpnq8s/has_anyone_else_read_anne_bishops_the_others.json": "A while ago I got bored and picked up the first book in the series, Written in\nRed. I'm not really sure why since it's not the type of book I usually read at\nall and I assumed it was a werewolf-esque romance (no shame if you like that,\nit's just not my thing) but it wasn't. It was absolutely amazing…",
  "data/reddit-books/r/books/comments/qpw3n3/pride_and_prejudice.json": "So, in my mid 40's I finally got around to reading Pride and Prejudice. I have\nto admit I was very pleasantly surprised by the book. It pulled me in. Never\nhave I been so tempted to Google a book or read the last chapter so that I could\nfind out what happened faster than reading could get me there.…",
  "data/reddit-books/r/books/comments/qq5g46/whats_a_book_that_was_the_opposite_of_a_letdown.json": "We tend to favor things that leave a good first impression, and as such I think\nwe're more likely to run into things that leave us feeling let down.\n\nBut what's a book where you've had the opposite experience? Where you started\nout distinctly not liking it. Perhaps the story took it's time moving…",
  "data/reddit-books/r/books/comments/qq5xhh/i_just_finished_stoner_by_john_williams_and_it.json": "It is really hard to explain why and I am not sure how to write about it.\nHowever, I would like to express my gratitude toward the person who recommended\nit here in the comment section of r/books [/r/books] a couple(?) of weeks back\nso I made this little post to maybe make others aware of the book…",
  "data/reddit-books/r/books/comments/qqckap/the_secret_history_by_donna_tartt.json": "i just finished this novel for the first time yesterday and i’m devastated. that\nending well and truly killed me off and i don’t think i’m ever going to recover.\nit’s been such a long time since i’ve connected with a book this much and it’s\nsuch a nice feeling, but now everything in my life can’t…",
  "data/reddit-books/r/books/comments/qqio98/i_just_read_the_power_of_the_dog_and_the_cartell.json": "All I could think about while reading these books is what I would do if I had to\ntry and raise my family in one of these countries that are ravaged by the drug\ntrade. The fact that the books are based off of real life events make my soul\nhurt. I knew it was bad but these books really give you…",
  "data/reddit-books/r/books/comments/qqxkal/jane_eyre_she_did_that.json": "Just finished Jane Eyre and it blew me away! The best part of the book is\nhonestly her character because the boldness of her spirit, her passion, and\nagency really struck a chord in me — it felt so modern for a book set in that\nera. I can imagine how groundbreaking this must have been. I can totally…",
  "data/reddit-books/r/books/comments/qr1ia8/consider_glasses.json": "If you're one of those people who \"used to read for hours at a time\" when you\nwere a kid but now struggle to do even 15 mins straight, consider seeing an\noptometrist and having your vision checked. Many people's eyesight starts to\ndegrade in their 30s or 40s. You might not notice it in your day to…",
  "data/reddit-books/r/books/comments/qr6ts8/jane_eyre_is_a_beautiful_masterpiece.json": "It’s not hard to see why Jane Eyre is considered a masterpiece. The first that\nbecomes apparent is the author Charlotte Brontë’s deeply beautiful command of\nthe English language throughout the novel, with descriptions of vengeance like:\n\n> Something of vengeance I had tasted for the first time. As…",
  "data/reddit-books/r/books/comments/qrdqyv/a_little_wisdom_from_terry_pratchett.json": "Unseen Academicals: Sometimes people fool themselves into believing things that\naren't true. Sometimes that can be quite dangerous for the person. They see the\nworld in a wrong way. They won't let themselves see what they believe is wrong.\nBut often there is a part of the mind that does know, and…",
  "data/reddit-books/r/books/comments/qreynb/finished_reading_the_kite_runner_two_days_ago_and.json": "This book was so deep and it just plays with human emotions.The characters are\nso well written and this story just questions if there is any humanity left in\nthis world.i can't stop my tears running down my cheeks while u get into the\nlast 100 pages.i learned a lot about afganistan from this…",
  "data/reddit-books/r/books/comments/qrj4zq/what_makes_harry_potter_great_are_not_the_plots.json": "I joined the Harry Potter train late. I first saw the movies and was impressed\nby them. They are well made entertainment with a lot of heart. I later read the\nbooks and found them even better than the movies. The movies breeze past you\nbecause they cover a lot in a short span. Whereas the books,…",
  "data/reddit-books/r/books/comments/qrlurl/do_most_of_you_read_for_entertainment_or_are_you.json": "I majored in literature, and I often joke it's part of the reason that I \"don't\nread literature.\" That is not entirely true, I do find that I tend towards genre\nfiction, young adult stuff, fantasy adventure, light novels, paranormal romances\nand stuff that puts entertainment over academic merit.\n\nAt…",
  "data/reddit-books/r/books/comments/qroiyv/happy_armistice_day_everyone.json": "Every year on this day I'm reminded of Kurt Vonnegut's musings on the day from\nthe novel Breakfast of Champions:\n\n> So this book is a sidewalk strewn with junk, trash which I throw over my\n> shoulders as I travel in time back to November eleventh, nineteen hundred and\n> twenty-two.\n> \n> I will come…",
  "data/reddit-books/r/books/comments/qrpfnh/happy_50th_anniversary_to_fear_and_loathing_in.json": "One of my all-time favorites.\n\nI know the movie was pretty close to the book, but I think it failed to really\ncapture a lot of the subtlety. There's something about the way Hunter wrote that\ninvited a certain slowness for me. More than once I stopped to try to understand\nreferences, people, that…",
  "data/reddit-books/r/books/comments/qrtfxd/what_happened_to_russian_literature_why_we_dont.json": "I'm reading War and Peace. I'm really liking and i'm reading it very easily. I\nhad already read Karamazov Brothers, Crime and Punishment and The Master and\nMargarita. So it will be hard to choose what book is better.\n\nReading Tolstoy made me think of what happened to Russian Literature.…",
  "data/reddit-books/r/books/comments/qryhio/im_listening_to_jane_eyre_audiobook.json": "...and I don't know if it is appropriate to post about the narrators on this\nsub, but I just have to say, Thandiwe Newton has done a stupendous job! I am\nstill not done with it, in fact I only just finished the first part (her life in\nLowood). I was listening to it on my way to work and the…",
  "data/reddit-books/r/books/comments/qrzhnh/parable_of_the_sower_is_so_predictive_its.json": "I knew nothing about Octavia Butler's \"Parable of the Sower\" before picking it\nup. It is well written, great characterizations, plot pace is perfect, the work\nof a fine writer at her best ... I had to stop and put it away, half-unread.\n\nHer depiction of collapsing America, riven by dissention as…",
  "data/reddit-books/r/books/comments/qs9rbt/ill_try_to_be_polite_a_clockwork_orange.json": "When I started reading, I was greatful for having the original edition (not the\nAmerican one that the film is based on), but when I finished it, I felt that the\nending lacks the organic structure of the previous chapters.\n\nIt was an amazing book with characters who weigh in on the main character,…",
  "data/reddit-books/r/books/comments/qsbyph/i_didnt_enjoy_flowers_for_algernon.json": "I thought Keyes did a fine job on developing pathos for pre-treatment Charlie,\nbut once he had the treatment (Charlie, not Keyes), he turned into a thoroughly\nunlikeable person. The slide back to his former self restored some part of the\npathos, but it felt mawkish, perhaps gratuitous. There didn't…",
  "data/reddit-books/r/books/comments/qshaqw/whats_the_point_of_speed_reading.json": "I mean, shouldn't you read at your own pace? Why the big hurry to finish a book\nor anything in particular? I actually learned how to stop subvocalizing and\nsometimes chunk the words. However, reading too fast puts strain on my eyes.\nCurrently reading Harry Potter and why should I speed read through…",
  "data/reddit-books/r/books/comments/qsokl2/how_often_do_you_dnf_a_book.json": "I used to NEVER not finish a book. Now I feel like I do it all the time, like\nhalf the books I've started in the last few months. I just lose interest or I'm\nnot motivated to pick it up and eventually it has to go back to the library. I'm\nnot sure if this is because I'm less willing to waste my time…",
  "data/reddit-books/r/books/comments/qsq9eo/giovannis_room_was_so_beautifully_heartbreaking.json": "I haven't read a book in a very long time, I'm so glad that I decided to start\nwith Giovanni's room. It was so captivating and sensual. It has a woken me from\na deep slumber and I am just so happy to have read it. James Bladwin taps into\nhumanity of obligation and self-sacrifice in such a poetic…",
  "data/reddit-books/r/books/comments/qsthm7/what_are_the_stereotypes_of_someone_who_only.json": "I [33f] recently went on a date with a guy [35m] who seemed cool and that we\nhave a bunch in common. When we started talking about books and what we've been\nreading, I said I mostly love nonfiction and detailed a few of the books I've\nrecently read about the history of WWII, Churchill, Bad Blood by…",
  "data/reddit-books/r/books/comments/qt15h1/what_is_that_one_book_that_feels_fresh_every_time.json": "There are some books that feel fresh no matter how many times you read it in the\npast. You see a plot twist coming, yet you approach it with the same amount of\nenthusiasm that you had back when you read it for the first time.\n\nFor me, any one of the Harry Potter series makes this list. The…",
  "data/reddit-books/r/books/comments/qt2vh8/what_is_philippa_gregorys_deal_with_incest.json": "I am a longtime reader of Philippa Gregory and a history teacher. I know that\nshe flubs the history or completely makes things up and while it makes me grit\nmy teeth, I can get over it.\n\nBut seriously, what I can't get over is her insane obsession with incest. That's\nwhat makes things bad for me,…",
  "data/reddit-books/r/books/comments/qt4ogd/where_are_you_from_and_what_were_the_high_school.json": "I was on a flight, talking to a woman who grew up in Paris, France. As a\ntraveler, I'm always interested in what people around the world were assigned to\nread in high school. She gave me this list:\n\n * Bel-Ami by Guy de Maupassant\n * Germinal and L'Assommoir by Émile Zola\n * Les Misérables by Victor…",
  "data/reddit-books/r/books/comments/qtagi5/the_merchant_and_the_alchemists_gate_soothed_and.json": "\"The Merchant and the Alchemist's Gate\" is a sci-fi piece by Ted Chiang\n[https://en.wikipedia.org/wiki/Ted_Chiang].\n\nI've always enjoyed Chiang's work but this is the first time I've come across\nthis particular story. It may be my favorite work from him to date. It made me\nfeel more human and alive,…",
  "data/reddit-books/r/books/comments/qtas3a/anna_karenina_damn.json": "Just finished part one, and don’t wish to have it spoiled but just need a place\nto let out what I feel so far. This is truly the greatest novel I have ever read\nand I’m glad I waited till now that I’m in my later 40s. I feel as though I can\nappreciate it more. I’m amazed at how Tolstoy is able to…",
  "data/reddit-books/r/books/comments/qtd1q3/just_finished_pet_sematary_for_the_first_time.json": "And what a roller coaster. I’ve seen the 80’s version a few times, so I new most\nof the big beats going in, but you know how things change when they get adapted\n(or are buried in tainted land). I was fascinated by the descriptions of the\npets not being quite right after they came back, and how…",
  "data/reddit-books/r/books/comments/qtetay/what_was_a_book_or_series_that_you_were_obsessed.json": "I hear a lot of times that a lot of readers were reading fanatics when they were\nyounger. Although I wasn’t much of a reader in elementary school (i simply did\nnot have the focus to finish a book), I was a reading fanatic in middle school.\nMy favorite series at that time was The Lunar Chronicles by…",
  "data/reddit-books/r/books/comments/qthdd8/is_it_weird_to_donate_books_to_the_library.json": "Most of my friends have collections of books they’ve read, or have a small\nlibrary in their homes. My family only ever buys books on holidays, so we get\n90% of our books from the library. When I am done with a book thats been\npurchased, and I don’t think il read it again, Il usually donate it or…",
  "data/reddit-books/r/books/comments/qti2gz/lord_of_the_flies_disturbed_me_as_much_as_it.json": "i had this book on my reading list for the longest time, so i finally caved in\nand bought the book around two weeks ago and i’ve finished it last night, and\nafter having organised my thoughts, i decided i want to discuss it.\n\ni’ve read many other books in the past year, covid made me retake the…",
  "data/reddit-books/r/books/comments/qtkg6o/finished_reading_life_of_pi_yesterday.json": "I loved it. I've never felt/thought such thing while reading a book, but I loved\nevery single sentence of it. By that I don't mean I loved the whole book as a\nwhole piece (but obviously I did), I mean I loved every single sentence of it,\none by one. Sometimes I read one sentence over and over again,…",
  "data/reddit-books/r/books/comments/qtlcd6/feeling_like_so_many_books_so_little_time.json": "I'm feeling like I'm running out of time to do things, especially read. There\nare like 8 books I want to read right this moment, but I know that if I do that,\nI won't be able to truly experience any of them. I'm feeling as if I should have\nthe wisdom of those books as soon as possible so that I can…",
  "data/reddit-books/r/books/comments/qtuhge/book_returned_to_the_library_43_years_overdue.json": "Book Returned to Montclair Public Library 43-Years Overdue\n[https://www.tapinto.net/towns/montclair/sections/arts-and-entertainment/articles/book-returned-to-montclair-public-library-43-years-overdue]\n\nBy NATALIE HEARD HACKETT\n\nPublishedNovember 8, 2021 at 1:02 AM\n\nLast UpdatedNovember 8, 2021 at…",
  "data/reddit-books/r/books/comments/qtweza/speaking_not_as_a_fan_ya_fantasy_covers_these.json": "I was bored so I actually ran though a sequence of Goodreads profiles and\ncomplied these covers [https://i.imgur.com/HDO2Rut.jpg] to make a point.\n\nI'm a grown man. I rarely read YA, I've read about 5 of these and enjoyed maybe\n2. But even the other ones just keep looking really enticing to…",
  "data/reddit-books/r/books/comments/qtxw86/why_didnt_ebooks_destroy_physical_copies_of_books.json": "On paper it seemed as if e books would have turned copies of physical books into\nthe next radio shack. I mean, you can ten books on you in a slim, portable,\nbacklit device. With real books the more you carry the heavier they are, you\nneed sufficient light and if you get too many you might have to…",
  "data/reddit-books/r/books/comments/qu395n/can_you_figure_out_and_then_there_were_none_by.json": "I haven't finished the book yet, and I have no idea who the murderer is. I like\nit enough to start over to try and work it out, but only if there are enough\nclues in the text.\n\nI've avoided reading anything about this book (I'm familiar with the trope/stock\nstoryline), so I'm not even fully certain…",
  "data/reddit-books/r/books/comments/qu6dl8/book_covers_are_important.json": "Looking through bookstores, I always hear my grandmother's voice in my head\nsaying, \"Don't judge a book by its cover. There could be much more to it.\" I\nlater realize that, while I love my grandmother, she was absolutely wrong in\nthis case. You should judge a book by its cover, but not because that…",
  "data/reddit-books/r/books/comments/quaeaj/just_finished_reading_the_martian.json": "Nothing too deep in this post but I thoroughly enjoyed it. There was a lot of\ntechnical writing in it but I think it added to the immersion of the story. And\nMark (main char.) was so easy going with everything and took his situation in\nstride. I won't spoil anything although I will put a tag just in…",
  "data/reddit-books/r/books/comments/qudz0u/anyone_else_find_themselves_not_enjoying_a_book.json": "I'm rereading the Anita Blake vampire hunter novels and I swear Anita is just a\nsad submissive simp with Stockholm syndrome.\n\nIt's not a reverse harem... I want my female characters to be very independent\nand strong willed if they are trying to protray a reverse harem... Not some sad\nchick who is…",
  "data/reddit-books/r/books/comments/quetzv/the_secret_history_by_donna_tartt_was_truly_an.json": "The book was about 600 pages long but I honestly did not want it to end! Donna\nTartt has such a way with words that her prose has left such a big impression on\nme. Even her describing foliage and environment was beautiful, like each word\nwas carefully picked to hold up a sentence. I completely get…",
  "data/reddit-books/r/books/comments/qugypy/im_crying_because_i_just_finished_the_shadow_of.json": "It wasn't that the ending was sad, I was just sad because I was saying goodbye\nto all the wonderful characters I got to know throughout this book (and yes I\nknow there's more books). Daniel, Fermin, Julian, Nuria, the watchmaker, the\nschool teacher, everyone...they all embodied such a strong and…",
  "data/reddit-books/r/books/comments/quh0uu/his_dark_materials_and_love.json": "I honestly feel like the His Dark Materials trilogy was the first work of art\nthat made me truly understand and feel romantic love. When I read it as a 12\nyear old boy the last volume introduced me to feelings that I had never felt\nbefore and that went much deeper than lust or infatuation. I…",
  "data/reddit-books/r/books/comments/qultoa/in_your_experience_has_reading_grown_your_general.json": "I was just thinking about this the other day. Because of the nature of reading\nyou both have to actively think \"this is the mountain region of this country\"\nbut you also passively imagine the area or have to passively keep the setting in\nmind. Setting is an easy one but even with vocabulary, each…",
  "data/reddit-books/r/books/comments/qus28w/landlines_and_payphones_historical_fiction.json": "I was recently listening to an audio recording of The Thanksgiving Day Murder by\nLee Harris. The book was published in 1995 and relies heavily on telephone\nlandlines, pay phones, and calling collect to advance the communication among\nthe characters.\n\nIt got me wondering: Does this constitute…",
  "data/reddit-books/r/books/comments/quu19t/the_wheel_of_time_takes_me_to_a_different_world.json": "I have been kind of down recently. A lot of things happening and I don’t know\nwhere I’m going with life. But I just recently started reading eye of the world\n(the first wheel of time book) and I have so much excitement to pick it back up\nevery time I have to put it down. I love books with lots of…",
  "data/reddit-books/r/books/comments/quyx0h/just_finished_the_wheel_of_time.json": "I can't believe it's over. Took me almost 2 years to read. On one hand, such an\nincredible series and on the other it was such a slog. I knew that if I started\nanother book I wouldn't get back into this one so I persevered and it was\ntotally worth it. The character arcs, the detail, it was all…",
  "data/reddit-books/r/books/comments/qv3yy1/whats_your_most_controversial_book_opinion.json": " 1. Dust covers are uncomfortable and stupid and should be tossed away.\n\n 2. The Catcher and the Rye is a good book and it's absurd how many people judge\n    it as pubescent cringe.\n\n 3. Audiobooks are fine and people who judge audiobook listeners suck.\n\n 4. Hard cover books are far inferior to…",
  "data/reddit-books/r/books/comments/qv9u66/i_feel_somewhat_ashamed_that_it_takes_me_forever.json": "I'm a really slow reader and it takes me multiple times to focus on lines\nbecause my mind wanders. I also don't really have a big vocabulary so I have to\nlook up words when I don't know them. I don't know why I'm really typing this\nbut I guess I just want to ask if it's normal to read at a slow…",
  "data/reddit-books/r/books/comments/qvabbk/the_vorkosigan_saga_what_incredible_main.json": "Just finished the first three books of the Vorkosigan Saga - what a ride! I wish\nsomeone had told me about them a long time ago, I don't think the series is\ngetting nearly the attention it deserves. At first blush they are breezy,\npage-turning, character-driven sci fi, but there is so much happening…",
  "data/reddit-books/r/books/comments/qvb5za/opening_paragraph_of_a_tale_of_two_cities_feels.json": "Below is the mentioned opening paragraph which says:\n\n\"It was the best of times, it was the worst of times, it was the age of wisdom,\nit was the age of foolishness, it was the epoch of belief, it was the epoch of\nincredulity, it was the season of Light, it was the season of Darkness, it was\nthe…",
  "data/reddit-books/r/books/comments/qvdpmh/andy_weir_who_wrote_the_martian_has_a_frustrating.json": "I’m reading Project Hail Mary because I love science and sci-fi, but it’s a\nstruggle to continue. Weir’s writing style is juvenile and painfully unfunny.\n\nSome examples from the first few pages:\n\n“You…be quiet.”\n\n“Okay. I think it’s time I took a long gosh-darned look at these screens!”\n\n“And that…",
  "data/reddit-books/r/books/comments/qvhybn/periods_in_childrens_books.json": "So I'm reading a series of kids books (everworld). They're probably around 15\nyears old and I would guess they're aimed at 13-14 y/o.\n\nFor reasons unimportant here 3 guys and 1 girls (aged 16-17) go through all the\ngear, items and equipment they have on them. One of the items mentioned is\ntampons. A…",
  "data/reddit-books/r/books/comments/qvoxgz/i_just_read_all_quiet_along_the_western_front_for.json": "It seems like it is a pretty standard part of school reading curriculums, but\nfor some reason it wasn’t a part of mine growing up. I decided I wanted a change\nof pace this summer and wow, I did not expect what I read.\n\nThe book itself is noticeably flat, but that’s not to say boring. Each…",
  "data/reddit-books/r/books/comments/qvsokd/the_lies_of_locke_lamora_really_blew_me_away.json": "As suggested, I finished The Lies of Locke Lamora today and really just want to\ntalk about it!\n\nFor me, it's one of the only fantasy books I've read where our central\ncharacters aren't magic users. Yeah, they use magic for their disguises and\nploys, but they themselves are just some ordinary…",
  "data/reddit-books/r/books/comments/qvydxa/exhalation_by_ted_chiang.json": "Exhalation is a collection of short stories but the titular short story it\ncontains \"Exhalation\" is a study in sheer, nihilistic beauty. It's like the\nelements of magical realism intersected with hard-core science mixed with\nexistentialism.\n\nAs I read this story, which was heavily centric on…",
  "data/reddit-books/r/books/comments/qw0ao9/asoiaf_a_cautionary_tale_of_getting_too_big.json": "There are many theories as to why GRRM hasn't published the 6th book in his epic\nseries from being lazy to having other projects but one I don't hear enough\nabout is that it might be impossible to actually finish. After book 3, when\nthere were still many plots and sub plots dangling, rather than…",
  "data/reddit-books/r/books/comments/qw2di0/any_books_you_put_down_because_you_were_too.json": "I just put down The Tattooist of Auschwitz, 70 pages in. I'm realizing I\nshouldn't even pick up books taking place in the holocaust. It could be a great\nbook but the holocaust just makes me too upset.\n\nI also put down The Color Purple earlier this year because I was disturbed by\nthe treatment.\n\nI…",
  "data/reddit-books/r/books/comments/qw64nr/i_just_finished_reading_a_thousand_splendid_suns.json": "I bought the book a year and a half ago but I never got around to reading it. I\nfinally decided to read it last night and I finished it in one sitting. I\nseriously think this book changed my life, like I can’t stop thinking about\nMariam and her story. I cried so hard by the end of the book and even…",
  "data/reddit-books/r/books/comments/qwd6hs/the_one_thing_no_one_mentions_when_the_topic_of.json": "So Im sure you all know that there has been a lot of talk about banning books\nand censoring books. It has gotten to the point where even bills are being\ndrafted right now to \"deal\" with this issue.\n\nHowever, i feel there is something a lot of people miss which is a lot of these\nbooks that get…",
  "data/reddit-books/r/books/comments/qwnc6d/favorite_philosophical_books_november_2021.json": "Welcome readers,\n\nToday is World Philosophy Day\n[https://www.philosophy-foundation.org/world-philosophy-day] and to celebrate\nwe're discussing our favorite philosophical books!\n\nIf you'd like to read our previous weekly discussions of fiction and nonfiction\nplease visit the suggested…",
  "data/reddit-books/r/books/comments/qwze0e/audiobooks_have_totally_brought_back_my_love_of.json": "I was one of those kids who loved reading growing up, specifically fantasy and\nsci fi, and then after high school pretty much stopped entirely, but this year\nin January I got super deep into warhammer 40k and found it has so much lore\nthat enthralled me to no end, and I as I happened to start a new…",
  "data/reddit-books/r/books/comments/qwzgmw/i_just_finished_reading_war_and_peace_tolstoy.json": "The way that the characters are written so deep and such a wonderful story with\na lot of good and bad moments.\n\nI felt that Pierre was almost my alter ego I never related so much to a\ncharacter like him. Sorry if I sound a bit too excited it's because this book is\nso good.\n\nIf you guys want to let's…",
  "data/reddit-books/r/books/comments/qx50re/how_confidentshy_are_you_with_the_books_you_read.json": "I’m fairly new to reading for fun (as an adult, I used to read all the time as a\nkid) and oftentimes have trouble opening up to others about what I’m reading. It\nmight be in part because most of my friends don’t read much, but I always feel\nshy about what I’m reading. Especially if it’s not…",
  "data/reddit-books/r/books/comments/qx7bbl/how_come_there_are_so_many_heist_movies_but_so.json": "I mean I know they're out there, but it doesnt seem like the genre is as robust\nas it is in film. Theres the Parker novels but those are from the 60s. With how\nmany books are detective mysteries, it seems it would be equally appealing for\nan author or reader to spin a web of complexities with a…",
  "data/reddit-books/r/books/comments/qxf4z6/but_the_series_gets_good_in_book_5_how_long_do.json": "So, I’ve read the first book in this series that’s been on my radar for a while.\nI hated it. Every word. As I finished each chapter, I wanted to tear the pages\nout and use it to wipe my butt. HATED it. I’m not going to name the series,\nbecause it’s not the point of this question; and, also, I’ve…",
  "data/reddit-books/r/books/comments/qxij7m/did_i_understand_kafka_wrong.json": "So I recently heard of Kafka and that he is supposed to be a literary genius or\nsomething, so I picked up a couple of his books, Metamorphasis, and the Trial.\n\nI read both and yes I think he is a genius.\nMy take on his stories was that it was a comedy, it was a comedy showing the\nabsurdity of human…",
  "data/reddit-books/r/books/comments/qxkl9l/wheel_of_time_today_is_the_day_no_spoilers.json": "I've been waiting for this since I was 15.\n\n\"The Wheel of Time turns and Ages come and go, leaving memories that become\nlegend.\"\n\nIt took 20+ years to get through the books and I'm so excited to get home\ntonight and watch this series that has been with me longer than almost all of my\nrelationships.…",
  "data/reddit-books/r/books/comments/qxmkym/just_finished_no_country_for_old_men_and_it_left.json": "who the fuck says \"sockfeet\"? I have never heard that expression in my life, and\nI'm no spring chicken, and it was used in that book 1/2 a dozen times. Do people\nsay that in Texas?\n\nAnyhow, that's not really a complaint, I liked the way it was written and found\nit to be really interesting and…",
  "data/reddit-books/r/books/comments/qxpy5z/will_smiths_will.json": "I never thought I'd read a book written by the Fresh Prince. \"Will\" is a very\nwell told celebrity coming of age story, it's probably the best autobiography\nI've read. I highly recommend the audio book, he narrates it himself and it's\none of the best produced titles that I have ever listened to. For…",
  "data/reddit-books/r/books/comments/qxs122/just_finished_reading_born_a_crime_and_thought_i.json": "What a Rollercoaster. I am a fan of emotional auto biography already. And this\nbook doesn't fail to deliver. Trevor noah talks about his early life. And It was\nquiet a read. I was hooked from the first few lines.\n\nI am lost for words as i JUST finished it like few minutes ago. And i still need\nto…",
  "data/reddit-books/r/books/comments/qxs69a/imagining_what_you_read.json": "Well I had this conversation with someone who doesn't read much and asked me\nwhat I liked so much about reading regarding it's only words and no image. Their\nargue was that movies provide you with the picture too. Then I told them that\nwhen I'm reading I actually \"see\" the picture in my mind and…",
  "data/reddit-books/r/books/comments/qxutkx/no_book_i_have_read_has_ever_managed_to_hit_me_as.json": "Wow. I consider myself pretty well read; I read all different genres and\nsubjects - but I have to say that this book tore me apart unlike any other.\n\nThe writing style is not incredibly elegant or complex, as Garth Stein seems to\nprefer simplicity, from what I can tell. But man, this book just hit…",
  "data/reddit-books/r/books/comments/qxy2rb/i_think_im_the_only_person_in_the_world_who.json": "I've never met anyone who agrees with me that Elizabeth Bennet is the worst.\nMaybe it's because I'm not a romantic person but I just HATE how Austen has\nframed it where Elizabeth's mother/ best friend are shallow in their pursuit of\nsecurity over romance and the only way to mark a \"good person\" is…",
  "data/reddit-books/r/books/comments/qxz6rr/lets_play_a_game_of_what_if_what_if_you_could_get.json": "I just saw on tv that there's a new remake of West Side Story coming out. This\ngot me thinking what if books also got the same treatment as movies did. What if\nevery 20-25 years a classic got rerelease but also rewritten by a different\nauthor? Would the new release be better? What changes would…",
  "data/reddit-books/r/books/comments/qy04px/your_next_3_books_on_your_to_read_list.json": "What are the next three books on your to read list? I’m interested to hear your\nanswers and maybe some of these books are actually on my list.\n\nThe first one for me is one of Us is lying by Karen McManus. On my huge list I\nhave a lot of murder mysteries and this is the first one I’m going to read.…",
  "data/reddit-books/r/books/comments/qy27a6/reading_several_books_at_once.json": "I read a lot everyday. Sometimes I am reading all day long. I always have\nseveral books on the go so, at any given time, I am reading between 2 and 5\nbooks. I read each for a few hours and then change to another one. I told one of\nmy friends and he was slightly offended. Like if I was bragging or…",
  "data/reddit-books/r/books/comments/qycypj/whats_your_favorite_standalone_scifi_novel.json": "I am thoroughly jealous of anyone who hasn’t read All Good Children by Dayna\nIngram.\n\nThe reveal totally sucker-punched me. I didn’t see it coming. When I read the\nbook again, I was still affected, albeit not as strongly. It is not a deus ex\nmachina twist and I still can’t see it coming even though…",
  "data/reddit-books/r/books/comments/qyklmt/im_totally_blind_and_one_of_my_favorite_authors.json": "Much to the bewilderment of other visually impaired people, I love to collect\nhardcovers of my favorite books. Something about being surrounded by the\ntangible evidence of the stories I love so much is beautiful and intoxicating,\nregardless of if I can read them that way.\n\nI bought a signed copy of…",
  "data/reddit-books/r/books/comments/qyo4we/i_just_finished_the_death_of_ivan_ilyich_and_it.json": "Holy shit downright the scariest story I've ever read! It's the second Tolstoy\nstory I've read after 'family happiness' and I'm amazed with how accurately and\nand realistically Tolstoy describes the human experience.\n\nAs someone who has high anxiety and is quite afraid of death combined with\nhaving…",
  "data/reddit-books/r/books/comments/qyuq29/what_books_are_you_the_most_thankful_to_have_read.json": "I could probably narrow it to just two or even one book, which is Infinite Jest\nby David Foster Wallace for the simple reason that I could’ve never recovered\nfrom addiction without it. When I first read it I was astonished by how much\nadvice it actually has on recovery, and the sections on suicide…",
  "data/reddit-books/r/books/comments/qyzfju/all_systems_red_by_martha_wells.json": "For months I’ve been perusing GoodReads in search of good sci fi books. Recently\nI got a library card and started using the Libby app. If you’re not doing this,\nyou should. I’ve found that about 80% of the audiobooks I want to listen to can\nbe rented there for free with a library card.\n\nThat being…",
  "data/reddit-books/r/books/comments/qz0ybm/finished_reading_fahrenheit_451_recently.json": "I didn't particularly \"love\" this book, but I did like it. A lot of the things\nwere really intriguing to me in the story. The part where Mildred is talking to\nher friends about how they just stick their children in front of the TV to avoid\ntrouble makes it hard to believe this was written back in…",
  "data/reddit-books/r/books/comments/qz42ns/a_little_life_is_probably_the_most_devastating.json": "As i neared the end of this book, I went on Google and searched \"saddest books\never\" and was not surprised to find      A Little Life in the first position of\nmultiple lists. Its such a heartbreaking novel.\n\nThe story follows four college classmates initially and later becomes the story\nof two.…",
  "data/reddit-books/r/books/comments/qz51xv/what_was_a_book_you_hated_but_could_not_stop.json": "I'm curious to see if anyone else had a book they really didn't like (if not\nstraight up hated) for one reason or another, but continued to read anyways. I\ncan be an incredibly picky reader and if I don't like something as vague as the\nwriting style of the author I will entirely forego reading a…",
  "data/reddit-books/r/books/comments/qz7joa/i_just_finished_sharp_objects_by_gillian_flynn.json": "tl;Dr - book was fucked in the best way possible. Subverts expectations without\nsacrificing anything important.\n\nOkay so a couple of things to mention before I rant. 1, I have no book friends\nfor the most part - at least none who've read this. And 2, read the book first\nand I'll probably check out…",
  "data/reddit-books/r/books/comments/qzkjm5/books_that_make_you_go_what_the_did_i_just_read.json": "I mean this in either a good or bad way. I just finished reading The Library at\nMount Char by Scott Hawkins (thanks to the readers of this sub recommending it).\nAnd I don't even know where to put it genre wise. Is it sci Fi? Is it urban\nfantasy? Is it both? It had me mentally exhausted, in a good…",
  "data/reddit-books/r/books/comments/qzkyc5/finished_the_dark_tower_book_2_and_you_were_all.json": "I posted last week about how I finished book one and was so confused. Most (if\nnot all) of you told me to keep going and it would get better, my questions\nwould be answered. You were right! The Drawing of the Three was soo much better.\nI sped through it. The only problem is I now have about a 6 week…",
  "data/reddit-books/r/books/comments/qznano/the_count_of_monte_cristo_left_a_sour_taste_in_my.json": "I’ll start by saying this is as that I really really enjoyed this book. I spent\nevery waking hour reading the book or listening to the audiobook while doing\nchores. To the point my arms were hurting from constantly holding the book.\n\nBut the last couple of chapters left me not liking the…",
  "data/reddit-books/r/books/comments/qzppmk/anyone_else_old_enough_to_remember.json": "... getting a hold of a really good book & then realizing from context clues\nthat it must be part of a series?\n\nSo, then you went to the library / bookstore / thrift store where you picked it\nup & you found all or some of the other books in the series. But, for some\nunfathomable reason, the…",
  "data/reddit-books/r/books/comments/qzq23z/frankenstein.json": "As a Father, I find the story of Frankenstein amazing! My interpretation is that\nof a young man caught up in passion creating life but neglecting it. Then facing\nthe horrible consequences of what his negligence created.\n\nDr. Frankenstein is a young man in college who created life. Much like…",
  "data/reddit-books/r/books/comments/qzw5o3/is_it_just_me_or_do_people_in_classic_literature.json": "I've read a lot of classics I'd say. I've noticed a lot of the books have people\nwho get sick a lot, or simply get sick from shock. A lot of the novels from the\n1800s seem like the characters go pale because of the slightest of problems\n(there are a lot of people going pale for all sorts of reasons,…",
  "data/reddit-books/r/books/comments/r031ri/a_confederacy_of_dunces_yay_or_nay.json": "I find this book completely enthralling from front to back. What are your\nthoughts on Ignatius and where do you think he would be in todays culture? I\nsuspect he would be bed ridden with fear of “big brother” and plotting a very\ncounter intuitive series of journals to keep himself protected until…",
  "data/reddit-books/r/books/comments/r0avoy/people_that_say_fantasy_isnt_real_literature_or.json": "I just got mad. I'm from Bulgaria, English isn't my main language so forgive me\nif I make mistakes. I was at work and I saw an opportunity to read. I was\nreading Malazan Book Of The Fallen by the brilliant Steven Erikson and a\ncolleague came and saw the fat book (Memories Of Ice, book 3 in the…",
  "data/reddit-books/r/books/comments/r0dgr7/brave_new_world_is_a_better_dystopian_novel_than.json": "edit: spoilers below\n\nI say this as someone who used to claim that 1984 is one of my favorite books.\n\nWhile I can't confidently say that BNW is a better written novel than 1984 (the\ncontroller's discussion at the end of the book is a little heavy handed), I\nthink it's a much better dystopian novel…",
  "data/reddit-books/r/books/comments/r0duwv/list_of_the_best_books_of_2021_lists.json": "Welcome readers,\n\nWe're coming up on the end of the year and that means various \"Best Books of\n2021\" lists are being released! We'll be using this thread to collect these\n\"Best of\" lists and awards into one place and will be updating it as more lists\nand awards are released. Without further ado,…",
  "data/reddit-books/r/books/comments/r0fw0k/what_is_a_weirdly_specific_book_themetrope_that.json": "TLDR: I have realized that I have really small weird specific book themes/tropes\nthat will automatically make me a give a book a try or put it down and I'm\ncurious if other people have them. If so, I'd love to know what they are!\n\nI haven't read a TJ Klune book yet (even though I own House in the…",
  "data/reddit-books/r/books/comments/r0us1e/world_war_z_is_an_amazing_book_and_i_dont_think.json": "This is my favorite book ever. The way it was written was so good and the\ninterview format was perfect. I was scared for a lot of the book and a few times\nI cried. The image of the battle of Yonkers will forever be in my brain. 10/10\n\nThe concept of the Quislings was really intriguing and I found…",
  "data/reddit-books/r/books/comments/r0xb2g/just_finished_the_dresden_files.json": "Honestly going into the series I wasn't expecting much, just hoping for good\nlittle detective adventure. I wasn't expecting for the series to top my personal\nlist.\n\n\n\nDresden is possibly one of the most relatable characters I've ever read. How the\nauthor laid out Dresden's thoughts, feelings, and…",
  "data/reddit-books/r/books/comments/r1a6pv/just_finished_the_bartimaeus_trilogy.json": "I loved the books cause it showed characters with flaws. Nathaniel was too brash\nand tried to be too clever. I love the world building cause I like reading about\nJinns, such an elusive race. Bartimaeus is a pretty good character and so is\nKitty Jones.\n\nIn all honesty, it would have been another list…",
  "data/reddit-books/r/books/comments/r1oaym/the_new_york_times_has_a_poll_up_for_the_best.json": "https://www.nytimes.com/interactive/2021/11/24/books/best-book-vote.html\n\nYou can vote for up to three books from their list of 25, which were selected\nfrom reader nominations. The 25 are:\n\n * 1984\n * All the Light We Cannot See\n * Beloved\n * Catch-22\n * The Catcher in the Rye\n * Charlotte's Web\n *…",
  "data/reddit-books/r/books/comments/r2jgw8/i_read_the_song_of_achilles_for_the_first_time.json": "It was incredibly emotional, detailed, and just so good. I’m not gonna lie, I\ncried at the end, just because the storytelling is so powerful at explaining the\ngrief, guilt and sadness that Patroclus has, and the pain that Achilles goes\nthrough. It so damn good. My experience was enhanced by…",
  "data/reddit-books/r/books/comments/r2mi0j/i_finished_reading_demons_by_dostoevsky_yesterday.json": "I really wanted the book to end by the time I was starting the third part. But\nafter a couple of chapters in, I really fell in love with the book once again.\nBut the last couple of chapters were really heartbreaking. I didn't realize that\nthe characters had become my friends and it would be this…",
  "data/reddit-books/r/books/comments/r2nuft/has_a_bad_book_ever_had_a_positive_impact_in_your.json": "I mean an objectively bad book: poorly written, with weak characters, bad plot,\netc. or a badly conceived non-fiction book that, for some reason, changed your\nlife in a positive way. In my case it was (supposedly) non-fiction: Chariots of\nthe Gods. I read it as a teenager and even at that time I…",
  "data/reddit-books/r/books/comments/r2othc/all_the_light_we_cannot_see.json": "Pulitzer Prize winner. I didn't think this one would appeal to me but I decided\nto give it a chance and I'm so glad I did. It takes place in the period of the\nrise of Hitler to the bitter defeat. Both at times darky disturbing and touching\ntracing a young German boy and a young French blind girl…",
  "data/reddit-books/r/books/comments/r2rsh2/books_from_your_youth_that_didnt_age_well.json": "I was having a discussion with some friends about how a lot of the books we read\nas teens or our early twenties just did not age well. It was interesting how we\neach had a book that we use to love and now looking back at it we don't know\nwhat the hell we were thinking.\n\nFor me it was the Perfect…",
  "data/reddit-books/r/books/comments/r2ve7d/i_finished_reading_james_clavells_shogun.json": "And it is one of the best novels I've ever read and probably the best in the\nhistorical fiction category. It might just be the best story ever told. Never\nbefore has a book gripped me this much. It contains all these devious,\nentertaining, bloodthirsty and incomprehensible and unpredictable…",
  "data/reddit-books/r/books/comments/r2vsq5/i_just_finished_project_hail_mary_by_andy_weir.json": "I haven't felt this ecstatic after reading a book since \"The Secret History\".\n\n3 days ago. I found a reddit link\n[https://www.penguinrandomhouse.com/the-read-down/the-best-books-of-2021/]\nleading to \"Penguin Random House\" 's list of 2021's best books. I had just\nfinished a few books and was looking…",
  "data/reddit-books/r/books/comments/r2z5ue/heroes_of_olympus.json": "I know everyone who likes mythology has probably heard of Percy Jackson but\nthere’s a continuation of the series called Heroes of Olympus that not as many\npeople seem to know about. I actually prefer this series to the Percy Jackson’s\nand want more people to know about it\n\nThe books still include…",
  "data/reddit-books/r/books/comments/r373vp/books_from_your_youth_that_did_age_well.json": "I saw a post about books from your youth that you reread and realized they\ndidn’t age well. On the flip side, what’s a book that you loved and read at a\nyoung age that you reread recently and still loved? I want to hear all about\nyour books that stood the test of time and were still just as good in…",
  "data/reddit-books/r/books/comments/r37hmf/what_is_the_most_difficult_book_you_have_ever_read.json": "I let you define difficult. For me, difficulty may concern the subject matter,\nword usage, complexity of a story...or never-ending sentences, as this example\nfrom Woolf's To the Lighthouse shows:\n\n\"She was now formidable to behold, and it was only in silence, looking up from\ntheir plates, after she…",
  "data/reddit-books/r/books/comments/r38amr/whats_one_book_or_series_you_can_read_endlessly.json": "I have a couple books that I can read over and over again, yet never get tired\nof. The Harry Potter series is one for me because the story is so wonderful and\nI always pick up on new things and hidden references. Plus, it’s kind of\nnostalgic.\n\nThe Virgin Suicides is another one. I adore how the book…",
  "data/reddit-books/r/books/comments/r3as2r/carl_sagans_cosmos_was_an_awesome_read.json": "Finished it 20 mins ago... Well, it was an awesome listen, the narrator was\noutstanding in the majority of the book because of how much enthusiasm and\nexcitement is conveyed.\n\nAlthough, the last chapter is what got me especially with how much self-conflict\nI've been going through. I doubt a lot of…",
  "data/reddit-books/r/books/comments/r3f7wq/how_to_read_poetry.json": "I'm uninitiated, but I assume that a poetry book can't be tackled like a regular\nbook, or is it?\n\nI don't think I would enjoy the book if I had to read the same page over and\nover again without a specific strategy. What kind of method do you use, or with\nyour experience, what works best to extract…",
  "data/reddit-books/r/books/comments/r3g955/the_seven_husbands_of_evelyne_hugo.json": "This book was BRILLIANT. I really loved Evelyne as a character and it was\nfascinating to read about her life. She was so real, like a friend. It’s the\nkind of story that sticks with you for weeks after you’ve read it. The author\nreally did it! Have you read it? Are you planning to? What did you…",
  "data/reddit-books/r/books/comments/r3hmr3/favorite_novel_written_by_a_poet.json": "I've read On Earth We're Briefly Gorgeous by Ocean Vuong, and since then I have\nbecome amazed by the prose poets are able to write. The way they convey their\nthoughts and feelings is, to me, out of this world. Don't mind me, I love\npoetry, but seeing these artists take on a novel length project…",
  "data/reddit-books/r/books/comments/r3kash/what_book_had_you_changing_your_real_life_habits.json": "I'm rereading The Expanse series. The loving descriptions of large amounts of\ncoffee consumed by the crew have this espresso shooter craving big, steaming\ncups. I may not have a spaceship or deadly missions on the edge of what's known,\nbut I can sip for a while and ponder the universe. How about…",
  "data/reddit-books/r/books/comments/r3kzfx/the_xeelee_sequence_helped_me_enjoy_reading_again.json": "Over the past year (probably longer), I've been struggling with depression and\nenjoying a lot of things I previously enjoyed. Video games, movies, music,\nreading. I was getting back into reading after getting my kindle around 2 years\nago and was able to read some older sci-fi I enjoyed, and new…",
  "data/reddit-books/r/books/comments/r3ppo7/if_youve_never_read_gene_wolfe_you_should_give.json": "He's arguably one of, if not the best science fiction writer/s. He also does\nabsolutely fantastic fantasy as well. He's got a very dense style that can be\ndifficult to get into, and his books are meant as rereads. Give them a try\nthough, you won't regret it.\n\nHis work on The Book of the new sun…",
  "data/reddit-books/r/books/comments/r3qavl/kindred_film_adaptation.json": "A few months back, I read Kindred by Octavia E. Butler. I first picked it up\nbecause I was intrigued by the time travel aspect. As I read it, it definitely\ngot me thinking about aspects of racism and slavery that I never considered\nbefore.\n\nI really wonder why this hasn't been adapted into a film…",
  "data/reddit-books/r/books/comments/r42lll/do_you_find_it_hard_to_understand.json": "The thought just hit me that I'm probably impaired in this regard, for lack of a\nkinder word. Whenever a book starts going into describing how a city is\nstructured, to the left of the church is a river that runs through x y and z. On\nthe other side is a hill that towers over... And etc and etc. I…",
  "data/reddit-books/r/books/comments/r44d3o/do_you_try_to_figure_out_the_ending_of_the_book.json": "I am often blindsided by twist endings in books. So often, especially with\npopular books, people ask \"oh, did you figure out the twist?\" and almost always,\nI did not. The thing is, unless it's a legit \"whodunit\" type mystery (ie, The\nHunting Party), I don't even really try. Literally three times…",
  "data/reddit-books/r/books/comments/r45gbm/just_finished_reading_in_cold_blood_by_truman.json": "So, I’m in shock. This was a rough experience. It was the first true crime book\nthat I’ve read, but I was totally immersed in the story. Yes, the whole thing is\ndistressing and unpleasant, but following the story from so many different\nangles is an interesting reading experience. There’s no way to…",
  "data/reddit-books/r/books/comments/r46iml/foundation_is_the_first_book_ive_read_in_almost.json": "Back when I was in jr high, I used to read a lot of books. Mostly Science\nFiction and some random Stephen King. But sometime during high school I got out\nof the habit, and literally haven't read an actual book since then. Got into\ncomputers and programming in college, so I ended up filing my free…",
  "data/reddit-books/r/books/comments/r4aye4/i_just_finished_murder_on_the_orient_express_is.json": "As audiobooks have allowed me to greatly increase the number of books I consume,\nI've been branching out into new areas and a gave Murder On The Orient Express a\ntry. I didn't love the narrator but I can get past that and enjoy the story for\nit's merits.\n\nThe set up was good and the ending was…",
  "data/reddit-books/r/books/comments/r4ellv/just_finished_reading_this_is_how_you_lose_the.json": "just WOW what a good read. Reasonably short but absolutely full to the brim with\nstory, the descriptions were intricate and poetic, the letters were so fun it\nwas really like reading correspondence between two soldiers/lovers, I've never\nbeen one for time travel story with how confusing things can…",
  "data/reddit-books/r/books/comments/r4lnbq/just_finished_mexican_gothic_and_ive_never_loved.json": "I just wanted to gush a bit. The writing is beautiful, the characters are\namazing, and the ending was satisfying. I can count on one hand how many times\nI’ve read a book that left me satisfied on the last page. I love the sweet blend\nof fantasy and realism and man oh man the suspense!! I was on the…",
  "data/reddit-books/r/books/comments/r4ns2v/what_word_do_you_personally_use_for_getting_a.json": "This sounds weird, but online I keep seeing people say that they “rented” a book\nfrom the library, and this feels weird to me. I’d usually say “borrowed” or\nmaybe “checked out.” In my mind renting implies payment, but I think more so\nit’s just weird because I feel like I’ve never heard “rented” used…",
  "data/reddit-books/r/books/comments/r4qqak/why_have_i_just_discovered_the_libby_app.json": "Let me tell you, the Libby app has been a total game changer for me! But perhaps\nmaybe I am just late to the game!\n\nBefore moving overseas, I was always at the library borrowing books, I could go\nthrough multiple books a week. Once I moved, books, especially English ones are\njust not as available,…",
  "data/reddit-books/r/books/comments/r4y0pb/a_note_of_appreciation_for_charles_dickens.json": "Tl;dr Charles Dickens made me smart\n\nEver since David Copperfield was assigned as reading in my first year of high\nschool, I have devoured his works and revisited them on an annual basis.\n\nHis style of writing has elevated my language, speech, and vocabulary to such\ndegrees that colleagues and…",
  "data/reddit-books/r/books/comments/r513zy/does_goodreads_provide_any_value_to_you.json": "As a user of Goodreads for years, I have very mixed feelings on the platform. It\nshould be a goldmine of information (millions of ratings and reviews, book\nrecommendations, interactions with authors), but I often find it underwhelming\nin practice.\n\nA few things that stand out to me:\n\nMost books have…",
  "data/reddit-books/r/books/comments/r513zz/instances_in_your_life_where_you_mispronounced_a.json": "I want y'all to tell me a situation where you said a word out loud and learned\nlater (or immediately, to your embarrassment, if someone corrected you on the\nspot) that it is actually pronounced differently. And of course you must have\nlearned this word from a book.\n\nI'll start: So back when I was…",
  "data/reddit-books/r/books/comments/r52rhw/danny_trejos_autobiography_trejo_is_amazing.json": "Just listened to the audio version of Danny Trejo's autobiography \"Trejo\". He\nself narrates the audio book which is really cool. He's not the greatest\nnarrator, but one you get used to the way he talks, it's overall better that\nhe's telling his own story.\n\nHe lived a crazy violent life in the…",
  "data/reddit-books/r/books/comments/r54uwy/the_wheel_of_time_series_has_made_me_mad_no.json": "So I watched Wheel of Time on Amazon and I was hooked immediately. Then Amazon\nhad 50% off the collected box sets this weekend and I bought all of them for\nsuper cheap.\n\nI started reading it last night and before I knew it I was at page 178. I\ncouldn't put it down. And this is just me reading what…",
  "data/reddit-books/r/books/comments/r59ca6/the_giver_is_a_great_book_it_should_never_be_seen.json": "The Giver is an excellent book and yes, while I was introduced to it as a child\nand its perfectly acceptable book for kids to read, the messages and lessons in\nthe book go far beyond that of a child or teenager will understand.\n\nLooking back it is a profound book that should be read and understood…",
  "data/reddit-books/r/booksuggestions/comments/qjqkp6/suggestions_for_beginner_adult_readers.json": "My mom has been wanting to get into reading. She has been asking for\nrecommendations, and as she is in her late forties and I’m in my teens I don’t\nknow what to suggest to her. She has tried Wuthering Heights and it is obvious\nthat books with older language are not her forte. She has a shorter…",
  "data/reddit-books/r/booksuggestions/comments/qjyujd/any_fantasy_or_horror_novels_inspired_by_native.json": "I don’t know much about it, but the little that comes up in other books/movies\ndescribing different Native American mythology or some spiritual beliefs seems\nlike it could be an intriguing concept for a fantasy and/or horror novel.",
  "data/reddit-books/r/booksuggestions/comments/qk21yo/books_for_kind_people_who_finally_use_their_rage.json": "Hello guys! So I’ve read a lot of recs here but it seems I haven’t found\nanything like that. If I’ve missed it, I’d be grateful for a link. My greatest\nmistake is that I’m too kind, like, your hyperbolized kind and trusting girl\ntrope, and that’s the reason I’ve been facing a lot of problems in the…",
  "data/reddit-books/r/booksuggestions/comments/qkbgkb/books_that_feel_like_a_dnd_game.json": "Title",
  "data/reddit-books/r/booksuggestions/comments/qkj294/something_like_nickel_dimed_except_about_the.json": "There's a post on r/Cooking [/r/Cooking] about providing food for the homeless\n(on the OP's own - not with an organization). Excellent points were made about\nnot giving foods that create garbage (chicken bones) or that are too hard to eat\n(crunchy granola bars) because dental issues/tooth loss is…",
  "data/reddit-books/r/booksuggestions/comments/qkqfx1/books_about_poor_whites_similar_to_hillbilly_elegy.json": "Looking for books somewhat similar to Hillbilly elegy. Doesn’t have to be about\nhill/mountain culture but about “white trash/rednecks”, drug\naddiction/alcoholism, and the mind set of the culture.\n\nAnything?",
  "data/reddit-books/r/booksuggestions/comments/ql0ldp/books_on_obsession_heartache_and_identity.json": "Last year, I read When Nietzsche Wept by Irvin Yalom, and it helped me get\nthrough a low point in my life. It’s a wonderful book, weaving elements of\npsychology with history and fictional narrative - you feel you live and learn\nwith the characters.\n\nIm going through something like a breakup but not…",
  "data/reddit-books/r/booksuggestions/comments/qlbh2v/native_american_influenced_fantasy_novels.json": "I love fantasy, and while I love the stereotypical castles and swords, I’m\ncurious to see if there’s anything that would reflect influences from my\nculture. I’m Muskogee Creek, but I’d love a book from any tribe! I’m looking for\nYA but I’m open to adult fiction.",
  "data/reddit-books/r/booksuggestions/comments/qloskf/books_about_sex_positivityintimacy.json": "Title pretty much speaks for itself.\n\nI grew up in a pretty conservative household and spent all of grade and high\nschool in Catholic school. My parents didn’t really talk about it or give me\n“the talk”, and given that I’m a pretty anxious person I typically shied away\nwhen my friends made any…",
  "data/reddit-books/r/booksuggestions/comments/qlu6jo/a_book_about_a_person_who_is_not_taking_action.json": "Any suggestions are welcome, basically I am looking for a book where main\nprotagonist is afraid to make a move and change up his life, something along\nthese lines, doesn't have to be exact.\n\nThanks for any suggestions !",
  "data/reddit-books/r/booksuggestions/comments/qm65d1/suggestions_for_good_erotic_books.json": "Hey everyone! I'm looking for an erotic book to read with my SO.\n\nI'll just make a wishlist of things we'd like in a book, hopefully someone knows\nof a book that hits most of them:\n\n * Have a genuinely good plot, with well written, relatable characters!\n * Have some pretty hardcore and explicit…",
  "data/reddit-books/r/booksuggestions/comments/qm8111/cozy_novels.json": "I’ve been reading (well, listening actually) to a lot of thrillers lately and\nI’m looking for a palette cleanser. I’d like something cozy and happy and light.\nI love Jenny Colgan’s novels (found them through this sub). And I also like Mary\nKay Andrews books. So, something similar. Not necessarily…",
  "data/reddit-books/r/booksuggestions/comments/qmi8wx/books_with_short_stories_about_scary_cultural.json": "Especially interested in cultures of Japan, Native America and Australia\n\ntia, legends.",
  "data/reddit-books/r/booksuggestions/comments/qmsl6r/any_books_with_beautiful_writing_slightly_boring.json": "title is vague and weird, but i’m looking for some books for my 60 year old dad\nfor his birthday. he likes things that are more slow paced and isn’t into dark\ntopics (generally).\n\nhe LOVES history, so any historical fiction is a plus. if anyone has nonfiction\nrecs, those are welcome too! generally…",
  "data/reddit-books/r/booksuggestions/comments/qn95tc/lovecraftian_books_with_a_mystery_and_not_gory.json": "I am looking for books which are closer to Lovecrafts original works. About\npeople discovering some ancient horror. Most of the books I read however had an\nemphasis on gore aspects, but I want a book with mystery/adventure.\n\n\n\nThanks in advance!",
  "data/reddit-books/r/booksuggestions/comments/qnp0v6/jonathan_strange_and_mr_norell.json": "Susanna Clarke's book Jonathan strange and Mr. Norell, A fiction book about\nEnglish magicians in the 1800s. 782 pages. A show was made based off of the book\nwith the same title. The book is well worth reading and the show is well worth\nwatching, however I would suggest reading the book before…",
  "data/reddit-books/r/booksuggestions/comments/qo2q06/any_fantasy_that_resembles_the_tone_of_the_film.json": "This has become one of my favorite films of all time. And I've read a modest\namount of fantasy in the past. Is there anything out there that resembles the\ntone of this film? Magical, but dark. A protagonist searching for virtue and\nhonor and failing at every turn, etc.",
  "data/reddit-books/r/booksuggestions/comments/qobn5s/books_that_take_place_in_a_small_town.json": "Looking for good books where a small town is a big part of the story, almost\nlike another character. Genre doesn’t matter, any good reads???",
  "data/reddit-books/r/booksuggestions/comments/qoove9/books_about_people_with_special_powers.json": "Not the magical fantasy type though. The super power type. I know this also know\nthis sounds cliche, but I also like the plot where there is one person who is\nmore special than everyone else for some reason (like they might have more\npowerful abilities, or someone is hunting them for some reason, or…",
  "data/reddit-books/r/booksuggestions/comments/qoqn00/studies_on_modern_masculine_behavioral_psychology.json": "I was on r/AskMen [/r/AskMen] this morning reading a post about male stereotypes\npeople feel are untrue and found it very interesting.\n\nAs someone who’s currently in therapy dealing the the repercussions of certain\nmasculine stereotypes being forced at a young age, I’d be interested in finding\na…",
  "data/reddit-books/r/booksuggestions/comments/qov52q/is_dune_as_great_as_ive_heard.json": "The movie just came out. Part of me wants to wait until I have read the book. I\nknow the Frank Herbert novel is often considered one of the best science fiction\nbooks of all-time. But I have also heard some mixed opinions about it.\n\nEDIT: To be specific, I only mean the first book.",
  "data/reddit-books/r/booksuggestions/comments/qovrsg/romances_like_outlander.json": "I've recently been hard core binging the outlander series, and I'm looking for\nother romances that are similar in style. Basically that it's got a plot beyond\nthe steamy stuff, and that the steamy sections are as well-written as the rest\nof the book. It's real frustrating to be into a romantic/sexy…",
  "data/reddit-books/r/booksuggestions/comments/qp552p/feeling_too_stupid_to_understand_complicated_but.json": "A little background. A while ago, someone posted here asking for advice on how\nto combat his ignorance through reading. There was comment that really struck a\nchord with me and inspired me to start reading to increase my understanding of\nthe world and also to value books beyond just for being…",
  "data/reddit-books/r/booksuggestions/comments/qpkb18/book_like_true_detective_season_1.json": "Hi guys, I'm looking for a book with a detective/macabre crime theme that also\ndeals with reality and deep philosophical insights into Nietzsche and Marquis de\nSade and toxic masculinity. I really liked this show but have never read\nanything like this. Love the HP Lovecraft influence while still…",
  "data/reddit-books/r/booksuggestions/comments/qq09jf/book_suggestion_for_those_who_experienced_trauma.json": "I've been trying to look for a book that would at least help me heal.\n\nThank you.",
  "data/reddit-books/r/booksuggestions/comments/qqcadh/suggest_me_some_of_your_favourite_books_not_set.json": "As an Asian, I want to read some books not set in Western countries. Some of\nsuch books I really liked,\n\n * Shogun by James Clavell (Set in Japan and one of my favourite books ever)\n\n * Tai Pan also by James Clavell (Hong-Kong)\n\n * A Gentleman in Moscow by Amor Towles (I know Russia is considered to…",
  "data/reddit-books/r/booksuggestions/comments/qqtk1k/heartwarming_whimsical_books_like_the_house_in.json": "Just not in the mood for anything dark or edgy right now.\n\nEdit: My grandma passed away and I just want a warm hug of a book to distract me\nwhile I travel to the funeral.",
  "data/reddit-books/r/booksuggestions/comments/qr9mwe/books_that_get_more_insane_as_they_go.json": "Hello,\n\nI'm looking for books that start out normal, and slowly get completely nuts by\nthe end like House of Leaves by Mark Z. Danielewski and Fanged Noumena by Nick\nLand. Bonus points if the text itself becomes incoherent!",
  "data/reddit-books/r/booksuggestions/comments/qrlgbb/looking_for_korean_books_translated_to_english.json": "I've always loved how K-dramas present romance and the way that many of them\nseamlessly blend elements of fantasy into their modern world, some of my\nfavorites are Goblin: The Lonely and Great God, Strong Woman Do Bong-Soon, Drama\nworld, and Black. I would love any recommendations!",
  "data/reddit-books/r/booksuggestions/comments/qrtiwx/a_book_like_lost_but_in_good_d.json": "I liked Lost, I liked everything about it besides the damn end. Are there any\nREALLY good books similar to Lost out there? Thanks!\n\n(I don't care if it's Horror, Thriller or Mystery)\n\nEDIT: I meant literally the lost on an island with mystery things going on part\n:D",
  "data/reddit-books/r/booksuggestions/comments/qrz9hy/your_favorite_reads_of_2021.json": "Suggest me some of your favorite reads of 2021! Some of mine have been Project\nHail Mary and Piranesi",
  "data/reddit-books/r/booksuggestions/comments/qs9k6e/the_best_books_for_any_historical_period_that_are.json": "I didn’t like history very much when I was younger. But I have recently\ndiscovered I enjoy it a lot when it’s narrated as a novel and I’m looking for\nsuggestions.\n\nPS: preferably not English history, I already have lots of suggestions on that\ntopic.",
  "data/reddit-books/r/booksuggestions/comments/qsgait/i_have_three_audible_credits_at_the_end_of_the.json": "I could be in the mood for a good adventure, mystery, sci-fi, or mythology type\ngenre.\n\nOr leadership, how-to, history, outdoors, various world views…you get the\npicture. Pretty much anything?",
  "data/reddit-books/r/booksuggestions/comments/qt0nge/books_where_not_everything_is_as_it_seems_like.json": "I'm currently reading Time Out of Joint and really enjoying it. It also reminds\nme a lot of the film the Truman Show, and parts of WandaVision where there's\nstrange things happening and the characters are slowly being suspicious of their\nreality.\n\nLooking for similar books, bonus points if it's…",
  "data/reddit-books/r/booksuggestions/comments/qta3sd/please_recommend_some_books_for_my_dad_who_just.json": "Hey Fellow Bookworms,\n\nI’m here for a specific request today. I’m a college student. It’s my dad’s\nbirthday and he LOVES reading. He was a stay-at-home dad and he was just\nabsolutely wonderful. When I was a kid, he would go out of his way to get me any\nbook I asked for and he would always read to me…",
  "data/reddit-books/r/booksuggestions/comments/qtqbha/i_wish_netflixs_dark_was_based_on_a_book.json": "Such a great mind bender. Have you read anything that reminds you of this show?",
  "data/reddit-books/r/booksuggestions/comments/quh1n3/suggest_me_a_book_with_the_greatest_opening_lines.json": "\"The man in black fled across the desert, and the gunslinger followed.\"",
  "data/reddit-books/r/booksuggestions/comments/qv1md0/a_book_for_a_11year_old_girl_something_that_might.json": "As in title, thanks!",
  "data/reddit-books/r/booksuggestions/comments/qv3vzv/most_terrifying_book_youve_ever_read.json": "Yeah, so as the title says, I want something absolutely terrifying but not in a\ncheap horror sense. A book that made your blood freeze, remained in the back of\nyour mind and didn't let you sleep at night. Horror, thriller, psychology,\nwhatever you've got.",
  "data/reddit-books/r/booksuggestions/comments/qvczym/wanted_a_fantasy_novel_that_is_stand_alone_not_a.json": "I run a book club and I’d love to find a fantasy novel that is not the first\ninstalment of 3 or more books in a series. Is there such a thing for fantasy\nnovels anymore?? Help!!",
  "data/reddit-books/r/booksuggestions/comments/qvo358/science_fiction_or_fantasy_books_for_me_9f.json": "My dad is letting me use his phone for this. He is being annoying about it but\nhe said that you would have good ideas.\n\nI liked Hitchhiker’s Guide To The Galaxy, Fortunately the Milk, The Machine\nStops, Interview With The Robot, the Discworld for Kids series, Norse Mythology\nby Neil Gayman, the…",
  "data/reddit-books/r/booksuggestions/comments/qwd1sh/page_turners_that_arent_thrillers_crime.json": "I've been reading a lot of books like Sharp Objects, Silent Patient, The Woman\nin the Window, etc and while I love that genre, i'm looking to venture out into\nother page turners of different genres. I can get bored easily if the plot isn't\nengaging / making me wonder what's about to happen.\n\nI…",
  "data/reddit-books/r/booksuggestions/comments/qwq7g4/netflix_shows_with_accompanying_books.json": "Hi everyone - broad request - recently I bought the book of a film I saw on\nNetflix. I’m wondering if anyone has any book recommendations which tie in with\nany other films or series on UK Netflix. All fiction genres welcome. Thanks in\nadvance!",
  "data/reddit-books/r/booksuggestions/comments/qwx2h3/just_got_tested_positive_im_stuck_at_my_parents.json": "I usually don't have the time to get through long books, so I thought I'd make\nuse of quarantine to read one. So I'm looking for books that will take me a week\nto get through, but will be worth the effort.",
  "data/reddit-books/r/booksuggestions/comments/qx2bd1/whats_the_best_book_series_youve_read.json": "What’s the best book series that you’ve ever read in your life? And I’m talking\nabout the best characters,the best plot,best romance,etc.",
  "data/reddit-books/r/booksuggestions/comments/qxchxo/lesbians_with_no_homophobia.json": "Looking for a book with a lesbian romance (ideally not very steamy, not looking\nfor erotica. Kind of along the lines of PG-13 sex can happen but I just don’t\nwant a huge explicit detailed account of sexy bits because I tend to read while\non the go and it creeps me out reading full on erotica in…",
  "data/reddit-books/r/booksuggestions/comments/qxizwu/nonya_fantasy_with_a_good_romantic_subplot.json": "Something recently published would be preferred. Female lead or at least\nprominent female character is preferred.\n\nI love everything Naomi Novik has written, I love Six of Crows by Leigh Bardugo\n(which honestly could have been marketed as an adult novel), Brandon Sanderson,\nHolly Black, Neil Gaiman,…",
  "data/reddit-books/r/booksuggestions/comments/qxmb2c/just_read_midnight_library.json": "…and really loved it. Any recommendations for similar books?",
  "data/reddit-books/r/booksuggestions/comments/qy4d84/suggest_me_any_vampire_novels_except_twilight.json": "Nothing wrong with Twilight, it's just that I already know about it so it would\nbe pointless suggesting it to me.\n\nI'm planning to write a vampire series for my Wattpad so I'm doing a little\nresearch.\n\nI'm looking for some good vampire novels, especially novels that really expand\non the vampire lore…",
  "data/reddit-books/r/booksuggestions/comments/qy75rq/i_am_scared_of_losing_my_parents_what_to_read.json": "I am scared of losing my parents, especially my mom. When I think about it, I\nstart feeling very sad and alone. I know that everyone dies at some point, but\nsometimes it's hard to accept the reality. I already lost my elder sister a\ndecade ago. Still, I miss her a lot. I know the pain of losing…",
  "data/reddit-books/r/booksuggestions/comments/qycwtc/trying_to_find_books_to_expand_my_knowledge_and.json": "Im 14 years old so i dont know a lot yet and i might have a hard time\nunderstanding hard books. Im intrested in things such as the universe natural\nscience. Philosophy. I dont know where to get started with books on any of these\nsubject. Can someone suggest me what to read first about the universe…",
  "data/reddit-books/r/booksuggestions/comments/qyu0n3/im_almost_23_college_going_student_ive_been.json": "Any book recommendations to help me start feeling more positive and make a\nchange in my routine and also to decide what i want to do in life and what\ncareer i should pursue in order to become happy and successful( you can also\nsuggest any books other than this that you think i should read) Thank you",
  "data/reddit-books/r/booksuggestions/comments/qz58iv/books_like_percy_jackson.json": "Hi everyone, My husband and I have a Christmas tradition where we give each\nother new pajamas and a book on Christmas Eve and spend the evening reading. I’m\nat a loss for what book to get him. He loves YA, especially Percy Jackson. He’s\nread pretty much everything Riordan has ever written. He’s also…",
  "data/reddit-books/r/booksuggestions/comments/qzizpb/writers_like_roald_dahls_adult_stories.json": "The way Roald Dahl paints a full story, with clever twists and interesting\ncharacters in just a few pages is honestly a talent very few writers have. I was\nwondering what some of your favourite writers are that possess that same\nability. Any suggestions?",
  "data/reddit-books/r/booksuggestions/comments/r00jf1/just_finished_dune_and_i_need_a_new_book_please.json": "Hey guys, I just finished Dune and I liked it a lot. Do I continue the dune\nuniverse or do you guys have any other suggestions for me. I'm big into sci-fi\nand fantasy novels. There's just so much to choose from.\n\nEdit: I’m really appreciating this guys . Keep em coming!",
  "data/reddit-books/r/booksuggestions/comments/r08h3h/horror_books_with_a_vampire_villain.json": "I really like vampire books, but the ones I've read in the past treated vampires\nlike weird members of society and not like actual monsters. Then I read The\nSouthern Book Club's Guide To Slaying Vampires and it was like the clouds\ncleared and the sun shined down on me as the idea that vampires could…",
  "data/reddit-books/r/booksuggestions/comments/r0b2kg/books_that_gets_you_hooked_right_from_the_start.json": "Hey all, I am in a kind of a reading slump, not able to go past the first page\nof any of my TBR books. So was hoping you guys can help out.\n\nAny genre welcome. TIA",
  "data/reddit-books/r/booksuggestions/comments/r0iena/books_by_korean_or_japanese_women.json": "I am looking for something about social issues in the countries, especially\nabout the role of women",
  "data/reddit-books/r/booksuggestions/comments/r0mix3/a_comingofage_novel_that_doesnt_involve_romance.json": "Catcher in The Rye, To Kill A Mocking Bird, What's Eating Gilbert Grape?, The\nHate You Give are some titles I enjoy.",
  "data/reddit-books/r/booksuggestions/comments/r11b7p/i_just_got_an_interview_for_my_first_ever_job.json": "It feels like I am not yet ready, and I am really scared. Its making me\nanxiousss.\n\nPlease suggest a book that can make me confident, ready to take action,\norganized, and proper really fast huhu",
  "data/reddit-books/r/booksuggestions/comments/r1ck1f/looking_for_something_by_kurt_vonnegut.json": "I haven't read anything by him so please recommend me something for a first\ntimer like me. Thank you!",
  "data/reddit-books/r/booksuggestions/comments/r1h1xb/scifi_books_with_a_well_developed_romantic_subplot.json": "Just looking for a sci-fi book, preferably with a male main character, and a\nwell developed romance that ties into the main plot but doesn’t overwhelm it. I\nfeel a lot of books neglect romance for the central plot and vice versa so I’m\nlooking for something with a healthy balance of each.",
  "data/reddit-books/r/booksuggestions/comments/r206t0/should_i_read_dune.json": "Ok, so I recently watched the movie and I quite liked it. I know the book series\nis huge, and I've never really read any book series before, so that's something\nto take into consideration.\n\nTo help with the suggestions, my favorite books are Steppenwolf, One Hundred\nYears of Solitude and the…",
  "data/reddit-books/r/booksuggestions/comments/r2g8bw/what_are_your_top_3_books_youd_reread_before_you.json": "Hi ppl!\n\nWhat are your TOP 3 books you would like to re read before you die?\n\nI've never really been a reader in my life but I want to change that.\n\nCould you recommend anything awesome?\n\nanything is fine! any genre!",
  "data/reddit-books/r/booksuggestions/comments/r2xaek/should_i_read_lord_of_the_rings_if_ive_seen_the.json": "I know the movies pretty well. Being that they’re so long I can’t decide if\nknowing what will happen next will taint the reading experience.",
  "data/reddit-books/r/booksuggestions/comments/r3cyg1/in_need_of_some_philosophy_books_16m.json": "Good morning everyone,\n\nI'm getting interested in philosophy and I'd like some books to start. Since I'm\nquite young I'd start with some easy books, but I don't mean high school books,\neven some university ones would be good to start.\n\nI spend almost all my free time thinking (also OVERthinking) so…",
  "data/reddit-books/r/booksuggestions/comments/r3qowk/advice_for_becoming_an_adult.json": "Look, I’m 24 years old and I pretty much think I have problems with ,growing\nold’ and would like to read a book which gives me advice how to handle that time\nbetween childhood and adulthood. Like for example preparing me, that my parents\nwill actually die in a couple of years. Or giving me advice,…",
  "data/reddit-books/r/booksuggestions/comments/r41dab/what_are_some_good_books_about_assassins.json": "Ive been meaning to read something related to assassins, but im unsure what’s\ngood and what’s not. (Action/Fantasy whatever comes up)",
  "data/reddit-books/r/booksuggestions/comments/r4dszc/a_fantasy_book_that_isnt_set_in_a_medieval_world.json": "Bonus points if it portrays late 90s/early 2000s.",
  "data/reddit-books/r/booksuggestions/comments/r4vmhc/books_about_a_mans_perspective_of_divorce.json": "My wife and I got married young, and over time we have grown apart as people\nquite a bit. I love her very much and accepted the differences between us but\nshe doesn't love me anymore, and is no longer happy, so we're splitting up. I've\nmoved out already. The whole thing is very sad for me but we are…",
  "data/reddit-books/r/booksuggestions/comments/r4xyn8/help_me_name_my_kitten.json": "Sorry this isn’t a book suggestion, but I thought it’d be kinda fun - I have a\ntradition of giving my pets punny writer names. Currently I have F. Scott\nFishgerald and Margaret Catwood (Maggie for short). I’m getting a new kitten, a\nboy, and he doesn’t have a name yet! Best ideas I’ve had so far are…"
}