{
  "data/reddit-crypto/r/CryptoCurrency/comments/ufvnmo/sol_attacked_yet_again_why_invest_in_sol_when.json": "It's common knowledge here that the SOL network goes down frequently, gets\nhacked, doesn't work etc yet people still continue to invest in it. And yet\nagain it was attacked recently! If traditional banking was this flakey the\ngovernment would haul it over the coals and watch it burn.\n\nYet people…",
  "data/reddit-crypto/r/Bitcoin/comments/ufsz2o/in_the_family_guy_episode_s14e11_aired_10012016.json": "The price back then was US$448.70. If anyone was stupid enough to take advice\nfrom a ridiculous cartoon back then they'd be up 8,500% by now.",
  "data/reddit-crypto/r/CryptoCurrency/comments/ufxzmx/yuga_labs_and_bayc_couldve_saved_users_up_to_80.json": "The highly-anticipated virtual land sale related to the Bored Ape Yacht Club\nwent live hours ago and affected a large portion of the entire crypto market.\nThe massive demand led to ETH fees worth nearly $200 million to be spent on gas\nfor the land sale in one hour. This is because their contract…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug41ga/after_weeks_of_research_i_think_there_is_enough.json": "OBJECTIVE: ENDING BITCOIN'S FOUR YEAR CYCLES AND THEIR EFFECT ON THE WIDER\nCRYPTO MARKETS\n\nBitcoin's halving cycles are the prime target because they are the main catalyst\nbehind all crypto bull cycles. When bitcoin rallies, fresh capitals flow into\ncrypto, and those seeking higher returns flow…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug89ma/is_elon_musks_twitter_grab_good_for_nft.json": "https://preview.redd.it/x2zaeeo49xw81.png?width=2615&format=png&auto=webp&s=1d7c7e3ea12363b3ca168f9694eb872a8f007148\n\nHey Guys,\n\nTesla founder Elon Musk’s acquisition of Twitter ought not to have taken anyone\nby surprise — least of all those of us in the cryptocurrency community. But\nthere may be…",
  "data/reddit-crypto/r/Bitcoin/comments/ug52gj/my_daughter_just_managed_to_purchase_800_worth_of.json": "I have no experience with bitcoin. My daughter was messing with my phone (she's\n1.5) and somehow purchased $800 worth via cashapp. How do I handle this. I'm not\nreally in the crypto market, and that wasn't really money allotted to\ninvestment. Rn it's at $784. Any advice?",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug2isw/bored_ape_yacht_club_just_broke_the_ethereum.json": "So just read this on cnet\n[https://www.cnet.com/personal-finance/crypto/bored-ape-yacht-club-just-broke-the-ethereum-blockchain/#ftag=CAD590a51e]\nand found this interesting:\n\n\n\n> A new NFT collection was launched on Saturday by the Bored Ape Yacht Club\n> team. The Ethereum blockchain was crushed by…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug9n19/is_this_really_the_end_of_cryptocom.json": "I recently invested a considerable amount into cro and I am in the believe, that\nit's an upcoming crypto exchange with quite some room to grow.\n\nNow with the news about the crypto.com cards the price tanked from 40 to 30ct\nand I am wondering if that could be a better entry point or if everything…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ug3im5/with_cdc_shooting_themselves_in_the_foot_whats.json": "I've been a pretty extensive user of Crypto.com, but with them slashing\nbasically everything that made them competitive, I'll probably be looking for\nthe next best thing.\n\nI never had a bad experience with their platform, and I appreciated their\nvariety of services, maybe I am in the minority…",
  "data/reddit-crypto/r/CryptoCurrency/comments/ugkp3v/warren_buffet_is_a_true_value_investor_bitcoin.json": "Bitcoin just flipped Berkshire Hathway again in terms of market cap.\n\nMarket cap of BTC: $724Bn, Market cap of Berkshire (BRK) - $713 BN\n[https://preview.redd.it/ci0mvljks0x81.jpg?width=1420&format=pjpg&auto=webp&s=822c140c37a08d5b458a9ef427fb0602c8437bcb]\n\nYet he wants to buy all of Bitcoin's…"
}