{
  "data/redirect-devtop/2022/1/942282.json": "Whether a project is small, medium, or huge, it's most common necessity is authentication. In few...",
  "data/redirect-devtop/2022/1/941967.json": "I created some navigation bar using CSS and JavaScript, all are simple beginner level codes. Hope...",
  "data/redirect-devtop/2022/1/942249.json": "Have you gotten accustomed to the basics of git, but the advanced concepts make you scratch your...",
  "data/redirect-devtop/2022/1/942178.json": "How to design a URL shortening service like TinyURL?  Software engineers usually struggle with system...",
  "data/redirect-devtop/2022/1/942008.json": "As we all use target=\"_blank\" to open the link into new tab of a window but everyone should know a...",
  "data/redirect-devtop/2022/1/942257.json": "We all know Reactjs is a UI library using which we can build user interfaces rapidly. but Reactjs...",
  "data/redirect-devtop/2022/1/941632.json": "Shortcuts and aliases I was compiling as I was setting up a new laptop, and thought I'd share...",
  "data/redirect-devtop/2022/1/942403.json": "What is HTML All The Things   HTML All The Things is a web development podcast and...",
  "data/redirect-devtop/2022/1/942546.json": "macOS automatically creates .DS_Store when you open a folder with Finder, the default file manager....",
  "data/redirect-devtop/2022/1/942725.json": "LIVE LINK: https://dustinbrett.com/  Hey everyone, thanks for checking out my article on my passion...",
  "data/redirect-devtop/2022/1/942864.json": "I believe being a Software Engineer is just like being a Super Hero! And with great power, comes...",
  "data/redirect-devtop/2022/1/941715.json": "What a year, it's been one of those that seemed to only take a month. But yet, so much has happened...",
  "data/redirect-devtop/2022/1/941857.json": "Overview   In the past I have written several articles about how we can interact with...",
  "data/redirect-devtop/2022/1/942631.json": "Hoppscotch now has 35,000 star gazers on GitHub. We'll use this milestone to recap Hoppscotch’s...",
  "data/redirect-devtop/2022/1/942378.json": "One of the things that you will do the most with Typescript is to define the shape of objects with...",
  "data/redirect-devtop/2022/1/942714.json": "Sometimes we can do a simple refactor and achieve a lot with it! The example that I'm gonna show was...",
  "data/redirect-devtop/2022/1/941954.json": "Overview   This article is a translation of Golangでロードバランサーを実装する  This article is the 24th...",
  "data/redirect-devtop/2022/1/942253.json": "Centering a div is a crucial skill for a web developer. So, today I’ll share 3 ways to center a div..."
}