{
  "data/redirect-devtop/2022/2/974748.json": "One of my favourite front-end development stacks when it comes to building websites is Tailwind CSS...",
  "data/redirect-devtop/2022/2/974838.json": "A while ago I created an article where I covered useful HTML tags and their types. This week I...",
  "data/redirect-devtop/2022/2/974721.json": "Fala galera linda do meu coração. Aqui é o pokemão novamente e estamos de volta aqui com mais um...",
  "data/redirect-devtop/2022/2/974765.json": "🤔 What is TwNFT?   TwNFT is a simple web application that allows you to mint your tweets...",
  "data/redirect-devtop/2022/2/974574.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/2/974774.json": "Introduction   There are several ways to handle data in a microservice architecture, in this...",
  "data/redirect-devtop/2022/2/975387.json": "Open-source API server that might help beginners to understand better the API concept ",
  "data/redirect-devtop/2022/2/975798.json": "Open-Source React Native starter crafted and released for free by Creative-Tim on top of Soft UI Design pattern.",
  "data/redirect-devtop/2022/2/976079.json": "If you ask yourself:   How to test &amp; deploy new features in your app without sending ap App Store...",
  "data/redirect-devtop/2022/2/975362.json": "Hey Coders, Code readability and re-usability are the fundamentals for development. It is key to...",
  "data/redirect-devtop/2022/2/976632.json": "Open-Source Dashboard Template crafted on top of React and Chakra UI (MIT License)",
  "data/redirect-devtop/2022/2/975107.json": "Have you heard about HttpContext in Angular? If not, there is such a thing. HttpContext is used to...",
  "data/redirect-devtop/2022/2/976335.json": "When networking, there are a few things you can do to ensure success and reduce stress.",
  "data/redirect-devtop/2022/2/976336.json": "When I get an idea I start at once building it up in my imagination. I change the construction, make...",
  "data/redirect-devtop/2022/2/976181.json": "TLDR            What they are    JWTs - JSON Web Tokens pronounced as “JOT”. User input so...",
  "data/redirect-devtop/2022/2/976789.json": "So you've heard of this functional programming thing (from now on referred to as FP). Some say it...",
  "data/redirect-devtop/2022/2/978437.json": "2022 started with a bang, that’s for sure.   This series explores the most interesting cloud...",
  "data/redirect-devtop/2022/2/976822.json": "Yesss!!!...   Despite the Easy level of difficulty, I’m super proud to have finally contributed. I’ve...",
  "data/redirect-devtop/2022/2/977580.json": "Announcing my 28 Days of GitHub   For the next 28 days, I will be taking a deep dive...",
  "data/redirect-devtop/2022/2/977581.json": "My Plan To Automate Collaborator Invitations on GitHub   In addition to working as a...",
  "data/redirect-devtop/2022/2/974987.json": "Now that 2021 is over, it is time to set new goals. I know I'm a bit late to the party, since it's...",
  "data/redirect-devtop/2022/2/977617.json": "As senior engineer I've interviewed a lot of engineers as candidates to join my team. In general...",
  "data/redirect-devtop/2022/2/978029.json": "A simple way to showcase your data using Flask ",
  "data/redirect-devtop/2022/2/978513.json": "React is a JavaScript library, and it is the most popular and industry-leading frontend development...",
  "data/redirect-devtop/2022/2/978484.json": "I am Divya Sri Darimisetti, a student currently pursuing my BTech in Electrical Engineering from the...",
  "data/redirect-devtop/2022/2/978487.json": "Building a concurrent web server in Rust, Go, JS, TS, Kotlin, and Java to compare concurrency performance",
  "data/redirect-devtop/2022/2/976810.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/2/979016.json": "Every year I set myself new unattainable goals for the new year! I never achieved the goals! Year by...",
  "data/redirect-devtop/2022/2/977023.json": "Intro   Have you ever heard this quote? 👇   If you want to be the best, learn from the...",
  "data/redirect-devtop/2022/2/978939.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/2/979502.json": "A few weeks ago, I had to do a complex redirect of a request e.g if the request coming to nginx has a...",
  "data/redirect-devtop/2022/2/977630.json": "Introduction   Role Based Access Control (RBAC) is an access control pattern that governs...",
  "data/redirect-devtop/2022/2/979008.json": "Introduction   Node js is a popular backend nowadays! It's fast and easy to write code. If...",
  "data/redirect-devtop/2022/2/978996.json": "Being a Developer Advocate is by far the best job in the world, at least in my opinion and for me. It...",
  "data/redirect-devtop/2022/2/979680.json": "A simple eCommerce project built with Flask and Stripe. The source code can be downloaded from Github (MIT License).",
  "data/redirect-devtop/2022/2/978696.json": "The demand for web developers is growing as web development becomes more popular in the market. Web...",
  "data/redirect-devtop/2022/2/978802.json": "On the eve of February, I was inspired to tweet about web components. What started as a simple...",
  "data/redirect-devtop/2022/2/980082.json": "How to make personal blog website using html css javascript  In this video, I will show you how...",
  "data/redirect-devtop/2022/2/979665.json": "API is essential for the legitimate integrations, functionality, and performance of a software item....",
  "data/redirect-devtop/2022/2/980081.json": "I tried to see if I could get other people Mongo Database connection string by just searching for it...",
  "data/redirect-devtop/2022/2/979667.json": "Introduction   Hello Developers In this Article we would learn how do you Code and publish...",
  "data/redirect-devtop/2022/2/978707.json": "A post by SOBIN",
  "data/redirect-devtop/2022/2/980351.json": "JS gives an ability to add properties to the object after it was created.  It gives a lot of freedom...",
  "data/redirect-devtop/2022/2/980699.json": "Hello Folks 👋   What's up friends, this is SnowBit here. I am a young passionate and...",
  "data/redirect-devtop/2022/2/980858.json": "The project implements paginated access to data using Simple-DataTables, a lightweight, extendable, dependency-free javascript HTML table plugin",
  "data/redirect-devtop/2022/2/980212.json": "The Dev.to platform is built on Forem, which means it has all sorts of great API endpoints available!...",
  "data/redirect-devtop/2022/2/980894.json": "Ever since I posted this tweet,  friends, acquaintances, and random strangers have reached out to me...",
  "data/redirect-devtop/2022/2/980716.json": "Hello World! Oh wait... Hello everyone!  I got bored today and did some intense research on the...",
  "data/redirect-devtop/2022/2/981018.json": "What are React hooks? They are functions in React that allow you to add react functionality to...",
  "data/redirect-devtop/2022/2/980995.json": "TLDR: It’s not about the technical side, it’s about people!     Monoliths can be as good as...",
  "data/redirect-devtop/2022/2/980508.json": "Hi there!  In this post, I'll talk about a boring topic. It's about learning new technology.  In...",
  "data/redirect-devtop/2022/2/980403.json": "You think about the manager path, and you see there is an opportunity, And you just can't put the dot on the decision. Let's explore it together.",
  "data/redirect-devtop/2022/2/980778.json": "Technical Writing has been the talk of the town lately. Technical Writers are in high demand, and you...",
  "data/redirect-devtop/2022/2/981301.json": "This post is part of my mentoring conversation series which includes relatively short posts on...",
  "data/redirect-devtop/2022/2/981721.json": "The project implements paginated access to data using Simple-DataTables, inline edit, toasts notifications and Docker Support.",
  "data/redirect-devtop/2022/2/981465.json": "It’s impossible to have a conversation on how to write performant React code without having an...",
  "data/redirect-devtop/2022/2/981716.json": "Going from 0 to 100K as a freelancer sounds very challenging. Something only the best can do in less...",
  "data/redirect-devtop/2022/2/981460.json": "If you are starting out as a developer, you might run into these conflicting schools of thought:...",
  "data/redirect-devtop/2022/2/982215.json": "Fala pessoal, tudo bom com vocês? Pokemão de volta aqui com mais um tema para iniciantes em...",
  "data/redirect-devtop/2022/2/981948.json": "I've been fascinated with personal websites since I was a kid. Making my first personal website back...",
  "data/redirect-devtop/2022/2/979152.json": "There are principles and there are practices. A principle is a universal truth that is applicable...",
  "data/redirect-devtop/2022/2/981757.json": "JavaScript is a multi-paradigm programming language, so it provides us with a lot of different ways...",
  "data/redirect-devtop/2022/2/982442.json": "Contrary to popular belief, web scraping is not a shady or illegal activity. That is not to say that...",
  "data/redirect-devtop/2022/2/980382.json": "Many performance-related issues in Node.js applications have to do with how promises are implemented....",
  "data/redirect-devtop/2022/2/982563.json": "A professionally looking portfolio and a well-written resume are both essential to succeed in the...",
  "data/redirect-devtop/2022/2/983241.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/2/983567.json": "The CSS Gradient online generator tool is a nice and simple to use utility to quickly generate linear...",
  "data/redirect-devtop/2022/2/983155.json": "Updating your Next.js sites to have a language set for screen readers is important for accessibility, and only takes a few lines of code!",
  "data/redirect-devtop/2022/2/983488.json": "Recently, I was reading one of my favorite author's articles on his website. I realized he has a...",
  "data/redirect-devtop/2022/2/983125.json": "JS is a prototype-based language, so there are only primitive types and objects. It grants...",
  "data/redirect-devtop/2022/2/983830.json": "Let's say you are hired to create a web app for a company that describes itself as \"Etsy for dogs\"...",
  "data/redirect-devtop/2022/2/983516.json": "Appwrite's Tasks Service was a great way to send HTTP requests to remote URLs at specific intervals...",
  "data/redirect-devtop/2022/2/983703.json": "In Next js, data fetching is a strategy. Next.js uses getStaticProps or getServerSideProps to enhance...",
  "data/redirect-devtop/2022/2/983791.json": "React Components are the fundamental building blocks of any React app. They allow us to simplify...",
  "data/redirect-devtop/2022/2/984020.json": "Introduction   Making projects during a hackathon is a terrific opportunity to brush up on...",
  "data/redirect-devtop/2022/2/981922.json": "Since its release in 1994, the Design Patterns book continues to be a seminal work in building...",
  "data/redirect-devtop/2022/2/982888.json": "Building a full stack web3 app with Next.js, Polygon, Solidity, The Graph, IPFS, and Hardhat",
  "data/redirect-devtop/2022/2/983139.json": "I am 31 years old and I didn't knew this. Everytime I wanted to scrape some data table from a website...",
  "data/redirect-devtop/2022/2/982554.json": "JavaScript Array Methods   JavaScript has a great range of functional methods with arrays,...",
  "data/redirect-devtop/2022/2/984666.json": "Introduction   I have been a JavaScript developer for many years and I did not really have...",
  "data/redirect-devtop/2022/2/982860.json": "This post describes how to choose the best components when building a PC in 2022.",
  "data/redirect-devtop/2022/2/983834.json": "A curated list with Django Extensions for modern web development: Django-HTMX, Django Ninja, Pandas, and Django-Celery for asynchronous task execution.",
  "data/redirect-devtop/2022/2/984395.json": "Photo by Andrea De Santis on Unsplash           TL;DR   Learn how to implement the dependabot to...",
  "data/redirect-devtop/2022/2/978672.json": "Adding authorization &amp; authentication to an app is a common task for developers.   When you're...",
  "data/redirect-devtop/2022/2/980906.json": "FWhen I started at my first programming job, I could spend most of my time in front of my laptop...",
  "data/redirect-devtop/2022/2/984929.json": "What, in your mind, make for an effective \"principal\" level engineer — that is, say, one level above...",
  "data/redirect-devtop/2022/2/983421.json": "In the previous article, we looked at using the React Infinite Query. However, we still had a button...",
  "data/redirect-devtop/2022/2/984044.json": "Express is probably one of the most influential packages in the Node.js world. It gave us an...",
  "data/redirect-devtop/2022/2/985189.json": "INTRODUCTION    Binary is one of the many counting system that are out there. It is a number...",
  "data/redirect-devtop/2022/2/986135.json": "For most developers and engineers, the working week is pretty hectic. You have a long list of tasks...",
  "data/redirect-devtop/2022/2/985676.json": "What makes Linux really popular among programmers? Well, the answer is that there are actually lots...",
  "data/redirect-devtop/2022/2/984959.json": "Hello Guys Today i am going to show you a contact page template which you might like and can use for...",
  "data/redirect-devtop/2022/2/983411.json": "JavaScript is an interpreted language and doesn’t need compilation. Your browser can execute the same...",
  "data/redirect-devtop/2022/2/984435.json": "For the past few years since I began my endeavor to make a web desktop environment I've become...",
  "data/redirect-devtop/2022/2/985850.json": "If you've been watching my Twitch streams lately, you'll know I'm currently rebuilding, redesigning...",
  "data/redirect-devtop/2022/2/986129.json": "Hello Guys today i am going to show you How to use media query with CSS grid to create a responsive...",
  "data/redirect-devtop/2022/2/985205.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2022/2/986421.json": "Have you seen the popular trend where websites use a customized cursor that is different from the...",
  "data/redirect-devtop/2022/2/984267.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/2/986624.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/2/986297.json": "➊  Basics  ⇥  Variable Declaration ⇥  Variable Scope ⇥  Variable Hoisting ⇥  Functions ⇥  Arrow...",
  "data/redirect-devtop/2022/2/985628.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/2/979334.json": "Reading comprehension is a developer’s closest friend. Most of the information you will use comes...",
  "data/redirect-devtop/2022/2/987380.json": "Coming up to three years ago I made the shift away from web development as a hobby to web development...",
  "data/redirect-devtop/2022/2/987681.json": "React aims to stay neat and clean that's why fragments are out there. They allow getting rid of...",
  "data/redirect-devtop/2022/2/987483.json": "In this post, we are going to learn about blockchain in its simplest form, my objective for this...",
  "data/redirect-devtop/2022/2/987525.json": "7 Killer One-Liners in JavaScript   JavaScript is the most crucial pillar of Web...",
  "data/redirect-devtop/2022/2/987388.json": "What exactly are NFTs?  A Non-Fungible Token is a digital token based on the blockchain representing...",
  "data/redirect-devtop/2022/2/987192.json": "In this article I will explain how the game \"Wordle\" was worth more than $1,000,000.  Keep reading to...",
  "data/redirect-devtop/2022/2/987468.json": "Hi, Devs!   So, the Typescript language came out and rapidly was being used around the Dev...",
  "data/redirect-devtop/2022/2/988331.json": "Coding is a fun and exciting practice but how do you measure your progress in your learning...",
  "data/redirect-devtop/2022/2/988250.json": "O quê é uma rede social?   Primeiro, vamos lembrar como a mídia funcionava...",
  "data/redirect-devtop/2022/2/986521.json": "Hi, I've created an web extension that can find the page you want from your browser's history,...",
  "data/redirect-devtop/2022/2/988916.json": "Hey There Devs! 👋   Hope you are doing great with your projects.           TOC    Why this...",
  "data/redirect-devtop/2022/2/988752.json": "Of Course Yes !! 🤓  I am Sohini and I am a Developer Advocate 🥑 at Entando.   It has been 2 and a...",
  "data/redirect-devtop/2022/2/988361.json": "What is Markdown   Markdown is a markup language for writing simple formatted documents...",
  "data/redirect-devtop/2022/2/987863.json": "HTML may not be a programming language per se, but there's no doubt in the power it possesses. We...",
  "data/redirect-devtop/2022/2/987654.json": "React strives to give its users the ability to build encapsulated, reusable components, but how does...",
  "data/redirect-devtop/2022/2/987973.json": "Let's figure out what are React keys and why do we need them",
  "data/redirect-devtop/2022/2/988594.json": "This is a follow up to the article I created in 2021 50 Cool Web And Mobile Project Ideas for 2021....",
  "data/redirect-devtop/2022/2/989615.json": "When someone asks me what the best thing about being a developer is, my answer is always the...",
  "data/redirect-devtop/2022/2/985139.json": "Dear Newbie Developer,           This sh*t is hard.   You're not going to like it at first, and by...",
  "data/redirect-devtop/2022/2/989078.json": "Not too long ago, I found out about this VSCode Extension called Better Comments when I was watching...",
  "data/redirect-devtop/2022/2/990121.json": "Feature flags aka Feature toggles in any language significantly reduce the blast radius of a release...",
  "data/redirect-devtop/2022/2/985859.json": "Overview   In 2021 I started working on a rebranding project for a company that I was...",
  "data/redirect-devtop/2022/2/987800.json": "When applications make HTTP requests and fail, we need to handle them. Ideally, we take care of these...",
  "data/redirect-devtop/2022/2/989113.json": "Various techniques for testing AWS Step Functions flows.",
  "data/redirect-devtop/2022/2/988215.json": "Arrow function and regular function ( function expression) are used interchangeably in our code...",
  "data/redirect-devtop/2022/2/989428.json": "Join @azureadvocates @windowsdev and @msedgedev for Week1-Day1 of #30DaysOfPWA! https://aka.ms/learn-pwa/30days-blog",
  "data/redirect-devtop/2022/2/988792.json": "Author: Igor Zolotarev  Hello, my name is Igor, and I am a part of the Tarantool DB team. When...",
  "data/redirect-devtop/2022/2/990209.json": "Three years ago, I faced a brutal truth.  Up to that point, I had been writing dozens of lines of...",
  "data/redirect-devtop/2022/2/989378.json": "Great news!  I started my first day in a new full-time role as a Full-stack Developer today....",
  "data/redirect-devtop/2022/2/990886.json": "Fala pessoal, belezinha? Aqui é o pokemão com mais um artigo para falar um pouco sobre o começo de...",
  "data/redirect-devtop/2022/2/991418.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/2/990884.json": "Why headless CMS?   Let us look at some of the benefits of headless CMS:    Flexibility:...",
  "data/redirect-devtop/2022/2/991527.json": "Well, State of JavaScript Survey Results are in again and for the first time Solid was in the short...",
  "data/redirect-devtop/2022/2/990930.json": "JavaScript is now one of the most used programming languages, and it's fantastic at what it does. But...",
  "data/redirect-devtop/2022/2/991516.json": "Hello DEV Community!  I'm excited to announce a significant improvement in how we embed rich content...",
  "data/redirect-devtop/2022/2/990176.json": "Recruiters looking for frontend devs usually love to see UI/UX projects in your portfolio, since they...",
  "data/redirect-devtop/2022/2/978186.json": "Find out more about the improvements to the yearly developer survey",
  "data/redirect-devtop/2022/2/990703.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/2/988846.json": "medusa.express automatically creates pages for the products in your catalog, each of them optimized...",
  "data/redirect-devtop/2022/2/990696.json": "I built a Probot application, but I’m currently using smee.io to test webhooks, and I’m running the...",
  "data/redirect-devtop/2022/2/990527.json": "Introduction   JavaScript Strings provide a way of representing and handling characters.    ...",
  "data/redirect-devtop/2022/2/991451.json": "Video Version 📹 :   Note: If you find this video to be helpful then please show me some love by...",
  "data/redirect-devtop/2022/2/989823.json": "As always in React, there is one million way to do exactly the same thing. If, for example, I need...",
  "data/redirect-devtop/2022/2/989675.json": "When Misko Hevery (creator of AngularJS) approaches you to look at his new framework, well, you stop...",
  "data/redirect-devtop/2022/2/990973.json": "Polkadot has focused on becoming a fully scalable, heterogeneous web concentrated on creating a multi-chain technology. ",
  "data/redirect-devtop/2022/2/991731.json": "This is the story of how I went from Registered Nurse to Software Developer...   Hello...",
  "data/redirect-devtop/2022/2/991128.json": "Current Software Developer Technical Stack 2022  Front-End: HTML, CSS, JavaScript, TypeScript, React,...",
  "data/redirect-devtop/2022/2/991657.json": "Odds are, if you're doing any commercial programming, you've had to interact with a SQL database....",
  "data/redirect-devtop/2022/2/987995.json": "If you're designing your software differently than you might prefer to otherwise, all in the name of type safety, I consider that an unqualified blunder.",
  "data/redirect-devtop/2022/2/990467.json": "Autoplay can be pesky. Moving things are taking away the users focus. A listicle with lots of...",
  "data/redirect-devtop/2022/2/984892.json": "There is a bazillion of tutorials and resources on how to manage dotfiles out there. If you haven’t...",
  "data/redirect-devtop/2022/2/992039.json": "When it comes to TypeScript, a big part of the game is defining types.  With this, we can define...",
  "data/redirect-devtop/2022/2/991381.json": "This article shows how to build a fancy looking console app that your users will want to interact with",
  "data/redirect-devtop/2022/2/990267.json": "Have you ever come across some CSS or Javascript code that blew you away through it's elegance and...",
  "data/redirect-devtop/2022/2/993589.json": "Does using the cloud make your business sustainable? Research suggests that it’s a greener...",
  "data/redirect-devtop/2022/2/993234.json": "Tokenomics is the analysis of the economics of crypto tokens or cryptocurrencies. It refers to all of a crypto token's characteristics that make it desirable to investors.",
  "data/redirect-devtop/2022/2/993275.json": "This article is a continuation of Python 101: Introduction to Modern Python where we introduced, set...",
  "data/redirect-devtop/2022/2/991525.json": "I have often found styling a React application very confusing and difficult. Initially, I was...",
  "data/redirect-devtop/2022/2/991447.json": "Hello Guys Today i am going to show you how you can apply filter on map function.  So why i have to...",
  "data/redirect-devtop/2022/2/991888.json": "Featuring Evan You, Rich Harris, and more",
  "data/redirect-devtop/2022/2/992306.json": "*header pic by Shen Comix  Developer performance is a hot topic nowadays, especially during the...",
  "data/redirect-devtop/2022/2/992607.json": "Hi!  In this quick tutorial, I'll show you how you can create custom cursors with just images and a...",
  "data/redirect-devtop/2022/2/991405.json": "The work market is constantly changing.  Having specific career skills can make a difference in your...",
  "data/redirect-devtop/2022/2/993802.json": "JavaScript is a functional programming language because, it accepts Higher Order functions. Before...",
  "data/redirect-devtop/2022/2/993831.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/2/993591.json": "CSS (Cascading Style Sheet) is still among the top ten coding languages, according to Redmonk(It was...",
  "data/redirect-devtop/2022/2/989815.json": "I think React hooks need no introduction, so I'll skip their description and get right to the...",
  "data/redirect-devtop/2022/2/993810.json": "I'm so excited to announce that I've accepted a position at charm!      I'll be hacking away at their...",
  "data/redirect-devtop/2022/2/991894.json": "You know how you can get cardboard boxes that come totally flat? You fold ‘em up and tape ‘em to make...",
  "data/redirect-devtop/2022/2/993847.json": "Intro There are two ways to pass a value to a variable in JavaScript and understanding how they...",
  "data/redirect-devtop/2022/2/993347.json": "What is nocode?   Why are more web companies, agencies, marketing businesses and branding...",
  "data/redirect-devtop/2022/2/994584.json": "Github is awesome, that's known.  But, did you ever think how to make yours more attractive for...",
  "data/redirect-devtop/2022/2/994651.json": "Hello Everyone! I wanted to share my success on my previous job interview where I was asked to code a...",
  "data/redirect-devtop/2022/2/992703.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/2/994531.json": "There are a lot of state management libraries available for Reactjs. Here you will learn about the 5...",
  "data/redirect-devtop/2022/2/994412.json": "Animated and interactive pages attract more and more attention from users. For this, we can use...",
  "data/redirect-devtop/2022/2/994583.json": "Data structures are  ➊  Array ➋  Set ➌  Stack ➍  Queue ➎  Hash Table ➏  Tree ➐  Graph  We will be...",
  "data/redirect-devtop/2022/2/992619.json": "Non-fungible tokens (NFTs) are pretty fascinating. These Ethereum-based assets are unique elements on...",
  "data/redirect-devtop/2022/2/994793.json": "When asked about cyber-security what comes to mind?   Most people will answer this question...",
  "data/redirect-devtop/2022/2/994623.json": "The World of Protocols   A protocol is just a standard that makes it easier for different...",
  "data/redirect-devtop/2022/2/994404.json": "Like in the title. What is your favourite CSS framework or stylesheet? Bootstrap? Bulma? Tailwind?...",
  "data/redirect-devtop/2022/2/995102.json": "In the previous article, we first looked at TypeScript utility types: Partial and Required. We'll...",
  "data/redirect-devtop/2022/2/995225.json": "Introduction   Data is something that everyone is familiar with, but knowing how to...",
  "data/redirect-devtop/2022/2/993192.json": "A Data Structure is a special format of organizing, processing, retrieving and storing data. They...",
  "data/redirect-devtop/2022/2/995636.json": "Best UI Frameworks for React.js   In this post, I have listed some of the best React...",
  "data/redirect-devtop/2022/2/990936.json": "Overview of our project   We have started this project with the purpose of participating to...",
  "data/redirect-devtop/2022/2/987138.json": "Visual Studio Code is one of the best code editors in this moment. Its Palette has many features but...",
  "data/redirect-devtop/2022/2/991434.json": "Se você é uma pessoa desenvolvedora de software ou uma pessoa que atua em alguma área relacionada a...",
  "data/redirect-devtop/2022/2/993301.json": "A data structure, in more technical terms, is a collection of data values, their connections, and the...",
  "data/redirect-devtop/2022/2/994849.json": "I was overdue for an upgrade at my day job and recently received a 16 inch M1 Macbook Pro. If you...",
  "data/redirect-devtop/2022/2/995058.json": "This is somewhat of an extension to last week's 7 Killer One-Liners in JavaScript. If you haven't...",
  "data/redirect-devtop/2022/2/996137.json": "CSS is a highly specialized programming language focusing on style systems. Because of this unique...",
  "data/redirect-devtop/2022/2/993812.json": "It is common to see useState hook used for state management, However React also have another hook to...",
  "data/redirect-devtop/2022/2/996799.json": "Yet, another CSS Art from the Dragon Ball world. I think this one doesn't need any...",
  "data/redirect-devtop/2022/2/995116.json": "Amazon CloudWatch Logs costs can get out of hand quickly. Here is the remedy.",
  "data/redirect-devtop/2022/2/994710.json": "Coding, as a profession, requires constant and continuous learning, problem-solving, and staying...",
  "data/redirect-devtop/2022/2/997517.json": "With the public cloud adoption increasing year over year, companies will spend nearly $121.6 billion...",
  "data/redirect-devtop/2022/2/995466.json": "Designing the perfect API   In the last part I talked about how in Ruby method calls are...",
  "data/redirect-devtop/2022/2/997505.json": "Gatsby and Next.js, from a first glance, could look pretty much the same. Both are React-based...",
  "data/redirect-devtop/2022/2/997460.json": "Have you ever worked on a layout design and came across thinking if only I knew some generator to...",
  "data/redirect-devtop/2022/2/996259.json": "Hi everyone. Here I am again with the 4th article of the Advanced Software Development series. If...",
  "data/redirect-devtop/2022/2/994917.json": "Introduction   When working with CSS you will eventually run into designs that require you...",
  "data/redirect-devtop/2022/2/996138.json": "Image generated by Meme Generator   Let me tell you something, kid. A long, long time ago, in a...",
  "data/redirect-devtop/2022/2/995400.json": "Learn how to clone the popular social media website Reddit with RedwoodJS, a new full-stack javascript framework",
  "data/redirect-devtop/2022/2/997718.json": "Welcome to my first ever blog page 😀 hope you will enjoy and get knowledge📙           ...",
  "data/redirect-devtop/2022/2/996867.json": "Mocking an API can be a good approach if you are looking to build the frontend app first or relying on some other team to finish their part. Here's how you build one in C# and minimal API  ",
  "data/redirect-devtop/2022/2/998151.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/2/998434.json": "This is not a story about a startup that raised millions and grew exponentially. This is a story...",
  "data/redirect-devtop/2022/2/986938.json": "An ASP.Net Core RESTful API can be implemented in different ways. This article will dissect the...",
  "data/redirect-devtop/2022/2/997242.json": "Twice now, I've spent considerable time carefully writing an article, just to watch it get 20-30 hits...",
  "data/redirect-devtop/2022/2/996984.json": "The reduce array method is often introduced along with map and filter, but it is such a powerful...",
  "data/redirect-devtop/2022/2/996179.json": "Author: Alexander Goryakin    My name is Alexander, I am a software engineer in the architecture and...",
  "data/redirect-devtop/2022/2/998796.json": "My last article on 10 VS Code Extensions to Fight Technical Debt got over 50.000 views and 500...",
  "data/redirect-devtop/2022/2/999501.json": "Join us for this challenge to build applications using Microsoft Azure's suite of tools in exchange for the chance to win some stellar prizes",
  "data/redirect-devtop/2022/2/997973.json": "Web forms are the connective tissue of the internet. Without them people can’t request their health...",
  "data/redirect-devtop/2022/2/997191.json": "What dev tools I install on my Mac",
  "data/redirect-devtop/2022/2/997824.json": "Prerequisite: One must be familiar with coding in C++.   I coded my first C++ libraries 5 years back,...",
  "data/redirect-devtop/2022/2/999003.json": "What is Torrent?   In the computing sector, the term \"torrent\" usually refers to a computer...",
  "data/redirect-devtop/2022/2/998480.json": "Today marks 5 years of me being on dev.to",
  "data/redirect-devtop/2022/2/996965.json": "When working on personal projects, you can commit with random messy short meaningless messages like...",
  "data/redirect-devtop/2022/2/1000003.json": "I was reading a post about how hard it is to gain traction on DEV a couple of days ago, go give it a...",
  "data/redirect-devtop/2022/2/999214.json": "Fritz takes a look at Minimal APIs and shows a prototype to make building web APIs easier",
  "data/redirect-devtop/2022/2/1000284.json": "Recruiters get HUNDREDS of job applications everyday, but none of them stand out.  Having an...",
  "data/redirect-devtop/2022/2/1000946.json": "It's been a while since I've done one of these celebration posts. The last one was when I wrote 500...",
  "data/redirect-devtop/2022/2/1000051.json": "Introduction   Suppose you want your webpage to show the below message with the same format,...",
  "data/redirect-devtop/2022/2/1000799.json": "XKCD is probably the most popular webcomic with Devs. It only seems right that you can read it from...",
  "data/redirect-devtop/2022/2/1001071.json": "Here are a few useful Jest mocking snippets which help me get through the day.  I bet you’re all like...",
  "data/redirect-devtop/2022/2/1000593.json": "React could be the best tool when it comes to front-end development, React by itself is very...",
  "data/redirect-devtop/2022/2/996203.json": "React folder structures... lots of approaches and opinions. But how do they evolve and at what cost? This is a journey of a growing codebase with a feature-driven folder structure at its end.",
  "data/redirect-devtop/2022/2/998988.json": "While I was building laravelremote.com (a Laravel remote job aggregator), I was worried that each...",
  "data/redirect-devtop/2022/2/1001793.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/2/1000338.json": "There are platforms to track team progress (Jira, Trello) but how do you track your daily tasks on a...",
  "data/redirect-devtop/2022/2/1001829.json": "This week was going to be my productive week. It started strong, with some heavy planning and...",
  "data/redirect-devtop/2022/2/984075.json": "Presenting the project comiCSS: a webcomic about CSS, coded in CSS.",
  "data/redirect-devtop/2022/2/1000951.json": "The co-presence of other devs while working does not just foster camaraderie, it often is the spark...",
  "data/redirect-devtop/2022/2/997715.json": "Quite often beginners are struggling to grasp the concepts and methods not just with JavaScript but...",
  "data/redirect-devtop/2022/2/1001645.json": "Finding the correct path to import a component is always a big headache in React development. Laying...",
  "data/redirect-devtop/2022/2/1002296.json": "When working with types in TypeScript, we assume that we know what kind of type we will be working...",
  "data/redirect-devtop/2022/2/1002032.json": "I decided to pick up coding and completed coding (full stack web - ruby, rails, JS with a tiny bit of...",
  "data/redirect-devtop/2022/2/1002389.json": "The day comes where you’re looking to make your own website, maybe to increase your digital presence...",
  "data/redirect-devtop/2022/2/1002393.json": "Introduction   Placeholder images and avatars are something that almost every web developer...",
  "data/redirect-devtop/2022/2/1002391.json": "Built a website with HTML, CSS, and JavaScript Built a frontend web application with React or...",
  "data/redirect-devtop/2022/2/1002869.json": "Prior to deciding I wanted to be a software engineer, I was a fashion designer, real estate...",
  "data/redirect-devtop/2022/2/1002204.json": "Have you ever thought about how #technology for social good can #impact on a larger number of people..."
}