{
  "data/redirect-devtop/2021/4/656795.json": "📣 This post originally appeared on ReedBarger.com.  As React developers, we all want to write cleaner...",
  "data/redirect-devtop/2021/4/656163.json": "What is an iframe in HTML?   The &lt;iframe&gt; tag specifies an inline frame. An inline fra...",
  "data/redirect-devtop/2021/4/656917.json": "Hi folks! I’m delighted to share that I’ve just joined Forem in the new role of Special Projects Mana...",
  "data/redirect-devtop/2021/4/656153.json": "Hi there, GitHub developer! So you host your code on GitHub, and you've seen some comments like this:...",
  "data/redirect-devtop/2021/4/656332.json": "Hello folks,   It’s been a year since I am working on one of my product idea and finally was able to...",
  "data/redirect-devtop/2021/4/655661.json": "As a Java developer, I always look for ways to improve my coding skills. I heard about functional p...",
  "data/redirect-devtop/2021/4/656964.json": "Animations are a pretty cool thing, aren't they? They add something extra our websites and make them...",
  "data/redirect-devtop/2021/4/655514.json": "As the importance of software continues to increase in our everyday life, the underlying methodical f...",
  "data/redirect-devtop/2021/4/655782.json": "Safari Technology Preview added support to three new CSS color features that are coming soon to other...",
  "data/redirect-devtop/2021/4/655681.json": "For a long time, I thought a keyboard and monitor were needed to do the initial setup of a RaspberryPi. However, I recently learnt that you can do this using only another computer!",
  "data/redirect-devtop/2021/4/654523.json": "Photo by Aron Visuals on Unsplash            Intro   The other day I had the honor of being approach...",
  "data/redirect-devtop/2021/4/657131.json": "2020 has been a great year for code livestreams. Stuck at home, developers took to their OBS setups t...",
  "data/redirect-devtop/2021/4/657424.json": "A lot of people have been asking me, what extensions and themes do you use in Visual Studio Code?  He...",
  "data/redirect-devtop/2021/4/656807.json": "A curated list with Tailwind and Bootstrap Templates crafted by well-known agencies and solo developers - Soft UI Dashboard, Windmill, Volt Bootstrap 5",
  "data/redirect-devtop/2021/4/656549.json": "Basics   scheme   All components states are stored in the global state. Components can read...",
  "data/redirect-devtop/2021/4/652271.json": "As we all know, Vue is one of the best JavaScript frameworks. It is highly recommended by developers...",
  "data/redirect-devtop/2021/4/657119.json": "Do you ever watch your view count rise and wonder which posts are being read the most? I know I did....",
  "data/redirect-devtop/2021/4/657307.json": "Há uma versão em português brasileiro aqui:                                         Como configurar u...",
  "data/redirect-devtop/2021/4/657389.json": "Manipulation of javascript strings are very important in most of the  web development projects. So ,...",
  "data/redirect-devtop/2021/4/658394.json": "I have been staying at home recently, and when facing the computer, I was collecting all kin...",
  "data/redirect-devtop/2021/4/656027.json": "Are you a web developer like me?  Web development is a vast and burgeoning field laden with lots of c...",
  "data/redirect-devtop/2021/4/657404.json": "It is time to continue my new blog post series - Top 10 Best Web Dev Tools, which I started almost on...",
  "data/redirect-devtop/2021/4/657954.json": "Table Of Contents    String conversion Boolean conversion Number conversion Null conversion...",
  "data/redirect-devtop/2021/4/657427.json": "Personally I have been using Visual studio Code since back in 2018, and it has turned out to be one o...",
  "data/redirect-devtop/2021/4/654555.json": "This is a minimal and simple music player UI design made with HTML, CSS, and JavaScript.  This projec...",
  "data/redirect-devtop/2021/4/657393.json": "Unit tests are important. They prevent regressions as you refactor code, serve as documentation, and...",
  "data/redirect-devtop/2021/4/657504.json": "Monthly Workspace Setup Show off",
  "data/redirect-devtop/2021/4/656051.json": "If you ended up here for this third part and did not see the first nor the second, I highly suggest y...",
  "data/redirect-devtop/2021/4/658290.json": "Programmers hate writing documentation. Most programmers, anyway. That's just stuff that gets in the...",
  "data/redirect-devtop/2021/4/658647.json": "📌 Who is a Full-Stack Developer?   A full-stack developer is an engineer who can handle all...",
  "data/redirect-devtop/2021/4/658072.json": "Having a professional looking GitHub profile is great in this age of online resumes, recruiters, and...",
  "data/redirect-devtop/2021/4/657623.json": "A module is a JavaScript file that exports one or more values. The exported value can be a variable,...",
  "data/redirect-devtop/2021/4/658730.json": "This was originally posted on my personal blog  In this tutorial, we'll go over how to create a simpl...",
  "data/redirect-devtop/2021/4/659218.json": "I came to a bitter realization last week that most of my projects so far have been built using framew...",
  "data/redirect-devtop/2021/4/658610.json": "APIs and Web Services are those two terms that get overlapped and confused with each other. You mig...",
  "data/redirect-devtop/2021/4/656310.json": "Photo by Carl Heyerdahl on Unsplash   Hello fam! How's life treating you?   I truly hope you are doi...",
  "data/redirect-devtop/2021/4/657410.json": "Background   Sending emails is one of the most common functionalities in the modern world. T...",
  "data/redirect-devtop/2021/4/657107.json": "Ok, Split, Splice, and Slice methods are getting me confused every single time I use one of them, and...",
  "data/redirect-devtop/2021/4/659455.json": "Some days ago I made a post about how I created madza.dev. One of the most exciting parts was to crea...",
  "data/redirect-devtop/2021/4/659702.json": "Originally posted on the codelounge.dev blog =&gt; 12 Resources To Improve Your CSS Skills And Spee...",
  "data/redirect-devtop/2021/4/659775.json": "While working on one of my projects, there is one feature where I need to display a specific flag dep...",
  "data/redirect-devtop/2021/4/660136.json": "Fontjoy    Fontjoy helps designers choose the best font combinations. Mix and match differen...",
  "data/redirect-devtop/2021/4/659881.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/4/660193.json": "I was recently setting up a new machine and these are the tools I reached for first.",
  "data/redirect-devtop/2021/4/658203.json": "If you spend time reading about JavaScript and keeping up with the latest stuff online, you'll notice...",
  "data/redirect-devtop/2021/4/658983.json": "Hello everyone, this is my first post here, and I hope my English is going to be smooth enough to mak...",
  "data/redirect-devtop/2021/4/660201.json": "📣 This post originally appeared on ReedBarger.com.  Let's take a look at five React libraries that se...",
  "data/redirect-devtop/2021/4/657474.json": "I've been looking for a reason to try out React Query and Tailwind for a while, but nothing really st...",
  "data/redirect-devtop/2021/4/654145.json": "1. Components   The first thing to check in the PR - \"Is developer is following 'thinking in...",
  "data/redirect-devtop/2021/4/659274.json": "Originally posted on the codelounge.dev blog =&gt; 5 Best Resources To Learn JavaScript For Free!...",
  "data/redirect-devtop/2021/4/660250.json": "When I started ReactJS, I really enjoyed my first steps, component, props and many fun things about r...",
  "data/redirect-devtop/2021/4/653971.json": "Hello World! Today I wanted to share with you 10 projects you can build to be from zero to hero in ja...",
  "data/redirect-devtop/2021/4/658185.json": "Introduction   In this post, we'll be looking at the git stash command and its usage. We com...",
  "data/redirect-devtop/2021/4/661141.json": "There's a countless number of articles across the web that compare session tokens and JSON web tokens...",
  "data/redirect-devtop/2021/4/659948.json": "A curated list with modern React Templates and dashboards - all projects are open-source, MIT License. ",
  "data/redirect-devtop/2021/4/661186.json": "*Do you want to Kickstart a career in CyberSecurity and want to know how hackers hack in real life  *...",
  "data/redirect-devtop/2021/4/660797.json": "Want your to change your text editor from this:    To This:    Here are eight rad VSCode themes you c...",
  "data/redirect-devtop/2021/4/661008.json": "I've managed to stay in touch with what is happening in the React world, the Node.js world and also k...",
  "data/redirect-devtop/2021/4/661354.json": "IF YOU LIKE AIRTICLE THEN CHECK MORE 30+ 404 PAGE TEMPLATES                 1. Title:-No Vacancy 40...",
  "data/redirect-devtop/2021/4/654096.json": "GraphQL is a query language for reading and mutating data in APIs  By the end of this, you'll underst...",
  "data/redirect-devtop/2021/4/661055.json": "Hello everyone. I have been a bit saturated with my side project this past week so I needed a small d...",
  "data/redirect-devtop/2021/4/659936.json": "If your projects have high traffic and you need to deliver a lot of static files, there is nothing ea...",
  "data/redirect-devtop/2021/4/659587.json": "I have explained about Object Creation pattern in JavaScript. Object creation pattern. So let's learn...",
  "data/redirect-devtop/2021/4/659467.json": "Learning data structures in JavaScript will help you understand how software works and improve your problem-solving skills. ",
  "data/redirect-devtop/2021/4/660157.json": "LinkedIn is a great social network for finding work. Many companies use it for hiring and it is very...",
  "data/redirect-devtop/2021/4/654596.json": "30% of web applications are vulnerable to XSS.  Source: Acunetix vulnerability report 2019   Our dep...",
  "data/redirect-devtop/2021/4/659311.json": "Jay is a member of the NestJS core team, primarily helping out the community on Discord and Github an...",
  "data/redirect-devtop/2021/4/661585.json": "Human life is a precious incarnation. Being born has a probability of about one in 400 trillion. So t...",
  "data/redirect-devtop/2021/4/661567.json": "Modern web development comes with a variety of challenges that developers have to consider, such as p...",
  "data/redirect-devtop/2021/4/653832.json": "What is AOS?   As front-end developer, a popular request you might get from your clients is...",
  "data/redirect-devtop/2021/4/662125.json": "For a recent project I wanted to include an image that rotated when you scrolled up or down. After do...",
  "data/redirect-devtop/2021/4/661958.json": "Hello, today I created a Simple add-to-cart animation with CSS &amp; JS. Not great work but I hope yo...",
  "data/redirect-devtop/2021/4/660564.json": "creating a simple utility class in PHP to create image sequences for GIFs and creating a GIF tutorial",
  "data/redirect-devtop/2021/4/661372.json": "I don't use React often and so whenever I need to do even the smallest thing in React, I have to chec...",
  "data/redirect-devtop/2021/4/655154.json": "How is it different from course-based learning? 🧐   It's very self explanatory, but project-...",
  "data/redirect-devtop/2021/4/661894.json": "If you are searching for best tutorials on youtube, I am sharing all the programming channels which I...",
  "data/redirect-devtop/2021/4/661187.json": "Introduction   We have a list of various resources that can help you to solve many problems...",
  "data/redirect-devtop/2021/4/661915.json": "Over the last couple of weeks I’ve had incredible fun building the random code generator live on Twit...",
  "data/redirect-devtop/2021/4/661558.json": "Keep in mind: some of these steps will be of course optional, such as the iTerm2 installation and con...",
  "data/redirect-devtop/2021/4/661059.json": "Shakespeare may have been a genius, but one thing's for sure: he wasn't speaking our language. His ev...",
  "data/redirect-devtop/2021/4/657587.json": "For a project I was working on, we wanted to upload images so users could change their profile pictur...",
  "data/redirect-devtop/2021/4/662936.json": "(image source: https://www.infoq.com/i18n/software-architecture-trends-2019)  This article aims to...",
  "data/redirect-devtop/2021/4/661663.json": "I have this recurring dream where I sit down at a piano and start playing like a virtuoso. The music...",
  "data/redirect-devtop/2021/4/661781.json": "This is a post I have thought about writing for a long time, I originally published it on my blog in...",
  "data/redirect-devtop/2021/4/660507.json": "It doesn’t matter if you work with React or Angular or Node.JS after some time when your project is...",
  "data/redirect-devtop/2021/4/661780.json": "Where to host your blog?   Qovery CEO, Romaric has just started his own blog on hashnode. I...",
  "data/redirect-devtop/2021/4/662300.json": "Hey ! A few time ago I started a new Dev environment in a new computer so I needed to re-install all...",
  "data/redirect-devtop/2021/4/663050.json": "I was job hunting recently and went through 50+ interviews and have received 5 great offers. 3 of the...",
  "data/redirect-devtop/2021/4/663051.json": "📣 This post originally appeared on ReedBarger.com.  How do you make your React applications responsiv...",
  "data/redirect-devtop/2021/4/663044.json": "The best productivity apps help you get more done from the comfort of your mobile device. Get your di...",
  "data/redirect-devtop/2021/4/662930.json": "Hi there,  It's been a while I have created anything. I was getting lot's of messages to create tutor...",
  "data/redirect-devtop/2021/4/661891.json": "A post about the PHP 8 release and thoughts on its features",
  "data/redirect-devtop/2021/4/662565.json": "Weekend project: a small web page that calculates how much Jeff Bezos makes while you read it.",
  "data/redirect-devtop/2021/4/662958.json": "Starting after failures seems impossible? try this",
  "data/redirect-devtop/2021/4/662193.json": "Photo by Bank Phrom on Unsplash   Howdy fellow devs! 👋🏻 Warm greetings from Curacao! 😁  New here? Bo...",
  "data/redirect-devtop/2021/4/660194.json": "If I could give you one piece of advice about enhancing your creative process, it would be to never a...",
  "data/redirect-devtop/2021/4/663347.json": "Tips from someone who interviews Junior Frontend Developers   I've been doing interviews to...",
  "data/redirect-devtop/2021/4/662739.json": "I try to tweet a small css tip every day. Here is a collection of some of them.",
  "data/redirect-devtop/2021/4/662825.json": "Learn how CSS-in-JS libraries work and how to make your own!",
  "data/redirect-devtop/2021/4/663940.json": "Introduction:   Over the years, the massive growth of React.JS has given birth to different...",
  "data/redirect-devtop/2021/4/662798.json": "This blog post is not about how one should ace or nail the live coding interview for the junior front...",
  "data/redirect-devtop/2021/4/664184.json": "I have seen loads of people say \"it can't be done\" and....well it can't (yet)!  However after seeing...",
  "data/redirect-devtop/2021/4/661975.json": "Animated Mobile Tab Bar  This CodePen was created by @amaralflavio  (aka my little brother), it shows...",
  "data/redirect-devtop/2021/4/662079.json": "Prerequisites   In this article, it is assumed that you have already known React, Redux basi...",
  "data/redirect-devtop/2021/4/655428.json": "Why and how to manage state for Angular Reactive Forms",
  "data/redirect-devtop/2021/4/664246.json": "Photo by XPS on Unsplash  HTML is an easy but vital markup language in the world of web development,...",
  "data/redirect-devtop/2021/4/661042.json": "Are you trying to setup your workspace so as to ease your work and boost your productivity? This is f...",
  "data/redirect-devtop/2021/4/664310.json": "Learn Build Glass Website with HTML and CSS Tutorial. Add a Glass Effects on your website using HTML...",
  "data/redirect-devtop/2021/4/663032.json": "Prerequisite   This article assumes you have a basic understanding of the React.js framework...",
  "data/redirect-devtop/2021/4/661009.json": "Walking down a tree using a function, loop or generator",
  "data/redirect-devtop/2021/4/663897.json": "Web Vitals are a set of metrics that Google views as essential to a website’s user experience (UX). G...",
  "data/redirect-devtop/2021/4/657724.json": "Create a responsive sidebar in Bootstrap 5 with multi-level menu, icons, collapsible and more.",
  "data/redirect-devtop/2021/4/661484.json": "Before reading            Full Disclaimer   I'm not being benefited by any means by writing...",
  "data/redirect-devtop/2021/4/666192.json": "There are many essential concepts and lessons that React developers need to know that simply aren't c...",
  "data/redirect-devtop/2021/4/666229.json": "   IF YOU LIKE AIRTICLE THEN CHECK MORE 25+ Best CSS Border Animation              1. Title:-CSS Bo...",
  "data/redirect-devtop/2021/4/665346.json": "Online resources   JavaScript 30 by Wes Bos JavaScript.info Youtube channels   LevelUpTuts Traversy...",
  "data/redirect-devtop/2021/4/666588.json": "React!    In less than a decade of existence, React Js has indeed grown in leaps and bounds. React Js...",
  "data/redirect-devtop/2021/4/663365.json": "Hey Devs, This is a cheat sheet for all the VSCode users out there, these shortcuts can increase your...",
  "data/redirect-devtop/2021/4/655507.json": "This is the third article of my small series about TailwindCSS. If you have not done so already, chec...",
  "data/redirect-devtop/2021/4/656780.json": "Usually, when you leave your email address on your website for people to click on, you may do somethi...",
  "data/redirect-devtop/2021/4/661600.json": "Unit testing is an integral part of Test-Driven Development (TDD) which is the process of defining th...",
  "data/redirect-devtop/2021/4/666282.json": "I can not believe that I have 2 months left with Flatiron School, and hopefully by then I can officia...",
  "data/redirect-devtop/2021/4/666226.json": "This is a curated list of the shortcuts you should learn as soon as possible. I really wish I knew th...",
  "data/redirect-devtop/2021/4/663408.json": "Contents     Intro   Time Elements   Image Cropping Element   File Attachment Element   Copy...",
  "data/redirect-devtop/2021/4/665865.json": "Overcoming the language barrier for users who use your software is an important topic. English is no...",
  "data/redirect-devtop/2021/4/661566.json": "I wanted to write this article because I'm routinely frustrated by (what I perceive to be) the contin...",
  "data/redirect-devtop/2021/4/663244.json": "Prevent others sending emails using your domain name   Yesterday a user contacted me on Twit...",
  "data/redirect-devtop/2021/4/662763.json": "In my spare time I develop an open source strategy game called Solaris, check it out.  One of the pro...",
  "data/redirect-devtop/2021/4/663671.json": "A round up of the most-read and most-loved contributions from the community this past week.",
  "data/redirect-devtop/2021/4/664294.json": "Step by step guides and paths to learn different tools or technologies           Frontend Developer...",
  "data/redirect-devtop/2021/4/664265.json": "I work with a terminal every day. Being able to move around and get things done quickly is a huge boo...",
  "data/redirect-devtop/2021/4/664454.json": "Learn Build CSS Scroll Down Animated Button with HTML and CSS Tutorial. Add a Glass Effects on your w...",
  "data/redirect-devtop/2021/4/665952.json": "Ready for the 3rd round? let's go!  As usual: No SVG, No JS, No extra tag, No pseudo element, No keyf...",
  "data/redirect-devtop/2021/4/659589.json": "As a self-taught dev, it is a little intimidating and overwhelming to learn Data Structures and Algor...",
  "data/redirect-devtop/2021/4/663549.json": "Create a local Kubernetes development environment on macOS or Windows and WSL2.  Throughout this self...",
  "data/redirect-devtop/2021/4/665178.json": "HTML sub-guide    HTML HTML Skeleton Headings Paragraphs Links Media Lists Attributes Links...",
  "data/redirect-devtop/2021/4/667101.json": "Hello, today I created an Amazing button hover Using HTML &amp; CSS. I hope you like this also commen...",
  "data/redirect-devtop/2021/4/667105.json": "Hello everyone,  I made a chat progressive web application with React, NodeJS and firebase, it comes...",
  "data/redirect-devtop/2021/4/658377.json": "How to fix React memory leak warnings with useEffect cleanup functions",
  "data/redirect-devtop/2021/4/667375.json": "Here are the list of awesome svg resources that will help you to make your web project better. The li...",
  "data/redirect-devtop/2021/4/667233.json": "When using the popular JavaScript library React there are some errors/problems that seem to pop up ti...",
  "data/redirect-devtop/2021/4/665565.json": "A few days ago, we released dark mode in beta on Netlify. While we're still iterating on it, I built a Chrome extension to easily toggle it by clapping my hands.",
  "data/redirect-devtop/2021/4/666409.json": "TypeScript is an open-source superset of JavaScript developed by Microsoft to add additional features...",
  "data/redirect-devtop/2021/4/666634.json": "Docker we have been hearing this buzzword for quiet a while now. Everyone is talking about docker so...",
  "data/redirect-devtop/2021/4/666853.json": "Hi there!  Recently I posted on Twitter a list of 58 links related to different UI elements. It turne...",
  "data/redirect-devtop/2021/4/666757.json": "SOA (Service oriented architecture) and Microservices are two different architectures for web applica...",
  "data/redirect-devtop/2021/4/667720.json": "A little writeup of my reasons behind moving from Styled Components to SCSS modules, and the benefits I got out of this.",
  "data/redirect-devtop/2021/4/665990.json": "What is load balancing?   Load balancing is a technique(algorithm) used to distribute incomi...",
  "data/redirect-devtop/2021/4/665540.json": "I will show you today how you can automate the process of importing  PDF data into Excel. This can sa...",
  "data/redirect-devtop/2021/4/665268.json": "Photo by Garrhet Sampson on Unsplash   Hola amigos! 👋🏻 Welcome to another one of my blogs! I'm delig...",
  "data/redirect-devtop/2021/4/665717.json": "Don't leave this article before taking this quick survey:  Covid had the most impact on your...  ❤:...",
  "data/redirect-devtop/2021/4/667790.json": "This blog focuses on best-practice guidance on implementing accessibility in the menu components by u...",
  "data/redirect-devtop/2021/4/666227.json": "Notes            What is Procrastination?   People who procrastinate are often mislabeled as...",
  "data/redirect-devtop/2021/4/667175.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/4/667192.json": "HTML is the language of the web, but creating entire websites with HTML alone can be repetitive and h...",
  "data/redirect-devtop/2021/4/668591.json": "I recently created a countdown timer that used no JS, CSS or HTML.  But now I have gone even more ins...",
  "data/redirect-devtop/2021/4/668968.json": "Hello Devs 👋   This is Savio here. I'm young dev with an intention to enhance as a successfu...",
  "data/redirect-devtop/2021/4/668030.json": "Originally posted on the codelounge.dev blog =&gt; 7 GitHub Repositories To Help You Crush Your Job...",
  "data/redirect-devtop/2021/4/667806.json": "Introduction   Learning web development is like learning to drive a car. No matter how muc...",
  "data/redirect-devtop/2021/4/669086.json": "Do you know that when you deploy your React application which is created using create-react-app or...",
  "data/redirect-devtop/2021/4/662052.json": "In this demo, we will try to reproduce one of the main interface of the Death Stranding game.    Demo...",
  "data/redirect-devtop/2021/4/667734.json": "In this article, you will build a Book Management App in React from scratch and learn how to perform...",
  "data/redirect-devtop/2021/4/667402.json": "Photo by Dominik Vanyi on Unsplash   Hi there, I'm getting consumed by monotony and lockdown blues....",
  "data/redirect-devtop/2021/4/666739.json": "I have been working as Ruby on Rails developer since last five years with Josh Software, I felt that...",
  "data/redirect-devtop/2021/4/667971.json": "These days it is quite normal for apps to be developed that run on various platforms. This allows use...",
  "data/redirect-devtop/2021/4/667124.json": "Firebase is tool used for the backend and database of any app or website you might create. It's a tem...",
  "data/redirect-devtop/2021/4/662185.json": "I don't use React often and so whenever I need to do even the smallest thing in React, I have to chec...",
  "data/redirect-devtop/2021/4/669287.json": "I wanted to make money on the internet for years, but I didn't know how to get started.  Being a Soft...",
  "data/redirect-devtop/2021/4/669523.json": "Aurora Future    This theme is inspired by Adam Argyle's Kung-Fury-Theme.   Purple, pink and...",
  "data/redirect-devtop/2021/4/669269.json": "Hey folks 👋🏼. Just launched another Product on the Product hunt. It's a template that helps you optim...",
  "data/redirect-devtop/2021/4/668224.json": "Google recently announced FLoC which is a new method to track users. In this post I will show an easy way to opt-out of FLoC.",
  "data/redirect-devtop/2021/4/668240.json": "Why linting your code is important?  Linting will checks out the code without executing it.   The bes...",
  "data/redirect-devtop/2021/4/668579.json": "There is an interactive version of this post available where you can upload and resize your custom i...",
  "data/redirect-devtop/2021/4/669285.json": "Here is a list of awesome CSS layout generators and layout examples. The list contains Flexbox based...",
  "data/redirect-devtop/2021/4/669069.json": "What is a PWA?   Progressive Web Apps (PWA) are web applications that have been designed so...",
  "data/redirect-devtop/2021/4/669161.json": "TLDR: I created new state library called Exome (works with React and there's a PR for Vue too (excuse...",
  "data/redirect-devtop/2021/4/667411.json": "It's an exciting day for early-career developers and people learning to code!  The CodeNewbie Communi...",
  "data/redirect-devtop/2021/4/670039.json": "Never underestimate the power of simplicity. It's hard to imagine the application of concepts like pu...",
  "data/redirect-devtop/2021/4/670454.json": "📝 Notes   Gitmoji is an initiative to standardize and explain the use of emojis on GitHub...",
  "data/redirect-devtop/2021/4/668801.json": "We want our products to leave a good impression on first-time users. So whenever we build something,...",
  "data/redirect-devtop/2021/4/668807.json": "Recently I was working on a project which consisted of books, and I realized that my whole web app wa...",
  "data/redirect-devtop/2021/4/669529.json": "Hello guys, in this post I will talk about the simplest and easiest way to validate form fields accor...",
  "data/redirect-devtop/2021/4/669502.json": "Javascript is one of the most accessible languages. But between those who use it and those who master it, there is a clear difference.",
  "data/redirect-devtop/2021/4/669981.json": "Nginx is open-source software for web serving, reverse proxying, caching, load balancing, media strea...",
  "data/redirect-devtop/2021/4/669702.json": "Accessing data within arrays and objects is an important part of Javascript that every beginner shoul...",
  "data/redirect-devtop/2021/4/670572.json": "Facebook Clone        Instagram Clone    Whatsapp Clone     Linkedin Clone    Amazon Clone    Spotif...",
  "data/redirect-devtop/2021/4/669881.json": "In this blog, I am not going to describe the common commands. Here I am going to tell you the command...",
  "data/redirect-devtop/2021/4/669906.json": "In this article, I'll write a React hook and a React component that will help you achieve lazy loadin...",
  "data/redirect-devtop/2021/4/669717.json": "Photo by Christin Hume on Unsplash  Are you an over-committer? Me too. Basically, anytime I complet...",
  "data/redirect-devtop/2021/4/670530.json": "So being a frontend developer, let me walk you through the top 5 methods that I keep in mind and personally follow them to build UIs faster in ReactJS app",
  "data/redirect-devtop/2021/4/662354.json": "I recently overheard someone say that he uses the same SSH key for all of his accounts, which is a ba...",
  "data/redirect-devtop/2021/4/669536.json": "Hey ! Welcome here, I'm CodeOz and I'm sharing with you my favorite VS Code shortcut !           Inde...",
  "data/redirect-devtop/2021/4/666403.json": "Hello, guys. In this post, you will find    remote job opportunities, internship, fellowship, freelan...",
  "data/redirect-devtop/2021/4/671061.json": "Some advanced CSS topics which you think you already know but might not be deep enough to be extremely productive on daily basis",
  "data/redirect-devtop/2021/4/663679.json": "Leetcode? 💀   When you hear the phrase, \"algorithms and data structures,\" your first thought...",
  "data/redirect-devtop/2021/4/669685.json": "Building the count app with JavaScript, but before that, I will highlight the steps we will be taking...",
  "data/redirect-devtop/2021/4/670764.json": "consoel.log() is one of the most important and early learned debugging tool that we have when working...",
  "data/redirect-devtop/2021/4/669848.json": "Top 10 Interview Questions and Answers",
  "data/redirect-devtop/2021/4/670017.json": "Whether you're a beginner Programmer or a seasoned programmer, you spend most of some time on Google....",
  "data/redirect-devtop/2021/4/670850.json": "The JavaScript ecosystem is huge and keeps fostering. Tons of libraries, frameworks and tools are bei...",
  "data/redirect-devtop/2021/4/669592.json": "    IF YOU LIKE AIRTICLE THEN CHECK MORE 40+ Stunning CSS Hover Effects Example   ...",
  "data/redirect-devtop/2021/4/671379.json": "When I read Tom Greenfords execellent book Sustainable Web Design, there was one fact that stuck with...",
  "data/redirect-devtop/2021/4/671655.json": "If you're building React applications for the web, you're going to need to use a dedicated router to...",
  "data/redirect-devtop/2021/4/666834.json": "Outsourcing can change your freelancing business.  Once you realize that TIME is your greatest ASSET,...",
  "data/redirect-devtop/2021/4/671892.json": "Contents     Intro   Number Format   Currency Format   Units Format   Summary             In...",
  "data/redirect-devtop/2021/4/671935.json": "If you work in the front-end, you've probably heard a lot about TailwindCSS, a CSS library, much like...",
  "data/redirect-devtop/2021/4/672179.json": "One of the OWASP Top 10 security issues for websites is authentication that hasn't been implemented correctly. In this quick article, you'll see one of the ways you can make your own authentication system with Node.JS.",
  "data/redirect-devtop/2021/4/672359.json": "In this post you can find Website Designs For You Next Projects Its Free For All And Easily Acessable...",
  "data/redirect-devtop/2021/4/667466.json": "Hello World! I felt bored after completing the Ultimate Cheat Sheet Compilation, so I just decided to...",
  "data/redirect-devtop/2021/4/671653.json": "Hello, today I created an Amazing social media hover button Using HTML &amp; CSS. when you hover on t...",
  "data/redirect-devtop/2021/4/671950.json": "Hello devs, I'm Seif. I have been a frontend developer for well over 5 years now and throughout my jo...",
  "data/redirect-devtop/2021/4/665660.json": "It can be very intimidating designing a backend system. There are many different variations and so ma...",
  "data/redirect-devtop/2021/4/671883.json": "I recently had a conversation with some colleagues about whether I as a web developer often needed to...",
  "data/redirect-devtop/2021/4/666874.json": "Contrary to what most developers think, tree shaking isn’t very complicated. The discussion around th...",
  "data/redirect-devtop/2021/4/670727.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/4/668623.json": "CSS plays a major part in the field of web development and can be easy and at a point, it can also be...",
  "data/redirect-devtop/2021/4/671866.json": "It's been about 3.5 months since I landed my first job as a software engineer with an awesome startup...",
  "data/redirect-devtop/2021/4/672078.json": "Photo by Beth Macdonald on Unsplash           You're asked to review and merge pull requests   Half y...",
  "data/redirect-devtop/2021/4/672896.json": "The right background music can boost our concentration. But chill and lo-fi beats won’t satisfy every...",
  "data/redirect-devtop/2021/4/668951.json": "this keyword can be one of the most confusing monsters in JavaScript. Especially those who didn't lea...",
  "data/redirect-devtop/2021/4/670723.json": "If you have heard about or used the React memoization methods (useMemo, useCallback, and memo), you m...",
  "data/redirect-devtop/2021/4/672626.json": "Hello Folks,   While developing any project in React, we mostly deal with conditional operations or p...",
  "data/redirect-devtop/2021/4/673083.json": "What is up everybody today i have 5 unique css techniques that i use most of the time, some technique...",
  "data/redirect-devtop/2021/4/671011.json": "A list of few CSS resource that help me design the CSS code better. I will give you a brief intro to...",
  "data/redirect-devtop/2021/4/673255.json": "The DevDiscuss Podcast begins with an interview and ends with commentary from listeners — and we like...",
  "data/redirect-devtop/2021/4/673663.json": "What's your favourite tourist place and why? ",
  "data/redirect-devtop/2021/4/672495.json": "It's tuesday!   Time for a new ✔||🤢 Commit or Vomit! This time it is about using [].some(che...",
  "data/redirect-devtop/2021/4/671304.json": "A curated list with functional admin dashboards with database, authentication, and active charts. ",
  "data/redirect-devtop/2021/4/673449.json": "Find a developer job that allows you to work from anywhere     Originally posted on the codelounge.d...",
  "data/redirect-devtop/2021/4/673160.json": "A few years ago I wrote this article called \"What the heck is a developer advocate?\" which tried to h...",
  "data/redirect-devtop/2021/4/661251.json": "Hello friends, This is the second article of Laravel coding standards article series.   If you didn't...",
  "data/redirect-devtop/2021/4/673455.json": "It's been a long time since my last post and I wanted to write a small article on how to accept payme...",
  "data/redirect-devtop/2021/4/673973.json": "Here is the list of awesome CSS animation resources which will help you to animate components quickly...",
  "data/redirect-devtop/2021/4/673462.json": "In this post , we are going to create very 💖 beautiful and unique 3D card hover effect with HTML and...",
  "data/redirect-devtop/2021/4/672765.json": "Data Science is termed as the sexiest job of the 21st century. According to  ZipRecruiter, the entry-...",
  "data/redirect-devtop/2021/4/665868.json": "Web accessibility is about providing a valid access to web content and services to everyone, includin...",
  "data/redirect-devtop/2021/4/672632.json": "In this article I'm going to cover a process of publishing TypeScript package with external dependenc...",
  "data/redirect-devtop/2021/4/672670.json": "Programming is my passion. There's nothing better than working as a team, together to deliver somethi...",
  "data/redirect-devtop/2021/4/673677.json": "Hello Folks 👋   This is Savio here. I'm young dev with an intention to enhance as a successf...",
  "data/redirect-devtop/2021/4/674011.json": "I woke up this morning and I just wanted to show you that pop-up i created. I hope you will love it a...",
  "data/redirect-devtop/2021/4/672630.json": "In this tutorial, you will see basic to advance roadmap for python programming.  Visit My Blogs--&gt;...",
  "data/redirect-devtop/2021/4/674080.json": "What is the React Context hell?   Like the callback hell, usual when jQuery was used for eve...",
  "data/redirect-devtop/2021/4/673250.json": "Earth Day 2021",
  "data/redirect-devtop/2021/4/674723.json": "Set up a fully-customizable Discord bot that responds when mentioned in just minutes",
  "data/redirect-devtop/2021/4/673314.json": "What do you do when you have dynamic data in React? Use state!  A component's state, unlike its props...",
  "data/redirect-devtop/2021/4/672514.json": "Do you remember centring the item on the screen horizontally and vertically the old way? Before flexb...",
  "data/redirect-devtop/2021/4/674707.json": "Colorzilla   ColorZilla is a css tool from which you can get a color reading from any point in your b...",
  "data/redirect-devtop/2021/4/674675.json": "Hello Devs, We're back with another article, and in this one, we are giving you the best of the best...",
  "data/redirect-devtop/2021/4/674099.json": "Photo by Aarón Blanco Tejedor on Unsplash            5 things that are ruining your blogs &amp; how...",
  "data/redirect-devtop/2021/4/674958.json": "When talking about the user interface, the most important thing is its appearance. It is the interact...",
  "data/redirect-devtop/2021/4/674374.json": "I have encountered utilizing localStorage in one of my projects back when I was in coding bootcamp. I...",
  "data/redirect-devtop/2021/4/672618.json": "Hey everyone,  I know how researching companies when you're job hunting is an absolute PAIN - both in...",
  "data/redirect-devtop/2021/4/671562.json": "I've recently celebrated my 1 year anniversary of picking up coding. A lot has changed in the past ye...",
  "data/redirect-devtop/2021/4/667034.json": "Authentication   First focus on \"WHAT\".                 Authentication      Authentication i...",
  "data/redirect-devtop/2021/4/674679.json": "Let's see how you can completely configure the sorting of an Array of objects. Let's say we have the...",
  "data/redirect-devtop/2021/4/673461.json": "I've been working on a form lately and one day I got a task to add type validation to field input. My...",
  "data/redirect-devtop/2021/4/674968.json": "Hey folks 👋🏼. Just launched another Product on the Product hunt. It's a template that helps you manag...",
  "data/redirect-devtop/2021/4/673986.json": "NextJS Portfolio template made with Next JS, Tailwind CSS and TypeScript. Built with React components and UI kits with source code hosted on GitHub",
  "data/redirect-devtop/2021/4/674094.json": "Have you ever created a new library? You saw a gap when creating a project at work. So you worked on...",
  "data/redirect-devtop/2021/4/674770.json": "Recently I switched from using Alfred over to Raycast. What convinced me of Raycast is the simplicity...",
  "data/redirect-devtop/2021/4/675622.json": "2019.  The year I started learning how to code with a free eBook I downloaded from the web. Since the...",
  "data/redirect-devtop/2021/4/676015.json": "In this tutorial you will learn how to create a Node back-end using the Model–view–controller (MVC) s...",
  "data/redirect-devtop/2021/4/674769.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/4/675599.json": "I turn 35 today. Here are 35 principles I have accumulated and try to live by.",
  "data/redirect-devtop/2021/4/675043.json": "Authentication in simple word is just saying \"Who you are😕?\" for an Application. Authentication is th...",
  "data/redirect-devtop/2021/4/673976.json": "After many months of development, my team just announced the general availability of our platform. Th...",
  "data/redirect-devtop/2021/4/676165.json": "Believe it or not, I see new projects including jQuery in 2021, and, IMHO, it's a shame. Here is a sh...",
  "data/redirect-devtop/2021/4/672378.json": "I've built a handful of color pickers through the years, so when I in this book stumbled upon a color...",
  "data/redirect-devtop/2021/4/676205.json": "When we design a website one of the most important element to consider is color scheme, we cannot rem...",
  "data/redirect-devtop/2021/4/676034.json": "Lately, I have been learning how to use Node.js and Express to build APIs. There are no fixed standar...",
  "data/redirect-devtop/2021/4/674955.json": "pssst, I am on twitter --&gt; follow me!  Need to lay out an element to the right or the left, such t...",
  "data/redirect-devtop/2021/4/675990.json": "If you are one of those who are fascinated by the windows 10 hover effect and would like to re-create...",
  "data/redirect-devtop/2021/4/675566.json": "Chances are if you are a JavaScript developer then you might have used the console object more times...",
  "data/redirect-devtop/2021/4/675433.json": "I spend a lot of hours during the day coding for the company I work for and during nights or weekends...",
  "data/redirect-devtop/2021/4/676580.json": "Hello there, if you've arrived here after reading my previous post, I'd like to congratulate you as y...",
  "data/redirect-devtop/2021/4/677124.json": "Hey, There!👋   Welcome, back to another post of Top N! It's a series where I post Top 10, Be...",
  "data/redirect-devtop/2021/4/676333.json": "Oh no, this commit is a mess! 🤦‍♂️  Sometimes, we all have a bad day and we can forget to include a f...",
  "data/redirect-devtop/2021/4/677242.json": "Hi,  I recently launched the Beta version of Loopple, a Free Drag and Drop Dashboard Builder that aim...",
  "data/redirect-devtop/2021/4/677446.json": "Have you ever wondered what happens when you browse your favorite websites?  How those attractive web...",
  "data/redirect-devtop/2021/4/672473.json": "In my experience, more than 15 years of coding, programming, architecting, I've found people implemen...",
  "data/redirect-devtop/2021/4/666479.json": "Why useFetch?   It's very common to fetch data when the user goes to a certain page. We also...",
  "data/redirect-devtop/2021/4/676517.json": "In March 2020 I began my coding journey which means I have now been learning about web-development fo...",
  "data/redirect-devtop/2021/4/676839.json": "Here is the list of 7 simple menu icon animation (hamburger) for beginners. All animation are done wi...",
  "data/redirect-devtop/2021/4/677313.json": "Fargo 404   Fargo-inspired 404 page for DailyUI #008  Snow loosely based on http://codepen.i...",
  "data/redirect-devtop/2021/4/677243.json": "We are gonna see how to leverage the power of directives to create a super simple fullscreen toggle f...",
  "data/redirect-devtop/2021/4/677226.json": "Hello Fellow Codenewbies 👋,  I've heard the term \"personal brand\" before, but I didn't quite understa...",
  "data/redirect-devtop/2021/4/676692.json": "Table of Contents    Introduction What are arrays? How do we create arrays?  Methods    Basi...",
  "data/redirect-devtop/2021/4/677256.json": "This article was originally posted on DoableDanny.com           Intro   I was recently making a medit...",
  "data/redirect-devtop/2021/4/677595.json": "Good day guys, css is to a website what beauty is to a woman and you cannot get away with writing bad...",
  "data/redirect-devtop/2021/4/677213.json": "Styles and themes of a website or an app make a huge difference for the use experience. Here are some...",
  "data/redirect-devtop/2021/4/677726.json": "One of the main components of a web page is the navigation menu, it help us to quickly navigate to th...",
  "data/redirect-devtop/2021/4/667736.json": "Introduction   In this hectic world when we want to do a lot of things but we have only 24 h...",
  "data/redirect-devtop/2021/4/677600.json": "Photo by Juja Han on Unsplash             Layout.fm   https://layout.fm/  A weekly podcast about desi...",
  "data/redirect-devtop/2021/4/677312.json": "Open-source UI Kit crafted in React and Tailwind CSS by Creative-Tim - The project can be downloaded directly from Github.",
  "data/redirect-devtop/2021/4/678054.json": "Hello,  How are you all Today I have written this post about the 8 amazing API every developer know t...",
  "data/redirect-devtop/2021/4/678116.json": "This guide was originally published at -&gt; Devintro.com  Delivered by Facebook in 2013, React is a...",
  "data/redirect-devtop/2021/4/677113.json": "In this tutorial, you will see roadmap for C++ programming from basic to advance.           Visit My...",
  "data/redirect-devtop/2021/4/677924.json": "Hey there! Are you new to JavaScript? Well, this post is right for you! Mastering promises is a must...",
  "data/redirect-devtop/2021/4/677493.json": "Something new, and exciting, is coming to CSS and when I say 'is coming' I mean it's not supported in...",
  "data/redirect-devtop/2021/4/677786.json": "What is React?   First of all, React is not a JavaScript framework, it's simply a javascript...",
  "data/redirect-devtop/2021/4/678321.json": "A curated list with open-source Next JS Themes released under permissive licenses by well-known agencies and open-source enthusiasts.",
  "data/redirect-devtop/2021/4/676857.json": "This is continuation of the previous blog on making a website installable, you are highly encouraged...",
  "data/redirect-devtop/2021/4/678053.json": "Just to get this out of the way in the beginning:  This is not meant to be bashing other frameworks l...",
  "data/redirect-devtop/2021/4/677870.json": "Developing an understanding of the CSS position property is important if you want to become really go...",
  "data/redirect-devtop/2021/4/676831.json": "Car, television, stove, and refrigerator are the machines we use daily that are fairly simple to use....",
  "data/redirect-devtop/2021/4/672826.json": "Python is currently the most used programming language in the world, and the unique reason is that Py...",
  "data/redirect-devtop/2021/4/674695.json": "There are many ways to set up a react project and the popular ones you may hear of create-react-app a...",
  "data/redirect-devtop/2021/4/677877.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/4/678816.json": "This article was originally published at: https://www.blog.duomly.com/12-css-tips-and-tricks-which-he...",
  "data/redirect-devtop/2021/4/678652.json": "Here I list 24 awesome resource that will help to generate background image for your next web project...",
  "data/redirect-devtop/2021/4/677947.json": "GitHub: https://github.com/yifaneye/react-gallery-carousel 👈 Demo: https://yifaneye.github.io/react-g...",
  "data/redirect-devtop/2021/4/679161.json": "Hello World! Today I prepared a huge list of Javascript Interview Questions from this awesome repo. S...",
  "data/redirect-devtop/2021/4/679397.json": "When I saw article 'Stop using isLoading boolean' written by Kent C. Dodds my first thought was - wha...",
  "data/redirect-devtop/2021/4/677882.json": "Welcome to my Weekly Digest #16, which is the last one for April.  This weekly digest contains a lot...",
  "data/redirect-devtop/2021/4/677770.json": "Leaflet.js is an open-source JavaScript library for mobile-friendly interactive maps. It's lightweigh...",
  "data/redirect-devtop/2021/4/678860.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/4/679174.json": "Here I list 10 excellent JavaScript based GitHub resources that will help you to understand the langu...",
  "data/redirect-devtop/2021/4/678703.json": "English is a vital skill for any developer to learn. Here are a few tips for people looking to get better English.",
  "data/redirect-devtop/2021/4/675399.json": "You can also refer to my YouTube video for understanding with animations about the Virtual D...",
  "data/redirect-devtop/2021/4/677929.json": "So, someone I knew had a google sheet of a lot of youtube channels that are live and I thought, hey w...",
  "data/redirect-devtop/2021/4/678525.json": "Hey everyone, I'm Atibhi, I interned with Google as a Summer Intern in 2020. After I got the internsh...",
  "data/redirect-devtop/2021/4/678515.json": "Here is the list of 12 simple beginner level CSS menu button hover  animation, it use simple CSS anim...",
  "data/redirect-devtop/2021/4/679247.json": "Code units at the edges of your application should be small, independent and only do one thing....",
  "data/redirect-devtop/2021/4/679874.json": "A curated list with Laravel Themes and projects available for download without a registration lock - all projects are released under the MIT License.",
  "data/redirect-devtop/2021/4/678690.json": "Over half of the US country has legalized Cannabis for medical purposes that have led to the soarin...",
  "data/redirect-devtop/2021/4/679165.json": "This is a list of 5 extensions and themes for VS Code that I often use and find useful.    ES7 React/...",
  "data/redirect-devtop/2021/4/678634.json": "Firstly hello😊👋 all hope you're doing good and taking care of yourself. It's been a while I haven't w...",
  "data/redirect-devtop/2021/4/680675.json": "If you are learning TypeScript you can have a hard time finding out a simple way to start TypeScript projects from scratch. Depending on if you are coming from JavaScript or a statically typed language like Go, Swift, or Kotlin you may have an expectation for how your project should work.",
  "data/redirect-devtop/2021/4/680810.json": "Here is a list of 40+ website that will provide you with free illustrations. In web design images are...",
  "data/redirect-devtop/2021/4/679398.json": "Today we're gonna learn how to use CSS Media queries to build responsive websites &amp; practice by d...",
  "data/redirect-devtop/2021/4/676732.json": "In this post we'll talk about using Cypress to run API tests.  But what is Cypress?  Cypress is an op...",
  "data/redirect-devtop/2021/4/674698.json": "You are here, therefore you belong ❤️   I know that a lot of people want or know someone who...",
  "data/redirect-devtop/2021/4/678946.json": "For most of my life, I was held up as a model of Puritanical work ethic through all jillion years of...",
  "data/redirect-devtop/2021/4/673949.json": "While researching for some dashboard-related inspiration for a product I recently developed  (listed...",
  "data/redirect-devtop/2021/4/680669.json": "React is a declarative, efficient, and flexible JavaScript library for building user interfaces. It l...",
  "data/redirect-devtop/2021/4/679138.json": "Open-source Jinja Template crafted on top of a modern Bootstrap 5 design - Soft UI Dashboard.",
  "data/redirect-devtop/2021/4/679513.json": "A round up of the most-read and most-loved contributions from the community this past week.",
  "data/redirect-devtop/2021/4/670995.json": "Photo by Simon Noh on Unsplash   Howdy DEV fam! 👋🏻 What's good?   Today's discussion topic is really...",
  "data/redirect-devtop/2021/4/681297.json": "Do you want to learn machine learning but don't know where to start? Then you are on right track, In...",
  "data/redirect-devtop/2021/4/681534.json": "These are 10 small CSS tips that can actually help you in projects. If you would like to request more...",
  "data/redirect-devtop/2021/4/679229.json": "Table of Contents    Introduction Observations Getting Started Fine Tuning Grid Effect Addit...",
  "data/redirect-devtop/2021/4/680917.json": "This blog assumes that you know the React fundamentals and useState hook.   Read my article on what i...",
  "data/redirect-devtop/2021/4/681538.json": "[NOTE: A month ago I wrote an article explaining that I would be applying to Facebook.  You can read...",
  "data/redirect-devtop/2021/4/678504.json": "TLDR   You can try the app here: chat.abdou.dev  You can view the source code in this github...",
  "data/redirect-devtop/2021/4/680766.json": "Introduction   Many projects contain asynchronous calls. The operation of these may be unawa...",
  "data/redirect-devtop/2021/4/679604.json": "Here I list awesome CSS button generators, which can generate beautiful buttons for your project quic...",
  "data/redirect-devtop/2021/4/681196.json": "Random Password Generator is a program that automatically generates a password randomly. Those genera...",
  "data/redirect-devtop/2021/4/681293.json": "I recently started to create a Full Web Developer Course on my YouTube Channel and recently finished...",
  "data/redirect-devtop/2021/4/680166.json": "I've been learning Rust. Figure out how to map my understanding of data types is up next.",
  "data/redirect-devtop/2021/4/676581.json": "Photo by Oleg Laptev on Unsplash   What's up devs! 👋🏻 How are you doing?   Last week I did a post hi...",
  "data/redirect-devtop/2021/4/680465.json": "Voice123 is the first (and arguably foremost) open marketplace for voice actors.  Today, Voice123 ha...",
  "data/redirect-devtop/2021/4/680643.json": "Prologue            A few words about me   My name is Marcos Molina a Junior Full-Stack Deve...",
  "data/redirect-devtop/2021/4/679871.json": "Welcome to the second post on interview questions. You can read previous post which covers general qu...",
  "data/redirect-devtop/2021/4/680686.json": "There are many ways to make a masonry layout with CSS but today we will use columns property to build...",
  "data/redirect-devtop/2021/4/673153.json": "Why   Suppose you are receiving your brand new computer. You have a bunch of softwares to in...",
  "data/redirect-devtop/2021/4/678285.json": "Photo by arash payam on Unsplash   Hello folks! Welcome back 👋🏻 I trust you are doing well.  As you...",
  "data/redirect-devtop/2021/4/681319.json": "Hey Devs, This is an all you need ES6 cheatsheet for beginners and seasoned developers!  So let's get...",
  "data/redirect-devtop/2021/4/680756.json": "300 animations were not enough? Ok, I have done 100 more animations and, guess what, still No extra e...",
  "data/redirect-devtop/2021/4/682111.json": "Not so long ago, user interfaces for the web were built mostly using standard HTML and CSS. The rise...",
  "data/redirect-devtop/2021/4/682193.json": "Introduction   I have always had a passion for writing because I find that it is one of the...",
  "data/redirect-devtop/2021/4/681017.json": "Over the last few years, I've accumulated a huge amount of links to useful GitHub repos. Today I pick...",
  "data/redirect-devtop/2021/4/679457.json": "Here I list a few CSS shape generators, which can be included in your project, these generators produ...",
  "data/redirect-devtop/2021/4/682349.json": "Most web developers start coding out of pure passion and later on turn it into a career. They usually...",
  "data/redirect-devtop/2021/4/675412.json": "Serie of sketchnotes about Network concepts. Explaining in a visual way network principles.",
  "data/redirect-devtop/2021/4/681768.json": "Introduction   Let's discuss a few common JavaScript array methods seen regularly in React....",
  "data/redirect-devtop/2021/4/682873.json": "Here I list 10 simple toggle button animation examples. All of them work based on simple transition p...",
  "data/redirect-devtop/2021/4/682831.json": "Here I list more that 25 website that will help to generate CSS codes which I think will help you to...",
  "data/redirect-devtop/2021/4/682090.json": "No one really writes about the pain involved in learning to code in Nigeria and I don’t know why.  Fi...",
  "data/redirect-devtop/2021/4/683226.json": "Hello Folks 👋   This is Savio here. I'm young dev with an intention to enhance as a successf...",
  "data/redirect-devtop/2021/4/681788.json": "Hello again.  Last time out we did a little  Introduction into React . Today I am slightly shifting t...",
  "data/redirect-devtop/2021/4/682875.json": "With the Chrome 88 release, we got support for clip-path: path(). That means it now has support in \"m...",
  "data/redirect-devtop/2021/4/682121.json": "React Style Guide (2021)   src: the original post: https://github.com/airbnb/javascript/tree...",
  "data/redirect-devtop/2021/4/682192.json": "This week i had to setup a node js server for a project that i will be working on for the next 2 mont...",
  "data/redirect-devtop/2021/4/683422.json": "Designing an HTML sign-up form for a website or blog can be hard. Here we have listed down the most u...",
  "data/redirect-devtop/2021/4/682129.json": "Introduction   There could be various reasons why you would need a free domain name for your...",
  "data/redirect-devtop/2021/4/683585.json": "If you've ever tried writing blog articles yourself I'm sure you've realized it is not an easy thing....",
  "data/redirect-devtop/2021/4/682767.json": "So you've finished your computer science bachelor's degree or Bootcamp education and are ready to jum...",
  "data/redirect-devtop/2021/4/681977.json": "In this article, we will build an application using class components and then later convert it to fun...",
  "data/redirect-devtop/2021/4/682406.json": "Design. Does it scare you?   While it's not mandatory for front-end developers to design user interfa...",
  "data/redirect-devtop/2021/4/683727.json": "What is this series about?   Hello all! Welcome to the JavaScript interview questions series...",
  "data/redirect-devtop/2021/4/682573.json": "What   Stoxy is a new, modern, reactive state management system for web applications.  It's...",
  "data/redirect-devtop/2021/4/681659.json": "When starting a new website or app there are a few layers to every project that you need to make sure...",
  "data/redirect-devtop/2021/4/682413.json": "Hey DEVs!👋 I hope you all are safe and doing well. There's so much debate goes on about listening mus...",
  "data/redirect-devtop/2021/4/682196.json": "In this article, we will show that the only collection method you need is the Array.prototype.reduce....",
  "data/redirect-devtop/2021/4/684068.json": "Today I drew a cartoon of a pirate with HTML and CSS:      It may look a bit funky on some browsers b...",
  "data/redirect-devtop/2021/4/682348.json": "Instagram needs no introduction everyone knows how big it is. It is one of the most popular and activ...",
  "data/redirect-devtop/2021/4/683864.json": "If you want to build an application or a website you need to take care of many things and in that sea...",
  "data/redirect-devtop/2021/4/683218.json": "In this post, I'll show you how you can implement passwordless sign in, or \"magic-link\" sign in to yo...",
  "data/redirect-devtop/2021/4/683309.json": "Problems that I encountered during migrating classic React.js projects to Next.js and how I solved them",
  "data/redirect-devtop/2021/4/680929.json": "This post comes with some of the unique and secrets(🤐) tricks developer don't know. Some tricks will...",
  "data/redirect-devtop/2021/4/660865.json": "Table of content   Introduction What is SSR? What is CSR? Pros-Cons? When to use CSR? When to use SSR...",
  "data/redirect-devtop/2021/4/683735.json": "Let's face it: building modern apps is hard - building secure, performant, and scalable apps is even...",
  "data/redirect-devtop/2021/4/683486.json": "So you just heard about this thing called web components and you did a quick google search. apart fro...",
  "data/redirect-devtop/2021/4/683860.json": "In this tutorial we will show you, step-by-step, how to create a ToDo web app in Python using Pglet f...",
  "data/redirect-devtop/2021/4/681206.json": "React provides a superb developer experience: you define states and props, combine components in a wa...",
  "data/redirect-devtop/2021/4/683255.json": "The Linux terminal is an incredibly powerful tool to get stuff done quickly. How fast can you go? Tha...",
  "data/redirect-devtop/2021/4/677938.json": "Introduction   In this fast-paced world, where everything seems to be happening quickly, it...",
  "data/redirect-devtop/2021/4/683462.json": "Most of the software engineers are intimidated by technical rounds and I have recently started to giv...",
  "data/redirect-devtop/2021/4/683856.json": "In this post you'll learn how to build and deploy a GraphQL API using data stored in the Ethereum blockchain.",
  "data/redirect-devtop/2021/4/681967.json": "In this article, I'll share 30 project ideas you can work to dominate your abilities, feel sufficient...",
  "data/redirect-devtop/2021/4/681033.json": "NubesGen is an Open Source tool that ",
  "data/redirect-devtop/2021/4/670025.json": "Hi! I’m Oksana.  This is my first post and I wanted to share my journey to becoming a software develo...",
  "data/redirect-devtop/2021/4/679104.json": "Hello World! Today we are talking about Forms! They're everywhere, and when you least expect it, they...",
  "data/redirect-devtop/2021/4/672908.json": "A detailed guide to javascript promises",
  "data/redirect-devtop/2021/4/677117.json": "A couple of years ago in the The Real Cost of UI Components, I explored the cost of components in Jav...",
  "data/redirect-devtop/2021/4/667230.json": "The serverless computing model allows you to build and run applications and services without having t...",
  "data/redirect-devtop/2021/4/671008.json": "Redis means fast. This was the  impression I always had. But, at the same time, for me, Redis was “ju...",
  "data/redirect-devtop/2021/4/670635.json": "When dealing with complex CSS animations, there is a tendency to create expansive @keyframes with lot...",
  "data/redirect-devtop/2021/4/684176.json": "Conditional rendering on React helps you build your apps avoiding unnecessary renders depending on so...",
  "data/redirect-devtop/2021/4/675062.json": "Serie of sketchnotes about Docker. Explaining in a visual way Docker principles.",
  "data/redirect-devtop/2021/4/665525.json": "We, as developers, tend to develop sites unconsciously for people like ourselves. If we don't activel...",
  "data/redirect-devtop/2021/4/654158.json": "As you know React is not an opinionated library. What that means is that there is no clearly defined...",
  "data/redirect-devtop/2021/4/675415.json": "Serie of sketchnotes about Network concepts. Explaining in a visual way network principles.",
  "data/redirect-devtop/2021/4/675417.json": "Serie of sketchnotes about Network concepts. Explaining in a visual way network principles.",
  "data/redirect-devtop/2021/4/657958.json": "Hello Dev Friends.As we are learning web development, we often get overwhelmed with so much to learn...",
  "data/redirect-devtop/2021/4/653631.json": "In this article I will explain how I built a star rating system that is ACTUALLY accessible, easy to...",
  "data/redirect-devtop/2021/4/672805.json": "It's all about maintaining clean and readable code(which works of course). So, I wanted to share a..."
}