{
  "data/redirect-devtop/2021/6/714546.json": "Join us in collecting stories of LGBTQIA+ pride — and amplifying organizations doing important work in this space.",
  "data/redirect-devtop/2021/6/714700.json": "Hi folks,   Frontend development is continuously evolving  with new technologies and frameworks. It i...",
  "data/redirect-devtop/2021/6/715215.json": "Microservice applications rely heavily on messaging and asynchronous communications to keep everythin...",
  "data/redirect-devtop/2021/6/714954.json": "Are you looking 👀 for emoji symbols you could copy and paste to another website or app❓ Online ⌨️ Emo...",
  "data/redirect-devtop/2021/6/715643.json": "You might have heard of the Virtual DOM (and also the Shadow DOM). You may have even used it (JSX is...",
  "data/redirect-devtop/2021/6/715042.json": "We continue our walk on the path leading to Vim mastery by reviewing crazy Vim functionalities which will increase even more your productivity.",
  "data/redirect-devtop/2021/6/715297.json": "I'm Hiep. I work as a full-time software engineer. Most of my open-source projects are focused on o...",
  "data/redirect-devtop/2021/6/716014.json": "As YouTube is one of the most searched search engines on the entire planet, it is obvious that YouTub...",
  "data/redirect-devtop/2021/6/715238.json": "Images engage users, drive clicks, and generally make everything better--except performance. Images a...",
  "data/redirect-devtop/2021/6/715298.json": "In this guide you'll learn how you can create a CLI script to dynamically update your Twitter cover image to show your latest Twitter followers, using PHP and the PHP-GD library.",
  "data/redirect-devtop/2021/6/715762.json": "Developing locally when building a serverless application is not only tiresome and hard to do its actually bad for you",
  "data/redirect-devtop/2021/6/716800.json": "Does this sound familiar to you?   If you are a coder, programmer or software developer then...",
  "data/redirect-devtop/2021/6/716298.json": "I'm answering the question.  ",
  "data/redirect-devtop/2021/6/715645.json": "You have covered the basics ✅  Now, you are ready to impress the interviewer with some advanced conce...",
  "data/redirect-devtop/2021/6/717273.json": "We’re excited to let you know that the Forem iOS app is now live in the App Store. I want to get into...",
  "data/redirect-devtop/2021/6/715767.json": "Hey, Josh here again. Lately, I’ve been showing you how to build projects with Ruby on Rails and Reac...",
  "data/redirect-devtop/2021/6/716674.json": "I created 9 simple full screen navigation menu for beginners using CSS and JavaScript. These are just...",
  "data/redirect-devtop/2021/6/716529.json": "Hey React engineers! In this article, I'll explain the 4 most important hooks you need to know in Rea...",
  "data/redirect-devtop/2021/6/716507.json": "If you’re running a small business and just now getting started with website marketing, I’ve got some...",
  "data/redirect-devtop/2021/6/716058.json": "Hello guys, In this article we will learn how to create simple parallax scrolling effect using GASP S...",
  "data/redirect-devtop/2021/6/715760.json": "This article lists out some great platforms for practicing and improving your frontend development skills.",
  "data/redirect-devtop/2021/6/716551.json": "Distributed applications are a staple of the modern software development industry. They're pivotal to...",
  "data/redirect-devtop/2021/6/716296.json": "Did you ever experienced this behaviour when the parent container starts scrolling once the child scr...",
  "data/redirect-devtop/2021/6/717934.json": "Hi everyone. I made 52 responsive snippets that can help you to build website for your project, portf...",
  "data/redirect-devtop/2021/6/716859.json": "A web page consists of different sections and components, and we make them responsive by using CSS me...",
  "data/redirect-devtop/2021/6/717321.json": "My previous post was supposed to be a rant...a way of releasing my pent-up anger and frustration at t...",
  "data/redirect-devtop/2021/6/716408.json": "What is HarperDB?   HarperDB is an easy database solution that helps collect, distribute, an...",
  "data/redirect-devtop/2021/6/717131.json": "Whether you are a freelance developer, own a launderette, or have another type of small business, a g...",
  "data/redirect-devtop/2021/6/718438.json": "Building projects and solving real world problems is inarguably one of the best ways you can learn ho...",
  "data/redirect-devtop/2021/6/717561.json": "I built Cusdis in April 2021, an open-source, light-weight, privacy-friendly alternative to Disqus. I...",
  "data/redirect-devtop/2021/6/715977.json": "Hello, glad you are here. I am kunaal and today we will see how to make our own custom right click op...",
  "data/redirect-devtop/2021/6/717088.json": "Hello,  Today I created a Amazing Login Form With Validation Using HTML &amp; JS. This is a simple fo...",
  "data/redirect-devtop/2021/6/716834.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/6/718359.json": "We know how stressful it can be to search for various designing resources here and there. So, to save...",
  "data/redirect-devtop/2021/6/718394.json": "Hello everyone👋  In this article, we are going to see how we can generate a PDF of any HTML element i...",
  "data/redirect-devtop/2021/6/718347.json": "Lodash is an incredible library of utilities that you may not always need.",
  "data/redirect-devtop/2021/6/718222.json": "Almost everyone is familiar with hooks these days, useEffect is one of the most used hook. My 2 cents...",
  "data/redirect-devtop/2021/6/717962.json": "Creational Pattern - Builder Pattern.   This is the third part in my series (23 GoF Design P...",
  "data/redirect-devtop/2021/6/717485.json": "In my last blog entry, I had created a visualizer to model an approach to solving a Leetcode algorith...",
  "data/redirect-devtop/2021/6/718802.json": "This is the first part in my series (Crack the React Interviews By Using Mindmap). My series will giv...",
  "data/redirect-devtop/2021/6/718431.json": "✨ What you'll be making In this tutorial, I'll walk you through how to make a chrome extension with v...",
  "data/redirect-devtop/2021/6/717902.json": "Hi, Today we are going to implement API authentication with JWT in node.js application. Authenticatio...",
  "data/redirect-devtop/2021/6/717837.json": "Creating and setting up your own React project from scratch can be, at times, a little bit tricky, ev...",
  "data/redirect-devtop/2021/6/718235.json": "When you're new to React Hooks, you may notice that you get warnings and bugs if you use an async fun...",
  "data/redirect-devtop/2021/6/717490.json": "Before we begin with Higher Order Functions and Currying, we need to first establish what a normal fu...",
  "data/redirect-devtop/2021/6/718886.json": "Creational Pattern - Factory Pattern.   This is the fourth part in my series (23 GoF Design...",
  "data/redirect-devtop/2021/6/718119.json": "Hello  Today I created a Amazing Glassmorphism Credit Card With HTML &amp; CSS. This is simple Credit...",
  "data/redirect-devtop/2021/6/715066.json": "TL;DR   Using the DEV API the title of this article gets automatically updated every 60 seco...",
  "data/redirect-devtop/2021/6/717897.json": "Hello, glad you are here. I am kunaal and today we will see how to make an awesome loading animation...",
  "data/redirect-devtop/2021/6/718351.json": "Let us consider an example where we are trying to build a search bar, which has the capability of aut...",
  "data/redirect-devtop/2021/6/719077.json": "This is the second part in my series (Crack the React Interviews Using Mindmap). My series will give...",
  "data/redirect-devtop/2021/6/718808.json": "If you are starting on the journey to becoming a Front End Developer, once you get the basics down, y...",
  "data/redirect-devtop/2021/6/718821.json": "Events handling and promises in particular are hands down the best JavaScript feature. You're probabl...",
  "data/redirect-devtop/2021/6/718740.json": "Hi there 👋,  Checkout my recently made responsive agency website.  In this responsive website i have...",
  "data/redirect-devtop/2021/6/719044.json": "Three years ago, I decided to part ways with my Facebook account, and I decided to replace the time s...",
  "data/redirect-devtop/2021/6/717668.json": "I was recently asked by a developer friend of mine what design patterns I use in my job. The question...",
  "data/redirect-devtop/2021/6/719079.json": "Choose an area of focus and be good at it Coding has various fields and areas of focus. It is almost...",
  "data/redirect-devtop/2021/6/719043.json": "Let's build a super simple compiler!  In this series, I am going to show you how to build a compiler....",
  "data/redirect-devtop/2021/6/719617.json": "For many of you, this is the fourth part of this series \"Top 10 Websites For Developers\". You could c...",
  "data/redirect-devtop/2021/6/718087.json": "TL-DR:   Nesse artigo eu falo sobre estratégias que eu uso para navegar de maneira eficiente...",
  "data/redirect-devtop/2021/6/719032.json": "Introduction:   Before reading this article you should know about React &amp; Redux, its wor...",
  "data/redirect-devtop/2021/6/719239.json": "Do not panic! You do not need to learn X language and know Y algorithm before you apply to Z tech com...",
  "data/redirect-devtop/2021/6/719808.json": "If you have run your website through Google Lighthouse, Page Speed Insights, web.dev measure etc. you...",
  "data/redirect-devtop/2021/6/719365.json": "Regardless of whether you work on the front-end or back-end, I think all developers should gain some...",
  "data/redirect-devtop/2021/6/719583.json": "Creational Pattern - Abstract Factory Pattern.   This is the fifth part in my series (23 GoF...",
  "data/redirect-devtop/2021/6/719354.json": "Hello, welcome to this tutorial!  Today, I'm going to be explaining how to use alt text for your imag...",
  "data/redirect-devtop/2021/6/719480.json": "Prerequisite to implement the customHooks    Knowlegde of functional components, and react h...",
  "data/redirect-devtop/2021/6/719637.json": "Hello  Today I created a Amazing Clear Input with HTML &amp; JS. This is simple placeholder input I u...",
  "data/redirect-devtop/2021/6/719896.json": "Learn to build any SaaS product through devKamet, an interactive platform to learn the essentials of...",
  "data/redirect-devtop/2021/6/718231.json": "Recently, I found myself craving to make something interesting. So I sat down and scrolled through dr...",
  "data/redirect-devtop/2021/6/720632.json": "Whether you are already an experienced developer or just starting out, if you want to become really g...",
  "data/redirect-devtop/2021/6/719774.json": "A 12 year old Nirof along with some of her friends is playing the blind man's buff in the community p...",
  "data/redirect-devtop/2021/6/719927.json": "1. Anime.js  Anime.js is a lightweight JavaScript animation library with a simple, yet powerful API.T...",
  "data/redirect-devtop/2021/6/720611.json": "When I check CSS of projects I often face some mistakes that are related to Flexbox. I'd like to tell...",
  "data/redirect-devtop/2021/6/720272.json": "From the moment I started learning React, I completely fell in love with it.  I can create beautiful...",
  "data/redirect-devtop/2021/6/719823.json": "Portfolio Page  Creating your own portfolio is not always an easy task. We can say that the most imp...",
  "data/redirect-devtop/2021/6/719612.json": "Understanding \"Hooks Flow\" is very important and sometimes even experienced React developers miss a f...",
  "data/redirect-devtop/2021/6/720225.json": "Truthy and falsy values are two important concepts for JavaScript developers to understand. In this t...",
  "data/redirect-devtop/2021/6/720852.json": "How to handle live data using WebSockets together with React Query has been one of the most asked que...",
  "data/redirect-devtop/2021/6/719594.json": "API testing is a type of software testing that focuses on determining if APIs meet expectations. It i...",
  "data/redirect-devtop/2021/6/719949.json": "TL;DR: check it out at https://dontwaste.today/             Short intro   After 45 days and 176 hours...",
  "data/redirect-devtop/2021/6/720940.json": "Hi,  This is a website I created for learning fullstack engineering in 2021. It's based completely in...",
  "data/redirect-devtop/2021/6/721780.json": "Hello!  They kept us in Suspense long enough, but HECK React developers have some new features to pla...",
  "data/redirect-devtop/2021/6/720644.json": "In the last article, we saw that at its core, Javascript is synchronous (statements in our code are e...",
  "data/redirect-devtop/2021/6/719221.json": "I was presented with an interesting challenge recently. That challenge was to recreate a method provi...",
  "data/redirect-devtop/2021/6/719219.json": "Disclaimer: I am not, by any means, a seasoned veteran in this field. I am just an enthusiast trying...",
  "data/redirect-devtop/2021/6/717818.json": "To construct a JavaScript programming vocation, applicants need to break the meeting. They are reques...",
  "data/redirect-devtop/2021/6/721317.json": "Mistakes I made in my 20s as a Software Developer.     Mistakes I made in my 20s as a Softwa...",
  "data/redirect-devtop/2021/6/720248.json": "Flexbox gives you complete control over the boxes' alignment, direction, order, and size. It makes it...",
  "data/redirect-devtop/2021/6/721787.json": "As a sequel to my first blog, learning web dev on the web which had info on some of the most epic you...",
  "data/redirect-devtop/2021/6/716135.json": "Are you looking for Best Online Code editors? Then here is the collection of Best Online Code Editors...",
  "data/redirect-devtop/2021/6/721565.json": "Get Started!   Customize your Readme.md on your GitHub profile to make it look attractive by...",
  "data/redirect-devtop/2021/6/721761.json": "Introduction   This article is intended for beginners, I understand that for experienced developers t...",
  "data/redirect-devtop/2021/6/720618.json": "This question has come up over and over again. From putting together the core team for a startup comp...",
  "data/redirect-devtop/2021/6/721519.json": "Hello folks,  Designed and developed \"Sorting Algorithms Visualizer\" (using React and Zustand) to hel...",
  "data/redirect-devtop/2021/6/719639.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/6/723072.json": "I’m sure you were affected by the Fastly outage yesterday. The company responded quickly, and it wasn...",
  "data/redirect-devtop/2021/6/721339.json": "Web development projects range from highly complex to relatively simple. No matter the complexity of...",
  "data/redirect-devtop/2021/6/720442.json": "Hello everyone, If you have ever worked on a open source project or any project in general where mult...",
  "data/redirect-devtop/2021/6/721545.json": "You sometimes ask yourself...  What does it take to excel in software development?  I asked myself th...",
  "data/redirect-devtop/2021/6/718959.json": "“Write Once, Run Anywhere” -Sun Microsystems about Java, 1995 “Build Once, Run Everywhere” -Docker ab...",
  "data/redirect-devtop/2021/6/721160.json": "Life has been hectic the last few weeks - from dealing with a minor car accident, a prolonged illness...",
  "data/redirect-devtop/2021/6/721330.json": "\"Keep learning.\" It's one of those things you will read on every guide on how to become a good develo...",
  "data/redirect-devtop/2021/6/723084.json": "A curated list with open-source React starters and UI Kits styled with Tailwind CSS - all projects are available on Github.",
  "data/redirect-devtop/2021/6/723094.json": "To get hired as a web developer, you need a specific set of skills and abilities to help you achieve...",
  "data/redirect-devtop/2021/6/721197.json": "Hello folks,   Recently, I was working on a feature and I had to implement a progress bar in it. Till...",
  "data/redirect-devtop/2021/6/723015.json": "Design patterns are blueprint solutions that you use to solve common programming problems swiftly and...",
  "data/redirect-devtop/2021/6/721806.json": "When you start to focus on the performance and security of your backend alongside the other features,...",
  "data/redirect-devtop/2021/6/723147.json": "Hi dev friends!  I made this cheat sheet to help my students. I shared it on Twitter here and it got...",
  "data/redirect-devtop/2021/6/721899.json": "Introduction   In programming, it's important to make sure that your code is readable, maint...",
  "data/redirect-devtop/2021/6/723840.json": "The React team has been hard at work for over a year. React is changing yet again, and it's time to start learning where it's going next.",
  "data/redirect-devtop/2021/6/720498.json": "There are few debates as contentious in the development and UX world as color schemes. Among develope...",
  "data/redirect-devtop/2021/6/723141.json": "I'm Hiep. I work as a full-time software engineer. Most of my open-source projects are focused on o...",
  "data/redirect-devtop/2021/6/722297.json": "In this article, we will be doing some common operations while working with JSON data in JavaScript...",
  "data/redirect-devtop/2021/6/723845.json": "Code review is a skill and it takes practice. But there are some things you should know up front.",
  "data/redirect-devtop/2021/6/721775.json": "Modal is a common UX element. A modal is a dialog box/popup window that is displayed on top of the cu...",
  "data/redirect-devtop/2021/6/723296.json": "Watch On YouTube: Watch Now            Source Code: Github            Live Preview: Open L...",
  "data/redirect-devtop/2021/6/721553.json": "I decided to give my laptop a virtual makeover recently. One thing that stuck out was the terminal....",
  "data/redirect-devtop/2021/6/721614.json": "Over the past few years, people have gotten louder and louder about Twitter's apparent bias in who th...",
  "data/redirect-devtop/2021/6/722209.json": "This post is also available in the following languages: Portuguese.   On the last article we have le...",
  "data/redirect-devtop/2021/6/722862.json": "Since the rise of Flexbox and CSS Grid, everyone is claming the same: \"float is dead!\", \"stop using f...",
  "data/redirect-devtop/2021/6/721863.json": "I love old video games.   One of my fondest memories as a kid is going to a diner on Long Island with...",
  "data/redirect-devtop/2021/6/722650.json": "Introduction    In learning you will teach, and in teaching, you will learn. ― Phil Collins...",
  "data/redirect-devtop/2021/6/724162.json": "Hello, glad you are here. I am kunaal and today we will see how to make an awesome fully animated hea...",
  "data/redirect-devtop/2021/6/722324.json": "Hello, Everyone. Lets Learn to build Twitter Clone using just HTML &amp; CSS. I Just Love to build th...",
  "data/redirect-devtop/2021/6/723042.json": "Newbie looking for guidance here - I feel like the more I learn, the more I realise what I don’t know...",
  "data/redirect-devtop/2021/6/723962.json": "Hey guys,  I created a full fledged video to help others in learning React with ease.  The video incl...",
  "data/redirect-devtop/2021/6/721859.json": "When it’s released, React 18 will include out-of-the-box improvements including:   Automatic batching...",
  "data/redirect-devtop/2021/6/724906.json": "JavaScript Projects for Beginners   This is the best way to learn a new programming language...",
  "data/redirect-devtop/2021/6/719940.json": "Hello everyone,  Thank you for joining in for this article about YAML files. We will make it today a...",
  "data/redirect-devtop/2021/6/723192.json": "Developer Tools and Console Tricks    demo    On Day-9 of JavaScript-30 we learned a lot of...",
  "data/redirect-devtop/2021/6/722317.json": "If you are here you probably might know or want to learn the debouncing practice used to improve the...",
  "data/redirect-devtop/2021/6/724355.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/6/724910.json": "Hey Everyone!  here i have awesome design resources i use in day-to-day life.           Colors    Col...",
  "data/redirect-devtop/2021/6/717965.json": "The topic of web accessibility is huge, and it can be hard to know where to start. In this blogpost I...",
  "data/redirect-devtop/2021/6/723906.json": "I've often heard students pursuing their degrees saying, \"I wish I could have learned this\". When app...",
  "data/redirect-devtop/2021/6/723138.json": "Actually you can create a bootstrap React project with tools like CRA: Create React App, Vite and so...",
  "data/redirect-devtop/2021/6/724779.json": "Git commands aren't always easy. If they were, we would have these commands at our disposal. They wou...",
  "data/redirect-devtop/2021/6/725181.json": "Scaling, provisioning, and configuring cloud resources manually often results in errors that can affe...",
  "data/redirect-devtop/2021/6/721967.json": "Myths have accompanied man since ancient times and still exist in our high-tech world. So despite the...",
  "data/redirect-devtop/2021/6/725423.json": "Hi there! I'm a senior React.js dev and recently I think more and more about relocating to the US or...",
  "data/redirect-devtop/2021/6/724209.json": "I'm Hiep. I work as a full-time software engineer. Most of my open-source projects are focused on one...",
  "data/redirect-devtop/2021/6/725372.json": "Do you write conditionals correctly within your React applications?  Good conditionals are an essenti...",
  "data/redirect-devtop/2021/6/725205.json": "I'm Hiep. I work as a full-time software engineer. Most of my open-source projects are focused on o...",
  "data/redirect-devtop/2021/6/724634.json": "I love using Angular for my work and side projects. Come read why in this entirely opinion-based article!",
  "data/redirect-devtop/2021/6/724577.json": "Side projects may be daunting to plan, but fun to code. With a proper planning system, you too, can g...",
  "data/redirect-devtop/2021/6/724156.json": "Java has been used most of the time for learning the various concepts of Object Oriented Programming...",
  "data/redirect-devtop/2021/6/724101.json": "There are many Web Developers out there who are beginning their journey and are wasting a lot of time...",
  "data/redirect-devtop/2021/6/724647.json": "CORS, or Cross-Origin Resource Sharing, is one thing that can bite a developer early on when creating...",
  "data/redirect-devtop/2021/6/720520.json": "Every programmer has a tale to share about vicious cycles in their life. Here are a few common forms...",
  "data/redirect-devtop/2021/6/724419.json": "Sometimes it's preferible to keep your local development environment as close to production as possib...",
  "data/redirect-devtop/2021/6/724128.json": "What is Visual Regression Testing?    In a definition from more famous Wikipedia, Regression...",
  "data/redirect-devtop/2021/6/725197.json": "Hello Guys,  Today I created a Amazing Button Loading Animation with HTML &amp; JS. This is simple Lo...",
  "data/redirect-devtop/2021/6/725198.json": "This tutorial will help you build quickly a developer friendly GraphQL API for Elasticsearch.  Search...",
  "data/redirect-devtop/2021/6/725702.json": "This post contains affiliate links. If you use these links to buy something I may earn a commission....",
  "data/redirect-devtop/2021/6/726096.json": "There’s a special syntax to work with promises in a more comfortable fashion, called “async/await”. It’s surprisingly easy to understand and use.",
  "data/redirect-devtop/2021/6/726071.json": "Python Projects For Beginners   The best way to learn any new programming language easily is...",
  "data/redirect-devtop/2021/6/725743.json": "Being a junior developer is not easy. You have a lot of work to do, and you're expected to know...",
  "data/redirect-devtop/2021/6/725614.json": "Javascript has evolved into one of the most robust languages. Before javascript was just mainly focus...",
  "data/redirect-devtop/2021/6/726270.json": "Hello, glad you are here. I am kunaal and today we will see how to make an awesome fully responsive...",
  "data/redirect-devtop/2021/6/725993.json": "While there is still a lot more to come, I thought may be fascinating to share its top new...",
  "data/redirect-devtop/2021/6/724937.json": "Let's talk about a set of CSS loaders / spinners that I've made recently. A little brief on the idea...",
  "data/redirect-devtop/2021/6/725374.json": "Both merge and rebase are excellent tools in the Git toolset, and each is associated with their own d...",
  "data/redirect-devtop/2021/6/726288.json": "In this article, we are going to see how we can implement a copy to clipboard functionality on our...",
  "data/redirect-devtop/2021/6/724379.json": "Whether you're building your own API, or using a third-party service, it’s a pretty good idea to make...",
  "data/redirect-devtop/2021/6/725959.json": "Learn how different ways of instantiating useRef influence the ref mutability.",
  "data/redirect-devtop/2021/6/725434.json": "TLDR; I built a map of AWS Community Builders using AWS Location Services.  Click here for the map,...",
  "data/redirect-devtop/2021/6/726267.json": "The Road From Junior to Senior Developer.  Being a programmer is a great thing. For me, there’s...",
  "data/redirect-devtop/2021/6/726463.json": "In this article, we are going to see, how to create a React Native App which can run on Android, iOS...",
  "data/redirect-devtop/2021/6/724885.json": "Introduction   Have you ever needed to build a large SPA with react or vue? How do you keep...",
  "data/redirect-devtop/2021/6/726616.json": "Binary is the very core of everything digital, not only in web development, but literally everything:...",
  "data/redirect-devtop/2021/6/715221.json": "CSS for large projects     This is the content I prepared for my youtube channel's...",
  "data/redirect-devtop/2021/6/726852.json": "React is a JavaScript library that lets you create a prime UI for both mobile and web applications....",
  "data/redirect-devtop/2021/6/726302.json": "Forwarding Refs is a Technique in React. Do you know what is Ref in react?? Refs are a function...",
  "data/redirect-devtop/2021/6/726775.json": "Using Rem and Em units is better than using px.   When we use px, it means that we hardcode the...",
  "data/redirect-devtop/2021/6/726269.json": "Some of the best practices I learned after 3 projects in 1.5 years",
  "data/redirect-devtop/2021/6/727232.json": "Center aligning items has being a much-discussed topic in CSS. Beginners and sometimes professionals...",
  "data/redirect-devtop/2021/6/724778.json": "With the world depending on the web for data, there are numerous chances to bring in cash as an...",
  "data/redirect-devtop/2021/6/717676.json": "Git is a significant piece of day by day programming and is normally utilized in the product...",
  "data/redirect-devtop/2021/6/726335.json": "I'm Hiep. I work as a full-time software engineer. Most of my open-source projects are focused on...",
  "data/redirect-devtop/2021/6/726522.json": "The `-webkit-box-reflect` CSS property lets you reflect the content of an element in one specific...",
  "data/redirect-devtop/2021/6/726081.json": "How to create a super simple accordion component in Angular. Using the power of content projection in...",
  "data/redirect-devtop/2021/6/726595.json": "This article will show you how to build a telegram bot for a small-scale business owner. This bot...",
  "data/redirect-devtop/2021/6/727015.json": "Hello Guys,  Today I created a Amazing Notification Budge Using HTML &amp; CSS. Currently I am at my...",
  "data/redirect-devtop/2021/6/727767.json": "React is a very popular JavaScript library for building User Interfaces. Using React makes the...",
  "data/redirect-devtop/2021/6/727105.json": "Slide in on Scroll   demo    On Day-13 of JS-30 we made a Slide-in-on-Scroll, that is when...",
  "data/redirect-devtop/2021/6/726344.json": " Another new proposal for ECMAScript addition, giving you the ability to cleanly access array elements using negative indices.",
  "data/redirect-devtop/2021/6/727229.json": "We have a lot of array methods in JavaScript but in this blog you are gonna see only the most useful...",
  "data/redirect-devtop/2021/6/726398.json": "In our previous post of the series we have created the REST API's in Mojolicious  The swagger ui is...",
  "data/redirect-devtop/2021/6/726724.json": "Hey guys 👋, in this article we are going to look at the two different methods that we can use to host...",
  "data/redirect-devtop/2021/6/726585.json": "JavaScript nos proporciona una serie de funciones predefinidas para el manejo de arrays.  Antes de...",
  "data/redirect-devtop/2021/6/727063.json": "I'm Hiep. I work as a full-time software engineer. Most of my open-source projects are focused on...",
  "data/redirect-devtop/2021/6/726483.json": "What Is SSH?   SSH or Secure Shell allows people to have remote access to their servers. It...",
  "data/redirect-devtop/2021/6/727976.json": "We can found good practices of almost any programming language in Google. But I can't say that about...",
  "data/redirect-devtop/2021/6/727591.json": "React offers a number of built-in hooks you can use right away. Aside to these, you can also create...",
  "data/redirect-devtop/2021/6/728003.json": "Free...",
  "data/redirect-devtop/2021/6/727826.json": "The fun continue with another collection of 100 CSS loaders!  Always the same rule: one div = one...",
  "data/redirect-devtop/2021/6/726839.json": "There are many web developers who are starting out and don't know how to add custom fonts to their...",
  "data/redirect-devtop/2021/6/727848.json": "Hello, glad you are here. I am kunaal and today we will see how to make an awesome header with...",
  "data/redirect-devtop/2021/6/728266.json": "Introduction   In this article, we will discuss a few topics that can help your Javascript...",
  "data/redirect-devtop/2021/6/725471.json": "Nowadays, a lot of companies are investing towards the migration of their on-premises applications...",
  "data/redirect-devtop/2021/6/728627.json": "Responsive web design is a method of creating and developing websites so that they are more...",
  "data/redirect-devtop/2021/6/728072.json": "Well, it's been a long time since I haven't made any posts, and I just felt like I should speak a bit...",
  "data/redirect-devtop/2021/6/726920.json": "We all know that crypto mining is negatively impacting many things in the world. And now it's ruining...",
  "data/redirect-devtop/2021/6/725646.json": "As some of you know I joined the Marko team at eBay a year ago. And for many the immediate question...",
  "data/redirect-devtop/2021/6/728923.json": "You are five. You know almost nothing about the world. And know you’re going to learn one of the...",
  "data/redirect-devtop/2021/6/728562.json": "I just took a short look at the (neo)vim docs, and I'm officially moving to (neo)vim (and tmux)! I...",
  "data/redirect-devtop/2021/6/729080.json": "I asked developers in my team what VS Code extensions they use to boost their productivity, and...",
  "data/redirect-devtop/2021/6/726258.json": "[JS#3 WIL 🤔 Post]   Most websites and applications written would, at some point request data...",
  "data/redirect-devtop/2021/6/728534.json": "Object destructuring is a useful JavaScript feature to extract properties from objects and bind...",
  "data/redirect-devtop/2021/6/728535.json": "Let me tell you a story about a client.  This client was demanding. They wanted all the things, and...",
  "data/redirect-devtop/2021/6/729227.json": "Hi,  I recently launched a new theme to Loopple, a Free Low Code Dashboard Builder that aims to help...",
  "data/redirect-devtop/2021/6/729194.json": "Hi there,  This is Ankit, your friendly DevOps content curator. I read a lot of articles about...",
  "data/redirect-devtop/2021/6/725960.json": "A month ago, I posted on twitter that I was learning git rebase at work and how scary it felt.      ...",
  "data/redirect-devtop/2021/6/728689.json": "React 17 was a bit of a bore for developers. There really wasn't a lot added but it's definitely not...",
  "data/redirect-devtop/2021/6/729835.json": "Open source development tools come in many shapes and sizes, and selecting the right one is a complex process. This post identifies the tools you need to try.",
  "data/redirect-devtop/2021/6/729688.json": "First we need to know what is 404 Page ?  The HTTP 404, 404 Not Found, 404, 404 Error, Page Not Found...",
  "data/redirect-devtop/2021/6/722174.json": "CodeLand is coming back in 2021 as a two-day virtual conference on September 23rd and 24th!  While...",
  "data/redirect-devtop/2021/6/729072.json": "Do you really need a form library to build forms in React?  Hello friends, today I will talk to you...",
  "data/redirect-devtop/2021/6/727237.json": "Hi all 👋  React 16.8 V comes with several useful features and one being hooks. Hooks are super...",
  "data/redirect-devtop/2021/6/728263.json": "Hello, everybody!  I don't know about you, but I'm personally a huge fan of changing my VSCode theme...",
  "data/redirect-devtop/2021/6/729696.json": "Cover photo credit: Unsplash  As a frontend developer, you have probably struggled to find images,...",
  "data/redirect-devtop/2021/6/724420.json": "Learn why Blazor is the next reasonable choice for SPA development.",
  "data/redirect-devtop/2021/6/729190.json": "Hello,  Today I have written this post about the 5 amazing API every developer know there are in this...",
  "data/redirect-devtop/2021/6/730243.json": "The use of Styled components in React.js app development has become quiet popular in the last few...",
  "data/redirect-devtop/2021/6/729769.json": "Here's my HTML code.    &lt;!DOCTYPE html&gt; &lt;html lang=\"en\"&gt; &lt;head&gt;     &lt;meta...",
  "data/redirect-devtop/2021/6/728400.json": "Hi! Programming can be overwhelming 😫 but once you are comfortable with some basic concepts,...",
  "data/redirect-devtop/2021/6/729070.json": "React App*   * created using create-react-app           Introduction   In this tutorial,...",
  "data/redirect-devtop/2021/6/730009.json": "Photo by  Kelly Sikkema  ☕️ Read this article on my blog  When it comes to building forms with React,...",
  "data/redirect-devtop/2021/6/729141.json": "Another new proposal for ECMAScript addition, giving you the ability to cleanly access array elements using negative indices.",
  "data/redirect-devtop/2021/6/730260.json": "Introduction  When developing websites, the first question for developers is about creating a design....",
  "data/redirect-devtop/2021/6/728276.json": "Since I am not getting paid by the hour (except in some cases), staying productive and healthy as a...",
  "data/redirect-devtop/2021/6/730338.json": "React 18 alpha version was just announced. The theme of React 18 is to make the UI more performant by...",
  "data/redirect-devtop/2021/6/731098.json": "Hey how are you ! Welcome here my name is Code Oz and I will share with you some tips on VueJs (I...",
  "data/redirect-devtop/2021/6/729710.json": "It's been a month since the last post, so it means it's time to continue my blog post series - Top 10...",
  "data/redirect-devtop/2021/6/729510.json": "If you're a JavaScript developer, then you should be familiar with the most commonly used...",
  "data/redirect-devtop/2021/6/730959.json": "Here's a list of amazing tricks that you can use to improve your React applications instantly.  These...",
  "data/redirect-devtop/2021/6/730452.json": "Originally, This was published on *The Zyox Letter*, The best Newsletter for Programming, tech,...",
  "data/redirect-devtop/2021/6/730816.json": "You can find it using Chrome via \"Dev Tools\" 😊    Open dev tools (F12) Type: Ctrl + Shift +...",
  "data/redirect-devtop/2021/6/730202.json": "A list of 10 awesome UI libraries that will help you bootstrap your next React project",
  "data/redirect-devtop/2021/6/728927.json": "In programming, there is a technique for writing code called object-oriented programming. It's a...",
  "data/redirect-devtop/2021/6/730630.json": "Hello, welcome to this tutorial. Today, I will be explaining how to build commonly used web...",
  "data/redirect-devtop/2021/6/731394.json": "CSS is Cascading Style Sheets and is used to describe how HTML elements should display. It’s one of...",
  "data/redirect-devtop/2021/6/730629.json": "P.S. I just want to frontload this article to ask you what is your opinion about the new professional...",
  "data/redirect-devtop/2021/6/731543.json": "Plug: I help develop million: &lt;1kb virtual DOM - it's fast!            Introduction   The virtual...",
  "data/redirect-devtop/2021/6/731724.json": "This tutorial will mainly focus on how to use transitions in CSS and make a toggle button for light...",
  "data/redirect-devtop/2021/6/730481.json": "Web push notifications are a versatile channel that can be used to enhance your UX, re-engage...",
  "data/redirect-devtop/2021/6/729676.json": "Hello reader!   Ever wanted to commit something to a git repo with a past date? Here’s how you could...",
  "data/redirect-devtop/2021/6/731510.json": "The useRef hook in react is used to create a reference to an HTML element. Most widely used scenario...",
  "data/redirect-devtop/2021/6/730450.json": "Let's face it, building a database that works is not a challenge at all. The real challenge is to...",
  "data/redirect-devtop/2021/6/730834.json": "I am proud to announce I finally built my first desktop application. And even if I can't consider it...",
  "data/redirect-devtop/2021/6/729237.json": "There are plenty of opportunities to expand your income beyond your day job.  Being a programmer is a...",
  "data/redirect-devtop/2021/6/731855.json": "Free And Best...",
  "data/redirect-devtop/2021/6/729090.json": "If you're here you're probably familiar with the CSS utility goodness that is Tailwind CSS. Using the...",
  "data/redirect-devtop/2021/6/730741.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/6/732491.json": "Introduction  Hello, Friends. Today, I would like to show you the portfolios that I found on the...",
  "data/redirect-devtop/2021/6/731013.json": "Please checkout my first ever macOS themed Portfolio website...",
  "data/redirect-devtop/2021/6/729984.json": "There are many ways to fetch data from an external API in React. But which one should you be...",
  "data/redirect-devtop/2021/6/716813.json": "React is the most popular and best user interface framework in the technology world. Many large...",
  "data/redirect-devtop/2021/6/731091.json": "The this keyword has been associated with a lot of confusion. The use of the this keyword depends on...",
  "data/redirect-devtop/2021/6/732589.json": "10 amazing developers to follow to improve your skills in front end and back end and programming as a...",
  "data/redirect-devtop/2021/6/731857.json": "Javascript is great but typescript, is (controversially) even better. It adds type safety to a...",
  "data/redirect-devtop/2021/6/731736.json": "In most of the applications, we need to display a formatted date like 18 June 2021 or 06/18/2021...",
  "data/redirect-devtop/2021/6/732432.json": "In this short article, we are going to see how we can handle error in JavaScript in Golang style.  I...",
  "data/redirect-devtop/2021/6/731529.json": "In Functional Programming, code is organized into smaller, basic functions that can be combined to...",
  "data/redirect-devtop/2021/6/732043.json": "If you want to build projects efficiently, then this concept is for you.  The theory of async...",
  "data/redirect-devtop/2021/6/730735.json": "The pandemic of 2019-2020 made us all lazy. With no option but to sit at home, 35.82% of us gained...",
  "data/redirect-devtop/2021/6/730409.json": "Choosing a web framework is hard especially now when there are a lot of frameworks on the market,...",
  "data/redirect-devtop/2021/6/731382.json": "The idea for a web-components.json was first suggested in this GitHub issue on the web components...",
  "data/redirect-devtop/2021/6/732724.json": "Hi all 👋 So after quite a break, we are back with another article in the React Series with two...",
  "data/redirect-devtop/2021/6/732292.json": "JSON  is a data format with a number of data types such as strings,  booleans, lists, numbers,...",
  "data/redirect-devtop/2021/6/732722.json": "Front End Skills   It is so easy to get stuck following tutorial after tutorial and not...",
  "data/redirect-devtop/2021/6/728708.json": "As frontend developers, we always want to use the latest and the greatest. A lot of the time however,...",
  "data/redirect-devtop/2021/6/731874.json": "The right branching model will improve any team’s collaboration, quality, and speed. The wrong model...",
  "data/redirect-devtop/2021/6/732846.json": "Hi there,  This is Ankit, your friendly DevOps content curator. I read a lot of articles about...",
  "data/redirect-devtop/2021/6/726894.json": "This article lives in:   Dev.to Medium GitHub            In very short   The future of FastAPI and...",
  "data/redirect-devtop/2021/6/731528.json": "What is your favorite music to work to? OR do you prefer no music at all because you need quiet to...",
  "data/redirect-devtop/2021/6/732852.json": "One of the prime advantages of a version control system is to be able to code fearlessly and be able...",
  "data/redirect-devtop/2021/6/732916.json": "Are you about to start a new job?   If so, by now, I’m sure at least some of that initial...",
  "data/redirect-devtop/2021/6/733086.json": "James Bond, Ethan Hunt, Napoleon Solo - secret agents working in disguise, sending secret messages to...",
  "data/redirect-devtop/2021/6/733087.json": "Hey,  This article is helpful who want to improve their programming skills or might want to make...",
  "data/redirect-devtop/2021/6/733337.json": "You’ll think this article is clickbait, but it’s not. I’ve built a fully-functional static serverless...",
  "data/redirect-devtop/2021/6/732769.json": "Let's jump straight in, you don't need an introduction with a listicle.           1. Listicles...",
  "data/redirect-devtop/2021/6/732876.json": "I have been meaning to write this article about how I configure my favorite IDE; VS Code. I'm writing...",
  "data/redirect-devtop/2021/6/732953.json": "Most ambitious developers follow the same pattern: they do 9-to-5 jobs, participate in hackathons and...",
  "data/redirect-devtop/2021/6/732867.json": "Being a beginner in the technical field, knowing one of the object-oriented programming languages in...",
  "data/redirect-devtop/2021/6/733203.json": "This blog is inspired by the Tweet by Pratham  For more amazing content do follow him on...",
  "data/redirect-devtop/2021/6/733261.json": "This is my latest video on YouTube, the FARM stack course, although this stack is not as popular...",
  "data/redirect-devtop/2021/6/733233.json": "I was planning to build an online portfolio as an OS clone, my idea was to build it as a portfolio...",
  "data/redirect-devtop/2021/6/733783.json": "Insha                       @insharamin                             ...",
  "data/redirect-devtop/2021/6/733866.json": "Currently, I'm learning Nextjs and Typescript. And for learning perspective I decided to rebuilt my...",
  "data/redirect-devtop/2021/6/727537.json": "On the off chance that you are new to coding, you may contemplate whether you can get a grip of a...",
  "data/redirect-devtop/2021/6/733209.json": "Recently, I came across an article about the problem of loading CSS files, which slows down the...",
  "data/redirect-devtop/2021/6/733369.json": "Hello Devs, In this Post I'm gonna show you some top Django projects that can get you a job very...",
  "data/redirect-devtop/2021/6/733512.json": "In this article you will learn how to create sidebar menu using HTML CSS and JavaScript code. Like...",
  "data/redirect-devtop/2021/6/733966.json": "GitHub is not just a version control service; it is a terrific content resource for...",
  "data/redirect-devtop/2021/6/732856.json": "Live Streaming is becoming an increasingly popular form of entertainment. As it grows, streamers...",
  "data/redirect-devtop/2021/6/733860.json": "What is the first thing you think of when someone says responsive websites? What comes rushing to...",
  "data/redirect-devtop/2021/6/733229.json": "In this article, we are building a Kanban Board with plain HTML, CSS &amp; JavaScript. This article...",
  "data/redirect-devtop/2021/6/725995.json": "Writing front-end code is easy. But writing reliable front-end code? That's tough.  Modern UIs are...",
  "data/redirect-devtop/2021/6/733901.json": "When grouping selectors, keep individual selectors to a single line. Don't prefix property values...",
  "data/redirect-devtop/2021/6/734102.json": "If you are wondering how to create a TypeScript BackEND project, fear not my brave knight. It's way...",
  "data/redirect-devtop/2021/6/733961.json": "How and why you should start contributing to the ruby ecosystem",
  "data/redirect-devtop/2021/6/734398.json": "In this article you are going to learn how to create image slider using HTML, CSS and JavaScript...",
  "data/redirect-devtop/2021/6/734110.json": "Hooks make developers' life easy by helping in writing fewer lines of code, clean code, more...",
  "data/redirect-devtop/2021/6/734723.json": "When I stumbled upon React, I barely had any JS knowledge. I had been told by my peers and the...",
  "data/redirect-devtop/2021/6/734757.json": "NPM stands for Node Package Manager and it is the package manager for the Node JavaScript platform....",
  "data/redirect-devtop/2021/6/734995.json": "learn web development, HTML, CSS and JavaScript",
  "data/redirect-devtop/2021/6/734490.json": "Finding a job can take a lot of effort and energy, especially in the current climate of the world....",
  "data/redirect-devtop/2021/6/734239.json": "The internet has inarguably been the most important technology revolution in the history of mankind...",
  "data/redirect-devtop/2021/6/734491.json": "this article is generated using (give a ⭐)                                 Manitej66        /       ...",
  "data/redirect-devtop/2021/6/734409.json": "Hi there,  This is Ankit, your friendly DevOps content curator. I read a lot of articles about...",
  "data/redirect-devtop/2021/6/734541.json": "Introduction   Hello there, This is Darshan Ponikar and today we are going to talk about...",
  "data/redirect-devtop/2021/6/733566.json": "YouTube is considering a to be expansion in rush hour gridlock as an instructive stage, well known...",
  "data/redirect-devtop/2021/6/727262.json": "The type attribute   There is a practice to use extra classes when we create a custom...",
  "data/redirect-devtop/2021/6/734076.json": "In this GitHub Actions Tutorial you will be able to go from zero to hero in 90 minutes. By the end of...",
  "data/redirect-devtop/2021/6/734222.json": "Very often we come across small games and wonder how complex is it? Can we build it? More often than...",
  "data/redirect-devtop/2021/6/730589.json": "Conference CFP open now until July 20th",
  "data/redirect-devtop/2021/6/735537.json": "In this article you will get to know about smooth CSS Shadows and a easy way to use them.  But first...",
  "data/redirect-devtop/2021/6/735726.json": "Click ⭐ if you like the project. Pull Requests are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/6/735159.json": "With the growth of internet and mobile, building the cross platform real-time chat experience into...",
  "data/redirect-devtop/2021/6/735892.json": "Today you're going to create one of the most important apps you can build for yourself: your...",
  "data/redirect-devtop/2021/6/734827.json": "In just 3 simple steps, you can use Kool CLI's kool create command to start a new Laravel application...",
  "data/redirect-devtop/2021/6/735768.json": "As I have always said, your level of comprehension on any topic is intrinsically linked to the...",
  "data/redirect-devtop/2021/6/735331.json": "I have a simple message for web developers, start adding the color-scheme property to your...",
  "data/redirect-devtop/2021/6/735428.json": "Various articles over the internet have already discussed the benefits of using react-query. The ease...",
  "data/redirect-devtop/2021/6/735424.json": "In this article you are going to learn how to create digital clock using HTML CSS and JavaScript...",
  "data/redirect-devtop/2021/6/735919.json": "Hello Developers! All we are using either Axios OR fetch to communicate/exchange data with server....",
  "data/redirect-devtop/2021/6/735420.json": "There are way too many no code / low code tools out there that are sadly empty promises. Within this post, I will present the 4 no code / low code tools that I use in production, as a developer",
  "data/redirect-devtop/2021/6/736492.json": "Becoming a Git power-user is on the bucket list of every developer. Today we prepared 5 Git tips that...",
  "data/redirect-devtop/2021/6/736552.json": "Accessibility is the ability for applications to be used by everyone, including those with...",
  "data/redirect-devtop/2021/6/734746.json": "Hello, everybody! 🚀  Today we'll be covering CSS selectors in depth.              Table of...",
  "data/redirect-devtop/2021/6/737127.json": "At Builder.io, we empower non-developers to build and edit blazing fast sites with a powerful visual...",
  "data/redirect-devtop/2021/6/734725.json": "Have you ever wanted to create a real-time chat app or just curious about how the operation looks...",
  "data/redirect-devtop/2021/6/736496.json": "Webpack is a build tool to make code, which was not primarily written for execution in browsers,...",
  "data/redirect-devtop/2021/6/733863.json": "Typescript is the next big thing in the Front End Development domain and if you are looking to...",
  "data/redirect-devtop/2021/6/735702.json": "When you create a website, you essentially create a bunch of different files. These files need to be...",
  "data/redirect-devtop/2021/6/734811.json": "The best way to practice JavaScript is to work on the project.   \"Don't take on the Project whole at...",
  "data/redirect-devtop/2021/6/735152.json": "Follow me!: Follow @EricTheCoder_    Many new web developers have absolutely no idea what is Ruby on...",
  "data/redirect-devtop/2021/6/730496.json": "Listen to S5E7 of DevDiscuss!",
  "data/redirect-devtop/2021/6/735022.json": "As a developer, authorization and authentication are two terms that you might have come across....",
  "data/redirect-devtop/2021/6/736158.json": "Nowadays JavaScript is everywhere 🌍   Hello 👋, Beautiful Coders on the internet 😃. In this article,...",
  "data/redirect-devtop/2021/6/735656.json": "Developing modern web applications involves not only UI building but also state management. One of...",
  "data/redirect-devtop/2021/6/735382.json": "Introduction   Stress is a natural reaction of our body when we face situations we can't...",
  "data/redirect-devtop/2021/6/736796.json": "Yep, this is yet another “article” about how amazing pure CSS is and how you can do something cool...",
  "data/redirect-devtop/2021/6/737092.json": "Want to learn how to build a static blogging site which is exteremly fast easy to...",
  "data/redirect-devtop/2021/6/737417.json": "DevOps is hot right now. It seems like every software engineering job posting requires DevOps...",
  "data/redirect-devtop/2021/6/737723.json": "When we're trying to learn something new, it can oftentimes be tempting to dive headfirst into...",
  "data/redirect-devtop/2021/6/736571.json": "Hello guys,🙋‍♂️ this short article is about my recent side project called          ...",
  "data/redirect-devtop/2021/6/735745.json": "Hello Guys,  Today I created an Amazing Button Animation Using HTML &amp; JS. In this button...",
  "data/redirect-devtop/2021/6/737962.json": "TL;DR: We've built awesome.cube.dev to help you choose the best charting libraries and other tools...",
  "data/redirect-devtop/2021/6/733589.json": "Certification Course helps a person to grandstand his capability, responsibility for the calling,...",
  "data/redirect-devtop/2021/6/737861.json": "Angular is a framework, while React and Vue are libraries, therefore angular is heavier than the...",
  "data/redirect-devtop/2021/6/715774.json": "Introduction   In the previous posts, we saw how to:   use CSS to handle different...",
  "data/redirect-devtop/2021/6/736875.json": "There are many types of addiction, but addiction to GitHub is a unique and interesting one. Although...",
  "data/redirect-devtop/2021/6/727447.json": "Cover Photo by Alexander Shatov on Unsplash  Netflix accounts for about 15% of the world's internet...",
  "data/redirect-devtop/2021/6/737968.json": "I developed an offline-first personal Kanban app called Brisqi and launched it for 5 different...",
  "data/redirect-devtop/2021/6/738562.json": "Full Portfolio Demo  Introduction  Today I would like to share with you my experience in developing a...",
  "data/redirect-devtop/2021/6/738039.json": "So, if you are like me, a frontend developer who loves to work with Tailwind CSS, then this article...",
  "data/redirect-devtop/2021/6/738035.json": "Introduction   In this article, I am going to introduce NodeJS with Node Package Module...",
  "data/redirect-devtop/2021/6/737490.json": "In this article, we will take a closer look at template literal types and how you can take advantage...",
  "data/redirect-devtop/2021/6/736568.json": "As a coder, finding a text editor that works for you is critical. You’ll be spending tons of time...",
  "data/redirect-devtop/2021/6/736017.json": "How to create a calculator using Bootstrap 5 and Vue.js",
  "data/redirect-devtop/2021/6/738696.json": "Top UI frameworks for react   UI libaries are very popular for creating beautiful looking...",
  "data/redirect-devtop/2021/6/729439.json": "Today, June 23, would be the 109th birthday of Alan Turing: brilliant English mathematician, computer...",
  "data/redirect-devtop/2021/6/738004.json": "DevOps is one of the most challenging fields to be in, and to stay relevant you need to learn...",
  "data/redirect-devtop/2021/6/737558.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/6/738840.json": "Learn how easily you can create and configure the Syncfusion React Calendar using the...",
  "data/redirect-devtop/2021/6/737347.json": "This post is for the people who are interested in React Native because they have experience with...",
  "data/redirect-devtop/2021/6/737933.json": "When debugging microservices, it can be challenging for developers to identify the root cause of...",
  "data/redirect-devtop/2021/6/739321.json": "Please give me Github ⭐ if you like the project. Pull Request are highly appreciated ❤️   Github...",
  "data/redirect-devtop/2021/6/725577.json": "TL;DR   In a rush? This article two sentences: Set a higher value on your tags weighting so...",
  "data/redirect-devtop/2021/6/739056.json": "Introduction   Web development is much more fun now than ever.  We have increasing...",
  "data/redirect-devtop/2021/6/739355.json": "this article is generated using (give a ⭐)                                   Manitej66        /     ...",
  "data/redirect-devtop/2021/6/738231.json": "Using CSS, links can be styled in many different ways.  We can change the style of CSS link...",
  "data/redirect-devtop/2021/6/737184.json": "I saw this online and thought it was pretty neat. Check out this...",
  "data/redirect-devtop/2021/6/739104.json": "Hello,  Today I have written post about the 8 Amazing Instant Button Hover Effect With using HTML...",
  "data/redirect-devtop/2021/6/737168.json": "Pagination is an integral part of any modern web and mobile application. In this article, we will look at how to implement pagination into a table that shows weather data. We’ll be using react, node.js, the OpenWeatherMap API, as well as the react-paginate library itself.",
  "data/redirect-devtop/2021/6/737471.json": "In this article, we will explore the lesser-known but very useful features provided by...",
  "data/redirect-devtop/2021/6/737294.json": "let a = 3; let b = new Number(3); let c = 3;  console.log(a == b); console.log(a ===...",
  "data/redirect-devtop/2021/6/737180.json": "Hey everyone 👋🏻, in this blog we are going  to discuss about :   Arrow Functions V/S Regular...",
  "data/redirect-devtop/2021/6/737203.json": "I have a bunch of projects I am working on for fun, mostly around web apps. Some of them are just...",
  "data/redirect-devtop/2021/6/738825.json": "Ever since I started building Rails app, I've dreamt about one day building mobile apps in Rails....",
  "data/redirect-devtop/2021/6/737335.json": "After two years of Fluttering, I would like to share in this article the best practices that I’ve...",
  "data/redirect-devtop/2021/6/739917.json": "Docker is an open platform for developing, shipping, and running applications. Docker enables you to...",
  "data/redirect-devtop/2021/6/739897.json": "Public APIs     This GitHub repository contains a ton of free APIs related to various...",
  "data/redirect-devtop/2021/6/739121.json": "Do you want to know how to dealing with stress while coding? Here's some tips to do when you're...",
  "data/redirect-devtop/2021/6/740257.json": "Let's clone dev.to with the actual dev.to api to get the posts and listings.          ...",
  "data/redirect-devtop/2021/6/740065.json": "Working as a web developer I work on the client side dealing with lots of continuous data from the...",
  "data/redirect-devtop/2021/6/739353.json": "Hey Devs, today we're going to make an awesome login and registration form with  sliding animation...",
  "data/redirect-devtop/2021/6/739366.json": "Most of the newcomers are planning to go for full-stack development.           What is a full-stack...",
  "data/redirect-devtop/2021/6/739860.json": "Hello Everyone,  So around one month ago i created a simple social media site because i was bored and...",
  "data/redirect-devtop/2021/6/740254.json": "Big(O) is the way in which we compare algorithmic complexities of two programs in a standard...",
  "data/redirect-devtop/2021/6/740551.json": "Hello friends, Today we have the top 5 resources that you can use to learn javascript. Javascript is...",
  "data/redirect-devtop/2021/6/738872.json": "Top 5 books EVERY programmer MUST read!   We all want to become a better programmer, and...",
  "data/redirect-devtop/2021/6/733528.json": "A designer's work process is loaded with expected digressions, interferences and setting switches....",
  "data/redirect-devtop/2021/6/739596.json": "What is React.js ??    React.js is an open-source JavaScript library that is used for building user...",
  "data/redirect-devtop/2021/6/739861.json": "In this article, we will learn how to create a Feature Rich Virtual Assistant in Python. We will be...",
  "data/redirect-devtop/2021/6/733588.json": "In the Developer community there are many articles posted everyday. So today in this same average...",
  "data/redirect-devtop/2021/6/740103.json": "All right, so now we want to style these buttons, these icon buttons, position them.  We want to give...",
  "data/redirect-devtop/2021/6/740559.json": "Introduction   If you want to collaborate, discuss and code in a group of developers, just...",
  "data/redirect-devtop/2021/6/740527.json": "Hello guys, today I am going to show you how to create a signature pad using HTML CSS &amp;...",
  "data/redirect-devtop/2021/6/740015.json": "We IT people LOVE tinkering with new tech stuff, and Docker is no exception. As a matter of fact, ...",
  "data/redirect-devtop/2021/6/739324.json": "There are tons of libraries out there that will help you with icons in React, but there's an even easier way.",
  "data/redirect-devtop/2021/6/740810.json": "As individuals who take initiatives to improve our abilities and become a better version of...",
  "data/redirect-devtop/2021/6/741006.json": "This is a free book on React meant for completely new developers in React. Even more experienced devs should be able to find something",
  "data/redirect-devtop/2021/6/741103.json": "Reactjs is a javascript framework. But a beginner can struggle if they don't have solid javascript...",
  "data/redirect-devtop/2021/6/740977.json": "Hello there, I hope you are doing well. So today we are going to talk about the Next.JS! Why...",
  "data/redirect-devtop/2021/6/740302.json": "This blog will discuss how to setup, build and run your own Chrome extension. At the end, you will be...",
  "data/redirect-devtop/2021/6/735339.json": "So, you want to go on the path of SQL?  But don't know where to start?  Well, look no further.   I've...",
  "data/redirect-devtop/2021/6/735951.json": "Introduction   Web development is the work involved in developing a Web site for the...",
  "data/redirect-devtop/2021/6/740522.json": "Git is one of the most used tools in the tech industry as it efficiently solves the version control...",
  "data/redirect-devtop/2021/6/726897.json": "Reusable function to run any Promise that returns an array of data and error.  Using Async/Await is...",
  "data/redirect-devtop/2021/6/741140.json": "Javascript is so widely adopted that most developers can't avoid it entirely during the course of...",
  "data/redirect-devtop/2021/6/741106.json": "Currying is a process in functional programming in which we can transform a function with multiple...",
  "data/redirect-devtop/2021/6/740553.json": "Here are the 10 services that provide free hosting for your React App.  React is the most popular...",
  "data/redirect-devtop/2021/6/737708.json": "It's been a long road to get here. It's been so long I can't even remember when I started. I logged...",
  "data/redirect-devtop/2021/6/741726.json": "React is a JavaScript library for building UI components. The ecosystem of React is really immense...",
  "data/redirect-devtop/2021/6/741667.json": "Hello Folks 👋   This is Savio here. I hope you all are doing good. I'm young web dev with an...",
  "data/redirect-devtop/2021/6/740425.json": "No-code tools enable users around the world to build technologies without coding. Before the advent...",
  "data/redirect-devtop/2021/6/729904.json": "I improved the textarea, and I'll show you how I did it here!  Here's the final result:              ...",
  "data/redirect-devtop/2021/6/740119.json": "The best codebases I found myself working on had their folders structured around the features the app provides...",
  "data/redirect-devtop/2021/6/741713.json": "If you have ever used React, chances are that you have had to query an API. The importance of data...",
  "data/redirect-devtop/2021/6/741941.json": "JavaScript Interview Questions &amp; Answers            Table of...",
  "data/redirect-devtop/2021/6/740538.json": "This is the age of JavaScript. JavaScript is everywhere in the Full Stack. Let's try solving 30 crazy problems I had in the next 30 days, starting from Feb 14th!",
  "data/redirect-devtop/2021/6/740417.json": "The Problem   For the last five or more years I've been doing it all wrong. I thought that...",
  "data/redirect-devtop/2021/6/742114.json": "Introduction   Have you had issues with managing server state? or find yourself writing long...",
  "data/redirect-devtop/2021/6/741970.json": "The :placeholder-shown pseudo-class represents any &lt;input&gt; or &lt;textarea&gt; element that is...",
  "data/redirect-devtop/2021/6/740966.json": "500 single element CSS loaders. Pure CSS loaders with only one div. The biggest collection of loading...",
  "data/redirect-devtop/2021/6/742651.json": "Algolia Places:   Algolia Places is a JavaScript library that will help you autocomplete forms, and...",
  "data/redirect-devtop/2021/6/741570.json": "Recently, I migrated a project I've been working on to TypeScript. I decided to use Webpack in...",
  "data/redirect-devtop/2021/6/741586.json": "Often developers tend to feel a constant pull from REST while using GraphQL and vice-versa because of...",
  "data/redirect-devtop/2021/6/742745.json": "Hey friends ! I'm sharing with you a lot of ressources about web developper that will help you to...",
  "data/redirect-devtop/2021/6/742696.json": "Creating CSS Art is one of the best ways to improve your front-end programming skills as a developer....",
  "data/redirect-devtop/2021/6/739354.json": "Table of Contents    1. First, get started 2. Do not Bury the Lede ⚡️ 3. Brainstorm on Paper 📝 4....",
  "data/redirect-devtop/2021/6/739312.json": "It's been a while since I wrote my last article on state management in React using Context. Here's...",
  "data/redirect-devtop/2021/6/741834.json": "Site speed can represent the moment of truth of an online business on the web. A successful business...",
  "data/redirect-devtop/2021/6/741890.json": "two best practices to improve your project with this phenomenal library  The styled-components is a...",
  "data/redirect-devtop/2021/6/741095.json": "I am a sucker for interactive websites.  The developer portfolios that have stuck with me have always...",
  "data/redirect-devtop/2021/6/741056.json": "How to upload files to IPFS from a web application using IPFS HTTP Client and Infura",
  "data/redirect-devtop/2021/6/742714.json": "Hi everyone!  Happy to announce, that my library js-confetti now supports emojis!  Please look at...",
  "data/redirect-devtop/2021/6/742995.json": "Hello guys, today I am going to show you how to create an HTML Minifier using HTML CSS &amp;...",
  "data/redirect-devtop/2021/6/741657.json": "Overprovisioning is the top reason why teams see their cloud bills constantly growing. But choosing...",
  "data/redirect-devtop/2021/6/743235.json": "Hey Devs n this video you will learn how to create an Animated Sidebar Menu with HTML &amp; CSS (No...",
  "data/redirect-devtop/2021/6/741400.json": "The 3 most important aspects in the career growth of a developer are:    Developing your...",
  "data/redirect-devtop/2021/6/741196.json": "Does mathematics already scare you? Well, if it does take a deep breath and read on and by any chance...",
  "data/redirect-devtop/2021/6/743317.json": "Listen to the season finale of DevDiscuss!",
  "data/redirect-devtop/2021/6/743609.json": "In this blog we are going to see some cool animated button made using CSS and JS.  1. Social Media...",
  "data/redirect-devtop/2021/6/742712.json": "INTRODUCTION😎  ECMAScript is a part of JavaScript language which is mostly used in web technology,...",
  "data/redirect-devtop/2021/6/742505.json": "This article summarizes a list of React interview questions that I would ask candidates and that I...",
  "data/redirect-devtop/2021/6/743738.json": "It doesn't matter if you never went beyond building simple apps, have no degree in Computer Science...",
  "data/redirect-devtop/2021/6/742663.json": "Using animation in your portfolio site would be a great way to capture the users attention and make...",
  "data/redirect-devtop/2021/6/743828.json": "If you've been working on javascript or related framework projects then definitely you came across...",
  "data/redirect-devtop/2021/6/743250.json": "A short guide to design for programmers",
  "data/redirect-devtop/2021/6/735546.json": "When web first came into existence in 1989, it was decentralised. Anyone could publish their content...",
  "data/redirect-devtop/2021/6/743312.json": "I wrote a post about tsParticles and the new confetti animation created in the 1.30 version.         ...",
  "data/redirect-devtop/2021/6/742779.json": "Reduce complexity, cognitive load, and deployment times by splitting cloud infrastructure from lambda code, using CloudFormation Outputs to share resources, and use SSM to play nice with Terraform and other IaC tools.",
  "data/redirect-devtop/2021/6/744057.json": "This is just how I like to go. Hence, I am sharing this with everyone. But if you do things...",
  "data/redirect-devtop/2021/6/744543.json": "Motivation   Some times last year, around October, I came across this post1 about slack's...",
  "data/redirect-devtop/2021/6/743791.json": "In this tutorial, I will show you how to create a Neumorphism Sidebar Menu using HTML and CSS...",
  "data/redirect-devtop/2021/6/741848.json": "Lazy loading is a common performance optimization technique followed by almost all asset-heavy...",
  "data/redirect-devtop/2021/6/743846.json": "Hello devs 👋  Me and my friend decided to built a glassmorphism css generator based on an upcoming...",
  "data/redirect-devtop/2021/6/742925.json": "Allocating cloud costs is hard, and forecasting them is even harder.  Pinterest once committed to...",
  "data/redirect-devtop/2021/6/729385.json": "You are a developer. You love your headless CMS.  Having an API with no hassles and a modern...",
  "data/redirect-devtop/2021/6/743736.json": "Today, we'll show you how to create a chat UI similar to WhatsApp using the TalkJS Chat API. We'll...",
  "data/redirect-devtop/2021/6/744089.json": "It's a simple To-do app. As a beginner, creating these features like DOM manipulations, animations...",
  "data/redirect-devtop/2021/6/740295.json": "Learn the basics of classic machine learning with Education Cloud Advocates at Microsoft, including regression, clustering, classification, natural language processing, reinforcement learning, time series forecasting, and more",
  "data/redirect-devtop/2021/6/740096.json": "If you are not proficient in Docker, or that topics like containers and virtual machines are still a...",
  "data/redirect-devtop/2021/6/744465.json": "Want to learn ML? Here's a whole course",
  "data/redirect-devtop/2021/6/743638.json": "Object Oriented Programming is one of the most popular ways in programming. Before OOP’s, list of...",
  "data/redirect-devtop/2021/6/743785.json": "What does this title mean   If by reading the title of this article you're thinking that...",
  "data/redirect-devtop/2021/6/742188.json": "A round up of the most-read and most-loved contributions from the community this past week.",
  "data/redirect-devtop/2021/6/743234.json": "With the explosive growth and expansion of open-source projects, the project maintainers have to be...",
  "data/redirect-devtop/2021/6/743746.json": "This is Part 1 in the series called \"UI/UX for Frontend Developers\". A new article will be published...",
  "data/redirect-devtop/2021/6/740100.json": "Developer’s job is one of the most mentally demanding jobs. Developers work with complex algorithms,...",
  "data/redirect-devtop/2021/6/742910.json": "Hey, fams! today we are going to learn how to send e-mails, right from our IDE using NodeJS. The...",
  "data/redirect-devtop/2021/6/744061.json": "I thought I knew a lot of HTML because I didn´t use DIV for everything... accesability matters. I...",
  "data/redirect-devtop/2021/6/744100.json": "Introduction   Every now an then a developer has an idea to simplify building web apps and...",
  "data/redirect-devtop/2021/6/738879.json": "Welcome back to our series on design patterns.   This week are tackling the Builder pattern.   It's...",
  "data/redirect-devtop/2021/6/742521.json": "How can developers be more productive? Devs need to be focused for long hours, often with critical...",
  "data/redirect-devtop/2021/6/743825.json": "If you’re looking at ways to clean up our code, reduce complexity and improve functionality - these...",
  "data/redirect-devtop/2021/6/744589.json": "Building a digital marketplace with Next.js, Tailwind, Solidity, and Polygon",
  "data/redirect-devtop/2021/6/733524.json": "There are many posts regarding types of amazing repos to learn webdev and things. So in this post...",
  "data/redirect-devtop/2021/6/735536.json": "Without the application of JavaScript, the Internet as we know it would not be at the level it is at...",
  "data/redirect-devtop/2021/6/739100.json": "Introduction   React provides a very good and simple way to manage local states through...",
  "data/redirect-devtop/2021/6/743731.json": "One advantage of using React with TypeScript is that you can easily type the props of your (function)...",
  "data/redirect-devtop/2021/6/727742.json": "Some time ago during one of my interviews, a potential employer asked me to describe a perfect...",
  "data/redirect-devtop/2021/6/743826.json": "The beginning of a series of posts illustrating how to generate a QR code. In JavaScript, but adaptable to other languages",
  "data/redirect-devtop/2021/6/743883.json": "Go is a compiled, concurrent, garbage-collected, statically typed language developed at Google. Go...",
  "data/redirect-devtop/2021/6/727555.json": "On this page you'll track down the very most ideal approaches to bring in cash in your extra time...",
  "data/redirect-devtop/2021/6/743540.json": "Prototype?  Your probably thinking of this:    or maybe even this:    I would love to make an article...",
  "data/redirect-devtop/2021/6/742941.json": "Introduction   Recruiters who are interested in the problem solving skills of their...",
  "data/redirect-devtop/2021/6/736303.json": "There’s some simple patterns I tend to follow in my Vue projects that I figure work well enough to...",
  "data/redirect-devtop/2021/6/740213.json": "Why do we keep hearing about Web Performance?   WPO or Web Performance Optimization analyses...",
  "data/redirect-devtop/2021/6/741580.json": "It took the Web a lot of years to introduce the &lt;datalist&gt;-tag, essential in creating one of...",
  "data/redirect-devtop/2021/6/728945.json": "Data-fetching is something I feel does not get the importance and limelight as say state management...",
  "data/redirect-devtop/2021/6/715445.json": "Prólogo   Há tempos eu venho fazendo code reviews em repositórios dos meus viewers, que...",
  "data/redirect-devtop/2021/6/723086.json": "With AWS, customers can enable, provision, and operate their environment for both business agility...",
  "data/redirect-devtop/2021/6/731121.json": "This fairy tale started a long time ago. Often, you make a bet on the wrong horse in life, but,...",
  "data/redirect-devtop/2021/6/737753.json": "In this post we are going to check best GitHub Repositories for Web Developers to learn fundamentals..."
}