{
  "data/redirect-devtop/2022/6/1101593.json": "If you are a JavaScript developer this should terrify you.   Because when I work with developers, the...",
  "data/redirect-devtop/2022/6/1101897.json": "Join us in collecting stories of LGBTQIA+ pride — we'll donate $10 for every #devpride story received. ",
  "data/redirect-devtop/2022/6/1101784.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/6/1101878.json": "No coder is an island.  This week's DevDiscuss episode is a good one if you want to succeed in your...",
  "data/redirect-devtop/2022/6/1102982.json": "Cloud cost management is tricky for many companies, especially when using cloud-native technologies...",
  "data/redirect-devtop/2022/6/1102117.json": "The common theme across our recent Forem highlights is that DEV can serve as a really effective town...",
  "data/redirect-devtop/2022/6/1102490.json": "As developers we have had to set up our development environment from scratch at least once.   Whether...",
  "data/redirect-devtop/2022/6/1101401.json": "Components are a major part of any react project - from buttons to dropdowns to form components....",
  "data/redirect-devtop/2022/6/1102140.json": "The practically important problem in computational mathematics is computing the eigenvalues of a...",
  "data/redirect-devtop/2022/6/1102652.json": "In this post let's talk about the paradigm shift from lifecycle methods to state synchronization and...",
  "data/redirect-devtop/2022/6/1102988.json": "When it comes to using external libraries, sometimes you can't find exactly what you need, and there...",
  "data/redirect-devtop/2022/6/1103483.json": "I graduated from my SWE degree around 6 years ago (almost to the date). The uni I went to wasn’t one...",
  "data/redirect-devtop/2022/6/1103299.json": "This weekly roundup highlights what we believe to be the most thoughtful and/or interesting...",
  "data/redirect-devtop/2022/6/1102158.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/6/1103301.json": "A couple weeks ago we wrapped up the Mayfield + DEV Discussion Series, where over 500 people...",
  "data/redirect-devtop/2022/6/1101584.json": "An array is one of the most common concepts of Javascript, which gives us a lot of possibilities to...",
  "data/redirect-devtop/2022/6/1103607.json": "Let's set one thing straight before we even dive into the article.  Divs are not buttons!  Yes, they...",
  "data/redirect-devtop/2022/6/1103646.json": "I'm pretty frustrated about this lately, I want to develop something out of the box, but all I see on...",
  "data/redirect-devtop/2022/6/1103917.json": "Hello everyone i recenlty written a TODO System with Hexagonal Architecture written in Go, with test...",
  "data/redirect-devtop/2022/6/1104752.json": "Exceptions, Exceptions, Exceptions... We see them constantly during development and support of...",
  "data/redirect-devtop/2022/6/1104618.json": "Hello Coders 👋  For past few weeks, I've been working on a web extension 🌎 for Chromium Base...",
  "data/redirect-devtop/2022/6/1103676.json": "Hello Everyone,  So I have been wanting to ask which is better, being a generalist developer or a...",
  "data/redirect-devtop/2022/6/1102975.json": "As a developer, I am constantly on the lookout for solutions that can help me improve my daily...",
  "data/redirect-devtop/2022/6/1103855.json": "Ciao! 👋  Did you miss us the past week? We are back in full-force to share what we have been cooking...",
  "data/redirect-devtop/2022/6/1104742.json": "This article will explain how you can build a file previewer in React that works for images and...",
  "data/redirect-devtop/2022/6/1104600.json": "Hey guys, I'm Sam Zhang.  Recently I've updated my portfolio site. Originally I used LogTure as my...",
  "data/redirect-devtop/2022/6/1101455.json": "Hello DEV community,  Right now I'm currently looking for my first developer job.  Here are my skills...",
  "data/redirect-devtop/2022/6/1104942.json": "I know some projects like Pi-hole and Kodi, but what super cool on Raspberry Pi 4 to...",
  "data/redirect-devtop/2022/6/1103920.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/6/1104810.json": "This blog mainly talks about the anti-patterns of building microservice architecture systems.  A...",
  "data/redirect-devtop/2022/6/1103447.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/6/1104961.json": "Finally, I have clicked the blue 'Write your first post now' button on the dev.to/dashboard page...."
}