{
  "data/redirect-devtop/2021/3/636057.json": "Get tired searching animations for your menu items and links? Search no more! Here is a list of more...",
  "data/redirect-devtop/2021/3/626424.json": "By Rahul Arora, Founder Intervue  --           Why you should read this?   There are N number of dire...",
  "data/redirect-devtop/2021/3/622026.json": "Hello World Today I wanted to share with you my Cheatsheet Compilation that every dev should know abo...",
  "data/redirect-devtop/2021/3/644117.json": "Here are four tools that you probably don't know about, but that can save you hours.           4.  Re...",
  "data/redirect-devtop/2021/3/641161.json": "Motivation of this blog is to curate all information at one place and to make more people aware about...",
  "data/redirect-devtop/2021/3/630520.json": "Hello everyone! Let's get straight into the list of 5 tools/resources I use almost every day as a fro...",
  "data/redirect-devtop/2021/3/646159.json": "A lot of people struggle when it comes to thinking of project ideas. Here is a list of 50 cool projec...",
  "data/redirect-devtop/2021/3/639478.json": "Hello everyone, hope you are doing great! In this short article, I am writing about 6 free tools that...",
  "data/redirect-devtop/2021/3/648915.json": "Web development tools help developers to build a website or an application easier and faster. It simp...",
  "data/redirect-devtop/2021/3/645129.json": "Last week, I didn't have much to write about, so I tried to learn about Brunch and documented my jour...",
  "data/redirect-devtop/2021/3/650410.json": "If you follow me on Twitter, you would probably know that I'm passionately learning to play ukulele....",
  "data/redirect-devtop/2021/3/624090.json": "According to Statcounter, the device market share in 2021 Q1 is:  54.25% - Mobile 42.9% - Desktop 2.8...",
  "data/redirect-devtop/2021/3/648287.json": "Building Full Stack dApps with React, Ethers.js, and Hardhat",
  "data/redirect-devtop/2021/3/644752.json": "I came across a great post on the CodeNewbie Community.           \"Self-studying 101: Advice From a S...",
  "data/redirect-devtop/2021/3/634719.json": "Automated software testing has become a critical organization process within software development to...",
  "data/redirect-devtop/2021/3/631920.json": "In this blog I'll share my 1-year of learning journey as UI/UX designer and what steps did I follow a...",
  "data/redirect-devtop/2021/3/627932.json": "You must have seen this on blogs, or articles of other kinds (what's the difference again?). Basicall...",
  "data/redirect-devtop/2021/3/649860.json": "Footer is an important part of any website and serves as additional navigation. Footer is especially...",
  "data/redirect-devtop/2021/3/632147.json": "Since starting to actively code in 2020, I have come across many helpful resources.  Some I have comp...",
  "data/redirect-devtop/2021/3/647910.json": "What will be logged to the console?  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  Before we a...",
  "data/redirect-devtop/2021/3/650399.json": "A lot of time I check HTML/CSS and I got a collection of mistakes. And I'd like to share my collectio...",
  "data/redirect-devtop/2021/3/625841.json": "Series Introduction   Welcome to Part 10 of this blog series that will go from the most basi...",
  "data/redirect-devtop/2021/3/633158.json": "In the previous post we talked about First Class Functions  and how JavaScript treat functions as a...",
  "data/redirect-devtop/2021/3/626002.json": "This past year I worked on a side project, and for once I saw it through to completion and profit...."
}