{
  "data/redirect-devtop/2022/4/1041174.json": "It's been 735 articles, and I've finally had enough. Time to lay down the keyboard and retire the...",
  "data/redirect-devtop/2022/4/1041123.json": "Someone in one of the Slack communities I'm a part of asked today how to type JSON in TypeScript,...",
  "data/redirect-devtop/2022/4/1041822.json": "Simple full-stack starter that uses a M-UI React design powered by Express/NodeJS",
  "data/redirect-devtop/2022/4/1041850.json": "Thanks to its static binaries and cross-compiling, building and distributing command-line apps in Go...",
  "data/redirect-devtop/2022/4/1041770.json": "Recently I did some interviews for companies that call themselves \"human focused\", but in the time...",
  "data/redirect-devtop/2022/4/1041220.json": "Let's take a quick look and Click \"?\" on this page!           The started   I wanted to sound in my...",
  "data/redirect-devtop/2022/4/1042213.json": "Now that we are talking about testing, let's try out Jest, a pretty well-used testing framework for...",
  "data/redirect-devtop/2022/4/1042481.json": "Here, several approaches will be introduced to reduce your front-end code base, especially, for...",
  "data/redirect-devtop/2022/4/1042005.json": "Hey! This is my first post on DEV. I have started learning web development late 2021. I've been...",
  "data/redirect-devtop/2022/4/1042691.json": "Overview   Decifer is a cross-platform mobile app that helps to generate transcripts either...",
  "data/redirect-devtop/2022/4/1043133.json": "Having a good README can make the difference between a 0-star and a Unicorn Github Project! I hope...",
  "data/redirect-devtop/2022/4/1043160.json": "Open-Source React Dashboard Template crafted on top of M-UI Library (sources available on Github)",
  "data/redirect-devtop/2022/4/1043325.json": "Remember the old days when the internet used to be the only escape you had to run away from our cruel...",
  "data/redirect-devtop/2022/4/1042835.json": "I'm starting a new role soon, and they shipped me a brand new Macbook Pro.  I got everything set up...",
  "data/redirect-devtop/2022/4/1043337.json": "Github is a popular platform for tons of resources and there are many repositories which provide free...",
  "data/redirect-devtop/2022/4/1043314.json": "Let's talk through the basics of one of the most versatile modules in CSS -- the...",
  "data/redirect-devtop/2022/4/1043974.json": "We are happy to announce GitLive now works, out-of-the-box in offline mode, with any Git repository...",
  "data/redirect-devtop/2022/4/1044276.json": "Hi, everyone. My name is Daniel Reis, aka. \"danielhe4rt\", I'm Brazilian and I'm looking for a...",
  "data/redirect-devtop/2022/4/1043985.json": "We have prepared an open-source &amp; completely free toolset for Shopify merchants to help them set...",
  "data/redirect-devtop/2022/4/1043158.json": "In this article, I will show you how to make a good portfolio, then I will rate your portfolios and...",
  "data/redirect-devtop/2022/4/1043341.json": "A deep dive into what is wrong with our conversations about degrees vs bootcamps",
  "data/redirect-devtop/2022/4/1044232.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1043972.json": "Free Bootstrap 5 Template crafted by ThemeSelection - Sneat Dashboard can be used in commercial projects.",
  "data/redirect-devtop/2022/4/1043766.json": "Sometimes you want to have Jest perform a recurring action between each task.  Some examples: Query a...",
  "data/redirect-devtop/2022/4/1044340.json": "Have you ever had to write the same code over and over again, perhaps changing only small...",
  "data/redirect-devtop/2022/4/1043983.json": "This is a short summary on how to use a declarative pattern in Angular with RxJS.  If you are...",
  "data/redirect-devtop/2022/4/1043813.json": "As I continue to post on dev.to, I consistently see post after post telling me to never stick to one...",
  "data/redirect-devtop/2022/4/1045102.json": "A curated list with pixel-perfect Open-Source Dashboards crafted in modern technologies: React, Vue3, Boostrap 5, Tailwind CSS",
  "data/redirect-devtop/2022/4/1044244.json": "A new series to hunt for Free Tailwind Components. In this edition we are exploring Form Components. ",
  "data/redirect-devtop/2022/4/1045136.json": "Whether you're a blogger, startup, or a business, blogging is a long-term strategy to build a strong...",
  "data/redirect-devtop/2022/4/1044046.json": "You’ve probably seen the term “headless” used countlessly over and over again. There are so many...",
  "data/redirect-devtop/2022/4/1044773.json": "A monorepo, what's that?   A while back I was finishing work with an employer and was due to...",
  "data/redirect-devtop/2022/4/1045622.json": "Thank you to everyone who weighed in about the most frustrating part of software development in...",
  "data/redirect-devtop/2022/4/1045080.json": "Introduction   One major benefit of version control is that you can roll back your code to...",
  "data/redirect-devtop/2022/4/1044647.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/4/1045248.json": "Python is one of the most elegant and clean programming languages, yet having a beautiful and clean...",
  "data/redirect-devtop/2022/4/1045315.json": "I recently wrote about How I massively improved my website performance by using the right tool for...",
  "data/redirect-devtop/2022/4/1046268.json": "March was full of surprises, the biggest one being Google Cloud's pricing increase, among many other...",
  "data/redirect-devtop/2022/4/1043095.json": "I recently got a LinkedIn invitation from a random person. After accepting it I got a message from...",
  "data/redirect-devtop/2022/4/1045920.json": "Cover photo created by Jazlyn Borkowski   \"DRY\" is an acronym introduced, seemingly universally, to...",
  "data/redirect-devtop/2022/4/1045647.json": "We've been releasing a lot of great new features on AWS Amplify Studio since we launched the...",
  "data/redirect-devtop/2022/4/1046495.json": "Software development gets passed down as an oral and written history of mistakes and learnings — and...",
  "data/redirect-devtop/2022/4/1046845.json": "If you were hanging around earlier today, you might have seen that DEV suffered some partial downtime...",
  "data/redirect-devtop/2022/4/1046399.json": "How we're building the PinePhone-based smartphone that has Progressive Web Apps at its core",
  "data/redirect-devtop/2022/4/1046697.json": "It's quite common for folks on DEV to ask how they can ignore or see less of a certain tag. Well, I'm...",
  "data/redirect-devtop/2022/4/1047154.json": "Cloud computing skills are in high demand, without a doubt.  AWS partners we spoke to say that 83%...",
  "data/redirect-devtop/2022/4/1046787.json": "React 18 sets the foundation for concurrent rendering APIs that future React features will be built...",
  "data/redirect-devtop/2022/4/1046150.json": "As a beginner programmer, you often hear advice to test your code. It’s good advice—let’s look at how...",
  "data/redirect-devtop/2022/4/1045566.json": "One of the more interesting patterns I learned on a later stage of my career is the Proxy.  When...",
  "data/redirect-devtop/2022/4/1047295.json": "Open-Source React UI Kit crafted by Creative-Tim - Material Kit React can be downloaded from Github (MIT License).",
  "data/redirect-devtop/2022/4/1046468.json": "This is a post that I have had brewing for maybe a year but I never took the time to write my...",
  "data/redirect-devtop/2022/4/1047684.json": "With the new team sidebar, you can now see all work in progress across your entire team in a single...",
  "data/redirect-devtop/2022/4/1046227.json": "In this blog article I talk about the challenge of learning multiple technologies and staying up to...",
  "data/redirect-devtop/2022/4/1046473.json": "Kubernetes is at the top of everyone’s minds today. From engineers to CTO’s and senior leadership...",
  "data/redirect-devtop/2022/4/1048053.json": "A curated list with Open-Source MUI Templates released under permissive licenses - React Soft UI, Berry, Material Dashboard - All FREE.",
  "data/redirect-devtop/2022/4/1047053.json": "All code from this tutorial as a complete package is available in this repository.  If you find this...",
  "data/redirect-devtop/2022/4/1045679.json": "Introduction   I am sure you have been seeing a lot of tweets, posts, and conversations...",
  "data/redirect-devtop/2022/4/1046465.json": "According to the official documentation from Docker,   Docker is an open platform for developing,...",
  "data/redirect-devtop/2022/4/1047789.json": "Hey guys, I wanted to showcase my latest project: A DEV clone.            Why I made it   My...",
  "data/redirect-devtop/2022/4/1047656.json": "I started at Forem in October 2021, and needed to orient myself quickly to a code base that powered...",
  "data/redirect-devtop/2022/4/1048329.json": "If you don't want to use plain bullets, the ::marker psuedo-element is for you!",
  "data/redirect-devtop/2022/4/1048281.json": "The missing guide on how to migrate your React app from Webpack to Vite.",
  "data/redirect-devtop/2022/4/1047712.json": "We're not all just \"programmers\" — over time we become web devs, lead devs, SREs, etc.  What's your...",
  "data/redirect-devtop/2022/4/1046428.json": "As dev, it's not uncommon to use different machines or to renew laptops and devices. You don't want...",
  "data/redirect-devtop/2022/4/1047428.json": "Introduction   AWS Amplify is a set of purpose-built tools and features that lets front-end...",
  "data/redirect-devtop/2022/4/1047430.json": "We as JavaScript developers usually use console.log() to test the output or just for fun. Even I can...",
  "data/redirect-devtop/2022/4/1049024.json": "Most of us probably had some sort of other jobs before getting into software as a career. I'd love to...",
  "data/redirect-devtop/2022/4/1048620.json": "If you've spent much time in software development, you've undoubtedly heard the expression...",
  "data/redirect-devtop/2022/4/1048150.json": "There are many open source projects out there and a lot of them act as alternatives for popular...",
  "data/redirect-devtop/2022/4/1049149.json": "Intro   Toggle is a TRUE/FALSE switch that looks like a... switch... Similar control you can...",
  "data/redirect-devtop/2022/4/1046750.json": "A post by m0nm",
  "data/redirect-devtop/2022/4/1049870.json": "A short list of important Javascript concepts for React Developers - With Code Samples.",
  "data/redirect-devtop/2022/4/1047727.json": "Smash that \"subscribe\" button if you don't want to miss anything. 👇",
  "data/redirect-devtop/2022/4/1048300.json": "Hey DEV Community 👋   I wanted to pop into your feeds with a quick reminder that the Deepgram x DEV...",
  "data/redirect-devtop/2022/4/1047019.json": "In TypeScript, we sometimes need to enforce that an object has required properties, even if the...",
  "data/redirect-devtop/2022/4/1049539.json": "In 2019, I facilitated workshops for the Girl Guides of Canada to introduce young girls to computer...",
  "data/redirect-devtop/2022/4/1049309.json": "In the remote world where a lot of us are now, what online games, if any, do you play with your...",
  "data/redirect-devtop/2022/4/1050024.json": "How much of JavaScript do you really think you know? You probably know how to write functions,...",
  "data/redirect-devtop/2022/4/1050154.json": "If you're a mid-level React developer looking to become an advanced React developer, this post is for...",
  "data/redirect-devtop/2022/4/1047390.json": "Automatically generates coloring pages, in less than 200 lines of code",
  "data/redirect-devtop/2022/4/1049296.json": "A curated list with full-stack Open-Source Starters crafted on top of Laravel 9 (latest version) - Source Code for all projects is available on Github.",
  "data/redirect-devtop/2022/4/1049827.json": "This is something that might seem weird for beginners, yet is something that every beginner should...",
  "data/redirect-devtop/2022/4/1047661.json": "A very common question for beginners is always, “Where to start” and “How are you a self-taught...",
  "data/redirect-devtop/2022/4/1049746.json": "Animations are really awesome to see on websites, right?  And the coolest thing about animations is...",
  "data/redirect-devtop/2022/4/1046022.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/4/1050018.json": "Are 2 years enough to make someone “senior”? If it is... then what is a junior? And where is the...",
  "data/redirect-devtop/2022/4/1048667.json": "setTimeout in JavaScript is a native function that sets a function to be executed when a specified...",
  "data/redirect-devtop/2022/4/1050674.json": "Open-Source MUI Template crafted by Creative-Tim using Argon Design concepts. Sources are available for download from Github (MIT License).",
  "data/redirect-devtop/2022/4/1050646.json": "While working in one of my project I had to implement a feature where I have turn an HTML webpage to...",
  "data/redirect-devtop/2022/4/1050529.json": "The first rule of Test-Driven-Development (TDD) is to write a test before coding the feature. It...",
  "data/redirect-devtop/2022/4/1050797.json": "Hello everybody!   A lot of people read my last post about my group_button package And I...",
  "data/redirect-devtop/2022/4/1049743.json": "Sometimes you just want those pesky newline characters to actually work!",
  "data/redirect-devtop/2022/4/1050888.json": "Article posted using bloggu.io. Try it for free.  Imagine the scenario where you have a variable...",
  "data/redirect-devtop/2022/4/1050220.json": "My submission to the Deepgram Hackathon on DEV!",
  "data/redirect-devtop/2022/4/1045259.json": "Hello👋  Actually I am new to deepgram. So had to educate my self on how deepgram works and make...",
  "data/redirect-devtop/2022/4/1050852.json": "Overview of My Submission   DeepDubber Dubs videos - Generates the subtitles, translates...",
  "data/redirect-devtop/2022/4/1050651.json": "Hi!  So, what's this post gonna be about?   Well, with the Effect community, we've been hard at work...",
  "data/redirect-devtop/2022/4/1050500.json": "ReactJS is the highly used open-source JavaScript Library which makes building dynamic websites...",
  "data/redirect-devtop/2022/4/1047681.json": "This is part of a Tech Jargon Defined series focused on de-mystifying common tech jargon terms.      ...",
  "data/redirect-devtop/2022/4/1050501.json": "I'm fairly new to backend dev &amp; have a decent knowledge on how to build frontend apps using...",
  "data/redirect-devtop/2022/4/1051609.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1051226.json": "As application and website developers we need to perform good SEO practices, optimizations, share our...",
  "data/redirect-devtop/2022/4/1050875.json": "Well, Hello there. This is my first blog post and hackathon here. The following sections will give...",
  "data/redirect-devtop/2022/4/1050486.json": "Are you someone trying to dive into the world of React, but keep forgetting how to do stuff &amp;...",
  "data/redirect-devtop/2022/4/1050637.json": "Most of the websites we visit nowadays show a pop-up letting us know they use cookies. Sometimes we...",
  "data/redirect-devtop/2022/4/1052026.json": "There are over a hundred elements in HTML, all of which can be applied to pieces of text to give them...",
  "data/redirect-devtop/2022/4/1049962.json": "Medusa is an open source ecommerce platform. One of the reasons we made it open source is because we...",
  "data/redirect-devtop/2022/4/1051267.json": "LOLCODE      HAI 1.2     VISIBLE \"Hello, World!\" KTHXBYE        Enter fullscreen mode    ...",
  "data/redirect-devtop/2022/4/1051694.json": "Today, we are going to talk about one of the most underrated parts of development: Testing. We all...",
  "data/redirect-devtop/2022/4/1052859.json": "Not the first time this has been asked, won't be the last.  Please drop titles and/or links to music...",
  "data/redirect-devtop/2022/4/1052086.json": "Comment here if you need any help during the Appwrite Hackathon on DEV!",
  "data/redirect-devtop/2022/4/1051384.json": "Let's look at the state of Foreign Function Interface (FFI) in Java.",
  "data/redirect-devtop/2022/4/1052920.json": "A comprehensive introduction to NodeJS for Beginners - With Free Samples.",
  "data/redirect-devtop/2022/4/1052888.json": "Last week, the team I work on at AWS Amplify launched new map UI components. I wanted to take this...",
  "data/redirect-devtop/2022/4/1052575.json": "As a beginner in the DevOps Engineering field, starting out can be stressful &amp; overwhelming as...",
  "data/redirect-devtop/2022/4/1052902.json": "The security of .NET applications is necessary and knowing how to protect it is not always an easy...",
  "data/redirect-devtop/2022/4/1052372.json": "One of the most interesting and challenging things in React is not mastering some advanced...",
  "data/redirect-devtop/2022/4/1053184.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/4/1052851.json": "The UNIX system is a major breakthrough that inspired many other operating systems. It's particularly...",
  "data/redirect-devtop/2022/4/1052229.json": "Dear Linkedin Hiring Managers and Aka Tech Recruiters,   I am writing to you people on behalf of my..."
}