{
  "data/redirect-devtop/2022/3/1005176.json": "I have often been asked what resources would I recommend for beginners looking to step their foot...",
  "data/redirect-devtop/2022/3/1005101.json": "I'm pretty sure you have used the global JSON object for a variety of things, like in fetch requests...",
  "data/redirect-devtop/2022/3/1004855.json": "Starting from open-source projects to enterprise software, most softwares have a huge codebase. Don't...",
  "data/redirect-devtop/2022/3/1005724.json": "Last fall, I started seeking work after it became clear to me that I was being pushed out of Apple....",
  "data/redirect-devtop/2022/3/1005501.json": "Cross-Posted From CodeNewbie Community  The CodeNewbie team is thrilled to share that the tech...",
  "data/redirect-devtop/2022/3/1005900.json": "I told you not to click, this next part may cause you physical pain:        this ⠀⠀  really    ...",
  "data/redirect-devtop/2022/3/1006315.json": "Creating beautiful, consistent color palettes is hard. You have to find the right colors and make...",
  "data/redirect-devtop/2022/3/1005775.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/3/1006040.json": "You might have heard about this Spread Operators and be are using it too in everyday Developement....",
  "data/redirect-devtop/2022/3/1006224.json": "Svelte is a modern and growing front-end compiler. Developers build boilerplate-free components using...",
  "data/redirect-devtop/2022/3/1005406.json": "The appearance of Node.js became the new era for JavaScript because of the opportunity to synchronize frontend and backend.",
  "data/redirect-devtop/2022/3/1006346.json": "What your feeling about the new design of MDN ?   https://developer.mozilla.org     __  Other links...",
  "data/redirect-devtop/2022/3/1004918.json": "If you are anything like me, it looks like time has been standing still since this covid thing...",
  "data/redirect-devtop/2022/3/1006567.json": "Functional programming is a way of thinking about programs by composing pure functions. It tries to...",
  "data/redirect-devtop/2022/3/1006320.json": "Hey there👋,  I saw some cool animations and effects on different websites few days ago. So I made...",
  "data/redirect-devtop/2022/3/1005469.json": "Hey, fellow developers!  What advice would you give to yourself if you could travel back in time?...",
  "data/redirect-devtop/2022/3/1008966.json": "February was a dynamic month in the cloud space, that’s for sure.  This series explores the most...",
  "data/redirect-devtop/2022/3/1007679.json": "Overview of My Submission   This month, I saw the Azure + Dev.to Hackathon 🤩 and immediately...",
  "data/redirect-devtop/2022/3/1007160.json": "As beginners, we started with a certain programming language. We learned that language' features, and...",
  "data/redirect-devtop/2022/3/1008768.json": "When I was working on redesigning this blog, I created this slick-looking header effect.    I'll...",
  "data/redirect-devtop/2022/3/1009186.json": "Yes, you heard me right I got a job as a content creator! 15 years self-employed and someone finally...",
  "data/redirect-devtop/2022/3/1008425.json": "In many communities i have been, exists certain dislike towards writing css, people get frustrated,...",
  "data/redirect-devtop/2022/3/1006365.json": "I struggled with two aspects of software development as a junior engineer: structuring large...",
  "data/redirect-devtop/2022/3/1008541.json": "Save your eyes from cluttered editor. Make Visual Studio Code more pleasing to look at. This is...",
  "data/redirect-devtop/2022/3/1009139.json": "In this article, we’ll cover how to render and configure 3D assets created in a 3D software program...",
  "data/redirect-devtop/2022/3/1009999.json": "This article was written exclusively for Dev Interrupted by Kathryn Koehler  At Netflix, we don’t...",
  "data/redirect-devtop/2022/3/1010823.json": "I everybody, today I am going to show examples of few important Javascript functions.           DEEP...",
  "data/redirect-devtop/2022/3/1010546.json": "GraphQL is gaining popularity because of its ability to develop APIs more efficiently, powerful, and...",
  "data/redirect-devtop/2022/3/1008325.json": "This is not a blog I anticipated writing. My plan was to let Women's History Month pass me by as much...",
  "data/redirect-devtop/2022/3/1010092.json": "Today, a friend asked in a Slack we’re a part of what Node.js resources did folks recommend? The...",
  "data/redirect-devtop/2022/3/1008770.json": "Welcome!   Why is this boilerplate the best? Because all the top eth boilerplates on github...",
  "data/redirect-devtop/2022/3/1009703.json": "We deal with a variety of technologies, frameworks, and programming languages as web developers....",
  "data/redirect-devtop/2022/3/1007259.json": "We don't observe how we grow up and a lot of events and interactions that form our future selves...",
  "data/redirect-devtop/2022/3/1009362.json": "The other day, I stumbled upon some code where I needed to handle an object as a regular array a few...",
  "data/redirect-devtop/2022/3/1011236.json": "Cover image credits ☝️ go to: Derick McKinney, GIF credits👇 go to AlwaysBeColoring!     I wanna hear...",
  "data/redirect-devtop/2022/3/1010312.json": "Hey Devs,   It's good to see you again. from this post I will tell you how to use...",
  "data/redirect-devtop/2022/3/1007755.json": "We’ve all heard the dreaded words, “But it works on my machine.” Whether simple or complex,...",
  "data/redirect-devtop/2022/3/1009798.json": "Soon the new version of ECMA Script will become standard in few months. So let's take a glimpse at...",
  "data/redirect-devtop/2022/3/1010036.json": "I love React.  But there are some aspects of the framework that have previously given me fits.  One...",
  "data/redirect-devtop/2022/3/1010902.json": "What is JAVA?   Java is a high-level, third generation programming language, like C,C++,...",
  "data/redirect-devtop/2022/3/1011622.json": "You got a reply!!!!   But as you start reading more, something seems off. \"We appreciate...",
  "data/redirect-devtop/2022/3/1012414.json": "I'm the type of person who keeps creating different repositories and small open-source projects. One...",
  "data/redirect-devtop/2022/3/1013950.json": "Learning CSS can be quite a challenge. There are no shortcuts, and you will have to get your hands...",
  "data/redirect-devtop/2022/3/1014232.json": "What are Cloud Functions?   Cloud functions are a way of extending a cloud provider’s...",
  "data/redirect-devtop/2022/3/1014177.json": "This article was originally published at:...",
  "data/redirect-devtop/2022/3/1008304.json": "Today, we're excited to share that we've redesigned the beloved DEV Shop to be more representative of...",
  "data/redirect-devtop/2022/3/1013629.json": "Today, in this article, we'll analyze two common processing techniques used by the operating system...",
  "data/redirect-devtop/2022/3/1008332.json": "Dear DEV Community,  I wanted to let you know that Forem (the open source software company behind...",
  "data/redirect-devtop/2022/3/1012959.json": "Problem Given a sorted array of distinct integers and a target value, return the index if the target..."
}