{
  "data/redirect-devtop/2021/7/744839.json": "Does Redux have you confused? 😕  In this blog, you'll learn the fundamentals of Redux stores,...",
  "data/redirect-devtop/2021/7/744915.json": "\"What branch are you on?\" is often the first question you ask when a teammate says \"The tests aren't...",
  "data/redirect-devtop/2021/7/744686.json": "Hi guys, I'm proud to present you my latest project: Fakeflix.    I have started this project with...",
  "data/redirect-devtop/2021/7/744739.json": "Using Docker containers in local development environments has become commonplace for web development....",
  "data/redirect-devtop/2021/7/745081.json": "[Hidden Tools] - https://hiddentools.dev/ [Music For Programming]...",
  "data/redirect-devtop/2021/7/744817.json": "In simple terms, it's like when you go to a pizza place, and order a \"Make your own\" pizza - you pick...",
  "data/redirect-devtop/2021/7/745591.json": "Slow builds tend to cost more than just the time they waste. More than a few seconds and you're off...",
  "data/redirect-devtop/2021/7/745582.json": "Looking at my regular JavaScript code, I see that destructuring assignments are everywhere.  Reading...",
  "data/redirect-devtop/2021/7/744729.json": "Hey! I'm on a mission to make 100 React.js projects. Please follow my dev.to profile or my twitter...",
  "data/redirect-devtop/2021/7/745795.json": "Chapter 2: Illustrating Lexical Scope    These are the notes of second chapter of the book...",
  "data/redirect-devtop/2021/7/744878.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/7/745126.json": "Over the last few years, I’ve mentored over 300+ students and working professionals on how to prepare...",
  "data/redirect-devtop/2021/7/744757.json": "In this article, we'll explore how you can easily update npm packages used in your application...",
  "data/redirect-devtop/2021/7/746434.json": "Plug: I help develop million: &lt;1kb virtual DOM - it's fast!            Introduction   The Virtual...",
  "data/redirect-devtop/2021/7/745347.json": "Burnout happens. It happened to me 6 months ago. Only in the last 2-3 weeks have I been feeling...",
  "data/redirect-devtop/2021/7/746179.json": "Today I created an Amazing Profile Card. In this Hover Effect, I am using only HTML CSS to create...",
  "data/redirect-devtop/2021/7/745564.json": "Hey Devs, in this episode, you will learn how to make a Login Form and Registration Form design using...",
  "data/redirect-devtop/2021/7/745624.json": "Tudo o que você precisa saber para fazer o seu primeiro texto sair do papel!   ㅤ  Uma das...",
  "data/redirect-devtop/2021/7/744723.json": "The ternary operator is a nice way to write concise value assignments without having to write a more...",
  "data/redirect-devtop/2021/7/746213.json": "Why does Destructuring exist in javascript?   Because it solves our problem. Let's see an...",
  "data/redirect-devtop/2021/7/744687.json": "In this tutorial, I'll walk you through how to build a black-out poetry maker with vanilla...",
  "data/redirect-devtop/2021/7/745587.json": "Last week I wrote a blog post on how I built my app in React, React Native and NextJS. This blog post...",
  "data/redirect-devtop/2021/7/746721.json": "Yesterday I read InhuOfficial's post about star-rating, using a group of &lt;input...",
  "data/redirect-devtop/2021/7/746639.json": "Micro Frontends    An architectural style where independently deliverable frontend...",
  "data/redirect-devtop/2021/7/746319.json": "Introduction  Over the past year or even more, it is difficult not to pay attention to how interest...",
  "data/redirect-devtop/2021/7/745628.json": "Should we use deep modules or small objects?",
  "data/redirect-devtop/2021/7/746975.json": "Tailwind as explained in their official website is a utility-first CSS framework packed with classes...",
  "data/redirect-devtop/2021/7/746323.json": "A REST API is an architectural pattern for creating web services. REST is a set of rules that...",
  "data/redirect-devtop/2021/7/745956.json": "INTRODUCTION   ESLint and prettier are the most popular tools which are used almost...",
  "data/redirect-devtop/2021/7/746693.json": "In this article , I’ll show you how to deploy react js applications for free on Firebase, First let’s...",
  "data/redirect-devtop/2021/7/745771.json": "Every React developer use react libraries in daily basis to build react applications and it's a ...",
  "data/redirect-devtop/2021/7/747170.json": "As a developer, you probably find yourself spending a lot of time in Chrome working. You work in a...",
  "data/redirect-devtop/2021/7/746130.json": "If you have ever worked with component libraries like Chakra UI or Material UI you probably know how...",
  "data/redirect-devtop/2021/7/746208.json": "Most of us build our web projects with components. It makes our code more reusable, more...",
  "data/redirect-devtop/2021/7/747275.json": "Welcome to the first vue academy ! It will be a list of lot of article on vue! I have 2.5 years of...",
  "data/redirect-devtop/2021/7/747441.json": "Hello! It's been a while since my last post. I've been busy doing Frontend Mentor challenges for the...",
  "data/redirect-devtop/2021/7/747131.json": "Hey Devs, in this episode we are going to create a working Music Player App using JavaScript, you’ll...",
  "data/redirect-devtop/2021/7/746086.json": "Introduction            What is React?   React is a popular JavaScript frontend library...",
  "data/redirect-devtop/2021/7/747204.json": "How I used a bad interview experience to relearn JavaScript fundamentals. ",
  "data/redirect-devtop/2021/7/747283.json": "React and Redux are often mentioned together and with good reason. As the developer who created Redux...",
  "data/redirect-devtop/2021/7/747203.json": "Hello reader! In this blog post, we will learn about API in plain English.  You can refer to my...",
  "data/redirect-devtop/2021/7/747568.json": "Discover a set of React best coding practices, tips and tricks that should be known by all...",
  "data/redirect-devtop/2021/7/746325.json": "Hello guys, today I am going to show you How to build a JavaScript Random Quote Generator using HTML...",
  "data/redirect-devtop/2021/7/745855.json": "As a web developers, we need to write the styles for the given classes.  But for lazy people like me,...",
  "data/redirect-devtop/2021/7/747560.json": "Here I am with my \"Star rating\" system:  ✔️ No JavaScript. ✔️ No complex HTML code, only the needed...",
  "data/redirect-devtop/2021/7/747025.json": "This blog will discuss 6 techniques (in order of adherence to best practices)that can be used to...",
  "data/redirect-devtop/2021/7/747632.json": "In this article, I’ll share 10 of the JavaScript tips, tricks, and best practices that I follow and...",
  "data/redirect-devtop/2021/7/747345.json": "    Hello everyone, in this post I will be demonstrating how you can run localstack with Terraform...",
  "data/redirect-devtop/2021/7/747502.json": "So today, we shall be discussing about .filter() method in JavaScript.           The Filter...",
  "data/redirect-devtop/2021/7/747327.json": "There are many amazing features in javascript that can make your life much simpler, In this blog, I...",
  "data/redirect-devtop/2021/7/748001.json": "What is Node.js   Node.js is an open-source Javascript run-time. It is used to create...",
  "data/redirect-devtop/2021/7/747552.json": "If you are a frontend developer, it's obvious about the time and thoughts you take to fix on a...",
  "data/redirect-devtop/2021/7/747005.json": "[JS#4 WIL 🤔 Post]   Test Driven Development (TDD)'s main idea is to simply start working on...",
  "data/redirect-devtop/2021/7/748473.json": "The developer technology landscape changes all the time as new tools and technologies are introduced....",
  "data/redirect-devtop/2021/7/747443.json": "This article is a continuation of the last blog on git basics. You are highly encouraged to check it...",
  "data/redirect-devtop/2021/7/747810.json": "React library is well known for building rich and highly scalable user interfaces. There are many...",
  "data/redirect-devtop/2021/7/748037.json": "Before Knowing about Code Splitting we need to know Why we need Code Splitting these first we need to...",
  "data/redirect-devtop/2021/7/748230.json": "I recently got my hands the GitHub Copilot extension for VS Code and it's amazing (borderline...",
  "data/redirect-devtop/2021/7/747437.json": "Enough with the tutorials and practice, now it's a time to build up something good and my...",
  "data/redirect-devtop/2021/7/747837.json": "Sometimes we want Docker inside Docker. For Example :the CI pipeline,   Jenkins Docker-based dynamic...",
  "data/redirect-devtop/2021/7/748574.json": "You might not have known this but over the past week there has been a shadow war taking place right...",
  "data/redirect-devtop/2021/7/748477.json": "💥💥 React Redux Example 💥💥            This is a todo project for understanding the concepts...",
  "data/redirect-devtop/2021/7/748542.json": "In this tutorial, we will be going to build YouTube Downloader, the backend implemented in Express.js, and the frontend in React.js",
  "data/redirect-devtop/2021/7/747921.json": "Solid is such an amazing reactive declarative tool for composing and manipulating DOM with simple...",
  "data/redirect-devtop/2021/7/751222.json": "This article focuses on the JavaScript capabilities that are a part of ECMAScript 2021(ES12).   1....",
  "data/redirect-devtop/2021/7/751248.json": "Yes, I know, we should all be terminal ninjas, memorising every git command yadda yadda. Or, like the...",
  "data/redirect-devtop/2021/7/751039.json": "Plug: I help develop million: &lt;1kb virtual DOM - it's fast!            TL;DR   If applicable,...",
  "data/redirect-devtop/2021/7/746543.json": "TL;DR: This is a post for beginners where I show:   How I structured the files in the project for...",
  "data/redirect-devtop/2021/7/745866.json": "Last week we released SolidJS 1.0. A JavaScript framework built on a foundation of ideas long ago...",
  "data/redirect-devtop/2021/7/751104.json": "1- CSS Way   In this article, I would like to show you, how to create dropdown menus with...",
  "data/redirect-devtop/2021/7/751269.json": "Hoisting is one of the important concepts every javascript or its related frameworks developers...",
  "data/redirect-devtop/2021/7/748347.json": "Welcome Everybody,  In this article we are going to create a tic-tac-toe app using react and react...",
  "data/redirect-devtop/2021/7/751546.json": "Recently, a lot of folks tried their best to provide star rating system. Now it's time to bring THE...",
  "data/redirect-devtop/2021/7/747806.json": "After research how to deploy Express.js app to Vercel. Finally, I found and got have an application...",
  "data/redirect-devtop/2021/7/747342.json": "Probably this is one of the most dreaded topics to talk about. Quite a few readers won't even bother...",
  "data/redirect-devtop/2021/7/748635.json": "Frontend performance is important. JavaScript, though written to be a simple language, can produce...",
  "data/redirect-devtop/2021/7/751050.json": "For many reasons you may need to limit your API calls: It can be to avoid extra cost in cloud, to...",
  "data/redirect-devtop/2021/7/747874.json": "A Promise in JavaScript is an object which returns a result after an asynchronous operation has...",
  "data/redirect-devtop/2021/7/751637.json": "Having light and Dark mode on web or desktop applications is a great feature to not only make the...",
  "data/redirect-devtop/2021/7/751589.json": "Welcome my friend ! Today I will show you how to deploy your static website for free with Netlify...",
  "data/redirect-devtop/2021/7/748774.json": "I set up a new Mac for work today. Here's everything I use on a Mac for fullstack web development.",
  "data/redirect-devtop/2021/7/748470.json": "Introduction   Infinite scrolling is a way to organize the contents of the pages in a...",
  "data/redirect-devtop/2021/7/748603.json": "In this article, I will talk about a refactoring called replace conditional with polymorphism that we...",
  "data/redirect-devtop/2021/7/752464.json": "Hey everyone,  I know that all of you are working on exciting products. To help you make it a bit...",
  "data/redirect-devtop/2021/7/751080.json": "If someone asked me, I would say modules are really important due to their functionality. Thanks to...",
  "data/redirect-devtop/2021/7/751289.json": "I love this platform. I've been hanging around there ever since Medium became shit. So while it's...",
  "data/redirect-devtop/2021/7/751324.json": "This guide covers all steps needed for setting up your CI-CD workflow for Django project with Amazon...",
  "data/redirect-devtop/2021/7/751534.json": "Hello,  Today I created a Glassmorphism Sign In form with HTML &amp; CSS. this login form is very...",
  "data/redirect-devtop/2021/7/752323.json": "When you start learning about the frontend world, you’ll almost immediately stumble across the term...",
  "data/redirect-devtop/2021/7/748049.json": "When building out applications, sending email is a frequently needed feature. In addition, it's...",
  "data/redirect-devtop/2021/7/752081.json": "Single Page Applications in React require a means of routing to navigate on to different views...",
  "data/redirect-devtop/2021/7/750128.json": "Hello Everyone!   Today I will show you how to make a small chat in terminal using Web...",
  "data/redirect-devtop/2021/7/752066.json": "If you're not used to practicing visual art, the idea of keeping a sketchbook might seem pretty...",
  "data/redirect-devtop/2021/7/748691.json": "Oh, hey there!  I'm glad you made it to this second post of the \"Build the System: HTTP server\"...",
  "data/redirect-devtop/2021/7/747047.json": "Hey, welcome back. This article is part of the Dockerize series, make sure to checkout the...",
  "data/redirect-devtop/2021/7/752791.json": "As a professional developer you are forced to stay up to date with the latest trends in technology....",
  "data/redirect-devtop/2021/7/753359.json": "Companies usually want to test a specific area of knowledge. Quizzes are an engaging method to...",
  "data/redirect-devtop/2021/7/752938.json": "Let's get some clarity on what single page apps are, how they work, and where they differ from server-side routing.",
  "data/redirect-devtop/2021/7/747024.json": "Introduction   Hey, welcome to the Dockerize series. Here, I will be discussing how to use...",
  "data/redirect-devtop/2021/7/752495.json": "Want to stay updated regarding all the news, tech and resources? Then here are some of the best...",
  "data/redirect-devtop/2021/7/752763.json": "Let's understand the difference between Inline, Block, Inline-Block.  1️⃣ inline   2️⃣ block  3️⃣...",
  "data/redirect-devtop/2021/7/751792.json": "In the first part of this series, we learned how to send emails by creating a contact form. In this...",
  "data/redirect-devtop/2021/7/752195.json": "Also available on my blog.  Last year after finding myself between two jobs, I interviewed with a...",
  "data/redirect-devtop/2021/7/752123.json": "In this tutorial, we'll see how we can use Redis as a database for caching purposes to load the data...",
  "data/redirect-devtop/2021/7/748620.json": "Introduction   Hey everyone, I have been developing my first discord bot from couple of days...",
  "data/redirect-devtop/2021/7/753601.json": "In this article I will show you how to make a simple JavaScript calculator. The calculator is a...",
  "data/redirect-devtop/2021/7/745733.json": "Abstract thinking facilities us in solving many problems and solving them efficiently. Ability to say...",
  "data/redirect-devtop/2021/7/752764.json": "In 2019, security researchers at Snyk disclosed details of a severe vulnerability in Lodash, a...",
  "data/redirect-devtop/2021/7/754455.json": "With the introduction of libraries and Frameworks like ReactJS, VueJS, Angular, SvelteJS and much...",
  "data/redirect-devtop/2021/7/753306.json": "This article is also available on my blog.  I'm often confronted to the challenge of explaining to a...",
  "data/redirect-devtop/2021/7/753713.json": "Code plus canvas are a match made in heaven. Code lets you express any complex idea, using logic,...",
  "data/redirect-devtop/2021/7/754345.json": "Are you properly handling the stress in your dev life right now?  Being stressed out because you have...",
  "data/redirect-devtop/2021/7/754076.json": "What started as an innocent post on creating an accessible star rating system that was useful and...",
  "data/redirect-devtop/2021/7/752785.json": "What is Prisma?   Prisma is one of the best database libraries I've ever used. In a...",
  "data/redirect-devtop/2021/7/754579.json": "My Favourite    These are my favourite npm icon packages      Icon pack How to...",
  "data/redirect-devtop/2021/7/754461.json": "Simple Node JS API server built with Express, MongoDb, Typescript",
  "data/redirect-devtop/2021/7/753531.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/7/754920.json": "Introduction  Last week I posted my calculator made in the style of Neomorphism. Today I decided to...",
  "data/redirect-devtop/2021/7/751983.json": "Table Of Contents   Introduction What's included inside Redux Toolkit? RTK Query What does...",
  "data/redirect-devtop/2021/7/752874.json": "Hey Devs, in today's episode we are going create from scratch, step-by-step a “CSS Responsive Card...",
  "data/redirect-devtop/2021/7/754015.json": "Docker is one of those services that you always hear about but may have never used. I never used...",
  "data/redirect-devtop/2021/7/754636.json": "If you want a job build your portfolio projects like a professional dev. This guide split in three parts explains how and provides 3 inspiring ideas.",
  "data/redirect-devtop/2021/7/751715.json": "Hello, everybody! 🚀  For the last few days, I've been doing some research on the currently available...",
  "data/redirect-devtop/2021/7/752465.json": "Welcome to the second vue academy ! It will be a list of lot of article on vue! I have 2.5 years of...",
  "data/redirect-devtop/2021/7/754632.json": "After you've upgraded to Angular v12 from a previous version of Angular, you may notice your ng serve...",
  "data/redirect-devtop/2021/7/755113.json": "You will learn the basics of JavaScript by creating the following ten games:           1️⃣...",
  "data/redirect-devtop/2021/7/754611.json": "How to COLLECT PAYMENTS with STRIPE + NEXT.js (Step-by-Step Tutorial)   Today, we gonna...",
  "data/redirect-devtop/2021/7/754627.json": "Being a polyglot developer, there would be some language you like over others and here are mine.",
  "data/redirect-devtop/2021/7/754635.json": "Earlier this week, we explored how code has drastically changed financial markets through the use of...",
  "data/redirect-devtop/2021/7/755260.json": "What is useReducer?   useReducer is one of the additional hooks that shipped with React 16.8...",
  "data/redirect-devtop/2021/7/755480.json": "Here are the 15 custom hooks to make your React component lightweight  React hooks is the trending...",
  "data/redirect-devtop/2021/7/755142.json": "Progressive Web Apps (PWAs) let regular apps become accessible offline. They also have access to more...",
  "data/redirect-devtop/2021/7/755490.json": "If you want a job build your portfolio projects like a professional dev. This guide split in three parts explains how and provides 3 inspiring ideas.",
  "data/redirect-devtop/2021/7/754977.json": "Chapter 3: The Scope Chain    These are the notes of third chapter of the book \"You Don't...",
  "data/redirect-devtop/2021/7/754406.json": "Through this post, I shall be introducing you to the making of and showcasing my open source app...",
  "data/redirect-devtop/2021/7/754873.json": "Hello Guys,  Today I created a Amazing Music Card Using HTML &amp; CSS. this simple music card using...",
  "data/redirect-devtop/2021/7/753904.json": "Considerations    This is an introductory article and presents a way to use the React...",
  "data/redirect-devtop/2021/7/753809.json": "What are Hooks?   Hooks allow us to use state and lifecycle features in function components...",
  "data/redirect-devtop/2021/7/755246.json": "Hello Everyone. Hope you all are safe and wearing masks😷.  So today, as promised, we shall be...",
  "data/redirect-devtop/2021/7/755643.json": "Well well! The motivation for this post comes from my last post where I had a comment from one of my...",
  "data/redirect-devtop/2021/7/755482.json": "Hello, buddies! Every successful programmer has their own habits. So today we are going to see what...",
  "data/redirect-devtop/2021/7/755517.json": "Beside functions being first class citizens in JavaScript, there are plenty of other features,...",
  "data/redirect-devtop/2021/7/753820.json": "Learning CSS is a life long journey. Everyday some new feature is coming up. With that said, there...",
  "data/redirect-devtop/2021/7/746385.json": "It is our very great pleasure to announce the release of a new, free, MIT-licensed open-source curriculum all about the Internet of Things.",
  "data/redirect-devtop/2021/7/756166.json": "If you want a job build your portfolio projects like a professional dev. This guide split in three parts explains how and provides 3 inspiring ideas.",
  "data/redirect-devtop/2021/7/756042.json": "FizzBuzz is a mental arithmetic game that got turned into a popular interview question. But what if...",
  "data/redirect-devtop/2021/7/756172.json": "Essentially, Git keeps tabs on text changes, but the definition is a version control system. Chances...",
  "data/redirect-devtop/2021/7/753286.json": "CSS provides the position property that specifies how an element should appear in the document. This...",
  "data/redirect-devtop/2021/7/756399.json": "Hello coders! You've always heard the same VS Code hacks over and over again like \"install Prettier...",
  "data/redirect-devtop/2021/7/755811.json": "If I had a dollar for every time I looked up how to ... in Git, I would have enough to launch a new...",
  "data/redirect-devtop/2021/7/755273.json": "Whether you are a beginner or an expert in Hyper Text Markup Language (HTML) it is important to...",
  "data/redirect-devtop/2021/7/755641.json": "I wanted to use a Solid element inside a React app. In the end, I was pleasantly surprised how smooth...",
  "data/redirect-devtop/2021/7/755664.json": "Hi, Do you think about how you can create a custom cursor for your website? This section will show...",
  "data/redirect-devtop/2021/7/755283.json": "Disclaimer: This article is not about which components are better, but more of a discussion on the...",
  "data/redirect-devtop/2021/7/755666.json": "Hello everyone, in this article, we would be discussing:     Implicit binding, Explicit binding in...",
  "data/redirect-devtop/2021/7/755746.json": "First of all let me tell you what is a Rest and GraphQL !            REST(Representational...",
  "data/redirect-devtop/2021/7/746551.json": "Hello folks, today we will cover how to save our browser page as pdf. We will generate pdf using...",
  "data/redirect-devtop/2021/7/756179.json": "This blog talks about 6 simple yet effective way to minimise procrastination.   Procrastinating...",
  "data/redirect-devtop/2021/7/756379.json": "Hey everyone 👋🏻, today we are going to make a discord bot 🤖 which will send gifs according to the...",
  "data/redirect-devtop/2021/7/755784.json": "An Array is a data type in JavaScript used for storing a collection of like data. In our daily...",
  "data/redirect-devtop/2021/7/756410.json": "Node.js is an open-source and cross-platform runtime environment, that allows you to write...",
  "data/redirect-devtop/2021/7/756885.json": "CSS is very important in front-end development. CSS can make a website beautiful or horrible. CSS...",
  "data/redirect-devtop/2021/7/755266.json": "A comment I’ve heard from many people is :   “I’ve tried to learn coding so many times, but it never...",
  "data/redirect-devtop/2021/7/757050.json": "More and more, we find ourselves working with Docker containers in the context of microservice...",
  "data/redirect-devtop/2021/7/756394.json": "With the high adoption of the Go language by developers and large companies, this has led companies...",
  "data/redirect-devtop/2021/7/753846.json": "Next.js is one of my favorite tools for web development -- but it's a frontend framework. How can you...",
  "data/redirect-devtop/2021/7/756825.json": "Hi everyone 👋. My vacation has officially started 🥳, and I would like to present you the July edition...",
  "data/redirect-devtop/2021/7/756217.json": "Whatsapp Web bot to query and get results to and from WolframAlpha API. Contains code and tutorial. Made using npm node. ",
  "data/redirect-devtop/2021/7/755833.json": "Yes!🤔 This question might confuse every beginner whenever they are thinking of to starting a new...",
  "data/redirect-devtop/2021/7/757060.json": "This article is an English translation of the original in my blog: Alejándonos de ReactJs y VueJs en...",
  "data/redirect-devtop/2021/7/754243.json": "TL;DR: We are going to install Docker and create five different containers for a Rust program, each...",
  "data/redirect-devtop/2021/7/756053.json": "After using javascript for all kind of projects and doing it professionally for almost a year...",
  "data/redirect-devtop/2021/7/757531.json": "Recently, I visited a website and while surfing through it, the website’s chatbot caught my...",
  "data/redirect-devtop/2021/7/756550.json": "One of the most important aspects of any graphical user interface is icons. They help the text to...",
  "data/redirect-devtop/2021/7/756214.json": "This article consists of 4 parts which are unrelated to each other.  Everybody who works with...",
  "data/redirect-devtop/2021/7/755489.json": "So, I've just completed my first month of DevOps training at Sparta and I feel like it's time to...",
  "data/redirect-devtop/2021/7/757039.json": "When looking at Vuex tutorials, you can see most of them are quite simple.  The logic is explained...",
  "data/redirect-devtop/2021/7/757246.json": "Hello, buddies! I would like to get into our topic without wasting time.   It's easy to write code....",
  "data/redirect-devtop/2021/7/748672.json": "Discover a ways to develop secure react native application.  Key Points -   Screenshot...",
  "data/redirect-devtop/2021/7/757337.json": "Knowing certain JavaScript one liners can save you valuable time while developing or interviewing....",
  "data/redirect-devtop/2021/7/757537.json": "In this post, we'll build out a Next.js app that enables navigation, authentication, authorization, redirects (client and server-side), and a profile view.",
  "data/redirect-devtop/2021/7/757138.json": "Who doesn't love React Testing Library? If you write tests for React, you probably use it a lot....",
  "data/redirect-devtop/2021/7/758461.json": "Hello devs,  So this is a windows 11 clone that I made in React in the span of 7 days. Would you like...",
  "data/redirect-devtop/2021/7/757365.json": "I have created multiple portfolio website templates using ChakraUI and React. You can check my...",
  "data/redirect-devtop/2021/7/757902.json": "Ever tired of writing multiple lines of similar HTML? If you are, then you can automate the process...",
  "data/redirect-devtop/2021/7/757548.json": "Link to original article (recommended):...",
  "data/redirect-devtop/2021/7/757842.json": "Hello Devs,  In this article i will walk you through one of the important methods of Array in...",
  "data/redirect-devtop/2021/7/756728.json": "In the realm of cloud computing, security is something that possesses duality. Duality in the sense,...",
  "data/redirect-devtop/2021/7/754942.json": "Socket.io is a Javascript library for web apps that allows real-time communication between clients...",
  "data/redirect-devtop/2021/7/756832.json": "Test Driven Development is a technique that changes the way we think about tests and programming. It doesn’t mean it’s seamless or easy to start with. There are plenty of challenges on your way when you start. That is why I want to address some of them and share a few tips that will make your programmer’s life easier.",
  "data/redirect-devtop/2021/7/759004.json": "Media query are the most important concept of CSS now days. As majority of users use their phone or...",
  "data/redirect-devtop/2021/7/757804.json": "You might have seen some commits from merge-requests or Dependabot having a badge that states...",
  "data/redirect-devtop/2021/7/751305.json": "These are essential topics every programmer should prepare for coding interviews. ",
  "data/redirect-devtop/2021/7/756674.json": "Tired of writing the same code over and over again?   or           Want to save time in a...",
  "data/redirect-devtop/2021/7/758246.json": "We can see how to use Axios in an optimized and scalable way in a React app.  When you are building...",
  "data/redirect-devtop/2021/7/758671.json": "If you're starting to apply for your first web developer junior position, then you might want to...",
  "data/redirect-devtop/2021/7/757338.json": "After receiving much positive feedback on my post “Docker for Dummies”, I wanted to create a post...",
  "data/redirect-devtop/2021/7/758239.json": "Hello, everybody! 👋 And welcome to the first lecture of the Styled Components 101 series.  In this...",
  "data/redirect-devtop/2021/7/758557.json": "There was a time that I would have never imagined the need to write an article like this. If you were...",
  "data/redirect-devtop/2021/7/758565.json": "Ever wondered why React keeps bugging you about using the key attribute? Why we need to use this if...",
  "data/redirect-devtop/2021/7/759120.json": "As a child, I was spellbound by the 2000 AD comics. It had nonlinear narratives, irreverent humour,...",
  "data/redirect-devtop/2021/7/757761.json": "All frameworks need to keep state. Frameworks build up the state by executing the templates. Most...",
  "data/redirect-devtop/2021/7/759169.json": "A 30 minutes lunch break? Time entry. 12 minutes of arguing with mom? Time entry. 7 minutes of...",
  "data/redirect-devtop/2021/7/759170.json": "What exactly is “clean code”? Generally speaking, clean code is code that is easy to understand and...",
  "data/redirect-devtop/2021/7/747638.json": "Hey, welcome back. This article is part of the Dockerize series, make sure to checkout the...",
  "data/redirect-devtop/2021/7/758787.json": "Hello reader!   Whenever a client sends a request to server, the response always contains a status...",
  "data/redirect-devtop/2021/7/759230.json": "What is Keystroke Count?    Keystroke Count is an open-source, desktop app that you can use...",
  "data/redirect-devtop/2021/7/759594.json": "hello everyone, I'm Aya Bouchiha, today, I will talk about 5 HTML tags that almost nobody knows.    ...",
  "data/redirect-devtop/2021/7/758649.json": "VS code is simply awesome. These 5 extensions are like cherry on top. so let's jump to the...",
  "data/redirect-devtop/2021/7/758609.json": "resize: none vs resize: vertical   Whenever I see textarea with a fixed height I want to...",
  "data/redirect-devtop/2021/7/752759.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/7/759228.json": "Every once in a while, we software engineers/developers face a moment where we have to slow down our...",
  "data/redirect-devtop/2021/7/759219.json": "I'm super happy that investors and big companies are finally happy to support Open Source projects....",
  "data/redirect-devtop/2021/7/760223.json": "Hey everyone 👋🏻,  In this article, let us see 10 JavaScript Projects Every Beginner Must Try.        ...",
  "data/redirect-devtop/2021/7/758187.json": "Hello, there!  After a while without new posts, I decided to come back with a really useful tip to...",
  "data/redirect-devtop/2021/7/760274.json": "Hi dev friends!  I made this CSS Grid Cheat Sheet that fits on one page. I hope this will help you...",
  "data/redirect-devtop/2021/7/758492.json": "Being able to write your own command-line tools is a great skill to have: automate all the...",
  "data/redirect-devtop/2021/7/760131.json": "In this article I am going to show you how to make an analog clock using HTML CSS and JavaScript...",
  "data/redirect-devtop/2021/7/760170.json": "In this article, we are going to learn why we should use Array.some instead of  Array.forEach  (or)...",
  "data/redirect-devtop/2021/7/759112.json": "What's the output ?    const shape = {   radius: 10,   diameter() {     return this.radius * 2;   }, ...",
  "data/redirect-devtop/2021/7/759243.json": "It would seem that every day, more and more companies have been pushing to introduce GraphQL in their...",
  "data/redirect-devtop/2021/7/759498.json": "Hi everyone!  I've been working on React Preview for a few months. It's currently only available...",
  "data/redirect-devtop/2021/7/759996.json": "Recently, I dual booted my PC with Ubuntu and Windows and for the first couple of days on Ubuntu, I...",
  "data/redirect-devtop/2021/7/759497.json": "When I started my career, I was always afraid of losing my code changes. Sometimes, I would copy the...",
  "data/redirect-devtop/2021/7/760001.json": "Hello 👋 guys hope you all are fine and safe so today in this blog I will show you the best TOP 3...",
  "data/redirect-devtop/2021/7/758505.json": "14 JS Array Methods (In 8 Minutes) Screencast       let stocks = [    { name: 'Apple',...",
  "data/redirect-devtop/2021/7/758670.json": "Have you ever thought what are the areas or things to take care of to improve your code? Logical code...",
  "data/redirect-devtop/2021/7/759149.json": "Learn how to build your own role-based access control in Payload",
  "data/redirect-devtop/2021/7/760755.json": "Whether you are a beginner or an expert in Frontend Development it is important to follow some best...",
  "data/redirect-devtop/2021/7/760230.json": "In this article, we will walk through common ways of implementing authentication microservices.   We...",
  "data/redirect-devtop/2021/7/760655.json": "Plug: I work on Million.js: &lt;1kb virtual DOM - it's fast!            TL;DR   Virtual DOM needs to...",
  "data/redirect-devtop/2021/7/761024.json": "Hey, welcome. If you are here, you must have heard about flex box in CSS or you already know what is...",
  "data/redirect-devtop/2021/7/759870.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/7/761180.json": "This Cheat Sheet was made by CodeWithHarry, I found this very useful for quick revision and personal...",
  "data/redirect-devtop/2021/7/760217.json": "I believe that everyone at some point when they were working with nested data became so saturated...",
  "data/redirect-devtop/2021/7/760941.json": "I recently illustrated how we can achieve complex CSS animations using cubic-bezier() and how to do...",
  "data/redirect-devtop/2021/7/760825.json": "This Cheat Sheet was made by CodeWithHarry. I found this very useful so I am sharing it with you all....",
  "data/redirect-devtop/2021/7/760155.json": "Hi folks , Today I will go through with one of the most important whitepapers in AWS Original...",
  "data/redirect-devtop/2021/7/756837.json": "Organisations are moving their workloads to the cloud as quickly as they can. While most applications...",
  "data/redirect-devtop/2021/7/760483.json": "Designing a component library is no easy task. It entails a long list of decisions that can become...",
  "data/redirect-devtop/2021/7/755789.json": "Let's Define Closure   A closure is a function that makes use of variable defined in outer...",
  "data/redirect-devtop/2021/7/759875.json": "A short-list with open-source React Dashboards already coded with JWT authentication and usable backend.",
  "data/redirect-devtop/2021/7/759687.json": "Ever wondered how to implement copy and paste functionality in any of your web applications?      ...",
  "data/redirect-devtop/2021/7/761282.json": "Ever since GitHub released the feature that allows users to add a profile level Readme to showcase...",
  "data/redirect-devtop/2021/7/754870.json": "What is VueJs ?   Vue is a progressive framework for building user interfaces. It's based on...",
  "data/redirect-devtop/2021/7/755788.json": "Serie of article in order to learn Golang language by concrete applications as example",
  "data/redirect-devtop/2021/7/759519.json": "Hey DEVs, in today’s episode we are going to build a Vertical Slider using JavaScript; basically, we...",
  "data/redirect-devtop/2021/7/759150.json": "This incident retro was tougher than most to share because, despite the seriousness of the issue, it...",
  "data/redirect-devtop/2021/7/761317.json": "Introduction  A couple of years ago, I happened to play a game called Cuphead. When I finished it, I...",
  "data/redirect-devtop/2021/7/760014.json": "Introduction   This isn't going to be just another hooks and context tutorial, this is going...",
  "data/redirect-devtop/2021/7/761610.json": "In recent times few friends reached out to me, asking for links to resources that can help them...",
  "data/redirect-devtop/2021/7/761265.json": "In this post we’ll explore how we can add video call functionality to a TalkJS chat. With remote work...",
  "data/redirect-devtop/2021/7/761767.json": "In this article I am going to show you how to add 3-D effects to a Landing Page using HTML, CSS and...",
  "data/redirect-devtop/2021/7/760133.json": "Welcome my friend !  I will share with you some important resource that will improve your skill in...",
  "data/redirect-devtop/2021/7/760407.json": "Every application needs some kind of state management. Let's start with the most basic one, and we...",
  "data/redirect-devtop/2021/7/753457.json": "DevOps tool of the month is a series, where each month I introduce one new useful DevOps tool in 2021...",
  "data/redirect-devtop/2021/7/761778.json": "Hello Everyone!   Today, in this tutorial, we will be trying to make a URL shortener API. To...",
  "data/redirect-devtop/2021/7/761710.json": "In this article I will show you how to create an automatic image slider using HTML CSS and JavaScript...",
  "data/redirect-devtop/2021/7/760266.json": "Yes, the above image is from the console and you can customize the text however you like. To know how...",
  "data/redirect-devtop/2021/7/761951.json": "Join My Discord To download This Cheatsheet as PDF here           Python...",
  "data/redirect-devtop/2021/7/762273.json": "Just throwing out the my current preference for a React project folder structure. I think this gives...",
  "data/redirect-devtop/2021/7/761443.json": "Write CSS that is easy to read and everyone can understand   One of the struggles developers...",
  "data/redirect-devtop/2021/7/760477.json": "Cheatsheets are good when you want to revise some of the concepts, but not an idle way to start...",
  "data/redirect-devtop/2021/7/762281.json": "Hello everybody, I'm Aya Bouchiha today, I'm going to share with you useful resources to learn 5...",
  "data/redirect-devtop/2021/7/759226.json": "We're all familiar with dev.to's “Reaction Component” (although I'm still not sure, what the unicorn...",
  "data/redirect-devtop/2021/7/761431.json": "Quick summary   In this tutorial, we will see how to refactor a higher order component into...",
  "data/redirect-devtop/2021/7/755637.json": "Data can be stored and accessed in many ways. You already know some common JavaScript data structures...",
  "data/redirect-devtop/2021/7/760412.json": "3. The final one, useBussinessLogic hook   Hooks are free of cost. i.e., you can make them...",
  "data/redirect-devtop/2021/7/760811.json": "This post explains how to build a CI/CD pipeline using AWS services. It also explains how to organize...",
  "data/redirect-devtop/2021/7/756361.json": "Created by Evan You (also the creator of Vue.js), Vite is a build tool that significantly improves...",
  "data/redirect-devtop/2021/7/762464.json": "🌸𝑺𝒆𝒍𝒇 𝑳𝒆𝒂𝒓𝒏𝒊𝒏𝒈 𝒊𝒔 𝒕𝒉𝒆 𝒑𝒓𝒐𝒄𝒆𝒔𝒔 𝒐𝒇 𝒄𝒓𝒆𝒂𝒕𝒊𝒏𝒈 𝒀𝑶𝑼 𝒚𝒐𝒖𝒓𝒔𝒆𝒍𝒇🌸  The world of self-learning can be a little...",
  "data/redirect-devtop/2021/7/762374.json": "Unless you were living under a rock, you must have come across some article or video about GitHub...",
  "data/redirect-devtop/2021/7/762035.json": "This post is dedicated to my wife who, despite being one of the smartest person I know, still sucks...",
  "data/redirect-devtop/2021/7/762456.json": "In this tutorial, we are trying to recreate Google's text input field animation and design from...",
  "data/redirect-devtop/2021/7/754925.json": "Motivation   Almost every Single-Page Application at some point needs to get some data from...",
  "data/redirect-devtop/2021/7/762778.json": "Like star rating, reactions is something widely used in many websites so here I am with my own...",
  "data/redirect-devtop/2021/7/761504.json": "There's a package for that   You don't need to build your entire web app from scratch. There...",
  "data/redirect-devtop/2021/7/762219.json": "Node modules are famous for being the heaviest object in the universe 😂 and deleting them is no joke....",
  "data/redirect-devtop/2021/7/759970.json": "Here is a researched and handpicked list of the top python github repos and libraries...",
  "data/redirect-devtop/2021/7/762381.json": "Regular expressions (regex) are one of those things that folks seem to make fun of most of the time...",
  "data/redirect-devtop/2021/7/762268.json": "I almost picked the title \"JavaScript's Factory for Everything\", but then I changed my mind after...",
  "data/redirect-devtop/2021/7/762587.json": "Mental models are personal, internal representations of external reality that people use to interact...",
  "data/redirect-devtop/2021/7/759430.json": "What are CSS media queries and why are useful?   CSS media queries give us the ability to...",
  "data/redirect-devtop/2021/7/762858.json": "React is a JavaScript library for building user interfaces. React utilizes reusable components. This...",
  "data/redirect-devtop/2021/7/760224.json": "Here is a researched and handpicked list of the top 5 github projects essential for aspiring...",
  "data/redirect-devtop/2021/7/762144.json": "This article covers the processes that happen in-between a user entering a web address in a browser...",
  "data/redirect-devtop/2021/7/762475.json": "So you have heard of lazy loading. Let me quote from wikipedia.    \"Lazy loading is a device pattern...",
  "data/redirect-devtop/2021/7/765980.json": "A small selection of little-known techniques for HTML, CSS, and JavaScript.   The frontend is the...",
  "data/redirect-devtop/2021/7/764611.json": "In just 3 simple steps, you can use Kool to start a new NestJS application running in a local Docker...",
  "data/redirect-devtop/2021/7/763274.json": "Hello, welcome. In this article we'll learn about CSS pseudo-elements.           What is...",
  "data/redirect-devtop/2021/7/762472.json": "So first of all let me tell you what actually is a JSX !            A JSX(JavaScript XML) is...",
  "data/redirect-devtop/2021/7/762937.json": "What are Classes?   A class is an object-oriented programming concept that is built into...",
  "data/redirect-devtop/2021/7/763549.json": "Being developers, we work with many different languages. Which makes it humanly impossible to...",
  "data/redirect-devtop/2021/7/762524.json": "Mobile First without overrides   There is the mobile first approach dictates we should...",
  "data/redirect-devtop/2021/7/763504.json": "Click ⭐ if you like the project. Pull Request are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/7/766799.json": "Today, the playbook for self-hosting your own Forem community is officially live. Read all...",
  "data/redirect-devtop/2021/7/763525.json": "In the previous blog, we discussed writing a Smart Contract using Solidity and interacting with it...",
  "data/redirect-devtop/2021/7/766461.json": "Overview   Have you ever wondered how do companies like Slack, Netlify, Zoom, Facebook (and...",
  "data/redirect-devtop/2021/7/765981.json": "We all follow naming conventions in programming languages, don't we? Now, what about CSS? Is there...",
  "data/redirect-devtop/2021/7/762527.json": "Recently I tried Vite and I was blown away by how fast it was. I re-checked if I started the app...",
  "data/redirect-devtop/2021/7/766101.json": "Hello, I'm Aya Bouchiha, today, I'm going to discuss another 5 HTML tags that you're almost don't...",
  "data/redirect-devtop/2021/7/754980.json": "Sumario:   Sigla API O que de Fato uma API faz? Um exemplo da vida real Concluindo   Estamos vivendo...",
  "data/redirect-devtop/2021/7/766254.json": "Hi guys! So, couple of months back I wrote a blog \"I created a VSCode theme\" describing about the VS...",
  "data/redirect-devtop/2021/7/766508.json": "Python is an interpreted, high-level language created by Guido van Rossum and released in 1991. It...",
  "data/redirect-devtop/2021/7/761426.json": "Being a tech lead is difficult.  As a tech lead, you’re often expected to continue to be a high...",
  "data/redirect-devtop/2021/7/766661.json": "NocoDB                                   nocodb        /          nocodb                    ...",
  "data/redirect-devtop/2021/7/756157.json": "Did you know you can create really cool patterns using just the CSS background properties? This blog...",
  "data/redirect-devtop/2021/7/766106.json": "Starter Antd Admin (Crud &amp; auth) App based on Mern Stack   App built for DigitalOcean...",
  "data/redirect-devtop/2021/7/763356.json": "If you are working with javascript for a while, you will agree with me. This ‘this’ keyword is very...",
  "data/redirect-devtop/2021/7/757067.json": "If you're looking into working with react but don't know where to start, then you've come to...",
  "data/redirect-devtop/2021/7/766003.json": "Next.js uses 4 rendering strategies to build, deliver and render a React Single Page App (SPA):  1....",
  "data/redirect-devtop/2021/7/763513.json": "Instead of going through a complex third-party library docs, I tried to figure out how to build a...",
  "data/redirect-devtop/2021/7/762126.json": "Adding external script files to your HTML document is simple that you could do it in your sleep.  But...",
  "data/redirect-devtop/2021/7/766111.json": "I somehow often end up working on a few branches in parallel and some things make my life...",
  "data/redirect-devtop/2021/7/766538.json": "Hello everyone today i will show you how to fetch API in react js using 'useEffect'.  Hooks are a new...",
  "data/redirect-devtop/2021/7/766783.json": " This page lists over 10 JavaScript projects for beginners! There are no frameworks and each...",
  "data/redirect-devtop/2021/7/767571.json": "I've picked up a ton of useful tips over the years developing and writing about Vue. Some are clever, some I use almost every day, and some are more advanced — but they're all useful.",
  "data/redirect-devtop/2021/7/763262.json": "Do you love reading more than watching tutorials, then my friend this post is for you. I'm going to...",
  "data/redirect-devtop/2021/7/761268.json": "Optimize your React App during the development stage using these packages and avoid issues during...",
  "data/redirect-devtop/2021/7/767837.json": "Background   By creating several dashboards for my professional use, I ended up with...",
  "data/redirect-devtop/2021/7/767063.json": "Hi, I'm Aya Bouchiha today, I'm going to talk about useful Array methods in Javascript.          ...",
  "data/redirect-devtop/2021/7/767809.json": "As a developer, you need to organise your tasks to manage your time and successfully complete a...",
  "data/redirect-devtop/2021/7/767615.json": "A curated list with FullStack React Examples that are more than templates. All mentioned products are provided with authentication, database, and usable APIs.",
  "data/redirect-devtop/2021/7/766543.json": "Pre View:View:  In this post i represent how i build a spotify clone web app using ReactJS+Redux...",
  "data/redirect-devtop/2021/7/767223.json": "Let us create a full-stack web application using Django Framework for Python and ReactJS , the famous...",
  "data/redirect-devtop/2021/7/768168.json": "Hello Friends, I have listed over 15 best css accordion designs made with HTML, CSS, and JS. Check...",
  "data/redirect-devtop/2021/7/767540.json": "Introduction            What is Node.js?     Node.js is an open-source, cross-platform,...",
  "data/redirect-devtop/2021/7/768071.json": "Hello everybody, I'm Aya Bouchiha, on this beautiful day we're going to discuss all string methods in...",
  "data/redirect-devtop/2021/7/767526.json": "We'll be creating the frontend application for our backend application.           Before we get...",
  "data/redirect-devtop/2021/7/767240.json": "Hey everyone 👋🏻,  In this article, let us understand the useRef hook in React.js.           SYNTAX...",
  "data/redirect-devtop/2021/7/745872.json": "So you don't have formal CS education and have been doing development for some years, or you are a...",
  "data/redirect-devtop/2021/7/767594.json": "Click ⭐ if you like the project. Pull Requests are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/7/767877.json": "How many of us still use the old ES syntax in our NodeJS apps?    const express =...",
  "data/redirect-devtop/2021/7/768225.json": "Do you know that when you deploy your React application which is created using 𝗰𝗿𝗲𝗮𝘁𝗲-𝗿𝗲𝗮𝗰𝘁-𝗮𝗽𝗽 or...",
  "data/redirect-devtop/2021/7/768355.json": "Programmers that don't blog should start right now. You're future self with thank you when your blog...",
  "data/redirect-devtop/2021/7/768243.json": " If you have decided to build your career in NodeJS development, we have gathered a list of nodeJS...",
  "data/redirect-devtop/2021/7/768401.json": "Hello!   Recently I started creating a clone of Windows 11 for web in Preact. My main focus while...",
  "data/redirect-devtop/2021/7/765907.json": "Written by Geshan Manandhar ✏️  Node.js has gained a lot of popularity in the past few years. It is...",
  "data/redirect-devtop/2021/7/768850.json": "Svelte is an amazing JavaScript framework that has been getting a lot of attention the last year....",
  "data/redirect-devtop/2021/7/755794.json": "Serie of article in order to learn Golang language by concrete applications as example",
  "data/redirect-devtop/2021/7/768410.json": "Hello, welcome. Today we'll see a quick CSS trick.            Gradient Text Stroke   Wonder, how to...",
  "data/redirect-devtop/2021/7/747413.json": "If you are interested in knowing what aspects of JavaScript are going to be important for frameworks...",
  "data/redirect-devtop/2021/7/768633.json": "Website scraping is much more than extracting content with some CSS selectors. We summarized years of...",
  "data/redirect-devtop/2021/7/767892.json": "Over the past couple of years, one tech stack that has consistently stood out from the crowd in...",
  "data/redirect-devtop/2021/7/768160.json": "Click ⭐ if you like the project. Pull Requests are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/7/768018.json": "After speaking to seasoned developers, you will quickly realize that the best way to improve your...",
  "data/redirect-devtop/2021/7/768889.json": "Hello everyone, in this article we are going to build a NodeJS CRUD API with Fastify. Fastify is a...",
  "data/redirect-devtop/2021/7/767504.json": "Hoppscotch is an open source API development ecosystem.    Since the initial commit (~2 years ago),...",
  "data/redirect-devtop/2021/7/768329.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/7/768806.json": "If you are looking for ways to start your open source journey and would like to use your technical...",
  "data/redirect-devtop/2021/7/768863.json": "Simple Calculator is the best way to build a good understanding of react concepts. Let me know if...",
  "data/redirect-devtop/2021/7/769354.json": "HTML is the markup language used for structuring and presenting content on the World Wide Web....",
  "data/redirect-devtop/2021/7/767781.json": "Hi Devs!  Do you remember how you got the 💎idea and want to make it but don't know how to approach...",
  "data/redirect-devtop/2021/7/769533.json": " No doubt, JavaScript development is a booming profile. Today there are around currently 12.1 million...",
  "data/redirect-devtop/2021/7/768697.json": "“What branch are you on?” is often the first question you ask when a teammate says “The tests aren't...",
  "data/redirect-devtop/2021/7/767844.json": "Hey readers 👋🏻, in this blog we are going to talk about Regular Expressions or we can also call it...",
  "data/redirect-devtop/2021/7/767997.json": "We hope this post teaches you a bit more about DEV's stance on ableist language while also providing some examples of inclusive language and how to use it.  ",
  "data/redirect-devtop/2021/7/769336.json": "What is Web Storage Web storage is more secure, and large amounts of data can be stored locally...",
  "data/redirect-devtop/2021/7/767919.json": "React context is an essential tool for every React developer to know. I lets you easily share state...",
  "data/redirect-devtop/2021/7/769514.json": "Click ⭐ if you like the project. Pull Requests are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/7/768930.json": "Hello Readers!  This episode of the series Basic Data Structure in JavaScript: Arrays includes how to...",
  "data/redirect-devtop/2021/7/769920.json": "Git is a version control tool that any developer would benefit from learning. Using git allows you to...",
  "data/redirect-devtop/2021/7/770048.json": "In this web period, practically any free tools can be found online to take care of normal issues...",
  "data/redirect-devtop/2021/7/768923.json": "Welcome to Day 3 of the JavaScript30 challenge, and today we’re going to build this amazing Mini...",
  "data/redirect-devtop/2021/7/769578.json": "When Mock Service Worker was released, it had a clear mission to enable API mocking without the need...",
  "data/redirect-devtop/2021/7/769635.json": "Welcome to the new vue academy ! It will be a list of lot of article on vue! I have 2.5 years of...",
  "data/redirect-devtop/2021/7/763563.json": "If you're looking for an RxJS quick start then this article is not for you!  Here I will be tackling...",
  "data/redirect-devtop/2021/7/770287.json": "Unit testing is an important and often overlooked part of the development process. It is considered...",
  "data/redirect-devtop/2021/7/770256.json": "Hello, welcome. Today we'll see a quick CSS tutorial on how to make gradient loading animation.     ...",
  "data/redirect-devtop/2021/7/769788.json": "Index    Ada Agda Alef Android APL Arduino ASP.NET MVC  Assembly...",
  "data/redirect-devtop/2021/7/770456.json": "This post will be just a #short content opposed to others I post.  As developers, we know our job is...",
  "data/redirect-devtop/2021/7/769550.json": "Using the fetch API is a good idea if you want to make HTTP requests and get data from APIs. It's...",
  "data/redirect-devtop/2021/7/770134.json": "The better you know the machine, the better you can use it!  Yes or no?  Whether you make your living...",
  "data/redirect-devtop/2021/7/769403.json": "Clean Code StudioFollow             Clean Code...",
  "data/redirect-devtop/2021/7/769795.json": "Introduction  2 years ago, wandering through the expanses of Behance, I came across an interesting...",
  "data/redirect-devtop/2021/7/770478.json": "TIPS 1: Easiest way of string to integer conversion.      const value_1 = \"1\"   const...",
  "data/redirect-devtop/2021/7/770317.json": "Click ⭐ if you like the project. Pull Requests are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/7/770142.json": "Async functions are great, especially if you have to call multiple functions in a row that return...",
  "data/redirect-devtop/2021/7/770760.json": "Often while starting out, beginners struggle to create captivating UI that gets users hooked to their...",
  "data/redirect-devtop/2021/7/769933.json": "I was wondering about that. Is it true? Does it happen to you too?",
  "data/redirect-devtop/2021/7/769066.json": "Let's add a few buttons      &lt;button class=\"primary\"&gt;OK&lt;/button&gt;   &lt;button...",
  "data/redirect-devtop/2021/7/768687.json": "See how Ionic might be the perfect fit for you and your web development team to build mobile apps",
  "data/redirect-devtop/2021/7/768841.json": "With three friends, we try to create our first startup 5 years ago, we failed it, and we learn a lot...",
  "data/redirect-devtop/2021/7/769914.json": "C++ is, hands down, one of the most misunderstood languages in software developer pop culture...",
  "data/redirect-devtop/2021/7/770444.json": "Hello 👋 Hope all are doing good in this pandemic time.   Whenever i am seeing any reactjs code...",
  "data/redirect-devtop/2021/7/770368.json": "Flexbox is a powerful, well-supported layout method that was introduced with the latest version of...",
  "data/redirect-devtop/2021/7/770468.json": "Intro   In this article we'll be building a event-driven app in Java using the Micronaut...",
  "data/redirect-devtop/2021/7/770740.json": "What the heck are closures anyways?   According to the official Mozilla website closure...",
  "data/redirect-devtop/2021/7/766974.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2021/7/771019.json": "React is a JavaScript library used to build user interfaces and develop single-page applications...",
  "data/redirect-devtop/2021/7/767515.json": "\"Got a new macbook🥳! What should I install now 🧐?\"    I'm getting this question every...",
  "data/redirect-devtop/2021/7/769779.json": "I have recently implemented the frontend side of an online payment system, and surprisingly it was...",
  "data/redirect-devtop/2021/7/770984.json": "Hello, everybody! 👋 And welcome to the 2nd lecture of the Styled Components 101 series 🙌  In this...",
  "data/redirect-devtop/2021/7/771004.json": "Hello Devs,  In this blog I will guide you all through \"HOW WE CAN STYLE CONSOLE.LOG() USING CSS\" I...",
  "data/redirect-devtop/2021/7/771039.json": "Hello, Dev Friends.\"How to think while building Applications?\"This is the question I didn't know how...",
  "data/redirect-devtop/2021/7/771011.json": "In the beginning of the year,we challenge ourselves to clone twitter from scratch using php,mysql and...",
  "data/redirect-devtop/2021/7/771024.json": "Address Tag   The &lt;address&gt; HTML element indicates that the enclosed HTML provides...",
  "data/redirect-devtop/2021/7/756666.json": "A README is a great way to show people what your project can do, and why it matters, and here I'll...",
  "data/redirect-devtop/2021/7/771258.json": "Before Knowing about framer motion first we should know why should we need Framer motion? Framer...",
  "data/redirect-devtop/2021/7/770312.json": "A simple example of React useContext and useReducer Hooks available in React that can be...",
  "data/redirect-devtop/2021/7/771966.json": "A simple JavaScript JavaScript cheat sheet for beginner buddies!",
  "data/redirect-devtop/2021/7/771805.json": "INTRODUCTION   Today, I thought maybe I should practice my frontend knowledge so I check...",
  "data/redirect-devtop/2021/7/770981.json": "As a frontend developer often times we want to just spit out a decently looking UI in a short span of...",
  "data/redirect-devtop/2021/7/752198.json": "I've published over 30 articles this past year, with that comes a lot of research and I've seen so...",
  "data/redirect-devtop/2021/7/766544.json": "1) Shades of Purple    If you are a fan of purple, you are absolutely gonna love this theme....",
  "data/redirect-devtop/2021/7/758178.json": "Hello! Long time no see! Back in December, we decided to start working on our next major release, the...",
  "data/redirect-devtop/2021/7/763247.json": "When I was working on my small side-project library, I needed to represent a missing value. In the...",
  "data/redirect-devtop/2021/7/772074.json": "Wanna know how to use modern CSS features to write clean code by using some stunning CSS tricks? You...",
  "data/redirect-devtop/2021/7/770279.json": "Web Developers used to spend a lot of time creating beautiful CSS. Thanks to the CSS libraries, we...",
  "data/redirect-devtop/2021/7/771275.json": "Hello guys,  I have developed an application with BodyPix, that removes an original background and...",
  "data/redirect-devtop/2021/7/770646.json": "Welcome to Day 3 of the JavaScript30 challenge, and today we’re going to checkout some of the most...",
  "data/redirect-devtop/2021/7/771225.json": "Introduction   Few days back, I was working on a side project and I was required to create a...",
  "data/redirect-devtop/2021/7/770949.json": "Next.js allows developers to set up dynamic layouts per-page. Benefits and details of this approach...",
  "data/redirect-devtop/2021/7/770159.json": "[JS#5 WIL 🤔 Post]   JavaScript hoisting refers to the process where the compiler allocates...",
  "data/redirect-devtop/2021/7/773144.json": "Yes, you.  This post is trending right now...                                         To Typescript...",
  "data/redirect-devtop/2021/7/771960.json": "In today's ultra fast paced world, 3 Seconds of a not-yet-loaded-website is more than enough for the...",
  "data/redirect-devtop/2021/7/772942.json": "This article is all about my placements journey. I have cleared interviews and got offers from...",
  "data/redirect-devtop/2021/7/769800.json": "I recently have been exploring the field of Machine  Learning; in all honesty, I have had to...",
  "data/redirect-devtop/2021/7/772871.json": "Here’s what I think: if you are building websites, you don’t need React (in most cases).  I have been...",
  "data/redirect-devtop/2021/7/772366.json": "Recently, I needed to prepare a lecture material on Consuming REST APIs in your React Project so I...",
  "data/redirect-devtop/2021/7/772949.json": "Many of you loved my list with the 10 Must-Have VS Code Extensions to boost developer productivity so...",
  "data/redirect-devtop/2021/7/772357.json": "A curated list with ope-source REST Servers that use a unified API interface across multiple frameworks: Django, Flask, Node JS.",
  "data/redirect-devtop/2021/7/773140.json": "We, software engineers, tend to be extremely efficient beings.  Our goal is to optimize everything,...",
  "data/redirect-devtop/2021/7/771268.json": "Variables   We use variables to temporarily store data in the computer’s memory.  price =...",
  "data/redirect-devtop/2021/7/762040.json": "I prepared a small quiz for you at the end of the article, so keep reading! 👀 Do you know all of the...",
  "data/redirect-devtop/2021/7/772281.json": "Photo by Adrian Infernus on Unsplash           Introduction   Frequently the core of our front end...",
  "data/redirect-devtop/2021/7/772401.json": "1️⃣  Codecademy   Codecademy is an American online interactive platform that offers free...",
  "data/redirect-devtop/2021/7/773131.json": "Click ⭐ if you like the project. Pull Requests are highly appreciated ❤️   Github link:...",
  "data/redirect-devtop/2021/7/772922.json": "In my previous post, one of my readers, said some very good points against typescript and is...",
  "data/redirect-devtop/2021/7/772463.json": "Content by github.com/ripienaar/free-for-dev           free-for.dev   Developers and Open Source...",
  "data/redirect-devtop/2021/7/772449.json": "Lately, I've been doing a lot more things at the command line. I'm not a hard-core terminal guy -- I...",
  "data/redirect-devtop/2021/7/773848.json": "If you spend a lot of time doing front-end development, you know how big the the world of HTML, CSS...",
  "data/redirect-devtop/2021/7/771670.json": "Java is one of the best and most widely used programming language. The main reason for this is...",
  "data/redirect-devtop/2021/7/771509.json": "In this article, I’ll show you 5 easy ways to make money as a developer.           1....",
  "data/redirect-devtop/2021/7/766462.json": "The USE Method | The RED method | The Four Golden Signals   Running applications at scale is...",
  "data/redirect-devtop/2021/7/774186.json": "Hey everyone 👋🏻,  In this article, let us see 8 React  Projects Every Beginner Should Try.           ...",
  "data/redirect-devtop/2021/7/761686.json": "Introduction   A newsletter can be a good source of getting updated about the progress that...",
  "data/redirect-devtop/2021/7/773907.json": "Past   Back in the days when JavaScript was first manifested, direct DOM manipulation was...",
  "data/redirect-devtop/2021/7/773138.json": "My followers know that I no longer work as a frontend developer, however, I worked as one for nearly...",
  "data/redirect-devtop/2021/7/771402.json": "I know that you might be thinking🤔 that Is this blog really help you to start your open-source...",
  "data/redirect-devtop/2021/7/773707.json": "Are you searching for the best design resources? This is a collection that every developer should...",
  "data/redirect-devtop/2021/7/773906.json": "Clean Code StudioFollow             Clean Code...",
  "data/redirect-devtop/2021/7/773830.json": "Lodash is a Javascript utility library, that helps you work with arrays, objects, strings, and just...",
  "data/redirect-devtop/2021/7/774647.json": "Content and all rights reserved to github.com/goldbergyoni/nodebestpractices           Node.js Best...",
  "data/redirect-devtop/2021/7/774441.json": "Getting started with JavaScript can be both fun and overwhelming at the same time. Fun because it is...",
  "data/redirect-devtop/2021/7/774181.json": "In this article I am going to show you how to create a random password generator with the help of...",
  "data/redirect-devtop/2021/7/773524.json": "Git commands cheatsheet📁           The Essentials — When working with git on your own or with...",
  "data/redirect-devtop/2021/7/773212.json": "In just 2 simple steps, you can use Kool to start a new Hugo application running in a local Docker...",
  "data/redirect-devtop/2021/7/773233.json": "Here is a Pure CSS checkbox with only one element. It’s also accessibility friendly.          ...",
  "data/redirect-devtop/2021/7/769562.json": "Redux is a state manager for JavaScript Applications. Mostly used with React. Most of the large-scale...",
  "data/redirect-devtop/2021/7/772473.json": "According to me every website should have a DARK MODE toggle. As most of the time we as developers,...",
  "data/redirect-devtop/2021/7/772459.json": "Writing is an excellent way to improve your reputation as a developer. You can build an audience from...",
  "data/redirect-devtop/2021/7/771038.json": "Hi everyone 👋  Today I wanted to share with you 10 awesome JavaScript shorthands that will increase...",
  "data/redirect-devtop/2021/7/774304.json": "TensorFlow.js (or, in short, tfjs) is a library that lets you create, train, and use trained Machine...",
  "data/redirect-devtop/2021/7/772901.json": "\"Hey, guys\" is a phrase I often hear.  It usually continues with words like \"what do you think about...",
  "data/redirect-devtop/2021/7/774394.json": "No matter how experienced you are, Git will always find a way to surprise you. It is loaded with neat...",
  "data/redirect-devtop/2021/7/774989.json": "Define your functions in many ways.  One way is using function keyword:    // function...",
  "data/redirect-devtop/2021/7/775626.json": "Staying focused is one of the hardest tasks when perusing a new hobby, goal or project. Trying to...",
  "data/redirect-devtop/2021/7/763245.json": "test",
  "data/redirect-devtop/2021/7/775665.json": "As I am learning Development, I would like to share this 7 CSS tricks that you should know for better...",
  "data/redirect-devtop/2021/7/772501.json": "Frida is a teacher assistant developed with JavaScript and the Web Speech APIs.",
  "data/redirect-devtop/2021/7/774799.json": "Hello Developers! Let's see what's new in React Navigation 6.x.           Key Points...",
  "data/redirect-devtop/2021/7/775679.json": "Being a JavaScript developer can be an exciting job. Almost every day you will find something...",
  "data/redirect-devtop/2021/7/775273.json": "TL;DR   In this post I introduce useful custom React.js hooks that take websocket clients to...",
  "data/redirect-devtop/2021/7/775677.json": "Hi, I'm Safak. I am a full-stack web developer and I'm sharing open source web projects on my YouTube...",
  "data/redirect-devtop/2021/7/776285.json": "Welcome to my new academy, Webpack Academy !  I will try to share my webpack knowledges !  Let's...",
  "data/redirect-devtop/2021/7/773831.json": "Tailwind UI is a beautiful UI component library that you can use, to make beautiful websites in just...",
  "data/redirect-devtop/2021/7/775584.json": "ruby        /          debug                        Debugging...",
  "data/redirect-devtop/2021/7/776267.json": "Hello, welcome. Today we'll see, how we can easily create a youtube clone using HTML, CSS and JS...",
  "data/redirect-devtop/2021/7/774080.json": "Hey peeps, yes I have written a listicle. Don't worry I am OK. May I present 101 Accessibility tips...",
  "data/redirect-devtop/2021/7/745506.json": "Hello everyone, today we are going to look at the cursor property available in CSS. And why not use a...",
  "data/redirect-devtop/2021/7/776815.json": "In the past few days, I appeared for many frontend devs interview. So, in this post, I have compiled...",
  "data/redirect-devtop/2021/7/775549.json": "Written by Lawrence Eagles ✏️           Introduction   According to the Cambridge dictionary, to...",
  "data/redirect-devtop/2021/7/775759.json": "After an amazing response on my first \"Amazing CSS Tips &amp; Tricks\" blog, here I am with Part-2. So...",
  "data/redirect-devtop/2021/7/774076.json": "In usual Responsive Webpage developing way, Developers are required to convert Design file they adapt...",
  "data/redirect-devtop/2021/7/776898.json": "Introduction  In fact, today's article is devoted not only to how to make a specific slider, which...",
  "data/redirect-devtop/2021/7/773897.json": "What is Svelte?   According to the official website;    \"Svelte is a radical new approach to...",
  "data/redirect-devtop/2021/7/775015.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/7/776266.json": "INTRODUCTION   Previously on this challenge, we talked about sass's new import system and...",
  "data/redirect-devtop/2021/7/775427.json": "An analytical comparison of two common API patterns in Lambda",
  "data/redirect-devtop/2021/7/774785.json": "This is not a conclusive listing; it rather seeks to provide a general guideline that is both...",
  "data/redirect-devtop/2021/7/777148.json": "Hey Folks, I have written this same blog with preview of each illustration website and license on my...",
  "data/redirect-devtop/2021/7/776276.json": "HTML input attributes make the input elements more usable. These input attributes provide more...",
  "data/redirect-devtop/2021/7/776831.json": "The HTML Capture attribute open device camera to capture image followed by accept attribute  The...",
  "data/redirect-devtop/2021/7/774995.json": "Visual Studio Code is a source code editor for building current web applications. It is a free and...",
  "data/redirect-devtop/2021/7/775917.json": "In a rush? Skip to the tutorial or live example   Like many web developers, I have been doing quite...",
  "data/redirect-devtop/2021/7/776479.json": "TypeScript is a typed superset of JavaScript by definition. As a result, all current JavaScript is...",
  "data/redirect-devtop/2021/7/776026.json": "Git is an amazingly vast tool for developers to manage development workflows, and it goes without...",
  "data/redirect-devtop/2021/7/776485.json": "Hi, everybody! 👋  Today, I bring you 50+ color palettes to use in your upcoming projects or to just...",
  "data/redirect-devtop/2021/7/777428.json": "So here you are, you want to make your popup in your website but you can't find a good tutorial on...",
  "data/redirect-devtop/2021/7/777053.json": "Testing is an essential part of building Software. When it comes to production-ready applications we...",
  "data/redirect-devtop/2021/7/777010.json": "JavaScript countdown timers are used on a variety of e-commerce and under-construction websites to...",
  "data/redirect-devtop/2021/7/777534.json": "Arrays in JavaScript   In JavaScript, arrays are used to store multiple values or you can...",
  "data/redirect-devtop/2021/7/777399.json": "Let's create a simple customized toggle switch using CSS. Initially when I was trying to create this,...",
  "data/redirect-devtop/2021/7/777559.json": "A lot of people asked me about how I get a job in Sweden as a software engineer.   So,...",
  "data/redirect-devtop/2021/7/776869.json": "In your day-to-day Unix or Linux usage you use different tools like cd, ls, grep, or find. These are...",
  "data/redirect-devtop/2021/7/777185.json": "Just on reading the title, you might think Didn't you release an article on the same topic last week?...",
  "data/redirect-devtop/2021/7/777588.json": "🔰call()   ✔The call() method calls a function with a given this value and arguments provided...",
  "data/redirect-devtop/2021/7/776234.json": "In this article, we will learn how to build small docker containers by understanding builder pattern...",
  "data/redirect-devtop/2021/7/777584.json": "How many of you like dynamic web pages ? Using HTML and CSS you can create and style static web page...",
  "data/redirect-devtop/2021/7/777819.json": "Intro 💨   PWAs are great for your apps because;   Short loading times and overall better...",
  "data/redirect-devtop/2021/7/777600.json": "What is Git   Git is software that keeps track of changes that you make to files and...",
  "data/redirect-devtop/2021/7/774042.json": "Alongside this article, I wrote a demo project made with Angular, TailwindCSS and Blurhash. You can...",
  "data/redirect-devtop/2021/7/777447.json": "Build faster your SaaS product with Next JS SaaS starter. A full-stack React Boilerplate for Node JS developer to quickly start you business.",
  "data/redirect-devtop/2021/7/777538.json": "In this post, we are going to go through a complete example of how to implement Web Push...",
  "data/redirect-devtop/2021/7/772952.json": "If you're a confused beginner like I was when just starting out with machine learning in...",
  "data/redirect-devtop/2021/7/777348.json": "When I started my career, I was always afraid of losing my code changes. Sometimes, I would copy the...",
  "data/redirect-devtop/2021/7/777712.json": "3 pieces of software that I use that I am sure a lot of people haven't heard of, but should start...",
  "data/redirect-devtop/2021/7/774384.json": "In this tutorial, we'll be talking about authorization and how to implement it with AWS Amplify's...",
  "data/redirect-devtop/2021/7/774784.json": "Clean Code StudioFollow             Clean Code Clean...",
  "data/redirect-devtop/2021/7/777801.json": "One of the first movies I ever saw in a cinema was in my tiny home town Nova Gradiška in Croatia. The...",
  "data/redirect-devtop/2021/7/775349.json": "Ah, the dreaded resolve conflicts message. You've finished crafting the perfect code, just a quick...",
  "data/redirect-devtop/2021/7/774951.json": "Alone, we can do so little; together, we can do so much.                        Helen Keller    Over...",
  "data/redirect-devtop/2021/7/770643.json": "I recently migrated a browser extension from React to web components. This post describes my...",
  "data/redirect-devtop/2021/7/776249.json": "What is ReactJS?   📌ReactJS is an open-source, component based front end library responsible...",
  "data/redirect-devtop/2021/7/774993.json": "Yearning organizers, genuine solopreneurs, and sprouting visual creators all need a convincing...",
  "data/redirect-devtop/2021/7/756306.json": "Serie of article in order to learn Golang language by concrete applications as example",
  "data/redirect-devtop/2021/7/752440.json": "Table Of Contents:    ❓ Why should you read this? 🏇 In a hurry? 🤝 How Promises Are Made:...",
  "data/redirect-devtop/2021/7/776888.json": "The most common fear amongst students who avoid going off-campus is that they self-reject themselves...",
  "data/redirect-devtop/2021/7/770250.json": "Hey there, I hope you are safe. So today we are going to talk about WebRTC. (Web Real Time...",
  "data/redirect-devtop/2021/7/770873.json": "Serie of article in order to learn Golang language by concrete applications as example",
  "data/redirect-devtop/2021/7/776520.json": "By https://github.com/trekhleb/javascript-algorithms           JavaScript Algorithms and Data...",
  "data/redirect-devtop/2021/7/752914.json": "How I Learned to Stop Worrying and Love the Cloud!            Introduction   In April of...",
  "data/redirect-devtop/2021/7/756396.json": "Serie of article in order to learn Golang language by concrete applications as example",
  "data/redirect-devtop/2021/7/747695.json": "Hello world, welcome to my first post! In this one, I will explain what the Web Share API is and what...",
  "data/redirect-devtop/2021/7/753903.json": "Si pudiera definir \"JavaScript\" con una sola palabra sería \"versatilidad\". Nosotros podemos crear...",
  "data/redirect-devtop/2021/7/761700.json": "Hello Everyone, In this Post We Will be Seeing How to Create Stopwatch Using HTML, CSS and...",
  "data/redirect-devtop/2021/7/775420.json": "A wiseman once said : \"If you can not explain it, you do not understand it\". A few years ago, when I...",
  "data/redirect-devtop/2021/7/762329.json": "What CRUD API means ?   The CRUD paradigm stands for the four primitive database operations...",
  "data/redirect-devtop/2021/7/775038.json": "A simple rule to stay sane when dealing with vertical spacing in CSS. ",
  "data/redirect-devtop/2021/7/770148.json": "When working with components that need to work “across borders”, supporting multiple languages and...",
  "data/redirect-devtop/2021/7/774461.json": "My previous post about my placements journey got ~17k views and the most asked follow-up question was..."
}