{
  "data/redirect-devtop/2022/6/1101593.json": "If you are a JavaScript developer this should terrify you.   Because when I work with developers, the...",
  "data/redirect-devtop/2022/6/1101897.json": "Join us in collecting stories of LGBTQIA+ pride — we'll donate $10 for every #devpride story received. ",
  "data/redirect-devtop/2022/6/1101784.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/6/1101878.json": "No coder is an island.  This week's DevDiscuss episode is a good one if you want to succeed in your...",
  "data/redirect-devtop/2022/6/1102982.json": "Cloud cost management is tricky for many companies, especially when using cloud-native technologies...",
  "data/redirect-devtop/2022/6/1102117.json": "The common theme across our recent Forem highlights is that DEV can serve as a really effective town...",
  "data/redirect-devtop/2022/6/1102490.json": "As developers we have had to set up our development environment from scratch at least once.   Whether...",
  "data/redirect-devtop/2022/6/1101401.json": "Components are a major part of any react project - from buttons to dropdowns to form components....",
  "data/redirect-devtop/2022/6/1102140.json": "The practically important problem in computational mathematics is computing the eigenvalues of a...",
  "data/redirect-devtop/2022/6/1102652.json": "In this post let's talk about the paradigm shift from lifecycle methods to state synchronization and...",
  "data/redirect-devtop/2022/6/1102988.json": "When it comes to using external libraries, sometimes you can't find exactly what you need, and there...",
  "data/redirect-devtop/2022/6/1103483.json": "I graduated from my SWE degree around 6 years ago (almost to the date). The uni I went to wasn’t one...",
  "data/redirect-devtop/2022/6/1103299.json": "This weekly roundup highlights what we believe to be the most thoughtful and/or interesting...",
  "data/redirect-devtop/2022/6/1102158.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/6/1103301.json": "A couple weeks ago we wrapped up the Mayfield + DEV Discussion Series, where over 500 people...",
  "data/redirect-devtop/2022/6/1101584.json": "An array is one of the most common concepts of Javascript, which gives us a lot of possibilities to...",
  "data/redirect-devtop/2022/6/1103607.json": "Let's set one thing straight before we even dive into the article.  Divs are not buttons!  Yes, they...",
  "data/redirect-devtop/2022/6/1103646.json": "I'm pretty frustrated about this lately, I want to develop something out of the box, but all I see on...",
  "data/redirect-devtop/2022/6/1103917.json": "Hello everyone i recenlty written a TODO System with Hexagonal Architecture written in Go, with test...",
  "data/redirect-devtop/2022/6/1104752.json": "Exceptions, Exceptions, Exceptions... We see them constantly during development and support of...",
  "data/redirect-devtop/2022/6/1104618.json": "Hello Coders 👋  For past few weeks, I've been working on a web extension 🌎 for Chromium Base...",
  "data/redirect-devtop/2022/6/1103676.json": "Hello Everyone,  So I have been wanting to ask which is better, being a generalist developer or a...",
  "data/redirect-devtop/2022/6/1102975.json": "As a developer, I am constantly on the lookout for solutions that can help me improve my daily...",
  "data/redirect-devtop/2022/6/1103855.json": "Ciao! 👋  Did you miss us the past week? We are back in full-force to share what we have been cooking...",
  "data/redirect-devtop/2022/6/1104742.json": "This article will explain how you can build a file previewer in React that works for images and...",
  "data/redirect-devtop/2022/6/1104600.json": "Hey guys, I'm Sam Zhang.  Recently I've updated my portfolio site. Originally I used LogTure as my...",
  "data/redirect-devtop/2022/6/1101455.json": "Hello DEV community,  Right now I'm currently looking for my first developer job.  Here are my skills...",
  "data/redirect-devtop/2022/6/1104942.json": "I know some projects like Pi-hole and Kodi, but what super cool on Raspberry Pi 4 to...",
  "data/redirect-devtop/2022/6/1103920.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/6/1104810.json": "This blog mainly talks about the anti-patterns of building microservice architecture systems.  A...",
  "data/redirect-devtop/2022/6/1103447.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/6/1104961.json": "Finally, I have clicked the blue 'Write your first post now' button on the dev.to/dashboard page....",
  "data/redirect-devtop/2022/6/1105534.json": "Give a quick description of what you're up to and what some recent challenges have been.  Anyone who...",
  "data/redirect-devtop/2022/6/1105517.json": "A website is systematically stealing loads of articles published on DEV, this is what you can and...",
  "data/redirect-devtop/2022/6/1105319.json": "Do you usually use semicolon when you program? And why?  In my case, I don't use semicolon. I know...",
  "data/redirect-devtop/2022/6/1105226.json": "This is super open ended, but what are you all currently struggling with? Doesn't have to be code...",
  "data/redirect-devtop/2022/6/1102700.json": "First of all, I discussed privately with everyone to find a solution. We agreed on something, BUT the...",
  "data/redirect-devtop/2022/6/1105514.json": "When you're writing code, it's important to be mindful of your coding practices. This means taking...",
  "data/redirect-devtop/2022/6/1106249.json": "Welcome to the second Meme Monday post! Today's cover image comes from my favorite submission from...",
  "data/redirect-devtop/2022/6/1105349.json": "50 Projects In 50 Days — HTML, CSS &amp; JavaScript            Why did it take this...",
  "data/redirect-devtop/2022/6/1104650.json": "A post by Kostaintyn Naddur",
  "data/redirect-devtop/2022/6/1105497.json": "Are you looking ideas for web development to increase your skills?  Here is 40 projects ideas for web...",
  "data/redirect-devtop/2022/6/1104103.json": "Table of Contents    Introduction Shallow Copy Deep Copy Summary References           ...",
  "data/redirect-devtop/2022/6/1106258.json": "Recently, I wrote a post Talk to people who are on the same site 🌎 | Chrome Extension. Where I talked...",
  "data/redirect-devtop/2022/6/1105228.json": "Often while debugging, beginners use the console.log() method to print out values. But there are a...",
  "data/redirect-devtop/2022/6/1105917.json": "We stand on the shoulders of giants. And FontAwesome, you were a big giant. But it's time to say goodbye.",
  "data/redirect-devtop/2022/6/1106067.json": "Why am I writing this down? Maybe you are one of those crazy people who are contemplating using vim...",
  "data/redirect-devtop/2022/6/1106273.json": "You need to understand Python well before you can write idiomatic, or pythonic code in it.  But what...",
  "data/redirect-devtop/2022/6/1106351.json": "Experimenting with ultrasonic data transmission in JavaScript, as a payment method.",
  "data/redirect-devtop/2022/6/1107355.json": "Hey guys, I made an admin template for React &amp; Chakra UI based on the latest UI trends! Use it...",
  "data/redirect-devtop/2022/6/1107387.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/6/1106795.json": "I don't know if you've ever encountered an if-else nesting like a pyramid placed horizontally:    if...",
  "data/redirect-devtop/2022/6/1106352.json": "The team at Remix are building a web framework that is built on the priniciples of React Router and...",
  "data/redirect-devtop/2022/6/1107114.json": "It's hard to calculate the time you will need to finish the task, but it is equally important. Let's...",
  "data/redirect-devtop/2022/6/1106286.json": "cover image credits: Laurent Hrybyk  In this weekly series, folks can chime in and drop links to...",
  "data/redirect-devtop/2022/6/1106278.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/6/1106143.json": "The meaning behind different LGBTQ+ flags and how to code them with CSS and a single HTML element.",
  "data/redirect-devtop/2022/6/1105459.json": "Hey folks! 👋 Today, in this post we will look at one of the important concepts of JavaScript and that...",
  "data/redirect-devtop/2022/6/1105931.json": "This is a short blog on setting up a project with NextJS, EsLint, prettier and husky.   Next.js is a...",
  "data/redirect-devtop/2022/6/1107838.json": "I read an interesting post in which the author stated the reasons why they were officially done with...",
  "data/redirect-devtop/2022/6/1107470.json": "Hi, I'm planning to build a full stack application. I have plan to scale the application and make it...",
  "data/redirect-devtop/2022/6/1107492.json": "So I want to try out a coding challenge website, and I don’t know which one to try. What coding...",
  "data/redirect-devtop/2022/6/1108220.json": "As a member of the DEV team, I love reading what our community is writing.  There's career advice,...",
  "data/redirect-devtop/2022/6/1108477.json": "Today I am highlighting a new Forem dedicated to the success of contributors, maintainers and OSS...",
  "data/redirect-devtop/2022/6/1108433.json": "Ever wonder what it takes to get your conference talk accepted? In this episode of DevDiscuss we talk...",
  "data/redirect-devtop/2022/6/1108180.json": "When we first showed the world Novu (an open-source notification infrastructure) we were amazed by...",
  "data/redirect-devtop/2022/6/1109220.json": "According to Atwood's Law, \"Any application that can be written in JavaScript, will eventually be...",
  "data/redirect-devtop/2022/6/1108430.json": "Why are CSS frameworks so used?   I mean, why*??? 🤣  I don't particularly love them, they...",
  "data/redirect-devtop/2022/6/1108422.json": "Between 2016 and 2018 I maintained an open-source project with +800k downloads/month. I learned six...",
  "data/redirect-devtop/2022/6/1108531.json": "I think it's easy to take for granted that the web and all of its wonderful applications are built by...",
  "data/redirect-devtop/2022/6/1108526.json": "Writing efficient code isn't always easy, but it can be done. Here are five ways to program more...",
  "data/redirect-devtop/2022/6/1109237.json": "I'm a person who really enjoys having a partner to work on stuff with. Maybe there is some obscure...",
  "data/redirect-devtop/2022/6/1109269.json": "In this blog i will try to explain redux library without react. Just Redux.   Why? Because if we...",
  "data/redirect-devtop/2022/6/1109245.json": "Often you may be building a demo website, or practice project and you need some data for it. As an...",
  "data/redirect-devtop/2022/6/1109009.json": "Hello Everyone,  Today let's implement our own version of the map() and reduce() array methods in...",
  "data/redirect-devtop/2022/6/1108493.json": "Table of Content      📌 Introduction  📌 Git Terminologies  📌 Setup of Git and Github on...",
  "data/redirect-devtop/2022/6/1110113.json": "An age old debate about package managers   Each have their pros &amp; their cons   I...",
  "data/redirect-devtop/2022/6/1108167.json": "First of all, let’s break down some key concepts that will become useful to continue reading this...",
  "data/redirect-devtop/2022/6/1110678.json": "Hello everyone, for a while (a few months) I came up with the idea of developing my own JavaScript...",
  "data/redirect-devtop/2022/6/1105959.json": "In this tutorial, you will learn in a few short steps how to create a scroll to top button with CSS...",
  "data/redirect-devtop/2022/6/1108692.json": "While we work to advance our careers and push limits, we must remember to be kind to others and...",
  "data/redirect-devtop/2022/6/1109288.json": "Being the fun-loving guy and absolute geek that I am, I've always looked for ways to use tech to...",
  "data/redirect-devtop/2022/6/1110986.json": "If you’re not a fan of writing manual css then Tailwindcss can save you a lot of time.  And it’s...",
  "data/redirect-devtop/2022/6/1110333.json": "In this week’s post join me as I give jest-preview, a tool for debugging your Jest tests in the...",
  "data/redirect-devtop/2022/6/1110852.json": "I often get asked about how to find Open Source projects to contribute to. In this post, I’ll show...",
  "data/redirect-devtop/2022/6/1110959.json": "React Js is one of the most popular front-end frameworks to use these days.  It is playing an...",
  "data/redirect-devtop/2022/6/1108722.json": "I am currently a few weeks post-coding bootcamp and am beginning to navigate the world of technical...",
  "data/redirect-devtop/2022/6/1110351.json": "Whether you are starting from scratch or switching from another platform, we have you covered when deploying SolidJS to Netlify.",
  "data/redirect-devtop/2022/6/1111735.json": "👋, I am here with another list. In this post I have enlisted 15 aesthetic color gradients using CSS...",
  "data/redirect-devtop/2022/6/1109853.json": "From time to time you'll want to share your locally running app with some folks before it's ready to...",
  "data/redirect-devtop/2022/6/1111301.json": "I've relied mostly on Vanilla CSS and SASS/SCSS so far and have my own components/styles which I can...",
  "data/redirect-devtop/2022/6/1110402.json": "Table of contents    Fundamentals Variables Data...",
  "data/redirect-devtop/2022/6/1111844.json": "10 JavaScript features you should adopt today",
  "data/redirect-devtop/2022/6/1111981.json": "🎇Netlify.com 🎇Firebase 🎇Vercel.com 🎇GitHubPages 🎇Surge.sh 🎇Render.com 🎇Amazone Web hosting 🎇Google...",
  "data/redirect-devtop/2022/6/1110373.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/6/1109273.json": "Fala moçada, beleza? No artigo de hoje vamos falar um pouco sobre produtividade. Esse tema é muito...",
  "data/redirect-devtop/2022/6/1112245.json": "Give a quick description of what you're up to and what some recent learnings have been.",
  "data/redirect-devtop/2022/6/1110966.json": "Developers keep on doing it great and breaking through different levels everyday, with their logic ,...",
  "data/redirect-devtop/2022/6/1111623.json": "ReactJS is a javascript library used to build user interfaces.  Understanding the life cycle of a...",
  "data/redirect-devtop/2022/6/1112871.json": "Welcome to the second Meme Monday post! Today's cover image comes from my favorite submission from...",
  "data/redirect-devtop/2022/6/1103923.json": "Difference between var, let and const   In JavaScript, variables are assigned using three...",
  "data/redirect-devtop/2022/6/1112003.json": "It's 👉this close👈 to becoming a reality, and you can get a sneak peek today.",
  "data/redirect-devtop/2022/6/1111744.json": "Firstly I would like to thanks @isabelcmdcosta for the post idea.  As a beginner we all want to...",
  "data/redirect-devtop/2022/6/1112290.json": "Brief Origin of where the hype began   On the 29th of May, 2013, the pain of building...",
  "data/redirect-devtop/2022/6/1111345.json": "PNPM is said to be most efficient package manager. I'm also thinking to switch from slower npm to...",
  "data/redirect-devtop/2022/6/1112815.json": "Do you remember all that long nights when you were working on your outstanding projects? Maybe it's...",
  "data/redirect-devtop/2022/6/1112013.json": "Overall, being a software engineer is great. I'm grateful for being a software engineer, and I...",
  "data/redirect-devtop/2022/6/1112773.json": "Introduction   This is a self-contained example of a real-time chart powered by Deno, Web...",
  "data/redirect-devtop/2022/6/1112906.json": "cover image source: colorlessmidnight  In this weekly series, folks can chime in and drop links to...",
  "data/redirect-devtop/2022/6/1113285.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/6/1112648.json": "I know people make all kinds of stuff with &lt;canvas&gt; but that's all black magic to me. Time to...",
  "data/redirect-devtop/2022/6/1113110.json": "Spoiler: a query ficou 23x mais rápida com CTE's apenas transformando o problema quadrático em...",
  "data/redirect-devtop/2022/6/1114122.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/6/1112889.json": "Table of Content      📌 Introduction  📌 Why this configuration 🤔?  📌 Configuration 🛠   👉...",
  "data/redirect-devtop/2022/6/1112796.json": "Switching to VS Codium does not require much effort. You just need to install it and copy your...",
  "data/redirect-devtop/2022/6/1112787.json": "In the emerging Cloud-Native environment, Kubernetes is everywhere without any question. It has...",
  "data/redirect-devtop/2022/6/1113955.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/6/1113717.json": "Meet Wasp: a new programming language for developing full-stack web apps with less code.  Wasp is a...",
  "data/redirect-devtop/2022/6/1114413.json": "A few months ago, I wrote a DEV post about resolving merge commits. The resounding feedback I...",
  "data/redirect-devtop/2022/6/1114982.json": "Preamble: We've been running an experimental project to catalog good evergreen guides on DEV. Some...",
  "data/redirect-devtop/2022/6/1114754.json": "Docker gives developers the ability to package all of their applications inside of containers. These...",
  "data/redirect-devtop/2022/6/1113672.json": "follow me  (https://github.com/dan3266)",
  "data/redirect-devtop/2022/6/1114691.json": "I have created a collection of 24 x 24 dp SVG spinners! Use them for free!  I'll be adding new...",
  "data/redirect-devtop/2022/6/1115220.json": "A special comic for Internet Explorer’s end-of-life",
  "data/redirect-devtop/2022/6/1112887.json": "There are many ways to iterate in JavaScript. Let's look at the most common ones.",
  "data/redirect-devtop/2022/6/1113080.json": "Hey folks!  I'd like to talk about the position property! We'll consider all nuances that confuse...",
  "data/redirect-devtop/2022/6/1115326.json": "I've been to every CodeLand — well before I was officially involved in it. It's been one of the best...",
  "data/redirect-devtop/2022/6/1113678.json": "Git vs GitHub is one of the things that beginners find tough to understand. So in order to understand..."
}