{
  "data/redirect-devtop/2021/5/684565.json": "Hey developers,   Today I will show you how you can customize your windows terminal with y...",
  "data/redirect-devtop/2021/5/684746.json": "Understanding the fundamentals is priceless. So let's discuss the fundamental that how Javascript wor...",
  "data/redirect-devtop/2021/5/684552.json": "The original post is in Notion. Do checkout. Here  React is a library (from Facebook) for building co...",
  "data/redirect-devtop/2021/5/684635.json": "Intro   I've spent a fair amount of time coding with javascript and Node.js, Mostly working...",
  "data/redirect-devtop/2021/5/684441.json": "Mistakes I made as a software engineer (developer)...A Thread... pic.twitter.com/xUiF38vhlU— Ankur💻🎧...",
  "data/redirect-devtop/2021/5/684631.json": "Today I created an Amazing Image Button Hover Effect Using HTML &amp; CSS. when you hover on the butt...",
  "data/redirect-devtop/2021/5/684930.json": "A short and simple post today, I want to know whether people agree or disagree with me on the sentime...",
  "data/redirect-devtop/2021/5/684996.json": "To understand the differnece between cookies,sessions and tokens we need to get back on the basis, le...",
  "data/redirect-devtop/2021/5/684641.json": "In this article, you will learn how to implement a singleton pattern in Javascript.           What is...",
  "data/redirect-devtop/2021/5/685248.json": "I have noticed that a lot of developers are pretty good at the coding part of a project but struggle...",
  "data/redirect-devtop/2021/5/685388.json": "7 uncomfortable truths about being a developer.A Thread... pic.twitter.com/VD2s9tlnKm— Ankur💻🎧💪 (@Th...",
  "data/redirect-devtop/2021/5/685251.json": "Automate the hell out of your code   When you hear of automation what comes to your mind? So...",
  "data/redirect-devtop/2021/5/684817.json": "I think that everyone should have a personal site, even if you're not in the development scene - and...",
  "data/redirect-devtop/2021/5/685038.json": "Hello Fellow Codenewbies 👋,  What is a portfolio?  Do we need to have a portfolio as a developer?  We...",
  "data/redirect-devtop/2021/5/685247.json": "I've been an Ubuntu user for a long time, it is a system where I feel very comfortable so that means it also makes me more productive. I decided to try the newest release, the brand new 21.04 a.k.a Hirsute Hippo. In this post, I share all my setup process.",
  "data/redirect-devtop/2021/5/685099.json": "Overview :   React framework in great for creating awesome web apps and UIs. But sometimes w...",
  "data/redirect-devtop/2021/5/685249.json": "Welcome to my Weekly Digest #17 which is the first one for May.  This weekly digest contains a lot of...",
  "data/redirect-devtop/2021/5/685524.json": "Web components are a native set of features that provides outstanding scoping of styles and functiona...",
  "data/redirect-devtop/2021/5/685517.json": "A Contactless Attendance System where your face is identified for Attendance. ✨           Motivation...",
  "data/redirect-devtop/2021/5/686028.json": "The React useEffect Hook helps you manage side-effects in functional React components. It also makes...",
  "data/redirect-devtop/2021/5/686561.json": "Let's go through the five best ways that you can fetch data with React from a GraphQL API.  While the...",
  "data/redirect-devtop/2021/5/686152.json": "All interviews are daunting. I know how do you feel searching for every possible interview tips and e...",
  "data/redirect-devtop/2021/5/686825.json": "You applied for a job as a web developer few days back. An interview was scheduled and you're worried...",
  "data/redirect-devtop/2021/5/686598.json": "ES6 also known as ECMAScript 6 is the latest JavaScript standard meant to ensure the interoperability...",
  "data/redirect-devtop/2021/5/685324.json": "VS Code is one of the best and lightweight code editors. The dark theme and variety of extensions tha...",
  "data/redirect-devtop/2021/5/686683.json": "The truth is, to have cool animations in your web app like loading animation, you don't need to be...",
  "data/redirect-devtop/2021/5/686678.json": "Team Forem is excited to share the news of our first community Bug Smash!   Join us for this...",
  "data/redirect-devtop/2021/5/686824.json": "In this article, we've compiled 50 online courses on topics ranging from artificial intelligence to prepping for interviews to help you learn a new skill or improve existing ones. ",
  "data/redirect-devtop/2021/5/687434.json": "This blog post is an easy introduction to NextJS and it's features. However, before starting to read...",
  "data/redirect-devtop/2021/5/686151.json": "CDK Day happened again on 30th April 2021. We had 22 speakers from across the globe give 18 talks cov...",
  "data/redirect-devtop/2021/5/686391.json": "In this article, I want to share some details to take care of, which will make us better React develo...",
  "data/redirect-devtop/2021/5/687002.json": "Introduction   Asynchronous JavaScript can be a daunting concept to learn. However, it is a...",
  "data/redirect-devtop/2021/5/685545.json": "CSS container queries have landed as an experiment in Chrome Canary! You can enable them under chrome...",
  "data/redirect-devtop/2021/5/686650.json": "A few months ago, near the beginning of my coding journey, I tweeted about a Codepen I was particular...",
  "data/redirect-devtop/2021/5/686668.json": "You don't have to write your custom scraper and parser for the usual content. Parsehub can help you efficiently extract the data you need.",
  "data/redirect-devtop/2021/5/686984.json": "Hello Folks,   I mostly prefer talking about technical things in my articles but today’s article is a...",
  "data/redirect-devtop/2021/5/686651.json": "Machine learning and AI as a whole can seem hugely daunting when you're first getting started. Over a...",
  "data/redirect-devtop/2021/5/686130.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/5/686841.json": "We cannot talk about web development without talking about Reponsive Design. The latter is now a must...",
  "data/redirect-devtop/2021/5/686220.json": "We all know about HTML, it help us to structure the contents, there are many tags which help us to de...",
  "data/redirect-devtop/2021/5/687878.json": "Undraw Draw Kit Indian Doodle Poke open Doodles Lukaszadam IRA Design Mixkit Scale Pulse Gee Me Absu...",
  "data/redirect-devtop/2021/5/688003.json": "How I use Trello to Manage my Life   Like many things, productivity systems are deeply perso...",
  "data/redirect-devtop/2021/5/687858.json": "TL;DR   It's common to display multiple links with the same text on a web page — such as 're...",
  "data/redirect-devtop/2021/5/688138.json": "TL:DR :   Puppeteer is one of the greatest tools available on the web in order to perform th...",
  "data/redirect-devtop/2021/5/687169.json": "Use unpkg + svg-loader to include any icon with one line of code",
  "data/redirect-devtop/2021/5/688069.json": "Image optimization is never fun to deal with. Let's learn how the picture element + 11ty can save any static site from bloated load times.",
  "data/redirect-devtop/2021/5/688785.json": "Heyo devs!  For those of you who aren't familiar with me, I'm Casey - a Community Associate at Forem....",
  "data/redirect-devtop/2021/5/687590.json": "At Wasp, we have a Discord server for our community, where we talk with people interested in and usin...",
  "data/redirect-devtop/2021/5/688973.json": "Hello everyone 👋  In this article, we will see how can we use Vibration API in our websites.  We can...",
  "data/redirect-devtop/2021/5/689025.json": "Hey All 👋, In this article I will show you a trick that will help all the developers out there.  Many...",
  "data/redirect-devtop/2021/5/688255.json": "In my time as a developer, I have given hundreds of code reviews. It's something I learned to enjoy v...",
  "data/redirect-devtop/2021/5/688813.json": "Learning to code is hard especially when you are just starting out but it becomes a lot more fun when...",
  "data/redirect-devtop/2021/5/687881.json": "Do you remember something like this?    var text;  for (i = 0; i &lt; 5; i++) {   text += \"The number...",
  "data/redirect-devtop/2021/5/689215.json": "I have been in this industry for nearly two years now.   Spent those two years learning, observing, t...",
  "data/redirect-devtop/2021/5/688814.json": "TypeScript is just a superset of JavaScript, meaning it's just JavaScript - but with enhanced functio...",
  "data/redirect-devtop/2021/5/685403.json": "This guide will help you in building a company themed resume builder using reactjs. You will fill in...",
  "data/redirect-devtop/2021/5/687460.json": "The ternary operator   It's a delight to use them but should we use them as much as possible...",
  "data/redirect-devtop/2021/5/689558.json": "Developers have been using three major building blocks for the development of web apps, namely, API...",
  "data/redirect-devtop/2021/5/690180.json": "Web development is not an easy task for beginners, to create a web project that standout takes lot of...",
  "data/redirect-devtop/2021/5/689015.json": "A brief introduction about API's:   API is known as the Application Programming Interface an...",
  "data/redirect-devtop/2021/5/688451.json": "Every once in a while, you end up in a situation where you need some variation of a type. For instanc...",
  "data/redirect-devtop/2021/5/689959.json": "Open source software is a huge part of the tech industry. Over and over, we hear about the power of o...",
  "data/redirect-devtop/2021/5/688212.json": "In this article, we'll see some of the common mistakes made by React developers and ways to avoid the...",
  "data/redirect-devtop/2021/5/685387.json": "Here I am coming up with the collection of best react material-UI admin template of 2021. All are bui...",
  "data/redirect-devtop/2021/5/686562.json": "Here is the 19 simple, beginner level hover animation using CSS. The logic behind the examples are br...",
  "data/redirect-devtop/2021/5/687462.json": "Hello World! Seems like we're in a streak to be the best articles of the week here at DEV, will this...",
  "data/redirect-devtop/2021/5/684948.json": "This is part 7 of the multi-part series \"The Evolution of a Script\". The code of this post can be fou...",
  "data/redirect-devtop/2021/5/690000.json": "Put joy and productivity inside your Terminal with those cool command line tools.  But before we star...",
  "data/redirect-devtop/2021/5/688989.json": "Are you happy?  I've been asked this question many times by co-workers and my leaders over the years....",
  "data/redirect-devtop/2021/5/690227.json": "Hello everyone 👋  In this article, we will see how can we get access to the user's location on our we...",
  "data/redirect-devtop/2021/5/689314.json": "After an awesome response to my previous article Hooks in React, as promised I am back with the secon...",
  "data/redirect-devtop/2021/5/689009.json": "After two years working with Angular I was assigned to a project where the frontend stack was React,...",
  "data/redirect-devtop/2021/5/690743.json": "Hey folks 👋🏼  We just launched another Product on the Product hunt. It's a notion template that helps...",
  "data/redirect-devtop/2021/5/689891.json": "In this blog, I will discuss some core JavaScript concepts. If you are new to the JavaScript world, t...",
  "data/redirect-devtop/2021/5/689987.json": "React has quickly become the most popular front-end framework in the tech world, used by big tech com...",
  "data/redirect-devtop/2021/5/689594.json": "As analysts, we’re often asked to quickly produce dashboards or metrics that aim to solve a specific...",
  "data/redirect-devtop/2021/5/690634.json": "Time flies, I have now completed 40 small projects whilst renovating a property and moving houses. Sa...",
  "data/redirect-devtop/2021/5/691176.json": "I prepared list of react and redux interview question, Few question I faced in my journey and few of...",
  "data/redirect-devtop/2021/5/689423.json": "Welcome to the complete Tailwind CSS guide you need to build high-quality frontend webpages. In this...",
  "data/redirect-devtop/2021/5/690341.json": "If you are new here then you might not have seen that I like to abuse the internet...and for those of...",
  "data/redirect-devtop/2021/5/690884.json": "Check out the site here! https://georgefrancis.dev/ 👀     Hey! How's it going? I've been a little qui...",
  "data/redirect-devtop/2021/5/690226.json": "Do you want to skip the article and want to know what’s my top preference for beginners to start with...",
  "data/redirect-devtop/2021/5/684740.json": "This tutorial will walk you through how to create a web app that visualizes the location of any satel...",
  "data/redirect-devtop/2021/5/690228.json": "Let's understand how can we create a Pomodoro timer by using JavaScript  To get complete code visit:...",
  "data/redirect-devtop/2021/5/690768.json": "Hey All 👋 .   Recently I got to know about a VS Code extension called Thunder Client⚡⚡ which can be u...",
  "data/redirect-devtop/2021/5/690541.json": "Do you find it troublesome to always look for a YouTube video downloader with your privacy at risk? D...",
  "data/redirect-devtop/2021/5/687383.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/5/690002.json": "The Idea &amp; Inspiration   Truth be told, I've lost count of the number of amazing portfol...",
  "data/redirect-devtop/2021/5/689354.json": "This tutorial is a part of our initiative at Flexiple, to write short curated tutorials around often...",
  "data/redirect-devtop/2021/5/690400.json": "At this article I will show you the advantages of doing a website with Strapi in the backend and Next...",
  "data/redirect-devtop/2021/5/691230.json": "Watch on YouTube  link to codepen if you want to follow along  The 'this' keyword in JavaScript can b...",
  "data/redirect-devtop/2021/5/685756.json": "Photo by Clem Onojeghuo on Unsplash   Hello dear devs (and newbies 🐣)! 👋🏻 Good to see you here!  Tod...",
  "data/redirect-devtop/2021/5/691991.json": "Hello, today I created a Simple custom checkbox using CSS &amp; JS. Not great work but I hope you lik...",
  "data/redirect-devtop/2021/5/691990.json": "Open-source React Dashboard template crafted by CodedThemes using Material UI design - product can be downloaded from Github.",
  "data/redirect-devtop/2021/5/691565.json": "Hello everyone, I'm sharing this Spotify Clone that I made with React, Redux, and Typescript. If you...",
  "data/redirect-devtop/2021/5/691156.json": "My second impression of Rust after building a real-life use case with it and my thoughts on why it is the best general-purpose language for the future.",
  "data/redirect-devtop/2021/5/690932.json": "Today I created a Glassmorphism Login form with HTML &amp; CSS. this login form is very simple but lo...",
  "data/redirect-devtop/2021/5/691578.json": "Learn how to use Docker to create images for development and production.  Imagine that you have devel...",
  "data/redirect-devtop/2021/5/691105.json": "Disclaimer this is 100% satire. For fun on a Friday (Web Dev Satire #1)           1) The license is t...",
  "data/redirect-devtop/2021/5/692003.json": "This article is especially for beginners who are looking for Job as a Javascript Developer. I have s...",
  "data/redirect-devtop/2021/5/692189.json": "Hello everyone👋  In this article, we will see how can we use Web Worker API on our website to avoid b...",
  "data/redirect-devtop/2021/5/691048.json": "Here you can learn how to create a responsive personal portfolio website using HTML, CSS, javascript,...",
  "data/redirect-devtop/2021/5/691384.json": "How many times did you write display: flex? This goes so common that some people tried applying displ...",
  "data/redirect-devtop/2021/5/692814.json": "I heard the british use biscuits instead of cookies...weird.  Okay, let's focus.  What are Cookies  C...",
  "data/redirect-devtop/2021/5/692197.json": "hey you all👋  A couple week ago I've found Lightweight ⚡ and simple 😋 tools for testing my API. That'...",
  "data/redirect-devtop/2021/5/692171.json": "Hi Everyone,  This is my first blog. And in this blog, I'm gonna talk about Spread Operator, Rest Ope...",
  "data/redirect-devtop/2021/5/692310.json": "I'm gonna go over some really helpful one-liners (20 + Bonus) that can help you boost your productivity and can help in debugging code.",
  "data/redirect-devtop/2021/5/689564.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/5/692612.json": "I've been coding for a long time, over 10 years  During all that website development of JavaScript, H...",
  "data/redirect-devtop/2021/5/692190.json": "Kubernetes(k8s) has become the de facto standard for not only container orchestration but also for cl...",
  "data/redirect-devtop/2021/5/692443.json": "A practical guide to developing component based sites and apps around the Atomic Design meth...",
  "data/redirect-devtop/2021/5/692080.json": "Disclaimer: This article is my version of Tailwind CSS: Adds complexity, does nothing. I respect the...",
  "data/redirect-devtop/2021/5/692936.json": "Why do freelancers have such a hard time explaining how they set their rates?            Bec...",
  "data/redirect-devtop/2021/5/691447.json": "What Are Custom Hooks 👐   Considering that much of the react fanbase has switched over to us...",
  "data/redirect-devtop/2021/5/692582.json": "VSCode   I use these extensions:           Utilities    Auto Close Tag: Automatically add HT...",
  "data/redirect-devtop/2021/5/691701.json": "Hii.. thanks for stopping by. What you will find in this post:   What is docker? What does it solve?...",
  "data/redirect-devtop/2021/5/690623.json": "Many devs strictly believe that resting and family time is equally important as work, leaving weekend...",
  "data/redirect-devtop/2021/5/692810.json": "Hello, guys In this tutorial we will try to solve the mentioned query. and also we will learn how to...",
  "data/redirect-devtop/2021/5/692509.json": "A Promise represents the state of an asynchronous operation. This asynchronous operation can be anyth...",
  "data/redirect-devtop/2021/5/693586.json": "A curated list with open-source products crafted and released for free by Creative-Tim: React Dashboards, Vue Templates, and NextJS UI Kits.",
  "data/redirect-devtop/2021/5/692491.json": "Note: The term \"Types\" in this article is referring to the\"type\" aliases in Typescript  According to...",
  "data/redirect-devtop/2021/5/693254.json": "Helmet helps you secure your Express apps by setting various HTTP headers. It's not a silver bullet,...",
  "data/redirect-devtop/2021/5/693534.json": "It seems that it is the perfect time to continue my recent blog post series - Top 10 Best Web Dev Too...",
  "data/redirect-devtop/2021/5/693078.json": "Photo by Matt Botsford on Unsplash  Disclaimer 🚨: No, despite the possibly misleading title of my po...",
  "data/redirect-devtop/2021/5/692585.json": "Are you a beginner developer and want to level up your dev game and progress faster than your competi...",
  "data/redirect-devtop/2021/5/692942.json": "Have you built a business website or portfolio for a client? Or are you currently making one? Do you...",
  "data/redirect-devtop/2021/5/692904.json": "Everyone sometimes struggles with consistency. Do you want to develop a good habit but often fail after a few days? Well, **you are not alone**.",
  "data/redirect-devtop/2021/5/693577.json": "Nobody cares about who you are in the open market, as a software engineer (Developer)You don't want...",
  "data/redirect-devtop/2021/5/691908.json": "GitHub: https://github.com/yifaneye/react-gallery-carousel Demo: https://yifaneye.github.io/react-g...",
  "data/redirect-devtop/2021/5/694311.json": "Do you know how javascript code runs in the javascript engine?   If not, then I hope this post will b...",
  "data/redirect-devtop/2021/5/692571.json": "Figma is a design application which can be used for creating wireframes, designs and prototypes. It i...",
  "data/redirect-devtop/2021/5/693327.json": "React useRef hook can be helpful when you need to create mutable variables in your components without...",
  "data/redirect-devtop/2021/5/692124.json": "Introduction   As the internet users increasing exponentially, It is very important for en...",
  "data/redirect-devtop/2021/5/693061.json": "Learning to code is not a straight path, these tips helped me get better at it. Hopefully by the end...",
  "data/redirect-devtop/2021/5/694677.json": "Are you using a markdown tool to take note?",
  "data/redirect-devtop/2021/5/689972.json": "Choosing between numerous options for styling your app could be a project in and of itself. 🤯  I've t...",
  "data/redirect-devtop/2021/5/693790.json": "Hello everyone 👋, this is going to be a very short article where I will show how can we generate a QR...",
  "data/redirect-devtop/2021/5/692974.json": "You probably think the sole job of a web developer is to create websites and web applications. If so,...",
  "data/redirect-devtop/2021/5/693249.json": "While working on my final project at the Flatiron School, everything seemed to be in place to allow f...",
  "data/redirect-devtop/2021/5/694753.json": "It’s tough selling your web development services when you’re new to the freelance market. Programming...",
  "data/redirect-devtop/2021/5/691080.json": "Disclaimer: professional in this case means making a living as a web developer.   This is a question...",
  "data/redirect-devtop/2021/5/694665.json": "A short-list with tools for beginners and a simple setup to build an open-source project.",
  "data/redirect-devtop/2021/5/692652.json": "Objects are the foundation of JavaScript. Everything except primitive data-types(null,undefined,numbe...",
  "data/redirect-devtop/2021/5/693475.json": "There is a famous computer science quote:   \"There are only two hard things in Computer Science: cach...",
  "data/redirect-devtop/2021/5/694654.json": "We just released  React Bootstrap 5  on Product Hunt.  Only a few days after the stable release of Bo...",
  "data/redirect-devtop/2021/5/692836.json": "You Will Be Surprised By Number 9!  In this article, I gathered some JavaScript tips and tricks that...",
  "data/redirect-devtop/2021/5/693882.json": "Introduction   Have you ever procrastinated? If you say \"No\", you are totally a liar!   But...",
  "data/redirect-devtop/2021/5/689311.json": "Github is more than a version control service, it's place where developer contributes to the Communit...",
  "data/redirect-devtop/2021/5/694661.json": "We’re trying something new in the Contentful DevRel team. Myself and Shy Ruparel are joining forces f...",
  "data/redirect-devtop/2021/5/695034.json": "I have already created 2 portfolio websites.  Here is my 3rd portfolio website. This is a very simple...",
  "data/redirect-devtop/2021/5/694776.json": "Photo by Yancy Min on Unsplash  Howdy DEV clan?   We've all heard of the recommendation and best prac...",
  "data/redirect-devtop/2021/5/693804.json": "📢 TL:DR :   We all seek for utility packages on npm. No Matter we admire it or not, everyone...",
  "data/redirect-devtop/2021/5/694530.json": "You probably already heard of Kubernetes, a powerful orchestrator that will ease deployment and autom...",
  "data/redirect-devtop/2021/5/695503.json": "Data Structures is one of the most frequently tested subjects by a lot of companies. It is the base o...",
  "data/redirect-devtop/2021/5/693949.json": "Aping into Crypto from a traditional developer background",
  "data/redirect-devtop/2021/5/694570.json": "Design Pattern is a widely acknowledged concept in the software engineering industry in terms of the...",
  "data/redirect-devtop/2021/5/695079.json": "As React developers, we often depend on the state of the UI to make specific decisions about the func...",
  "data/redirect-devtop/2021/5/693950.json": "The Redux library is highly unopinionated. It lets us decide everything from store set-up and its con...",
  "data/redirect-devtop/2021/5/695119.json": "Have you ever worked on an application with one huge CSS file and found that when you changed a style...",
  "data/redirect-devtop/2021/5/695113.json": "An introduction to the MutationObserver Web API which provides the ability to watch for changes being made to the document.",
  "data/redirect-devtop/2021/5/695299.json": "Listen to S5E1 of DevDiscuss!",
  "data/redirect-devtop/2021/5/696507.json": "React.js is currently one of the most popular JavaScript libraries for front-end developers.   React...",
  "data/redirect-devtop/2021/5/694778.json": "I tried material-ui for the first time back in 2020 for one of my project. From then I have really be...",
  "data/redirect-devtop/2021/5/691219.json": "ReactJS is wildly popular and thus wildly supported. TypeScript is increasingly popular, and thus inc...",
  "data/redirect-devtop/2021/5/694458.json": "Hello There,   TailwindCSS is a utility-first library which encourages to build everything using it's...",
  "data/redirect-devtop/2021/5/696509.json": "Before going into any kind of explanation, we need to understand the difference between server side s...",
  "data/redirect-devtop/2021/5/696330.json": "I've been playing around with Tailwind CSS a lot since it's release, and so far it's been really impr...",
  "data/redirect-devtop/2021/5/696927.json": "A curated list with Bootstrap 5 Templates crafted for free by well-known agencies and released as open-source products.",
  "data/redirect-devtop/2021/5/696200.json": "Hello everyone 👋  In this article, we are going to learn how can we detect the internet connection st...",
  "data/redirect-devtop/2021/5/696194.json": "We all know the importance of developing with customer, reliability, or security mindsets. In reality...",
  "data/redirect-devtop/2021/5/695899.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/5/692206.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/5/695093.json": "Hello, today we will learn how to add a loader to our website ! Loaders have been used for a long tim...",
  "data/redirect-devtop/2021/5/695161.json": "As you might have already guessed, this article is not about technical interviews, coding challenges,...",
  "data/redirect-devtop/2021/5/692943.json": "This post is for you if you can answer \"yes\" to all/most of the questions below:    You are...",
  "data/redirect-devtop/2021/5/697424.json": "It’s no secret that the tech industry is always changing. New frameworks are always emerging and new...",
  "data/redirect-devtop/2021/5/696891.json": "Diagrams as code is becoming a popular way to diagram software architecture, particularly for long-li...",
  "data/redirect-devtop/2021/5/695469.json": "As device sizes proceed to wander and programs give more client alternatives, utilizing static units...",
  "data/redirect-devtop/2021/5/697539.json": "The Ultimate Web Developer Resources List 🔥Awesome 200+ Resourc...",
  "data/redirect-devtop/2021/5/696225.json": "Simple open-source Flask Starter built on top of Soft UI Dashboard, a modern Bootstrap 5 UI Kit.",
  "data/redirect-devtop/2021/5/695988.json": "In this post, I will walk you through how to use Lerna to manage, and publish, two packages under the...",
  "data/redirect-devtop/2021/5/697022.json": "Hi there,  Recently, I saw an website with cool scrolling effects and so I have decided to create web...",
  "data/redirect-devtop/2021/5/696466.json": "Hello fellow engineers, project managers, and technocrats! Today, after exactly two years of work, we...",
  "data/redirect-devtop/2021/5/696211.json": "Hello friends, today I am going to show you how to create a pop-up login form using only HTML and CSS...",
  "data/redirect-devtop/2021/5/687250.json": "Hi everyone, every website have a theme options. so, a website user able to choose their preferred th...",
  "data/redirect-devtop/2021/5/697184.json": "AppMap is an open source IntelliJ IDEA plugin which helps you improve your code by showing you how it...",
  "data/redirect-devtop/2021/5/696262.json": "When react hooks were launched, they completely changed the react ecosystem. I have been using react...",
  "data/redirect-devtop/2021/5/695876.json": "One of the most important talking points for programmers is which path they want to go down. Do you w...",
  "data/redirect-devtop/2021/5/696955.json": "The team section is a type of web element that you can use to introduce your team members to differen...",
  "data/redirect-devtop/2021/5/693941.json": "I’ve been working on React apps for more than 3 years now and I’ve used tons of libraries to build va...",
  "data/redirect-devtop/2021/5/698068.json": "This article is the beginner's introductory guide to programming principles.  First we're going to ex...",
  "data/redirect-devtop/2021/5/697997.json": "Hello DEV community! 👋  I've recently attempted to make a clone of Twitter using VueJS as its fronten...",
  "data/redirect-devtop/2021/5/697148.json": "In my last post, A Beginner's Guide to Unit-testing with Jest, I walked through getting started with...",
  "data/redirect-devtop/2021/5/697434.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/5/698276.json": "At some point in your Javascript developer journey, you've certainly encountered these types of impor...",
  "data/redirect-devtop/2021/5/697504.json": "In this article we introduce a scheme flooding vulnerability, explain how the exploit works across fo...",
  "data/redirect-devtop/2021/5/697604.json": "As a web developer, your browser’s DevTools are surely the most important working tool, right beside...",
  "data/redirect-devtop/2021/5/698474.json": "There are multiple ways to filter out duplicates from an array and return only the unique values....",
  "data/redirect-devtop/2021/5/696724.json": "My name is Will and I do NOT consider myself a coder, but a future hopeful. However, even at the age...",
  "data/redirect-devtop/2021/5/698036.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/5/698718.json": "At the time of writing this, React is at version 17.02. It is fascinating to see the exponential grow...",
  "data/redirect-devtop/2021/5/697157.json": "Building my Website-as-a-Service (WaaS) project   The first time I found out about Terraform...",
  "data/redirect-devtop/2021/5/697169.json": "I purchased my new M1 MacBook Pro at the end of last year which was December 2020, and it arrived in...",
  "data/redirect-devtop/2021/5/698985.json": "Welcome to the React for Beginners guide. It's designed to teach you all the core React concepts that...",
  "data/redirect-devtop/2021/5/696732.json": "Hey there,  Version 12.0.0 is here and it has some great updates for Angular developers everywhere. 🎉...",
  "data/redirect-devtop/2021/5/697275.json": "Hello everyone👋  In this article, we will see how applications like zoom use Screen Capture API provi...",
  "data/redirect-devtop/2021/5/696198.json": "Today I am writing again to present a good practice that I discovered a short time ago and that I hav...",
  "data/redirect-devtop/2021/5/697645.json": "Learning a new programming language is difficult and not everyone learns the same way. For many, hand...",
  "data/redirect-devtop/2021/5/698196.json": "I wanted to build something fun for my portfolio. After spending sometime thinking, I decided to code...",
  "data/redirect-devtop/2021/5/686116.json": "I've been learning to build a web app using React.js. And this project turns out to be quite awesome...",
  "data/redirect-devtop/2021/5/698966.json": "Google Fonts    Making The Web More Beautiful, Fast, And Open  Through Great Typography.  li...",
  "data/redirect-devtop/2021/5/698798.json": "Hello readers,  In this article, you will learn how to design a simple animated Digital Clock in Java...",
  "data/redirect-devtop/2021/5/698219.json": "This article was first published at my Blog here           Using Design Patterns in Node.js Programmi...",
  "data/redirect-devtop/2021/5/698082.json": "Obsidian is a Markdown Editor and Reader that can turn a folder of Markdown files into a very powerfu...",
  "data/redirect-devtop/2021/5/698278.json": "This is my favorite project extension because this feature significantly improves the user experience...",
  "data/redirect-devtop/2021/5/698467.json": "Hello everyone👋  In this article, I will try to explain the behaviour of the boolean data type of Jav...",
  "data/redirect-devtop/2021/5/698049.json": "Centering content in CSS is something that beginners struggle a lot with. CSS provides a lot of optio...",
  "data/redirect-devtop/2021/5/697248.json": "Hello Guys, Welcome back to another post of Sai Ansul's Blog. In this blog we are gonna find out 12 c...",
  "data/redirect-devtop/2021/5/698640.json": "You may have lots of reasons for what you run your lab but there is an always growing list of new thi...",
  "data/redirect-devtop/2021/5/699567.json": "Taking one step forward   Learning is an unending process. The era we live in carries a plet...",
  "data/redirect-devtop/2021/5/699131.json": "Hello Guys,  Today I created a Glowing Button Hover Effect Using HTML &amp; CSS. this hover effect is...",
  "data/redirect-devtop/2021/5/699459.json": "Photo by Sigmund on Unsplash  All signs point towards an auspicious future for data engineering.   Di...",
  "data/redirect-devtop/2021/5/699563.json": "Nowadays React Js has been quite a popular framework for web development. It has some incredible feat...",
  "data/redirect-devtop/2021/5/698390.json": "Hi Developers , I have created facebook clone from ground up and added all basic to advance...",
  "data/redirect-devtop/2021/5/699230.json": "A curated list with React Dashboards styled with Tailwind CSS and released under permissive licenses by their vendors.: Notus, Windmill, Mosaic.",
  "data/redirect-devtop/2021/5/699121.json": "This post contains technical information, code examples and real use cases.            Int...",
  "data/redirect-devtop/2021/5/693090.json": "¡Hola a todos! 👋  Hablé sobre mi proceso de contratación en GitLab en mi publicación anterior.  Esta...",
  "data/redirect-devtop/2021/5/690769.json": "Introduction   As a backend developer, you sometimes get tired of making basic CRUD applicat...",
  "data/redirect-devtop/2021/5/699202.json": "Open source has always been an amazing place to learn, collaborate, contribute and build new stuff. H...",
  "data/redirect-devtop/2021/5/699846.json": "My website has a little illustration that tracks your cursor's position. The only JavaScript that hap...",
  "data/redirect-devtop/2021/5/699229.json": "As a Web Developer, you've probably heard of the Jamstack. It's the buzzword in web development. But...",
  "data/redirect-devtop/2021/5/699776.json": "Developers spend a lot of time using browsers. As of February 2021, 63% of worldwide Internet users p...",
  "data/redirect-devtop/2021/5/700099.json": "Every JavaScript developer has used `console.log(\"message\")` .  It provides a simple debugging consol...",
  "data/redirect-devtop/2021/5/699858.json": "Hello everyone 👋,  In this article, Let's discuss about the stash feature in Git. We are going to cov...",
  "data/redirect-devtop/2021/5/699091.json": "I wouldn't usually post a blog like this to dev as it's something I usually do for myself, game dev i...",
  "data/redirect-devtop/2021/5/697190.json": "Hello Coders 👩🏼‍💻,  Recently, I visit a crypto tracker site to check DogeCoin prices to see whether...",
  "data/redirect-devtop/2021/5/699451.json": "1 What are the data types?   Supported by JavaScript we have primitive data types like strin...",
  "data/redirect-devtop/2021/5/699075.json": "An overview of ways folks can approach debugging",
  "data/redirect-devtop/2021/5/699862.json": "What is the difference between ‘==’ and ‘===’ ?            Answer:   The double equal does n...",
  "data/redirect-devtop/2021/5/698872.json": "For many, this might be your first time coming across the term “Headless CMS” and you will be forced...",
  "data/redirect-devtop/2021/5/699690.json": "Hello everyone, today we meet again for a new tutorial, as you saw in the title, today I'm going to t...",
  "data/redirect-devtop/2021/5/700429.json": "1. Automate Caching  Repeated request and responding to those request consumes resources and this bec...",
  "data/redirect-devtop/2021/5/700905.json": "Learn how to solve any algorithm using these simple and easy-to-remember techniques.",
  "data/redirect-devtop/2021/5/698873.json": "A modal is a small UI element that will appear in the foreground of a website, usually triggered as a...",
  "data/redirect-devtop/2021/5/699282.json": "This is a post about Storybook and conventions. It is based on my experience using Storybook over s...",
  "data/redirect-devtop/2021/5/698287.json": "In web development there will be many instance in which we need to interact with date/time values, we...",
  "data/redirect-devtop/2021/5/697665.json": "I created an open-source template to develop games using Phaser 3, TypeScript, Snowpack and ESLint.",
  "data/redirect-devtop/2021/5/700630.json": "In this post we will write a function in javascript to generate beautiful ❤️  user avatar.  First we...",
  "data/redirect-devtop/2021/5/698747.json": "I had been super interested in contributing to Open Source Projects for a long time but didn't have a...",
  "data/redirect-devtop/2021/5/699758.json": "Today we gonna learn about the Virtual DOM present in React, which is responsible for its fast perfor...",
  "data/redirect-devtop/2021/5/700944.json": "10 interesting finds that I found over the past week",
  "data/redirect-devtop/2021/5/700417.json": "The React useCallback hook can help you improve performance of your React apps. It is weird that useC...",
  "data/redirect-devtop/2021/5/701205.json": "In this tutorial we’ll be using CSS to create an animated skeleton loading screen. Skeleton loading s...",
  "data/redirect-devtop/2021/5/699771.json": "Websites! We all love making websites that are built from small components and sections. One such com...",
  "data/redirect-devtop/2021/5/694445.json": "Ever wonder what is the best IDE for JavaScript development? Then here you are going to know about wh...",
  "data/redirect-devtop/2021/5/701426.json": "A great project to add to your portfolio and resume.  This article is about what you'll learn by buil...",
  "data/redirect-devtop/2021/5/701708.json": "The JavaScript console object has a number of methods that can be very useful for debugging. Below ar...",
  "data/redirect-devtop/2021/5/700087.json": "Centering elements in CSS sometimes causes a headache, even to experienced developers. There are many...",
  "data/redirect-devtop/2021/5/695494.json": "¡Hola, gente bonita! 👋  Antes de explicar los diferentes valores que tiene la propiedad position debe...",
  "data/redirect-devtop/2021/5/700123.json": "JavaScript is single-threaded, so how does it handle asynchronous code without blocking the main thre...",
  "data/redirect-devtop/2021/5/700602.json": "Let's try to figure out how to answer common JS questions in an interview.",
  "data/redirect-devtop/2021/5/701820.json": "Introduction   Microsoft's VS code is one of the most popular text/code editors available on...",
  "data/redirect-devtop/2021/5/701138.json": "DevTools are undoubtedly one of the most important tools in a web developer’s toolbelt. Definitely th...",
  "data/redirect-devtop/2021/5/700501.json": "Before proceeding, let me explain very briefly about Primitive and Reference types in Javascript....",
  "data/redirect-devtop/2021/5/701655.json": "Created a website for programmers to spend their free time on, and get a good laugh out of it too....",
  "data/redirect-devtop/2021/5/688051.json": "I found Chakra UI (by Sage) a few months ago, and I learned a lot of things from it.  I've been codin...",
  "data/redirect-devtop/2021/5/702049.json": "Totally random open-source projects we can use to learn programming or to build new projects on top.",
  "data/redirect-devtop/2021/5/701184.json": "When you hear a word \"blog\" you might be thinking something like \"That's so 2000, no one reads bl...",
  "data/redirect-devtop/2021/5/702450.json": "This article focus on Fullstack web development. So, Don't blame me for the \"anaconda article\".  If y...",
  "data/redirect-devtop/2021/5/700997.json": "Hello folks!!   It’s been a long time since I last wrote something here. A few days ago I wa...",
  "data/redirect-devtop/2021/5/702476.json": "Web development is not an easy task, for a beginner it will be a very complex and confusing one, the...",
  "data/redirect-devtop/2021/5/702068.json": "No BS. Here the action plan and strategy I followed to achieve it   Learning Vue.js in less...",
  "data/redirect-devtop/2021/5/702272.json": "React js and Vue js are arguably two of the most popular and widely used JavaScript frameworks (or li...",
  "data/redirect-devtop/2021/5/696567.json": "I have just recently improved my terminal setup after learning how to use Tmux. It gave me a way to...",
  "data/redirect-devtop/2021/5/701793.json": "I've compiled a list of some things I think it will be useful to learn for front-end developers in 20...",
  "data/redirect-devtop/2021/5/700667.json": "Animatly is a platform for designers and developers where you can download and customize animated ico...",
  "data/redirect-devtop/2021/5/701492.json": "This is me   Look out 'cause here I come. I'm not scared to be seen. I make no apologies, th...",
  "data/redirect-devtop/2021/5/701195.json": "A round up of the most-read and most-loved contributions from the community this past week.",
  "data/redirect-devtop/2021/5/703146.json": "AWS Amplify just announced server-side rendering deployment support for Next.js! Here's a quick guide...",
  "data/redirect-devtop/2021/5/702673.json": "How to Reduce Complexity of Information Systems with Data-Oriented Programming",
  "data/redirect-devtop/2021/5/703245.json": "Photo by Luca Bravo on Unsplash     I've been finding a lot of articles on DEV lately that garner a T...",
  "data/redirect-devtop/2021/5/702887.json": "Yesssss, I made it! Not exactly 50 projects for 50 days, but almost. Doing a small or medium project...",
  "data/redirect-devtop/2021/5/699584.json": "I decided to do a quick tally and I realized I've written almost 70 articles in the last 2 and a half...",
  "data/redirect-devtop/2021/5/703136.json": "So, you're trying to learn React.js? Maybe you've even built a couple of simple projects in it. Wheth...",
  "data/redirect-devtop/2021/5/703209.json": "Being a developer is hard, no doubt about it. Software development is a field where nobody knows ever...",
  "data/redirect-devtop/2021/5/701567.json": "What a perfect developer portfolio should include? What advice would you give to Bootcamp graduates a...",
  "data/redirect-devtop/2021/5/701428.json": "Hello World! We all know that developers love going faster, saving time for the real fun, so Today I...",
  "data/redirect-devtop/2021/5/699157.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/5/701315.json": "A buddy of mine from up in Canada is in the same full-stack group as me. He happened to be out for a...",
  "data/redirect-devtop/2021/5/703980.json": "Preword: The \"anger\" in this article is just for fun and poking a bit of fun at the \"months and days\"...",
  "data/redirect-devtop/2021/5/703437.json": "useAxios() is a React hook that simplifies async fetching and state management. Source code and live...",
  "data/redirect-devtop/2021/5/696964.json": "Are you looking for the best tools for web development? Well, In this article, we are going to share...",
  "data/redirect-devtop/2021/5/701807.json": "Building a better WebView for native mobile apps",
  "data/redirect-devtop/2021/5/703145.json": "Acronyms are always fun -- they're helpful for reducing the effort of saying out a full long-winded t...",
  "data/redirect-devtop/2021/5/703668.json": "The fiit website is used for creating subscriptions as well as helping users log into the app on TV p...",
  "data/redirect-devtop/2021/5/703128.json": "No doubt javascript is booming the world of software industry . From frontend to backend eve...",
  "data/redirect-devtop/2021/5/702143.json": "Self Hosting!            (cough cough, this might take a while...    it did for me)   If your looking...",
  "data/redirect-devtop/2021/5/694516.json": "If you are a front-end developer and confuse about which service from AWS to learn and how it will he...",
  "data/redirect-devtop/2021/5/703890.json": "This is a loan calculator made using HTML, CSS, JS and chart.js library   Link to chart.js Library  C...",
  "data/redirect-devtop/2021/5/703748.json": "Today I'm going to show you 4 amazing tools to save you time when you prototyping.           1. Place...",
  "data/redirect-devtop/2021/5/703682.json": "The cursor CSS property sets the type of mouse cursor, if any, to show when the mouse pointer is over...",
  "data/redirect-devtop/2021/5/701989.json": "We're incredibly excited to announce the release of Appwrite 0.8, packed with a ton of cool new featu...",
  "data/redirect-devtop/2021/5/703091.json": "Here is a interesting fact, do you know which is the worlds most hated and most loved programming lan...",
  "data/redirect-devtop/2021/5/703933.json": "A few years ago, when I was a beginner developer such a task, to centre a div, would be easy and hard...",
  "data/redirect-devtop/2021/5/702293.json": "The `useReducer` hook is an alternative to the `useState` hook and is preferable when you have complex state logic or when your next state depends on your previous state.",
  "data/redirect-devtop/2021/5/703541.json": "Transform your terminal from this to this !!            Before               After...",
  "data/redirect-devtop/2021/5/703150.json": "Some of the most useful git commands that I use day to day as a web developer",
  "data/redirect-devtop/2021/5/704400.json": "In September 2020 I signed up for Free Code Camp and started learning HTML and CSS.  In April 2021 I...",
  "data/redirect-devtop/2021/5/704805.json": "While the terms Library and Framework may sound similar, they both work differently.   Many people us...",
  "data/redirect-devtop/2021/5/703641.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/5/704585.json": "In the last article we talked about local storage (see the link above), what is it and how can we use...",
  "data/redirect-devtop/2021/5/704709.json": "1. Log level and semantic methods   📚 Console docs    console.log(\"hello world\") console.war...",
  "data/redirect-devtop/2021/5/698875.json": "In this article, we are going to explore async/await which is the go-to tool for every javascript dev...",
  "data/redirect-devtop/2021/5/704367.json": "If you're a junior or mid-level developer, you may have certain ideas about what constitutes a Senior...",
  "data/redirect-devtop/2021/5/704967.json": "I am back at it again, abusing the internet and this one should really blow you away.    This time I...",
  "data/redirect-devtop/2021/5/704206.json": "There a numerous libraries out there for you to implement drag and drop functionality but if you want to know how it works under the hood and want to minimize the bloated components and dependencies then here is the way to do it.",
  "data/redirect-devtop/2021/5/703411.json": "If you are a software developer and aren't in another world, you have probably read or heard somethin...",
  "data/redirect-devtop/2021/5/704729.json": "Updated from Previous Article                                          React: ContextAPI as...",
  "data/redirect-devtop/2021/5/703982.json": "            What is Frontend Mentor?   Frontend Mentor is a platform where you can solve real-world...",
  "data/redirect-devtop/2021/5/704172.json": "I landed on my own Github profile the other day, which is a pretty rare occurrence as I'm usually loo...",
  "data/redirect-devtop/2021/5/705592.json": "Have you ever visited a website where as you scroll down the page, the contents of the webpage gradua...",
  "data/redirect-devtop/2021/5/704562.json": "When I started learning how to code, I looked for many online resources such as blog posts, youtube v...",
  "data/redirect-devtop/2021/5/705481.json": "The Design Idea   Spitting the truth, I really came across 1000s of dev portfolio 💻 websites...",
  "data/redirect-devtop/2021/5/705499.json": "May 2020 is the first time I started learning web development. In the beginning, I learn from a Udemy...",
  "data/redirect-devtop/2021/5/685942.json": "Access to fetch at ‘https://coolserver.com’ from origin ‘http://localhost:3000’ has been blocked by...",
  "data/redirect-devtop/2021/5/705475.json": "Hey there developers. How is it going. Today in this blog, I will be showing you 5 useful vs code ext...",
  "data/redirect-devtop/2021/5/702452.json": "Big O notation and time complexity are fundamental concepts in computer science.",
  "data/redirect-devtop/2021/5/705321.json": "React offers an awesome toolset that allows you to effectively break up and modularize your applicati...",
  "data/redirect-devtop/2021/5/705611.json": "In this article I will show you how to create a login form of neumorphism design. I know everyone kno...",
  "data/redirect-devtop/2021/5/704941.json": "I Built Facebook Clone using just HTML &amp; CSS. I Just Love to build these to practice my HTML &amp...",
  "data/redirect-devtop/2021/5/705440.json": "So I'm back with another small post to show how you can leverage directives to do magical things in y...",
  "data/redirect-devtop/2021/5/704012.json": "Introduction   I love a bit of architecture. How you structure your application is so import...",
  "data/redirect-devtop/2021/5/688677.json": "In this post, I am going to explain how I plan my programming projects. Planning a project can make i...",
  "data/redirect-devtop/2021/5/705462.json": "In my very first post to dev.to I'll be talking about the Appwrite for VS Code extension, what you ca...",
  "data/redirect-devtop/2021/5/706182.json": "Quick way to mask numbers using slice and ES8 padStart method      const creditCard = \"41111...",
  "data/redirect-devtop/2021/5/705003.json": "Introduction   Visual Studio Code or VS Code is the most popular editor for Web Development...",
  "data/redirect-devtop/2021/5/705777.json": "May 20 was Global Accessibility Awareness Day (#GAAD) and turns out - I created quite a bit of conten...",
  "data/redirect-devtop/2021/5/706351.json": "Hello Developers! Many of us use various design patterns with React Development to make React Apps mo...",
  "data/redirect-devtop/2021/5/705886.json": "With the arrival of so much technology and novelty in the development market, many programmers end up...",
  "data/redirect-devtop/2021/5/705842.json": "Hey there everyone! Hope you're all doing good.   So it's been a month since I started learn...",
  "data/redirect-devtop/2021/5/706223.json": "Introduction   Hello there! For a very long time, i just read fantasy books. And i loved it...",
  "data/redirect-devtop/2021/5/705341.json": "What are CSS pseudo-classes?   A CSS pseudo-class is a selector which specifies a specific s...",
  "data/redirect-devtop/2021/5/706317.json": "I recently decided to re-design my portfolio in NextJs. So, I started researching around the web for...",
  "data/redirect-devtop/2021/5/706487.json": "Hey coders 👋  If you are a JavaScript developer, I am pretty much sure that you have used the npm pac...",
  "data/redirect-devtop/2021/5/706216.json": "One of the most popular myths in the web dev community is around cookies &amp; local storage. It's al...",
  "data/redirect-devtop/2021/5/706592.json": "IndieHackers.com   If you are starting to make your own internet startup or company, IndieHackers is...",
  "data/redirect-devtop/2021/5/706498.json": "Hey, friends! I hope you had a great week!   👾 On Thursday, I finished my last CSS project: Pure CSS...",
  "data/redirect-devtop/2021/5/706780.json": "this is one of the fundamental concepts in JavaScript but it's also one of the most confusing concept...",
  "data/redirect-devtop/2021/5/705342.json": "Las Path Aliases o rutas relativas como muchos las pueden conocer, nos ayuda cuando tenemos un proyec...",
  "data/redirect-devtop/2021/5/706851.json": "Here is the list of awesome CSS animation resources that will help you to animate components quickly...",
  "data/redirect-devtop/2021/5/705942.json": "Captcha as a game",
  "data/redirect-devtop/2021/5/706480.json": "A curated list with Lightweight CSS Frameworks we can use to code small, fast-loading projects: Pico.CSS, Milligram, Pure CSS.",
  "data/redirect-devtop/2021/5/703144.json": "I've used Create React App non-stop to scaffold React apps, and I love it. Recently, though, I've bee...",
  "data/redirect-devtop/2021/5/705883.json": "Anyone can code, but can you code cleanly? In this article, I'll show you my go-to clean coding tec...",
  "data/redirect-devtop/2021/5/704544.json": "In this article I am going to show you how to create glassmorphism login form using HTML and CSS prog...",
  "data/redirect-devtop/2021/5/706691.json": "This is a term that has been growing for past years. But, what is exactly a micro frontend?...",
  "data/redirect-devtop/2021/5/707064.json": "Web development usually entails building websites on the internet. However, web development technolog...",
  "data/redirect-devtop/2021/5/706330.json": "Hello, glad you are here. I am kunaal and today we will make tabs for website with CSS and JS. You ca...",
  "data/redirect-devtop/2021/5/705796.json": "This article was originally posted on my personal blog  Please participate in this survey to voice yo...",
  "data/redirect-devtop/2021/5/706585.json": "What is CSS Flexbox   CSS Flexbox is a one-dimensional layout module that can be used to mak...",
  "data/redirect-devtop/2021/5/706864.json": "The React useReducer hook is a very good alternative to useState when you need to manage complex stat...",
  "data/redirect-devtop/2021/5/705159.json": "Laravel's service container is one of the most important pieces of the framework yet it gets so littl...",
  "data/redirect-devtop/2021/5/706113.json": "Introduction   Docker is a free and open framework for building, delivering, and running app...",
  "data/redirect-devtop/2021/5/707244.json": "Ready for the second set of loaders? Yes, it's again me with another collection of 100 CSS loaders. N...",
  "data/redirect-devtop/2021/5/706859.json": "Hello folks, You might be working on GUI based interfaces to do your daily tasks. But do you know tha...",
  "data/redirect-devtop/2021/5/702464.json": "Want to know how to make passive income as a web developer? Then this article is for you. Here you'll...",
  "data/redirect-devtop/2021/5/705686.json": "On and off this question might have crossed your mind once in a while when you open WhatsApp on the w...",
  "data/redirect-devtop/2021/5/705009.json": "Let's learn few tricks with logical operators 👻",
  "data/redirect-devtop/2021/5/707824.json": "Hi folks,   Managing data in an app is little tricky when many components are sharing and updating it...",
  "data/redirect-devtop/2021/5/706409.json": "The process of learning Machine Learning (ML) can often be challenging and confusing. A good majority...",
  "data/redirect-devtop/2021/5/707293.json": "I help people to check CSS/HTML of their projects. I have noticed that some errors are repeated from...",
  "data/redirect-devtop/2021/5/690200.json": "For the last year, I have been curating Trending projects a newsletter that showcases 10 popular web...",
  "data/redirect-devtop/2021/5/707826.json": "Table of contents    Introduction Date formats Time zones Unix timestamp The Date object Cal...",
  "data/redirect-devtop/2021/5/708208.json": "Today I created a Amazing Specific with HTML &amp; JS. I use JavaScript to select this file name and...",
  "data/redirect-devtop/2021/5/706574.json": "Jetpack Compose offers a completely new way to write, and to think about, UI code. One of its key fea...",
  "data/redirect-devtop/2021/5/707472.json": "You must have seen this effect on several website, where you scroll down and navigation bar automatic...",
  "data/redirect-devtop/2021/5/707791.json": "As users, popups suck. Most of us never click on them and likely leave the page when we see them.   B...",
  "data/redirect-devtop/2021/5/708033.json": "It’s been a while since I last posted on the blog, but today I want to talk a bit about our newest pr...",
  "data/redirect-devtop/2021/5/709106.json": "A list of 40 awesome websites, chrome extensions, web apps, and everything in between that will help...",
  "data/redirect-devtop/2021/5/708279.json": "Written by Kirill Bychkov for UppLabs.  JavaScript is easy when all you need is a simple working inte...",
  "data/redirect-devtop/2021/5/707683.json": "Inheritance remains one of the most relied upon and misunderstood features of JavaScript to this day....",
  "data/redirect-devtop/2021/5/709041.json": "Hi there 👋,  Checkout this cool sidebar.  Here is the Demo Link: https://react-sidebar.vercel.app/  I...",
  "data/redirect-devtop/2021/5/709055.json": "These are some of the general Interview Questions Every JavaScript Developer Should Know           1....",
  "data/redirect-devtop/2021/5/707889.json": "The `:placeholder-shown` CSS pseudo-class represents any `` or `` element that is currently displayin...",
  "data/redirect-devtop/2021/5/709122.json": "Are you a FrontEnd developerMan? Here are 5 websites that will help you with the design and branding of your next project.",
  "data/redirect-devtop/2021/5/708491.json": "Contents     Intro   HTTPS   Security Headers   Summary             Intro    I've been a bit...",
  "data/redirect-devtop/2021/5/709013.json": "You all might have stumbled upon blogs like \"Best books you should read to become a top developer\", \"...",
  "data/redirect-devtop/2021/5/705161.json": "Photo by Luca Bravo on Unsplash   Hello fellow devs! 👋🏻 I hope you are doing well!  I'm sure you hav...",
  "data/redirect-devtop/2021/5/708706.json": "CssGradient 🖌   Here you will find gradients of all types so that your website is at another...",
  "data/redirect-devtop/2021/5/707881.json": "Hey everyone 👋🏻,  In this article, let us discuss some very important methods that we have in the Pro...",
  "data/redirect-devtop/2021/5/708307.json": "Next.js is a React framework developed by Vercel that is bound to ease your life as a React developer...",
  "data/redirect-devtop/2021/5/703239.json": "'this' is one of the most important concepts in JavaScript. It's part of the basics and the sooner yo...",
  "data/redirect-devtop/2021/5/709710.json": "Preword: Here we are with yet another on of my angry rants on Accessibility.   If you haven't seen th...",
  "data/redirect-devtop/2021/5/710059.json": "Easily generate HTML, RSS and Google XML sitemaps for free. Compatible with major search engines incl...",
  "data/redirect-devtop/2021/5/709325.json": "🍟 TL:DR :   Serving react app is pretty simple if we does it directly through development en...",
  "data/redirect-devtop/2021/5/710159.json": "More people learn to code every day, which increases competition in the field of web development. Lan...",
  "data/redirect-devtop/2021/5/710189.json": "I recently came across the issue of sharing some data between different tabs of the same web applicat...",
  "data/redirect-devtop/2021/5/710130.json": "Hey devs!  I made 18 cards with tips of common mistakes when designing web forms.  I've also posted t...",
  "data/redirect-devtop/2021/5/710351.json": "A curated list with open-source and paid admin dashboards recently updated: Soft UI, Volt Bootstrap 5, Windmill, Berry React.",
  "data/redirect-devtop/2021/5/710161.json": "TL;DR: Bad booleans represent state. Good booleans are derived from state.  When you're managing stat...",
  "data/redirect-devtop/2021/5/710398.json": "Before Starting, I would like to tell you that this is part 2 of this series, Websites For Developers...",
  "data/redirect-devtop/2021/5/707533.json": "Cover photo by Ian Schneider on Unsplash.  Hey Everyone, My name is Santosh. In this blog, I will sha...",
  "data/redirect-devtop/2021/5/697651.json": "If you want to be a full-stack web developer and stuck at just beginner projects, here is the chance...",
  "data/redirect-devtop/2021/5/710092.json": "Introduction   In this article, we are going to cover the basics of error handling in React....",
  "data/redirect-devtop/2021/5/710774.json": "Pre loader or a loading screen animation is animation which will be displayed before the content of t...",
  "data/redirect-devtop/2021/5/710819.json": "Notification badges annoy me most of the times by popping up every now and then and I am pretty sure...",
  "data/redirect-devtop/2021/5/709907.json": "Frontend frameworks   Within this post, I will show you one, of many ways to use components...",
  "data/redirect-devtop/2021/5/710780.json": "Back to Basic will answer some of my questions when I first started learning CSS. Personally, I think...",
  "data/redirect-devtop/2021/5/709649.json": "Flutter has established itself as a major player in the cross-platform space.",
  "data/redirect-devtop/2021/5/708579.json": "With most of these methods, you need to understand callbacks. A callback is a function passed as an a...",
  "data/redirect-devtop/2021/5/701797.json": "Remote port forwarding as a service",
  "data/redirect-devtop/2021/5/710475.json": "The Micro Frontend is one of the hottest topics on the internet right now. We hear it all the time, b...",
  "data/redirect-devtop/2021/5/709591.json": "Learning CSS can be a frustrating experience sometime. One of the best things about learning to code...",
  "data/redirect-devtop/2021/5/710385.json": "Flexbox is amazing and they make positioning in CSS much, much better than raw positioning (Absolute,...",
  "data/redirect-devtop/2021/5/710030.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to ensu...",
  "data/redirect-devtop/2021/5/710576.json": "Contents     Intro   X-Content-Type-Options   X-XSS-Protection   X-Frame-Options   Summary...",
  "data/redirect-devtop/2021/5/709589.json": "I recently gave some interviews and mostly all interviewer asked these similar questions regarding Ja...",
  "data/redirect-devtop/2021/5/709945.json": "PS: Web Development term here primarily concentrated on Frontend Development.  So today one of my fri...",
  "data/redirect-devtop/2021/5/699492.json": "I got absolutely thrashed by some PostgreSQL performance issues this past week. It was painful. And,...",
  "data/redirect-devtop/2021/5/710079.json": "Hi guys, Today we are going to build a simple form which take input from user and we log the data in...",
  "data/redirect-devtop/2021/5/709284.json": "I promise that you will have a good understanding of promises by the end of the article 😁....",
  "data/redirect-devtop/2021/5/711175.json": "If you've been using React for a while, you'll have noticed some cases where the freedom and wild nat...",
  "data/redirect-devtop/2021/5/710358.json": "Creating a single pipeline for you Pull Requests and Merges",
  "data/redirect-devtop/2021/5/711995.json": "Responsivize   A must have tool to develop responsive websites!   Download here            W...",
  "data/redirect-devtop/2021/5/711073.json": "Hey folks 👋🏼  We just launched another Product on Product Hunt. It's a notion template that helps you...",
  "data/redirect-devtop/2021/5/710087.json": "Hello, glad you are here. I am kunaal and today we will see how to style checkbox in HTML. How we can...",
  "data/redirect-devtop/2021/5/710580.json": "Some notes about REST and best practices that I follow to design RESTful APIs",
  "data/redirect-devtop/2021/5/710149.json": "Recently I needed to make odd shaped borders for some images in a card UI. Most of the times you woul...",
  "data/redirect-devtop/2021/5/711929.json": "“This is a curate long-list of 20+ Best Practises for Dockerfile for the Year 2020”.  Since the incep...",
  "data/redirect-devtop/2021/5/711453.json": "So you've learned React. You know, at least vaguely, what the virtual DOM is and are comfortable with...",
  "data/redirect-devtop/2021/5/711841.json": "Here is a list of 30 illustration designs that will help you to find illustrations for your next web...",
  "data/redirect-devtop/2021/5/710920.json": "If you are learning to code, chances are you might be learning Python. What are some ways that you ar...",
  "data/redirect-devtop/2021/5/712078.json": "Hello, glad you are here. I am kunaal and today we will see how to make a custom select input, a cust...",
  "data/redirect-devtop/2021/5/711915.json": "If you have ever used GitHub, you must have come across some impressive-looking profiles and thought...",
  "data/redirect-devtop/2021/5/712534.json": "Hello amazing people, If you are interested in becoming a web developer then JavaScript is one of the...",
  "data/redirect-devtop/2021/5/712157.json": "Late in the afternoon of May 24, 2021, Tessa Kriesel was informed by her leadership at Fast that the...",
  "data/redirect-devtop/2021/5/711340.json": "Next time you have to learn a programming language, or a set of libraries from an ecosystem, put your...",
  "data/redirect-devtop/2021/5/712248.json": "In this part, you will be creating a GraphQL API that interacts with a DynamoDB NoSQL database to per...",
  "data/redirect-devtop/2021/5/710959.json": "Since a dominant part of the populace uses the Chrome internet browser, engineers and designers shoul...",
  "data/redirect-devtop/2021/5/710965.json": "Jetpack Compose introduces a novel way to handle observable state. For an introduction that adds some...",
  "data/redirect-devtop/2021/5/711316.json": "I was recently creating a script that requested data from a 3rd party API, and I was running this scr...",
  "data/redirect-devtop/2021/5/711928.json": "I've had so many unread emails in my inbox because they were promotional content, or I was just too l...",
  "data/redirect-devtop/2021/5/711561.json": "Front-end web development is the practice of converting data to a graphical interface, through the us...",
  "data/redirect-devtop/2021/5/712349.json": "I would like to tell you that this is PART 3 of this series, Websites For Developers.           I'm s...",
  "data/redirect-devtop/2021/5/710663.json": "You often forget that APIs exist for most of the platforms you use. While some companies lock down th...",
  "data/redirect-devtop/2021/5/710967.json": "Hello everyone, today I propose you a tutorial to create a login form to your website using a little...",
  "data/redirect-devtop/2021/5/711551.json": "What's Blockchain ?   Blockchain is a system of recording information in a way that makes it...",
  "data/redirect-devtop/2021/5/711648.json": "About the hitchhikers series   This is a series of posts dedicated to help devs discover and...",
  "data/redirect-devtop/2021/5/712593.json": "In this article, we cover the all-important yet so confusing topic in JavaScript which is the “this”...",
  "data/redirect-devtop/2021/5/712777.json": "You'll already know now The React framework includes react hooks. Witch are Special hook functions th...",
  "data/redirect-devtop/2021/5/712406.json": "I am currently a Flatiron student. Our first phase focused on the fundamentals of Javascript and unde...",
  "data/redirect-devtop/2021/5/706190.json": "Not sure what you call them, toggles or switches, but here's how you make a toggle button with Tailwi...",
  "data/redirect-devtop/2021/5/711834.json": "Recently I developed a personal blog website, bought a domain and wanted to go-live, but had no idea...",
  "data/redirect-devtop/2021/5/712095.json": "This post was originally published here   My journey on learning to build a simple OS  How many time...",
  "data/redirect-devtop/2021/5/711912.json": "JavaScript is a programming language that is vastly used in the world both on the client-side as well...",
  "data/redirect-devtop/2021/5/711488.json": "Welcome to this new series! I'm a frontend developer who recently had an idea for a SaaS product, so...",
  "data/redirect-devtop/2021/5/713129.json": "Hello coders!! Today we will discuss some concepts you need to know to build real complex application...",
  "data/redirect-devtop/2021/5/706420.json": "I hate the feeling when I don't know something.   This is where impostor syndrome hits.   I had this...",
  "data/redirect-devtop/2021/5/713374.json": "A simple Django Template that might help beginners to code faster a production-ready project",
  "data/redirect-devtop/2021/5/712857.json": "Imagine you've been to a café and order a cup of coffee ☕. Once the bill 🧾 arrives, it isn't only for...",
  "data/redirect-devtop/2021/5/712675.json": "Git and GitHub are at the core of open source in today’s programming world. However, there are a lot...",
  "data/redirect-devtop/2021/5/713114.json": "Did you recently start your web development journey?  As exciting as this may sound to create your fi...",
  "data/redirect-devtop/2021/5/713332.json": "Adding interactive object animations to a website creates a delightful experience for users besides m...",
  "data/redirect-devtop/2021/5/712598.json": "Introduction   One of the main hectic things in open source is to find a good repository to...",
  "data/redirect-devtop/2021/5/698801.json": "It's official y'all, I got hired as a front-end developer!!! I am starting tomorrow and I am so pumpe...",
  "data/redirect-devtop/2021/5/714089.json": "If you are building a project that involves customer interactions, then probably at some point you wo...",
  "data/redirect-devtop/2021/5/714093.json": "I help people to check CSS/HTML of their projects. I have noticed that some errors are repeated from...",
  "data/redirect-devtop/2021/5/713351.json": "Performance is important, especially in large-scale application. The React useMemo hook is one tool y...",
  "data/redirect-devtop/2021/5/713902.json": "They say the best place to learn football is on a football field, likewise the best place to learn we...",
  "data/redirect-devtop/2021/5/714484.json": "not 100, not 200 but 300! Yes, a new collection and a total of 300 CSS loaders.   This time, I am goi...",
  "data/redirect-devtop/2021/5/713005.json": "This article is written for someone with 0 backend experience, so anyone should be able to learn from...",
  "data/redirect-devtop/2021/5/707192.json": "Why run schema validation?   How do you ensure the stability of your Kubernetes clusters? Ho...",
  "data/redirect-devtop/2021/5/712896.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/5/713585.json": "Sometimes things fail — that's a fact of life and programming. So as a programmer, you're going to ha...",
  "data/redirect-devtop/2021/5/712512.json": "Test-driven development, or TDD, is a programming paradigm in which you write your tests first and yo...",
  "data/redirect-devtop/2021/5/712443.json": "These hacks (quick tips) would help in getting Efficient at work and plan our day to achieve maximum...",
  "data/redirect-devtop/2021/5/714011.json": "Prepping for your next interview ❓ I have the perfect checklist for you. Go through this and you are...",
  "data/redirect-devtop/2021/5/711440.json": "Redux Toolkit (which onwards, I will refer to as RTK) is a massive improvement to the Redux ecosystem...",
  "data/redirect-devtop/2021/5/711692.json": "In 2017 Tom Dale, wrote Compilers are the New Frameworks. And he was right. In 2017 things were alrea...",
  "data/redirect-devtop/2021/5/710703.json": "¡Hola gente bonita!👋  En este articulo voy a explicar sobre la propiedad display y los diferentes val...",
  "data/redirect-devtop/2021/5/714113.json": "When we talk about the system design or see those big  Mircoservice Architecture diagram, there is a...",
  "data/redirect-devtop/2021/5/712766.json": "GitHub isn't only a rendition control administration; it is a marvelous substance asset for all-thing...",
  "data/redirect-devtop/2021/5/709601.json": "Download the new Forem app on the App Store",
  "data/redirect-devtop/2021/5/711993.json": "What is Next.js?  It's a React frontend development web framework that enables functionality such as...",
  "data/redirect-devtop/2021/5/712900.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/5/713126.json": "Hi everyone!    Welcome to the second post in our Data Structures &amp; Algorithm series! Last time w...",
  "data/redirect-devtop/2021/5/708518.json": "Help us come up with the most dev-tastic caption for this pic!",
  "data/redirect-devtop/2021/5/707882.json": "Have you been using Git on the command line? Notice how you have to always type in your password? Not...",
  "data/redirect-devtop/2021/5/695862.json": "What's the value of the length field for JavaScript functions? What will be logged to the console?...",
  "data/redirect-devtop/2021/5/707058.json": "I don't use React often and so whenever I need to do even the smallest thing in React, I have to chec...",
  "data/redirect-devtop/2021/5/711281.json": "Ever wondered how Mona Lisa would have looked in real life?     Or have you ever wanted to create new...",
  "data/redirect-devtop/2021/5/708685.json": "Building A Google Password Manager Clone With React JS and Fauna   Authored in connection...",
  "data/redirect-devtop/2021/5/685565.json": "Today we're gonna run an ice cream shop and learn asynchronous JS. Along the way, we'll understand...",
  "data/redirect-devtop/2021/5/708186.json": "Dangit Git     Yep, sometimes git can be complicated, but that does not mean necessarily it...",
  "data/redirect-devtop/2021/5/704215.json": "With my focus recently going back to look at optimization for the Solid 1.0 release, I thought I'd...",
  "data/redirect-devtop/2021/5/685827.json": "As a full-stack developer, understand how to build an authentication system with backend technology...",
  "data/redirect-devtop/2021/5/713572.json": "If you have just started as an open source contributor or planning to become one, you might came...",
  "data/redirect-devtop/2021/5/697303.json": "The very 1st step you have to do is, choose a programming language, either Java or C++ (or it's up to...",
  "data/redirect-devtop/2021/5/707226.json": "Bring your Next.js app to life by adding page transition animations with Framer Motion.",
  "data/redirect-devtop/2021/5/710330.json": "Automating your development with Dependabot, Auto Assign, Merge Freeze, Husky and Scheduled...",
  "data/redirect-devtop/2021/5/695674.json": "Functional programming is a programming paradigm where programs are constructed by applying and...",
  "data/redirect-devtop/2021/5/697200.json": "Calculate mouse position with respect to an element.   Element.getBoundingClientRect()...",
  "data/redirect-devtop/2021/5/703932.json": "In case you don't know what bootstrap is, bootstrap is a CSS framework.   Here's why you should not...",
  "data/redirect-devtop/2021/5/688040.json": "My regular readers (both of them) know that hiring and developer evaluation are some of my favorite..."
}