{
  "data/redirect-devtop/2022/3/1005176.json": "I have often been asked what resources would I recommend for beginners looking to step their foot...",
  "data/redirect-devtop/2022/3/1005101.json": "I'm pretty sure you have used the global JSON object for a variety of things, like in fetch requests...",
  "data/redirect-devtop/2022/3/1004855.json": "Starting from open-source projects to enterprise software, most softwares have a huge codebase. Don't...",
  "data/redirect-devtop/2022/3/1005724.json": "Last fall, I started seeking work after it became clear to me that I was being pushed out of Apple....",
  "data/redirect-devtop/2022/3/1005501.json": "Cross-Posted From CodeNewbie Community  The CodeNewbie team is thrilled to share that the tech...",
  "data/redirect-devtop/2022/3/1005900.json": "I told you not to click, this next part may cause you physical pain:        this ⠀⠀  really    ...",
  "data/redirect-devtop/2022/3/1006315.json": "Creating beautiful, consistent color palettes is hard. You have to find the right colors and make...",
  "data/redirect-devtop/2022/3/1005775.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/3/1006040.json": "You might have heard about this Spread Operators and be are using it too in everyday Developement....",
  "data/redirect-devtop/2022/3/1006224.json": "Svelte is a modern and growing front-end compiler. Developers build boilerplate-free components using...",
  "data/redirect-devtop/2022/3/1005406.json": "The appearance of Node.js became the new era for JavaScript because of the opportunity to synchronize frontend and backend.",
  "data/redirect-devtop/2022/3/1006346.json": "What your feeling about the new design of MDN ?   https://developer.mozilla.org     __  Other links...",
  "data/redirect-devtop/2022/3/1004918.json": "If you are anything like me, it looks like time has been standing still since this covid thing...",
  "data/redirect-devtop/2022/3/1006567.json": "Functional programming is a way of thinking about programs by composing pure functions. It tries to...",
  "data/redirect-devtop/2022/3/1006320.json": "Hey there👋,  I saw some cool animations and effects on different websites few days ago. So I made...",
  "data/redirect-devtop/2022/3/1005469.json": "Hey, fellow developers!  What advice would you give to yourself if you could travel back in time?...",
  "data/redirect-devtop/2022/3/1008966.json": "February was a dynamic month in the cloud space, that’s for sure.  This series explores the most...",
  "data/redirect-devtop/2022/3/1007679.json": "Overview of My Submission   This month, I saw the Azure + Dev.to Hackathon 🤩 and immediately...",
  "data/redirect-devtop/2022/3/1007160.json": "As beginners, we started with a certain programming language. We learned that language' features, and...",
  "data/redirect-devtop/2022/3/1008768.json": "When I was working on redesigning this blog, I created this slick-looking header effect.    I'll...",
  "data/redirect-devtop/2022/3/1009186.json": "Yes, you heard me right I got a job as a content creator! 15 years self-employed and someone finally...",
  "data/redirect-devtop/2022/3/1008425.json": "In many communities i have been, exists certain dislike towards writing css, people get frustrated,...",
  "data/redirect-devtop/2022/3/1006365.json": "I struggled with two aspects of software development as a junior engineer: structuring large...",
  "data/redirect-devtop/2022/3/1008541.json": "Save your eyes from cluttered editor. Make Visual Studio Code more pleasing to look at. This is...",
  "data/redirect-devtop/2022/3/1009139.json": "In this article, we’ll cover how to render and configure 3D assets created in a 3D software program...",
  "data/redirect-devtop/2022/3/1009999.json": "This article was written exclusively for Dev Interrupted by Kathryn Koehler  At Netflix, we don’t...",
  "data/redirect-devtop/2022/3/1010823.json": "I everybody, today I am going to show examples of few important Javascript functions.           DEEP...",
  "data/redirect-devtop/2022/3/1010546.json": "GraphQL is gaining popularity because of its ability to develop APIs more efficiently, powerful, and...",
  "data/redirect-devtop/2022/3/1008325.json": "This is not a blog I anticipated writing. My plan was to let Women's History Month pass me by as much...",
  "data/redirect-devtop/2022/3/1010092.json": "Today, a friend asked in a Slack we’re a part of what Node.js resources did folks recommend? The...",
  "data/redirect-devtop/2022/3/1008770.json": "Welcome!   Why is this boilerplate the best? Because all the top eth boilerplates on github...",
  "data/redirect-devtop/2022/3/1009703.json": "We deal with a variety of technologies, frameworks, and programming languages as web developers....",
  "data/redirect-devtop/2022/3/1007259.json": "We don't observe how we grow up and a lot of events and interactions that form our future selves...",
  "data/redirect-devtop/2022/3/1009362.json": "The other day, I stumbled upon some code where I needed to handle an object as a regular array a few...",
  "data/redirect-devtop/2022/3/1011236.json": "Cover image credits ☝️ go to: Derick McKinney, GIF credits👇 go to AlwaysBeColoring!     I wanna hear...",
  "data/redirect-devtop/2022/3/1010312.json": "Hey Devs,   It's good to see you again. from this post I will tell you how to use...",
  "data/redirect-devtop/2022/3/1007755.json": "We’ve all heard the dreaded words, “But it works on my machine.” Whether simple or complex,...",
  "data/redirect-devtop/2022/3/1009798.json": "Soon the new version of ECMA Script will become standard in few months. So let's take a glimpse at...",
  "data/redirect-devtop/2022/3/1010036.json": "I love React.  But there are some aspects of the framework that have previously given me fits.  One...",
  "data/redirect-devtop/2022/3/1010902.json": "What is JAVA?   Java is a high-level, third generation programming language, like C,C++,...",
  "data/redirect-devtop/2022/3/1011622.json": "You got a reply!!!!   But as you start reading more, something seems off. \"We appreciate...",
  "data/redirect-devtop/2022/3/1012414.json": "I'm the type of person who keeps creating different repositories and small open-source projects. One...",
  "data/redirect-devtop/2022/3/1013950.json": "Learning CSS can be quite a challenge. There are no shortcuts, and you will have to get your hands...",
  "data/redirect-devtop/2022/3/1014232.json": "What are Cloud Functions?   Cloud functions are a way of extending a cloud provider’s...",
  "data/redirect-devtop/2022/3/1014177.json": "This article was originally published at:...",
  "data/redirect-devtop/2022/3/1008304.json": "Today, we're excited to share that we've redesigned the beloved DEV Shop to be more representative of...",
  "data/redirect-devtop/2022/3/1013629.json": "Today, in this article, we'll analyze two common processing techniques used by the operating system...",
  "data/redirect-devtop/2022/3/1008332.json": "Dear DEV Community,  I wanted to let you know that Forem (the open source software company behind...",
  "data/redirect-devtop/2022/3/1012959.json": "Problem Given a sorted array of distinct integers and a target value, return the index if the target...",
  "data/redirect-devtop/2022/3/1010554.json": "People say that every front-end developer must implement their own JS framework, and every EPAM...",
  "data/redirect-devtop/2022/3/1013712.json": "DevOps for any organization is a cultural shift, and it’s not just about tools and technologies but a...",
  "data/redirect-devtop/2022/3/1014415.json": "Insult Your Friends   Funnily insulting your friend will always makes you laugh that's human...",
  "data/redirect-devtop/2022/3/1015062.json": "How often you see buttons in applications🧐?   I think in every application that you seen in...",
  "data/redirect-devtop/2022/3/1015277.json": "Project Links Demo Frontend BackEnd  Overview of our project This project goal is to suggest real...",
  "data/redirect-devtop/2022/3/1015597.json": "Celebrating International Women's Day with stories of triumph and perseverance — and personal commitments to challenge gender inequity in tech. Our 2022 celebration is benefitting Girls Who Code",
  "data/redirect-devtop/2022/3/1015795.json": "When it comes to websites, blogs, and whatnot, we often expect to find a CMS power these systems.  I...",
  "data/redirect-devtop/2022/3/1013258.json": "So six months have passed, 350 commits have been made and 147 daily meetings attended...here is a...",
  "data/redirect-devtop/2022/3/1016082.json": "The #shecoded prompt this year made me realise that 2022 officially marks 5 years in tech for me!...",
  "data/redirect-devtop/2022/3/1016332.json": "My biggest achievement this year was being fully offline for four months to care for a newborn baby,...",
  "data/redirect-devtop/2022/3/1015080.json": "It still amazes me I'm writing this as a Software Engineer. 2022 is going to be my first year as a...",
  "data/redirect-devtop/2022/3/1013503.json": "harshhhdev        /          groovi                        🍃 Create...",
  "data/redirect-devtop/2022/3/1015943.json": "Video subtitles on Twitter are a PAIN IN THE ASS.  NO, that's not an excuse to exclude them from your...",
  "data/redirect-devtop/2022/3/1016629.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/3/1010483.json": "Overview of My Submission   \"Github Profile Header Generator\" is a simple but nice header...",
  "data/redirect-devtop/2022/3/1016322.json": "You may not think your site has anything worth being hacked for, but websites are compromised all the...",
  "data/redirect-devtop/2022/3/1014088.json": "From early computers to wartime inventions, the beginnings of the internet and beyond. Women have...",
  "data/redirect-devtop/2022/3/1016260.json": "Ever wondered why your designs miss some depth? Adding modern-looking shadows can often improve that,...",
  "data/redirect-devtop/2022/3/1016940.json": "A Quick Introduction   Authentication is the mechanism to validate a user's identity for an...",
  "data/redirect-devtop/2022/3/1017270.json": "Table of Contents   Introduction   Place Users In Control Make your User comfortable Reduce...",
  "data/redirect-devtop/2022/3/1014940.json": "A developer's guide for creating written and technical documentation.",
  "data/redirect-devtop/2022/3/1014424.json": "(Cover photo by Flickr user FolsomNatural)  Hands up - who has played this absolute classic for hours...",
  "data/redirect-devtop/2022/3/1017085.json": "Hi Folks,  This is Ankit from SigNoz! Sharing some tips I collected over the past few weeks talking...",
  "data/redirect-devtop/2022/3/1016984.json": "Mine are:       React Router DOM (V6) - For Page routing and views switching. React Hooks - UseState,...",
  "data/redirect-devtop/2022/3/1017860.json": "A Complete guide on CSS combinators 2022. You can find everything you need to know about CSS...",
  "data/redirect-devtop/2022/3/1011107.json": "The article discusses balancing your coding journey with offline college.    The world has seen many...",
  "data/redirect-devtop/2022/3/1017613.json": "Want to add a Profile README to your GitHub account but don't know how? GitHub introduced a new...",
  "data/redirect-devtop/2022/3/1016358.json": "I am motivated to share my learning journey, to support this initiative. Here goes something... (hope...",
  "data/redirect-devtop/2022/3/1018741.json": "If you’re anything like me, you surely like to keep up with the newest technologies on the market. I...",
  "data/redirect-devtop/2022/3/1016828.json": "Hey fellow developers, self-taught or otherwise. I'm going to use this medium to talk about aspects...",
  "data/redirect-devtop/2022/3/1017622.json": "Only understand this: We use useEffect to do something after the view has been rendered.   Now, let's...",
  "data/redirect-devtop/2022/3/1018782.json": "Modern web development has shifted to component-based architecture, resulting in faster development,...",
  "data/redirect-devtop/2022/3/1015698.json": "Kubernetes is complex to learn, deploy and manage. But it is also a powerful container orchestration...",
  "data/redirect-devtop/2022/3/1018555.json": "Theres been a pattern I've seen creeping in Rails apps. The pattern is that there are cases where...",
  "data/redirect-devtop/2022/3/1018460.json": "This article was originally published at:...",
  "data/redirect-devtop/2022/3/1018023.json": "console.log is one the debugging weapon or logger we use as javascript developer. The console. log...",
  "data/redirect-devtop/2022/3/1019167.json": "Firestore   To be fair I meant Firestore really, not Firebase the Platform. Ok, Firestore is...",
  "data/redirect-devtop/2022/3/1018796.json": "The final React 18 release is coming in just a few weeks – time to get ready! ",
  "data/redirect-devtop/2022/3/1019017.json": "Photo by Ferenc Almasi on Unsplash           Sumário    Introdução Qualidade de Software Por que eu...",
  "data/redirect-devtop/2022/3/1006905.json": "Comment here if you need any help during the Deepgram Hackathon on DEV!",
  "data/redirect-devtop/2022/3/1017315.json": "This guide explains how to create a new React app using a popular tech stack: Next.js, TypeScript, ESLint, Prettier, styled-components, Cypress, Storybook.",
  "data/redirect-devtop/2022/3/1019375.json": "The article was initially published on Codica blog.  When we buy a product or service, what is...",
  "data/redirect-devtop/2022/3/1020477.json": "A curated list with modern, eye-catching UI Kits crafted on top of React. All products are free and open-source.",
  "data/redirect-devtop/2022/3/1017631.json": "A walkthrough of my very opinionated React Component.",
  "data/redirect-devtop/2022/3/1019936.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/3/1020129.json": "We live in a world where real-time data streaming has become paramount. Real-time data streaming has...",
  "data/redirect-devtop/2022/3/1020303.json": "I won't lie. There is a reason I skipped this one for a bit, it was a bit unclear on when to use this...",
  "data/redirect-devtop/2022/3/1020518.json": "Hi Everyone!  This article presents my favorite and most used keybindings,  and how you can customize...",
  "data/redirect-devtop/2022/3/1019315.json": "One of my friends informed me about this really cool feature that allows you to add autocomplete to...",
  "data/redirect-devtop/2022/3/1019635.json": "A tongue-in-cheek article about CSS and colors",
  "data/redirect-devtop/2022/3/1020991.json": "Recently, I was chatting and mentoring a colleague, a Frontend programmer who consults me frequently...",
  "data/redirect-devtop/2022/3/1006907.json": "A place to discuss your progress with the Deepgram Hackathon on DEV — and lend encouragement to one another!",
  "data/redirect-devtop/2022/3/1018987.json": "Basics   Starting somewhere... Be careful, some command might require bash 4 (the vast...",
  "data/redirect-devtop/2022/3/1018806.json": "Job searching feels like you are adrift at sea with no land in sight. Along with being a software...",
  "data/redirect-devtop/2022/3/1020882.json": "This is a dead-simple observation that I wanted to write about because I almost never see this...",
  "data/redirect-devtop/2022/3/1021473.json": "Scroll effects are an easy way to improve the user experience of your website, so I created a list of...",
  "data/redirect-devtop/2022/3/1021437.json": "Introduction   So how do we escape tutorial hell? Well, I should start from the very...",
  "data/redirect-devtop/2022/3/1021109.json": "I'm taking a risk here, it's currently the 4th of March when I'm writing this, and I'll be scheduling...",
  "data/redirect-devtop/2022/3/1021102.json": "When collaborating on a project with several other developers, maintaining a consistent code style...",
  "data/redirect-devtop/2022/3/1021303.json": "Overview of My Submission   It is a python script that takes a Video, and Renders subtitles...",
  "data/redirect-devtop/2022/3/1021625.json": "Most of these codepens are responsive, so try them at different scales: 1x, 0.5x, 0.25x.          ...",
  "data/redirect-devtop/2022/3/1014842.json": "HTML5UP   HTML5 UP is a collection of amazing free templates, that are fully responsive,..."
}