{
  "data/redirect-devtop/2020/7/410932.json": "Fifty (plus) applications, chrome extensions, web apps, and everything in between that will hopefully...",
  "data/redirect-devtop/2020/7/391598.json": "After the success of the first post, and incited by several of you to publish a second edition, I dec...",
  "data/redirect-devtop/2020/7/402184.json": "These are the site / apps/ extenstion I found very useful in my frontend development.   They can even...",
  "data/redirect-devtop/2020/7/403121.json": "When I started developing websites about ten years ago, one of the hardest things was to get someone...",
  "data/redirect-devtop/2020/7/406256.json": "JWT Tokens are awesome, but how do you store them securely in your front-end? We'll go over...",
  "data/redirect-devtop/2020/7/401257.json": "Overview   This documentation will help identify the trade-offs of the different React patte...",
  "data/redirect-devtop/2020/7/410847.json": "A commit message is a short description of the changes you've made to a file added before committing...",
  "data/redirect-devtop/2020/7/392700.json": "GitHub recently released a feature that allows users to create a profile-level README to display prominently on their GitHub profile. This article walksthrough how to access this new feature. I'll also be sharing some fun GitHub profiles I've seen so far.",
  "data/redirect-devtop/2020/7/383961.json": "Redux was a revolutionary technology in the React ecosystem.  It enabled us to have a global store wi...",
  "data/redirect-devtop/2020/7/378964.json": "Introduction   These are 8 projects with requirements and designs that you can do to become...",
  "data/redirect-devtop/2020/7/382321.json": "Hi there!  The reason why you're here is probably because you wanna know what I did to load my portfo...",
  "data/redirect-devtop/2020/7/400023.json": "Need some ideas for things to build and practice your web dev push-ups? Check out these 10 API's that might inspire your next project. ",
  "data/redirect-devtop/2020/7/380582.json": "— \"Hey, it's me. Listen up, I don't have much time.\"  — \"Wait, what?! What is happening?! Who are-How...",
  "data/redirect-devtop/2020/7/394492.json": "If you’re intermediate beginner web developer, you have probably run into the wall. The basic tutoria...",
  "data/redirect-devtop/2020/7/378839.json": "Now a days everyone is obsessed with the frameworks, but here I’ve listed down some JavaScript tutori...",
  "data/redirect-devtop/2020/7/407523.json": "My good friend and colleague @bdougieyo is at Codeland today and is giving away early access to Codes...",
  "data/redirect-devtop/2020/7/393076.json": "This past week I had an opportunity to browse through a company's coding guideline, some of which I f...",
  "data/redirect-devtop/2020/7/413857.json": "Shell is the essential tool for every programmer. The more familiar you become with the available too...",
  "data/redirect-devtop/2020/7/391879.json": "Serie of sketchnotes about Docker. Explaining in a visual way Docker principles.",
  "data/redirect-devtop/2020/7/411025.json": "I started to learn Javascript about a year ago, there are so many online tutorials, blogs, courses an...",
  "data/redirect-devtop/2020/7/404899.json": "A continuously-evolving compendium of JavaScript tips based on common areas of confusion or misunderstanding.",
  "data/redirect-devtop/2020/7/404875.json": "There are a lot of discussions about CSS vs. JavaScript and the battle is getting seriously once CSS..."
}