{
  "data/redirect-devtop/2022/7/1129640.json": "These are the Top YouTube Downloaders for this Year In 2021, the following YouTube video graber tools...",
  "data/redirect-devtop/2022/7/1129377.json": "Bootstrap is an amazing CSS framework for those who struggle with design, css, or need to build...",
  "data/redirect-devtop/2022/7/1129536.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/7/1129344.json": "Anyone who has worked in JavaScript frameworks knows what an npm package is? And how important it is?...",
  "data/redirect-devtop/2022/7/1129479.json": "It always starts with something small, then you get excited and it grows to something big and later...",
  "data/redirect-devtop/2022/7/1129244.json": "As some of you loyal readers might know, I'm a big fan of optimizing the web.  As mentioned in the...",
  "data/redirect-devtop/2022/7/1129537.json": "Open-Source starter built on top of React and Firebase - Horizon UI comes with social login via Google.",
  "data/redirect-devtop/2022/7/1129304.json": "React is one of the trending and most popular client-side libraries for developing painless...",
  "data/redirect-devtop/2022/7/1129773.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/7/1129556.json": "So how is Svelte any different from other frameworks like Angular, React, vue and why should we care?...",
  "data/redirect-devtop/2022/7/1130210.json": "How to Make a Gaming Website Using Html CSS JavaScript  This video will show you how to make a...",
  "data/redirect-devtop/2022/7/1129384.json": "The time has come once again to evaluate a new Javascript framework…but wait. This isn’t your run of...",
  "data/redirect-devtop/2022/7/1130204.json": "Let's checkout some shorthand tips and other tricks. Remember, some of these might not seems relevant...",
  "data/redirect-devtop/2022/7/1130213.json": "Just over a year ago, I made a post on Twitter, and I realized that I had forgotten to add alternate...",
  "data/redirect-devtop/2022/7/1130046.json": "sometimes, i am finding data in mongoose collection it give mongoose document but when we use lean...",
  "data/redirect-devtop/2022/7/1129483.json": "Git commit messages are how we communicate to our future selves. They help you understand why a...",
  "data/redirect-devtop/2022/7/1129785.json": "Many of you here on DEV have come to know and love two of our original podcasts: DevDiscuss and...",
  "data/redirect-devtop/2022/7/1130300.json": "Learning to ask what you think are stupid questions is not easy. Asking \"stupid\" questions requires a...",
  "data/redirect-devtop/2022/7/1130580.json": "GitHub is the dominant player in hosting Software Projects on the web. With 200 M+ public...",
  "data/redirect-devtop/2022/7/1130584.json": "⚡ This post contaians all the living emoji's which you can use anywhere.   🤗 I have made it simple...",
  "data/redirect-devtop/2022/7/1130426.json": "What is Docker?   Docker is an open-source containerization platform used to build, test,...",
  "data/redirect-devtop/2022/7/1130439.json": "It was during the initial days when I was learning Javascript, I always used to be struck at a point...",
  "data/redirect-devtop/2022/7/1130710.json": "Saying the above out loud is almost like publicly admitting you've got lepra today, because all the...",
  "data/redirect-devtop/2022/7/1129543.json": "danielbellmas        /          danielbellmas                       ...",
  "data/redirect-devtop/2022/7/1130219.json": "Enums, short for Enumerations, are preset constants which can be defined by a developer for use...",
  "data/redirect-devtop/2022/7/1130573.json": "As the younger generation of developers are now graduates and looking for their full-time jobs, the...",
  "data/redirect-devtop/2022/7/1130564.json": "After commiting changes and editing for continuously four hours, I finally finished my GitHub Profile...",
  "data/redirect-devtop/2022/7/1130828.json": "How to create a reusable and generic TabBar components in React / TypeScript ",
  "data/redirect-devtop/2022/7/1130920.json": "I was reading a Tweet from my friend Amy on Twitter where they put out a Twitter poll that is...",
  "data/redirect-devtop/2022/7/1131365.json": "A few days back I went through an open-source project blog-cover which is designed to build cover...",
  "data/redirect-devtop/2022/7/1130905.json": "This week's VS Code Tip off the Week is the Thunder Client extension.   Thunder Client is a...",
  "data/redirect-devtop/2022/7/1129795.json": "Three days ago, Deno announced their new full stack web framework called Fresh. The framework looks...",
  "data/redirect-devtop/2022/7/1131540.json": "State is an essential part of our React application, hence, the need to pass to different components....",
  "data/redirect-devtop/2022/7/1130991.json": "One of the most frequent tasks we have to perform in Javascript is to remove a particular item from...",
  "data/redirect-devtop/2022/7/1131602.json": "In Yountville Napa Valley there's a restaurant called \"The French Laundry\". It's got a Michelin star,...",
  "data/redirect-devtop/2022/7/1132172.json": "You might need to determine if an object holds a particular property.  Let's say we have a user...",
  "data/redirect-devtop/2022/7/1132123.json": "Disclaimer - PLEASE READ THE WHOLE ARTICLE BEFORE YOU START FIRING PEOPLE!  As the CEO of a software...",
  "data/redirect-devtop/2022/7/1131971.json": "Are you starting a new project, learning a new technology, or building a new feature and you already...",
  "data/redirect-devtop/2022/7/1131986.json": "Preview   Hello everyone, I wanted to share with you a mini portfolio that I am starting to...",
  "data/redirect-devtop/2022/7/1132621.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/7/1131364.json": "When I rewrote my website in Astro, I decided to make it an open source project.  But let's dive into...",
  "data/redirect-devtop/2022/7/1132794.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/7/1131272.json": "I was surprised to see that, with my busy June schedule, a full month has passed since my last blog!...",
  "data/redirect-devtop/2022/7/1132797.json": "Introduction   Typescript is gaining more followers day-by-day. The type-safe cousin of...",
  "data/redirect-devtop/2022/7/1132222.json": "Estou lendo um livro muito legal do renomado Venkat Subramaniam : \"Functional Programming in Java:...",
  "data/redirect-devtop/2022/7/1133110.json": "In JavaScript, we work a lot with Objects, and you'll have to modify some of the object data from...",
  "data/redirect-devtop/2022/7/1133254.json": "Speed Code Video https://twitter.com/asyrafhussin4/status/1544623076863664128",
  "data/redirect-devtop/2022/7/1132336.json": "One of the main core values of Novu is transparency with our community, team members, partners, and...",
  "data/redirect-devtop/2022/7/1131508.json": "A while ago I migrated from VS Code to WebStorm, and it’s been great. Like all JetBrains IDEs, it...",
  "data/redirect-devtop/2022/7/1133850.json": "Introduction   “Who’s that Pokemon?” should bring memories for most people. If you don’t..."
}