{
  "data/redirect-devtop/2022/6/1101593.json": "If you are a JavaScript developer this should terrify you.   Because when I work with developers, the...",
  "data/redirect-devtop/2022/6/1101897.json": "Join us in collecting stories of LGBTQIA+ pride — we'll donate $10 for every #devpride story received. ",
  "data/redirect-devtop/2022/6/1101784.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/6/1101878.json": "No coder is an island.  This week's DevDiscuss episode is a good one if you want to succeed in your...",
  "data/redirect-devtop/2022/6/1102982.json": "Cloud cost management is tricky for many companies, especially when using cloud-native technologies...",
  "data/redirect-devtop/2022/6/1102117.json": "The common theme across our recent Forem highlights is that DEV can serve as a really effective town...",
  "data/redirect-devtop/2022/6/1102490.json": "As developers we have had to set up our development environment from scratch at least once.   Whether...",
  "data/redirect-devtop/2022/6/1101401.json": "Components are a major part of any react project - from buttons to dropdowns to form components....",
  "data/redirect-devtop/2022/6/1102140.json": "The practically important problem in computational mathematics is computing the eigenvalues of a...",
  "data/redirect-devtop/2022/6/1102652.json": "In this post let's talk about the paradigm shift from lifecycle methods to state synchronization and...",
  "data/redirect-devtop/2022/6/1102988.json": "When it comes to using external libraries, sometimes you can't find exactly what you need, and there...",
  "data/redirect-devtop/2022/6/1103483.json": "I graduated from my SWE degree around 6 years ago (almost to the date). The uni I went to wasn’t one...",
  "data/redirect-devtop/2022/6/1103299.json": "This weekly roundup highlights what we believe to be the most thoughtful and/or interesting...",
  "data/redirect-devtop/2022/6/1102158.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/6/1103301.json": "A couple weeks ago we wrapped up the Mayfield + DEV Discussion Series, where over 500 people...",
  "data/redirect-devtop/2022/6/1101584.json": "An array is one of the most common concepts of Javascript, which gives us a lot of possibilities to...",
  "data/redirect-devtop/2022/6/1103607.json": "Let's set one thing straight before we even dive into the article.  Divs are not buttons!  Yes, they...",
  "data/redirect-devtop/2022/6/1103646.json": "I'm pretty frustrated about this lately, I want to develop something out of the box, but all I see on...",
  "data/redirect-devtop/2022/6/1103917.json": "Hello everyone i recenlty written a TODO System with Hexagonal Architecture written in Go, with test...",
  "data/redirect-devtop/2022/6/1104752.json": "Exceptions, Exceptions, Exceptions... We see them constantly during development and support of...",
  "data/redirect-devtop/2022/6/1104618.json": "Hello Coders 👋  For past few weeks, I've been working on a web extension 🌎 for Chromium Base...",
  "data/redirect-devtop/2022/6/1103676.json": "Hello Everyone,  So I have been wanting to ask which is better, being a generalist developer or a...",
  "data/redirect-devtop/2022/6/1102975.json": "As a developer, I am constantly on the lookout for solutions that can help me improve my daily...",
  "data/redirect-devtop/2022/6/1103855.json": "Ciao! 👋  Did you miss us the past week? We are back in full-force to share what we have been cooking...",
  "data/redirect-devtop/2022/6/1104742.json": "This article will explain how you can build a file previewer in React that works for images and...",
  "data/redirect-devtop/2022/6/1104600.json": "Hey guys, I'm Sam Zhang.  Recently I've updated my portfolio site. Originally I used LogTure as my...",
  "data/redirect-devtop/2022/6/1101455.json": "Hello DEV community,  Right now I'm currently looking for my first developer job.  Here are my skills...",
  "data/redirect-devtop/2022/6/1104942.json": "I know some projects like Pi-hole and Kodi, but what super cool on Raspberry Pi 4 to...",
  "data/redirect-devtop/2022/6/1103920.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/6/1104810.json": "This blog mainly talks about the anti-patterns of building microservice architecture systems.  A...",
  "data/redirect-devtop/2022/6/1103447.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/6/1104961.json": "Finally, I have clicked the blue 'Write your first post now' button on the dev.to/dashboard page....",
  "data/redirect-devtop/2022/6/1105534.json": "Give a quick description of what you're up to and what some recent challenges have been.  Anyone who...",
  "data/redirect-devtop/2022/6/1105517.json": "A website is systematically stealing loads of articles published on DEV, this is what you can and...",
  "data/redirect-devtop/2022/6/1105319.json": "Do you usually use semicolon when you program? And why?  In my case, I don't use semicolon. I know...",
  "data/redirect-devtop/2022/6/1105226.json": "This is super open ended, but what are you all currently struggling with? Doesn't have to be code...",
  "data/redirect-devtop/2022/6/1102700.json": "First of all, I discussed privately with everyone to find a solution. We agreed on something, BUT the...",
  "data/redirect-devtop/2022/6/1105514.json": "When you're writing code, it's important to be mindful of your coding practices. This means taking...",
  "data/redirect-devtop/2022/6/1106249.json": "Welcome to the second Meme Monday post! Today's cover image comes from my favorite submission from...",
  "data/redirect-devtop/2022/6/1105349.json": "50 Projects In 50 Days — HTML, CSS &amp; JavaScript            Why did it take this...",
  "data/redirect-devtop/2022/6/1104650.json": "A post by Kostaintyn Naddur",
  "data/redirect-devtop/2022/6/1105497.json": "Are you looking ideas for web development to increase your skills?  Here is 40 projects ideas for web...",
  "data/redirect-devtop/2022/6/1104103.json": "Table of Contents    Introduction Shallow Copy Deep Copy Summary References           ...",
  "data/redirect-devtop/2022/6/1106258.json": "Recently, I wrote a post Talk to people who are on the same site 🌎 | Chrome Extension. Where I talked...",
  "data/redirect-devtop/2022/6/1105228.json": "Often while debugging, beginners use the console.log() method to print out values. But there are a...",
  "data/redirect-devtop/2022/6/1105917.json": "We stand on the shoulders of giants. And FontAwesome, you were a big giant. But it's time to say goodbye.",
  "data/redirect-devtop/2022/6/1106067.json": "Why am I writing this down? Maybe you are one of those crazy people who are contemplating using vim...",
  "data/redirect-devtop/2022/6/1106273.json": "You need to understand Python well before you can write idiomatic, or pythonic code in it.  But what...",
  "data/redirect-devtop/2022/6/1106351.json": "Experimenting with ultrasonic data transmission in JavaScript, as a payment method.",
  "data/redirect-devtop/2022/6/1107355.json": "Hey guys, I made an admin template for React &amp; Chakra UI based on the latest UI trends! Use it...",
  "data/redirect-devtop/2022/6/1107387.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/6/1106795.json": "I don't know if you've ever encountered an if-else nesting like a pyramid placed horizontally:    if...",
  "data/redirect-devtop/2022/6/1106352.json": "The team at Remix are building a web framework that is built on the priniciples of React Router and...",
  "data/redirect-devtop/2022/6/1107114.json": "It's hard to calculate the time you will need to finish the task, but it is equally important. Let's...",
  "data/redirect-devtop/2022/6/1106286.json": "cover image credits: Laurent Hrybyk  In this weekly series, folks can chime in and drop links to...",
  "data/redirect-devtop/2022/6/1106278.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/6/1106143.json": "The meaning behind different LGBTQ+ flags and how to code them with CSS and a single HTML element.",
  "data/redirect-devtop/2022/6/1105459.json": "Hey folks! 👋 Today, in this post we will look at one of the important concepts of JavaScript and that...",
  "data/redirect-devtop/2022/6/1105931.json": "This is a short blog on setting up a project with NextJS, EsLint, prettier and husky.   Next.js is a...",
  "data/redirect-devtop/2022/6/1107838.json": "I read an interesting post in which the author stated the reasons why they were officially done with...",
  "data/redirect-devtop/2022/6/1107470.json": "Hi, I'm planning to build a full stack application. I have plan to scale the application and make it...",
  "data/redirect-devtop/2022/6/1107492.json": "So I want to try out a coding challenge website, and I don’t know which one to try. What coding...",
  "data/redirect-devtop/2022/6/1108220.json": "As a member of the DEV team, I love reading what our community is writing.  There's career advice,...",
  "data/redirect-devtop/2022/6/1108477.json": "Today I am highlighting a new Forem dedicated to the success of contributors, maintainers and OSS...",
  "data/redirect-devtop/2022/6/1108433.json": "Ever wonder what it takes to get your conference talk accepted? In this episode of DevDiscuss we talk...",
  "data/redirect-devtop/2022/6/1108180.json": "When we first showed the world Novu (an open-source notification infrastructure) we were amazed by...",
  "data/redirect-devtop/2022/6/1109220.json": "According to Atwood's Law, \"Any application that can be written in JavaScript, will eventually be...",
  "data/redirect-devtop/2022/6/1108430.json": "Why are CSS frameworks so used?   I mean, why*??? 🤣  I don't particularly love them, they...",
  "data/redirect-devtop/2022/6/1108422.json": "Between 2016 and 2018 I maintained an open-source project with +800k downloads/month. I learned six...",
  "data/redirect-devtop/2022/6/1108531.json": "I think it's easy to take for granted that the web and all of its wonderful applications are built by...",
  "data/redirect-devtop/2022/6/1108526.json": "Writing efficient code isn't always easy, but it can be done. Here are five ways to program more...",
  "data/redirect-devtop/2022/6/1109237.json": "I'm a person who really enjoys having a partner to work on stuff with. Maybe there is some obscure...",
  "data/redirect-devtop/2022/6/1109269.json": "In this blog i will try to explain redux library without react. Just Redux.   Why? Because if we...",
  "data/redirect-devtop/2022/6/1109245.json": "Often you may be building a demo website, or practice project and you need some data for it. As an...",
  "data/redirect-devtop/2022/6/1109009.json": "Hello Everyone,  Today let's implement our own version of the map() and reduce() array methods in...",
  "data/redirect-devtop/2022/6/1108493.json": "Table of Content      📌 Introduction  📌 Git Terminologies  📌 Setup of Git and Github on...",
  "data/redirect-devtop/2022/6/1110113.json": "An age old debate about package managers   Each have their pros &amp; their cons   I...",
  "data/redirect-devtop/2022/6/1108167.json": "First of all, let’s break down some key concepts that will become useful to continue reading this...",
  "data/redirect-devtop/2022/6/1110678.json": "Hello everyone, for a while (a few months) I came up with the idea of developing my own JavaScript...",
  "data/redirect-devtop/2022/6/1105959.json": "In this tutorial, you will learn in a few short steps how to create a scroll to top button with CSS...",
  "data/redirect-devtop/2022/6/1108692.json": "While we work to advance our careers and push limits, we must remember to be kind to others and...",
  "data/redirect-devtop/2022/6/1109288.json": "Being the fun-loving guy and absolute geek that I am, I've always looked for ways to use tech to...",
  "data/redirect-devtop/2022/6/1110986.json": "If you’re not a fan of writing manual css then Tailwindcss can save you a lot of time.  And it’s...",
  "data/redirect-devtop/2022/6/1110333.json": "In this week’s post join me as I give jest-preview, a tool for debugging your Jest tests in the...",
  "data/redirect-devtop/2022/6/1110852.json": "I often get asked about how to find Open Source projects to contribute to. In this post, I’ll show...",
  "data/redirect-devtop/2022/6/1110959.json": "React Js is one of the most popular front-end frameworks to use these days.  It is playing an...",
  "data/redirect-devtop/2022/6/1108722.json": "I am currently a few weeks post-coding bootcamp and am beginning to navigate the world of technical...",
  "data/redirect-devtop/2022/6/1110351.json": "Whether you are starting from scratch or switching from another platform, we have you covered when deploying SolidJS to Netlify.",
  "data/redirect-devtop/2022/6/1111735.json": "👋, I am here with another list. In this post I have enlisted 15 aesthetic color gradients using CSS...",
  "data/redirect-devtop/2022/6/1109853.json": "From time to time you'll want to share your locally running app with some folks before it's ready to...",
  "data/redirect-devtop/2022/6/1111301.json": "I've relied mostly on Vanilla CSS and SASS/SCSS so far and have my own components/styles which I can...",
  "data/redirect-devtop/2022/6/1110402.json": "Table of contents    Fundamentals Variables Data...",
  "data/redirect-devtop/2022/6/1111844.json": "10 JavaScript features you should adopt today",
  "data/redirect-devtop/2022/6/1111981.json": "🎇Netlify.com 🎇Firebase 🎇Vercel.com 🎇GitHubPages 🎇Surge.sh 🎇Render.com 🎇Amazone Web hosting 🎇Google...",
  "data/redirect-devtop/2022/6/1110373.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/6/1109273.json": "Fala moçada, beleza? No artigo de hoje vamos falar um pouco sobre produtividade. Esse tema é muito...",
  "data/redirect-devtop/2022/6/1112245.json": "Give a quick description of what you're up to and what some recent learnings have been.",
  "data/redirect-devtop/2022/6/1110966.json": "Developers keep on doing it great and breaking through different levels everyday, with their logic ,...",
  "data/redirect-devtop/2022/6/1111623.json": "ReactJS is a javascript library used to build user interfaces.  Understanding the life cycle of a...",
  "data/redirect-devtop/2022/6/1112871.json": "Welcome to the second Meme Monday post! Today's cover image comes from my favorite submission from...",
  "data/redirect-devtop/2022/6/1103923.json": "Difference between var, let and const   In JavaScript, variables are assigned using three...",
  "data/redirect-devtop/2022/6/1112003.json": "It's 👉this close👈 to becoming a reality, and you can get a sneak peek today.",
  "data/redirect-devtop/2022/6/1111744.json": "Firstly I would like to thanks @isabelcmdcosta for the post idea.  As a beginner we all want to...",
  "data/redirect-devtop/2022/6/1112290.json": "Brief Origin of where the hype began   On the 29th of May, 2013, the pain of building...",
  "data/redirect-devtop/2022/6/1111345.json": "PNPM is said to be most efficient package manager. I'm also thinking to switch from slower npm to...",
  "data/redirect-devtop/2022/6/1112815.json": "Do you remember all that long nights when you were working on your outstanding projects? Maybe it's...",
  "data/redirect-devtop/2022/6/1112013.json": "Overall, being a software engineer is great. I'm grateful for being a software engineer, and I...",
  "data/redirect-devtop/2022/6/1112773.json": "Introduction   This is a self-contained example of a real-time chart powered by Deno, Web...",
  "data/redirect-devtop/2022/6/1112906.json": "cover image source: colorlessmidnight  In this weekly series, folks can chime in and drop links to...",
  "data/redirect-devtop/2022/6/1113285.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/6/1112648.json": "I know people make all kinds of stuff with &lt;canvas&gt; but that's all black magic to me. Time to...",
  "data/redirect-devtop/2022/6/1113110.json": "Spoiler: a query ficou 23x mais rápida com CTE's apenas transformando o problema quadrático em...",
  "data/redirect-devtop/2022/6/1114122.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/6/1112889.json": "Table of Content      📌 Introduction  📌 Why this configuration 🤔?  📌 Configuration 🛠   👉...",
  "data/redirect-devtop/2022/6/1112796.json": "Switching to VS Codium does not require much effort. You just need to install it and copy your...",
  "data/redirect-devtop/2022/6/1112787.json": "In the emerging Cloud-Native environment, Kubernetes is everywhere without any question. It has...",
  "data/redirect-devtop/2022/6/1113955.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/6/1113717.json": "Meet Wasp: a new programming language for developing full-stack web apps with less code.  Wasp is a...",
  "data/redirect-devtop/2022/6/1114413.json": "A few months ago, I wrote a DEV post about resolving merge commits. The resounding feedback I...",
  "data/redirect-devtop/2022/6/1114982.json": "Preamble: We've been running an experimental project to catalog good evergreen guides on DEV. Some...",
  "data/redirect-devtop/2022/6/1114754.json": "Docker gives developers the ability to package all of their applications inside of containers. These...",
  "data/redirect-devtop/2022/6/1113672.json": "follow me  (https://github.com/dan3266)",
  "data/redirect-devtop/2022/6/1114691.json": "I have created a collection of 24 x 24 dp SVG spinners! Use them for free!  I'll be adding new...",
  "data/redirect-devtop/2022/6/1115220.json": "A special comic for Internet Explorer’s end-of-life",
  "data/redirect-devtop/2022/6/1112887.json": "There are many ways to iterate in JavaScript. Let's look at the most common ones.",
  "data/redirect-devtop/2022/6/1113080.json": "Hey folks!  I'd like to talk about the position property! We'll consider all nuances that confuse...",
  "data/redirect-devtop/2022/6/1115326.json": "I've been to every CodeLand — well before I was officially involved in it. It's been one of the best...",
  "data/redirect-devtop/2022/6/1113678.json": "Git vs GitHub is one of the things that beginners find tough to understand. So in order to understand...",
  "data/redirect-devtop/2022/6/1115766.json": "ESLint and Prettier are pretty much the two most popular tools when it comes to doing code analysis...",
  "data/redirect-devtop/2022/6/1113919.json": "This tutorial will teach you how to set up a Django project and create an API that will return the...",
  "data/redirect-devtop/2022/6/1114757.json": "Design patterns in microservices: API Gateway, Backend for Frontend, Event-Driven...",
  "data/redirect-devtop/2022/6/1115614.json": "Speed Code Video https://twitter.com/asyrafhussin4/status/1526580125113864193",
  "data/redirect-devtop/2022/6/1114776.json": "Networking in Kubernetes is no easy task. Whether you’re on the application side or the operations...",
  "data/redirect-devtop/2022/6/1113967.json": "Hello everybody, this is my first article, so feel free to comment on how can i get better, I will...",
  "data/redirect-devtop/2022/6/1116059.json": "Okay, so here's how you can get a free ccTLD Domain name.  ( Warning : Only use these domains for...",
  "data/redirect-devtop/2022/6/1115293.json": "Boost your productivity by closing the VSCode Sidebar",
  "data/redirect-devtop/2022/6/1115994.json": "Regular Expressions are really powerful but do you know how to use them and what to use them for? This primer will take you through your first steps to some really advanced looking patterns.",
  "data/redirect-devtop/2022/6/1116393.json": "Hello and welcome to a new blog post ! Today we will talk about compilers and how you can write one...",
  "data/redirect-devtop/2022/6/1114920.json": "Showing my Work as I Query a Forem Instance   This builds on work from my Walk Through of...",
  "data/redirect-devtop/2022/6/1116350.json": "Learning how to code can be challenging, but following the advice of more experienced developers can...",
  "data/redirect-devtop/2022/6/1116141.json": "Developers don't talk much. Their code does all the talking. So here's a minimal landing page for...",
  "data/redirect-devtop/2022/6/1115802.json": "Interested in some great extensions for Visual Studio Code that will make your web development life...",
  "data/redirect-devtop/2022/6/1114995.json": "I recently started learning Go after going through a lot of articles talking about all the awesome...",
  "data/redirect-devtop/2022/6/1116370.json": "A couple months ago, I wrote a blog Introducing Cakecutter, which was, essentially, a modular version...",
  "data/redirect-devtop/2022/6/1113941.json": "An ecommerce storefront should provide users with the best experience to facilitate their purchases....",
  "data/redirect-devtop/2022/6/1116737.json": "Of course, I couldn't resist recreating my employer's logo in CSS. We are talking, of course, about...",
  "data/redirect-devtop/2022/6/1117187.json": "This is totally up for debate, so I figured I'd ask.",
  "data/redirect-devtop/2022/6/1116337.json": "Mistakes help us grow, What was your one mistake that you want others not to do that?",
  "data/redirect-devtop/2022/6/1116583.json": "Hey, yall!  I've been talking to folks about how they've maintained relationships with folks and...",
  "data/redirect-devtop/2022/6/1117404.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/6/1117778.json": "Open-Source full-stack starter crafted on top of Chakra UI, react, and powered by a simple NodeJS API Server.",
  "data/redirect-devtop/2022/6/1114533.json": "Table of Contents.    📌 Introduction  📌 Technologies to use  📌 Creating the project  📌 First...",
  "data/redirect-devtop/2022/6/1117688.json": "I'm pretty sure everyone has seen this one before, the Instagram logo.  For reference, it's the...",
  "data/redirect-devtop/2022/6/1117782.json": "Hoisting            What is Hoisting in JavaScript?   When the JavaScript engine executes...",
  "data/redirect-devtop/2022/6/1116886.json": "Join me in this week’s post as I try Cypress 10’s component testing. Although in Beta, this is a huge...",
  "data/redirect-devtop/2022/6/1116748.json": "We all try to choose the best tools for the job, but occasionally we may fall short. When did you...",
  "data/redirect-devtop/2022/6/1117499.json": "When I started learning how to code, the first two languages I learned were HTML and CSS. Like most...",
  "data/redirect-devtop/2022/6/1117949.json": "Axios is a very popular http client in the community responsible for making http requests to third...",
  "data/redirect-devtop/2022/6/1117679.json": "Defining functions Python can also be used for functional programming as it can for structural...",
  "data/redirect-devtop/2022/6/1118358.json": "frameworks are overrated, let's use HTML!            Intro   Jokes apart, this blog is about yet...",
  "data/redirect-devtop/2022/6/1118748.json": "Give a quick description of what you're up to and what some recent learnings have been. This series...",
  "data/redirect-devtop/2022/6/1117830.json": "There seems to be a large misconception from a lot of aspiring devs that memorizing standard...",
  "data/redirect-devtop/2022/6/1118649.json": "I very recently wrote my very first post on dev.to - DEV Community, and there I mentioned integrating...",
  "data/redirect-devtop/2022/6/1118342.json": "The Chromium Dev Tools provides a powerful toolset for debugging and testing web apps, but most...",
  "data/redirect-devtop/2022/6/1118371.json": "In today's article, we'll recreate the iconic Nike swoosh logo.  For reference, this is what the logo...",
  "data/redirect-devtop/2022/6/1117784.json": "Hey guys I have been coding for a while now, I personally prefer listening to music while coding. I...",
  "data/redirect-devtop/2022/6/1118529.json": "In this article, I am going to tell about the main differences between motivation and discipline and...",
  "data/redirect-devtop/2022/6/1118509.json": "Well hello there! My name is Elly Loel. I'm a developer, designer and writer, currently working as a...",
  "data/redirect-devtop/2022/6/1117656.json": "If you have stumbled to this post .. I can bet you love python ... And when you love something you...",
  "data/redirect-devtop/2022/6/1118176.json": "Hi 👋, If you have opened this post, for sure the word FAMOUS must have caught your attention. I know,...",
  "data/redirect-devtop/2022/6/1116707.json": "Table of Content      📌 Introduction  📌 Introduction to TypeScript   ➡ Variables  ➡...",
  "data/redirect-devtop/2022/6/1118727.json": "Here's a new free book on Go. You can either download it from LeanPub or read it online",
  "data/redirect-devtop/2022/6/1118712.json": "Lets Create a Google chrome extension with ReactJS by using the Plasmo framework. The Plasmo...",
  "data/redirect-devtop/2022/6/1119004.json": "I have been working with typescript for almost a year now, and I have learned and implemented a lot...",
  "data/redirect-devtop/2022/6/1119354.json": "Welcome to another Meme Monday post! Today's cover image comes from my favorite submission from last...",
  "data/redirect-devtop/2022/6/1118654.json": "It was my first time getting an interview at any FAANG company. The position was for SD II Fullstack...",
  "data/redirect-devtop/2022/6/1118547.json": "Contents    Inspiration Prerequisites Setup Webpack basics Sample App and...",
  "data/redirect-devtop/2022/6/1119093.json": "This one was requested during the previous series. And I put it on my list but dreaded creating...",
  "data/redirect-devtop/2022/6/1119351.json": "Hi readers 👋, thank you for spending few minutes of the day, reading my article.   I have recently...",
  "data/redirect-devtop/2022/6/1119095.json": "My step-by step guide to set up Prettier in any project, and integrate it with ESLint and...",
  "data/redirect-devtop/2022/6/1117535.json": "Are you ready to ditch the office and have the freedom to work from anywhere? Fortunately, there are...",
  "data/redirect-devtop/2022/6/1119310.json": "✅The following 4 regex patterns can help you to write almost any password...",
  "data/redirect-devtop/2022/6/1119817.json": "using html {color-scheme: dark light;} you can force the browser to show the page differently for users with different modes enabled",
  "data/redirect-devtop/2022/6/1119970.json": "Hello, buddies! Most of us (developers) love to listen to music. But why? You may have many answers....",
  "data/redirect-devtop/2022/6/1117966.json": "We are pleased to announce the latest major version of the NgRx framework with some exciting new...",
  "data/redirect-devtop/2022/6/1119803.json": "In React we all must have used useEffect hook which runs after performing DOM updates and helps us to...",
  "data/redirect-devtop/2022/6/1119816.json": "Hooks are new features incorporated into React 16.8. and the newer versions. They basically help you...",
  "data/redirect-devtop/2022/6/1119812.json": "Why do I need to learn Data Structures and Algorithms in the first place? Will I use them in my...",
  "data/redirect-devtop/2022/6/1119586.json": "At Consensus 2022, Jack Dorsey said that TBD, Block's Bitcoin division, is working on a new...",
  "data/redirect-devtop/2022/6/1121063.json": "Before the cloud, engineers could only dream about allocating servers without involving anyone on the...",
  "data/redirect-devtop/2022/6/1120654.json": "Who wouldn't like a free CDN for their website images. Well here's how you can get it.  Just take...",
  "data/redirect-devtop/2022/6/1120389.json": "Pull requests slow down continuous delivery when used as part of standard code changes in software...",
  "data/redirect-devtop/2022/6/1120714.json": "Would you be interested in knowing which politician has made the most headlines? Do you want to see...",
  "data/redirect-devtop/2022/6/1119975.json": "If you are looking for a component library for your next project, there are tons of options for you...",
  "data/redirect-devtop/2022/6/1113328.json": "Thanks to Cyclic.sh for sponsoring this article!   After a long day of programming, I came back...",
  "data/redirect-devtop/2022/6/1116865.json": "Routing is the ability to move between different parts of an application when a user enters a URL or...",
  "data/redirect-devtop/2022/6/1121231.json": "Automated testing during software development involves many different techniques, one that shouldn’t...",
  "data/redirect-devtop/2022/6/1121021.json": "✨jam-icons. com ✨smashicons. com ✨streamlineicons. com ✨www.flaticon. com ✨feathericons...",
  "data/redirect-devtop/2022/6/1121443.json": "Today Google Chrome 103 got released with a bunch of new features. One of the notable features is the...",
  "data/redirect-devtop/2022/6/1121503.json": "While being aware of our struggles and finding healthy coping mechanisms are necessary, we receive...",
  "data/redirect-devtop/2022/6/1121210.json": "1. TypeScript makes code easier to read and understand.   When you use TypeScript, you can...",
  "data/redirect-devtop/2022/6/1121234.json": "Have you ever tried to browse http://yoursite.com/.git/?  If you get a 403 error, that's normal. It...",
  "data/redirect-devtop/2022/6/1121139.json": "Benefits of thanking sponsors   Slowly but surely, people are starting to acknowledge the...",
  "data/redirect-devtop/2022/6/1120659.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/6/1122065.json": "Git is a prevalent version control system ( VCS ) used by most programmers. In this blog, I am going...",
  "data/redirect-devtop/2022/6/1122070.json": "Software development is unpredictable but people waste hours every week trying to guess how long...",
  "data/redirect-devtop/2022/6/1121752.json": "note: We published a version of this article last year. You can read it here.     Today, June 23,...",
  "data/redirect-devtop/2022/6/1119080.json": "Hi, my name is Julia, and I'm a self-taught Accessibility &amp; Frontend Developer in my 30s who is...",
  "data/redirect-devtop/2022/6/1120073.json": "While browsing through my apps, I noticed the Strava logo would make a perfect candidate for this CSS...",
  "data/redirect-devtop/2022/6/1121512.json": "Website to create wireframes -...",
  "data/redirect-devtop/2022/6/1120650.json": "An introduction to the VueJs Javascript framework, it's concepts, use cases and sample start code.",
  "data/redirect-devtop/2022/6/1122566.json": "Each week, around 300 blazing-fast, game-changing, full-stack JavaScript frameworks are released into...",
  "data/redirect-devtop/2022/6/1122551.json": "I hear a lot of people saying that web performance is hard. Honestly, I don't think that's true. It...",
  "data/redirect-devtop/2022/6/1122242.json": "Writing code that does the job is easy. Writing a beautiful code that is worthy of being called clean...",
  "data/redirect-devtop/2022/6/1112855.json": "Why RUST is a good language to learn   RUST has great tooling. The RUST compiler, Cargo, is...",
  "data/redirect-devtop/2022/6/1122312.json": "I have been working on a project with Next.js since last month and used the console.log statement in...",
  "data/redirect-devtop/2022/6/1121053.json": "The Strava logo from the previous article inspired me to try and recreate the Vue logo. It uses...",
  "data/redirect-devtop/2022/6/1122531.json": "Hey everyone,   TL;DR - Our team is struggling with good technical analysis and planning for new...",
  "data/redirect-devtop/2022/6/1121057.json": "React front-end design and development feedback for some important \"npm\" packages that will play a...",
  "data/redirect-devtop/2022/6/1122630.json": "Table of contents.   📌 Introduction. 📌 Technologies to be used. 📌 What is the \"Debounce\" effect? 📌...",
  "data/redirect-devtop/2022/6/1122311.json": "Sup reader!! How have you been? we going to go through different state management approaches in...",
  "data/redirect-devtop/2022/6/1121900.json": "In Developer tools, we all know that we can access any website source code in source tab...  So tell...",
  "data/redirect-devtop/2022/6/1120737.json": "TLDR:   Create this alias into your .aliases/.zshrc/.bashrc or where ever you store aliases...",
  "data/redirect-devtop/2022/6/1123288.json": "JavaScript's popularity   At the time of writing this post (Jun 2022), JavaScript is #3 in...",
  "data/redirect-devtop/2022/6/1122033.json": "A couple of weeks ago, while fiddling around with my iPhone's Control Center, I noticed a new icon:...",
  "data/redirect-devtop/2022/6/1121497.json": "It's a topic that could seem trivial at first sight, but it actually causes some controversy among...",
  "data/redirect-devtop/2022/6/1119965.json": "Rendering JSX conditionally is a very common and essential work in React. There are 4 ways in which...",
  "data/redirect-devtop/2022/6/1123327.json": "Hi, this time we will experiment with creating a simple UI component that can change color according...",
  "data/redirect-devtop/2022/6/1122822.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/6/1120480.json": "Table of Content      📌 Introduction  📌 React Props  📌 Pro Tips   ➡ Reduce HTML...",
  "data/redirect-devtop/2022/6/1124166.json": "On a web page, we typically should not disable text selection, but there are a few cases where having...",
  "data/redirect-devtop/2022/6/1122061.json": "You've probably embedded YouTube and Vimeo-videos dozens of times, using the standard...",
  "data/redirect-devtop/2022/6/1123282.json": "In this article, we are going to learn how we can send SMS or WhatsApp messages with your Node.js...",
  "data/redirect-devtop/2022/6/1124216.json": "Application Programming Interface or API is the term every developer has heard and used. From sending...",
  "data/redirect-devtop/2022/6/1123567.json": "A framework to solve any technical interview question   I have been working as a Senior...",
  "data/redirect-devtop/2022/6/1124654.json": "As an aspiring developer or designer 😎 you'll have to showcase your great projects for hiring...",
  "data/redirect-devtop/2022/6/1123576.json": "React is a popular, high-performance UI library created and maintained by Facebook. React is used...",
  "data/redirect-devtop/2022/6/1124643.json": "Hello Guyz today i am going to show you how to setup a MERN App in VScode. I have Learnt the basics...",
  "data/redirect-devtop/2022/6/1124562.json": "VS Code has a plethora of tools and commands to make your life easier. But often, people don't know...",
  "data/redirect-devtop/2022/6/1123357.json": "We read very often how to have a good architecture for a .NET project, but I don't read very often...",
  "data/redirect-devtop/2022/6/1124942.json": "The question is simple, which YouTube channels do you follow and would recommend as a...",
  "data/redirect-devtop/2022/6/1118016.json": "Hello Everyone!  Welcome to this JavaScript snippets post, In this post we will look at some of the...",
  "data/redirect-devtop/2022/6/1123613.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/6/1124343.json": "Introduction   TypeScript has grown to be one of the most popular and widely used...",
  "data/redirect-devtop/2022/6/1110837.json": "Nest post vamos dar uma introdução sobre a programação concorrente. Vamos abordar também um pouco...",
  "data/redirect-devtop/2022/6/1123830.json": "Hi! There are several ways to make a triangle in CSS3, in this post I will show one of them, using...",
  "data/redirect-devtop/2022/6/1124826.json": "Give a quick description of what you're up to and anything else you want to share.",
  "data/redirect-devtop/2022/6/1124355.json": "What is your \"what if\" plan? What is your \"back-up\" career? your \"lifeline\" if software engineering...",
  "data/redirect-devtop/2022/6/1123812.json": "React Quickstart Tutorial           Contents    Inspiration Prerequisites Setup The React...",
  "data/redirect-devtop/2022/6/1124342.json": "When we create a TypeScript project that has both a Rest Api and a web app, it becomes challenging to...",
  "data/redirect-devtop/2022/6/1125256.json": "Speed Code Video https://twitter.com/asyrafhussin4/status/1541307022297030656",
  "data/redirect-devtop/2022/6/1124645.json": "If you've more than a couple of years of experience in IT, you probably have stumbled upon the...",
  "data/redirect-devtop/2022/6/1125246.json": "Git is a great tool for managing code changes over time and allowing code to be integrated by teams...",
  "data/redirect-devtop/2022/6/1126040.json": "You can make different parts of an image clickable.  With HTML's &lt;map&gt;, you can create image...",
  "data/redirect-devtop/2022/6/1125931.json": "Some few years ago I worked for an (undisclosed) company in Cyprus. We had a dedicated software...",
  "data/redirect-devtop/2022/6/1125285.json": "I've been thinking a lot about impostor syndrome lately - when I got started in web development, I...",
  "data/redirect-devtop/2022/6/1120994.json": "DAY 35- DevOps on Amazon Web Services (AWS)  - Day Thirty five     100 days of Cloud on...",
  "data/redirect-devtop/2022/6/1125440.json": "Start with a clean project      pnpm init or npm init -y        Enter fullscreen mode    ...",
  "data/redirect-devtop/2022/6/1122336.json": "Appwrite is an open-source backend-as-a-service that provides developers with a core set of...",
  "data/redirect-devtop/2022/6/1110357.json": "Who wouldn’t love cache, right? Let’s see how we can cache data with Svelte &amp; Appwrite!  We're...",
  "data/redirect-devtop/2022/6/1125465.json": "Appwrite is an open-source backend-as-a-service that abstracts all the complexity involved in...",
  "data/redirect-devtop/2022/6/1126108.json": "I recently learnt what a reverse shell is and got excited to experiment running this kind of attack via a Node.js module. This post will go through my thought process and the different options I tried.",
  "data/redirect-devtop/2022/6/1122775.json": "In this post, I'll teach you how to boost the performance of your Next.js website. I'm going to...",
  "data/redirect-devtop/2022/6/1126524.json": "Earlier today, we held a company All Hands meeting where we shared that we’d be saying goodbye to a...",
  "data/redirect-devtop/2022/6/1126996.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/6/1125385.json": "Appwrite 0.15 is out now!🎉 We have released some amazing features, and also added a few more OAuth2...",
  "data/redirect-devtop/2022/6/1126755.json": "Open-Source starters crafted on top of Tailwind CSS and Soft Dashboard Design in Flask and Django",
  "data/redirect-devtop/2022/6/1126725.json": "Over the past few years, I've heard feedback that folks wish there was a learning journey available...",
  "data/redirect-devtop/2022/6/1122975.json": "Meaningful Variable Names    Choosing good names takes time but save more than it takes.    ...",
  "data/redirect-devtop/2022/6/1125940.json": "The Appwrite Hackathon on DEV has just concluded and one of the frequent pain points among new...",
  "data/redirect-devtop/2022/6/1126460.json": "Phone authentication is one of the most reliable authentication methods for mobile applications. And...",
  "data/redirect-devtop/2022/6/1126296.json": "Don’t Know What Appwrite Is?   Appwrite is an Open-Source BaaS, which sounds complex but is...",
  "data/redirect-devtop/2022/6/1125016.json": "You probably know not to use one single state for everything a component needs. But in avoiding that,...",
  "data/redirect-devtop/2022/6/1127494.json": "&lt;!DOCTYPE html&gt; &lt;!-- What the hell is this?? --&gt;&gt; &lt;html...",
  "data/redirect-devtop/2022/6/1127521.json": "Appwrite 0.15 was just announced and brings with it one of the most anticipated Appwrite features!...",
  "data/redirect-devtop/2022/6/1104143.json": "Index nearly everything, index early. Not indexing results in poor performances. Indexing too late...",
  "data/redirect-devtop/2022/6/1127133.json": "This is not a post where I'm going to share with you some tips on how we can manage our anxiety in...",
  "data/redirect-devtop/2022/6/1125702.json": "System design interviews are typically part of the interview process for senior-level software...",
  "data/redirect-devtop/2022/6/1127577.json": "In software development, staging is the process of testing your code in a live environment before...",
  "data/redirect-devtop/2022/6/1127780.json": "Over the previous several years, I’ve dabbled in a variety of sectors, picked up a few new skills,...",
  "data/redirect-devtop/2022/6/1127800.json": "Not all web developers are good at design, and that is OK! In the real world, you will often work...",
  "data/redirect-devtop/2022/6/1128142.json": "Lemme start by asking you a simple question -- \"Have you used react?\" or have you used any JS...",
  "data/redirect-devtop/2022/6/1126999.json": "Nx just crossed 2 million NPM downloads / week (see @nrwl/tao package on npm).                       ...",
  "data/redirect-devtop/2022/6/1127816.json": "The season 9 finale of DevDiscuss is here! Thank you so much for joining us over the past seven...",
  "data/redirect-devtop/2022/6/1126454.json": "Today, we're thrilled to announce the official release of Appwrite 0.15, including one of our most...",
  "data/redirect-devtop/2022/6/1127031.json": "Hero's Journey V1.0   Hello everybody!     This is the first working version of the python...",
  "data/redirect-devtop/2022/6/1128118.json": "In this article, I am going to give you some of the best extensions that you need to install for...",
  "data/redirect-devtop/2022/6/1128340.json": "Introduction   If you run a business or a brand, you know how important it is for you to be...",
  "data/redirect-devtop/2022/6/1128506.json": "Hi readers 👋 hope you are doing well. Today we will be talking about the OSS Fund and the first...",
  "data/redirect-devtop/2022/6/1128252.json": "Many people are following my articles and the articles of many others because they want to become...",
  "data/redirect-devtop/2022/6/1127753.json": "Medusa is the leading open source Node.js ecommerce platform for JavaScript developers. It provides...",
  "data/redirect-devtop/2022/6/1128262.json": "Developers spend a lot of time in isolation, focusing on their code and the challenges associated...",
  "data/redirect-devtop/2022/6/1128307.json": "Photo by Kolleen  Gladden on Unsplash  I recently created the website for my book \"The Art of Micro...",
  "data/redirect-devtop/2022/6/1128498.json": "Hello everyone ,In this blog we are going to see how to enable github copilot for free as student...",
  "data/redirect-devtop/2022/6/1127302.json": "The Masonry layouts once were used exclusively for image galleries.  But this kind layout is very...",
  "data/redirect-devtop/2022/6/1124208.json": "In this post, I want to share my consideration and personal opinion of the state of AWS Serverless...",
  "data/redirect-devtop/2022/6/1128830.json": "Almost all problems we developers face every day can be solved by solving a set of lesser problems —...",
  "data/redirect-devtop/2022/6/1128895.json": "I experienced my first major case of burnout this week. All the signs were there but I didn't notice...",
  "data/redirect-devtop/2022/6/1127970.json": "Helloooo everyone! 👋 It has been a while since I last posted, I have been rather busy the past 2...",
  "data/redirect-devtop/2022/6/1128567.json": "Don't use boolean evaluation as a readability shortcut   TL;DR: Don't use Boolean comparison for side...",
  "data/redirect-devtop/2022/6/1126739.json": "Sup folks, hope you are doing great 🤗, we are going to pass through many in one flutter concept 😂...",
  "data/redirect-devtop/2022/6/1128807.json": "July 1st, 2022 - Instalment #119   Welcome to regular and new readers alike, to the AWS open...",
  "data/redirect-devtop/2022/6/1126777.json": "Table of Content      📌 Introduction  📌 Most Useful Functions of JavaScript   ➡ Map...",
  "data/redirect-devtop/2022/6/1127166.json": "inherit(--var) or parent(--var) is a long desired CSS feature which has been discussed by the CSS...",
  "data/redirect-devtop/2022/6/1129054.json": "In this article, we are going to talk about tips and techniques for making our react projects'...",
  "data/redirect-devtop/2022/6/1120656.json": "Learn how to implement a blazing fast Serverless API Versioning system",
  "data/redirect-devtop/2022/6/1124037.json": "In this article, I will solve a Leafy Trail CSS Challenge on CSS Battle. Let's look at the problem...",
  "data/redirect-devtop/2022/6/1106120.json": "Hey there 👋  Hope you're having a great day! I think I am, as today is the day I announce a project...",
  "data/redirect-devtop/2022/6/1127482.json": "Learning React js should not be that difficult if you're already comfortable with some concepts in...",
  "data/redirect-devtop/2022/6/1124963.json": "How to use Git with several SSH keys in the same machine."
}