{
  "data/redirect-devtop/2022/4/1041174.json": "It's been 735 articles, and I've finally had enough. Time to lay down the keyboard and retire the...",
  "data/redirect-devtop/2022/4/1041123.json": "Someone in one of the Slack communities I'm a part of asked today how to type JSON in TypeScript,...",
  "data/redirect-devtop/2022/4/1041822.json": "Simple full-stack starter that uses a M-UI React design powered by Express/NodeJS",
  "data/redirect-devtop/2022/4/1041850.json": "Thanks to its static binaries and cross-compiling, building and distributing command-line apps in Go...",
  "data/redirect-devtop/2022/4/1041770.json": "Recently I did some interviews for companies that call themselves \"human focused\", but in the time...",
  "data/redirect-devtop/2022/4/1041220.json": "Let's take a quick look and Click \"?\" on this page!           The started   I wanted to sound in my...",
  "data/redirect-devtop/2022/4/1042213.json": "Now that we are talking about testing, let's try out Jest, a pretty well-used testing framework for...",
  "data/redirect-devtop/2022/4/1042481.json": "Here, several approaches will be introduced to reduce your front-end code base, especially, for...",
  "data/redirect-devtop/2022/4/1042005.json": "Hey! This is my first post on DEV. I have started learning web development late 2021. I've been...",
  "data/redirect-devtop/2022/4/1042691.json": "Overview   Decifer is a cross-platform mobile app that helps to generate transcripts either...",
  "data/redirect-devtop/2022/4/1043133.json": "Having a good README can make the difference between a 0-star and a Unicorn Github Project! I hope...",
  "data/redirect-devtop/2022/4/1043160.json": "Open-Source React Dashboard Template crafted on top of M-UI Library (sources available on Github)",
  "data/redirect-devtop/2022/4/1043325.json": "Remember the old days when the internet used to be the only escape you had to run away from our cruel...",
  "data/redirect-devtop/2022/4/1042835.json": "I'm starting a new role soon, and they shipped me a brand new Macbook Pro.  I got everything set up...",
  "data/redirect-devtop/2022/4/1043337.json": "Github is a popular platform for tons of resources and there are many repositories which provide free...",
  "data/redirect-devtop/2022/4/1043314.json": "Let's talk through the basics of one of the most versatile modules in CSS -- the...",
  "data/redirect-devtop/2022/4/1043974.json": "We are happy to announce GitLive now works, out-of-the-box in offline mode, with any Git repository...",
  "data/redirect-devtop/2022/4/1044276.json": "Hi, everyone. My name is Daniel Reis, aka. \"danielhe4rt\", I'm Brazilian and I'm looking for a...",
  "data/redirect-devtop/2022/4/1043985.json": "We have prepared an open-source &amp; completely free toolset for Shopify merchants to help them set...",
  "data/redirect-devtop/2022/4/1043158.json": "In this article, I will show you how to make a good portfolio, then I will rate your portfolios and...",
  "data/redirect-devtop/2022/4/1043341.json": "A deep dive into what is wrong with our conversations about degrees vs bootcamps",
  "data/redirect-devtop/2022/4/1044232.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1043972.json": "Free Bootstrap 5 Template crafted by ThemeSelection - Sneat Dashboard can be used in commercial projects.",
  "data/redirect-devtop/2022/4/1043766.json": "Sometimes you want to have Jest perform a recurring action between each task.  Some examples: Query a...",
  "data/redirect-devtop/2022/4/1044340.json": "Have you ever had to write the same code over and over again, perhaps changing only small...",
  "data/redirect-devtop/2022/4/1043983.json": "This is a short summary on how to use a declarative pattern in Angular with RxJS.  If you are...",
  "data/redirect-devtop/2022/4/1043813.json": "As I continue to post on dev.to, I consistently see post after post telling me to never stick to one...",
  "data/redirect-devtop/2022/4/1045102.json": "A curated list with pixel-perfect Open-Source Dashboards crafted in modern technologies: React, Vue3, Boostrap 5, Tailwind CSS",
  "data/redirect-devtop/2022/4/1044244.json": "A new series to hunt for Free Tailwind Components. In this edition we are exploring Form Components. ",
  "data/redirect-devtop/2022/4/1045136.json": "Whether you're a blogger, startup, or a business, blogging is a long-term strategy to build a strong...",
  "data/redirect-devtop/2022/4/1044046.json": "You’ve probably seen the term “headless” used countlessly over and over again. There are so many...",
  "data/redirect-devtop/2022/4/1044773.json": "A monorepo, what's that?   A while back I was finishing work with an employer and was due to...",
  "data/redirect-devtop/2022/4/1045622.json": "Thank you to everyone who weighed in about the most frustrating part of software development in...",
  "data/redirect-devtop/2022/4/1045080.json": "Introduction   One major benefit of version control is that you can roll back your code to...",
  "data/redirect-devtop/2022/4/1044647.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/4/1045248.json": "Python is one of the most elegant and clean programming languages, yet having a beautiful and clean...",
  "data/redirect-devtop/2022/4/1045315.json": "I recently wrote about How I massively improved my website performance by using the right tool for...",
  "data/redirect-devtop/2022/4/1046268.json": "March was full of surprises, the biggest one being Google Cloud's pricing increase, among many other...",
  "data/redirect-devtop/2022/4/1043095.json": "I recently got a LinkedIn invitation from a random person. After accepting it I got a message from...",
  "data/redirect-devtop/2022/4/1045920.json": "Cover photo created by Jazlyn Borkowski   \"DRY\" is an acronym introduced, seemingly universally, to...",
  "data/redirect-devtop/2022/4/1045647.json": "We've been releasing a lot of great new features on AWS Amplify Studio since we launched the...",
  "data/redirect-devtop/2022/4/1046495.json": "Software development gets passed down as an oral and written history of mistakes and learnings — and...",
  "data/redirect-devtop/2022/4/1046845.json": "If you were hanging around earlier today, you might have seen that DEV suffered some partial downtime...",
  "data/redirect-devtop/2022/4/1046399.json": "How we're building the PinePhone-based smartphone that has Progressive Web Apps at its core",
  "data/redirect-devtop/2022/4/1046697.json": "It's quite common for folks on DEV to ask how they can ignore or see less of a certain tag. Well, I'm...",
  "data/redirect-devtop/2022/4/1047154.json": "Cloud computing skills are in high demand, without a doubt.  AWS partners we spoke to say that 83%...",
  "data/redirect-devtop/2022/4/1046787.json": "React 18 sets the foundation for concurrent rendering APIs that future React features will be built...",
  "data/redirect-devtop/2022/4/1046150.json": "As a beginner programmer, you often hear advice to test your code. It’s good advice—let’s look at how...",
  "data/redirect-devtop/2022/4/1045566.json": "One of the more interesting patterns I learned on a later stage of my career is the Proxy.  When...",
  "data/redirect-devtop/2022/4/1047295.json": "Open-Source React UI Kit crafted by Creative-Tim - Material Kit React can be downloaded from Github (MIT License).",
  "data/redirect-devtop/2022/4/1046468.json": "This is a post that I have had brewing for maybe a year but I never took the time to write my...",
  "data/redirect-devtop/2022/4/1047684.json": "With the new team sidebar, you can now see all work in progress across your entire team in a single...",
  "data/redirect-devtop/2022/4/1046227.json": "In this blog article I talk about the challenge of learning multiple technologies and staying up to...",
  "data/redirect-devtop/2022/4/1046473.json": "Kubernetes is at the top of everyone’s minds today. From engineers to CTO’s and senior leadership...",
  "data/redirect-devtop/2022/4/1048053.json": "A curated list with Open-Source MUI Templates released under permissive licenses - React Soft UI, Berry, Material Dashboard - All FREE.",
  "data/redirect-devtop/2022/4/1047053.json": "All code from this tutorial as a complete package is available in this repository.  If you find this...",
  "data/redirect-devtop/2022/4/1045679.json": "Introduction   I am sure you have been seeing a lot of tweets, posts, and conversations...",
  "data/redirect-devtop/2022/4/1046465.json": "According to the official documentation from Docker,   Docker is an open platform for developing,...",
  "data/redirect-devtop/2022/4/1047789.json": "Hey guys, I wanted to showcase my latest project: A DEV clone.            Why I made it   My...",
  "data/redirect-devtop/2022/4/1047656.json": "I started at Forem in October 2021, and needed to orient myself quickly to a code base that powered...",
  "data/redirect-devtop/2022/4/1048329.json": "If you don't want to use plain bullets, the ::marker psuedo-element is for you!",
  "data/redirect-devtop/2022/4/1048281.json": "The missing guide on how to migrate your React app from Webpack to Vite.",
  "data/redirect-devtop/2022/4/1047712.json": "We're not all just \"programmers\" — over time we become web devs, lead devs, SREs, etc.  What's your...",
  "data/redirect-devtop/2022/4/1046428.json": "As dev, it's not uncommon to use different machines or to renew laptops and devices. You don't want...",
  "data/redirect-devtop/2022/4/1047428.json": "Introduction   AWS Amplify is a set of purpose-built tools and features that lets front-end...",
  "data/redirect-devtop/2022/4/1047430.json": "We as JavaScript developers usually use console.log() to test the output or just for fun. Even I can...",
  "data/redirect-devtop/2022/4/1049024.json": "Most of us probably had some sort of other jobs before getting into software as a career. I'd love to...",
  "data/redirect-devtop/2022/4/1048620.json": "If you've spent much time in software development, you've undoubtedly heard the expression...",
  "data/redirect-devtop/2022/4/1048150.json": "There are many open source projects out there and a lot of them act as alternatives for popular...",
  "data/redirect-devtop/2022/4/1049149.json": "Intro   Toggle is a TRUE/FALSE switch that looks like a... switch... Similar control you can...",
  "data/redirect-devtop/2022/4/1046750.json": "A post by m0nm",
  "data/redirect-devtop/2022/4/1049870.json": "A short list of important Javascript concepts for React Developers - With Code Samples.",
  "data/redirect-devtop/2022/4/1047727.json": "Smash that \"subscribe\" button if you don't want to miss anything. 👇",
  "data/redirect-devtop/2022/4/1048300.json": "Hey DEV Community 👋   I wanted to pop into your feeds with a quick reminder that the Deepgram x DEV...",
  "data/redirect-devtop/2022/4/1047019.json": "In TypeScript, we sometimes need to enforce that an object has required properties, even if the...",
  "data/redirect-devtop/2022/4/1049539.json": "In 2019, I facilitated workshops for the Girl Guides of Canada to introduce young girls to computer...",
  "data/redirect-devtop/2022/4/1049309.json": "In the remote world where a lot of us are now, what online games, if any, do you play with your...",
  "data/redirect-devtop/2022/4/1050024.json": "How much of JavaScript do you really think you know? You probably know how to write functions,...",
  "data/redirect-devtop/2022/4/1050154.json": "If you're a mid-level React developer looking to become an advanced React developer, this post is for...",
  "data/redirect-devtop/2022/4/1047390.json": "Automatically generates coloring pages, in less than 200 lines of code",
  "data/redirect-devtop/2022/4/1049296.json": "A curated list with full-stack Open-Source Starters crafted on top of Laravel 9 (latest version) - Source Code for all projects is available on Github.",
  "data/redirect-devtop/2022/4/1049827.json": "This is something that might seem weird for beginners, yet is something that every beginner should...",
  "data/redirect-devtop/2022/4/1047661.json": "A very common question for beginners is always, “Where to start” and “How are you a self-taught...",
  "data/redirect-devtop/2022/4/1049746.json": "Animations are really awesome to see on websites, right?  And the coolest thing about animations is...",
  "data/redirect-devtop/2022/4/1046022.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/4/1050018.json": "Are 2 years enough to make someone “senior”? If it is... then what is a junior? And where is the...",
  "data/redirect-devtop/2022/4/1048667.json": "setTimeout in JavaScript is a native function that sets a function to be executed when a specified...",
  "data/redirect-devtop/2022/4/1050674.json": "Open-Source MUI Template crafted by Creative-Tim using Argon Design concepts. Sources are available for download from Github (MIT License).",
  "data/redirect-devtop/2022/4/1050646.json": "While working in one of my project I had to implement a feature where I have turn an HTML webpage to...",
  "data/redirect-devtop/2022/4/1050529.json": "The first rule of Test-Driven-Development (TDD) is to write a test before coding the feature. It...",
  "data/redirect-devtop/2022/4/1050797.json": "Hello everybody!   A lot of people read my last post about my group_button package And I...",
  "data/redirect-devtop/2022/4/1049743.json": "Sometimes you just want those pesky newline characters to actually work!",
  "data/redirect-devtop/2022/4/1050888.json": "Article posted using bloggu.io. Try it for free.  Imagine the scenario where you have a variable...",
  "data/redirect-devtop/2022/4/1050220.json": "My submission to the Deepgram Hackathon on DEV!",
  "data/redirect-devtop/2022/4/1045259.json": "Hello👋  Actually I am new to deepgram. So had to educate my self on how deepgram works and make...",
  "data/redirect-devtop/2022/4/1050852.json": "Overview of My Submission   DeepDubber Dubs videos - Generates the subtitles, translates...",
  "data/redirect-devtop/2022/4/1050651.json": "Hi!  So, what's this post gonna be about?   Well, with the Effect community, we've been hard at work...",
  "data/redirect-devtop/2022/4/1050500.json": "ReactJS is the highly used open-source JavaScript Library which makes building dynamic websites...",
  "data/redirect-devtop/2022/4/1047681.json": "This is part of a Tech Jargon Defined series focused on de-mystifying common tech jargon terms.      ...",
  "data/redirect-devtop/2022/4/1050501.json": "I'm fairly new to backend dev &amp; have a decent knowledge on how to build frontend apps using...",
  "data/redirect-devtop/2022/4/1051609.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1051226.json": "As application and website developers we need to perform good SEO practices, optimizations, share our...",
  "data/redirect-devtop/2022/4/1050875.json": "Well, Hello there. This is my first blog post and hackathon here. The following sections will give...",
  "data/redirect-devtop/2022/4/1050486.json": "Are you someone trying to dive into the world of React, but keep forgetting how to do stuff &amp;...",
  "data/redirect-devtop/2022/4/1050637.json": "Most of the websites we visit nowadays show a pop-up letting us know they use cookies. Sometimes we...",
  "data/redirect-devtop/2022/4/1052026.json": "There are over a hundred elements in HTML, all of which can be applied to pieces of text to give them...",
  "data/redirect-devtop/2022/4/1049962.json": "Medusa is an open source ecommerce platform. One of the reasons we made it open source is because we...",
  "data/redirect-devtop/2022/4/1051267.json": "LOLCODE      HAI 1.2     VISIBLE \"Hello, World!\" KTHXBYE        Enter fullscreen mode    ...",
  "data/redirect-devtop/2022/4/1051694.json": "Today, we are going to talk about one of the most underrated parts of development: Testing. We all...",
  "data/redirect-devtop/2022/4/1052859.json": "Not the first time this has been asked, won't be the last.  Please drop titles and/or links to music...",
  "data/redirect-devtop/2022/4/1052086.json": "Comment here if you need any help during the Appwrite Hackathon on DEV!",
  "data/redirect-devtop/2022/4/1051384.json": "Let's look at the state of Foreign Function Interface (FFI) in Java.",
  "data/redirect-devtop/2022/4/1052920.json": "A comprehensive introduction to NodeJS for Beginners - With Free Samples.",
  "data/redirect-devtop/2022/4/1052888.json": "Last week, the team I work on at AWS Amplify launched new map UI components. I wanted to take this...",
  "data/redirect-devtop/2022/4/1052575.json": "As a beginner in the DevOps Engineering field, starting out can be stressful &amp; overwhelming as...",
  "data/redirect-devtop/2022/4/1052902.json": "The security of .NET applications is necessary and knowing how to protect it is not always an easy...",
  "data/redirect-devtop/2022/4/1052372.json": "One of the most interesting and challenging things in React is not mastering some advanced...",
  "data/redirect-devtop/2022/4/1053184.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/4/1052851.json": "The UNIX system is a major breakthrough that inspired many other operating systems. It's particularly...",
  "data/redirect-devtop/2022/4/1052229.json": "Dear Linkedin Hiring Managers and Aka Tech Recruiters,   I am writing to you people on behalf of my...",
  "data/redirect-devtop/2022/4/1048772.json": "Serverless makes it incredibly easy to get an API up and running in record time. But how do you...",
  "data/redirect-devtop/2022/4/1051457.json": "In this guide you'll learn how to use OpenShot to edit videos on Linux Ubuntu (21.10)",
  "data/redirect-devtop/2022/4/1052839.json": "A few days ago I saw this post where someone was asking if we knew some games to play online with our...",
  "data/redirect-devtop/2022/4/1053661.json": "Learn how to code a simple landing page with MUI Library and React - Sample Code available on Github.",
  "data/redirect-devtop/2022/4/1054240.json": "Today, I’m excited to highlight a Forem that has a ton of relevance for everyone on DEV:  the...",
  "data/redirect-devtop/2022/4/1053765.json": "There are many folders structure to follow in ReactJS , And you might be confused which one you have...",
  "data/redirect-devtop/2022/4/1051269.json": "Sometimes we want to write tests to check if certain elements are not rendered.  For example, we...",
  "data/redirect-devtop/2022/4/1052861.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/4/1053789.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1053744.json": "I wanted to try out a goofy idea. I wanted to animate a website's logo so that it would fall over...",
  "data/redirect-devtop/2022/4/1052375.json": "Have you ever thought, what exactly is the formula to become a better developer? The thing is that...",
  "data/redirect-devtop/2022/4/1052876.json": "These days web performance is one of the most important things everyone wants to optimize on their...",
  "data/redirect-devtop/2022/4/1052652.json": "A post by Sherry Day",
  "data/redirect-devtop/2022/4/1053718.json": "I learn best from reading, watching, and doing, which means I need various resources to create a...",
  "data/redirect-devtop/2022/4/1052073.json": "This is part one of my series on demystifying every damn aspect of Textual. In this article, we are...",
  "data/redirect-devtop/2022/4/1054008.json": "If you're not familiar with Medusa, it's an open source headless commerce platform that has been...",
  "data/redirect-devtop/2022/4/1052563.json": "I have been facing some tough code monsters at work lately. I guess I'm out of shape and my sword...",
  "data/redirect-devtop/2022/4/1054003.json": "Dicas do Sibelius Seraphini durante AMA no dia 12/04/2022  Saber o que está acontecendo e por que...",
  "data/redirect-devtop/2022/4/1046999.json": "Grab a coffee and be ready to navigate between many helpful resources that can help you improve your...",
  "data/redirect-devtop/2022/4/1053708.json": "Introduction   Even though I didn't work at GitHub when they announced Copilot, I remember...",
  "data/redirect-devtop/2022/4/1053451.json": "Writing Code that is clean, scalable and easy to maintain, is the dream of every programmer, this...",
  "data/redirect-devtop/2022/4/1056113.json": "A fair comparison over three top-rated Forms Library for React: Formik, React-Hook-Form, and React-Final-Form - With code samples and validation.",
  "data/redirect-devtop/2022/4/1042846.json": "Table of Contents    CodeSnap Colorize Beautify Live Server autoDocstring GitLens Remote -...",
  "data/redirect-devtop/2022/4/1052053.json": "Photo by Annie Spratt on Unsplash  In the last couple of years, the number of developers contributing...",
  "data/redirect-devtop/2022/4/1056679.json": "For years, the only direction that cloud prices would go was down. But this is already...",
  "data/redirect-devtop/2022/4/1055862.json": "And are you doing anything proactive to help with the physical tole our kind of work can sometimes...",
  "data/redirect-devtop/2022/4/1056111.json": "I doubt there is one correct answer, as this is going to depend on language preferences,  whether the...",
  "data/redirect-devtop/2022/4/1053166.json": "This is probably an unpopular opinion but, working from home, all the time it's the best thing that...",
  "data/redirect-devtop/2022/4/1055436.json": "Hello Everyone 👋  Have you ever felt that you don't belong in tech? Mainly because you're a woman or...",
  "data/redirect-devtop/2022/4/1053172.json": "Have you developed an indie game or are possibly developing an indie game? I'd love to hear about it!...",
  "data/redirect-devtop/2022/4/1054046.json": "In relational databases it's common practice to create constraints to lock down the data and its...",
  "data/redirect-devtop/2022/4/1053705.json": "Hello, everyone. Today I decided to challenge myself and build an entire e-commerce web app with the...",
  "data/redirect-devtop/2022/4/1056020.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/4/1057239.json": "Greetings, everyone. In this article, we will pick up where we left off and continue our series on...",
  "data/redirect-devtop/2022/4/1056652.json": "Join me in this post as I share with you my thought process when approaching component development. I...",
  "data/redirect-devtop/2022/4/1057313.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1056458.json": "If I say I have 5 years of experience, what I mean is, I have 5 years worth of experience even though...",
  "data/redirect-devtop/2022/4/1057320.json": "We all must have used @import in our css files for importing one stylesheet to another. While working...",
  "data/redirect-devtop/2022/4/1048611.json": "Table of Contents    The Elements, Ideas, and Concept DevCard Shields.io GitHub...",
  "data/redirect-devtop/2022/4/1057509.json": "Spreadsheets are one of the most important format that stores and calculates data, and are also key...",
  "data/redirect-devtop/2022/4/1057017.json": "This is a simple Node.js URL shortener app that uses Cloudflare Workers.  The app is powered by...",
  "data/redirect-devtop/2022/4/1056686.json": "Appreciation ❤️   I'm loving every submission here on Dev.to from the previous challenges!...",
  "data/redirect-devtop/2022/4/1055824.json": "Micro-frontends are the present and the future for scaling large client-side applications. Why...",
  "data/redirect-devtop/2022/4/1057804.json": "In my latest Youtube Video, I'm sharing information regarding this great Free CSS Grid Course By...",
  "data/redirect-devtop/2022/4/1057511.json": "In this example we will see how to use async/await with .map in javascript",
  "data/redirect-devtop/2022/4/1058268.json": "I spend a lot of time working with tooling, whether it's for my job, content creation, or just...",
  "data/redirect-devtop/2022/4/1057994.json": "I've totally fallen for the Swedish synth-makers and electronic gizmo creators, Teenage...",
  "data/redirect-devtop/2022/4/1056814.json": "If you call yourself a builder, whether that means working on a startup, open source, or personal...",
  "data/redirect-devtop/2022/4/1058124.json": "This is one interesting interview question.  Generally, we know the matrix of any size but what is...",
  "data/redirect-devtop/2022/4/1057244.json": "What we learned from losing a decade of stargazers and watchers, the biggest accidental community loss in open source history.",
  "data/redirect-devtop/2022/4/1057894.json": "One of the fundamental concepts in computer programming is a variable. If you are studying computer...",
  "data/redirect-devtop/2022/4/1058905.json": "Hello, puppies and kittens! In this article, we will carry on our series demystifying every damn...",
  "data/redirect-devtop/2022/4/1052871.json": "First impression matters. And given the digital world, the first impression is not made during phone...",
  "data/redirect-devtop/2022/4/1058398.json": "V-lang is an extraordinarily powerful language that can help you create a variety of applications....",
  "data/redirect-devtop/2022/4/1058644.json": "If you want to read more of these articles, don't hesitate to subscribe to my newsletter.😁  Writing...",
  "data/redirect-devtop/2022/4/1057459.json": "Whether you like it or not, GitHub has become the primary provider to host one's code. You or your...",
  "data/redirect-devtop/2022/4/1058368.json": "• A lot of beginners and experienced programmers avoid learning data structures and...",
  "data/redirect-devtop/2022/4/1058393.json": "Today, most of us spend most of our time on web browsers rather than desktop apps. Thus, to improvise...",
  "data/redirect-devtop/2022/4/1057954.json": "A post by Sherry Day",
  "data/redirect-devtop/2022/4/1058858.json": "Since I started write my first block of code, I heard from many developers that commenting is useless...",
  "data/redirect-devtop/2022/4/1058871.json": "On March 8th, the React team released the React 18 RC(Release Candidate). The latest release has...",
  "data/redirect-devtop/2022/4/1058236.json": "Whenever I advance in JavaScript course classes, I noticed that the moment I leave the conventional...",
  "data/redirect-devtop/2022/4/1059430.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1053668.json": "Everyone wants to be more productive, but how do you become more productive? Well, hopefully you'll...",
  "data/redirect-devtop/2022/4/1059684.json": "Introdução   A motivação do Artigo veio através de uma dificuldade que tive estudando Plugs...",
  "data/redirect-devtop/2022/4/1055878.json": "Hello everyone, greetings from team Appwrite 👋.   We have an exciting couple of weeks ahead of us....",
  "data/redirect-devtop/2022/4/1059757.json": "In software development is that there is no real standard level for seniority.  For some companies...",
  "data/redirect-devtop/2022/4/1059730.json": "Context   When I started developing, REST APIs were the go-to and became the de facto in all...",
  "data/redirect-devtop/2022/4/1060241.json": "The new version of AppSeed is LIVE - improved design and complete refactoring over the site structure.",
  "data/redirect-devtop/2022/4/1059698.json": "Introduction   I have decided to take part in a challenge to learn Golang in the next 30...",
  "data/redirect-devtop/2022/4/1059135.json": "Table of Contents    Overview Available Libraries Useful Endpoints Project Ideas with GitHub...",
  "data/redirect-devtop/2022/4/1060470.json": "Teams interested in tracing their AWS cloud costs usually turn to AWS Cost Explorer, the industry’s...",
  "data/redirect-devtop/2022/4/1060242.json": "Quite early on, while starting this journey, I realized perfection is not achievable as a...",
  "data/redirect-devtop/2022/4/1059768.json": "Git has been in the making since 2005, and probably 90% developers use it everyday What are some...",
  "data/redirect-devtop/2022/4/1060637.json": "Modern web development is about grabbing the visitors' attention. There are several ways of making...",
  "data/redirect-devtop/2022/4/1059961.json": "Hoje eu vim te apresentar o Co-Piloto do Github, uma tecnologia que pode substituir muitas pessoas...",
  "data/redirect-devtop/2022/4/1059132.json": "Kubernetes also known as K8s is an open-source container orchestration tool developed by Google...",
  "data/redirect-devtop/2022/4/1059663.json": "I've been thinking about going down the contractor route, but I have reservations (which I won't get...",
  "data/redirect-devtop/2022/4/1060914.json": "Announcing our first CodeLand 2022 keynote speaker",
  "data/redirect-devtop/2022/4/1060585.json": "Let's here them!",
  "data/redirect-devtop/2022/4/1059776.json": "React Testing Library is a popular testing utility tool for front-end testing.  Challenges can arise...",
  "data/redirect-devtop/2022/4/1061080.json": "I frequently search for the code to delete all local branches except master so I can copy/paste the...",
  "data/redirect-devtop/2022/4/1060652.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/4/1060587.json": "Developer Relations can mean many things. Keep reading for a high-level understanding of what a DevRel team does and a close-up of how our Deepgram team works.",
  "data/redirect-devtop/2022/4/1060575.json": "Let's talk about weak passwords.           Obvious weaknesses   The following passwords must be...",
  "data/redirect-devtop/2022/4/1060472.json": "Horizon UI is the trendiest open-source admin template built on top of Chakra UI. Horizon UI comes...",
  "data/redirect-devtop/2022/4/1061081.json": "Being as productive as possible is a goal of every developer. Why? Well, the list of benefits is long...",
  "data/redirect-devtop/2022/4/1060097.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/4/1061755.json": "Which git commands and concepts do you have a hard time wrapping your head around and using...",
  "data/redirect-devtop/2022/4/1062015.json": "Get started and build your dream web app with Horizon UI, the trendiest & innovative Open Source Admin Template for Chakra UI & React",
  "data/redirect-devtop/2022/4/1058409.json": "A Javascript console object is a global object that provides access to the browser's debugging...",
  "data/redirect-devtop/2022/4/1060124.json": "I don't believe imposter syndrome is something that can just go away. Often people ask me how to get...",
  "data/redirect-devtop/2022/4/1061488.json": "It's not my first try, but final.    Backstory  I started my career back in 2011. At that time I was...",
  "data/redirect-devtop/2022/4/1061467.json": "Graph from the state of JavaScript survey, the results showing less JavaScript developers as time...",
  "data/redirect-devtop/2022/4/1062906.json": "The product lifecycle often holds us accountable for so many things. Even if you think you are aware...",
  "data/redirect-devtop/2022/4/1062830.json": "This is part 1 of the series where I share helpful VS code extensions, settings, shortcuts, tips, and...",
  "data/redirect-devtop/2022/4/1062191.json": "The DEV team is starting a new weekly roundup series to highlight what we believe to be the most...",
  "data/redirect-devtop/2022/4/1063154.json": "the new journey begins <3",
  "data/redirect-devtop/2022/4/1062386.json": "Each element on a web page is wrapped around by a box. The arrangement of these boxes make up the...",
  "data/redirect-devtop/2022/4/1062851.json": "What wisdom are newbies missing in your experience?",
  "data/redirect-devtop/2022/4/1063182.json": "Hi, am prosper and am having a downtime currently. My pc is broken and I need a replacement. please...",
  "data/redirect-devtop/2022/4/1062013.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/4/1062843.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/4/1061122.json": "¿Por qué renuncié a un trabajo en GitLab para trabajar por mi cuenta?  Renuncié a mi trabajo en...",
  "data/redirect-devtop/2022/4/1064020.json": "As you might know, I've been highlighting some of the early Forems joining the network of late over...",
  "data/redirect-devtop/2022/4/1062886.json": "As a lead engineer/manager, what steps can you take for your team to provide better  estimations for...",
  "data/redirect-devtop/2022/4/1062807.json": "As dev teams are looking for new ways to stay productive and communicate effectively, asynchronous...",
  "data/redirect-devtop/2022/4/1064301.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/4/1064308.json": "Earlier today I was reviewing the draft Community Wellness badge pull request; and with my head deep...",
  "data/redirect-devtop/2022/4/1061696.json": "⚠️ This is a bit of a rant as I've lost patience with TypeScript and I need to vent.  While...",
  "data/redirect-devtop/2022/4/1063117.json": "When creating a react project you may have some variables you wouldn't want to expose and commit to...",
  "data/redirect-devtop/2022/4/1064237.json": "Table of Contents    What's a Jack of All Trades? Origin of the Saying Which is a Better...",
  "data/redirect-devtop/2022/4/1064094.json": "Does the thought of making a minor style update in a large front-end project give you pause? It does...",
  "data/redirect-devtop/2022/4/1061380.json": "Browsers (also called web browsers or an Internet browsers) are software applications installed on...",
  "data/redirect-devtop/2022/4/1061402.json": "Hey everyone! I hope you're having a nice day or night.  Developer portfolios are interesting....",
  "data/redirect-devtop/2022/4/1064131.json": "Introdução   Muitas pessoas da rede social do passarinho azul (essa mesma que você imaginou)...",
  "data/redirect-devtop/2022/4/1063342.json": "We’re already almost halfway through season two of Select*, the podcast hosted by HarperDB, and it...",
  "data/redirect-devtop/2022/4/1064769.json": "Found amazing resources which will save you tons of time as a web developer and increase your...",
  "data/redirect-devtop/2022/4/1064741.json": "Introduction   Linux is a Unix-like, open source and community-developed operating system...",
  "data/redirect-devtop/2022/4/1064034.json": "In order to stay motivated to program consistently, a programmer must crave motivation for...",
  "data/redirect-devtop/2022/4/1065122.json": "Here are some of the most popular vs. unlikely techniques that can be used to identify people.       ...",
  "data/redirect-devtop/2022/4/1064336.json": "I was chatting with someone in my Virtual Coffee community today, and they were talking about...",
  "data/redirect-devtop/2022/4/1064949.json": "Cover image shows me using 1st monitor to watch youtube while writing code on 2nd.  Since I bought an...",
  "data/redirect-devtop/2022/4/1064293.json": "So i just realized that console.log() can slow down your node.js app.  Explaination: So if you have a...",
  "data/redirect-devtop/2022/4/1064728.json": "In the last article we talked about navigation, the first step the browser takes to display the...",
  "data/redirect-devtop/2022/4/1065380.json": "Did you ever want to showcase a site you have worked on or a new feature you just published in a...",
  "data/redirect-devtop/2022/4/1063376.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/4/1065860.json": "The debate over whether one monitor is better than multiple monitors has been going on for years....",
  "data/redirect-devtop/2022/4/1065350.json": ".toLocaleString and friends are some of the most underrated features of JavaScript. I came over them...",
  "data/redirect-devtop/2022/4/1064287.json": "Feed the planner, trust the plan   Of all the Aha! engineering tool expenses, the money I'm...",
  "data/redirect-devtop/2022/4/1065509.json": "Yesterday I introduced our company Wordsmith to you all (briefly) and then asked for feedback on our...",
  "data/redirect-devtop/2022/4/1066201.json": "They say the best things in life are free, but when it comes to software... well, it’s not always...",
  "data/redirect-devtop/2022/4/1064978.json": "Attention fullstack developers, there’s an imposter among us. Unfortunately, it’s me. I like to think...",
  "data/redirect-devtop/2022/4/1066548.json": "The world went primarily remote in the height of the pandemic. With things returning to \"normal\" in a...",
  "data/redirect-devtop/2022/4/1065368.json": "I recently stumbled across a free app I never heard of before: Obsidian  Its an app for writing and...",
  "data/redirect-devtop/2022/4/1066207.json": "Being a fresher it’s a lot difficult to prepare for an interview. You will have very little idea and...",
  "data/redirect-devtop/2022/4/1064473.json": "This is part 2 of Efficient learning.    Pays not to be busy: Similar to diffuse mode. It's not good...",
  "data/redirect-devtop/2022/4/1062781.json": "We all have so many half-baked projects that we don't want to go back to. Still, we have unicorn...",
  "data/redirect-devtop/2022/4/1065344.json": "Without this little rubber keyed wonder, I would not be the programmer I am today...   Who else got...",
  "data/redirect-devtop/2022/4/1065330.json": "This is a continuation of the previous list of javascript one-liners. If you haven't checked out the...",
  "data/redirect-devtop/2022/4/1066871.json": "cover image credits: artbyjayr &lt;3  There are loads of posts out there where folks have asked...",
  "data/redirect-devtop/2022/4/1064117.json": "I've been sitting on writing this article for 2 years. In my heart this was the article I was going...",
  "data/redirect-devtop/2022/4/1064246.json": "Whether it's creating a discord gaming server or a community server you need some type of moderator...",
  "data/redirect-devtop/2022/4/1066300.json": "Happy Monday! Take a chance in the comments of this post to show off something cool you've been...",
  "data/redirect-devtop/2022/4/1066465.json": "SICP JS Cover",
  "data/redirect-devtop/2022/4/1066887.json": "Fair warning to everyone on dev.to",
  "data/redirect-devtop/2022/4/1066266.json": "The idea of  this post is to show you the minimum set of methods you need to deal with to get away...",
  "data/redirect-devtop/2022/4/1066261.json": "Microsoft does not stop! For months now we have seen updates and news from the .NET development team...",
  "data/redirect-devtop/2022/4/1067207.json": "Why I built It   I built a VS Code Extension that deploys code to GitHub Pages.  I’ve always...",
  "data/redirect-devtop/2022/4/1067670.json": "This is our first post here in dev.to as an organization, make sure to give us some love!          ...",
  "data/redirect-devtop/2022/4/1067403.json": "Often times, after seeing a tweet, I go to https://poet.so to take a screenshot of it. However, this...",
  "data/redirect-devtop/2022/4/1067751.json": "A while ago I wrote an article about the repositories you need to master JavaScript. It got some...",
  "data/redirect-devtop/2022/4/1066032.json": "Hey DEV community!  I just wanted to stop by and let you know that registration for CodeLand 2022 is...",
  "data/redirect-devtop/2022/4/1067022.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/4/1067939.json": "There's like a fight or something like that about JS vs TS and I always like to go against TS in TS...",
  "data/redirect-devtop/2022/4/1067683.json": "This past weekend, I created a demo using 3D CSS: an interactive SNES controller",
  "data/redirect-devtop/2022/4/1067710.json": "You know that border around interactive items on a Web page? Links, form components (checkboxes,...",
  "data/redirect-devtop/2022/4/1064951.json": "Until now we discussed navigation and data fetching. Today we're going to talk about parsing in...",
  "data/redirect-devtop/2022/4/1066215.json": "Why to write this best practices    For many startups, we should focus more on delivering...",
  "data/redirect-devtop/2022/4/1068779.json": "There are only so many hours in the day — which tools and/or disciplines in software development do...",
  "data/redirect-devtop/2022/4/1067627.json": "Why I Built It   I built a VS Code Extension that deploys code to GitHub Pages. I’ve always...",
  "data/redirect-devtop/2022/4/1069458.json": "ProgrammerHumor.io   What programmers find humorous is quite limited and for me personally,...",
  "data/redirect-devtop/2022/4/1067439.json": "I picked the problem of my macbook pro being an absolute snail under load, mostly because I wanted to...",
  "data/redirect-devtop/2022/4/1068425.json": "When was the last time you felt lost in your career? How do you cope with not knowing what step to...",
  "data/redirect-devtop/2022/4/1060823.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/4/1067745.json": "I have a doubt!  Will cryptocurrency become the legal currency in the world in the future?",
  "data/redirect-devtop/2022/4/1069693.json": "The last CSS Art I made was so real that he start talking! He was so nervous and screaming...",
  "data/redirect-devtop/2022/4/1068569.json": "Six month ago, I started working on monse.app, a simple and automated personal finances for normal...",
  "data/redirect-devtop/2022/4/1067719.json": "Apesar da Github ser mais conhecida como uma plataforma de open source e armazanamento de código, ela...",
  "data/redirect-devtop/2022/4/1069711.json": "Let's hear it!",
  "data/redirect-devtop/2022/4/1069480.json": "In the past few years, dev.to has become a big player in the international tech blogging community,...",
  "data/redirect-devtop/2022/4/1069141.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/4/1069307.json": "Are you the type to save up for your dream setup equipment (monitors, keyboards, etc.)? What does...",
  "data/redirect-devtop/2022/4/1069120.json": "Recently, I read an Article where the author, Jerry Low,  suggested that developers write their CSS...",
  "data/redirect-devtop/2022/4/1070739.json": "Software engineers typically don’t care about infrastructure costs because they never had to.  But...",
  "data/redirect-devtop/2022/4/1068773.json": "More and more cloud hosting providers and software-as-a-service platforms are offering serverless...",
  "data/redirect-devtop/2022/4/1069882.json": "What are some things you'd like to improve at work? It could be code related, e.g. automation,...",
  "data/redirect-devtop/2022/4/1069892.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/4/1068000.json": "Hey all! I'm delighted to share that I've joined Forem full-time in the role of Social Media Manager...",
  "data/redirect-devtop/2022/4/1071002.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1069889.json": "Overview of My Submission   Snake Arcade is a retro themed snake game with a live highscore...",
  "data/redirect-devtop/2022/4/1070587.json": "let's understand what are the differences between websocket and server-sent events and their ideal cases",
  "data/redirect-devtop/2022/4/1071258.json": "Greetings, members of the Rebel Alliance.   Star Wars Day is coming up on Wednesday, May 4th and the...",
  "data/redirect-devtop/2022/4/1069499.json": "After the HTML has been parsed, it's time to parse the CSS (found in in external CSS files and in...",
  "data/redirect-devtop/2022/4/1071073.json": "Free, In-Browser tool for editing OpenAPI definitions - provided by AppSeed (free developer tool).",
  "data/redirect-devtop/2022/4/1070559.json": "Whether you're a seasoned coder, or just starting out, GitHub Copilot's new feature will have...",
  "data/redirect-devtop/2022/4/1069605.json": "I was writing a post about my development journey yesterday and it made me wonder, does anyone else...",
  "data/redirect-devtop/2022/4/1071080.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/4/1069467.json": "A Regular Expression – or regex for short– is a syntax that allows you to match strings with specific...",
  "data/redirect-devtop/2022/4/1071730.json": "A simple effect with CSS and a single HTML element",
  "data/redirect-devtop/2022/4/1070255.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/4/1070548.json": "If-statements can contain duplicated statements with minimal differences. For example, copy-paste...",
  "data/redirect-devtop/2022/4/1071279.json": "What is Local Storage?   Local storage is an object in the DOM where you can store data,...",
  "data/redirect-devtop/2022/4/1071436.json": "Whether it be between projects or because you were sick, when was the last time you had to limit your...",
  "data/redirect-devtop/2022/4/1071085.json": "Introduction   This tutorial will show you how to post messages to Slack apps using their...",
  "data/redirect-devtop/2022/4/1063179.json": "Being a software engineer in 2022 is demanding. On one side, you have to know more and more...",
  "data/redirect-devtop/2022/4/1071231.json": "Hi, Devs! I am Taishi, a software developer in Vancouver!  I have been thinking about using Enums...",
  "data/redirect-devtop/2022/4/1048160.json": "The most successful engineering teams typically keep their workflow durations between five to ten...",
  "data/redirect-devtop/2022/4/1071288.json": "(͠≖ ͜ʖ͠≖)👌 Overview of Nigma   The Nigma app was born from a simple inspiration: wasting...",
  "data/redirect-devtop/2022/4/1066296.json": "Appwrite is an OSS company, and we share as much as possible with our community. Since transparency...",
  "data/redirect-devtop/2022/4/1069082.json": "Hey, welcome to the course, and thanks for learning Go. I hope this course provides a great learning...",
  "data/redirect-devtop/2022/4/1071583.json": "While the CSS is being parsed and the CSSOM created, other assets, including JavaScript files, are...",
  "data/redirect-devtop/2022/4/1068442.json": "Disclaimer: this is not a pure tech article, with detailed manual. It is a story about:...",
  "data/redirect-devtop/2022/4/1058501.json": "Are you new to serverless? Did you spend all your time working with containers or some legacy...",
  "data/redirect-devtop/2022/4/1068812.json": "I decided to look into Typescript this week because of Pavlo (a developer friend who I have never...",
  "data/redirect-devtop/2022/4/1065495.json": "From the beginning of my self-taught front-end developer journey, I was interested in how to create...",
  "data/redirect-devtop/2022/4/1068140.json": "Accessibility is the core philosophy of the web.   I haven't been in this space long, and I already...",
  "data/redirect-devtop/2022/4/1044268.json": "Hola Mundo!     Maybe at this moment you already know -or not- that I have a little..."
}