{
  "data/redirect-devtop/2021/8/778255.json": "The CSS grid is a newer standard that makes it easy to build complex responsive layouts. It works by...",
  "data/redirect-devtop/2021/8/778196.json": "Let me give you a simple 🚦Road-map to Know Where You Are, and Where You Should Go Next.          ...",
  "data/redirect-devtop/2021/8/778355.json": "Over the past few weeks, I've been working on a new side project to replicate a visual effect called 'head-coupled perspective' to make interactive art with head tracking, using Three.js and TensorFlow.js.",
  "data/redirect-devtop/2021/8/778059.json": "An engineer reflects on 5 years at Amazon and provides constructive feedback for better corporate citizenship",
  "data/redirect-devtop/2021/8/778585.json": "Dear readers, this post is about a very useful and important concept of JavaScript. I think every...",
  "data/redirect-devtop/2021/8/778666.json": "Hello, I'm Aya Bouchiha, on this beautiful &amp; amazing day, I'm going to share with you Youtube...",
  "data/redirect-devtop/2021/8/778191.json": "JAVASCRIPT is the new Boss in the Industry. Javascript says nothing is impossible. Javascript is...",
  "data/redirect-devtop/2021/8/778231.json": "Hello, welcome. Today we'll see, how we can easily create an awesome wavy button hover effect with...",
  "data/redirect-devtop/2021/8/778348.json": "A function is a block of organized reusable code used to perform a single action.  Like many...",
  "data/redirect-devtop/2021/8/778881.json": "Frontend Interview Experience at Amazon Germany",
  "data/redirect-devtop/2021/8/778831.json": "The Pragmatic Programmer is a book by Andrew Hunt and David Thomas written in 1999. I have been...",
  "data/redirect-devtop/2021/8/778670.json": "At the start of every project, most managers generally ask the same basic setup question, \"how should...",
  "data/redirect-devtop/2021/8/778401.json": "I started iterspace with Marco Zani in the summer of 2018. The plan was to build a tool that would...",
  "data/redirect-devtop/2021/8/779199.json": "In class-oriented languages, a class is simply an organized code which acts as a template or...",
  "data/redirect-devtop/2021/8/779485.json": "Introduction   You must have seeing people abusing and hating JS, because they compare...",
  "data/redirect-devtop/2021/8/780240.json": "I'll be discussing the newest JavaScript/Typescript tips which also includes ES2020 additions &amp;...",
  "data/redirect-devtop/2021/8/779837.json": "(Neither a sponsor nor promotion! It's just my experience with the website!)    Just a few days ago,...",
  "data/redirect-devtop/2021/8/779161.json": "React is an open-source JavaScript library that assists you with building a top interface for both...",
  "data/redirect-devtop/2021/8/778830.json": "The following tips helped me to land my first junior full-stack position in one month back in 2016....",
  "data/redirect-devtop/2021/8/778245.json": "When we are developing JavaScript packages, there is a series of repetitive tasks that we have to...",
  "data/redirect-devtop/2021/8/778480.json": "Building a quote switching component with just HTML, CSS and Javascript",
  "data/redirect-devtop/2021/8/778816.json": "Introduction   Here a list of 5 eBooks that are created by professional and are very...",
  "data/redirect-devtop/2021/8/778679.json": "Hi everyone,   The concept of the closure is one of the tougher concepts for me when I first started...",
  "data/redirect-devtop/2021/8/779381.json": "Clean Code StudioFollow             Clean Code Clean...",
  "data/redirect-devtop/2021/8/780770.json": "In this article, you will discover three ways to do an email validation with JavaScript!   \"An old...",
  "data/redirect-devtop/2021/8/779102.json": "In JavaScript, objects are among the most popular ways to work with and pass around data. In...",
  "data/redirect-devtop/2021/8/779693.json": "Hello Dear Readers &amp; Fellow Developers!  In the previous post, I have shown the way to create a...",
  "data/redirect-devtop/2021/8/778861.json": "The hamburger icon is simply a symbol that has come to mean \"menu\". It's used to toggle a menu or...",
  "data/redirect-devtop/2021/8/780828.json": "JSON Web Tokens are a proposed internet standard that allows for stateless authentication.          ...",
  "data/redirect-devtop/2021/8/779686.json": "Clean Code StudioFollow             Clean Code Clean...",
  "data/redirect-devtop/2021/8/779470.json": "Clean Code StudioFollow             Clean Code Clean...",
  "data/redirect-devtop/2021/8/779425.json": "Hello everyone, my name is Vansh and I'm a frontend developer. In this blog post, I would like to...",
  "data/redirect-devtop/2021/8/779820.json": "Deno, introduced by Ryan Dahl, the creator of  Node during JSConf 2018 has been growing into a major...",
  "data/redirect-devtop/2021/8/778550.json": "About Critical Rendering Path (CRP) and its Optimization, the PRPL pattern and Performance Budget.   ...",
  "data/redirect-devtop/2021/8/779695.json": "Building a React Menu does't have to be daunting. And let's use style-components while we're at it!...",
  "data/redirect-devtop/2021/8/779920.json": "As I refine my stack more and more, one of the values I look for is simplicity. Simplicity allows me...",
  "data/redirect-devtop/2021/8/781230.json": "In this blog I will teach how to make a web scraper with axios and cheerio.  Source Code    const...",
  "data/redirect-devtop/2021/8/780600.json": "Introduction   I believe that success greatly correlates to two things, how  you see the...",
  "data/redirect-devtop/2021/8/780769.json": "Functional programming and currying are topics that have some of us staring at the wall and saying...",
  "data/redirect-devtop/2021/8/779179.json": "My goal writing this post is to emphasize you to deepen your knowledge in the field you are...",
  "data/redirect-devtop/2021/8/780851.json": "Objected Oriented Programming is a great software development approach on it's own however as your...",
  "data/redirect-devtop/2021/8/781168.json": "How Tailwind Is Different From Other Frameworks?  Tailwind is different from frameworks like...",
  "data/redirect-devtop/2021/8/781540.json": "When we are rendering data in React we often grab an array and do a .map() to write out our...",
  "data/redirect-devtop/2021/8/781791.json": "Since it’s birth 26 years ago at Netscape, JavaScript has come a long way. A language which was used...",
  "data/redirect-devtop/2021/8/780885.json": "A Linux cheat sheet for beginners (short, sweet, and to the point)              Linux (Useful...",
  "data/redirect-devtop/2021/8/781222.json": "Hi, DEV Community! I've been working in the software testing field for more than eight years. Apart...",
  "data/redirect-devtop/2021/8/781873.json": "learn how to decouple your business logic in your Laravel app",
  "data/redirect-devtop/2021/8/780833.json": "Some months ago I posted an article about how I built my first personal portfolio. The feedback was...",
  "data/redirect-devtop/2021/8/782314.json": "I've always believed that the best way to learn is by doing. Recruiters prefer practical projects...",
  "data/redirect-devtop/2021/8/779220.json": "Part-I           About   𝐈𝐦𝐚𝐠𝐞 𝐎𝐩𝐭𝐢𝐦𝐢𝐳𝐚𝐭𝐢𝐨𝐧𝐬: with different file formats, Responsive Images Markup,...",
  "data/redirect-devtop/2021/8/781590.json": "1. Tiny bundle size = incredible performance  When in development mode, the size of Tailwind's output...",
  "data/redirect-devtop/2021/8/781008.json": "Vue is a progressive framework for building user interfaces. Unlike other monolithic frameworks, It...",
  "data/redirect-devtop/2021/8/782369.json": "VSCode is a really great Code Editor rather say nearly an IDE or better than that. But this costs a...",
  "data/redirect-devtop/2021/8/781984.json": "In this article, I will talk about how to make theming with CSS variables. With this example, we will...",
  "data/redirect-devtop/2021/8/782292.json": "Hello there,  In this post we will be talking about creating basic shapes in HTML &amp; CSS. Many...",
  "data/redirect-devtop/2021/8/782294.json": "Node's event-driven architecture allows us to execute certain actions when something happens. This is...",
  "data/redirect-devtop/2021/8/781510.json": "This is a preview from my CSSBootcamp.com course.   We'll cover the general setup with also...",
  "data/redirect-devtop/2021/8/781810.json": "If you are familiar with node.js, you know that it is    Ultra Fast ⚡ Ultra Scalable ⚖️ Ultra...",
  "data/redirect-devtop/2021/8/782398.json": "As software developers version control plays an important role in our day to day work life. In this...",
  "data/redirect-devtop/2021/8/782629.json": "Hey everyone! I'm Itay, a fullstack web developer who specializes in back-of-the-frontend code,...",
  "data/redirect-devtop/2021/8/780871.json": "This post originally appeared in my free daily newsletter on startups and engineering.  You can join...",
  "data/redirect-devtop/2021/8/780526.json": "Hello everyone, as you have seen in the title, today we are going to go back to the origins of the QR...",
  "data/redirect-devtop/2021/8/780872.json": "(code is hosted at: https://github.com/djamaile/react-boilerplate-2021)  (last years post:...",
  "data/redirect-devtop/2021/8/782922.json": "Making a qr-code generator is pretty simple tbh because of the existing stuff available on the...",
  "data/redirect-devtop/2021/8/782301.json": "In this video I'm joined by Ebonie, otherwise known as MetalAndCoffee_ — web developer, Metal DJ and...",
  "data/redirect-devtop/2021/8/782675.json": "There's many complaints I see online about Tailwind: it's WET, not DRY, it's the same as inline...",
  "data/redirect-devtop/2021/8/778174.json": "Supabase is an OpenSource Firebase Alternative providing Backend as a Service to various...",
  "data/redirect-devtop/2021/8/781859.json": "A ruled paper pattern with HTML and CSS.",
  "data/redirect-devtop/2021/8/779506.json": "In this article, I’m going to show you two ways of solving a typical interview-style question. The...",
  "data/redirect-devtop/2021/8/781448.json": "Intro   Nowadays, more and more companies adopt Canvas API to implement new shiny things...",
  "data/redirect-devtop/2021/8/781807.json": "What are Web Components?   Web component is a term used for four web standards that help us...",
  "data/redirect-devtop/2021/8/781253.json": "Earlier this week, we spoke about Developer Burnout, which a study found that 83% of developers...",
  "data/redirect-devtop/2021/8/782318.json": "If you found this article helpful, you will most likely find my tweets useful too. So make sure you...",
  "data/redirect-devtop/2021/8/782902.json": "Hi Everyone 👋, hope you all are doing well. 🚀   In this article, I'll tell you how the...",
  "data/redirect-devtop/2021/8/783227.json": "We all want to show off our skills in front of others.. Why not make some cool projects so that we...",
  "data/redirect-devtop/2021/8/783385.json": "New developers think they need a website to get a job. But do hiring managers even care? The results of this survey are clear and provide better alternatives.",
  "data/redirect-devtop/2021/8/782390.json": "Debugging is the skill that all developers should have in their toolbox🧰  No doubt console.log() is a...",
  "data/redirect-devtop/2021/8/782809.json": "Building docker images has been evolving over the years and there are new strategies to do this.  One...",
  "data/redirect-devtop/2021/8/782425.json": "Trending Projects is available as a weekly newsletter please sign up at www.iainfreestone.com to...",
  "data/redirect-devtop/2021/8/782588.json": "Building React applications with NextJS is a great way of getting things in front of customers quickly. But you might find that they aren't using your site because it's too slow. Here's a list of things you might be able to do to improve the performance of your NextJS application.",
  "data/redirect-devtop/2021/8/781805.json": "You might have heard the phrase monorepo earlier before. But, for those who haven't heard anything...",
  "data/redirect-devtop/2021/8/778354.json": "Table of contents    Create a simple todo UI using React. Create a simple backend server...",
  "data/redirect-devtop/2021/8/783072.json": "Object Destructuring   Object destructuring is an approach to access an object's properties....",
  "data/redirect-devtop/2021/8/783907.json": "Full Prado Museum Demo                                  Kerthin        /         ...",
  "data/redirect-devtop/2021/8/783942.json": "Docker is a popular open-source software platform that simplifies the process of creating, managing,...",
  "data/redirect-devtop/2021/8/784108.json": "css, webdev, html, art",
  "data/redirect-devtop/2021/8/784426.json": "Today we'll be making a React hook that will take a media query and will return whether that query...",
  "data/redirect-devtop/2021/8/784422.json": "This is a very big list of Wen Design tools for designers. If you want improve your skills and be a...",
  "data/redirect-devtop/2021/8/783760.json": "When it comes to create a responsive website to fit the every device, It is important to know the...",
  "data/redirect-devtop/2021/8/783922.json": "👋 Hello 👋 I've been a professional software developer for 15 years now and I've had this...",
  "data/redirect-devtop/2021/8/783447.json": "Introduction   Being a Full Stack Developer, I had appeared for Backend Developer position...",
  "data/redirect-devtop/2021/8/784496.json": "Hello everyone, I'm Kushagra Mehta, a final year student from Jaipur. I have joined Unacademy as a...",
  "data/redirect-devtop/2021/8/783495.json": "Scaling cloud resources is easy - so easy, in fact, that many teams end up losing control over their...",
  "data/redirect-devtop/2021/8/782911.json": "Typescript, oh I love it. Take stackoverflow survey, or ask any developer, most of them do. All major...",
  "data/redirect-devtop/2021/8/784277.json": "In the previous posts of this series, I've shown the resolve and reject methods of a Promise and also...",
  "data/redirect-devtop/2021/8/781484.json": "It was February 15th, 2013 and there was no turning back.   It had been a year and half since I took...",
  "data/redirect-devtop/2021/8/784477.json": "PP = Pipeline Pattern   Today, we will learn the Pipeline Pattern and how to use it in Laravel. You...",
  "data/redirect-devtop/2021/8/784805.json": "In this article, we will discuss the 15 useful JavaScript tips for every web developer to save their...",
  "data/redirect-devtop/2021/8/784097.json": "Firebase is one of the most popular Backend-as-a-Service options for a modern tech stack. In addition...",
  "data/redirect-devtop/2021/8/784895.json": "Good programmers write boring code. Great programmers write really boring code   When I came across...",
  "data/redirect-devtop/2021/8/783098.json": "This is a good question. There are some companies that'd like to beg to differ (such as AccessiBe,...",
  "data/redirect-devtop/2021/8/784916.json": "Hello, Today we'll see, how we can easily create a netflix clone using HTML, CSS and JS only. No...",
  "data/redirect-devtop/2021/8/780863.json": "Welcome to the new vue academy ! It will be a list of lot of article on vue! I have 2.5 years of...",
  "data/redirect-devtop/2021/8/784105.json": "Recently, some people used react to find that rendering a large amount of data is particularly slow....",
  "data/redirect-devtop/2021/8/784514.json": "I created this project when I tried to learn proper state management on the frontend. I wanted to...",
  "data/redirect-devtop/2021/8/785037.json": "Okay so the earlier two blogs of mine got a lot of views and now I am thinking to make another blog...",
  "data/redirect-devtop/2021/8/785231.json": "One of the things I was currently interested in was creating a search bar, however I didn't want to...",
  "data/redirect-devtop/2021/8/785024.json": "So this is a bit of fun on a Sunday in response to this article on clean code from @cleancodestudio ...",
  "data/redirect-devtop/2021/8/784912.json": "1. My Study Guide for AWS Solution Architect...",
  "data/redirect-devtop/2021/8/785427.json": "As you can understand from the title of this article, the goal is to be more productive developing...",
  "data/redirect-devtop/2021/8/784486.json": "As web developers, we are constantly looking for new technologies that are interesting and helpful in...",
  "data/redirect-devtop/2021/8/784892.json": "Introduction   One of the most infamous gotchas in JavaScript to beginners is the idea of...",
  "data/redirect-devtop/2021/8/785035.json": "ECMAScript, or ES, is a standardized version of JavaScript. Because all major browsers follow this...",
  "data/redirect-devtop/2021/8/784684.json": "Have you ever written a full stack application with React, Angular, or Vue? This tutorial will cover...",
  "data/redirect-devtop/2021/8/785518.json": "JavaScript Basics    Set of JavaScript basic syntax to add, execute and write basic...",
  "data/redirect-devtop/2021/8/785026.json": "Nestjs is a server-side framework often confused  with the term \"Server-Side Angular\"  Even though...",
  "data/redirect-devtop/2021/8/785506.json": "Have you ever wondered what the ultimate website looked like? Well I am afraid you are going to have...",
  "data/redirect-devtop/2021/8/784461.json": "Hello, everybody! 👋 And welcome to the 3rd lecture of the Styled Components 101 series 🙌  In this...",
  "data/redirect-devtop/2021/8/785968.json": "While working with any language, we tend to use several reusable design solutions to commonly...",
  "data/redirect-devtop/2021/8/784934.json": "After 7 years working as a Technical Director for Valtech, I've decided to go freelance … again (I...",
  "data/redirect-devtop/2021/8/784216.json": "Steps for writing public and private routes in React app using React Router  When developing a React...",
  "data/redirect-devtop/2021/8/785050.json": "Node.js is an open-source, cross-platform, back-end JavaScript runtime environment that runs on the...",
  "data/redirect-devtop/2021/8/779427.json": "Yes, the browser and node.js both use the JavaScript software language - but the literal Run Time...",
  "data/redirect-devtop/2021/8/786306.json": "Most of these JavaScript Hacks uses techniques from ECMAScript6(ES2015) onwards, though the latest...",
  "data/redirect-devtop/2021/8/785966.json": "NPM stands for Node Package Manager, is one of the most used tools for any javascript developer. It...",
  "data/redirect-devtop/2021/8/786296.json": "In this article, we will discuss the 15 useful JavaScript tips for every web developer to save their...",
  "data/redirect-devtop/2021/8/785491.json": "Over the last couple of years, I was privileged to work with many juniors. I have mentored, helped,...",
  "data/redirect-devtop/2021/8/783964.json": "As a senior software engineer at a large growing tech company, I have the privilege of helping...",
  "data/redirect-devtop/2021/8/784697.json": "10 Tips for Clean Code                                               Clean Code Studio ☕   ...",
  "data/redirect-devtop/2021/8/785052.json": "When I wanted to implement Add to home screen feature in an application I was working in flutter, I...",
  "data/redirect-devtop/2021/8/786695.json": "We are excited to announce the release of Vue.js 3.2 \"Quintessential Quintuplets\"! This release includes many significant new features and performance improvements, and contains no breaking changes.",
  "data/redirect-devtop/2021/8/786006.json": "After the CSS loaders, it's time for this collection to reach 500 animations as well. Yes, 500 CSS...",
  "data/redirect-devtop/2021/8/785772.json": "Wow, this is article 500!! 🎉  I wish I could say I did an article a day, like Seth Godin or Flavio...",
  "data/redirect-devtop/2021/8/786545.json": "How hard is it to become a developer? Can I do that? The answer is yes, you can. First of all, it...",
  "data/redirect-devtop/2021/8/787144.json": "React is awesome &amp; one of the most wanted &amp; most used JavaScript frameworks according to...",
  "data/redirect-devtop/2021/8/786917.json": "I recently came across a beautiful html5 template featuring horizontal mouse scrolling here. I'm not...",
  "data/redirect-devtop/2021/8/786540.json": "Bug Smash aims to surface issues in the Forem codebase that are particularly interesting! If you're looking for some open source issues to tackle, we'd love to have you!",
  "data/redirect-devtop/2021/8/783210.json": "WHAT IS A JS ARRAY ?   The JavaScript Array class is a global object that is used in the...",
  "data/redirect-devtop/2021/8/786318.json": "Intro   This is a real life example showing differences of three most common programming...",
  "data/redirect-devtop/2021/8/786515.json": "Introduction   Prisma is an open-source ORM for Nodejs and TypeScript written in Rust. It...",
  "data/redirect-devtop/2021/8/784473.json": "Not all text is a heading     Headings are a very important part of HTML that helps people...",
  "data/redirect-devtop/2021/8/787141.json": "I am in process of creating style guide for my react projects, and started looking online for already...",
  "data/redirect-devtop/2021/8/785942.json": "Let’s say your client comes up with this request: whenever an image is uploaded, do something with...",
  "data/redirect-devtop/2021/8/785790.json": "Simple Code!   Playing football is very simple, but playing simple football is the hardest...",
  "data/redirect-devtop/2021/8/787234.json": "Here Are the top 15 beginner project ideas that are you must try in your programming career.  This...",
  "data/redirect-devtop/2021/8/783750.json": "Hi everyone!  In this post I want to show how to quickly setup a desktop app using this amazing Go...",
  "data/redirect-devtop/2021/8/786246.json": "It's been a few days. You've probably read about this.           Apple plans to scan US iPhones for...",
  "data/redirect-devtop/2021/8/786508.json": "Written by Dylan Tientcheu ✏️  This article is a follow-up to my previous article showcasing a list...",
  "data/redirect-devtop/2021/8/787395.json": "Gary from the DesignCourse YouTube chan here and I'm creating a new series called \"The Boja\" where I teach UI design in a fictional sci-fi setting from the year 2083.",
  "data/redirect-devtop/2021/8/786388.json": "Converting a static page or site into React App is actually simpler than what some might think. The...",
  "data/redirect-devtop/2021/8/787968.json": "All we know about Microservices, which helps to develop, deploy and maintain applications...",
  "data/redirect-devtop/2021/8/788331.json": "This tutorial will guide you through the steps of building a simple Node.js CRUD Operation with MySQL...",
  "data/redirect-devtop/2021/8/788752.json": "I hand-picked some of the most useful code snippets from 30 seconds of code. It's an awesome...",
  "data/redirect-devtop/2021/8/786855.json": "Fullstack interview experience at Nutanix",
  "data/redirect-devtop/2021/8/786544.json": "Connecting node.js project with MySQL database is easy, follow the following steps to connect to the...",
  "data/redirect-devtop/2021/8/787457.json": "Everyone frontend developers nightmare is not able to positioning or align an element where it needs...",
  "data/redirect-devtop/2021/8/788689.json": "1 Hide an element   Yes! you read it right. We can hide an element using HTML. Using the...",
  "data/redirect-devtop/2021/8/787427.json": "This article is about getting started with open source and more specifically how to contribute to...",
  "data/redirect-devtop/2021/8/788147.json": "Intoduction   I want to warn people, which probably will remark about architecture, I...",
  "data/redirect-devtop/2021/8/783869.json": "Kubernetes is an open source  container-orchestration tool which is widely used in the industry for...",
  "data/redirect-devtop/2021/8/787657.json": "Finally, after over two years of writing the boilerplate of React components by hand, I'd decided to...",
  "data/redirect-devtop/2021/8/788007.json": "Frontend Development Every business, brand, and idea has a website. As a result, building websites,...",
  "data/redirect-devtop/2021/8/789036.json": "I did it - I finished my final project for Flatiron School!! It is a simple Symptom Tracking app...",
  "data/redirect-devtop/2021/8/788639.json": "What do developers want? Money, flexible schedules, pizza? Sure. Effortless remote collaboration?...",
  "data/redirect-devtop/2021/8/788025.json": "Javascript is one of the most powerful language in this modern world.In this article we will go...",
  "data/redirect-devtop/2021/8/787636.json": "Asynchronous programming in JavaScript is one of the fundamental concepts to grasp to write better...",
  "data/redirect-devtop/2021/8/789290.json": "I've included 10 amazing GitHub repos which will help you to become a better JavaScript Developer....",
  "data/redirect-devtop/2021/8/788054.json": "Today we're going to discuss how small optimizations in the right places of the application can...",
  "data/redirect-devtop/2021/8/787417.json": "If you care about code quality — then these 5 JetBrains IDEs Plugins are for you! They'll help you...",
  "data/redirect-devtop/2021/8/789461.json": "Most VueJS concepts including VueRouter, Vuex and Composition API",
  "data/redirect-devtop/2021/8/789485.json": "If you’ve read the Contentful docs, you’ll have seen that we provide a REST API and a GraphQL API to...",
  "data/redirect-devtop/2021/8/790094.json": "The fastest way for you to become a good web developer is to practice. This means completing as many...",
  "data/redirect-devtop/2021/8/788409.json": "So this is a bit of a fun response to @inhuofficial 's (10 Tips For Clean DEV Articles!) - a fun post...",
  "data/redirect-devtop/2021/8/789832.json": "Introduction   There are so many ways to structure a Node.js and Express API and each one...",
  "data/redirect-devtop/2021/8/784793.json": "p5.js is a JavaScript library for creative coding, with a focus on making coding accessible and...",
  "data/redirect-devtop/2021/8/788747.json": "We all know that cloud services are the future and aws is one of the leading cloud service provider...",
  "data/redirect-devtop/2021/8/778900.json": "Reactivity is at the heart of many web interfaces. It makes programming robust and interactive web...",
  "data/redirect-devtop/2021/8/788615.json": "Hello, buddies! We love python, right? So today we're going to see some amazing things that can be...",
  "data/redirect-devtop/2021/8/786516.json": "Hy guys!  Today I'm going to share with you the best tips and tricks to master in Python!  These tips...",
  "data/redirect-devtop/2021/8/790232.json": "Hello, Today we'll see, how we can easily create a blogging website using HTML, CSS and JS only. No...",
  "data/redirect-devtop/2021/8/787834.json": "Today’s world you can’t survive without flex-box  as a frontend developer whether you are expert or...",
  "data/redirect-devtop/2021/8/788914.json": "Introduction   Over the last couple of weeks I've been immersing myself in the world of...",
  "data/redirect-devtop/2021/8/790480.json": "The simplest way to create a basic react app is to run npx create-react-app and boom your basic react...",
  "data/redirect-devtop/2021/8/789856.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/8/789893.json": "Responsive Design Doesn't Have To Be Hard                With Flex Box we can easily make...",
  "data/redirect-devtop/2021/8/788672.json": "Lazy Loading   Lazy loading is a way by which we can load content only when they are needed....",
  "data/redirect-devtop/2021/8/789860.json": "TLDR;   I've made a new React Virtual Window component that will virtualise lists and any...",
  "data/redirect-devtop/2021/8/788662.json": "In this article I would do my best to introduce you to algorithmic complexity and a way to roughly...",
  "data/redirect-devtop/2021/8/787879.json": "Implementation: The Building Blocks   This is the essential part of this series. We will...",
  "data/redirect-devtop/2021/8/789462.json": "Docker is an open-source centralized platform designed to create, deploy, and run applications. It ...",
  "data/redirect-devtop/2021/8/789839.json": "สวัสดีครับ ผมนเรศ หรือว่า เรียกสั้น ๆ ว่า นเรศ เฉย ๆ ก็ได้      วันนี้ ผมจะมาวิเคราะห์ระบบลงทะเบียน...",
  "data/redirect-devtop/2021/8/789231.json": "Scaling Rails apps is an process of master app architecture and supporting infrastructure. Learn how it’s done straight from our developer-friendly Rails guide.",
  "data/redirect-devtop/2021/8/789269.json": "Introduction   GitHub has added in-built support to easily open your repository in Visual...",
  "data/redirect-devtop/2021/8/790506.json": "This is an overview of client- and server-side data fetching approaches in React 17, their pros and...",
  "data/redirect-devtop/2021/8/790983.json": "Probably not. Let me explain.",
  "data/redirect-devtop/2021/8/791150.json": "☢️ Warning !!! ☣️ The site is very heavily loaded, be careful. ☣️  Full Portfolio Demo (!!! 15...",
  "data/redirect-devtop/2021/8/790797.json": "Do you think you can build a game using less than 13kB of JavaScript, CSS, and/or HTML in just 30...",
  "data/redirect-devtop/2021/8/789270.json": "Learning how to code isn't the end of the journey for a software developer. It's just the beginning...",
  "data/redirect-devtop/2021/8/789869.json": "Be not afraid! You are about to learn one of the most feared subjects in computer...",
  "data/redirect-devtop/2021/8/791505.json": "Introduction   As Javascript community keeps adding new methods in Javascript, so all...",
  "data/redirect-devtop/2021/8/791208.json": "Authorization guards prevent unauthorized users from accessing the web page when they are not...",
  "data/redirect-devtop/2021/8/791513.json": "Authenticating users via magic link is on the rise recently (for a good reason). Magic link is the...",
  "data/redirect-devtop/2021/8/789941.json": "When designing an effective web application, it’s important to get your software architecture right....",
  "data/redirect-devtop/2021/8/791704.json": "Hey There 👋🏾  In today's post I wanted to ask you all a question.    How many of you really...",
  "data/redirect-devtop/2021/8/791142.json": "If you're wondering what the heck is server side rendering and client side rendering? Let me give you...",
  "data/redirect-devtop/2021/8/791097.json": "A React Boilerplate built with TypeScript and Tailwind CSS using Next JS. It provides ESLint, Prettier and VSCode configuration to quickly start any application.",
  "data/redirect-devtop/2021/8/785634.json": "This article is the second part of the series on Top Facebook Behavioral Interview Questions. In...",
  "data/redirect-devtop/2021/8/791307.json": "About Me: I've been a professional web developer for just over 10 years now. I'm currently the lead...",
  "data/redirect-devtop/2021/8/792020.json": "Node.js console.log and console.error   This built-in console module in Node.js lets you...",
  "data/redirect-devtop/2021/8/792036.json": "Hello everybody, I'm Aya Bouchiha, in this post, I'll share with you 10 amazing javascript libraries....",
  "data/redirect-devtop/2021/8/791200.json": "Anvil's PDF generation API endpoint supports generating PDFs from HTML and CSS. For the sake of...",
  "data/redirect-devtop/2021/8/791879.json": "One of the things that interested me most recently is creating a fully customized video player....",
  "data/redirect-devtop/2021/8/791700.json": "Let's continue working with the Booking process. We're going to use the same UserScreen component...",
  "data/redirect-devtop/2021/8/792224.json": "useEffect is one of the most common React Hooks which every ReactJS developer should know. But using...",
  "data/redirect-devtop/2021/8/792425.json": "Steps to configure absolute Import in Create React App without any third-party packages.  Are you...",
  "data/redirect-devtop/2021/8/791315.json": "Tailwind CSS is an increasingly popular choice for developers to create their sites and apps. Today,...",
  "data/redirect-devtop/2021/8/792095.json": "What is a PWA?    A PWA (Progressive Web Application) is a type of app software delivered...",
  "data/redirect-devtop/2021/8/781018.json": "Form is one of core functionalities that must exist in any application. This functionality allows us...",
  "data/redirect-devtop/2021/8/792365.json": "Hello, Today we'll see, how we can easily create a disney plus UI clone using HTML, CSS and JS only....",
  "data/redirect-devtop/2021/8/791844.json": "Hello Readers, Hope you all are doing well🤩   In this blog post, you will learn how to build...",
  "data/redirect-devtop/2021/8/792007.json": "Top 10 Must-Know JavaScript Functions   Please check out full article here           1...",
  "data/redirect-devtop/2021/8/791464.json": "Hello 👋,  In this article we are going to build own react-redux with the help of context api         ...",
  "data/redirect-devtop/2021/8/791662.json": "What is A Web API?   An API - Application Programming Interface - is simply a way for other...",
  "data/redirect-devtop/2021/8/792035.json": "Welcome to Level up with JavaScript   In this blog series tutorial, you will be introduced...",
  "data/redirect-devtop/2021/8/791874.json": "JavaScript Basics    Set of JavaScript basic syntax to add, execute and write basic...",
  "data/redirect-devtop/2021/8/792916.json": "Short disclaimer - Yes. The title of this post is a bit of a clickbait. Not 100%, but you can...",
  "data/redirect-devtop/2021/8/790262.json": "Hi everyone 👋  Today I wanted to share with you 6 awesome CSS layout generators/tools that will help...",
  "data/redirect-devtop/2021/8/791003.json": "TL;DR: A step-by-step tutorial explaining how to create a desktop application using Create React App...",
  "data/redirect-devtop/2021/8/790975.json": "INTRODUCTION   We just cant imagine our life without git and Github. Being a developer it is...",
  "data/redirect-devtop/2021/8/779710.json": "No promotions included; this is genuinely for helping dev bloggers like me. Some tools below are...",
  "data/redirect-devtop/2021/8/793218.json": "Lodash and underscore changed the way I write Javascript forever, but today there might be better...",
  "data/redirect-devtop/2021/8/783555.json": "A rant about Dev Twitter and how the Twitter Grifters are leading the conversation without really improving it or moving it forward.",
  "data/redirect-devtop/2021/8/792972.json": "🏃🏻‍♂️TLDR    React Native + Redux + NodeJs + MongoDB Atlas + Heroku = Daily Discomfort     ...",
  "data/redirect-devtop/2021/8/792367.json": "A short guide to understand ZoneJs and to solve a problem.      How about no upfront...",
  "data/redirect-devtop/2021/8/791663.json": "Business Logic in Entities Requiring External Services   It is simple to implement a...",
  "data/redirect-devtop/2021/8/793513.json": "Ansible              What is Ansible?   Ansible is an open-source IT Configuration...",
  "data/redirect-devtop/2021/8/793123.json": "Introduction 📚   When you go to GitHub and see some other developers code, most of them are...",
  "data/redirect-devtop/2021/8/793319.json": "Ok so in this blog imma show the top 5 best youtube channel that I personally use to learn. Keep in...",
  "data/redirect-devtop/2021/8/792944.json": "Today, I'll show you how to design a diamond card layout (items should be exactly four) with a few...",
  "data/redirect-devtop/2021/8/793285.json": "Learn how to use Flask and React to code full-stack products that scale with ease - open-source samples included.",
  "data/redirect-devtop/2021/8/794074.json": "Friends, I made the cheat sheet that will help you learn how the CSS display property works. You can...",
  "data/redirect-devtop/2021/8/793643.json": "In this blog, I will show you how you can get data of 50 users from an Random user API in your React...",
  "data/redirect-devtop/2021/8/794492.json": "1. Closures to Extend Variable Scope    Closures in JavaScript are a fairly straightforward...",
  "data/redirect-devtop/2021/8/791519.json": "It can seem like every few weeks there's another new game-changer when it comes to JS frameworks,...",
  "data/redirect-devtop/2021/8/790243.json": "You have to stay updated on trends, social things and dev culture, you need to stay with the times...",
  "data/redirect-devtop/2021/8/793611.json": "Hello, Today we'll see, how we can easily create a music player using HTML, CSS and JS only. No other...",
  "data/redirect-devtop/2021/8/793421.json": "Here are 7 JavaScript shorthands that you as a JavaScript developer should know because who doesn't...",
  "data/redirect-devtop/2021/8/794118.json": "What and Why TypeScript? Difference between TypeScript and Javascript?",
  "data/redirect-devtop/2021/8/792236.json": "How to create a quiz app in nodeJS as a beginner?   NodeJS is a backend platform to run...",
  "data/redirect-devtop/2021/8/788292.json": "GitLive 14.0 has arrived! This update consists mostly of features requested by our users, your...",
  "data/redirect-devtop/2021/8/792611.json": "Hi folks! few months ago I created a boombox illustration by only using css.                        ...",
  "data/redirect-devtop/2021/8/794787.json": "Introduction   I like the power of APIs. They turn simple applications into more useful,...",
  "data/redirect-devtop/2021/8/793775.json": "Welcome dear reader to yet another learning opportunity. I applaud you for the commitment devoted...",
  "data/redirect-devtop/2021/8/792660.json": "Object to Object Mapping   Automatic object to object mapping is a useful approach to copy...",
  "data/redirect-devtop/2021/8/788362.json": "😯 Simple And Easiest way to add an emoji picker to your React app.   Emojis are now such an...",
  "data/redirect-devtop/2021/8/794080.json": "The skills list required to be a full stack developer is long and it can be hard to know exactly what...",
  "data/redirect-devtop/2021/8/794341.json": "When we develop a web app we can think browsers like a swiss knifes, these include a bunch of...",
  "data/redirect-devtop/2021/8/794764.json": "Dealing with Promises shouldn't give you `async`ing feeling. They're how you escape callback hell.",
  "data/redirect-devtop/2021/8/794538.json": "Join us at CodeLand 2021! ",
  "data/redirect-devtop/2021/8/794559.json": "There's no secret method in becoming a better developer.  There's no substitute for hard work.  You...",
  "data/redirect-devtop/2021/8/794696.json": "What is web scraping?   It involves automating the task of collecting information from...",
  "data/redirect-devtop/2021/8/788358.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/8/795146.json": "If we want to prevent our UI from crashing on errors and also have a fallback UI to show this errors...",
  "data/redirect-devtop/2021/8/794791.json": "Hi there 👋   /// NOTE❗ This will be a large post   For 🌩️ fast instructions to get up and running...",
  "data/redirect-devtop/2021/8/795012.json": "Believe it or not, we're already halfway through the year! With time comes change and with change...",
  "data/redirect-devtop/2021/8/793133.json": "Introduction   Hello and welcome, DEV friends! 👋   As you probably know, the printed book...",
  "data/redirect-devtop/2021/8/793148.json": "You're an ambitious but humble person, with a hunger to learn. You're passionate about sharing the...",
  "data/redirect-devtop/2021/8/796294.json": "Introduction   So I have been spending a lot ( so much ) time creating the best coding...",
  "data/redirect-devtop/2021/8/795785.json": "If you ever installed an NPM package the following syntax looks very familiar to you:    npm install...",
  "data/redirect-devtop/2021/8/795548.json": "Have you noticed dark mode is pretty standard lately?   Well, that's because it's badass!  Let's...",
  "data/redirect-devtop/2021/8/794357.json": "This is something that I was inspired to do because of the YouTube channel Fireship, which makes...",
  "data/redirect-devtop/2021/8/795746.json": "Chrome is a fantastic browser — it's quick, well-designed, and jam-packed with useful features – but...",
  "data/redirect-devtop/2021/8/782713.json": "In this tutorial, we'll be building out a site that uses Stripe to create a checkout system, then...",
  "data/redirect-devtop/2021/8/795571.json": "Hi everyone 👋. Today I would like to present you the brand new August edition of my blog post series...",
  "data/redirect-devtop/2021/8/794948.json": "At the moment, there is no standardized way to write asynchronous constructors in JavaScript. However, this does not mean there aren't any workarounds! In this article, we will discuss the various ways to emulate `async` in `constructor`. Most of them are not-so-ideal, but in the end, I will demonstrate the proper way.",
  "data/redirect-devtop/2021/8/793358.json": "Note: This article is for technical folks ranging from beginner to intermediate level. so if you are...",
  "data/redirect-devtop/2021/8/795801.json": "Background vector created by freepik - www.freepik.com  This post was originally published on Leocode...",
  "data/redirect-devtop/2021/8/792379.json": "Hello, In this blog I am gonna walk you through the roadmap for learning React, I've broken down the...",
  "data/redirect-devtop/2021/8/796290.json": "Hello again!, After a short break, I am back again with a non-technical post. As Web-Dev's, we use...",
  "data/redirect-devtop/2021/8/781981.json": "With software development, we are often presented with alternative choices for libraries and tools...",
  "data/redirect-devtop/2021/8/796226.json": "🐞 Today I share with you four ways to convert a string to an array in JavaScript.    const str =...",
  "data/redirect-devtop/2021/8/789634.json": "Do you know you can make money by selling your APIs? Building and selling APIs is a great way to...",
  "data/redirect-devtop/2021/8/797051.json": "I completed 12 years as a software developer this month.  Few honest takeaways about my experience...",
  "data/redirect-devtop/2021/8/795735.json": "Hello guys 😊 Hope you are safe. So after reading this blog i hope you will be able to create a...",
  "data/redirect-devtop/2021/8/795754.json": "In this article, I will go over some practices in JavaScript that will help you in the long run. You...",
  "data/redirect-devtop/2021/8/790278.json": "My name is Viacheslav Aksenov, I am developer of big and complex backend systems. I started from Java...",
  "data/redirect-devtop/2021/8/796709.json": "Yield keyword has always been a highly misunderstood keyword in C#, so I will try to explain it with...",
  "data/redirect-devtop/2021/8/797131.json": "Must known JavaScript console.log() tips &amp; tricks!            JavaScript Console    The...",
  "data/redirect-devtop/2021/8/797167.json": "TL;DR    In order to create composable, reusable and readable components, we use component...",
  "data/redirect-devtop/2021/8/796197.json": "Hey guys!  So after a few years as a frontend developer, I have decided to write my first article....",
  "data/redirect-devtop/2021/8/796505.json": "This question is a sensitive subject all over the internet. Wherever you'll look at, peoples tend to...",
  "data/redirect-devtop/2021/8/795755.json": "You open your business application and your dashboard guides you about Key Performance Indicators in...",
  "data/redirect-devtop/2021/8/797177.json": "10 React Packages which has more than 1K UI Components to speed up the development.  React has a very...",
  "data/redirect-devtop/2021/8/786024.json": "Photo by Daniel Thomas   Writing your first post on DEV can be as unfussy as clicking on the Create...",
  "data/redirect-devtop/2021/8/797841.json": "Google is such a dominant force in the search engine industry that it is the default search engine...",
  "data/redirect-devtop/2021/8/797358.json": "So, you want to get a job as a React developer. Great!  Now, you've likely done (or are doing) the...",
  "data/redirect-devtop/2021/8/797316.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/8/786286.json": "When it comes to interviewing, everyone has their own style and way they like to approach it. When I...",
  "data/redirect-devtop/2021/8/793016.json": "It’s no news that vscode has been and still is one of the best code editors in the market.   Vscode...",
  "data/redirect-devtop/2021/8/796124.json": "Why?   I use dev.to as my main dev blogging area now, but I want to show-off my blogs on my...",
  "data/redirect-devtop/2021/8/798517.json": "Introduction  Today I would like to talk about how to make a Glitch effect using CSS. To do this, I...",
  "data/redirect-devtop/2021/8/798427.json": "There is a great article on writing high quality posts currently on the feed.                        ...",
  "data/redirect-devtop/2021/8/797227.json": "Regular expressions play a vital role in every high-level programming language and so in JavaScript....",
  "data/redirect-devtop/2021/8/798020.json": "Building web apps with React is not just about composing components together and making sure that the...",
  "data/redirect-devtop/2021/8/796880.json": "Are you searching for the best design resources? This is a collection that every developer should...",
  "data/redirect-devtop/2021/8/797995.json": "What is ENV 🤔   env file to store your sensitive credentials like API keys. Environment...",
  "data/redirect-devtop/2021/8/798273.json": "They are functions that may appear to do the same action but have significant differences. And it was...",
  "data/redirect-devtop/2021/8/797981.json": "TL: DR -&gt; Take me to the code: https://github.com/tq-bit/fetch-progress  In an earlier post, I've...",
  "data/redirect-devtop/2021/8/798252.json": "React app optimization techniques you may have never heard of before",
  "data/redirect-devtop/2021/8/798840.json": "Hello, Today we'll see how to make a fully responsive modern portfolio using pure HTML, CSS and JS....",
  "data/redirect-devtop/2021/8/798839.json": "Adding authentication to an application is one of the most challenging 😖 but also a very important...",
  "data/redirect-devtop/2021/8/797993.json": "Is there a perfect file structure for React projects? Probably not. But some are far better than others",
  "data/redirect-devtop/2021/8/799258.json": "Lots of people will get in touch with you about improvements to your developer-oriented product or...",
  "data/redirect-devtop/2021/8/796566.json": "When you pass props from parent to children, you might need to update this data.  In vuejs you have...",
  "data/redirect-devtop/2021/8/798103.json": "Feature Flags (or Feature Toggles) is a way of working with code that allows teams to modify system...",
  "data/redirect-devtop/2021/8/795610.json": "Hi everyone. Almost a year ago I started using vuejs and I like how simple it is to use this...",
  "data/redirect-devtop/2021/8/798270.json": "Cloning objects is one of the most commonly used operations in the JavaScript universe. In this...",
  "data/redirect-devtop/2021/8/799003.json": "One of the most used components in React is undoubtedly modals because they can be used in different...",
  "data/redirect-devtop/2021/8/799150.json": "The word DevOps is a combination of the terms development and operations, meant to represent a...",
  "data/redirect-devtop/2021/8/799157.json": "Seed your MySQL database with dummy data using Node.js.",
  "data/redirect-devtop/2021/8/797948.json": "Let's be honest, we all want to become better react developers. We all have been there where hacking...",
  "data/redirect-devtop/2021/8/797320.json": "My stack to build a SaaS with Next JS and serverless backend. A full-stack react SaaS boilerplate template to kickstart any project.",
  "data/redirect-devtop/2021/8/791300.json": "If you are breaking into web3 software development, all the new vocabulary can be a little...",
  "data/redirect-devtop/2021/8/799306.json": "Today I'm bringing an animation made with GSAP/React, I won't post the entire code because it got a...",
  "data/redirect-devtop/2021/8/797822.json": "With so many languages, frameworks, and libraries to choose from, often beginners find themselves...",
  "data/redirect-devtop/2021/8/799308.json": "HTML      &lt;html lang=\"en\"&gt;   &lt;head&gt;     &lt;meta charset=\"UTF-8\" /&gt;    ...",
  "data/redirect-devtop/2021/8/799174.json": "About Me: I've been a professional web developer for just over 10 years now. I'm currently the lead...",
  "data/redirect-devtop/2021/8/798996.json": "Contributing to open source is a really great way to get real-world software development and other...",
  "data/redirect-devtop/2021/8/799178.json": "If your are a developer for quite some times you will be familiar with these names. These...",
  "data/redirect-devtop/2021/8/797466.json": "Written by Leonardo Maldonado ✏️  The React ecosystem has a very rich and vast community with many...",
  "data/redirect-devtop/2021/8/799582.json": "Why   I love checking out new stuff, apps, apis, websites and such. And my obsession for...",
  "data/redirect-devtop/2021/8/799077.json": "Hey there! 👋   I was bored and wanted to write something. I've ended up with this, a...",
  "data/redirect-devtop/2021/8/799470.json": "Framer Motion is a library for creating awesome animations on React in an easy and fast way, it let...",
  "data/redirect-devtop/2021/8/799766.json": "Code should be written in such a way that is self-explanatory, easy to understand, and easy to modify...",
  "data/redirect-devtop/2021/8/799351.json": "In this article I will show you how to create a modal that pops up whenever you click a button. The...",
  "data/redirect-devtop/2021/8/799464.json": "Why should I care shorthand properties? 🎈   CSS is a language used to describe how a web...",
  "data/redirect-devtop/2021/8/799975.json": "At first it was hard for me to understand the differences because for me, they were the same thing....",
  "data/redirect-devtop/2021/8/799667.json": "In this article I am going to show you how to create Animated Skills Bar using only HTML and CSS...",
  "data/redirect-devtop/2021/8/799462.json": "Hi, I'm Aya Bouchiha, on this beautiful day, I'm going to discuss sending requests in javascript...",
  "data/redirect-devtop/2021/8/799981.json": "1. is-odd   Detect number is odd or not - 2M downloads/month 🎉            2....",
  "data/redirect-devtop/2021/8/798691.json": "IP addresses are an essential part of computer networking. They play an important role in sending and...",
  "data/redirect-devtop/2021/8/799621.json": "Introduction   console.log() is a debugging tool that can assist you to figure out what your...",
  "data/redirect-devtop/2021/8/800050.json": "create your own vue, make your own vue",
  "data/redirect-devtop/2021/8/799005.json": "Closures   Closure is when a function \"remembers\" the variables outside of it, even if you...",
  "data/redirect-devtop/2021/8/799071.json": "Cover image by Lawrence Eagles in the article: What’s new in React Query 3   Hey everyone !  I'm...",
  "data/redirect-devtop/2021/8/800292.json": "2021 is very different from previous years. Many web frameworks have released their new versions....",
  "data/redirect-devtop/2021/8/800458.json": "Regular and arrow functions are often used interchangeably. Yet, they are not the same. There are...",
  "data/redirect-devtop/2021/8/797224.json": "Ah, the dreaded resolve conflicts popup. You've finished crafting the perfect code, just a quick...",
  "data/redirect-devtop/2021/8/800852.json": "Hello, Today we'll see how to instagram UI clone using HTML, css. No library. Our clone looks very...",
  "data/redirect-devtop/2021/8/800200.json": "Introduction   No skill is more important for programmers than the ability to write code...",
  "data/redirect-devtop/2021/8/799612.json": "The pages in Next.js are lazy-loaded so if you fetch some API or fetch data from a database it can...",
  "data/redirect-devtop/2021/8/801124.json": "Many people get stuck while learning how to code cause they don't find good resources. And I was also...",
  "data/redirect-devtop/2021/8/800441.json": "Setting up the app   Creating a Next.js app    npx create-next-app next-tailwind-ts-demo    ...",
  "data/redirect-devtop/2021/8/800274.json": "A lightweight code editor, based on VSCode, that can be accessed via Browser, and it's completely...",
  "data/redirect-devtop/2021/8/797982.json": "Whether you're at the beginning of your CSS journey or somewhere else, you got to admit - a number of...",
  "data/redirect-devtop/2021/8/799791.json": "Technology moves at a frighteningly fast pace and for developers it can feel like we have managed to...",
  "data/redirect-devtop/2021/8/801554.json": "💜 Today, I’m going to share a responsive sidebar navigation with a step-by-step implementation guide....",
  "data/redirect-devtop/2021/8/799980.json": "Why do people say that programming languages as Ruby, Python, PHP, are slow. Let's go deeply into its design",
  "data/redirect-devtop/2021/8/799960.json": "The What?   We want to design a Middleware that - when plugged into an ASP.NET 5 (or .NET...",
  "data/redirect-devtop/2021/8/800005.json": "In this blog series tutorial, I will be covering some of the basic JavaScript programming...",
  "data/redirect-devtop/2021/8/798417.json": "Hola Mundo!     So this is my first coding post and am really excited about it 👩‍🎤✨  Thing...",
  "data/redirect-devtop/2021/8/797308.json": "Typography assumes a major part in a wide range of plans, from item bundling to versatile...",
  "data/redirect-devtop/2021/8/801636.json": "𝗢𝗽𝘁𝗶𝗺𝗶𝘀𝗶𝗻𝗴 𝘆𝗼𝘂𝗿 𝗥𝗲𝗮𝗰𝘁 𝗔𝗽𝗽  Do checkout the video for more details:  https://youtu.be/2woSmgfUjC8  If...",
  "data/redirect-devtop/2021/8/801959.json": "This article is not something you might not already know but maybe you might not have it all listed...",
  "data/redirect-devtop/2021/8/800257.json": "the css ch unit and how to use it",
  "data/redirect-devtop/2021/8/801697.json": "There are countless benefits to becoming a Full-Stack Developer. These days many companies tend to...",
  "data/redirect-devtop/2021/8/801962.json": "I gave some advice in a twitter space the other day and someone asked me to turn it into a blog post. So here we are.",
  "data/redirect-devtop/2021/8/800769.json": "Semantic versioning is a system to help developers, project managers, and consumers have a universal way of understanding the release process.",
  "data/redirect-devtop/2021/8/801538.json": "Web design is a significant component of the web design process. If you're fascinated by web design,...",
  "data/redirect-devtop/2021/8/802661.json": "I previously wrote a blog about 15 JavaScript beginner projects and it was quite popular ( check it...",
  "data/redirect-devtop/2021/8/801729.json": "VSCode is one of the most popular editors for web development. When writing code, we often require...",
  "data/redirect-devtop/2021/8/801293.json": "Don't expect any fancy images in this post, let's get down to business. I'm just gonna hope you're...",
  "data/redirect-devtop/2021/8/802001.json": "Generally, custom hook is a great pattern in order to handle modularity and composition in your app....",
  "data/redirect-devtop/2021/8/801468.json": "Often times, web accessibility is talked about as some abstract, intangible concept.  In reality,...",
  "data/redirect-devtop/2021/8/799323.json": "We unavoidingly tap into function purity, point free syle, recursion, immutability etc.. when...",
  "data/redirect-devtop/2021/8/796284.json": "Introduction   Fastify is a web server framework like ExpressJS but with better...",
  "data/redirect-devtop/2021/8/802008.json": "Automation is the best answer to controlling cloud costs, especially if you work with modern...",
  "data/redirect-devtop/2021/8/801381.json": "In this tutorial you’ll learn how to use localStorage a property of the window interface that allows...",
  "data/redirect-devtop/2021/8/798525.json": "Google PageSpeed Insights is a tool you can use to measure the perceived latency of your website....",
  "data/redirect-devtop/2021/8/800833.json": "I am summarising everything that I have learnt today. If you also want to go through the same topic,...",
  "data/redirect-devtop/2021/8/800013.json": "Hey Folks! I hope you are doing great.  As you know from the announcements that I've recently joined...",
  "data/redirect-devtop/2021/8/802329.json": "If you don't want to get your first, or dream, developer job then follow these tips to absolutely...",
  "data/redirect-devtop/2021/8/802841.json": "Blogging and Technical Writing has become extremely popular these days. I think it's one of the few...",
  "data/redirect-devtop/2021/8/797426.json": "🔶 Introduction   Imagine a web application which sends hundreds of requests per second to a...",
  "data/redirect-devtop/2021/8/800041.json": "In this post, I’ll share some details around design decisions and mistakes I made while working on...",
  "data/redirect-devtop/2021/8/803142.json": "Hello, Today we'll see how to make fully responsive product page using only pure HTML and CSS. Our...",
  "data/redirect-devtop/2021/8/803105.json": "Well as a human, I love free things 😒. So, I have gathered some free resources that I've used over...",
  "data/redirect-devtop/2021/8/802851.json": "VsCode extensions are the backbone on the text editor. You can add language, keymaps, plugins,...",
  "data/redirect-devtop/2021/8/803495.json": "We all love design patterns, and we all wonder when it's best to use them, I'm going to use one of...",
  "data/redirect-devtop/2021/8/802818.json": "Before starting, you can see for yourself by clicking on the link →...",
  "data/redirect-devtop/2021/8/796777.json": "Jay is a member of the NestJS core team, primarily helping out the community on Discord and Github...",
  "data/redirect-devtop/2021/8/802682.json": "Application Programming Interface is the abbreviation for API. An API is a software interface that...",
  "data/redirect-devtop/2021/8/791701.json": "Serie of article in order to learn Golang language by concrete applications as example",
  "data/redirect-devtop/2021/8/799376.json": "Hello Designers ..   Today I was practicing front-end development, so that I thought that it...",
  "data/redirect-devtop/2021/8/803090.json": "One of the core concepts of JavaScript is asynchronicity, which means doing many things...",
  "data/redirect-devtop/2021/8/804012.json": "With the advancements made in the field of modern day machine-learning technologies, it has become...",
  "data/redirect-devtop/2021/8/804035.json": "As a developer, you’re always looking for cutting-edge tools, tricks, and extensions to improve your...",
  "data/redirect-devtop/2021/8/804257.json": "How can you tell which cloud provider is the right one for your business? And which one isn’t going...",
  "data/redirect-devtop/2021/8/802838.json": "Django is the most popular Python framework, which you can build a robust web application. Django...",
  "data/redirect-devtop/2021/8/801489.json": "Web3 is Reshaping the Digital World",
  "data/redirect-devtop/2021/8/787671.json": "Video killed the radio star, internet killed the video star, and with this tutorial I'm going to show...",
  "data/redirect-devtop/2021/8/804049.json": "In my previous article, I created a fragmentation effect using CSS mask and custom properties. It was...",
  "data/redirect-devtop/2021/8/803469.json": "\"Do you know how to get rid of this weird primodials issue?\" I was asked across the office...",
  "data/redirect-devtop/2021/8/804045.json": "When you start a new job it is important that you are well prepared and ready to absorb everything...",
  "data/redirect-devtop/2021/8/804283.json": "Recently, I had a task to start working with a new framework - Blazor. This is the first time I have...",
  "data/redirect-devtop/2021/8/802679.json": "ESLint is a linter that helps to improve the code quality and fix bugs beforehand to avoid them from...",
  "data/redirect-devtop/2021/8/804032.json": "Earlier this week we spoke about some helpful UX tips to keep in mind when you are creating...",
  "data/redirect-devtop/2021/8/804881.json": "20+ Design Patterns explanation in JavaScript    We will discuss implementation of Design Patterns...",
  "data/redirect-devtop/2021/8/803847.json": "State management is one of the most complicated, and opinionated topics in modern and...",
  "data/redirect-devtop/2021/8/803864.json": "Steps to build a portfolio website using Next.js and Tailwind with Dark Mode Support.    You can...",
  "data/redirect-devtop/2021/8/804625.json": "react-toastify v8",
  "data/redirect-devtop/2021/8/805126.json": "Who doesn't love free things?            nobody   Henceforth, I present before you a curated...",
  "data/redirect-devtop/2021/8/804595.json": "I often find myself looking up commands or forgetting what I did for a simple task. Thought it would...",
  "data/redirect-devtop/2021/8/802842.json": "Avoid disregard an argument based on the author      In Argumentation Theory, there are...",
  "data/redirect-devtop/2021/8/804984.json": "As a developer, we all know a little about Git and GitHub but there are some developers who still...",
  "data/redirect-devtop/2021/8/804572.json": "The last few weeks I have been learning Python. I'm following this roadmap: 30-days-of-python Series'...",
  "data/redirect-devtop/2021/8/803848.json": "What is a Promise in JavaScript:            Definition by MDN:   A Promise is a proxy for a...",
  "data/redirect-devtop/2021/8/802886.json": "Wondering how to build a website crawler and parser at scale? Implement a project to crawl, scrape,...",
  "data/redirect-devtop/2021/8/804586.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/8/805510.json": "Introduction  Today I would like to talk about browser plugins that help make the life of a web...",
  "data/redirect-devtop/2021/8/805387.json": "I tried to come up with my own CSS-only version of a typewriter effect.",
  "data/redirect-devtop/2021/8/804952.json": "Hot to Create a new repository   create a new directory, open it and perform a    git...",
  "data/redirect-devtop/2021/8/799126.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/8/804285.json": "Hello to all front-end enthusiasts! I’m back with a fresh portion of news and updates related to...",
  "data/redirect-devtop/2021/8/803490.json": "TLDR    We used Scrum at our previous startup and at Airbnb, with a few tweaks.     We currently use...",
  "data/redirect-devtop/2021/8/804559.json": "I don’t know if you read our Scalable Vector Graphics Tutorial. If you have not read it, I...",
  "data/redirect-devtop/2021/8/806035.json": "Hey Guys 👋   Ever wondered how some websites have \"click to copy\" functionality?     You can...",
  "data/redirect-devtop/2021/8/806304.json": "Have you ever created an article that was excellent, fine tuned it to perfection, released it...and...",
  "data/redirect-devtop/2021/8/806426.json": "GitHub recently released github.dev, which if you haven't heard, allows you to press . from any repo,...",
  "data/redirect-devtop/2021/8/806240.json": "You want a Typewriter effect for your text but you are lost within all the variations that use JS and...",
  "data/redirect-devtop/2021/8/805529.json": "Using APIs in your react project is a common use case. In this tutorial, we will be looking at two...",
  "data/redirect-devtop/2021/8/806249.json": "About Me: I've been a professional web developer for just over 10 years now. I'm currently the lead...",
  "data/redirect-devtop/2021/8/806021.json": "INTRODUCTION   Object-oriented programming is a term that as a developer, you hear a lot and...",
  "data/redirect-devtop/2021/8/806311.json": "Hello Everyone Today I am going to show you how to write QuickSort Algorithm in...",
  "data/redirect-devtop/2021/8/806281.json": "Contributing to open-source is one of the best ways to gain skills and build your resume as a student...",
  "data/redirect-devtop/2021/8/805739.json": "Hoppscotch is announcing the 2.0 release of the app. Along with it comes a look into the changes to come!",
  "data/redirect-devtop/2021/8/805566.json": "We’ve all experienced the effects of chaos and entropy. You put your neatly-wired earbuds in your...",
  "data/redirect-devtop/2021/8/806034.json": "As a college student, I bounce on every opportunity I can to have fun or further my career. A...",
  "data/redirect-devtop/2021/8/806259.json": "In this tutorial, I am going to show you how to start building interactive web applications starting...",
  "data/redirect-devtop/2021/8/806717.json": "Creating a React App is a very difficult feat, even when you are an experienced developer. That led...",
  "data/redirect-devtop/2021/8/806489.json": "For first-timers , Javascript might seem easy at first with its C-like syntax...  However the way it...",
  "data/redirect-devtop/2021/8/806499.json": "In this blog, I’d be explaining few best practices when working with React/React-Native or any other...",
  "data/redirect-devtop/2021/8/806283.json": "There are different ways to implement dark mode on websites, from the simplest to the most complex,...",
  "data/redirect-devtop/2021/8/806052.json": "If you store information in a relational database, I bet you wish you had a handy application through...",
  "data/redirect-devtop/2021/8/806046.json": "Before we appreciate the existence of ExpressJS, we must know how things go around without it. The...",
  "data/redirect-devtop/2021/8/806725.json": "Memoization is a useful concept. It helps avoid time taking or expensive calculations, after it's...",
  "data/redirect-devtop/2021/8/806864.json": "Hello, Today we will do working on some advance features of our blogging website that we made 2 week...",
  "data/redirect-devtop/2021/8/807029.json": "I don't know if I'm just feeling a bit nostalgic, but one of my favorite childhood memories was...",
  "data/redirect-devtop/2021/8/807066.json": "After sharing a typewriter effect with CSS, ChallengesCss beat the drums of \"CSS War\" and created a different effect, and InHuOfficial hopped in and is preparing a \"type-righter\"... Here's another entry: an animated no-element cartoon of a typewriter",
  "data/redirect-devtop/2021/8/806474.json": "Hello again from codereaper08! Thanks again to all my followers, who always motivate me to write...",
  "data/redirect-devtop/2021/8/782458.json": "Hello, everybody! 👋  And welcome to the first lecture of the UX 101 series 🙌  In this series, we will...",
  "data/redirect-devtop/2021/8/806881.json": "Industry focused roadmap to be JavaScript developer – 2021 ",
  "data/redirect-devtop/2021/8/807248.json": "Apparently a battle of sorts has erupted amongst devs clamoring for the title of Best Typewriter...",
  "data/redirect-devtop/2021/8/806952.json": "Hello guys, you might have probably heard the popular name \"TypeScript\" if you are into Web...",
  "data/redirect-devtop/2021/8/807725.json": "1. Jokes API     Simple jokes API.  The majority of these jokes were contributed by...",
  "data/redirect-devtop/2021/8/807216.json": "In these modern times, your web applications can be viewed in a variety of screen sizes -- from small...",
  "data/redirect-devtop/2021/8/807227.json": "Originally published on my personal blog           Motivation   As a developer who tries to...",
  "data/redirect-devtop/2021/8/807057.json": "I am a sinner, it is far more fun than being good 😉. So let's see how we can use the 7 deadly sins to...",
  "data/redirect-devtop/2021/8/807519.json": "Intro   So exactly 12 months ago I landed a job as a Developer Advocate at AWS. A job title,...",
  "data/redirect-devtop/2021/8/807265.json": "Get tired of the classic typewriter and its blinking caret? I am here to the rescue with my...",
  "data/redirect-devtop/2021/8/807079.json": "Animations are the game changer when it comes to quality user experience. Everyone wants to use it...",
  "data/redirect-devtop/2021/8/807924.json": "I'm a big fan of Web Components, they're super useful. But have you ever thought of using them as an...",
  "data/redirect-devtop/2021/8/808260.json": "User authentication is one of the integral parts while developing a web application. Although we can...",
  "data/redirect-devtop/2021/8/807984.json": "Let's look into JavaScript Event loop from a different angle. Sounds interesting, right? It is! So,...",
  "data/redirect-devtop/2021/8/807613.json": "As a developer you work with variables every day. One interesting thing about variables is that they...",
  "data/redirect-devtop/2021/8/806710.json": "Every beginner has been there. Once you really start to get efficient at HTML, CSS and Javascript,...",
  "data/redirect-devtop/2021/8/808457.json": "Relatively new Git features that actually have me excited",
  "data/redirect-devtop/2021/8/807789.json": "Let's be honest here looking for work is a stressful experience there is no other way to say it. It...",
  "data/redirect-devtop/2021/8/800412.json": "Hello Coders!👋    JavaScript is one of the leading names when it comes to front-end web...",
  "data/redirect-devtop/2021/8/807914.json": "This post was originally published at kais.blog.     As a software developer, there is one topic that...",
  "data/redirect-devtop/2021/8/808089.json": "“I'm a pretty lazy person and am prepared to work quite hard in order to avoid work.” Martin...",
  "data/redirect-devtop/2021/8/807598.json": "How to become a Full Stack Web Developer   If you want to become a full stack developer, you...",
  "data/redirect-devtop/2021/8/808479.json": "10 awesome react libraries &amp;...",
  "data/redirect-devtop/2021/8/808838.json": "JavaScript Developers and Designers are very familiar with design systems. It is essentially the...",
  "data/redirect-devtop/2021/8/809109.json": "A React folder structure that fits my needs. Structuring and organizing React applications.",
  "data/redirect-devtop/2021/8/808330.json": "I first used GraphQL on a project right after its launch in 2015, and to be honest I didn't...",
  "data/redirect-devtop/2021/8/803274.json": "The Git plugin that comes bundled with all JetBrains IDEs is actually quite impressive, it's a full...",
  "data/redirect-devtop/2021/8/808037.json": "Hi. This time, let's create a cool 404/503... error page with Laravel.           Error page structure...",
  "data/redirect-devtop/2021/8/808583.json": "In this blog, you will know how I became a front-end developer without any related degree. I landed...",
  "data/redirect-devtop/2021/8/807196.json": "In this blog post I will show you a way of protecting GitHub repositories from random pushes of...",
  "data/redirect-devtop/2021/8/808262.json": "Embed Daily Prebuilt and add custom video call controls to any Vue app",
  "data/redirect-devtop/2021/8/809473.json": "There are very few things I missed when I quit spending time on Twitter, but one of them was keeping...",
  "data/redirect-devtop/2021/8/808563.json": "Can you all relate to the above image either while solving tough problems on LeetCode, GeeksforGeeks,...",
  "data/redirect-devtop/2021/8/807908.json": "Following are the best open source vuejs admin templates. Before we start the collection let's know...",
  "data/redirect-devtop/2021/8/808848.json": "React with Flask? That's a fantastic combination.  You've most likely used Flask without a frontend...",
  "data/redirect-devtop/2021/8/808872.json": "Why Microservice architecture?   Nowadays with the rise of social media, fast internet,...",
  "data/redirect-devtop/2021/8/808072.json": "JavaScript Basics   Set of JavaScript basic syntax to add, execute and write basic...",
  "data/redirect-devtop/2021/8/808676.json": "Users’ first interaction with any website is with the frontend. Most developers don’t want to spend...",
  "data/redirect-devtop/2021/8/808921.json": "So you have written your Django Application and you are ready to deploy it?   Although there are...",
  "data/redirect-devtop/2021/8/809058.json": "Javascript and web scraping are both on the rise. We will combine them to build a simple scraper and...",
  "data/redirect-devtop/2021/8/809106.json": "Welcome   For my employment we have been asked to learn/revisit ES6 as we begin to transfer...",
  "data/redirect-devtop/2021/8/806317.json": "TABLE OF CONTENTS            1. What is the DOM?            2. DOM API            3. Our...",
  "data/redirect-devtop/2021/8/809186.json": "Razor is a markup syntax for embedding .NET based code into webpages. It includes Razor markup, C#,...",
  "data/redirect-devtop/2021/8/808849.json": "Cover image by Mark Tegethoff on Unsplash   If you have ever wondered how to make sure that your...",
  "data/redirect-devtop/2021/8/801667.json": "Hello folks,   Few days back I came across the use-case of infinite scroll in React. For this, I used...",
  "data/redirect-devtop/2021/8/808047.json": "Hi Everyone 👋  Today I wanted to share some of the most common use cases for Array sort() method in...",
  "data/redirect-devtop/2021/8/808887.json": "For all those who have been waiting for Appwrite's realtime service, we have good news. The latest...",
  "data/redirect-devtop/2021/8/808884.json": "Realtime service is one of the most sought after features of Appwrite and it's now ready to play...",
  "data/redirect-devtop/2021/8/807985.json": "Hi, Do you know that about 1 month ago (to be exact 20 days ago) I made a game?  What?  You haven't...",
  "data/redirect-devtop/2021/8/808912.json": "how to check if a user selected location inside the radius you allow like 5KM radius a specific point. ",
  "data/redirect-devtop/2021/8/806416.json": "1. CODE MONKEY   Website Link    Code monkey covers text-based coding languages of CoffeeScript and...",
  "data/redirect-devtop/2021/8/807994.json": "A super versatile code editor",
  "data/redirect-devtop/2021/8/790515.json": "Introduction   Monolith Architecture is a design model for a software program. Under this...",
  "data/redirect-devtop/2021/8/808856.json": "When I was a kid, I used to play puzzle games a lot. One of them was called Sokoban. The principle is...",
  "data/redirect-devtop/2021/8/801050.json": "“What branch are you on?” is often the first question you ask when a teammate says “The tests aren't...",
  "data/redirect-devtop/2021/8/808903.json": "🤔 What is Appwrite?   Appwrite is a new open-source, end-to-end, backend server for web and...",
  "data/redirect-devtop/2021/8/799604.json": "After I finished the first article I wasn't sure how long it would be before we'd have enough topics...",
  "data/redirect-devtop/2021/8/780534.json": "Hello everyone, today we will see how to create a qr code generator with the open source library...",
  "data/redirect-devtop/2021/8/806613.json": "De cero a desarrollador web en nueve simples pasos.    Pero antes de comenzar, conozcamos su...",
  "data/redirect-devtop/2021/8/799615.json": "So, before starting the topic, I want to ask you one thing is...           How do you think about...",
  "data/redirect-devtop/2021/8/788688.json": "If you’re an Angular developer, you’re missing out if you’re not using advanced TypeScript features...",
  "data/redirect-devtop/2021/8/804337.json": "You asked your teammate for help with a piece of code and they showed you the solution in their...",
  "data/redirect-devtop/2021/8/779089.json": "Hello,Dev Friends.In this article I want to talk about some of the mistakes we often do as a beginner...",
  "data/redirect-devtop/2021/8/793634.json": "In this day and age of web development being done using mostly JavaScript frameworks, semantic HTML...",
  "data/redirect-devtop/2021/8/780051.json": "As a frontend developer, you'll be building out web designs (usually handed over from a User...",
  "data/redirect-devtop/2021/8/786483.json": "It's hard to maintain a state. Harder to maintain a UI. And near impossible to keep a user happy.  No...",
  "data/redirect-devtop/2021/8/793090.json": "Welcome to our Dev.to blog!   Everything about Cloud &amp; Tech  At CloudTech, Our Goal is..."
}