{
  "data/redirect-devtop/2021/9/810571.json": "Many developers or beginners just learn all the fundamentals concepts but they don't implement those...",
  "data/redirect-devtop/2021/9/810285.json": "Hello dear developers, In today's blog, we'll see how to make an exclusive Product landing page using...",
  "data/redirect-devtop/2021/9/810584.json": "Not very long ago I gave a talk about the clean architecture on frontend. In this post I'm outlining...",
  "data/redirect-devtop/2021/9/810195.json": "It can feel like you are a ghost when your articles get zero likes and low engagement. This is...",
  "data/redirect-devtop/2021/9/810147.json": "Hello, welcome. In today's blog, we'll see how to make awesome fully working tile navigation system...",
  "data/redirect-devtop/2021/9/810222.json": "For those who are unfamiliar with this library, I advise you to try it, as it can de facto become the...",
  "data/redirect-devtop/2021/9/810010.json": "Angular has many types of Observables which you can use. Maybe you've seen Subject, BehaviourSubject,...",
  "data/redirect-devtop/2021/9/809970.json": "A good programmer is someone who always looks both ways before crossing a one-way street. ~Doug...",
  "data/redirect-devtop/2021/9/810985.json": "So I built a SaaS in 30 days... and it was way more complicated that I originally thought, but check...",
  "data/redirect-devtop/2021/9/810612.json": "What if controlling a modal was easy as writing the following effect:    const someModal =...",
  "data/redirect-devtop/2021/9/811095.json": "React.useEffect() is one of the React hooks that manages side-effects in functional React components....",
  "data/redirect-devtop/2021/9/811465.json": "The game has changed. You don't need a College or University Degree to be a developer anymore. I am...",
  "data/redirect-devtop/2021/9/810682.json": "🎇 MERN stands for MongoDB, Express, React, Node these four things added to make the stack.While...",
  "data/redirect-devtop/2021/9/810460.json": "Hello Guys today I am going to show you how to search element in React in Real Time without clicking...",
  "data/redirect-devtop/2021/9/811340.json": "I used to carry my “Korg Kaossilator” around with me. For those of you who don't know what that is –...",
  "data/redirect-devtop/2021/9/810927.json": "How to create a REST API with Python and Django step by step ",
  "data/redirect-devtop/2021/9/810292.json": "What you’ll be building. Demo, Git Repo Here.   Figure 1.1 Facebook Clone   Figure 1.2. The Chat...",
  "data/redirect-devtop/2021/9/811142.json": "This article was originally published on my personal blog  Internationalization, or i18n, is...",
  "data/redirect-devtop/2021/9/811790.json": "We've all been there. You've got comments on your code from a reviewer and it feels like you might as...",
  "data/redirect-devtop/2021/9/811869.json": "After the scalable one-line typewriter and the crazy \"scrabble\"-writer let's do a last one: The...",
  "data/redirect-devtop/2021/9/811857.json": "Due to COVID-19 Pandemic the whole world had shifted to Digital Platform which affect the website...",
  "data/redirect-devtop/2021/9/810851.json": "There is a project called ESBuild, basically a bundler like web-pack or rollup, and it has been...",
  "data/redirect-devtop/2021/9/810617.json": "Material-ui is a ui framework for react based on Material Design which is developed by Google .  I...",
  "data/redirect-devtop/2021/9/811143.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/9/811810.json": "ECMAScript, the standardized version of JavaScript is increasing its popularity and is becoming...",
  "data/redirect-devtop/2021/9/812924.json": "Introduction  Today I would like to give examples of good GitHub repositories that will help you...",
  "data/redirect-devtop/2021/9/812343.json": "If you’re no stranger to developer workflow then you know that sometimes - Git happens! The good news...",
  "data/redirect-devtop/2021/9/811164.json": "From time to time, we come across situations where the type isn't known beforehand, i.e. could be...",
  "data/redirect-devtop/2021/9/811481.json": "In this article, I am going to show you how to create an Accordion Menu menu using HTML, CSS, and...",
  "data/redirect-devtop/2021/9/812341.json": "Unix was released in October 1973. Today there are many different versions based on Unix. The most...",
  "data/redirect-devtop/2021/9/811449.json": "When I started to learn Next.js, I got overwhelmed with the list of abbreviations that looks similar,...",
  "data/redirect-devtop/2021/9/811995.json": "A typewriter effect done in pure CSS and HTML (no JS). Another entry for the \"CSS-war\" started by Temani Afif.",
  "data/redirect-devtop/2021/9/811817.json": "Serverless Cloud is a new serverless app platform from Serverless, Inc. Unlike the Serverless Framework, it does not deploy your application directly to AWS. Instead, it lives on a new hosting service in the cloud with a dashboard and real-time logs.",
  "data/redirect-devtop/2021/9/810956.json": "what is React and JSX?   REACT  is an open-source framework to create user interfaces. It's...",
  "data/redirect-devtop/2021/9/811441.json": "If you want to set an authentication system like jwt, then you have to store your token inside the...",
  "data/redirect-devtop/2021/9/812913.json": "Fetching data from the backend is one of the crucial parts of the web application. For every...",
  "data/redirect-devtop/2021/9/813379.json": "Hey guys. Notifications are vital if you want to drive traffic to your web...",
  "data/redirect-devtop/2021/9/811846.json": "Have you ever felt stuck in your studies? Let's talk about it  If you're reading this you've probably...",
  "data/redirect-devtop/2021/9/813525.json": "Hello, Today we'll see, how we can easily create a music player using HTML, CSS and JS only. No other...",
  "data/redirect-devtop/2021/9/813041.json": "Hi I'm Aya Bouchiha, I decided to share with you my favorite react library for providing logging in...",
  "data/redirect-devtop/2021/9/812939.json": "TypeScript is growing rapidly in popularity, but isn't worth the effort for some projects. However,...",
  "data/redirect-devtop/2021/9/811473.json": "Whether it be testing out markdown, creating your next viral blog cover, or making cool and minimal...",
  "data/redirect-devtop/2021/9/810959.json": "Hello Everyone 👋 Thanks for all the ❤️ 🔖 and 🦄 on the previous post. I use this space to share...",
  "data/redirect-devtop/2021/9/811866.json": "TL;DR    Z-Indexes can get messy fast. It's common to pick z-indexes by guessing! There are...",
  "data/redirect-devtop/2021/9/811406.json": "If you want to get started with Cloud &amp; DevOps but don't know where I've compiled some incredible...",
  "data/redirect-devtop/2021/9/813595.json": "Working in a nice place makes you feel more productive, if you enjoy the look of your code, then you...",
  "data/redirect-devtop/2021/9/813375.json": "Minimize CO2 emissions  Photo by Noah Buscher on Unsplash  We had an interesting presentation about...",
  "data/redirect-devtop/2021/9/813402.json": "I was recently filling a survey form built on Typeform (Highly recommend using) and I must say that...",
  "data/redirect-devtop/2021/9/812934.json": "A complete Flask tutorial for beginners             I made this tutorial to help and teach...",
  "data/redirect-devtop/2021/9/813186.json": "Choosing the best backend web development framework is a little bit harder for beginners. With the so...",
  "data/redirect-devtop/2021/9/812948.json": "Quick Summary   Software development is great and fun but it can be a mess and a very bad...",
  "data/redirect-devtop/2021/9/813836.json": "While Programming, you are bound to encounter Repetitive Code, writing which is a complete waste of...",
  "data/redirect-devtop/2021/9/813361.json": "Event Listeners help us in binding functions which are called when that event is emitted, like...",
  "data/redirect-devtop/2021/9/811820.json": "Stop using HTML as the dumping ground for your build process du jour. We can do better.",
  "data/redirect-devtop/2021/9/813341.json": "Hooks are a new feature introduced in React 16.8 and available in later versions. We can use state...",
  "data/redirect-devtop/2021/9/813598.json": "In this blog series tutorial, I will be covering some of the basic JavaScript programming...",
  "data/redirect-devtop/2021/9/813968.json": "I always wanted to build a unique portfolio for myself and was inspired by a lot of portfolios. Right...",
  "data/redirect-devtop/2021/9/814168.json": "Exploring scenarios where computed properties might degrade your Vue component's performance.",
  "data/redirect-devtop/2021/9/814326.json": "A curated list with pixel-perfect dashboards to use for free in 2021: Soft UI, Volt, Berry, CoreUI, and Star Admin. All products are open-source released under MIT License on Github.",
  "data/redirect-devtop/2021/9/813980.json": "1. Problem   In the lifecycle of a component, React re-renders the component when an update...",
  "data/redirect-devtop/2021/9/813987.json": "Create simple Step progress bar in HTML, CSS and JavaScript.           HTML      &lt;!DOCTYPE...",
  "data/redirect-devtop/2021/9/813949.json": "Hey All 👋 , with this article I'm going to start a series of articles on JavaScript concepts. So I'm...",
  "data/redirect-devtop/2021/9/813392.json": "As a part of a backoffice team in a financial organisation, I have to deal with a lot of complex data...",
  "data/redirect-devtop/2021/9/814201.json": "I am totally new in web development and this is my first blog, any sorts of suggestion or comments is...",
  "data/redirect-devtop/2021/9/812897.json": "A quick walkthrough on how to build a search bar feature with Javascript           What’s a Search...",
  "data/redirect-devtop/2021/9/814056.json": "In this post, I will enhance The Multi-line Typewriter to create more fancy variation of \"writer...",
  "data/redirect-devtop/2021/9/814828.json": "A collection of JavaScript libraries, resources and shiny things.              Package...",
  "data/redirect-devtop/2021/9/814385.json": "Contents    Overview Implementation Conclusion               Overview   Displaying the...",
  "data/redirect-devtop/2021/9/814896.json": "A stumbling block for almost all aspiring writers is what should I write about? Writers block...",
  "data/redirect-devtop/2021/9/814528.json": "Why in the world do do hex or rgb colors have to be so hard to remember? Not to mention how much of a...",
  "data/redirect-devtop/2021/9/813568.json": "Binary Search is one of the fastest searching algorithms, especially when it comes to searching large...",
  "data/redirect-devtop/2021/9/815191.json": "Text symbols aren't the best way to create graphic   There is a practice of creating...",
  "data/redirect-devtop/2021/9/813837.json": "Hello Everyone...👋 In this Post, we briefly look at object-oriented programming concepts in...",
  "data/redirect-devtop/2021/9/814145.json": "If you haven't read part-1 &amp; part-2, please first read those else you'll feel this article is...",
  "data/redirect-devtop/2021/9/813988.json": "What is TypeScript?   TypeScript is a superset of JavaScript. It provides all the features...",
  "data/redirect-devtop/2021/9/809992.json": "Want to boost up your productivity as a programmer? Well then, here is the list of 15+ Best...",
  "data/redirect-devtop/2021/9/815114.json": "One of the core things I've been working on for the past 10 years are APIs. Everything from simple...",
  "data/redirect-devtop/2021/9/814317.json": "We all know Dark mode is one of the hottest features from 2019. Everything from smartphones, laptops,...",
  "data/redirect-devtop/2021/9/815377.json": "Launching 🚀           Dopefolio 🔥 - An OpenSource Multipage Portfolio Website Template for Developers...",
  "data/redirect-devtop/2021/9/815786.json": "Hello Coders!👋   Welcome back to the Javascript project series. Today i'm share another...",
  "data/redirect-devtop/2021/9/813369.json": "Each year, new lists of UI design trends are published, as is the case with trends. However, there is...",
  "data/redirect-devtop/2021/9/815546.json": "Objects and Prototypes   Like many object-oriented languages, JavaScript provides support...",
  "data/redirect-devtop/2021/9/816338.json": "What is React?   React is a free and Open Source Front End JavaScript Library for building...",
  "data/redirect-devtop/2021/9/814188.json": "Over the past few years I have created tons and tons of models in Laravel. These models have always...",
  "data/redirect-devtop/2021/9/814904.json": "Reversing a String is indeed one of the most common and needed operations in JavaScript. During the...",
  "data/redirect-devtop/2021/9/815744.json": "Intro   As part of a project at work, I had to develop a way to intercept and store HTTP...",
  "data/redirect-devtop/2021/9/816257.json": "Hello, In today's article you'll learn to create awesome visiting card designer. Where you can add...",
  "data/redirect-devtop/2021/9/816348.json": "Sometimes syntax doesn't make a lot of sense and feels arbitrary. But often there is a reason under the hood.",
  "data/redirect-devtop/2021/9/816277.json": "My team at AWS has been releasing a ton of new features that make AWS Amplify better than ever. Here...",
  "data/redirect-devtop/2021/9/815540.json": "Build Setup   TL;DR - I use Eleventy and Sass CLI, and have created a few other build...",
  "data/redirect-devtop/2021/9/816625.json": "Hello Devs,  In this blog, we are going to learn that how you can detect mobile device or browser or...",
  "data/redirect-devtop/2021/9/817053.json": "One of the toughest things to do as a new developer is to assemble an online portfolio.   What should...",
  "data/redirect-devtop/2021/9/816846.json": "Let's check, many times (or few) arises the need to remove duplicate elements given in an array, I...",
  "data/redirect-devtop/2021/9/816597.json": "Hey Coders!   If you are a react developer then you might have already heard about the latest...",
  "data/redirect-devtop/2021/9/815379.json": "Yesterday I wondered how to display a PDF document on a website.  I tried with iframe to display the...",
  "data/redirect-devtop/2021/9/813376.json": "Quick tutorial how to implement Bidirectional map on TypeScript language",
  "data/redirect-devtop/2021/9/816092.json": "Have you been reading multiple articles trying to understand whether Node.js is single-threaded or...",
  "data/redirect-devtop/2021/9/815219.json": "Objects   Objects are JavaScript’s fundamental data structure. Intuitively, an object...",
  "data/redirect-devtop/2021/9/815580.json": "A responsive drawing of Homer Simpson done in CSS, using a single HTML element.",
  "data/redirect-devtop/2021/9/817265.json": "Appwrite 0.10 introduced Magic URL a password-less authentication method. This allows developers to...",
  "data/redirect-devtop/2021/9/816309.json": "Hey readers, the title of this article is not click-bait, you can actually start learning HTML and...",
  "data/redirect-devtop/2021/9/817355.json": "Hey, Devs! I'm here to share some best React component libraries that are popular among developers...",
  "data/redirect-devtop/2021/9/815973.json": "Keeping cloud costs in check is a challenge for many teams. Luckily, they can now benefit from...",
  "data/redirect-devtop/2021/9/817536.json": "In this blog, I will explain everything you need to know about server-side rendering.  I have created...",
  "data/redirect-devtop/2021/9/817315.json": "1. The Open Movie Database (OMDb)   OMDb contains different kinds of movies that you can use...",
  "data/redirect-devtop/2021/9/815604.json": "This past week during my 100 days of hacking challenge, I started to dive deeper into the...",
  "data/redirect-devtop/2021/9/817047.json": "Back at the start of this year I began weekly live streams of my side project where I've been...",
  "data/redirect-devtop/2021/9/817543.json": "I remember my first encounter with responsive design. Before any investigation, it seemed incredibly...",
  "data/redirect-devtop/2021/9/810799.json": "When is a search bar not a search bar? When it's an \"omnibar\" built with Autocomplete!      In her...",
  "data/redirect-devtop/2021/9/813858.json": "Have you ever failed to understand how the percentages work in CSS? Ever wondered why it's so messed...",
  "data/redirect-devtop/2021/9/817538.json": "TLDR;   I'm making a pluggable widget component with front end and serverless back end...",
  "data/redirect-devtop/2021/9/816828.json": "I'm going to share with you something I learned today! I needed to show some pictures in a project...",
  "data/redirect-devtop/2021/9/817904.json": "I often see that JS devs struggle to create good types in Typescript. Some people use the famous any...",
  "data/redirect-devtop/2021/9/817861.json": "Hello, dear developers, Today we'll see, how we can easily create a responsive landing page using...",
  "data/redirect-devtop/2021/9/817286.json": "This article was originally posted on my blog. Head over to inspiredwebdev.com for more articles and...",
  "data/redirect-devtop/2021/9/816272.json": "Many technical problems ultimately turn out to be people problems, and a lack of good documentation...",
  "data/redirect-devtop/2021/9/818537.json": "JavaScript is one of the most loved and hated languages in the world. It is loved because it is...",
  "data/redirect-devtop/2021/9/817055.json": "Formik is a best library and I use it every time. So today I am writing this post for fundamentals of...",
  "data/redirect-devtop/2021/9/818453.json": "I decided to bring the articles from my blog here to dev.to and following the order, the first...",
  "data/redirect-devtop/2021/9/817332.json": "Hi folks,  In order to help everyone, I have listed down a few of the best materials (books + videos)...",
  "data/redirect-devtop/2021/9/818753.json": "So last time, I made a typewriter animation without HTML, CSS, nor Javascript. What happens if...",
  "data/redirect-devtop/2021/9/818568.json": "An open source and free React Landing Page template using TypeScript and Tailwind CSS. Perfect landing page for your SaaS, online products or services.",
  "data/redirect-devtop/2021/9/816691.json": "Open-source Django Dashboard built with latest Django Version",
  "data/redirect-devtop/2021/9/814177.json": "Introduction            Disclaimer    English is not my native language, so there may be...",
  "data/redirect-devtop/2021/9/818563.json": "Corepack is the new built-in tool for preparing the required package manager for our projects. Let's...",
  "data/redirect-devtop/2021/9/818747.json": "Before comparing Reactjs vs React Native, let’s take a look at the small history of both of...",
  "data/redirect-devtop/2021/9/817609.json": "In this blog post we are going to learn HTTPie - a command line utility to debug web services. In our...",
  "data/redirect-devtop/2021/9/817629.json": "Have you seen Contentful’s event website that generates customized and shareable ticket images that...",
  "data/redirect-devtop/2021/9/818797.json": "In this article, from Dotnetsafer we will show you 5 different performance tricks that you can do in...",
  "data/redirect-devtop/2021/9/817087.json": "Building a Clubhouse clone with audio conferencing , chat and change roles using React , Tailwind and 100ms SDKs.",
  "data/redirect-devtop/2021/9/818847.json": "If you started coding in JavaScript and want to know some awesome project ideas, to practice this...",
  "data/redirect-devtop/2021/9/816616.json": "Subscription of observables is the bread and butter of using RxJS. With each subscription, we create...",
  "data/redirect-devtop/2021/9/812367.json": "Feli #ChooseToChallenge                       @kotzendekrabbe       ...",
  "data/redirect-devtop/2021/9/818264.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/9/819518.json": "If you're a person who prefers reading over watching videos for learning new skills and technologies...",
  "data/redirect-devtop/2021/9/819584.json": "Perhaps the most complicated and greatest asset a human being can have is the processing power...",
  "data/redirect-devtop/2021/9/811176.json": "So from now we manage a lot of things, but we need to divide our config into two parts:   Dev part...",
  "data/redirect-devtop/2021/9/819764.json": "I spent the last two weeks putting this together. Just looking to get other coders perspectives on...",
  "data/redirect-devtop/2021/9/820102.json": "Introduction  A few weeks ago, I made a post about how to make a Glitch Effect on pure CSS. But in...",
  "data/redirect-devtop/2021/9/819530.json": "At the start of a new web app development project, any developer would have a burning dilemma: What...",
  "data/redirect-devtop/2021/9/815381.json": "Earlier this year I broke one of my rules and interviewed with a tech company you HAVE heard of, they...",
  "data/redirect-devtop/2021/9/816855.json": "Yesterday, on September 7, 2021, I finished a coding bootcamp. I spent 12+ months in Flatiron's...",
  "data/redirect-devtop/2021/9/817918.json": "To dip my toes into the ocean of Vue, I created a super simple, backend-less application. Here is a...",
  "data/redirect-devtop/2021/9/817534.json": "As this is my first technical blog, so I'm pretty excited for this one.           How can you...",
  "data/redirect-devtop/2021/9/819040.json": "Golang, or Go, is a popular programming language used by many top tech companies. If you dream of...",
  "data/redirect-devtop/2021/9/818050.json": "Preamble   Let's admit. JavaScript is not the most predictable language out there. It might...",
  "data/redirect-devtop/2021/9/818260.json": "Professional looking, convenient and fastly delivered invoices can leave a great impression on your...",
  "data/redirect-devtop/2021/9/819052.json": "Here are some common mistakes you might be making daily that are slowing you down, holding you back...",
  "data/redirect-devtop/2021/9/818787.json": "Introduction   Usually, when we develop react Apps, we only concern about separate in our...",
  "data/redirect-devtop/2021/9/819506.json": "It can be overwhelming to keep track of everything in the tech-universe - things changes so fast. And...",
  "data/redirect-devtop/2021/9/817920.json": "After working in several companies, I've noticed that the code is always typed differently and this...",
  "data/redirect-devtop/2021/9/819453.json": "One CSS feature I wish I knew about long before I discovered it is the :is pseudo-class.  You can use...",
  "data/redirect-devtop/2021/9/819718.json": "If you want to make Javascript Limit Characters in the input box then this article will help you....",
  "data/redirect-devtop/2021/9/819825.json": "I'm sure you've heard of Node.js but maybe you haven't delved into it or you only have a general idea...",
  "data/redirect-devtop/2021/9/820526.json": "To debug a code you will use the console   The console object provides access to the browser's...",
  "data/redirect-devtop/2021/9/820937.json": "A bit late to the party but here is my silly entry for the typewriter wars!  And unlike everyone...",
  "data/redirect-devtop/2021/9/820591.json": "HTML (Hypertext Markup Language) is a standard markup language used to create web pages. Tags are...",
  "data/redirect-devtop/2021/9/820575.json": "What is FlowBite?   FlowBite is an open-source collection of UI elements based on the...",
  "data/redirect-devtop/2021/9/820571.json": "A curated list with Django Website Templates completely Free for Download. All projects are actively supported and the article provides the download link for each product.",
  "data/redirect-devtop/2021/9/820524.json": "Who doesn't want to speed up their work? Especially developers. They love shortcuts. And here we are...",
  "data/redirect-devtop/2021/9/820597.json": "If you are building a web application that involves a lot of charts, Plotly.js is one of the best...",
  "data/redirect-devtop/2021/9/819275.json": "The Rails ecosystem continues to thrive, and Rails developers have all the tools they need to build...",
  "data/redirect-devtop/2021/9/818819.json": "TLDR;   I'm building a client side router as part of a project to create some useful Widgets...",
  "data/redirect-devtop/2021/9/820248.json": "Welcome to this chapter, we are going to discuss one of the important features of Git which is...",
  "data/redirect-devtop/2021/9/819730.json": "In this article, I am going to show you how to create a custom image upload and preview design. Image...",
  "data/redirect-devtop/2021/9/815761.json": "Nowadays every application, websites, machine are more user friendly with an awesome UX/UI. So it...",
  "data/redirect-devtop/2021/9/820547.json": "We are launching a new global open source community called Web 3 Community that will be focus on Web...",
  "data/redirect-devtop/2021/9/819276.json": "If you are just getting into coding and are working on projects, ether solo or in a group, you...",
  "data/redirect-devtop/2021/9/819577.json": "Introduction   Animation makes a web page more interesting, attractive, and interactive than...",
  "data/redirect-devtop/2021/9/820903.json": "Javascript is a very nice language (at least for someone 😂) but it's still missing some core...",
  "data/redirect-devtop/2021/9/820124.json": "Written by Ibadehin Mojeed ✏️  Optimizing application performance is key for developers who are...",
  "data/redirect-devtop/2021/9/820913.json": "Points to be considered while optimizing the performance of a webpage:    Images...",
  "data/redirect-devtop/2021/9/817895.json": "The best reasons to learn a frontend framework are because that framework aligns with your goals.",
  "data/redirect-devtop/2021/9/821591.json": "This certainly isn't the first time someone's made a list of their favorite VSCode extensions and it...",
  "data/redirect-devtop/2021/9/821319.json": "For my last project, I had to use Websockets to create a website that displays real-time trading...",
  "data/redirect-devtop/2021/9/821578.json": "1million view (all time) views - Ty Dev",
  "data/redirect-devtop/2021/9/820917.json": "Typography is a main thing when it comes to front-end designing. Here, we can look more into...",
  "data/redirect-devtop/2021/9/820949.json": "One does not \"just containerize\" an app: it's a process that involves a lot of learning for each language and base image.",
  "data/redirect-devtop/2021/9/820924.json": "I was recently reading a blog post about iteration from Axel Rauschmayer (I suggest you follow him,...",
  "data/redirect-devtop/2021/9/821879.json": "Today we will go into learning about UI Page projects to increase design ability and how to apply...",
  "data/redirect-devtop/2021/9/821609.json": "In a single-page web application, you will probably have a navbar allowing the user to go to...",
  "data/redirect-devtop/2021/9/821649.json": "React JS is a popular JavaScript framework for building front-end applications, such as user...",
  "data/redirect-devtop/2021/9/820939.json": "Today's article will introduce tab components built with CSS and Javascript to help the process...",
  "data/redirect-devtop/2021/9/821557.json": "Native horizontal scroll with mouse wheel is not so trivial for the user. However, this behavior can...",
  "data/redirect-devtop/2021/9/822424.json": "Tools For Web Developers to keep in check In 2021            99.8% don't know all of...",
  "data/redirect-devtop/2021/9/822097.json": "Weapons (tools) make a soldier (developer) effective. Advanced and effective weapons (tools) in your...",
  "data/redirect-devtop/2021/9/812613.json": "Recently I start learning Tailwind CSS, a CSS framework that helps you write CSS way...",
  "data/redirect-devtop/2021/9/822601.json": "Hello, Today in this article, we'll learn to create an e-commerce website using HTML, CSS and JS....",
  "data/redirect-devtop/2021/9/821197.json": "If you have worked on a decently sized Node.js application regardless of whether its JavaScript or...",
  "data/redirect-devtop/2021/9/820988.json": "There are tons of tools in IT to ease programmers' workflow and make a product more efficient. But in...",
  "data/redirect-devtop/2021/9/821593.json": "I built a free 3D browser game, freely explorable, across infinite universes procedurally generated in JavaScript.",
  "data/redirect-devtop/2021/9/822588.json": "I saw this fancy scrolling effect on this website and it just blew my mind. I thought of recreating...",
  "data/redirect-devtop/2021/9/822401.json": "TLDR;   If you've been reading along you'll know I'm building a widget to provide some fun...",
  "data/redirect-devtop/2021/9/822912.json": "It may be hard to believe, but this year React turned eight years old. In the technology landscape,...",
  "data/redirect-devtop/2021/9/821596.json": "Hi everyone.  I have decided to create a post to share my point of view about units of measure in...",
  "data/redirect-devtop/2021/9/822621.json": "In this article, you will learn how to create an automatic image slider using only HTML and CSS....",
  "data/redirect-devtop/2021/9/820760.json": "The Problem with our Documentation   We have a problem with the majority of our...",
  "data/redirect-devtop/2021/9/822076.json": "An open-source software or application is publicly available for us to use and contribute to it. We...",
  "data/redirect-devtop/2021/9/821608.json": "Documentar ou não documentar o código não é exatamente um consenso na comunidade. Muita gente diz que...",
  "data/redirect-devtop/2021/9/821320.json": "With the rapid development of web technologies, learning and fostering new knowledge about these...",
  "data/redirect-devtop/2021/9/821210.json": "It's the time of year again, and with it comes a bundle of new Ruby 3.1 features getting approved and...",
  "data/redirect-devtop/2021/9/823451.json": "I recently started a new blog TheDailyTechTalk where I create free content. If you liked this post...",
  "data/redirect-devtop/2021/9/822681.json": "Deploying an application created with a framework like React, Vue, or Angular differs significantly...",
  "data/redirect-devtop/2021/9/819317.json": "Lately, I've seen multiple excellent posts about why developers should blog. They list very good...",
  "data/redirect-devtop/2021/9/822434.json": "Unless you’ve been developing software in a cave, you’ve probably heard people sing the praises of...",
  "data/redirect-devtop/2021/9/821726.json": "TypeScript 4.4 came out with a lot of performance update plus some improved type checking. As a...",
  "data/redirect-devtop/2021/9/823450.json": "Get a free pass to KubeCon 2021 and 50%+ cloud savings with CAST AI. We're giving away 10 individual...",
  "data/redirect-devtop/2021/9/823456.json": "Steps to decrease your React app initial loading time using code splitting.  We build large-scale...",
  "data/redirect-devtop/2021/9/822910.json": "Why clone websites?   Frontend development has everything to do with the client side....",
  "data/redirect-devtop/2021/9/819792.json": "Late last night (actually, early this morning), I had visions of dots dancing in my head: the dots and lines used to describe actions and their relation to data in ReactJS data stores ... and the dots and lines used to describe data movement and management of Observables and subscriptions.",
  "data/redirect-devtop/2021/9/821592.json": "Short tutorial on how to structure projects and setup multi-user Git SSH workflow.   When using a...",
  "data/redirect-devtop/2021/9/823576.json": "Today I am writing again to bring you a library that will help us with the handling of dates in...",
  "data/redirect-devtop/2021/9/822376.json": "Hi There 👋,  In this tutorial we're going to implement smooth🧈 scrolling effect🤩 for whole page with...",
  "data/redirect-devtop/2021/9/822713.json": "My name is Fred, and I created Snowpack. If you're not familiar, Snowpack is a web build tool that...",
  "data/redirect-devtop/2021/9/823523.json": "In this article, I am going to show you how to create Glassmorphism Login Form using HTML and CSS...",
  "data/redirect-devtop/2021/9/823274.json": "I recently started a new blog TheDailyTechTalk where I create free content. If you liked this post...",
  "data/redirect-devtop/2021/9/823579.json": "Overview   Pub/Sub is a pattern where the publisher is not programmed to send a message...",
  "data/redirect-devtop/2021/9/823486.json": "Am back again after a 4 weeks break with a new article, today we are going to learn what docker is,...",
  "data/redirect-devtop/2021/9/823234.json": "Hello Coders!👋   Welcome back to the Javascript project series. Today i'm share another...",
  "data/redirect-devtop/2021/9/823565.json": "Need a Python memory aid?",
  "data/redirect-devtop/2021/9/822380.json": "Appwrite is an open-source, self-hosted Backend-as-a-Service that aims to make app development easier...",
  "data/redirect-devtop/2021/9/822623.json": "So you want to know if GraphQL is a great fit for your project? Using GraphQL can be a consequential...",
  "data/redirect-devtop/2021/9/824192.json": "Hi everybody, I'm Aya Bouchiha, after creating two posts about 10 important HTML Tags, I decided to...",
  "data/redirect-devtop/2021/9/822884.json": "Using React's Context API is often very useful. I've found that there are several patterns that you...",
  "data/redirect-devtop/2021/9/824397.json": "After my first blog post I decided what was a better way to start into open source then building my...",
  "data/redirect-devtop/2021/9/823488.json": "Yes, another post about CSS loaders but this time you will build the loader! In this article, I will...",
  "data/redirect-devtop/2021/9/824909.json": "Hello, everyone! Today, we'll go through some great repositories that every developer should be aware...",
  "data/redirect-devtop/2021/9/815405.json": "Everything You Need to Get Started Building Full Stack Dapps on Solana",
  "data/redirect-devtop/2021/9/824871.json": "Skeleton Loaders are used very commonly in Modern Websites/Apps to indicate loading of data instead...",
  "data/redirect-devtop/2021/9/820238.json": "This article will teach you how to create and mint NFTs and query their data using JavaScript on the...",
  "data/redirect-devtop/2021/9/824622.json": "Hello guys, so I was thinking of using Django to add a web socket support to a project am working on...",
  "data/redirect-devtop/2021/9/824065.json": "Before starting this blog, I assume that you all should have basic knowledge about React.  In this...",
  "data/redirect-devtop/2021/9/823600.json": "Why do we need loggers?   It's common for humans to make mistakes. That's so not only in the...",
  "data/redirect-devtop/2021/9/824036.json": "One of the first articles we covered in tech book club was Micro Frontends, an approach to scaling...",
  "data/redirect-devtop/2021/9/825736.json": "Learning to code can be challenging and perplexing, especially if you don't know where to begin. The...",
  "data/redirect-devtop/2021/9/823277.json": "By moving Composer's vendor directory outside of the project root, you can see noticeable improvements in responsible time.",
  "data/redirect-devtop/2021/9/819527.json": "Decorator is one of the Structural Design Patterns.  You're about to start with gift wrapping for a...",
  "data/redirect-devtop/2021/9/813193.json": "Hello, fellow developers, I have compiled a list of essential Front-End interview questions that I...",
  "data/redirect-devtop/2021/9/823038.json": "This article is the second entry in a two-part series. In the first post, I went over the early...",
  "data/redirect-devtop/2021/9/821237.json": "I got back into using Twitter 2 months ago when I started my 100DaysOfCode journey. While posting my...",
  "data/redirect-devtop/2021/9/824635.json": "1. Surge   Surge is a cloud platform for hosting static websites, which is extremely simple...",
  "data/redirect-devtop/2021/9/825837.json": "Constantly switching between different tasks and tools requires your brain to jump from one thought...",
  "data/redirect-devtop/2021/9/819466.json": "Tired of opening manually the same programs every morning ? Or every time that you switch...",
  "data/redirect-devtop/2021/9/825577.json": "Looking to have your Github organisation standout? Wanting it to match all the beautiful and...",
  "data/redirect-devtop/2021/9/825152.json": "Last week, I needed to find a way to generate a random and unique id to get names for phone files on...",
  "data/redirect-devtop/2021/9/828510.json": "Sometimes, a code review can leave both the author and the reviewer with a great deal of frustration....",
  "data/redirect-devtop/2021/9/825143.json": "VSCode lover? I know extensions are our life support for coding. And if you're a web dev you're in...",
  "data/redirect-devtop/2021/9/824678.json": "A curated list with Open-source projects crafted in Django and configured to work with Docker. All projects are published on Github (MIT License).",
  "data/redirect-devtop/2021/9/828762.json": "useState is a Hook that needs to be called inside a function component to add some local state to it....",
  "data/redirect-devtop/2021/9/828560.json": "🤷What is Sass   Sass (which stands for Syntactically Awesome Style Sheets) is an extension...",
  "data/redirect-devtop/2021/9/817479.json": "Ah, the dreaded resolve conflicts popup. You've finished crafting the perfect code, just a quick...",
  "data/redirect-devtop/2021/9/824857.json": "With Hacktoberfest around the corner, here are some tips to make better Pull Requests for your next...",
  "data/redirect-devtop/2021/9/825989.json": "Context switching is the act of working on several tasks in parallel. More specifically, working on...",
  "data/redirect-devtop/2021/9/828767.json": "useReducer is a Hook that allows us to manage multiple states more efficiently, create complex state...",
  "data/redirect-devtop/2021/9/825112.json": "Part 1 of 2  As an backend/infra guy, I've grown a lot of respect for the intricacies of frontend...",
  "data/redirect-devtop/2021/9/826076.json": "In this article, I would like to share with you how I use typescript to improve my react code. First...",
  "data/redirect-devtop/2021/9/824578.json": "Kubernetes is a cool word to have in your Architecture Document, and hot on your CV. On Premise or on...",
  "data/redirect-devtop/2021/9/825603.json": "Hi!   Some of things we have to know about JS are: variables, data types, scope and hoisting. Why?...",
  "data/redirect-devtop/2021/9/828741.json": "I will show you how create my profile github page in 5 min!  Let's check my current profile...",
  "data/redirect-devtop/2021/9/825964.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/9/826209.json": "Hello everyone   Today we are going to cover a list of 10 important sections you can add to...",
  "data/redirect-devtop/2021/9/829966.json": "Introduction  The profession of a programmer, like many other professions related to IT, implies...",
  "data/redirect-devtop/2021/9/829608.json": "If you're feeling uncertain about contributing to an open source project for the first time, I...",
  "data/redirect-devtop/2021/9/828768.json": "Over the past few weeks, I've worked on a few flask apps across a variety of use cases. The aim was...",
  "data/redirect-devtop/2021/9/825459.json": "I want to share with other Front End developers how to build a React Video modal from scratch.  I...",
  "data/redirect-devtop/2021/9/826084.json": "Hello everyone, recently I came across a new way to handle React forms, maybe its something you know,...",
  "data/redirect-devtop/2021/9/828760.json": "Why did I choose to build this project? 🤔   This project was one of my favourite tools for...",
  "data/redirect-devtop/2021/9/825157.json": "My first dev job threw me into a huge legacy codebase. My last big ticket involved getting a modern...",
  "data/redirect-devtop/2021/9/829651.json": "This is not a tutorial, or anything even informational. Just a place to share my project, hoping to...",
  "data/redirect-devtop/2021/9/829612.json": "If you learned something new feel free to connect with me on linkedin or follow me on dev.to :)  I...",
  "data/redirect-devtop/2021/9/830117.json": "Projects tutorials for learning REACT.JS     netflix, disney, testla, facebook, whatsapp,...",
  "data/redirect-devtop/2021/9/825916.json": "Simple open-source dashboard built with Flask and Docker on top of an open-source Bootstrap 5 design.",
  "data/redirect-devtop/2021/9/829388.json": "TLDR;   I'm building a widget to provide fun quizzes, polls and much more within Blog posts...",
  "data/redirect-devtop/2021/9/828842.json": "Today, I want to share how to build an FAQ accordion using react. The FAQ section it's a really...",
  "data/redirect-devtop/2021/9/829586.json": "Whether you’re self-taught, a Bootcamp grad, or have a college degree, when you’re a fresh-faced web...",
  "data/redirect-devtop/2021/9/830312.json": "One of the most common text editors used by developers is Visual Studio Code. Microsoft created it to...",
  "data/redirect-devtop/2021/9/830442.json": "What is Material-UI (MUI React)?   Do you know React.js? If yes, then 90% chance you know...",
  "data/redirect-devtop/2021/9/830456.json": "Whenever we need to make use of side effects in our application, useEffect is the way to go. This...",
  "data/redirect-devtop/2021/9/830447.json": "Hey developers 👋🏻, in this blog we will be discussing about JavaScript Objects.           Topics...",
  "data/redirect-devtop/2021/9/829705.json": "Okay! You may be writing your code in JavaScript for ages, you know what logic to use when but, have...",
  "data/redirect-devtop/2021/9/828765.json": "This article aims to help you get better at styling. All along with this article, I will change your...",
  "data/redirect-devtop/2021/9/826048.json": "What is Elecrue?      First of all let me tell you the main point of this elecrue...",
  "data/redirect-devtop/2021/9/828921.json": "Another week of learning something new! In this blog I am going to share with you how to make frosted...",
  "data/redirect-devtop/2021/9/830328.json": "In this article, we are going to have an Overview and Setup of TypeScript in our Local...",
  "data/redirect-devtop/2021/9/828488.json": "Hi my fellow developers,  The second episode of the Entando Standard Banking Demo series brings us to...",
  "data/redirect-devtop/2021/9/824694.json": "In India, more than 95% of schools don't allow smartphones in class. Being a Computer Science teacher...",
  "data/redirect-devtop/2021/9/831176.json": "Hello Folks 👋   This is Savio here. I'm young dev with an intention to enhance as a...",
  "data/redirect-devtop/2021/9/830290.json": "So what exactly is an API?   An API (Application Programming Interface) is a set of...",
  "data/redirect-devtop/2021/9/814819.json": "You've heard, seen, and probably have your own GitHub Profile README. Did you know you can now do the...",
  "data/redirect-devtop/2021/9/830946.json": "Hi everyone! It is possible that it is here for the post title, and I daresay you have had problems...",
  "data/redirect-devtop/2021/9/830280.json": "Who doesn't want a dark theme on their website! Not only does it help us focus better, but also keeps...",
  "data/redirect-devtop/2021/9/821240.json": "I have some data, and I'd like to make a PDF file for that data. How can I make a PDF file as a quick...",
  "data/redirect-devtop/2021/9/830980.json": "Redux is one of the widely used State Management Solutions in React Applications. Even though it has...",
  "data/redirect-devtop/2021/9/828499.json": "This is part of a series of articles about my open-source project (backend and frontend). if you want...",
  "data/redirect-devtop/2021/9/830880.json": "Hi, I'm Aya Bouchiha, today, I decided to share with you the solution of converting \"px\" to \"rem\" or...",
  "data/redirect-devtop/2021/9/829626.json": "If you want to skip the introduction, feel free to cut right to the application.   Please complete...",
  "data/redirect-devtop/2021/9/829618.json": "Video Version   Do you prefer the Video Version?    In this article, we will see how we can...",
  "data/redirect-devtop/2021/9/831510.json": "So you have written your React Application and you are ready to deploy it?  Although there are...",
  "data/redirect-devtop/2021/9/830884.json": "Okay,Now What's a Load-Balancer?? 🙄   As the name suggest it has something to do with...",
  "data/redirect-devtop/2021/9/830726.json": "Hello guys, welcome to another article in the JavaScript Concepts Simplified article series. Today,...",
  "data/redirect-devtop/2021/9/830414.json": "Have you ever looked at a JavaScript in built function and said to yourself:    I understand what...",
  "data/redirect-devtop/2021/9/831153.json": "TLDR;   I'm building a widget to help content authors grow their audience by asking them...",
  "data/redirect-devtop/2021/9/831557.json": "The frontend Landscape – Different Architectures",
  "data/redirect-devtop/2021/9/831317.json": "onlineshop-api   An API for online store           Features:    Authentication Products...",
  "data/redirect-devtop/2021/9/831548.json": "Hello Readers!  Let me introduce you all with something new today!   The topic today is the...",
  "data/redirect-devtop/2021/9/830107.json": "This post comes from some interesting tweets I saw, and really speaks to how difficult it can be to...",
  "data/redirect-devtop/2021/9/830453.json": "You Have an Html, Css and Js files in your computer and you want to show it to your colleagues...",
  "data/redirect-devtop/2021/9/831802.json": "I’ve recently become fascinated by the idea of “winner’s games” and “loser’s games.” There are...",
  "data/redirect-devtop/2021/9/829383.json": "Table Of Contents    Chapter #1 Create your library with create-react-library Chapter #2...",
  "data/redirect-devtop/2021/9/831588.json": "What is this   So I'm making a series of videos on how to build a very basic website for a...",
  "data/redirect-devtop/2021/9/832847.json": "How I broke out of the tiresome REST vs GraphQL debate - by realizing that the real battle is between Smart Clients and Smart Servers!",
  "data/redirect-devtop/2021/9/832489.json": "So, you're not a complete beginner anymore: You've built a few webpages, learned the basics of HTML,...",
  "data/redirect-devtop/2021/9/831591.json": "It's been 6 weeks since my first day as a real-deal, steadily employed frontend engineer. In those 6...",
  "data/redirect-devtop/2021/9/830838.json": "Do you want to contribute to open-source but you are not sure of your coding skills?  I have good...",
  "data/redirect-devtop/2021/9/830430.json": "TL;DR: Driwwwle is an open-source social network to showcase your projects with like, comments,...",
  "data/redirect-devtop/2021/9/832018.json": "Hello, guys today we are covering one of the most important topic.  Today we are learning map()...",
  "data/redirect-devtop/2021/9/832586.json": "Building a Slack huddle clone using React , Tailwind and 100ms SDKs in under 15mins.",
  "data/redirect-devtop/2021/9/832001.json": "Responsive CSS frameworks take a lot of work and persistence to build and create when building CSS on...",
  "data/redirect-devtop/2021/9/831584.json": "Hey readers! This blog is all about ES6. It includes all the topics related with examples. Before...",
  "data/redirect-devtop/2021/9/832874.json": "Are you looking for illustrations or vector graphics for your next project?   Well then, Great!  I am...",
  "data/redirect-devtop/2021/9/833047.json": "The reduce method applies a function to every item of an array and accumulates the result iteratively...",
  "data/redirect-devtop/2021/9/831499.json": "The Problem 🤦‍♂️   For many of us JavaScript devs, we love the fact that TypeScript exists....",
  "data/redirect-devtop/2021/9/831947.json": "Your 20s could be your most defining decade.   You’ll have more freedoms &amp; more...",
  "data/redirect-devtop/2021/9/833119.json": "Managing state in React is one of the main issues you'll be facing while developing React websites....",
  "data/redirect-devtop/2021/9/832796.json": "I regret using PHP.  Right now, I finished a titanic project (around 3 year in the making) and the...",
  "data/redirect-devtop/2021/9/833478.json": "It is not necessary to spend a lot of money to create a professional-looking dashboard for your...",
  "data/redirect-devtop/2021/9/831563.json": "Creating quality content is a demanding process. Hence, having a wide range of applications can...",
  "data/redirect-devtop/2021/9/833466.json": "Hey everyone, welcome to my first post here on DEV Community!   In this post I will be...",
  "data/redirect-devtop/2021/9/831946.json": "Changes released in ES2021 The changes released in ES2021 are as...",
  "data/redirect-devtop/2021/9/833659.json": "In this article, I’ll show you how to build a user login system with the node framework express.js...",
  "data/redirect-devtop/2021/9/833250.json": "ES6 is nearly synonymous with \"modern javascript\" and rightly so. When it dropped in 2015 as the...",
  "data/redirect-devtop/2021/9/833120.json": "We tend to think of components as things that belong to a framework. After all, React has components,...",
  "data/redirect-devtop/2021/9/828605.json": "1. Styling your console.log   Is this necessary? Probably not, but if you want to leave an...",
  "data/redirect-devtop/2021/9/832513.json": "All the HTML elements like a div, a button, or text content are considered as boxes in our CSS file....",
  "data/redirect-devtop/2021/9/832837.json": "Introduction   Notion gives an enormous possibilities of what we can do with a single...",
  "data/redirect-devtop/2021/9/832441.json": "Introduction   Hello, DEV World! 👩‍💻👨‍💻   In this article, I'm going to tell you some useful...",
  "data/redirect-devtop/2021/9/834012.json": "The Ultimate Python CheatSheet  Basics Basic syntax from the python programming language  Showing...",
  "data/redirect-devtop/2021/9/833678.json": "Written by Dan Parry.  Database Management Systems (DBMS), in short, are collections of tools used to...",
  "data/redirect-devtop/2021/9/835942.json": "This quick tutorial will walk you through a small number of easy steps to turn your Laravel app into a modular architecture",
  "data/redirect-devtop/2021/9/832595.json": "Hello guys, Today we are going to go over the concept of closure in JavaScript.           Background...",
  "data/redirect-devtop/2021/9/832867.json": "Hello my Beautiful Friends on the Internet!🙋🏻‍♀️  This is a solution to the Profile card component...",
  "data/redirect-devtop/2021/9/833491.json": "As previously announced we're sunsetting Connect. As a first step in this direction it will now no...",
  "data/redirect-devtop/2021/9/832473.json": "Formik is one of the most popular libraries for building forms. It helps developers do a lot of...",
  "data/redirect-devtop/2021/9/834068.json": "Object-oriented programming helps us with data security, code reusability, and also helps us to...",
  "data/redirect-devtop/2021/9/833140.json": "I'm going to assume you are reading this because:   you have one or more dotfiles lying around and...",
  "data/redirect-devtop/2021/9/836866.json": "Let's admit it, open source can be overwhelming when it comes to finding support financially.  Today,...",
  "data/redirect-devtop/2021/9/836893.json": "A lot of times I see explanations of concepts in X language that, while I get what they do, I think...",
  "data/redirect-devtop/2021/9/836871.json": "HTML is the cornerstone of web development. Yet, many aspiring programmers merely skim the surface...",
  "data/redirect-devtop/2021/9/833259.json": "Enabling GitHub Authentication with Supabase and React",
  "data/redirect-devtop/2021/9/836526.json": "Introduction   We want the new project we are starting at Filmin to be robust. Therefore,...",
  "data/redirect-devtop/2021/9/835909.json": "AWS Amplify recently added support for Next.js 10 features, including incremental static...",
  "data/redirect-devtop/2021/9/820717.json": "In the last tutorial, we made a PHP script that performs customizable backend operations that take in...",
  "data/redirect-devtop/2021/9/836036.json": "Things are changing fast in WEB today, and react-router v6 is in beta already and around the corner....",
  "data/redirect-devtop/2021/9/836908.json": "I have always relied on the npm command create-react-app to create the starter files for any React.js...",
  "data/redirect-devtop/2021/9/833776.json": "Titles in the engineering space are a funny thing. They're important, but they're not important. The...",
  "data/redirect-devtop/2021/9/833687.json": "Software engineers, programmers, and researchers use and refurbish code daily.   A quick scan through...",
  "data/redirect-devtop/2021/9/833112.json": "Hello 🙋‍♂️, As web developers, we have to write quite a good amount of HTML code. Sometimes, it can...",
  "data/redirect-devtop/2021/9/836892.json": "\"How can I acquire more opportunities?\" is a question I ask myself from time to time, and it was a...",
  "data/redirect-devtop/2021/9/836595.json": "There is a misconception floating around that you need to follow a certain roadmap and learn a lot of...",
  "data/redirect-devtop/2021/9/832569.json": "Get to know your teammates and how to effectively work with them by sharing user manuals.",
  "data/redirect-devtop/2021/9/836299.json": "Visual Studio Code is an excellent editor for JavaScript and TypeScript that already contains many...",
  "data/redirect-devtop/2021/9/837599.json": "I have been hacking with CSS for a long period but I never made any CSS drawing or CSS art. I think...",
  "data/redirect-devtop/2021/9/837164.json": "A fun location for your third-party scripts to hang out   Performance is always top of mind for any...",
  "data/redirect-devtop/2021/9/836518.json": "1. Follow a color scheme   Color schemes always come in handy when creating feature-packed...",
  "data/redirect-devtop/2021/9/837842.json": "Loads of people like to do CSS art. It is really impressive but next to pointless for anything other...",
  "data/redirect-devtop/2021/9/836942.json": "Hey! 👋  If you're a Front-end developer or aspiring to become one, I am sure you might have come...",
  "data/redirect-devtop/2021/9/837296.json": "Automatic link shortening is increasingly getting popular. Top tech companies (eg: Twitter and...",
  "data/redirect-devtop/2021/9/834115.json": "Today we're gonna learn how to do form validation using JavaScript. And we're gonna add images and...",
  "data/redirect-devtop/2021/9/836938.json": "There are multiple use cases in the modern UX when we are required to use infinite scrolling....",
  "data/redirect-devtop/2021/9/838466.json": "Hello everyone, my name is Vansh and I'm a frontend developer. A lot of people have asked me this...",
  "data/redirect-devtop/2021/9/836958.json": "TLDR - Twester is a free and open source desktop app built with React, Electron and Node.js that will...",
  "data/redirect-devtop/2021/9/837489.json": "Being a competent software developer entails more than simply coding; it also entails finding the...",
  "data/redirect-devtop/2021/9/837858.json": "Most web applications today are built using React.js, a JavaScript library. Approximately 8 thousand...",
  "data/redirect-devtop/2021/9/831392.json": "In this article I will share with you some news tips about JS that can improve your skills!          ...",
  "data/redirect-devtop/2021/9/833655.json": "Ah, the dreaded resolve conflicts popup. You've finished crafting the perfect code, just a quick...",
  "data/redirect-devtop/2021/9/829398.json": "So the first question which comes before learning Web development for beginners it that Why should I...",
  "data/redirect-devtop/2021/9/836318.json": "Looking for helpful ReactJS Resources? Then here is the best collection of extremely useful ReactJS...",
  "data/redirect-devtop/2021/9/838887.json": "Make your own API under 30 lines of code   Hey readers 👋🏻, in this blog we are going to...",
  "data/redirect-devtop/2021/9/828955.json": "Written in connection with the Write with Fauna Program.  Using React, Spotify API, and Fauna...",
  "data/redirect-devtop/2021/9/838429.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/9/839164.json": "Hello, hope you'll are good. Today we'll do the second part of our fullstack e-com website series. In...",
  "data/redirect-devtop/2021/9/839075.json": "Abstract   JavaScript provides a data type specifically for storing an ordered collection of...",
  "data/redirect-devtop/2021/9/838807.json": "This article is a reference guide to strengthen your skills as a React developer and for job...",
  "data/redirect-devtop/2021/9/838774.json": "With over 9 million developers using Java as their mother tongue in programming, you can imagine the...",
  "data/redirect-devtop/2021/9/839077.json": "GitHub | Tutorial | Demo           What is refine?   refine offers lots of out-of-the box...",
  "data/redirect-devtop/2021/9/837546.json": "What are cookies?  Cookies are data,stored in small text files,on your computer.  When a web server...",
  "data/redirect-devtop/2021/9/840016.json": "Challenge   Awesome Gradient, 3D Space design with different kind of Design Flavor. Create a...",
  "data/redirect-devtop/2021/9/838816.json": "Based on scientific research it has been shown that memory can be improved naturally. The role of...",
  "data/redirect-devtop/2021/9/840023.json": "Visual Studio Code is the most widely used and most loved code editor for application...",
  "data/redirect-devtop/2021/9/838815.json": "Tailwind CSS is an awesome utility-first framework that you can use to quickly prototype and build...",
  "data/redirect-devtop/2021/9/838413.json": "I learned recently, in less than ideal circumstances, that Docker doesn't do any log rotation by...",
  "data/redirect-devtop/2021/9/840044.json": "Forms are very common in web apps. We are going to be creating forms over and over again when working...",
  "data/redirect-devtop/2021/9/839096.json": "I am very happy to introduce Xplorer to help you organize your files and/or folders.           ...",
  "data/redirect-devtop/2021/9/840028.json": "Let us quickly discuss some of the best practices which you can follow while working with JavaScript....",
  "data/redirect-devtop/2021/9/832844.json": "It's raining since a few days at my place. And even though it actually just stopped raining as I'm...",
  "data/redirect-devtop/2021/9/840015.json": "I gave a tutorial on how to add sticky navbar onscroll in react js, and most people got problem in...",
  "data/redirect-devtop/2021/9/840302.json": "Here is the student grade calculator using pure HTML, CSS &amp; JS. In Web Format You can...",
  "data/redirect-devtop/2021/9/839928.json": "Functions - A Brief History   In the advent of programming, we created our systems using...",
  "data/redirect-devtop/2021/9/839662.json": "In a previous article, I explained how to create a virtual development workspace using Docker. Thus,...",
  "data/redirect-devtop/2021/9/839151.json": "There is no perfect man, holy books say so. A senior developer is always at higher pressure compared...",
  "data/redirect-devtop/2021/9/840441.json": "I had built multiple apps in React Native for my personal as well as Freelancing projects. I had also...",
  "data/redirect-devtop/2021/9/839094.json": "If you are a junior programmer, this will give you an idea the improve your coding skills, and if you...",
  "data/redirect-devtop/2021/9/840542.json": "The other day I was browsing LinkedIn when a poll caught my eye   What's your favourite React State...",
  "data/redirect-devtop/2021/9/840850.json": "TL;DR: By following best industry practices like linting, unit testing, static code analysis and...",
  "data/redirect-devtop/2021/9/839758.json": "After I published an open source project which creates a static site generator(SSG), my second lab...",
  "data/redirect-devtop/2021/9/818459.json": "Note: This post is inspired by Web Dev Simplified.   Social media embeds take some time to load and...",
  "data/redirect-devtop/2021/9/840606.json": "A to-do list is one of the first projects many developers create. The basic components are a way to...",
  "data/redirect-devtop/2021/9/840056.json": "Setting up ESlint and Prettier is tedious for beginners, I know this because I have faced this issue...",
  "data/redirect-devtop/2021/9/840656.json": "A basic introduction to blockchain, bitcoin, ethereum, and smart contracts",
  "data/redirect-devtop/2021/9/841176.json": "Intro   Hey ya folks! Have you ever wondered how to implement Google Authentication in your...",
  "data/redirect-devtop/2021/9/839803.json": "Hello, buddies! Game design is an exciting, rewarding, and multi-faceted field with promising job...",
  "data/redirect-devtop/2021/9/841027.json": "Hey All 👋 ,   This is my second article on JavaScript ES6 Concepts. If you have not read the first...",
  "data/redirect-devtop/2021/9/841118.json": "You've probably heard about Web3 unless you've been living under a rock. Web 3.0 is the next step in...",
  "data/redirect-devtop/2021/9/841051.json": "Hey everyone 👋🏻,  In this article, let us learn about the essential Git commands that every developer...",
  "data/redirect-devtop/2021/9/840485.json": "Salam and yosh! And this week, I want to talk something core about Javascript. Something that you...",
  "data/redirect-devtop/2021/9/840242.json": "Hey Folks!   Welcome back to another post!!     This article is on Apache Airflow. Before...",
  "data/redirect-devtop/2021/9/841261.json": "Since  Docker announced a new subscription for Docker Desktop for personal use, educational...",
  "data/redirect-devtop/2021/9/840301.json": "Asking questions is literally the first piece of advice anyone gives to a brand new developer, and...",
  "data/redirect-devtop/2021/9/841018.json": "Recently, I released a video on making an Exercise Tracker Application using React.js. Today at the...",
  "data/redirect-devtop/2021/9/841179.json": "Hey everyone!  A lot of developers, including me, like darker environments. Here are some cool / pro...",
  "data/redirect-devtop/2021/9/841157.json": "Imagine, you have joined a new company and given access to their source code. Now it's your sole...",
  "data/redirect-devtop/2021/9/841765.json": "If you are a newbie to programming and JavaScript, you might first find it hard to grasp the concept...",
  "data/redirect-devtop/2021/9/839170.json": "Open Source Softwares are one of the most beautiful creations of the humankind. It not only powers...",
  "data/redirect-devtop/2021/9/841342.json": "Before Going to Learn React You must need Some JavaScript concepts.    let,var and...",
  "data/redirect-devtop/2021/9/840538.json": "Every once in a while when I do code review or visit StackOverflow I stumble upon code snippets that...",
  "data/redirect-devtop/2021/9/841766.json": "1. JAKOB’S LAW   Users spend most of their time on other sites. This means that users prefer...",
  "data/redirect-devtop/2021/9/840973.json": "Any fool can write code that a computer can understand. Good programmers write code that humans can...",
  "data/redirect-devtop/2021/9/840629.json": "Background   I was recently made to work with Hackernews API using python (Django). There...",
  "data/redirect-devtop/2021/9/818521.json": "What do developers want? Money, flexible schedules, pizza? Sure. Effortless remote collaboration?...",
  "data/redirect-devtop/2021/9/841030.json": "1. Software Architecture Isn’t About Big Design Upfront ☝️   Big designs upfront are usually...",
  "data/redirect-devtop/2021/9/842473.json": "Intro   One of the most complex things in modern JavaScript programs is asynchronicity. We...",
  "data/redirect-devtop/2021/9/843460.json": "by author Victoria Lo  In this article, let's learn about Redux Toolkit, or as the development team...",
  "data/redirect-devtop/2021/9/841889.json": "Recharts   Recharts is a Redefined chart library built with React and D3.  The main purpose...",
  "data/redirect-devtop/2021/9/840454.json": "In this blog, you will learn everything you need to know about Client-side rendering.  Client-side...",
  "data/redirect-devtop/2021/9/843716.json": "This article lives in:   Dev.to Medium GitHub The FastAPI docs            Intro   Here's a brief...",
  "data/redirect-devtop/2021/9/833724.json": "Into the city   When I moved to Cloud City I noticed that everybody was nice and friendly....",
  "data/redirect-devtop/2021/9/841781.json": "Hackathons are probably one of the best places to network with people and simultaneously learn and...",
  "data/redirect-devtop/2021/9/842153.json": "we are going to build a dating app using mern stack, the web app has a simple functionality a...",
  "data/redirect-devtop/2021/9/842110.json": "The styled-components allows you to write actual CSS code to style your components. It also removes...",
  "data/redirect-devtop/2021/9/844011.json": "Training the car to do self-parking using a genetic algorithm            TL;DR   In this article,...",
  "data/redirect-devtop/2021/9/842481.json": "In a React + React Router environment, routing configuration is a one-to-one mapping between a route...",
  "data/redirect-devtop/2021/9/842489.json": "What is Docker? - \"build once and run anywhere.\"   Docker is a software development tool and...",
  "data/redirect-devtop/2021/9/844441.json": "The best software developers arm themselves with superior knowledge of specific tools that get the...",
  "data/redirect-devtop/2021/9/830853.json": "Quick Summary   This article aims to explain how to write efficient and performant React...",
  "data/redirect-devtop/2021/9/843462.json": "We all have setup our node package manager application at least once. We hardly give importance to...",
  "data/redirect-devtop/2021/9/839613.json": "(This blog post first appeared in pubudu.dev)           Intro   This post describes how to implement...",
  "data/redirect-devtop/2021/9/843798.json": "So what is Airtable ?   Airtable is a low-code platform for building collaborative apps. It...",
  "data/redirect-devtop/2021/9/842729.json": "It feels like we've completely moved from callbacks to Promises and async/await in the JavaScript...",
  "data/redirect-devtop/2021/9/842066.json": "I'm currently working on a project, where an editor can easily edit breakpoints, using a group of...",
  "data/redirect-devtop/2021/9/844065.json": "Introduction   No matter if you are a DevOps/SysOps engineer, developer, or just a Linux...",
  "data/redirect-devtop/2021/9/844606.json": "Here is a series of articles to help you create backend applications in Javascript.  Node.js is now a...",
  "data/redirect-devtop/2021/9/843456.json": "TLDR   Having a continuous integration / continuous delivery (CI/CD) pipeline set up for...",
  "data/redirect-devtop/2021/9/841771.json": "Introduction   Hey-hey, awesome DEV people! 😉  How about a little time in the company of an...",
  "data/redirect-devtop/2021/9/844676.json": "Now that I've been working with front-end web frameworks professionally for over 2 years, I can...",
  "data/redirect-devtop/2021/9/843667.json": "In simple words, lettering is that the art of drawing letters. Using this system, you'll create...",
  "data/redirect-devtop/2021/9/841017.json": "Today we are going to copy \"someone else's\" repository on our GitHub account and learn how to clone...",
  "data/redirect-devtop/2021/9/833256.json": "The word \"interview\" is frequently associated with anxiety and discomfort. However, you may prepare...",
  "data/redirect-devtop/2021/9/844819.json": "1. Semantic Header and Footer   Divs have no semantic structure. Instead of using divs to...",
  "data/redirect-devtop/2021/9/845126.json": "After the fragmentation effect, I am going to tackle another interesting animation: The Blob! We all...",
  "data/redirect-devtop/2021/9/845750.json": "Introduction 1. Code Linting &amp; SAST 2. Running a security audit with npm audit  3. Integrity...",
  "data/redirect-devtop/2021/9/845052.json": "JavaScript is an awesome programming language. And TypeScript has done a great job at filling in the...",
  "data/redirect-devtop/2021/9/825165.json": "A lot of exciting things have been going in the Solid in the last few months since the 1.0...",
  "data/redirect-devtop/2021/9/843723.json": "This week I launched a tool,  Beautiful CSS.  You just have to click on any of the components and it...",
  "data/redirect-devtop/2021/9/810209.json": "TypeScript provides two ways to create custom types for our data and they include Type aliases and...",
  "data/redirect-devtop/2021/9/845771.json": "Hey there, I'm Savio Martin, A 14-year-old boy on an intention to enhance as a successful full-stack...",
  "data/redirect-devtop/2021/9/845821.json": "We all know that API keys and connections can not be secured on the client side of an application....",
  "data/redirect-devtop/2021/9/842128.json": "Cover photo by Tim Swaan on Unsplash.  This article explains how to manage subscriptions in Angular...",
  "data/redirect-devtop/2021/9/845398.json": "24 lessons on Data science for beginners",
  "data/redirect-devtop/2021/9/846098.json": "GitHub is the place you should be looking for when you’re trying to improve yourself as a developer....",
  "data/redirect-devtop/2021/9/845148.json": "Tailwind CSS is a framework that I've been using for quite some time and I must say that I've...",
  "data/redirect-devtop/2021/9/845192.json": "With all the NFT hype around, it happened that I got tasked to write an article about NFTs and...",
  "data/redirect-devtop/2021/9/846750.json": "NocoDB is an open source Airtable alternative that instantly also provides you REST APIs on any MySQL...",
  "data/redirect-devtop/2021/9/845494.json": "Nested if-else statements can make it unnecessarily complicated to reason about the different...",
  "data/redirect-devtop/2021/9/831942.json": "I want to start with a question Have you ever wondered how applications such as Messenger, WhatsApp...",
  "data/redirect-devtop/2021/9/846501.json": "Building websites from scratch is a tough task if you don't have a designer on board. Most of the...",
  "data/redirect-devtop/2021/9/845824.json": "Promise: Imagine that you’re a top singer, and fans ask day and night for your upcoming song.  To get...",
  "data/redirect-devtop/2021/9/845728.json": "Here is a series of articles to help you create backend applications in Javascript.  Node.js is now a...",
  "data/redirect-devtop/2021/9/846186.json": "Kubernetes, also known as K8s, is the most popular platform for container orchestration for...",
  "data/redirect-devtop/2021/9/839155.json": "Vue performs DOM updates asynchronously! But what does mean?  I will begin by explain you what is...",
  "data/redirect-devtop/2021/9/847067.json": "Appreciation   What an overwhelming response from the first challenge! I really enjoy seeing...",
  "data/redirect-devtop/2021/9/844336.json": "Writing high-quality JavaScript code is hard. With the help of powerful tools, they can make your developer life easier.",
  "data/redirect-devtop/2021/9/844079.json": "Here is the website -&gt;  https://www.tricky.ml/  Here is the repo...",
  "data/redirect-devtop/2021/9/845492.json": "Building an application is one set of challenges that needs to be tackled, and once that is done, you...",
  "data/redirect-devtop/2021/9/844106.json": "Introduction   Database-driven realtime architectures are becoming more and more common as...",
  "data/redirect-devtop/2021/9/846393.json": "Ever wondered how you can build your own Chrome Extension? It's not as hard as you might think!  In...",
  "data/redirect-devtop/2021/9/845825.json": "Maintainers: if you're seeking Hacktoberfest collaborators for your projects, this is the spot to share your info!",
  "data/redirect-devtop/2021/9/845848.json": "Here’s how we’re celebrating open source this month and how you can join us!",
  "data/redirect-devtop/2021/9/845188.json": "This is one of the many things I keep forgetting every now and then. Other things like taking out...",
  "data/redirect-devtop/2021/9/847012.json": "You might get this as an interview question for web development roles, especially front-end roles....",
  "data/redirect-devtop/2021/9/840103.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/9/846406.json": "This is a guide to help you set up React Context API with typescript.           🤨 What React Context...",
  "data/redirect-devtop/2021/9/846480.json": "In this article we are going to see a well curated list of angular interview questions 2021 and...",
  "data/redirect-devtop/2021/9/845440.json": "Discover how to get started in seconds on a new project, isolate all your dev environments and share them with your teammates using VS Code dev containers.",
  "data/redirect-devtop/2021/9/846249.json": "At my recent GitKon talk, I spoke about git commit and what it means to have good commits.  git...",
  "data/redirect-devtop/2021/9/846538.json": "Introduction   Hacktoberfest is a month-long event where people are awarded for contributing...",
  "data/redirect-devtop/2021/9/847066.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/9/845423.json": "I have been using JavaScript for most of my career, but I recently started working at a company that...",
  "data/redirect-devtop/2021/9/831827.json": "I've been using Tailwind CSS for the past 4 months now, and I can confidently say that it's much much...",
  "data/redirect-devtop/2021/9/840813.json": "Hi guys! I have created this publication, because I wanted to share some tools or resources that I...",
  "data/redirect-devtop/2021/9/846535.json": "Introduction  I will share same libraries and packages to make your .NET project easier, and...",
  "data/redirect-devtop/2021/9/831138.json": "1). Be afraid of Windows: If you are on Windows then on one beautiful day you would be presented with...",
  "data/redirect-devtop/2021/9/816609.json": "Hey There 👋🏾  Hope you are doing well. 🙌🏾  I joined Microsoft as a full-stack developer last month...",
  "data/redirect-devtop/2021/9/839488.json": "You ever wonder about what people do at the C-level of a company? I did too, and no matter how many...",
  "data/redirect-devtop/2021/9/841484.json": "Today, we're going time travelling! Let's go back to the year CCXVII, so 217, all the way to the iron...",
  "data/redirect-devtop/2021/9/836320.json": "When I wanted to learn how to code I thought the only available options were either to go to...",
  "data/redirect-devtop/2021/9/843979.json": "Database Replication is the process of taking data from a source database (MySQL, Mongo, PostgreSQL,...",
  "data/redirect-devtop/2021/9/842139.json": "In this article, we are going to learn how to create a payment application using Python flask...",
  "data/redirect-devtop/2021/9/840982.json": "Here, we are again with another beginner friendly blog. In this blog we will learn about one of the...",
  "data/redirect-devtop/2021/9/838151.json": "Did you know there are laws of software just like there are laws of physics?",
  "data/redirect-devtop/2021/9/815611.json": "Índice    Requerimientos para aprender Webpack ¿Qué es webpack? ¿Por qué es útil empaquetar...",
  "data/redirect-devtop/2021/9/831551.json": "If you are looking for alternatives for Electron, Then you should give it a try to Neutralinojs. So...",
  "data/redirect-devtop/2021/9/846146.json": "These are four common mistakes in React interviews. Sometimes the pressure of the interview makes us...",
  "data/redirect-devtop/2021/9/831543.json": "Few days before, I created an OpenSource Project called Dopefolio and wrote an Article about it here...",
  "data/redirect-devtop/2021/9/840312.json": "Angular 13 features",
  "data/redirect-devtop/2021/9/818546.json": "What is Well-Architected 🤔   Well-Architected describes the key concepts, design principles...",
  "data/redirect-devtop/2021/9/834042.json": "Shortening your code might not be the best way to do something, but it can help you out a lot if you...",
  "data/redirect-devtop/2021/9/811706.json": "Single responsibility principle in React. The key of thinking and writing components in React.",
  "data/redirect-devtop/2021/9/841496.json": "Thirty-five lines of code. That's what it took to build a functional cartesian coordinates system with CSS.",
  "data/redirect-devtop/2021/9/818191.json": "How a simple McDonald's toy ended up providing a nice development challenge.",
  "data/redirect-devtop/2021/9/820580.json": "Introduction   Docker makes it easier, simpler and safer to build, deploy and manage..."
}