{
  "data/redirect-devtop/2022/4/1041174.json": "It's been 735 articles, and I've finally had enough. Time to lay down the keyboard and retire the...",
  "data/redirect-devtop/2022/4/1041123.json": "Someone in one of the Slack communities I'm a part of asked today how to type JSON in TypeScript,...",
  "data/redirect-devtop/2022/4/1041822.json": "Simple full-stack starter that uses a M-UI React design powered by Express/NodeJS",
  "data/redirect-devtop/2022/4/1041850.json": "Thanks to its static binaries and cross-compiling, building and distributing command-line apps in Go...",
  "data/redirect-devtop/2022/4/1041770.json": "Recently I did some interviews for companies that call themselves \"human focused\", but in the time...",
  "data/redirect-devtop/2022/4/1041220.json": "Let's take a quick look and Click \"?\" on this page!           The started   I wanted to sound in my...",
  "data/redirect-devtop/2022/4/1042213.json": "Now that we are talking about testing, let's try out Jest, a pretty well-used testing framework for...",
  "data/redirect-devtop/2022/4/1042481.json": "Here, several approaches will be introduced to reduce your front-end code base, especially, for...",
  "data/redirect-devtop/2022/4/1042005.json": "Hey! This is my first post on DEV. I have started learning web development late 2021. I've been...",
  "data/redirect-devtop/2022/4/1042691.json": "Overview   Decifer is a cross-platform mobile app that helps to generate transcripts either...",
  "data/redirect-devtop/2022/4/1043133.json": "Having a good README can make the difference between a 0-star and a Unicorn Github Project! I hope...",
  "data/redirect-devtop/2022/4/1043160.json": "Open-Source React Dashboard Template crafted on top of M-UI Library (sources available on Github)",
  "data/redirect-devtop/2022/4/1043325.json": "Remember the old days when the internet used to be the only escape you had to run away from our cruel...",
  "data/redirect-devtop/2022/4/1042835.json": "I'm starting a new role soon, and they shipped me a brand new Macbook Pro.  I got everything set up...",
  "data/redirect-devtop/2022/4/1043337.json": "Github is a popular platform for tons of resources and there are many repositories which provide free..."
}