{
  "data/redirect-devtop/2020/6/351025.json": "Resources are extremely important for a programmer since they can greatly improve productivity while coding. ",
  "data/redirect-devtop/2020/6/347446.json": "Free React resources are very difficult to find when searching for templates and themes on the Intern...",
  "data/redirect-devtop/2020/6/368156.json": "The most used technology by developers is not Javascript.  It's not Python or HTML.  It hardly even g...",
  "data/redirect-devtop/2020/6/356257.json": "TypeScript is a typed language that allows you to specify the type of variables, function parameters,...",
  "data/redirect-devtop/2020/6/366130.json": "You're stuck in doing basic coding examples, with tutorials that don't seem to be real-life cases, you are a junior Web Developer and still have trembling feet, only dealing with static websites, you're not even comfortable with that, this one is for you.",
  "data/redirect-devtop/2020/6/372661.json": "We should start off with proof that this works. Here's a screenshot of the recent viewer analytics fo...",
  "data/redirect-devtop/2020/6/351445.json": "Illustrations used to create better-designed websites, products, and applications.  The illustration...",
  "data/redirect-devtop/2020/6/349733.json": "This article was originally published at https://www.devaradise.com/how-to-become-front-end-develop...",
  "data/redirect-devtop/2020/6/351766.json": "Table Of Contents   JavaScript Reference Sheet   References Basics Functions  Arrays  Object...",
  "data/redirect-devtop/2020/6/359045.json": "My friend and I recently developed VS Code extension – Snipsnap that aims to solve the existing probl...",
  "data/redirect-devtop/2020/6/371234.json": "If you are a web developer who is constantly searching for tutorials on YouTube, you’ve definitely co...",
  "data/redirect-devtop/2020/6/360521.json": "About two months ago I decided to lay out a list of things I needed to do, things I believed I needed...",
  "data/redirect-devtop/2020/6/366608.json": "1. Data Structures &amp; Algorithms            Why?   Data structures and algorithms are the...",
  "data/redirect-devtop/2020/6/374490.json": "As of this writing, I've been working on the RxJS project for almost 6 years, I think. When I started...",
  "data/redirect-devtop/2020/6/370346.json": "Ctrl + F on chrome opens up a search box that is used to find text on a web page, pdf, etc. It's one...",
  "data/redirect-devtop/2020/6/360380.json": "As a web developer fiddling around with JavaScript most of the time, I wanted to explore the territor...",
  "data/redirect-devtop/2020/6/347283.json": "Hundreds of tutorials on how to build things but never they explain what to do with them next.",
  "data/redirect-devtop/2020/6/351979.json": "This post was originally published at https://www.devaradise.com/react-project-folder-structure  A re..."
}