{
  "data/redirect-devtop/2022/5/1072215.json": "Sample project crafted with Django, Charts.JS, and DRF to showcase how to plot different charts Pie, Line, and Bar Charts.",
  "data/redirect-devtop/2022/5/1072097.json": "Why do developers HATE certain programming languages?   You hear such things as \"--- is slower and...",
  "data/redirect-devtop/2022/5/1072274.json": "Being a software engineer requires you to have many skills. In my career I've worked with people from...",
  "data/redirect-devtop/2022/5/1072448.json": "Open-Source sample that uses Flask as the backend framework and HTMLx for the frontend logic",
  "data/redirect-devtop/2022/5/1072424.json": "What tech stacks(MERN, MEVN etc) do you guys use in your personal projects or work? and why do you...",
  "data/redirect-devtop/2022/5/1072419.json": "The life of a programmer is tough. Some of the time we are sane, but there are times when there is...",
  "data/redirect-devtop/2022/5/1072641.json": "There are so many ways to make web development more efficient, and I found some amazing resources...",
  "data/redirect-devtop/2022/5/1072657.json": "Would you still be spending 8+ hours a day on that work project instead of the dream business you...",
  "data/redirect-devtop/2022/5/1072291.json": "A headless CMS system, which can be developed quickly, contains many features you need, and helps you to produce products very quickly compared to traditional systems.",
  "data/redirect-devtop/2022/5/1072658.json": "A post by Syed Mohsin Raza",
  "data/redirect-devtop/2022/5/1072947.json": "(Title photo: Ophelia photos - Creative Commons)  I stumbled upon this twitter thread and...",
  "data/redirect-devtop/2022/5/1073122.json": "A broad layman's definition of a psychosis is roughly; \"The belief in something that has been proven...",
  "data/redirect-devtop/2022/5/1073372.json": "cover image credits: Thoka Maer  In this weekly series, folks can chime in and drop links to whatever...",
  "data/redirect-devtop/2022/5/1073160.json": "There are many programming languages out there, each with its own strengths and weaknesses. But what...",
  "data/redirect-devtop/2022/5/1072807.json": "Hello guys and welcome to a new blog post about Design Patterns in TypeScript.           What is a...",
  "data/redirect-devtop/2022/5/1073815.json": "Are you starting? You are an expert? Do you have the best portfolio?  For all developers it is...",
  "data/redirect-devtop/2022/5/1073694.json": "Programming terminology can be rather confusing. The first time I'd heard about \"React Refs\", it was...",
  "data/redirect-devtop/2022/5/1073439.json": "Minha colega de trabalho, Rizèl Scarlett, criou uma extensão para o VScode que te permite subir seu...",
  "data/redirect-devtop/2022/5/1073819.json": "#DISCUSSION  This question goes out to experienced devs who've worked on sizeable/non+trivial...",
  "data/redirect-devtop/2022/5/1074467.json": "Fala galera, pokemaobr aqui novamente, para trazer mais conteúdo para você que é dev e está começando...",
  "data/redirect-devtop/2022/5/1074756.json": "Celebrating the winners from the Deepgram Hackathon on DEV!",
  "data/redirect-devtop/2022/5/1074422.json": "Creating advanced shapes from scratch requires some advanced CSS and SVG knowledge and you might...",
  "data/redirect-devtop/2022/5/1074435.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/5/1074424.json": "Introduction   Ever wondered how your modern PC get to the Login screen with a mere press of...",
  "data/redirect-devtop/2022/5/1074453.json": "Announcing a new CodeLand 2022 Fireside Chat with Kelsey Hightower",
  "data/redirect-devtop/2022/5/1074932.json": "Generally, we use height:100vh for fullscreen layout which is easy hack and convenient way to get...",
  "data/redirect-devtop/2022/5/1075486.json": "Building and maintaining an Open Source Software(OSS), the project is hard. If your project gets...",
  "data/redirect-devtop/2022/5/1075055.json": "Whether you remember the death (for the Dutch readers), or celebrating Star Wars day.  The 4th of May...",
  "data/redirect-devtop/2022/5/1075532.json": "No wrong answers here, what tools/stack would you choose and why?",
  "data/redirect-devtop/2022/5/1075073.json": "Hello everyone👋  We are very excited to introduce our first product to the community. It is simple...",
  "data/redirect-devtop/2022/5/1074892.json": "Short and sweet. What podcasts have you been listening to lately? Also, they don't necessarily need...",
  "data/redirect-devtop/2022/5/1075558.json": "Introduction   Computers have evolved a lot in a short span of time and are still evolving...",
  "data/redirect-devtop/2022/5/1074792.json": "Think before you code. I give this advice to every junior engineer I meet. Yet most younger...",
  "data/redirect-devtop/2022/5/1075218.json": "In Kubernetes, some applications need to be public-facing. Perhaps it’s a web app or something else...",
  "data/redirect-devtop/2022/5/1075017.json": "As a lazy software engineer I want to write code only when necessary. If I happen to write code I...",
  "data/redirect-devtop/2022/5/1074746.json": "Often I face the problem that I want to start UI development from bottom to top: start with designing..."
}