{
  "data/redirect-devtop/2020/5/332325.json": "“You’re only as good as the tools you use”  This saying has been around for years and highlights the...",
  "data/redirect-devtop/2020/5/342603.json": "Having a list of resources 📚 is always a great thing to have by your side.  Being a coder, it is the...",
  "data/redirect-devtop/2020/5/339709.json": "This is a very opinionated list of tools and apps that will help you up your game as a developer.",
  "data/redirect-devtop/2020/5/343820.json": "It’s every developer’s frustration once in a while to see that big red Access to fetched has been blo...",
  "data/redirect-devtop/2020/5/327256.json": "Maybe you want to make something cool for the web using some APIs. Maybe you are tired from building...",
  "data/redirect-devtop/2020/5/344760.json": "You want to find remote developer jobs.  You've found them:           Full-time / Part-time Developer...",
  "data/redirect-devtop/2020/5/337277.json": "You may think a career is an old fashioned concept out of the 80s which could be safely ignored. I su...",
  "data/redirect-devtop/2020/5/340738.json": "Photo by Flo P on Unsplash   Originally posted on my site  Hey folks! few weeks ago i started a new...",
  "data/redirect-devtop/2020/5/336053.json": "If you’ve been wanting to start freelancing but do not know where to start, this is the perfect artic...",
  "data/redirect-devtop/2020/5/331957.json": "Learn how Deno works and it's differences with Node.js by creating a Chat application.",
  "data/redirect-devtop/2020/5/329026.json": "Details about the Grant for the Web Hackathon hosted on DEV.",
  "data/redirect-devtop/2020/5/345461.json": "I'd love to let you in on the next step of what I hope will be all of our collective journey together...",
  "data/redirect-devtop/2020/5/333059.json": "Not just meant for developers and makers, they are for everybody.",
  "data/redirect-devtop/2020/5/335173.json": "I expect I'll annoy everyone with this post: the anti-JavaScript crusaders, justly aghast at how much...",
  "data/redirect-devtop/2020/5/345120.json": "Check out this list of ten javascript quiz questions to improve your chops.",
  "data/redirect-devtop/2020/5/343853.json": "A list of open source alternatives to proprietary software",
  "data/redirect-devtop/2020/5/345068.json": "As an infographic designer turned developer, I am always fascinated by effective visual explanations...",
  "data/redirect-devtop/2020/5/336787.json": "I had a working old laptop and was itching to do something with it. And then I decided to turn it int...",
  "data/redirect-devtop/2020/5/329105.json": "Microservices are completely disrupting the way we build applications nowadays. This is one of the ho...",
  "data/redirect-devtop/2020/5/345657.json": "Over recent years,  React  has grown to become the most popular and widely-used JavaScript UI library...",
  "data/redirect-devtop/2020/5/329606.json": "In this article I assume you have already read the basics about test-driven development. Here, I desc..."
}