{
  "data/redirect-devtop/2021/10/847714.json": "Autumn is officially back, and with it another portion of fresh cloud technology news.   This series...",
  "data/redirect-devtop/2021/10/848060.json": "We recently shipped the groundwork for internationalizing Forem. Initially, this means that admins...",
  "data/redirect-devtop/2021/10/847260.json": "Fetching data from an API either from an external source or from the Backend of your application can...",
  "data/redirect-devtop/2021/10/847819.json": "The year is 2021 and the web development job market (or programming in general tbh) is all about...",
  "data/redirect-devtop/2021/10/847479.json": "👉 Modern navigation menu using only css 🚀   see below 👇",
  "data/redirect-devtop/2021/10/847795.json": "If you've used React Router on many projects, definitely you've asked How i can pass some data or...",
  "data/redirect-devtop/2021/10/847731.json": "For the last few projects I've been using Tailwind CSS to build and style the components, sections,...",
  "data/redirect-devtop/2021/10/847761.json": "Summary    Introduction Objectives How to work effectively? Input Output Steps High-level...",
  "data/redirect-devtop/2021/10/847692.json": "Hey there 👋  CSS can be weird and confusing, so let me explain Flutter's styling using it as a...",
  "data/redirect-devtop/2021/10/847727.json": "The growth of the project and its load can be a real challenge for the developer. The website begins...",
  "data/redirect-devtop/2021/10/847704.json": "Ever felt the need of hiding stuff from the world. In this article, I'll show you how you can encrypt...",
  "data/redirect-devtop/2021/10/848653.json": "Simple Interest Calculator Using Pure HTML, CSS &amp; JS.           SOURCE CODE:          ...",
  "data/redirect-devtop/2021/10/848300.json": "A function is a set of statements that perform a specific task. It is one of the fundamental building...",
  "data/redirect-devtop/2021/10/848017.json": "You've most likely heard of the term API if you have ever worked with JavaScript. There're a ton of...",
  "data/redirect-devtop/2021/10/849097.json": "There are a lot of react animation libraries available for reactjs. The top ones are listed...",
  "data/redirect-devtop/2021/10/848890.json": "I once heard a colleague ask, 'how do you survive with javascript(js), so many libraries. Nodejs,...",
  "data/redirect-devtop/2021/10/847279.json": "Well, salam and hello again!  Previously, I discussed array loops, from the basics of the loop to...",
  "data/redirect-devtop/2021/10/848758.json": "How to Create Awesome Card Design for Website with HTML CSS  In this video I will show you how to...",
  "data/redirect-devtop/2021/10/848909.json": "First time participating in Hacktoberfest?  Well, I have got a solution for all the newbie web devs...",
  "data/redirect-devtop/2021/10/849287.json": "1. Create an accordion with HTML   Yes, you can actually create an accordion purely using...",
  "data/redirect-devtop/2021/10/849123.json": "👋Hi there and Happy Hacktoberfest 2021 fellow developers! 🎊  I hope you're doing fantastic!  In the...",
  "data/redirect-devtop/2021/10/848324.json": "All the tools you need to confidently build accessible React components in Storybook! ",
  "data/redirect-devtop/2021/10/849297.json": "20 mini frontend projects from scratch with HTML5, CSS &amp; JavaScript (No frameworks or libraries)...",
  "data/redirect-devtop/2021/10/849114.json": "Iterating through items and dealing with asynchronous logic (i.e. API calls) are probably two of the...",
  "data/redirect-devtop/2021/10/849643.json": "Story   Hi, I am Yash Makan, a 17-year-old self-taught programmer. I was thinking a couple...",
  "data/redirect-devtop/2021/10/848908.json": "TL;DR; A rant from a dinosaur that can't keep up anymore. How do you guys do this?  EDIT: Holy cow....",
  "data/redirect-devtop/2021/10/848837.json": "I end up creating a lot of Rails apps, and each time I get started I often find myself wanting to add...",
  "data/redirect-devtop/2021/10/848493.json": "This week, I practiced using git to manage multiple changes in one project at the same time and using...",
  "data/redirect-devtop/2021/10/849496.json": "Motivation   When we develop a Single-Page Application, we usually only define its behavior...",
  "data/redirect-devtop/2021/10/849451.json": "Being healthy should be the first and foremost goal of any human being. As a programmer, it is even...",
  "data/redirect-devtop/2021/10/849339.json": "I recently saw the following tweet from @_georgemoller which posed an interesting question related to...",
  "data/redirect-devtop/2021/10/849739.json": "I've been using Tailwind CSS for quite some time and I am in love with how easy it is to set up user...",
  "data/redirect-devtop/2021/10/849612.json": "At first glances, PDF viewer seems to be as easy as opening a PDF URL in an Iframe; however, not only...",
  "data/redirect-devtop/2021/10/847772.json": "Life, coding &amp; business are full of lessons if you look for them.   Some you learn the...",
  "data/redirect-devtop/2021/10/848092.json": "The other day a co-worker noticed something interesting about our production code: You could view our...",
  "data/redirect-devtop/2021/10/848651.json": "Solidity is an object-oriented, high-level programming language for creating smart contracts on the...",
  "data/redirect-devtop/2021/10/848915.json": "Effector is a lightweight and performant state manager. It is UI frameworks agnostic, predictable and easy to use. Almost half a year ago, Aviasales team has started migration from RxJS to Effector. While I was investigating this library, I found a completely unexpected feature. It changed my mind about Effector.",
  "data/redirect-devtop/2021/10/849475.json": "Programming can lead to a high paying career, but in the tech industry you often have to work long...",
  "data/redirect-devtop/2021/10/850155.json": "tl;dr: Use SonarLint and optionally StyleCop.  The JavaScript ecosystem has amazing tools for...",
  "data/redirect-devtop/2021/10/850648.json": "Hang on, lads. I've got a great idea.   So you've run out of Netflix TV shows to watch,...",
  "data/redirect-devtop/2021/10/850286.json": "In this blog, I will share some general concepts of how to implement a responsive design to your...",
  "data/redirect-devtop/2021/10/849791.json": "Introduction   VIM is a text editor for writing code, where you navigate around the screen...",
  "data/redirect-devtop/2021/10/850156.json": "Hey guys!  I'm Ethan, I'm one of 8 swallow developers. This post is gonna be about some updates we've...",
  "data/redirect-devtop/2021/10/850642.json": "I’ve been developing applications with React for a long time and I’m loving it more and more. React...",
  "data/redirect-devtop/2021/10/850454.json": "Save for later.            1loc.dev    JS utilities in single line of code.             ...",
  "data/redirect-devtop/2021/10/850445.json": "If you have ever searched the mystic lands of the internet for quality stock photos, videos or music,...",
  "data/redirect-devtop/2021/10/850475.json": "Frontend technology turns in robust at current decades. Modern web technology now more dynamic, more...",
  "data/redirect-devtop/2021/10/850803.json": "In this post, I want to show you how you can move your development environment to the cloud with Gitpod",
  "data/redirect-devtop/2021/10/850757.json": "All the steps described are in this repo.           Intro   NestJS is a framework for building...",
  "data/redirect-devtop/2021/10/851539.json": "Happy Hacktober! 'Tis the season to contribute. If you're excited about contributing to open source,...",
  "data/redirect-devtop/2021/10/849100.json": "When ES6 launched,  it introduced two important protocols Iterable and Iterator. Basically we can...",
  "data/redirect-devtop/2021/10/850665.json": "In this article, we will create a panel where we can manage the feedback we receive from our web...",
  "data/redirect-devtop/2021/10/850259.json": "Wait! React has a lifecycle? Is this the web form of the Terminator? No humankind is safe! React is...",
  "data/redirect-devtop/2021/10/847523.json": "refine is an extremely customizable Ant Design based React framework for data-intensive applications...",
  "data/redirect-devtop/2021/10/851152.json": "React Berry Dashboard, a modern pixel-perfect dashboard built with Material-Ui components is now available as a full-stack product.",
  "data/redirect-devtop/2021/10/851500.json": "I'm curious about what comes to mind. Whether it is software related or otherwise, what does today's...",
  "data/redirect-devtop/2021/10/851912.json": "If you’re a developer, you will likely already have a collection of favorite Chrome extensions you...",
  "data/redirect-devtop/2021/10/851996.json": "If you’ve had a look at the Contentful docs, you’ll have seen the acronyms REST and API in at least a...",
  "data/redirect-devtop/2021/10/851657.json": "I had to do a manual deep linking hook, scrolling automatically down in a web application to a...",
  "data/redirect-devtop/2021/10/850387.json": "In this article I have shown how Skeleton Screen Loading Animation is created using HTML CSS and...",
  "data/redirect-devtop/2021/10/852252.json": "Video Calling is becoming norm for everyone nowadays and integrating Video API is as hard as building...",
  "data/redirect-devtop/2021/10/851445.json": "Picture this: You’re building an app that uses global configuration values (public and private keys,...",
  "data/redirect-devtop/2021/10/852311.json": "Hello, hope you'll are good. In previous part, we have made login/log out feature and a seller...",
  "data/redirect-devtop/2021/10/852160.json": "Tailwind CSS is a framework that I've been using a lot lately to quickly build websites without...",
  "data/redirect-devtop/2021/10/852643.json": "Hey all,  This post is in collaboration with James Q Quick. If you like to see videos then check out...",
  "data/redirect-devtop/2021/10/852408.json": "Let’s face it, Git is a chore.  It’s about as exciting as cold oatmeal. However, when used properly,...",
  "data/redirect-devtop/2021/10/852915.json": "Introduction            What is React   React is a declarative and component-based...",
  "data/redirect-devtop/2021/10/851955.json": "DEV is a community of software developers getting together to help one another out. The software...",
  "data/redirect-devtop/2021/10/852679.json": "React hooks initially allow you to \"hook into\" React state and lifecycle features, like we used to do...",
  "data/redirect-devtop/2021/10/852396.json": "I know data structures and algorithms sound scary, But they are not.  If you learn them, you can pass...",
  "data/redirect-devtop/2021/10/853689.json": "This article is a collection of the 18 most frequently asked questions and their answers when it...",
  "data/redirect-devtop/2021/10/851869.json": "Why should you start a blog as a developer? Does it actually have any benefits, or is it just one of...",
  "data/redirect-devtop/2021/10/849873.json": "The Adapter pattern and the Bridge Pattern have brought along a lot of confusion. In this post we're...",
  "data/redirect-devtop/2021/10/853694.json": "Introduction to Docker      It is more likely than not that Docker and containers are going...",
  "data/redirect-devtop/2021/10/851671.json": "Introduction   An Integrated Development Environment(IDE) provides us with all the tools for...",
  "data/redirect-devtop/2021/10/852652.json": "We live in times where you learn JS to write server side code and desktop apps (electron), and you...",
  "data/redirect-devtop/2021/10/854121.json": "What is this?      The following is a collection of terminology and definitions of various...",
  "data/redirect-devtop/2021/10/853374.json": "In this article you will learn how to make a simple stop watch using JavaScript. Stopwatch is a...",
  "data/redirect-devtop/2021/10/852521.json": "In JavaScript, an object is a standalone entity, with properties and type.   Compare it with a cup,...",
  "data/redirect-devtop/2021/10/855079.json": "Controlling cloud costs is one of the biggest challenges facing teams across every organization that...",
  "data/redirect-devtop/2021/10/853730.json": "Hi folks!  Lately, I have been seeing a lot of portfolio websites inspired by operating systems. I...",
  "data/redirect-devtop/2021/10/851988.json": "In September 1995, Brendan Eich, a Netscape programmer, created a language called Mocha in 10...",
  "data/redirect-devtop/2021/10/854726.json": "Tailwind CSS is a utility-first framework that I've been using for most of my projects this year and...",
  "data/redirect-devtop/2021/10/852729.json": "Day 1 of the 30 Days Of Python.   What python is. Python programming paradigms: Imperative,...",
  "data/redirect-devtop/2021/10/848099.json": "Welcome to the first javascript quizz!  You can answer to the question and check the response with...",
  "data/redirect-devtop/2021/10/854534.json": "There are some things you need before you design anything.           1. A Logo and Favicon   A logo...",
  "data/redirect-devtop/2021/10/854342.json": "This article assumes you have knowledge about building React Components, Libraries, and Tailwind.    ...",
  "data/redirect-devtop/2021/10/853826.json": "SolidJS is a true reactive library that allows you to use JSX for your frontend projects. In this...",
  "data/redirect-devtop/2021/10/854749.json": "What is VueBlogger?   VueBlogger is a light-weight blogging site generator for Vue.js, built...",
  "data/redirect-devtop/2021/10/852411.json": "What is Babel?   Babel is a tool that lets you write your Javascript code using all the...",
  "data/redirect-devtop/2021/10/855531.json": "HTML, CSS and JavaScript can help you create stylish and dynamic web elements. One of those kind of...",
  "data/redirect-devtop/2021/10/853727.json": "Here is a series of articles to help you create backend applications in Javascript.  Node.js is now a...",
  "data/redirect-devtop/2021/10/854351.json": "At a roundtable chat I recently shared with three software developers, we talked about the...",
  "data/redirect-devtop/2021/10/852644.json": "Previously published at fullstackfish.com  Connecting SQL Server to React with Prisma is a...",
  "data/redirect-devtop/2021/10/851510.json": "Remember that \"Who's that Pokémon?\" TV game? Well we can build our own version of this with the...",
  "data/redirect-devtop/2021/10/854719.json": "this post is a precursor for upcoming JSX posts   So we all heard that JSX is a specific JavaScript...",
  "data/redirect-devtop/2021/10/854753.json": "Hello there 👋, citizens of the web! A couple of days ago I decided to write a series of articles on...",
  "data/redirect-devtop/2021/10/856129.json": "What is NodeJs?  Nodejs is a javascript runtime environment. So, what exactly is the javascript...",
  "data/redirect-devtop/2021/10/854717.json": "Earlier this week, we spoke about decentralized applications, and the implications they might have on...",
  "data/redirect-devtop/2021/10/855996.json": "In this post you will join me as I modify a simple component to start utilizing TypeScript. The...",
  "data/redirect-devtop/2021/10/855459.json": "I have been quite quiet on the content creation front. Don't worry I haven't run out of ideas, I have...",
  "data/redirect-devtop/2021/10/852824.json": "TypeScript is a big Superset of JavaScript which has many features which might not be shown in every beginner tutorial. This post has three of them to make your life easier learning TypeScript",
  "data/redirect-devtop/2021/10/856132.json": "Hey everyone 👋🏻,  In this article, let us learn about one of the most important concepts that you as...",
  "data/redirect-devtop/2021/10/855647.json": "Premise   Are you sure you are ensuring your code to be used as intended? Are you preventing...",
  "data/redirect-devtop/2021/10/855436.json": "Last week marked the end of the third phase of Flatiron: Ruby. I was very excited about this phase...",
  "data/redirect-devtop/2021/10/854328.json": "Premise   Make it possible to generate any range of integers with built-in-like...",
  "data/redirect-devtop/2021/10/856156.json": "Introducing mixmello, a free, open source application to create remixed versions of your favourite...",
  "data/redirect-devtop/2021/10/855458.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/10/855789.json": "After using React professionally for nearly two years, I've finally settled on sensible ways to...",
  "data/redirect-devtop/2021/10/857162.json": "Save for later.            csslayout.io    Popular layouts and patterns made with CSS.             ...",
  "data/redirect-devtop/2021/10/855685.json": "(This tutorial is written using webpack v5 however the general concepts will apply to any version)   ...",
  "data/redirect-devtop/2021/10/855210.json": "Hey there. I know I’ve been MIA for a couple of months and I promised I’d be more active with...",
  "data/redirect-devtop/2021/10/854568.json": "In DevOps methodologies, Continuous Delivery and Continuous Deployment are vague terms that we mostly...",
  "data/redirect-devtop/2021/10/856165.json": "Yes, I have always been like you, I've been styling my html elements in my React apps using...",
  "data/redirect-devtop/2021/10/857399.json": "This guide is to help you understand the concept of pagination and how to implement it in react, the...",
  "data/redirect-devtop/2021/10/856302.json": "Hi Guys This is Awesome animated Gradient Loader Here you can get source code.            Source...",
  "data/redirect-devtop/2021/10/847765.json": "I always use to talk about react and redux in the same breath and thought redux does not exist...",
  "data/redirect-devtop/2021/10/856261.json": "As a developer or web designer, when you create a web form, you need to specify some action. The...",
  "data/redirect-devtop/2021/10/855861.json": "Hey everyone and today I'm going to talk about my experience with the library axios, that makes the...",
  "data/redirect-devtop/2021/10/855213.json": "Setting up Appwrite on any Operating System, or Kernel is pretty easy. Here we are going to go...",
  "data/redirect-devtop/2021/10/856587.json": "For the past few weeks I’ve been working on a side project and documenting it in a series of blog...",
  "data/redirect-devtop/2021/10/855512.json": "A comprehensive, non-technical introduction to accessibility",
  "data/redirect-devtop/2021/10/856491.json": "Wondering how to create a freakin' livin' alive an' kickin' Chatbot with XP 0? Then fear not my Brave...",
  "data/redirect-devtop/2021/10/852035.json": "“What branch are you on?” is often the first question you ask when a teammate says “The tests aren't...",
  "data/redirect-devtop/2021/10/857636.json": "This will be my first worthwhile freelance job as opposed to sites I’ve built for friends and family...",
  "data/redirect-devtop/2021/10/857661.json": "About Me   Hi I am Tarun Sharma. I am from India and just finished my school life and took a...",
  "data/redirect-devtop/2021/10/857983.json": "React is an amazing tool to build Front End Applications. This article will provide you some tips...",
  "data/redirect-devtop/2021/10/857679.json": "Welcome to my \"Build 10 CSS Projects in 10 Days\" Series This is day 5 and project 5. If you haven't...",
  "data/redirect-devtop/2021/10/857418.json": "This is sequence of my earlier post about how to understand Redux in isolation and the problems it...",
  "data/redirect-devtop/2021/10/856698.json": "In his article Naser Tamimi compares C++ and Python and this is what he observed:    As you can see...",
  "data/redirect-devtop/2021/10/857427.json": "we'll be migration the legacy Material-ui 4 to Material-ui 5 (mui-5). in the version we've got to see alot of amazing stuff.",
  "data/redirect-devtop/2021/10/858120.json": "Hey Devs! Its my first post in the dev.to! I met front-end development exact 1 year ago and it's...",
  "data/redirect-devtop/2021/10/857410.json": "Tailwind CSS is a utility based framework. Which is great in many ways. However, Tailwind CSS does...",
  "data/redirect-devtop/2021/10/857234.json": "Docker is an open-source platform that allows us to create, deploy, and manage containerized...",
  "data/redirect-devtop/2021/10/857678.json": "Hey guys! My name is Ethan, and I'm one of 12 Peregrine developers. Some of you may already know what...",
  "data/redirect-devtop/2021/10/857848.json": "Definition   A linked list is a linear data structure that represents a collection of...",
  "data/redirect-devtop/2021/10/858112.json": "Hi everyone, This is my first blog on this platform in which we are going to learn regex with the...",
  "data/redirect-devtop/2021/10/858118.json": "Frequently asked Object Oriented Programming interview questions for software developers.",
  "data/redirect-devtop/2021/10/857876.json": "Skeletons are better than spinners. If you're refreshing data, or fetching more, show a spinner. But...",
  "data/redirect-devtop/2021/10/857659.json": "This article was originally published on webinuse.com  This is the third article in the series. We...",
  "data/redirect-devtop/2021/10/858402.json": "Its been a while since microservices appeared as an attempt to answer challenges we face in modern...",
  "data/redirect-devtop/2021/10/858008.json": "Data structures are a way of organizing and storing data so that they can be accessed and worked with...",
  "data/redirect-devtop/2021/10/858829.json": "Building project with standardized structure could save much our time. We could focus on business...",
  "data/redirect-devtop/2021/10/857467.json": "Tailwind CSS is a utility based framework. Which is great in many ways. However, Tailwind CSS does...",
  "data/redirect-devtop/2021/10/857713.json": "Introduction   When you start working as an application security engineer, you'll expect to...",
  "data/redirect-devtop/2021/10/857219.json": "Context   I work on a big 10 year old application (500k blocs of code) with some really bad...",
  "data/redirect-devtop/2021/10/858633.json": "Many times when we come through some interesting thing such as animations or Transitions we are...",
  "data/redirect-devtop/2021/10/859344.json": "Open-source full-stack project crafted by AppSeed and Creative-Tim on top of React, Node JS, and Material-UI design: Soft Dashboard (open-source project).",
  "data/redirect-devtop/2021/10/857833.json": "JSON stands for JavaScript Object Notation. It is a data-interchange format used to communicate...",
  "data/redirect-devtop/2021/10/852405.json": "\"Object-oriented programming is an exceptionally bad idea which could only have originated in...",
  "data/redirect-devtop/2021/10/857183.json": "On most of the company websites, you will find locations or contacts page that displays that company...",
  "data/redirect-devtop/2021/10/858312.json": "Hey everyone 👋🏻,  I recently wrote an article where I mentioned about React Projects Every Beginner...",
  "data/redirect-devtop/2021/10/857224.json": "Not knowing the basic tech can sometimes increase the size, affect the performance and add an extra...",
  "data/redirect-devtop/2021/10/859791.json": "Every time I work in a new JavaScript framework I learn a bit more about JavaScript...",
  "data/redirect-devtop/2021/10/850079.json": "Extensions can make our life as a developer a little easier. Whether they are Visual Studio Code or...",
  "data/redirect-devtop/2021/10/852723.json": "React (also known as React.js or ReactJS) is a free and open-source JavaScript library for building...",
  "data/redirect-devtop/2021/10/857672.json": "we are going to build a Blog site Api which has User Authentication using express, node and MongoDb,...",
  "data/redirect-devtop/2021/10/859378.json": "Introduction   Hey, DEV people! 👋  Here's a small selection of time-tested online tools that...",
  "data/redirect-devtop/2021/10/859836.json": "Node.js can be intimidating to beginners. But its flexible structure and lack of strict guidelines...",
  "data/redirect-devtop/2021/10/859343.json": "Motivation   The new Matrix movie is coming this year, and I'm so hyped for it that I had to...",
  "data/redirect-devtop/2021/10/859480.json": "Besides creating those beautiful UIs our beloved designers give us, handling complex application...",
  "data/redirect-devtop/2021/10/859341.json": "A team retrospective is a meeting at the end of a sprint, project, or milestone where the team...",
  "data/redirect-devtop/2021/10/859129.json": "There are many optimization techniques you can use to improve overall performance of your React...",
  "data/redirect-devtop/2021/10/861066.json": "To deliver on our promise of fully automated cloud cost optimization for Kubernetes, we raised $10...",
  "data/redirect-devtop/2021/10/856986.json": "Ever wondered how to get access to a whole lot of information about people on the internet? Like, any...",
  "data/redirect-devtop/2021/10/860324.json": "Ever have this happen? lol    Yeah, me too.  Here are the 7 ways to completely center whatever you...",
  "data/redirect-devtop/2021/10/858621.json": "A short post about a service I stumbled across called AIVA.  I have been working on systemising my...",
  "data/redirect-devtop/2021/10/859162.json": "Save for later.   Hello. Through this post we'll see how we can make a dashboard widget (in the cover...",
  "data/redirect-devtop/2021/10/860088.json": "If you're into Typescript and prefer a code-first approach when working with databases, you'll be...",
  "data/redirect-devtop/2021/10/861121.json": "(I hope you enjoyed the title. It's a reference to Canadian Rapper Drake's 2015 mixtape: If You're...",
  "data/redirect-devtop/2021/10/858377.json": "Back then those days, I'm on my way to building a very large project myself, it's a social media app....",
  "data/redirect-devtop/2021/10/861065.json": "Hi, I'm Safak. I am a full-stack web developer and I'm sharing open source web projects on my YouTube...",
  "data/redirect-devtop/2021/10/860359.json": "To interact with an OAuth provider you need API keys. For security reasons, those keys must be kept...",
  "data/redirect-devtop/2021/10/858587.json": "Arrays are one of the most common things a programmer uses or is likely to come across in a project....",
  "data/redirect-devtop/2021/10/860753.json": "What is a Javascript functions   A function is a block of organized,reusable code that is...",
  "data/redirect-devtop/2021/10/860328.json": "Hi folks, I'm glad to share with you Aura Theme v2.0.0 with a lot of cool new features.   The entire...",
  "data/redirect-devtop/2021/10/860547.json": "Adding a Background Image in HTML is one of the most common tasks when you are working on Web...",
  "data/redirect-devtop/2021/10/860731.json": "To read the full article, tap here. The role of writers in building brands is indispensable today....",
  "data/redirect-devtop/2021/10/860831.json": "Most popular articles about JavaScript published on the dev.to in this week",
  "data/redirect-devtop/2021/10/859356.json": "What is Django?   Django is a web framework or backend framework used to create efficient...",
  "data/redirect-devtop/2021/10/860191.json": "JWT stands for JSON web token   the common definition says that it is an open industry standard RFC...",
  "data/redirect-devtop/2021/10/851515.json": "Hello there! 👋   I'm Lucas, a brazilian QA engineer, and this is Another QA Content nobody asked for...",
  "data/redirect-devtop/2021/10/861863.json": "Most popular articles about CSS published on the dev.to in this week",
  "data/redirect-devtop/2021/10/861874.json": "Recently I decided to take the dive into making my web app progressive. Some of the benefits are...",
  "data/redirect-devtop/2021/10/861858.json": "👋 Hello, Dear developers 👩‍💻👨‍💻, Today we'll see, how we can easily create another Responsive...",
  "data/redirect-devtop/2021/10/860858.json": "If you are following me you already know that we have made Terminal Animation using Typed.js library....",
  "data/redirect-devtop/2021/10/861415.json": "This article was originally published at...",
  "data/redirect-devtop/2021/10/862523.json": "Ever said this? And then have that happen?    Yeah, me too. lol  Here are 7 tips to help.          ...",
  "data/redirect-devtop/2021/10/860568.json": "Have you ever needed to deploy a React application to multiple environments?  If you've ever had to...",
  "data/redirect-devtop/2021/10/862208.json": "Web scraping:   Web Scraping is a way to collect all sorts of publicly available data like...",
  "data/redirect-devtop/2021/10/853248.json": "So many times heard from dev that they don't understand how to configure webpack because of the...",
  "data/redirect-devtop/2021/10/862569.json": "rem and em units in CSS is creating confusion for beginners,   Most beginners don't understand the...",
  "data/redirect-devtop/2021/10/859843.json": "A curated list with Open-Source seed projects crafted in React and Node JS on top of modern UI kits: Soft UI Dashboard, Berry Template and Data Able.",
  "data/redirect-devtop/2021/10/858710.json": "I'm not sure how this one came about. But, it's a story. This article is more about grokking a...",
  "data/redirect-devtop/2021/10/861059.json": "Ah, the dreaded resolve conflicts popup. You've finished crafting the perfect code, just a quick...",
  "data/redirect-devtop/2021/10/850397.json": "At the beginning of this year, I was promoted to intermediate developer 🎊  At your company, that...",
  "data/redirect-devtop/2021/10/862258.json": "Hey Coders! In this article, I'm gonna break down how the internet actually works. It's incredible...",
  "data/redirect-devtop/2021/10/863003.json": "Appreciation   What an overwhelming response from the first two challenges! I know I said it...",
  "data/redirect-devtop/2021/10/860779.json": "I originally published a Spanish version of this article on my website:  Arquitectura CLEAN para el...",
  "data/redirect-devtop/2021/10/860487.json": "What you’ll be building. Git Repo Here.               Introduction   App and web development have...",
  "data/redirect-devtop/2021/10/860361.json": "In this post we are going to see the AWS networking foundations, networks, subnetworks, firewall,...",
  "data/redirect-devtop/2021/10/860272.json": "Tips for opening a great Pull Request (PR)",
  "data/redirect-devtop/2021/10/863497.json": "This is something I see all the times, you have some code where at some point you have a variable...",
  "data/redirect-devtop/2021/10/863496.json": "Recently, I had a take home assignment for a front end role, and I had to make a sort of Dashboard. I...",
  "data/redirect-devtop/2021/10/862421.json": "I am continuing my CSS Halloween Ugly Sweater Series. Links to previous posts are above.    This is...",
  "data/redirect-devtop/2021/10/863631.json": "Most of us are used to writing JavaScript code for a long time. But we might not have updated...",
  "data/redirect-devtop/2021/10/859077.json": "Wait, this framework compiles to JavaScript only?! Thanks, I'll pass – Frontend developers in...",
  "data/redirect-devtop/2021/10/863235.json": "Size in JavaScript Frameworks is actually a pretty tricky thing to estimate.   Even nailing down the...",
  "data/redirect-devtop/2021/10/848101.json": "Hello everyone, I hope you have been enjoying this series on Git and Github as much as I have. But...",
  "data/redirect-devtop/2021/10/863472.json": "Most popular articles for beginners published on the dev.to in this week",
  "data/redirect-devtop/2021/10/862603.json": "With an update in August 2021, VSCode started supporting Bracket pair colorization natively. It means...",
  "data/redirect-devtop/2021/10/862547.json": "Introduction   Have you ever thought of building a single-page application(SPA) with react...",
  "data/redirect-devtop/2021/10/862596.json": "In this blog, you will learn everything you need to know about javascript destructuring.  I have...",
  "data/redirect-devtop/2021/10/862546.json": "Dockerfile allows you to create container images in such a way as if you were writing shell scripts....",
  "data/redirect-devtop/2021/10/863363.json": "You must have wondered what the differences are between a Frontend Developer, Backend Developer and a...",
  "data/redirect-devtop/2021/10/863182.json": "What is a Command Line Interface (CLI) Application?   CLI tools allow you to run certain...",
  "data/redirect-devtop/2021/10/864259.json": "JavaScript is a programming language used to create web pages and mobile apps. If you have been...",
  "data/redirect-devtop/2021/10/862577.json": "Ahoy there Sweetlings! Let's send some emails! But in a SUPER FUN Way!! For a Sweeter fun, let's add...",
  "data/redirect-devtop/2021/10/855188.json": "A little bonus for people that follows my webpack academy course!  I will show you how to add...",
  "data/redirect-devtop/2021/10/864084.json": "If you are web developper you are using HTML for sure! You are using a lot of HTML attribute, but...",
  "data/redirect-devtop/2021/10/861497.json": "A simple goal, three different experiences. What happen when we try to leverage the type systems of JavaScript, TypeScript, and Elm?",
  "data/redirect-devtop/2021/10/862568.json": "There are often times when we are building websites that leverage the benefits of being delivered on...",
  "data/redirect-devtop/2021/10/864237.json": "Critical Path Rendering    It is the sequence of steps a browser undergoes to convert...",
  "data/redirect-devtop/2021/10/864075.json": "Most sites that display a list of data in a table typically have some kind of filter functionality...",
  "data/redirect-devtop/2021/10/863465.json": "With this reuseable darkmode hook it gets easy to toggle dark and light mode throughout the...",
  "data/redirect-devtop/2021/10/864752.json": "A curated list with open-source React Dashboards crafted on top of Chakra-UI, M-UI and Ant.Design - all products are released under the MIT License.",
  "data/redirect-devtop/2021/10/864175.json": "JavaScript Fetch API provides an interface for accessing and manipulating HTTP requests and...",
  "data/redirect-devtop/2021/10/864767.json": "Hey everyone 👋🏻,  In this article, let us see what 11 Projects I have for you that you can build for...",
  "data/redirect-devtop/2021/10/864555.json": "In today's post, I promise to give you the best article on JavaScript promises you ever read. See...",
  "data/redirect-devtop/2021/10/864280.json": "Save for later.            embla-carousel.com    A lightweight carousel library with fluid motion and...",
  "data/redirect-devtop/2021/10/848376.json": "Introducing the ModuleTeardownOptions#destroyAfterEach option for the Angular testbed.",
  "data/redirect-devtop/2021/10/862812.json": "By now you may be familiar with HarperDB and how we’re different from other databases out there, but...",
  "data/redirect-devtop/2021/10/864489.json": "Hey there 👋 I'm back with another short little post.           There are many articles about this...",
  "data/redirect-devtop/2021/10/863052.json": "Marc Andreessen famously said, \"Software is eating the world\" ten years ago. Over the past decade,...",
  "data/redirect-devtop/2021/10/865145.json": "Many modern approaches for designing flexible and scalable web applications have become popular as...",
  "data/redirect-devtop/2021/10/859515.json": "Hello fellow dev’s today we are gonna see how easy it is to record your voice or screen in the...",
  "data/redirect-devtop/2021/10/863938.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/10/853144.json": "What Typescript Actually Is?   Typescript is a strongly typed programming language like Java...",
  "data/redirect-devtop/2021/10/865631.json": "Hello Folks 👋   This is Savio here. I'm young dev with an intention to enhance as a...",
  "data/redirect-devtop/2021/10/865196.json": "The UI components are the building blocks for these interfaces. They can be anything from navigation...",
  "data/redirect-devtop/2021/10/866129.json": "Simple grab and go upgrade to the base user agent stylesheet to make for readable sites",
  "data/redirect-devtop/2021/10/862859.json": "Repository with full code if you want to follow like...",
  "data/redirect-devtop/2021/10/865648.json": "How many times where you out and about online to to find a good quality Free HTML template for your...",
  "data/redirect-devtop/2021/10/866010.json": "Advantages of extensions   Visual Studio Code is widely used nowadays for writing software....",
  "data/redirect-devtop/2021/10/865689.json": "WhatsApp is without a doubt the most popular smartphone application on our devices. With restrictions...",
  "data/redirect-devtop/2021/10/865523.json": "Top 10 Java articles form Dev.to, Medium and other online portals",
  "data/redirect-devtop/2021/10/866093.json": "Cover Photo by Fidel Fernando on Unsplash  So, I recently had to solve a problem with one of my...",
  "data/redirect-devtop/2021/10/865620.json": "Frequently asked binary tree based coding problem from Java interviews. ",
  "data/redirect-devtop/2021/10/864891.json": "I recently got the opportunity (and the privilege!) of starting a greenfield project at my current...",
  "data/redirect-devtop/2021/10/865113.json": "Now, why should we use it? Simply because it solves our problems. So let's see the problems that...",
  "data/redirect-devtop/2021/10/866327.json": "This post is a continuation of Advanced Front End Developer , Interview Essentials - Part 1 ,if you...",
  "data/redirect-devtop/2021/10/864804.json": "Sometimes to fulfill a business use case in an HTTP request you need to save data to the database on...",
  "data/redirect-devtop/2021/10/865649.json": "Table of Content   Introduction Required Tools Needed Setting Up   Cloudinary Account Visual...",
  "data/redirect-devtop/2021/10/865885.json": "Lots of wrong advice is being handed out here by people who have never actually been developers or...",
  "data/redirect-devtop/2021/10/864731.json": "Salam, and well, hello everyone!  Have you ever thought about the data structure of an array or...",
  "data/redirect-devtop/2021/10/858634.json": "REST API using node, express and MongoDB   This is the second part of the node series; if...",
  "data/redirect-devtop/2021/10/864477.json": "We all have sometime imported files or components like this in multiple lines, this would be okay if...",
  "data/redirect-devtop/2021/10/865851.json": "Parcel Version 2 was publicly released on October 13 of 2021 - as seen in their blog post and also on...",
  "data/redirect-devtop/2021/10/866231.json": "Since its debut, music streaming has developed dramatically, and it is currently one of the most...",
  "data/redirect-devtop/2021/10/866534.json": "Hello, buddies! Lemme ask you a common question,    Do programmers think differently?   It's true;...",
  "data/redirect-devtop/2021/10/865528.json": "I often tell the story of how a simple website made me fall in love with programming. I was given a...",
  "data/redirect-devtop/2021/10/865628.json": "There's no denying that a must-have feature of most modern websites and web apps is the ability to...",
  "data/redirect-devtop/2021/10/866764.json": "In this tutorial, we'll be using TypeScript and Docker to build a Menu Restaurant API app from...",
  "data/redirect-devtop/2021/10/865921.json": "Why learn Data-Structures And Algorithm 🤔?    To Crack the Interviews of the Top Product...",
  "data/redirect-devtop/2021/10/866326.json": "In this article I'm explaining what is the difference between functions and methods in...",
  "data/redirect-devtop/2021/10/865858.json": "Here are the best online text editors that you can use if you are tired of offline text editors and...",
  "data/redirect-devtop/2021/10/866284.json": "With AWS, developers have multiple choices on how to implement real-time communication. Let us go through some of the options.",
  "data/redirect-devtop/2021/10/866396.json": "We are in the era of information explosion. People are tend to have poor concentration and cause low...",
  "data/redirect-devtop/2021/10/865850.json": "I have created a rest API for Python BeautifulSoup library.           Get Basic              Method :...",
  "data/redirect-devtop/2021/10/866285.json": "React automatically Re-Renders the components whenever any of its props or its state is updated. But...",
  "data/redirect-devtop/2021/10/867556.json": "Want to become a Backend Web Developer in 2021? Being a fresher and not knowing what career to choose...",
  "data/redirect-devtop/2021/10/866585.json": "I have recently been traveling to another city. That is why I brought with me my trusty NUC installed...",
  "data/redirect-devtop/2021/10/867536.json": "You ever wanted to know how long does a block of your code takes to execute? Well you have come to...",
  "data/redirect-devtop/2021/10/866245.json": "Hey Dev community! 😆  After weeks of exams and dealing with imposter syndrome, I am back with another...",
  "data/redirect-devtop/2021/10/861439.json": "The only way to change a web page with new informations is by refreshing the page and working on the...",
  "data/redirect-devtop/2021/10/865844.json": "Hello 👋🏽 to Everyone reading this.  This is my first post on dev.to and I'm so excited to tell the...",
  "data/redirect-devtop/2021/10/867244.json": "In case of string we can simply use == or === to see if they are same but we can't use those to see...",
  "data/redirect-devtop/2021/10/867600.json": "Most popular articles published on the dev.to",
  "data/redirect-devtop/2021/10/867338.json": "If I are creating a form with HTML, sometimes I wanted to disable a text box for users. Here came the...",
  "data/redirect-devtop/2021/10/866125.json": "In this article you will learn how to make Simple Email Validation in Javascript. You must have seen...",
  "data/redirect-devtop/2021/10/867289.json": "Currying is one of the more advanced techniques of working with functions. What it does is it allows...",
  "data/redirect-devtop/2021/10/868185.json": "Hello Folks 👋🏻   This is Tarun here. I'm a young dev with big dreams and an intention to...",
  "data/redirect-devtop/2021/10/867610.json": "If you have ever written code that looks like this:    const url =...",
  "data/redirect-devtop/2021/10/866708.json": "🖼️ Image by Gerd Altmann           Introduction   It's quite common to need a dummy API (mocks,...",
  "data/redirect-devtop/2021/10/868148.json": "How does React actually work beyond the syntactic sugar?    This question has dominated my thoughts...",
  "data/redirect-devtop/2021/10/867082.json": "What Is an Object in Programming?   Object-oriented programming, or OOP, is an approach to...",
  "data/redirect-devtop/2021/10/866996.json": "CSS layouts have changed significantly within the past several years due to flexbox and to grid. In...",
  "data/redirect-devtop/2021/10/867661.json": "In this article, we will show you how to use GitHub in a way that you never thought could be used....",
  "data/redirect-devtop/2021/10/867640.json": "During the weekend, I found the following small JS function in a blog post:    const lineChecker =...",
  "data/redirect-devtop/2021/10/868578.json": "When does react component re-renders? What can cause the re-render, and how to prevent unnecessary...",
  "data/redirect-devtop/2021/10/868844.json": "Introduction   No matter if you are a DevOps/SysOps engineer, developer, or just a Linux...",
  "data/redirect-devtop/2021/10/865456.json": "A toggle switch as we know it allows us to choose between two opposite states such as an on/off...",
  "data/redirect-devtop/2021/10/868871.json": "At present Next.js has been a very popular library to build beautiful, scalable Full-Stack...",
  "data/redirect-devtop/2021/10/869218.json": "A while ago, I decided to go hands-on with this amazing #strapi tool. The test results couldn't have...",
  "data/redirect-devtop/2021/10/862271.json": "The ability to position elements on a page is must-have for every web developer. And still, I see...",
  "data/redirect-devtop/2021/10/868827.json": "Most popular articles about JavaScript published on the dev.to in this week",
  "data/redirect-devtop/2021/10/860730.json": "At present react js has been a very popular library to build beautiful and scalable user interfaces....",
  "data/redirect-devtop/2021/10/869130.json": "This article explains how to enhance any React template with JWT (Json WEB Tokens) authentication using a simple Node JS API Backend - Free samples included.",
  "data/redirect-devtop/2021/10/868534.json": "I'll start this article with a quote that changed the way I think of memory. The way I perceive...",
  "data/redirect-devtop/2021/10/867961.json": "Functional programming is a programming paradigm designed to handle pure mathematical functions. This...",
  "data/redirect-devtop/2021/10/854745.json": "Circular Progress Bar is a popular web element that is mainly used on business or personal websites....",
  "data/redirect-devtop/2021/10/869334.json": "This past weekend I completed a web3 project from the awesome folks at buildspace.  The project was...",
  "data/redirect-devtop/2021/10/867675.json": "APIs are the backbone of a successful application architecture and REST APIs are the most popular way...",
  "data/redirect-devtop/2021/10/869153.json": "Overview   One of the ways to make our components reusable is to pass props, whether they...",
  "data/redirect-devtop/2021/10/866249.json": "All code snippets posted are under the MIT License            So does it really matter?   Yes. There...",
  "data/redirect-devtop/2021/10/867260.json": "REST API using node, express and Harper DB   This is the third part of the node series; if...",
  "data/redirect-devtop/2021/10/869838.json": "Version Control (Git) Basics   Hi !! In this blog tutorial, I will be listing out all the...",
  "data/redirect-devtop/2021/10/869906.json": "==================================================  Photo by Markus Spiske on Unsplash  Dear...",
  "data/redirect-devtop/2021/10/869830.json": "What you’ll be building, Git Repo Here.               Introduction   App and web development have...",
  "data/redirect-devtop/2021/10/869791.json": "How fast is your Internet? Lets find it out using JavaScript.    Visual learner? Here's the...",
  "data/redirect-devtop/2021/10/868298.json": "Component libraries are all the rage. Shopify, Salesforce, IBM, and even the United States government...",
  "data/redirect-devtop/2021/10/861205.json": "Performance | Scaling the application is one of the challenges of a software developer.   It is a big...",
  "data/redirect-devtop/2021/10/869836.json": "Online learning has come a long way in the last few years. There are interactive courses, tons of...",
  "data/redirect-devtop/2021/10/869437.json": "Identity and security overview     When it comes to security. There is a lot of guidance and...",
  "data/redirect-devtop/2021/10/871107.json": "Switching from one cloud provider to another is like opening Pandora’s box of infrastructure...",
  "data/redirect-devtop/2021/10/869196.json": "Kubernetes is a container management tool that automates the deployment, scaling, and operations of...",
  "data/redirect-devtop/2021/10/869561.json": "If you are a programmer/web developer then you definitely should follow these YouTube...",
  "data/redirect-devtop/2021/10/869449.json": "1) &lt;abbr&gt;   The abbreviation &lt;abbr&gt; element is used to represent an acronym or...",
  "data/redirect-devtop/2021/10/870623.json": "When we first released Live Share three years ago, our goal was to enable developer collaboration to...",
  "data/redirect-devtop/2021/10/867630.json": "When building out your website, you’ll want to keep search engine optimization (SEO) in mind. You...",
  "data/redirect-devtop/2021/10/870421.json": "Let's first understand the Async keyword.   Put this keyword before the function which returns a...",
  "data/redirect-devtop/2021/10/870560.json": "Haskell has a particularly elegant implementation of the quicksort algorithm:    qs :: (Ord a) =&gt;...",
  "data/redirect-devtop/2021/10/870786.json": "When in comes to Web Development nothing beats JavaScript. But sometimes we have to do a bit more...",
  "data/redirect-devtop/2021/10/871488.json": "OBS studio is cool but lets create our very own screen recorder using JavaScript. And guess what? Its...",
  "data/redirect-devtop/2021/10/870066.json": "Nowadays, creating complex shapes is an easy task using clip-path, but adding a border to the shapes...",
  "data/redirect-devtop/2021/10/871184.json": "Most popular articles for beginners published on the dev.to in this week",
  "data/redirect-devtop/2021/10/871086.json": "You asked your teammate for help with a piece of code and they showed you the solution in their...",
  "data/redirect-devtop/2021/10/869590.json": "Hi You all,   I created a perfect Java Roadmap for Backend Engineering with help of...",
  "data/redirect-devtop/2021/10/870652.json": "Hello everyone! 💙  In this article, I will write about the Vs Code extensions that I find super...",
  "data/redirect-devtop/2021/10/870793.json": "1. Change the color of the cursor for any input field              2. Center any thing with...",
  "data/redirect-devtop/2021/10/870821.json": "Hey everyone,  Imgsrc.space is the best Placeholder service ever. It's just like searching on google...",
  "data/redirect-devtop/2021/10/868869.json": "Recently I stumbled across a cool tool for taking instant screenshots from any website....",
  "data/redirect-devtop/2021/10/870436.json": "Agrippa is growing steadily - it's been out for a little over two months, and already has a small...",
  "data/redirect-devtop/2021/10/871049.json": "Intro   Platforms like Slack, Teams, and Discord have become much more than just a...",
  "data/redirect-devtop/2021/10/865889.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/10/871441.json": "Well, hello! If you're coming from frontend development with Vue, or React, you know that environment...",
  "data/redirect-devtop/2021/10/870898.json": "There's less than 10 days until Hacktoberfest finishes. If you're still looking for projects to...",
  "data/redirect-devtop/2021/10/871501.json": "Kubernetes is a container management tool that automates the deployment, scaling, and operations of...",
  "data/redirect-devtop/2021/10/871932.json": "Welcome to this new academy! In this I will NOT explain you javascript from scratch, the aim of this...",
  "data/redirect-devtop/2021/10/871772.json": "Fingerprinting is a way to identify website users without using cookies or data storage. Instead,...",
  "data/redirect-devtop/2021/10/872209.json": "In this post join me as I use React Testing Library to test a simple React component. Apart from...",
  "data/redirect-devtop/2021/10/870842.json": "In this article, we are gonna look at some javascript methods that you should know. You might know...",
  "data/redirect-devtop/2021/10/872485.json": "The following was originally sent out in my weekly newsletter.   If you're reading this, you're...",
  "data/redirect-devtop/2021/10/871450.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/10/871461.json": "I've taken notes over the years with everything from plain text files to heavy apps like OneNote but for me this just blows everything else away.",
  "data/redirect-devtop/2021/10/854819.json": "Hi, my name is Saifullah Usmani. I am a Programmer and a Graphic Designer. I have been programming...",
  "data/redirect-devtop/2021/10/872197.json": "Software development is a team effort   When doing software development it is essential to...",
  "data/redirect-devtop/2021/10/872842.json": "Posting data to API's has never been easy. But have you ever used React to post form data to...",
  "data/redirect-devtop/2021/10/871954.json": "What is Three.js? Three.js is a library to make WebGL easier. Oh… OK then…? So, the next question...",
  "data/redirect-devtop/2021/10/872843.json": "In this article we are gonna build a loading spinner for you website stay tuned for that first let's...",
  "data/redirect-devtop/2021/10/873370.json": "Docker is an open-source container management platform used to build, run and package applications...",
  "data/redirect-devtop/2021/10/872226.json": "How do you guys update your state if it depends on the previous value?  Simple!!    ...  const...",
  "data/redirect-devtop/2021/10/872417.json": "Here is a series of articles that will allow you to create backend applications with NodeJS +...",
  "data/redirect-devtop/2021/10/849154.json": "DOM? Serverless? CI/CD? JSON?            WTF is everyone talking about???   If you're new to...",
  "data/redirect-devtop/2021/10/872833.json": "During Coding I often forget exact properties and at that time searching on google take time at least...",
  "data/redirect-devtop/2021/10/871804.json": "console.log is useful in a lot of situations (although there are usually better ways to debug if...",
  "data/redirect-devtop/2021/10/873291.json": "Google is one of the most powerful tools, and believe it or not, Googling is one of the most...",
  "data/redirect-devtop/2021/10/873554.json": "Full article is available on Aviyel  If you are a front end developer, chances are; you already had...",
  "data/redirect-devtop/2021/10/871966.json": "Cover Photo by Ugur Akdemir on Unsplash  I have made it! This is my final project for the Flatiron...",
  "data/redirect-devtop/2021/10/871776.json": "We’re only a couple of months away from the new year, which means it’s time to start looking ahead to...",
  "data/redirect-devtop/2021/10/872131.json": "This article contains a list of useful GitHub repositories to help full-stack web developers to...",
  "data/redirect-devtop/2021/10/873542.json": "In this post you will learn about a very beautiful CSS framework, halfmoon css that you will rarely...",
  "data/redirect-devtop/2021/10/873916.json": "Hello everyone! 💙  In this article, I will write about websites that will help you improve your...",
  "data/redirect-devtop/2021/10/873290.json": "In this article we are going to look at some awesome resource for you that can improve your...",
  "data/redirect-devtop/2021/10/873639.json": "Benchmarking your code is a very important step to maintaining good code. It does not particularly...",
  "data/redirect-devtop/2021/10/872489.json": "Let's Begin   In this blog, you are going to learn how to create a screen recorder that does...",
  "data/redirect-devtop/2021/10/873767.json": "What is WebGL?  WebGL is a cross-platform, royalty-free API used to create 3D graphics in a Web...",
  "data/redirect-devtop/2021/10/874040.json": "In enterprise-level applications, working on an application from a single code base turns out to be a...",
  "data/redirect-devtop/2021/10/873383.json": "Hello there 👋🏼, internet users. Today, I'll show you a CSS trick I frequently forget about when...",
  "data/redirect-devtop/2021/10/873540.json": "Hey Coders!!  A lot of you have been telling me that rust is soon going to replace java.  Looking at...",
  "data/redirect-devtop/2021/10/872837.json": "This tutorial will show you how to create protected routes in React. We will utilize the react context api and create a custom hook for our protected routes. We also discuss some common problems and different implementations to address them",
  "data/redirect-devtop/2021/10/873793.json": "Did you know that chrome dev tools has a css overview panel to identify flaws inside your css?       ...",
  "data/redirect-devtop/2021/10/873384.json": "In today's tutorial we will create a digital clock that will show us the current time and it will...",
  "data/redirect-devtop/2021/10/874184.json": "This article was first published on CodeNewbie on Oct 3, 2021.      Nowadays, junior developers are...",
  "data/redirect-devtop/2021/10/874194.json": "Tailwind CSS has taken the frontend development world by storm over the last few years. A...",
  "data/redirect-devtop/2021/10/873017.json": "Contents    What is Appwrite? Amazing Features Why Appwrite is better? Installation Hands...",
  "data/redirect-devtop/2021/10/874389.json": "I just made a really simple version of Red Light Green Light game from Squid Game with JavaScript and...",
  "data/redirect-devtop/2021/10/874073.json": "Originally published @ CatStache.io  Have you ever wondered what a Higher Order Function (HOF) is,...",
  "data/redirect-devtop/2021/10/874640.json": "Writing Bash scripts can be challenging if you don't know the quirks and perks. In my mother tongue,...",
  "data/redirect-devtop/2021/10/873559.json": "Before I dive into some of the cool things you can do with React, lets understand what is React....",
  "data/redirect-devtop/2021/10/874762.json": "There are a lot of headlines about Tesla that overstate a story for clicks, and I can assure you this...",
  "data/redirect-devtop/2021/10/873300.json": "In this article you will learn how to create Coin Toss Game using JavaScript. JavaScript Coin Flip...",
  "data/redirect-devtop/2021/10/873160.json": "This article has an oxymoron title.  I want to tell two stories. One which makes a case for don't...",
  "data/redirect-devtop/2021/10/870447.json": "The primary goal of any software project is to earn money through the automation of the business...",
  "data/redirect-devtop/2021/10/873319.json": "Beginner to beginner Introduction to Svelte   The goal for this tutorial is to share my...",
  "data/redirect-devtop/2021/10/873135.json": "If you working with Node.js you probably interact with the database (MongoDB, PostgreSQL, and etc)...",
  "data/redirect-devtop/2021/10/872239.json": "stop writing legacy code",
  "data/redirect-devtop/2021/10/872249.json": "Hello my wonderful friend, welcome to this tutorial! Today, I'll be explaining CSS Box Shadow and I...",
  "data/redirect-devtop/2021/10/873799.json": "What is shell scripting? 😕     Shell scripting is the code that is designed to run in the...",
  "data/redirect-devtop/2021/10/872379.json": "In this article, we are going to look at some weird and strange concepts of Javascript, Some of which...",
  "data/redirect-devtop/2021/10/855195.json": "Introduction   Documenting our code is of course not the easiest part of the development...",
  "data/redirect-devtop/2021/10/875497.json": "👉 C# is a dead programming language 👉 C# is useless 👉 C# is a poor programming language  You’ve...",
  "data/redirect-devtop/2021/10/869888.json": "Welcome to the release notes for Yarn 3.1! We're quite excited by this release, as it brings various...",
  "data/redirect-devtop/2021/10/873599.json": "CSS positioning has been the beast that many developers seem reluctant to conquer. It can be...",
  "data/redirect-devtop/2021/10/874622.json": "There's always a need to have all the content of a webpage ready before it is displayed to whoever is...",
  "data/redirect-devtop/2021/10/876115.json": "Dev tools that are not commonly recommended in online tutorials or articles and lesser-known to code newbies",
  "data/redirect-devtop/2021/10/870820.json": "What is an API?   An API or application Programming Interface is a set of functions that...",
  "data/redirect-devtop/2021/10/874464.json": "In this tutorial, we'll learn how to build an authentication system for a Nodejs &amp; Express...",
  "data/redirect-devtop/2021/10/874930.json": "Have you ever thought of what a user would do with your application?  No matter how...",
  "data/redirect-devtop/2021/10/875470.json": "A curated list with Material Dashboard starters crafted on top of Bootstrap 5 framework - all products are available on Github under permissive licenses.",
  "data/redirect-devtop/2021/10/874079.json": "Some while ago, I saw a meme video of \"a day in the life of a software engineer\" where the engineer...",
  "data/redirect-devtop/2021/10/875168.json": "One of the things I love about GraphQL is how straightforward it is to get up and running with little...",
  "data/redirect-devtop/2021/10/874767.json": "Hello all! I am excited to announce that I have published my first NPM package. It's not super fancy...",
  "data/redirect-devtop/2021/10/875511.json": "I remember the time when I was starting my Frontend journey.  CSS caused a lot of headaches. Like...",
  "data/redirect-devtop/2021/10/875246.json": "Most popular articles published on the dev.to",
  "data/redirect-devtop/2021/10/877465.json": "Happy Hacktober! There are only a few days left of Hacktober, but it's not too late to contribute....",
  "data/redirect-devtop/2021/10/875519.json": "Translating an App to multiple languages (localization) is tricky part of many applications. Tolgee...",
  "data/redirect-devtop/2021/10/874922.json": "Introduction   Hello, breathtaking DEV people! 👋  All last week I was refactoring my Go...",
  "data/redirect-devtop/2021/10/877483.json": "☝️☝️☝️ That's what happens when visitors run into cumulative layout shift.   Cumulative...",
  "data/redirect-devtop/2021/10/876665.json": "In this tutorial we will create a fully working calculator using only HTML, CSS and vanilla...",
  "data/redirect-devtop/2021/10/876605.json": "Hey there! 👋  I was doing a bit of bug-hunting in an old project of mine when I found an interesting...",
  "data/redirect-devtop/2021/10/876432.json": "Recently, we have surveyed 200+ Software Engineers from different industries to learn how codebase...",
  "data/redirect-devtop/2021/10/876673.json": "What is this about? 🥱   In my opinion, the point of writing a blog is to document your...",
  "data/redirect-devtop/2021/10/877165.json": "If you want to scale your website then it'd be a really good idea to add multiple language support in...",
  "data/redirect-devtop/2021/10/874233.json": "Hello, Readers welcome to my new blog and today I am going to tell you how to Make a Calculator. This...",
  "data/redirect-devtop/2021/10/865680.json": "Classes were introduced in ECMAScript 6, and we can use them to structure our code in a traditional...",
  "data/redirect-devtop/2021/10/877866.json": "1) Create a react application(with a name of your choice):   create-react-app tailwind-react   2)...",
  "data/redirect-devtop/2021/10/876595.json": "Have you ever programmed an Arduino? Did you know that Arduino can be programmed with...",
  "data/redirect-devtop/2021/10/874111.json": "Introduction   In this article, We will take a look at the most used javascript methods for...",
  "data/redirect-devtop/2021/10/876277.json": "The adrenaline rush that we get from the idea of sticking to coding every day for 100 days is...",
  "data/redirect-devtop/2021/10/875518.json": "I've taken notes over the years with everything from plain text files to heavy apps like OneNote but for me this just blows everything else away.",
  "data/redirect-devtop/2021/10/875816.json": "The Why   Lots of developers use Linux, but \"Linux\" is a vast category.  There are a lot of...",
  "data/redirect-devtop/2021/10/877231.json": "As a developer, your lack of GitHub contributions does not necessarily indicate that you aren't good...",
  "data/redirect-devtop/2021/10/876122.json": "Do you want to be able to have the control of your code and have a trustworthy and easy to make...",
  "data/redirect-devtop/2021/10/878233.json": "Tailwind CSS is a framework that I've been using quite a lot lately and there's one particular...",
  "data/redirect-devtop/2021/10/877142.json": "Open-source full-stack product crafted on top of Purity Dashboard, a modern design from Creative-Tim using React and Node JS as the backend framework.",
  "data/redirect-devtop/2021/10/878199.json": "We spend so much time in our text editors, and every now and again we encounter those little...",
  "data/redirect-devtop/2021/10/878204.json": "Looking into the AWS ecosystem of serverless services, AWS Step Functions is one of my personal most...",
  "data/redirect-devtop/2021/10/876367.json": "There might be times when you wish to access your API or React project using a public URL but do not...",
  "data/redirect-devtop/2021/10/878333.json": "💡 Introduction to Docker   This is an open-source introduction to Docker guide that will...",
  "data/redirect-devtop/2021/10/878935.json": "These are some of the questions I received after my presentation \"Micro-Frontends Performance and...",
  "data/redirect-devtop/2021/10/876693.json": "In software development, utilities are software tools that add functionality to your code or improve...",
  "data/redirect-devtop/2021/10/877204.json": "Welcome to the second part of the series where I will give my best to explain everything I know when...",
  "data/redirect-devtop/2021/10/877455.json": "When doing a screening call with a recruiter ALWAYS have these 16 down:  1 - have shared your updated...",
  "data/redirect-devtop/2021/10/877871.json": "When I jump Operating System from Windows to Linux, I don't have ideas to using it smoothly. After 4...",
  "data/redirect-devtop/2021/10/876325.json": "by author Fernando Doglio  This is not the first time something like this happens, but I wouldn't...",
  "data/redirect-devtop/2021/10/877193.json": "Ah, the dreaded resolve conflicts popup. You've finished crafting the perfect code, just a quick...",
  "data/redirect-devtop/2021/10/877941.json": "Looking into the AWS ecosystem of serverless services, AWS Step Functions is one of my personal most...",
  "data/redirect-devtop/2021/10/876714.json": "CSS variables offers us a very neat way to share information between CSS and JavaScript. The perk of...",
  "data/redirect-devtop/2021/10/879199.json": "Listen to S6E1 of the DevNews pod wherever you get your podcasts.",
  "data/redirect-devtop/2021/10/877714.json": "Why make this at all?      I don't enjoy bashing other people's hard work. This isn't meant...",
  "data/redirect-devtop/2021/10/879460.json": "Over the last few weeks, we had a lot of discussions on asynchronous JavaScript and patterns we use...",
  "data/redirect-devtop/2021/10/880656.json": "Bonus content: Detailed simulation of cluster costs with CAST AI vs. GKE Autopilot  Running...",
  "data/redirect-devtop/2021/10/879806.json": "If you are looking to become familiar with the GraphQL Ecosystem and tooling, the learning resources at Hasura will get you started on the journey to become a GraphQL Expert.",
  "data/redirect-devtop/2021/10/877463.json": "I've used LinkedIn to find my last three developer jobs, and that was also my first three developer...",
  "data/redirect-devtop/2021/10/879392.json": "Hi guys !.  In this post we will learn how to use the useNavigate hook in React JS. useNavigate is...",
  "data/redirect-devtop/2021/10/880096.json": "Discord bots help you interact with members of a server as well as moderate the server. A discord bot...",
  "data/redirect-devtop/2021/10/880292.json": "GitHub Universe has been our flagship event for announcing and launching new products. Since last...",
  "data/redirect-devtop/2021/10/871774.json": "What's this Context in ReactJS everyone's talking about! So according to the React Documentation \"...",
  "data/redirect-devtop/2021/10/879182.json": "In recent years, cryptocurrencies and blockchains are two uprising fields, so today, I will share my...",
  "data/redirect-devtop/2021/10/878587.json": "Hello everyone! 🧡   Before we start Let’s connect on Twitter and also follow me here for...",
  "data/redirect-devtop/2021/10/878582.json": "Amazon Web Services (AWS) is the most comprehensive and widely used cloud platform in the world, with...",
  "data/redirect-devtop/2021/10/873802.json": "In this article we are going to look at Web Share API. With the Web Share API, web apps are able to...",
  "data/redirect-devtop/2021/10/877882.json": "Today at Next.js conf, Vercel the company behind next.js announced the public availability of next.js...",
  "data/redirect-devtop/2021/10/880485.json": "In this blog tutorial, we are going to set up and build music player applications using react.js from...",
  "data/redirect-devtop/2021/10/872365.json": "So you've spent the last few months navigating the treacherous interview seas and have eventually...",
  "data/redirect-devtop/2021/10/879476.json": "Sometimes your list may have a sublist inside it which again may have another sublist in it.  In that...",
  "data/redirect-devtop/2021/10/878593.json": "Code documentation seems to be a cumbersome process for most developers. However, with the right set...",
  "data/redirect-devtop/2021/10/880078.json": "In recent years, we've been exploring a lot of trendy stacks and frameworks. They all brought...",
  "data/redirect-devtop/2021/10/879722.json": "Hi Community! Looking forward to hear your thoughts about this.  Notifire was started out of pain me...",
  "data/redirect-devtop/2021/10/878536.json": "What is Conditional Rendering?   Many websites want users to create an account that requires...",
  "data/redirect-devtop/2021/10/879461.json": "Take any popular web project and there is a good chance it has been built with Node.js. This...",
  "data/redirect-devtop/2021/10/877459.json": "Add video calling, screen sharing, and custom chat to your Vue app with daily-js",
  "data/redirect-devtop/2021/10/880278.json": "TLDR   Having a process, even a simple one, for creating, reviewing, and merging PRs (pull...",
  "data/redirect-devtop/2021/10/878657.json": "Why should you use Typescript?   Simple. It solves your problem. Let's see.   Type checking:...",
  "data/redirect-devtop/2021/10/878173.json": "The 1.4.0 release of the Edge Developer Tools extension for Visual Studio code comes with a lot of highly requested features",
  "data/redirect-devtop/2021/10/880274.json": "Some are calling Next.js 12 the \"biggest step forward yet.\"   Especially Rust fans.    Next.js 12's...",
  "data/redirect-devtop/2021/10/879434.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/10/881713.json": "With screens available in any size you can imagine, it's time to shift our approach towards responsive design – the era of breakpoints is over and the era of fluid design is here. Modern CSS has fantastic support for responsive design that ensures you won't ever have to write a media query again (if you don't want to).",
  "data/redirect-devtop/2021/10/878941.json": "SOLID design principles are five software design principles that enable you to write effective...",
  "data/redirect-devtop/2021/10/882091.json": "API is the acronym for Application Programming Interface, which is a software intermediary that...",
  "data/redirect-devtop/2021/10/881112.json": "Responsive personal portfolio website with html css js  In this video series,  I will show you...",
  "data/redirect-devtop/2021/10/878287.json": "In this post, you'll learn 10 Sourcegraph search tricks to help identify projects and issues where your contribution can really make a difference in these last days of Hacktoberfest.",
  "data/redirect-devtop/2021/10/880479.json": "As we know multiple components share the common data and always need updated shared data. In such...",
  "data/redirect-devtop/2021/10/880662.json": "Project setup, develop category and product APIs            Motivation   In my opinion, the...",
  "data/redirect-devtop/2021/10/881861.json": "Hey👨‍💻, welcome back.  In this blog we gonna build a beautiful animation project using only HTML...",
  "data/redirect-devtop/2021/10/881922.json": "Here is a series of articles that will allow you to create backend applications with NodeJS +...",
  "data/redirect-devtop/2021/10/881121.json": "Yes, you read that right, I now own 👩‍💻👨‍💻.to.   Now for a split second you may have thought I meant...",
  "data/redirect-devtop/2021/10/879518.json": "High-quality code is critical to creating functional error and bug-free software that is easy to edit...",
  "data/redirect-devtop/2021/10/880521.json": "Hi there👋, welcome to this tutorial! Today, I will be showing some of Firebase cool features.  Keep...",
  "data/redirect-devtop/2021/10/873172.json": "Hi Guys Good Day!   Today, we will make a Rest API using these two technologies. You may...",
  "data/redirect-devtop/2021/10/882105.json": "I am as a beginner faced a lot of difficulty in understanding the Position property in CSS. Today in...",
  "data/redirect-devtop/2021/10/880820.json": "As a beginner it's always hard to start and follow a new passion. You don't know where to start, what...",
  "data/redirect-devtop/2021/10/882564.json": "The best way to learn a new programming language is to build projects.  I have created a list of 40...",
  "data/redirect-devtop/2021/10/880874.json": "It is very important to be able to design a website whose contents looks good on all screen sizes    ...",
  "data/redirect-devtop/2021/10/882288.json": "There can be various python programs on many topics like basic python programming, conditions and...",
  "data/redirect-devtop/2021/10/875458.json": "Within trunk-based or agile development, minimizing the number of noisy commits to keep any possible...",
  "data/redirect-devtop/2021/10/882757.json": "Muuwwwaaahhhhhhahaha it's Spooky time. So here is a fun post full of Ghoulish code (that will make...",
  "data/redirect-devtop/2021/10/879491.json": "Hey fellow creators,  It's time to build an awesome responsive navbar with React!  If you prefer to...",
  "data/redirect-devtop/2021/10/882581.json": "Use React has been three years, in these three years inside also deposited a lot of best practices on...",
  "data/redirect-devtop/2021/10/882439.json": "tl;dr I completed a personal project that I would like to share: project repository  Hello all,  I...",
  "data/redirect-devtop/2021/10/881869.json": "Overview   Even though we are at the end of 2021 and taking all that care to ensure that the...",
  "data/redirect-devtop/2021/10/879716.json": "In Javascript, Promise.all lets you execute a bunch of Promises in parallel and get an array of...",
  "data/redirect-devtop/2021/10/878653.json": "Tt is easy to use functional components with react hooks API. In this tutorial, we are going to use...",
  "data/redirect-devtop/2021/10/874025.json": "I remember one of my interview few years ago. I was asked:    Given an object and how can we track...",
  "data/redirect-devtop/2021/10/882317.json": "Hola! In this busy world Having a calendar is often a handy feature to have.      There many calendar...",
  "data/redirect-devtop/2021/10/883028.json": "The best way to learn a new programming language is to build projects.  I have created a list of 40...",
  "data/redirect-devtop/2021/10/881722.json": "The cron command-line utility, also known as cron job, is a job scheduler on a Unix-like operating...",
  "data/redirect-devtop/2021/10/882651.json": "Being a programmer requires much more than the simple act of sitting at a computer looking for...",
  "data/redirect-devtop/2021/10/883066.json": "If you have decided to build your career in NodeJS development, we have gathered a list of nodeJS...",
  "data/redirect-devtop/2021/10/882777.json": "After my first CSS drawing here I am with more CSS art. This time I spent 31 days with the CSS master...",
  "data/redirect-devtop/2021/10/882076.json": "Open-source Django Website Template crafted on top of Material Kit Design, a modern Bootstrap 5 Design. ",
  "data/redirect-devtop/2021/10/882334.json": "Working with forms is an every day task for almost every web developer. No matter what site you'll...",
  "data/redirect-devtop/2021/10/882555.json": "Sometimes while debugging you may use console.log or maybe console.warn too. But there are a lot more...",
  "data/redirect-devtop/2021/10/882084.json": "Preact - Performance Optimization by default  A few months ago, I wrote an article based on...",
  "data/redirect-devtop/2021/10/882792.json": "Hello everyone Let's take a brief look at the basics of SQL. Let's find out what SQL is, what...",
  "data/redirect-devtop/2021/10/882820.json": "Happy Halloween, everyone!  I think the question fits the theme, so I'd like to ask everyone:   What...",
  "data/redirect-devtop/2021/10/881737.json": "Hello everyone 👋, Today I will be teaching you how to generate a verification code using JavaScript...",
  "data/redirect-devtop/2021/10/882768.json": "In this article, I am gonna tell you about how you can run the Heroku server free for a lifetime. So...",
  "data/redirect-devtop/2021/10/882097.json": "Another week, another custom React hook for your hooks backpack. In this episode, we'll implement the...",
  "data/redirect-devtop/2021/10/881774.json": "Backstory / Problem   Few months ago, there is a certain case where I need to calculate the...",
  "data/redirect-devtop/2021/10/883267.json": "javaScript is a programming language that conforms to the ECMAScript specification. JavaScript is...",
  "data/redirect-devtop/2021/10/881585.json": "The Problem   Well, it is no news for us that developing software is expensive, and takes A...",
  "data/redirect-devtop/2021/10/883355.json": "As a front-end developer, having a bank of UI illustrations can be a huge asset. The right stock can...",
  "data/redirect-devtop/2021/10/877458.json": "Using my portfolio as an interview hook   After spending months studying front end...",
  "data/redirect-devtop/2021/10/882825.json": "Here is a series of articles that will allow you to create backend applications with NodeJS +...",
  "data/redirect-devtop/2021/10/882801.json": "Wassup guys, in this tutorial we are going to see how to build a custom video player in React. Let's...",
  "data/redirect-devtop/2021/10/863243.json": "The website design industry is expected to generate over $40 billion in the US alone this year.  And...",
  "data/redirect-devtop/2021/10/882126.json": "Are you someone who can't help checking the latest stock prices every 5 minutes? Thanks to Python,...",
  "data/redirect-devtop/2021/10/882394.json": "Synopsis   My name is Kirk. I like making small games with code. And today's game is...",
  "data/redirect-devtop/2021/10/865015.json": "When I made my portfolio site, I put a lot of effort into following the accessibility standards I...",
  "data/redirect-devtop/2021/10/879496.json": "In this article, I am going to tell you about how I made Google fully functional Clone with next.js...",
  "data/redirect-devtop/2021/10/882975.json": "One of the biggest and most important building blocks of modern technology, hands-down, is AI....",
  "data/redirect-devtop/2021/10/878176.json": "A Complete guide to become a certified Java developer with resources to pass Java SE 8 and Java SE 11 certification like books, courses, and mock tests ",
  "data/redirect-devtop/2021/10/848716.json": "No, seriously, don't. We'll be hacking our way through. This will involve a lot of dirty hacks and...",
  "data/redirect-devtop/2021/10/875826.json": "If you are a beginner in web development then you must learn the JavaScript. It powers the...",
  "data/redirect-devtop/2021/10/858713.json": "For a while now I've been creating these 3D scenes with CSS for fun. Usually on my live stream.      ...",
  "data/redirect-devtop/2021/10/877188.json": "Today we are going to talk about React context. Its role is sometimes mistaken, badly said as a...",
  "data/redirect-devtop/2021/10/879517.json": "This dark mode web3 aesthetic looks very cool and futuristic. They all have some common designs that...",
  "data/redirect-devtop/2021/10/873382.json": "The year 2021 is about to end so let us recall and recollect what different tools have been used by...",
  "data/redirect-devtop/2021/10/863625.json": "Is your team as productive as can be? We tend to be most productive while using tools we know and...",
  "data/redirect-devtop/2021/10/863855.json": "Frontend Mentor is a community to help developers improve their front-end coding skills by building projects. We're now turning our attention to helping connect great companies with our incredible community.",
  "data/redirect-devtop/2021/10/877456.json": "What is the difference between controlled and uncontrolled components in react?   To put...",
  "data/redirect-devtop/2021/10/872473.json": "Although legacy storage players are tired of talking about cloud’s impact on their business, the...",
  "data/redirect-devtop/2021/10/874032.json": "The popularity of Node.js is growing at a rapid pace, with more and more unicorn companies adapting...",
  "data/redirect-devtop/2021/10/874038.json": "In this article, we are going to investigate why React.js, a library that keeps your code away from...",
  "data/redirect-devtop/2021/10/874028.json": "In the Previous Blog we understood the Memory management in Node.js, how Garbage Collector (GC) works...",
  "data/redirect-devtop/2021/10/864842.json": "Set up Neovim for Full Stack Development   You'll need:   Coc  emmet            If you're...",
  "data/redirect-devtop/2021/10/880935.json": "Hello world This is Rohit an another coding introvert, Who is struggling to find some webdev project...",
  "data/redirect-devtop/2021/10/869451.json": "Background &amp; Context   Quick Response (QR) codes are a powerful tool. A QR code is a...",
  "data/redirect-devtop/2021/10/880849.json": "Leveraging Cache in Nuxt.js   I first got into the topic of Cache when I was implementing a...",
  "data/redirect-devtop/2021/10/881479.json": "When most people think of web3 development, the chain that immediately comes to mind is Ethereum. But...",
  "data/redirect-devtop/2021/10/867091.json": "Pokemon was first created in 1996. In the twenty years, it has become one of the most recognizable..."
}