{
  "data/redirect-devtop/2021/1/563096.json": "Table of Contents --    FlexBox Architecture flex-direction justify-content align-content al...",
  "data/redirect-devtop/2021/1/578030.json": "Need some inspiration for a new project? In this article I'll go over what I think are 7 of the coole...",
  "data/redirect-devtop/2021/1/568356.json": "Nginx is a web server that is used as a reverse proxy, load balancer, mail proxy, and HTTP cache and...",
  "data/redirect-devtop/2021/1/573028.json": "I think the folks building Tailwind are talented and nice people. But at a pure technical level, I simply don't like Tailwind. Whoever it was built for, it was not built for me.",
  "data/redirect-devtop/2021/1/560040.json": "Hey everyone,  I am Hrishikesh, co-founder of Flexiple, an exclusive freelance network for developers...",
  "data/redirect-devtop/2021/1/572904.json": "You might be using Javascript development for a long time but sometimes you might not be updated with...",
  "data/redirect-devtop/2021/1/574774.json": "Projects are the identity of every web developer. Every web developer must build some projects which...",
  "data/redirect-devtop/2021/1/559223.json": "Hey there! 👋🏼  I'm Mateo Garcia, I co-organize a community in Medellin, Colombia called React Medelli...",
  "data/redirect-devtop/2021/1/577700.json": "If you're in the slightest interested in video games, you're no doubt aware of Cyberpunk 2077. It's o...",
  "data/redirect-devtop/2021/1/587568.json": "In January 2021, I made a sudden and somewhat unexpected transition to freelance web development.  I...",
  "data/redirect-devtop/2021/1/558959.json": "To create a video chatting and screen sharing application requires three major setup    Basi...",
  "data/redirect-devtop/2021/1/561554.json": "Today I prepared a huge list of React Interview Questions from this awesome repo  For more info, I ha...",
  "data/redirect-devtop/2021/1/559753.json": "There's a lot of buzz going around the web dev world regarding Nocode, but a ton of these do the same...",
  "data/redirect-devtop/2021/1/560552.json": "This article was originally published on The Smart Coder  Learning to code and becoming a web develop...",
  "data/redirect-devtop/2021/1/581243.json": "A comprehensive list of useful commands for the Linux Terminal.",
  "data/redirect-devtop/2021/1/569429.json": "Cheat Sheets our something developers need always for reference. So here I have compiled many JavaScr...",
  "data/redirect-devtop/2021/1/566712.json": "I have put together a comprehensive visual cheatsheet to help you master all the major concepts and f...",
  "data/redirect-devtop/2021/1/561688.json": "Hi Dev Community!  2020 has been a year of learning for me and I'm positive that this has been the ca...",
  "data/redirect-devtop/2021/1/582141.json": "Hello guys , in this blog post I have organized 40 Python projects that you might be interested tryin..."
}