{
  "data/redirect-devtop/2022/2/974748.json": "One of my favourite front-end development stacks when it comes to building websites is Tailwind CSS...",
  "data/redirect-devtop/2022/2/974838.json": "A while ago I created an article where I covered useful HTML tags and their types. This week I...",
  "data/redirect-devtop/2022/2/974721.json": "Fala galera linda do meu coração. Aqui é o pokemão novamente e estamos de volta aqui com mais um...",
  "data/redirect-devtop/2022/2/974765.json": "🤔 What is TwNFT?   TwNFT is a simple web application that allows you to mint your tweets...",
  "data/redirect-devtop/2022/2/974574.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/2/974774.json": "Introduction   There are several ways to handle data in a microservice architecture, in this...",
  "data/redirect-devtop/2022/2/975387.json": "Open-source API server that might help beginners to understand better the API concept ",
  "data/redirect-devtop/2022/2/975798.json": "Open-Source React Native starter crafted and released for free by Creative-Tim on top of Soft UI Design pattern.",
  "data/redirect-devtop/2022/2/976079.json": "If you ask yourself:   How to test &amp; deploy new features in your app without sending ap App Store...",
  "data/redirect-devtop/2022/2/975362.json": "Hey Coders, Code readability and re-usability are the fundamentals for development. It is key to...",
  "data/redirect-devtop/2022/2/976632.json": "Open-Source Dashboard Template crafted on top of React and Chakra UI (MIT License)",
  "data/redirect-devtop/2022/2/975107.json": "Have you heard about HttpContext in Angular? If not, there is such a thing. HttpContext is used to...",
  "data/redirect-devtop/2022/2/976335.json": "When networking, there are a few things you can do to ensure success and reduce stress.",
  "data/redirect-devtop/2022/2/976336.json": "When I get an idea I start at once building it up in my imagination. I change the construction, make...",
  "data/redirect-devtop/2022/2/976181.json": "TLDR            What they are    JWTs - JSON Web Tokens pronounced as “JOT”. User input so...",
  "data/redirect-devtop/2022/2/976789.json": "So you've heard of this functional programming thing (from now on referred to as FP). Some say it...",
  "data/redirect-devtop/2022/2/978437.json": "2022 started with a bang, that’s for sure.   This series explores the most interesting cloud...",
  "data/redirect-devtop/2022/2/976822.json": "Yesss!!!...   Despite the Easy level of difficulty, I’m super proud to have finally contributed. I’ve...",
  "data/redirect-devtop/2022/2/977580.json": "Announcing my 28 Days of GitHub   For the next 28 days, I will be taking a deep dive...",
  "data/redirect-devtop/2022/2/977581.json": "My Plan To Automate Collaborator Invitations on GitHub   In addition to working as a...",
  "data/redirect-devtop/2022/2/974987.json": "Now that 2021 is over, it is time to set new goals. I know I'm a bit late to the party, since it's...",
  "data/redirect-devtop/2022/2/977617.json": "As senior engineer I've interviewed a lot of engineers as candidates to join my team. In general...",
  "data/redirect-devtop/2022/2/978029.json": "A simple way to showcase your data using Flask ",
  "data/redirect-devtop/2022/2/978513.json": "React is a JavaScript library, and it is the most popular and industry-leading frontend development...",
  "data/redirect-devtop/2022/2/978484.json": "I am Divya Sri Darimisetti, a student currently pursuing my BTech in Electrical Engineering from the...",
  "data/redirect-devtop/2022/2/978487.json": "Building a concurrent web server in Rust, Go, JS, TS, Kotlin, and Java to compare concurrency performance",
  "data/redirect-devtop/2022/2/976810.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/2/979016.json": "Every year I set myself new unattainable goals for the new year! I never achieved the goals! Year by...",
  "data/redirect-devtop/2022/2/977023.json": "Intro   Have you ever heard this quote? 👇   If you want to be the best, learn from the...",
  "data/redirect-devtop/2022/2/978939.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/2/979502.json": "A few weeks ago, I had to do a complex redirect of a request e.g if the request coming to nginx has a...",
  "data/redirect-devtop/2022/2/977630.json": "Introduction   Role Based Access Control (RBAC) is an access control pattern that governs...",
  "data/redirect-devtop/2022/2/979008.json": "Introduction   Node js is a popular backend nowadays! It's fast and easy to write code. If...",
  "data/redirect-devtop/2022/2/978996.json": "Being a Developer Advocate is by far the best job in the world, at least in my opinion and for me. It...",
  "data/redirect-devtop/2022/2/979680.json": "A simple eCommerce project built with Flask and Stripe. The source code can be downloaded from Github (MIT License).",
  "data/redirect-devtop/2022/2/978696.json": "The demand for web developers is growing as web development becomes more popular in the market. Web...",
  "data/redirect-devtop/2022/2/978802.json": "On the eve of February, I was inspired to tweet about web components. What started as a simple...",
  "data/redirect-devtop/2022/2/980082.json": "How to make personal blog website using html css javascript  In this video, I will show you how...",
  "data/redirect-devtop/2022/2/979665.json": "API is essential for the legitimate integrations, functionality, and performance of a software item....",
  "data/redirect-devtop/2022/2/980081.json": "I tried to see if I could get other people Mongo Database connection string by just searching for it...",
  "data/redirect-devtop/2022/2/979667.json": "Introduction   Hello Developers In this Article we would learn how do you Code and publish...",
  "data/redirect-devtop/2022/2/978707.json": "A post by SOBIN",
  "data/redirect-devtop/2022/2/980351.json": "JS gives an ability to add properties to the object after it was created.  It gives a lot of freedom...",
  "data/redirect-devtop/2022/2/980699.json": "Hello Folks 👋   What's up friends, this is SnowBit here. I am a young passionate and...",
  "data/redirect-devtop/2022/2/980858.json": "The project implements paginated access to data using Simple-DataTables, a lightweight, extendable, dependency-free javascript HTML table plugin",
  "data/redirect-devtop/2022/2/980212.json": "The Dev.to platform is built on Forem, which means it has all sorts of great API endpoints available!...",
  "data/redirect-devtop/2022/2/980894.json": "Ever since I posted this tweet,  friends, acquaintances, and random strangers have reached out to me...",
  "data/redirect-devtop/2022/2/980716.json": "Hello World! Oh wait... Hello everyone!  I got bored today and did some intense research on the...",
  "data/redirect-devtop/2022/2/981018.json": "What are React hooks? They are functions in React that allow you to add react functionality to...",
  "data/redirect-devtop/2022/2/980995.json": "TLDR: It’s not about the technical side, it’s about people!     Monoliths can be as good as...",
  "data/redirect-devtop/2022/2/980508.json": "Hi there!  In this post, I'll talk about a boring topic. It's about learning new technology.  In...",
  "data/redirect-devtop/2022/2/980403.json": "You think about the manager path, and you see there is an opportunity, And you just can't put the dot on the decision. Let's explore it together.",
  "data/redirect-devtop/2022/2/980778.json": "Technical Writing has been the talk of the town lately. Technical Writers are in high demand, and you...",
  "data/redirect-devtop/2022/2/981301.json": "This post is part of my mentoring conversation series which includes relatively short posts on...",
  "data/redirect-devtop/2022/2/981721.json": "The project implements paginated access to data using Simple-DataTables, inline edit, toasts notifications and Docker Support.",
  "data/redirect-devtop/2022/2/981465.json": "It’s impossible to have a conversation on how to write performant React code without having an...",
  "data/redirect-devtop/2022/2/981716.json": "Going from 0 to 100K as a freelancer sounds very challenging. Something only the best can do in less...",
  "data/redirect-devtop/2022/2/981460.json": "If you are starting out as a developer, you might run into these conflicting schools of thought:...",
  "data/redirect-devtop/2022/2/982215.json": "Fala pessoal, tudo bom com vocês? Pokemão de volta aqui com mais um tema para iniciantes em...",
  "data/redirect-devtop/2022/2/981948.json": "I've been fascinated with personal websites since I was a kid. Making my first personal website back...",
  "data/redirect-devtop/2022/2/979152.json": "There are principles and there are practices. A principle is a universal truth that is applicable...",
  "data/redirect-devtop/2022/2/981757.json": "JavaScript is a multi-paradigm programming language, so it provides us with a lot of different ways...",
  "data/redirect-devtop/2022/2/982442.json": "Contrary to popular belief, web scraping is not a shady or illegal activity. That is not to say that...",
  "data/redirect-devtop/2022/2/980382.json": "Many performance-related issues in Node.js applications have to do with how promises are implemented....",
  "data/redirect-devtop/2022/2/982563.json": "A professionally looking portfolio and a well-written resume are both essential to succeed in the...",
  "data/redirect-devtop/2022/2/983241.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/2/983567.json": "The CSS Gradient online generator tool is a nice and simple to use utility to quickly generate linear...",
  "data/redirect-devtop/2022/2/983155.json": "Updating your Next.js sites to have a language set for screen readers is important for accessibility, and only takes a few lines of code!",
  "data/redirect-devtop/2022/2/983488.json": "Recently, I was reading one of my favorite author's articles on his website. I realized he has a...",
  "data/redirect-devtop/2022/2/983125.json": "JS is a prototype-based language, so there are only primitive types and objects. It grants...",
  "data/redirect-devtop/2022/2/983830.json": "Let's say you are hired to create a web app for a company that describes itself as \"Etsy for dogs\"...",
  "data/redirect-devtop/2022/2/983516.json": "Appwrite's Tasks Service was a great way to send HTTP requests to remote URLs at specific intervals...",
  "data/redirect-devtop/2022/2/983703.json": "In Next js, data fetching is a strategy. Next.js uses getStaticProps or getServerSideProps to enhance...",
  "data/redirect-devtop/2022/2/983791.json": "React Components are the fundamental building blocks of any React app. They allow us to simplify...",
  "data/redirect-devtop/2022/2/984020.json": "Introduction   Making projects during a hackathon is a terrific opportunity to brush up on...",
  "data/redirect-devtop/2022/2/981922.json": "Since its release in 1994, the Design Patterns book continues to be a seminal work in building...",
  "data/redirect-devtop/2022/2/982888.json": "Building a full stack web3 app with Next.js, Polygon, Solidity, The Graph, IPFS, and Hardhat",
  "data/redirect-devtop/2022/2/983139.json": "I am 31 years old and I didn't knew this. Everytime I wanted to scrape some data table from a website...",
  "data/redirect-devtop/2022/2/982554.json": "JavaScript Array Methods   JavaScript has a great range of functional methods with arrays,...",
  "data/redirect-devtop/2022/2/984666.json": "Introduction   I have been a JavaScript developer for many years and I did not really have...",
  "data/redirect-devtop/2022/2/982860.json": "This post describes how to choose the best components when building a PC in 2022.",
  "data/redirect-devtop/2022/2/983834.json": "A curated list with Django Extensions for modern web development: Django-HTMX, Django Ninja, Pandas, and Django-Celery for asynchronous task execution.",
  "data/redirect-devtop/2022/2/984395.json": "Photo by Andrea De Santis on Unsplash           TL;DR   Learn how to implement the dependabot to...",
  "data/redirect-devtop/2022/2/978672.json": "Adding authorization &amp; authentication to an app is a common task for developers.   When you're...",
  "data/redirect-devtop/2022/2/980906.json": "FWhen I started at my first programming job, I could spend most of my time in front of my laptop...",
  "data/redirect-devtop/2022/2/984929.json": "What, in your mind, make for an effective \"principal\" level engineer — that is, say, one level above...",
  "data/redirect-devtop/2022/2/983421.json": "In the previous article, we looked at using the React Infinite Query. However, we still had a button...",
  "data/redirect-devtop/2022/2/984044.json": "Express is probably one of the most influential packages in the Node.js world. It gave us an...",
  "data/redirect-devtop/2022/2/985189.json": "INTRODUCTION    Binary is one of the many counting system that are out there. It is a number...",
  "data/redirect-devtop/2022/2/986135.json": "For most developers and engineers, the working week is pretty hectic. You have a long list of tasks...",
  "data/redirect-devtop/2022/2/985676.json": "What makes Linux really popular among programmers? Well, the answer is that there are actually lots..."
}