{
  "data/redirect-devtop/2022/7/1129640.json": "These are the Top YouTube Downloaders for this Year In 2021, the following YouTube video graber tools...",
  "data/redirect-devtop/2022/7/1129377.json": "Bootstrap is an amazing CSS framework for those who struggle with design, css, or need to build...",
  "data/redirect-devtop/2022/7/1129536.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/7/1129344.json": "Anyone who has worked in JavaScript frameworks knows what an npm package is? And how important it is?...",
  "data/redirect-devtop/2022/7/1129479.json": "It always starts with something small, then you get excited and it grows to something big and later...",
  "data/redirect-devtop/2022/7/1129244.json": "As some of you loyal readers might know, I'm a big fan of optimizing the web.  As mentioned in the...",
  "data/redirect-devtop/2022/7/1129537.json": "Open-Source starter built on top of React and Firebase - Horizon UI comes with social login via Google.",
  "data/redirect-devtop/2022/7/1129304.json": "React is one of the trending and most popular client-side libraries for developing painless...",
  "data/redirect-devtop/2022/7/1129773.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/7/1129556.json": "So how is Svelte any different from other frameworks like Angular, React, vue and why should we care?...",
  "data/redirect-devtop/2022/7/1130210.json": "How to Make a Gaming Website Using Html CSS JavaScript  This video will show you how to make a...",
  "data/redirect-devtop/2022/7/1129384.json": "The time has come once again to evaluate a new Javascript framework…but wait. This isn’t your run of...",
  "data/redirect-devtop/2022/7/1130204.json": "Let's checkout some shorthand tips and other tricks. Remember, some of these might not seems relevant...",
  "data/redirect-devtop/2022/7/1130213.json": "Just over a year ago, I made a post on Twitter, and I realized that I had forgotten to add alternate...",
  "data/redirect-devtop/2022/7/1130046.json": "sometimes, i am finding data in mongoose collection it give mongoose document but when we use lean...",
  "data/redirect-devtop/2022/7/1129483.json": "Git commit messages are how we communicate to our future selves. They help you understand why a...",
  "data/redirect-devtop/2022/7/1129785.json": "Many of you here on DEV have come to know and love two of our original podcasts: DevDiscuss and...",
  "data/redirect-devtop/2022/7/1130300.json": "Learning to ask what you think are stupid questions is not easy. Asking \"stupid\" questions requires a...",
  "data/redirect-devtop/2022/7/1130580.json": "GitHub is the dominant player in hosting Software Projects on the web. With 200 M+ public...",
  "data/redirect-devtop/2022/7/1130584.json": "⚡ This post contaians all the living emoji's which you can use anywhere.   🤗 I have made it simple...",
  "data/redirect-devtop/2022/7/1130426.json": "What is Docker?   Docker is an open-source containerization platform used to build, test,...",
  "data/redirect-devtop/2022/7/1130439.json": "It was during the initial days when I was learning Javascript, I always used to be struck at a point...",
  "data/redirect-devtop/2022/7/1130710.json": "Saying the above out loud is almost like publicly admitting you've got lepra today, because all the...",
  "data/redirect-devtop/2022/7/1129543.json": "danielbellmas        /          danielbellmas                       ...",
  "data/redirect-devtop/2022/7/1130219.json": "Enums, short for Enumerations, are preset constants which can be defined by a developer for use...",
  "data/redirect-devtop/2022/7/1130573.json": "As the younger generation of developers are now graduates and looking for their full-time jobs, the...",
  "data/redirect-devtop/2022/7/1130564.json": "After commiting changes and editing for continuously four hours, I finally finished my GitHub Profile...",
  "data/redirect-devtop/2022/7/1130828.json": "How to create a reusable and generic TabBar components in React / TypeScript ",
  "data/redirect-devtop/2022/7/1130920.json": "I was reading a Tweet from my friend Amy on Twitter where they put out a Twitter poll that is...",
  "data/redirect-devtop/2022/7/1131365.json": "A few days back I went through an open-source project blog-cover which is designed to build cover...",
  "data/redirect-devtop/2022/7/1130905.json": "This week's VS Code Tip off the Week is the Thunder Client extension.   Thunder Client is a...",
  "data/redirect-devtop/2022/7/1129795.json": "Three days ago, Deno announced their new full stack web framework called Fresh. The framework looks...",
  "data/redirect-devtop/2022/7/1131540.json": "State is an essential part of our React application, hence, the need to pass to different components....",
  "data/redirect-devtop/2022/7/1130991.json": "One of the most frequent tasks we have to perform in Javascript is to remove a particular item from...",
  "data/redirect-devtop/2022/7/1131602.json": "In Yountville Napa Valley there's a restaurant called \"The French Laundry\". It's got a Michelin star,...",
  "data/redirect-devtop/2022/7/1132172.json": "You might need to determine if an object holds a particular property.  Let's say we have a user...",
  "data/redirect-devtop/2022/7/1132123.json": "Disclaimer - PLEASE READ THE WHOLE ARTICLE BEFORE YOU START FIRING PEOPLE!  As the CEO of a software...",
  "data/redirect-devtop/2022/7/1131971.json": "Are you starting a new project, learning a new technology, or building a new feature and you already...",
  "data/redirect-devtop/2022/7/1131986.json": "Preview   Hello everyone, I wanted to share with you a mini portfolio that I am starting to...",
  "data/redirect-devtop/2022/7/1132621.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/7/1131364.json": "When I rewrote my website in Astro, I decided to make it an open source project.  But let's dive into...",
  "data/redirect-devtop/2022/7/1132794.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/7/1131272.json": "I was surprised to see that, with my busy June schedule, a full month has passed since my last blog!...",
  "data/redirect-devtop/2022/7/1132797.json": "Introduction   Typescript is gaining more followers day-by-day. The type-safe cousin of...",
  "data/redirect-devtop/2022/7/1132222.json": "Estou lendo um livro muito legal do renomado Venkat Subramaniam : \"Functional Programming in Java:...",
  "data/redirect-devtop/2022/7/1133110.json": "In JavaScript, we work a lot with Objects, and you'll have to modify some of the object data from...",
  "data/redirect-devtop/2022/7/1133254.json": "Speed Code Video https://twitter.com/asyrafhussin4/status/1544623076863664128",
  "data/redirect-devtop/2022/7/1132336.json": "One of the main core values of Novu is transparency with our community, team members, partners, and...",
  "data/redirect-devtop/2022/7/1131508.json": "A while ago I migrated from VS Code to WebStorm, and it’s been great. Like all JetBrains IDEs, it...",
  "data/redirect-devtop/2022/7/1133850.json": "Introduction   “Who’s that Pokemon?” should bring memories for most people. If you don’t...",
  "data/redirect-devtop/2022/7/1134033.json": "I Am Using GitHub Under Protest   Github's decision to sponsor me is so recent that I...",
  "data/redirect-devtop/2022/7/1133579.json": "How to Build Todo App With Vanilla JavaScript  This video will show you how to build a todo app...",
  "data/redirect-devtop/2022/7/1133100.json": "Seguindo essa série sobre \"Programação Funcional com Java\", me deperei com uma dúvida, que talvez não...",
  "data/redirect-devtop/2022/7/1134209.json": "Did you know there is a native share function you can invoke with JavaScript?  You might have seen...",
  "data/redirect-devtop/2022/7/1131150.json": "You’re probably thinking, wait, did I read the title right? Build an event manager in Node.js and...",
  "data/redirect-devtop/2022/7/1134619.json": "What is a direction you took in your career that turned out to be the wrong direction, and you had to...",
  "data/redirect-devtop/2022/7/1134647.json": "If you could add one feature to DEV, what would it be?  Feel free to take an existing feature and...",
  "data/redirect-devtop/2022/7/1134440.json": "I hope this post will convince you to give TypeScript a try if you haven't already. It really is an...",
  "data/redirect-devtop/2022/7/1134192.json": "JavaScript is one of the most powerful language in this modern world. In this article we will go...",
  "data/redirect-devtop/2022/7/1132816.json": "Earlier this year, I took Community Management classes with C School and learned lots of great...",
  "data/redirect-devtop/2022/7/1134219.json": "Hopefully, by the end of this article, you will be able to understand the importance of...",
  "data/redirect-devtop/2022/7/1132842.json": "Why TikTok   If you're under the age of 25 you've probably been on TikTok for a couple...",
  "data/redirect-devtop/2022/7/1135390.json": "A Gartner survey of infrastructure and operations leaders revealed that 58% of them deal with...",
  "data/redirect-devtop/2022/7/1135347.json": "CQRS is an acronym, and it implies \"Command Query Responsibility Segregation\" - Which again just...",
  "data/redirect-devtop/2022/7/1135105.json": "1. Discard changes to local files in git   As a programmer, it happens every day that...",
  "data/redirect-devtop/2022/7/1134927.json": "A post by Helitha Rupasinghe",
  "data/redirect-devtop/2022/7/1134053.json": "Dark mode is one of the features that would look excellent implemented in your app, as it would...",
  "data/redirect-devtop/2022/7/1135696.json": "Got to all your meetings on time? Started a new project? Fixed a tricky bug?",
  "data/redirect-devtop/2022/7/1135019.json": "Today officially concludes the first week of my new job. I know it’s only Thursday, but I started...",
  "data/redirect-devtop/2022/7/1135741.json": "1. What is Refactoring?            1.1. Concept of refactoring   Code refactoring is the...",
  "data/redirect-devtop/2022/7/1133841.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/7/1135863.json": "When I receive a ticket for a new feature, I generally follow a few guidelines to make sure I have...",
  "data/redirect-devtop/2022/7/1136021.json": "Recently I had my first production use-case for the Proxy object. So let me tell you a bit more about...",
  "data/redirect-devtop/2022/7/1136035.json": "(1) Path Intellisense  This Extension autocompletes the file names. Like tags in HTML, it...",
  "data/redirect-devtop/2022/7/1136174.json": "Travel Website Using Html CSS JavaScript  In this video, I will show you how to Create Responsive...",
  "data/redirect-devtop/2022/7/1134406.json": "Bun - the new Javascript runtime has just announced its first beta release and makes the claimed that...",
  "data/redirect-devtop/2022/7/1136270.json": "Without wasting your time!   💡 1. Witboard   Witeboard is the fastest real-time online whiteboard for...",
  "data/redirect-devtop/2022/7/1129801.json": "Happy Friday, friends! 🎉 Follow Friday is your weekly opportunity to shout out fellow DEV Community...",
  "data/redirect-devtop/2022/7/1135957.json": "Open-source is not a new concept but in recent years specially it has gained more attention from both...",
  "data/redirect-devtop/2022/7/1136254.json": "I started blogging as a hobby, but over time, I realized owning a website is a great way to showcase...",
  "data/redirect-devtop/2022/7/1136511.json": "1. What is the React Virtual DOM?   Virtual DOM is a concept where a virtual representation...",
  "data/redirect-devtop/2022/7/1136553.json": "Let's say we have an object for our users. How can we detect when a property changes?    const user =...",
  "data/redirect-devtop/2022/7/1136490.json": "I've had folks ask me for Typescript resources a few times over the past couple of months, so I might...",
  "data/redirect-devtop/2022/7/1136033.json": "Whether you're an experienced developer or just starting, the constant influx of new technologies can...",
  "data/redirect-devtop/2022/7/1136145.json": "In Javascript, if a function has 4 parameters, and we only use 3, it's no big deal - Javascript just...",
  "data/redirect-devtop/2022/7/1136613.json": "React is still the best JavaScript framework to use for frontend web development in 2022, the...",
  "data/redirect-devtop/2022/7/1136742.json": "Trust me if you want, but here are the ten most famous celebrities who also has a career as...",
  "data/redirect-devtop/2022/7/1137410.json": "There’s a wave of layoffs and executive step-downs running through the industry, that’s for sure. As...",
  "data/redirect-devtop/2022/7/1137553.json": "No Meme Monday last week due to USA holiday — but we're back!  DEV is an inclusive space! Humor in...",
  "data/redirect-devtop/2022/7/1137308.json": "When I first heard the term \"DevRel\" I was not sure what it means exactly. Before I joined Vue...",
  "data/redirect-devtop/2022/7/1134049.json": "Code reviews can be painful. Software engineers often complain that the review process is slow,...",
  "data/redirect-devtop/2022/7/1135958.json": "Developing a ReactNative (RN) app for Android and iOS for the last 2 years I have more and more...",
  "data/redirect-devtop/2022/7/1137148.json": "If you go on and google search for JavaScript Proxy, you'll see many articles explaining the core...",
  "data/redirect-devtop/2022/7/1137333.json": "The main superpower of a programmer is her ability to automate almost everything. That's where GitHub...",
  "data/redirect-devtop/2022/7/1137602.json": "Introduction   Time to dispel some pesky programming myths. You may have heard - or even...",
  "data/redirect-devtop/2022/7/1136753.json": "Which one do you think is the best?",
  "data/redirect-devtop/2022/7/1137329.json": "KeePass was my first choice password manager, but as time went by, I noticed that it has some...",
  "data/redirect-devtop/2022/7/1137794.json": "The internet is a place with endless possibilities to make money. You just need to know where to look...",
  "data/redirect-devtop/2022/7/1138187.json": "There will come a time when you optimize your workflow to ensure PR requests are as small as...",
  "data/redirect-devtop/2022/7/1137833.json": "It’s been a while so I thought I would share a quick guide for my favorite form library, the mighty...",
  "data/redirect-devtop/2022/7/1138523.json": "How do you manage the mental complexity, file organization, context-switching, etc. when you are...",
  "data/redirect-devtop/2022/7/1137515.json": "We are happy to announce that GitLive's flagship feature, early merge conflict detection, now works...",
  "data/redirect-devtop/2022/7/1134920.json": "Sometimes there are problems that have no universally good solutions. There is some tradeoff to be...",
  "data/redirect-devtop/2022/7/1138221.json": "Speed Code Video                                                                                 ...",
  "data/redirect-devtop/2022/7/1138732.json": "In the first half of 2022 from mid-February to mid-May, I had some spare time on my hands, so I...",
  "data/redirect-devtop/2022/7/1138779.json": "Light theme? Dark theme? What fonts?  Let's hear it. Comment below.",
  "data/redirect-devtop/2022/7/1135394.json": "Since the official release of .NET 6, the rumors about .NET 7 and the new features it would bring...",
  "data/redirect-devtop/2022/7/1138753.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/7/1138764.json": "The community is one of the reasons why Visual Studio Code is the most popular code editor. Any...",
  "data/redirect-devtop/2022/7/1137760.json": "Senior developers tend to pick up many tricks and workarounds over the years, but most of them never...",
  "data/redirect-devtop/2022/7/1137062.json": "Hi everyone 👋,  I have been working on my personal portfolio for two days now. I designed it using...",
  "data/redirect-devtop/2022/7/1139774.json": "Cassidy learned a lot about moose and needs to tell people, namely you, about them",
  "data/redirect-devtop/2022/7/1139400.json": "Using Emoji cloud you can to add 300+ custom vector emojis to your projects in seconds           🌐...",
  "data/redirect-devtop/2022/7/1138762.json": "No clue how I am learning this only now, but better later than never: HTTPS keepAlive is not enabled...",
  "data/redirect-devtop/2022/7/1139411.json": "You can listen here 🚀     In this post, I will be talking about the nitty-gritty of remote working,...",
  "data/redirect-devtop/2022/7/1139057.json": "I’ve been coding wrong my whole life.  I was thinking that its okay to sit down at my desk, Open...",
  "data/redirect-devtop/2022/7/1139596.json": "If you're looking for a React framework that's easy to use and has a ton of features, Next.js is the...",
  "data/redirect-devtop/2022/7/1138543.json": "If you are a PhpStorm user you know that it comes with many great features that make programming in...",
  "data/redirect-devtop/2022/7/1139071.json": "ESLint offers three settings for any given rule: error, warn, and off. The error setting will make...",
  "data/redirect-devtop/2022/7/1139940.json": "I got to hang with Deno core team member Luca Casonato a couple of weeks ago to discuss a framework...",
  "data/redirect-devtop/2022/7/1140090.json": "Declare and Initialize Arrays in javascript Find out the sum, minimum and maximum value in...",
  "data/redirect-devtop/2022/7/1140087.json": "Hello, dear DEV community!  I have a quick and exciting update for you today: we have brought the...",
  "data/redirect-devtop/2022/7/1140065.json": "When you start exploring the blogging world, mainly technical writing, you'll encounter this question...",
  "data/redirect-devtop/2022/7/1138199.json": "API management solutions, also known as API gateways, are a must in the day and age of APIs. However,...",
  "data/redirect-devtop/2022/7/1140092.json": "At the first I want to explain what is Webassembly?   in short, compile and run languages...",
  "data/redirect-devtop/2022/7/1138435.json": "Developers struggle with context switches   If you want to know what people are struggling...",
  "data/redirect-devtop/2022/7/1139828.json": "Are you interested in Front-end development and would like to start coding for free? Then, our next...",
  "data/redirect-devtop/2022/7/1140968.json": "Course Content      No. Topics     1 How to Build Uber Clone with React (Ep. 1) (You are...",
  "data/redirect-devtop/2022/7/1139349.json": "While working on multiple projects, some of them may use different node versions.  This can be a real...",
  "data/redirect-devtop/2022/7/1138461.json": "At the beginning of my tech career, I made a few mistakes that cost me countless hours and months. I...",
  "data/redirect-devtop/2022/7/1139549.json": "Incredible amounts of discussion have taken place over the past couple years over Deno, Ryan Dahl’s...",
  "data/redirect-devtop/2022/7/1141315.json": "How to Make a Real Estate Website Using Html CSS JavaScript  This video will show you how to make...",
  "data/redirect-devtop/2022/7/1140826.json": "Let me ask you: What do you think this code does?    resizeImage(imagePath, 300, 200, true, true,...",
  "data/redirect-devtop/2022/7/1141131.json": "Last week, a guy copied my source code from Github, even the comments I have written in my source...",
  "data/redirect-devtop/2022/7/1139608.json": "How to Make a Charity Website Using Html CSS JavaScript  This video will show you how to make a...",
  "data/redirect-devtop/2022/7/1141173.json": "Open Source contribution is one of the x-factors in the portfolio of a developer. A developer learns...",
  "data/redirect-devtop/2022/7/1139921.json": "We as programmers lead a hard life. Especially when it comes to the interview process. There are many...",
  "data/redirect-devtop/2022/7/1140628.json": "How to have multiple Git configs for the same user?   In this article, we will see how to...",
  "data/redirect-devtop/2022/7/1139615.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/7/1142030.json": "Let's say we have an array of users, but each user is also an array.  For the example, we'll use the...",
  "data/redirect-devtop/2022/7/1138957.json": "Want to use bun for your next react projects?               Install bun   First run the...",
  "data/redirect-devtop/2022/7/1140981.json": "BitBucket   Like GitHub, BitBucket is also an application that helps to manage projects'...",
  "data/redirect-devtop/2022/7/1142226.json": "A lot has changed in the world of computing over the years. In the early days, computers were...",
  "data/redirect-devtop/2022/7/1135475.json": "Don't conform to the Law of Jante. Fight the Impostor Syndrome. You are special.",
  "data/redirect-devtop/2022/7/1142394.json": "build your own instagram bot from scratch (or) set one up in like 10s for free   a brief overview of...",
  "data/redirect-devtop/2022/7/1134056.json": "Seguramente has visto algunos elementos parecidos a las GIFs en las paginas web que llaman mucho su...",
  "data/redirect-devtop/2022/7/1142626.json": "Clean code isn't code that just works. It refers to neatly organized code which is easy to read,...",
  "data/redirect-devtop/2022/7/1142400.json": "When I started coding, the first thing I did to put my new knowledge into practice was to automate a...",
  "data/redirect-devtop/2022/7/1141036.json": "Recently, I talked with a bunch of people across several Discord and Slack communities about their...",
  "data/redirect-devtop/2022/7/1142968.json": "Let's hear about what you have going on! If you've shared your project before, what's new?",
  "data/redirect-devtop/2022/7/1141122.json": "\"JavaScript is a single-threaded and non-blocking language\". Chances are you have heard that...",
  "data/redirect-devtop/2022/7/1142308.json": "I always love to delve into the new and wonderful things coming to the web, today I'm going to look...",
  "data/redirect-devtop/2022/7/1142900.json": "Sometimes we need to run code only once. useRunOnce is a hook that runs a function one time when a...",
  "data/redirect-devtop/2022/7/1142382.json": "Being a successful developer requires continuous learning and skill improvement. But there are simply...",
  "data/redirect-devtop/2022/7/1142640.json": "A frequently asked question is How important is math in programming? In this blog post, we will dive...",
  "data/redirect-devtop/2022/7/1142892.json": "Hi friends, I'm Safak. I am a full-stack web developer and I'm sharing open source web projects on my...",
  "data/redirect-devtop/2022/7/1142070.json": "Nowadays, GraphQL has become a more and more popular technology for building web servers. At the same...",
  "data/redirect-devtop/2022/7/1143111.json": "Before I changed the email address associated with my GitHub account I had 7,500 commits towards...",
  "data/redirect-devtop/2022/7/1138264.json": "Introduction   Microsoft’s Visual Studio Code is a free, open-source code editor that runs...",
  "data/redirect-devtop/2022/7/1143751.json": "Welcome to another Meme Monday post! Today's cover image comes from last week's thread.  DEV is an...",
  "data/redirect-devtop/2022/7/1143541.json": "Hello, open-source world!   We have been working tirelessly towards this day for a long...",
  "data/redirect-devtop/2022/7/1142220.json": "Optional chaining is a feature in Javascript which lets us access child properties of an object, even...",
  "data/redirect-devtop/2022/7/1143505.json": "How do websites work?    A user provides a URL to the web browser. The browser sends a...",
  "data/redirect-devtop/2022/7/1143485.json": "According to the reports, the web and mobile development industry is expected to grow faster than the...",
  "data/redirect-devtop/2022/7/1143584.json": "How To Make Personal Portfolio Using HTML CSS JavaScript  In this video, I will show you how to...",
  "data/redirect-devtop/2022/7/1143415.json": "Using Linear-Gradient Implement Scrolling Indicator Effect",
  "data/redirect-devtop/2022/7/1143106.json": "Got any ideas buried in your git history that never made it to production?  Give it a chance in the...",
  "data/redirect-devtop/2022/7/1142742.json": "I still remember my first day on the job. From the bus stop, I walked under the summer’s day heat...",
  "data/redirect-devtop/2022/7/1143512.json": "When you read JavaScript/Typescript code, have you ever encountered an imported package and wanted to...",
  "data/redirect-devtop/2022/7/1139543.json": "(Cover image created with Dall-E mini and the caption \"an AI wearing a funny top hat\" - you know,...",
  "data/redirect-devtop/2022/7/1144043.json": "There is one problem that every React Developer falls into during his journey. This is how to...",
  "data/redirect-devtop/2022/7/1142708.json": "#frontEnd #reactJs #internship #jobs #hireMe #hiring            Hi everyone,     I am a Front-End...",
  "data/redirect-devtop/2022/7/1144355.json": "What is JSX   JSX or JavaScript XML is an extension of JavaScript used to write React...",
  "data/redirect-devtop/2022/7/1143758.json": "I built a CSS grid layout tool for the web using React",
  "data/redirect-devtop/2022/7/1145106.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/7/1137964.json": "Table of Contents    Initial project  Using custom hooks to easily show and hide...",
  "data/redirect-devtop/2022/7/1141099.json": "After my first article that was not related all that much to the code but more to the developer...",
  "data/redirect-devtop/2022/7/1143829.json": "Are you a beginner in JavaScript or want to improve your coding skills in a cool, fun, and...",
  "data/redirect-devtop/2022/7/1144730.json": "Project-Based Learnings     Free Programming Books    Developer Roadmap     Public API’s     Coding...",
  "data/redirect-devtop/2022/7/1143789.json": "Coding is an exciting field, there's no doubt about that. It's an attractive field, but a lot of...",
  "data/redirect-devtop/2022/7/1144923.json": "Howdy everybody! 👋 For Appwrite, our community is the biggest strength and we want everyone to feel...",
  "data/redirect-devtop/2022/7/1144067.json": "Quick Summary   In this article You will learn about the tips and tricks of css specificity,...",
  "data/redirect-devtop/2022/7/1143761.json": "It's been 11 amazing years with ups and downs, where we enjoyed each other's company and had a lot of...",
  "data/redirect-devtop/2022/7/1145582.json": "You can to it listen here 🚀:              Just a quick background about us   Novu is the first...",
  "data/redirect-devtop/2022/7/1143785.json": "Drag &amp; Drop is something that can enhance your user's experience if you are building graphic...",
  "data/redirect-devtop/2022/7/1146033.json": "Let's discuss the concept of magic — what are your opinions?                Magic (programming)     ...",
  "data/redirect-devtop/2022/7/1145312.json": "Drag and drop applications are very common nowadays, they are great for the user experience inside an...",
  "data/redirect-devtop/2022/7/1145691.json": "It’s official — Microsoft has released the new .NET Rate Limiter in .NET 7! It’s amazing, and it will...",
  "data/redirect-devtop/2022/7/1144466.json": "Your Desk probably comes at second place after your bed.. where you spend your most of the time.  So...",
  "data/redirect-devtop/2022/7/1144524.json": "There's this superstitious belief in our industry that LOC count is irrelevant to measure developer...",
  "data/redirect-devtop/2022/7/1144888.json": "You spent hours and hours writing code. You are ready to submit your changes for code review....",
  "data/redirect-devtop/2022/7/1145966.json": "My short comment on why you should stop using comments in your code (unless in special cases)       ...",
  "data/redirect-devtop/2022/7/1144701.json": "Hey.. We are waiting 🤩 for your best article to read !!  Drop them below 👇 (You can use ctrl + Shift...",
  "data/redirect-devtop/2022/7/1145515.json": "Speed Code Video https://twitter.com/asyrafhussin4/status/1549679420318724096",
  "data/redirect-devtop/2022/7/1147721.json": "20 Git Command I Use All The Time — Git CheatSheet  In this article, I just want to lay down a quick...",
  "data/redirect-devtop/2022/7/1141835.json": "SSR data fetching + caching mechanism is a bit tricky in next js.  In this article, we will learn how...",
  "data/redirect-devtop/2022/7/1147334.json": "Here is a list of 5 things to keep in mind when starting programming.           1. Languages are just...",
  "data/redirect-devtop/2022/7/1147381.json": "I recently joined a Twitter space hosted by Emy around technical writing. At one stage, a question...",
  "data/redirect-devtop/2022/7/1144681.json": "Go to EmailJs Create a free account (you can send only 200 emails per month in this account) want...",
  "data/redirect-devtop/2022/7/1147972.json": "Time to celebrate!  Today marks my two-year anniversary on dev.to! With a total of 52 published...",
  "data/redirect-devtop/2022/7/1146137.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/7/1148602.json": "Kubernetes poses many challenges around cost allocation and reporting – from learning which team adds...",
  "data/redirect-devtop/2022/7/1144933.json": "The Problem   Everybody hates when need to wait too much to see something in a webapp. The...",
  "data/redirect-devtop/2022/7/1147417.json": "Lately, I have observed that developers, especially the ones who’re starting out — are under the...",
  "data/redirect-devtop/2022/7/1148346.json": "In this article we will use CSS to create a variety of wonderful border effects.",
  "data/redirect-devtop/2022/7/1144732.json": "Table of contents    Introduction  Setup   Project folder structure Server script Router Vue...",
  "data/redirect-devtop/2022/7/1147963.json": "My React Boilerplate with Next.js has recently reached 2000+ stars on GitHub. In the last months,...",
  "data/redirect-devtop/2022/7/1148447.json": "If you followed me for a while, you might have seen I like traveling around.  I've recently been to...",
  "data/redirect-devtop/2022/7/1148540.json": "In this post, I will show you how you can create a Google Chrome extension that will block social...",
  "data/redirect-devtop/2022/7/1148550.json": "Tools like Tailwind may help you develop your hobby project faster, but the thing is...          ...",
  "data/redirect-devtop/2022/7/1148761.json": "Some useful JavaScript One-Liners  After a good response from the community, I decided to post some...",
  "data/redirect-devtop/2022/7/1146173.json": "I want talk about design patterns in php in a few next articles. And I really like how language...",
  "data/redirect-devtop/2022/7/1149183.json": "There are over 97 Web APIs, and you’re only using 5% of them. Let’s unlock that other 95...",
  "data/redirect-devtop/2022/7/1147632.json": "When learning web development, you will likely come across someone who insists on using the terminal....",
  "data/redirect-devtop/2022/7/1147428.json": "You have probably already come across a YouTube video download site, in this article I will show...",
  "data/redirect-devtop/2022/7/1148542.json": "On Christmas Day 1990, Sir Tim Berners-Lee introduced the world to the first web browser he had...",
  "data/redirect-devtop/2022/7/1149264.json": "A few days back, I was wondering how to know if the system theme is dark or light in web using...",
  "data/redirect-devtop/2022/7/1148372.json": "People with different disabilities face various challenges when using the web. Therefore, it is...",
  "data/redirect-devtop/2022/7/1149592.json": "1. Traversy Media    Visit this channel :  click here =&gt; Traversy Media           2. Tech...",
  "data/redirect-devtop/2022/7/1148794.json": "Responsive Education Website Using Html CSS JavaScript  This video will show you how to make a...",
  "data/redirect-devtop/2022/7/1147569.json": "What is a JavaScript framework?   A JavaScript framework is a tool that helps developers to...",
  "data/redirect-devtop/2022/7/1149666.json": "Hey hey hey! Over the past few months I’ve spent some of my spare time building up my new portfolio...",
  "data/redirect-devtop/2022/7/1150029.json": "Regarding JavaScript, we get an extremely useful way of extracting properties from objects.   Note:...",
  "data/redirect-devtop/2022/7/1150019.json": "Perhaps you are a beginner to CSS and wondering if you should use flex or grid for your layout, or...",
  "data/redirect-devtop/2022/7/1141795.json": "Introduction   Building application/websites with Angular always come with a downside: the...",
  "data/redirect-devtop/2022/7/1149534.json": "How to Build a Digital Marketing Agency Website Using Html CSS JavaScript  This video will show...",
  "data/redirect-devtop/2022/7/1149689.json": "This text is part of a series of texts about Clean Architecture analysis applied with different...",
  "data/redirect-devtop/2022/7/1150120.json": "In this post, I will show how easily you can set up your own docker images and then utilize GitHub...",
  "data/redirect-devtop/2022/7/1149391.json": "Checking if an element is visible on the user screen is very easy using the Intersection Observer...",
  "data/redirect-devtop/2022/7/1150155.json": "I am sure that when you first begin learning full stack web development using the MERN stack, you...",
  "data/redirect-devtop/2022/7/1149710.json": "\"A journey of a thousand miles begins with a single step.\"   Accepting this challenge allows...",
  "data/redirect-devtop/2022/7/1150626.json": "JavaScript is a front-end language, the most utilized language nowadays by developers to design web...",
  "data/redirect-devtop/2022/7/1150639.json": "In this article, I will guide you through sending notifications in-app and via email using Novu in a...",
  "data/redirect-devtop/2022/7/1150891.json": "Welcome to another Meme Monday post! Today's cover image comes from last week's thread.  DEV is an...",
  "data/redirect-devtop/2022/7/1150105.json": "If you have a product that's available in several colors, it can be cumbersome and expensive to take...",
  "data/redirect-devtop/2022/7/1149444.json": "Introduction   Personal branding is a strategy that people use to advertise themselves...",
  "data/redirect-devtop/2022/7/1149834.json": "****Writer’s Note: I am honored to be publishing this piece with This is Learning.   This is Learning...",
  "data/redirect-devtop/2022/7/1150131.json": "Ola! So, this is something I've just come to a realisation recently and if you're a newbie in the...",
  "data/redirect-devtop/2022/7/1151159.json": "I have recently created a React.js project for one of the MNC I'm interviewing at and they provided a...",
  "data/redirect-devtop/2022/7/1150917.json": "This is a story of me quitting my job as a web dev, starting my first SaaS, burning through all of my savings, and finding what I really wanted to do.",
  "data/redirect-devtop/2022/7/1143317.json": "How often have we struggled to focus on a single task. How often have we got sidetracked from our...",
  "data/redirect-devtop/2022/7/1150665.json": "Did you know that Next.js gives us an option to analyze our output bundle size?  While creating our...",
  "data/redirect-devtop/2022/7/1149084.json": "If you've been using CSS and creating websites for some time, there's a strong probability that...",
  "data/redirect-devtop/2022/7/1151491.json": "As a developer, they are working with SSSL(Server Site Scripting Language), Programming languages,...",
  "data/redirect-devtop/2022/7/1150404.json": "I recently did a live stream explaining what I considered the \"Top 25\" things I'd done to my website...",
  "data/redirect-devtop/2022/7/1149059.json": "Extensions provide add-on features &amp; tools that let us customize &amp; enhance the...",
  "data/redirect-devtop/2022/7/1151955.json": "Hey folks! 👋  I wanted to write up a quick post about spam fighting in this community as it's a never...",
  "data/redirect-devtop/2022/7/1152019.json": "This month, I learned how to send a tweet with GitHub Copilot. It was so cool! I'm anticipating that...",
  "data/redirect-devtop/2022/7/1141100.json": "For me, writing documentation is almost like coming back to the roots. If you have played some video...",
  "data/redirect-devtop/2022/7/1151456.json": "null",
  "data/redirect-devtop/2022/7/1152032.json": "After looking at a dozen headless content management systems (headless CMSs) for my upcoming...",
  "data/redirect-devtop/2022/7/1152314.json": "A round up of the most-read and most-loved contributions from the community this past week",
  "data/redirect-devtop/2022/7/1150522.json": "In this tutorial I will take a simple notes app built with function based views (FBV) and convert...",
  "data/redirect-devtop/2022/7/1152665.json": "Tracking the cost and usage of cloud-based services can be a tough nut to crack even if you’re using...",
  "data/redirect-devtop/2022/7/1152122.json": "When I originally began writing this post I was a happily employed developer in a role that I enjoyed...",
  "data/redirect-devtop/2022/7/1151856.json": "If you are a Software Engineer or are involved in any kind of software development you probably heard...",
  "data/redirect-devtop/2022/7/1152593.json": "One thing that I can say, having spent three years in communities and over ten months as a DevRel...",
  "data/redirect-devtop/2022/7/1152078.json": "Developers and early-stage startups build REST APIs to enable mobile, web, and API applications....",
  "data/redirect-devtop/2022/7/1152671.json": "Javascript libraries   Particles.js — A library for creating beautiful floating particles on...",
  "data/redirect-devtop/2022/7/1152742.json": "Product Notification - What are those?   Product Notifications are everywhere - Emails,...",
  "data/redirect-devtop/2022/7/1152788.json": "How to Build an eCommerce Website Using HTML CSS JavaScript  This video will show you how to...",
  "data/redirect-devtop/2022/7/1144623.json": "Staying up to date as a software developer on the latest tools, industry news and trends can be...",
  "data/redirect-devtop/2022/7/1150942.json": "For one of my current projects, I created a timer until the release on New Year's Eve - December 31,...",
  "data/redirect-devtop/2022/7/1151940.json": "One of the things that I like most about TypeScript is that it is a superset of JavaScript. This...",
  "data/redirect-devtop/2022/7/1152779.json": "How to make Developers Thrive   A company's strength comes from its team and the structure...",
  "data/redirect-devtop/2022/7/1153848.json": "👋 Hello Devs!   I’m Sonny, Founder and Chief Vibes Officer of Codédex, a brand new learn to code...",
  "data/redirect-devtop/2022/7/1153734.json": "How to Build Cryptocurrency Website Using HTML CSS JavaScript  This video will show you how to...",
  "data/redirect-devtop/2022/7/1153053.json": "Photo by Nick Morrison on Unsplash  I had planned an Angular Course for the community for a very long...",
  "data/redirect-devtop/2022/7/1153405.json": "Note: This post includes affiliate links;  I may receive compensation if you purchase products or...",
  "data/redirect-devtop/2022/7/1153644.json": "My background for making this comparison: I worked with Magento for over the past 3 years across...",
  "data/redirect-devtop/2022/7/1154283.json": "One of the cool things about using Chrome as your default browser is all the extensions you can use....",
  "data/redirect-devtop/2022/7/1150409.json": "It's 2022, and it's officially been 5 years since Tailwinds launch. Now some might ask what exactly...",
  "data/redirect-devtop/2022/7/1153349.json": "In 21st century, programming is everywhere. Some people are passionate about programming languages....",
  "data/redirect-devtop/2022/7/1154193.json": "When you buy a car or a bicycle, you first adjust the seat position and saddle height to suit your body size.　It is the same with git configuration.",
  "data/redirect-devtop/2022/7/1150163.json": "Routing is important in any frontend project, the previous versions of React Router played their part...",
  "data/redirect-devtop/2022/7/1153051.json": "In this blog will go over three approaches of centering a div.    The most difficult thing...",
  "data/redirect-devtop/2022/7/1153328.json": "Welcome to DEV! A thread of hellos and intros.",
  "data/redirect-devtop/2022/7/1152429.json": "Media queries are a CSS technique that we can utilize when making our pages responsive.  We use...",
  "data/redirect-devtop/2022/7/1154298.json": "What is Node?   Node is an eminent JavaScript runtime environment that is often mistaken for...",
  "data/redirect-devtop/2022/7/1152803.json": "This is an anonymous post sent in by a member who does not want their name disclosed. Please be...",
  "data/redirect-devtop/2022/7/1153373.json": "In the previous article, we looked at creating a dice in CSS. Let's take that learning and see how we...",
  "data/redirect-devtop/2022/7/1154404.json": "Let's say a client asks for a new development/feature, how do you calculate or estimate how much to...",
  "data/redirect-devtop/2022/7/1154877.json": "It's that time of the week again. So wonderful devs, what did you learn this week? It could be...",
  "data/redirect-devtop/2022/7/1155248.json": "The other day I got a lovely email from one of my readers asking how to revert a commit that was made...",
  "data/redirect-devtop/2022/7/1152577.json": "In this series, we will build a Telegram bot together! Follow the posts if you are familiar with PHP...",
  "data/redirect-devtop/2022/7/1154047.json": "Why Should I learn Kubernetes? 🤔           Because Kubernetes can deploy 100 Docker...",
  "data/redirect-devtop/2022/7/1155354.json": "Introducing Projects   Present all your projects in style with a super customizable web app!...",
  "data/redirect-devtop/2022/7/1155343.json": "How to Build Responsive car rental website using Html CSS JavaScript  This video will show you...",
  "data/redirect-devtop/2022/7/1155214.json": "I recently came across a twitter post where the user challenged others if they knew the difference...",
  "data/redirect-devtop/2022/7/1154726.json": "It is widely known to regular users of DEV that DEV supports a variety of embeds using Liquid Tags,...",
  "data/redirect-devtop/2022/7/1155218.json": "A web developer is a programmer who especially, always busy with the development of the World Wild...",
  "data/redirect-devtop/2022/7/1155510.json": "Gist   Acoording to React 18 Changelog:   In the future, React will provide a feature that...",
  "data/redirect-devtop/2022/7/1155519.json": "“I get no respect. The way my luck is running, if I was a politician I would be honest.” ― Rodney...",
  "data/redirect-devtop/2022/7/1154734.json": "Hello everyone 👋, I hope you are doing well.  With this post I plan to start a new section called...",
  "data/redirect-devtop/2022/7/1155583.json": "Since I was a little kid, diagrams have fascinated me. As I grew as a software developer, I...",
  "data/redirect-devtop/2022/7/1155905.json": "This is a list of free tools every frontend developer probably will google for one day. These...",
  "data/redirect-devtop/2022/7/1154052.json": "Learn what IPv4, CIDR, CIDR Block, Subnetting and and how to calculate it...  Overview of IPv4 You...",
  "data/redirect-devtop/2022/7/1155867.json": "Let's hear about what you have going on! If you've shared your project before, what's new?",
  "data/redirect-devtop/2022/7/1155728.json": "I love unit tests. Magic and its satellite projects has 1,000+ unit tests, and some of the satellite...",
  "data/redirect-devtop/2022/7/1155365.json": "With the time there are lot of changes in a ways of how we build the frontend for web...",
  "data/redirect-devtop/2022/7/1155748.json": "Introduction   Hello! I recently heard about the PlanetScale X Hashnode hackathon, so I...",
  "data/redirect-devtop/2022/7/1155908.json": "Clean Code has become a bit of a buzzword recently, but it is important, both as a developer and as...",
  "data/redirect-devtop/2022/7/1154742.json": "Somewhere, someone quite rightly said - \"Coding in Rust makes you feel like a genius.\". I don't think...",
  "data/redirect-devtop/2022/7/1155670.json": "In this article, I will suggest you some of the best extensions you need to install for better...",
  "data/redirect-devtop/2022/7/1155785.json": "What is this article about?   Like an actual auction, if you bid for a product, you get...",
  "data/redirect-devtop/2022/7/1155061.json": "Today, we will discuss about another one of popular design pattern in programming, the Facade...",
  "data/redirect-devtop/2022/7/1145195.json": "Join us for this opportunity to build an awesome application with Redis while earning some great prizes",
  "data/redirect-devtop/2022/7/1155382.json": "If you struggle with answering questions like _\"Can you please tell me a bit about yourself?\" or...",
  "data/redirect-devtop/2022/7/1155752.json": "Improve your Server Performance By Caching often Fetched Data using Redis.           ...",
  "data/redirect-devtop/2022/7/1155668.json": "Have you ever wondered how a Web server works under the hood? Moreover, would you be willing to...",
  "data/redirect-devtop/2022/7/1155891.json": "The .webp format is a broadly supported compressed image format that is becoming more and more common...",
  "data/redirect-devtop/2022/7/1155745.json": "Kubernetes can speed up the development process by making easy, automated deployments, updates...",
  "data/redirect-devtop/2022/7/1154507.json": "The number of internet users has increased massively in the past few years, and handling this...",
  "data/redirect-devtop/2022/7/1153363.json": "I'm not sure if there's ever been a language more loathed, yet so widely used, as JavaScript.  I'm...",
  "data/redirect-devtop/2022/7/1141665.json": "Hello everyone, and thank you for taking out your precious time to read this blog and investing in...",
  "data/redirect-devtop/2022/7/1146028.json": "What JWT is used for?   A JWT is used for authorisation, authorisation is making sure that..."
}