{
  "data/redirect-devtop/2022/4/1041174.json": "It's been 735 articles, and I've finally had enough. Time to lay down the keyboard and retire the...",
  "data/redirect-devtop/2022/4/1041123.json": "Someone in one of the Slack communities I'm a part of asked today how to type JSON in TypeScript,...",
  "data/redirect-devtop/2022/4/1041822.json": "Simple full-stack starter that uses a M-UI React design powered by Express/NodeJS",
  "data/redirect-devtop/2022/4/1041850.json": "Thanks to its static binaries and cross-compiling, building and distributing command-line apps in Go...",
  "data/redirect-devtop/2022/4/1041770.json": "Recently I did some interviews for companies that call themselves \"human focused\", but in the time...",
  "data/redirect-devtop/2022/4/1041220.json": "Let's take a quick look and Click \"?\" on this page!           The started   I wanted to sound in my...",
  "data/redirect-devtop/2022/4/1042213.json": "Now that we are talking about testing, let's try out Jest, a pretty well-used testing framework for...",
  "data/redirect-devtop/2022/4/1042481.json": "Here, several approaches will be introduced to reduce your front-end code base, especially, for...",
  "data/redirect-devtop/2022/4/1042005.json": "Hey! This is my first post on DEV. I have started learning web development late 2021. I've been...",
  "data/redirect-devtop/2022/4/1042691.json": "Overview   Decifer is a cross-platform mobile app that helps to generate transcripts either...",
  "data/redirect-devtop/2022/4/1043133.json": "Having a good README can make the difference between a 0-star and a Unicorn Github Project! I hope...",
  "data/redirect-devtop/2022/4/1043160.json": "Open-Source React Dashboard Template crafted on top of M-UI Library (sources available on Github)",
  "data/redirect-devtop/2022/4/1043325.json": "Remember the old days when the internet used to be the only escape you had to run away from our cruel...",
  "data/redirect-devtop/2022/4/1042835.json": "I'm starting a new role soon, and they shipped me a brand new Macbook Pro.  I got everything set up...",
  "data/redirect-devtop/2022/4/1043337.json": "Github is a popular platform for tons of resources and there are many repositories which provide free...",
  "data/redirect-devtop/2022/4/1043314.json": "Let's talk through the basics of one of the most versatile modules in CSS -- the...",
  "data/redirect-devtop/2022/4/1043974.json": "We are happy to announce GitLive now works, out-of-the-box in offline mode, with any Git repository...",
  "data/redirect-devtop/2022/4/1044276.json": "Hi, everyone. My name is Daniel Reis, aka. \"danielhe4rt\", I'm Brazilian and I'm looking for a...",
  "data/redirect-devtop/2022/4/1043985.json": "We have prepared an open-source &amp; completely free toolset for Shopify merchants to help them set...",
  "data/redirect-devtop/2022/4/1043158.json": "In this article, I will show you how to make a good portfolio, then I will rate your portfolios and...",
  "data/redirect-devtop/2022/4/1043341.json": "A deep dive into what is wrong with our conversations about degrees vs bootcamps",
  "data/redirect-devtop/2022/4/1044232.json": "A post by Ben Halpern",
  "data/redirect-devtop/2022/4/1043972.json": "Free Bootstrap 5 Template crafted by ThemeSelection - Sneat Dashboard can be used in commercial projects.",
  "data/redirect-devtop/2022/4/1043766.json": "Sometimes you want to have Jest perform a recurring action between each task.  Some examples: Query a...",
  "data/redirect-devtop/2022/4/1044340.json": "Have you ever had to write the same code over and over again, perhaps changing only small...",
  "data/redirect-devtop/2022/4/1043983.json": "This is a short summary on how to use a declarative pattern in Angular with RxJS.  If you are...",
  "data/redirect-devtop/2022/4/1043813.json": "As I continue to post on dev.to, I consistently see post after post telling me to never stick to one...",
  "data/redirect-devtop/2022/4/1045102.json": "A curated list with pixel-perfect Open-Source Dashboards crafted in modern technologies: React, Vue3, Boostrap 5, Tailwind CSS",
  "data/redirect-devtop/2022/4/1044244.json": "A new series to hunt for Free Tailwind Components. In this edition we are exploring Form Components. ",
  "data/redirect-devtop/2022/4/1045136.json": "Whether you're a blogger, startup, or a business, blogging is a long-term strategy to build a strong...",
  "data/redirect-devtop/2022/4/1044046.json": "You’ve probably seen the term “headless” used countlessly over and over again. There are so many...",
  "data/redirect-devtop/2022/4/1044773.json": "A monorepo, what's that?   A while back I was finishing work with an employer and was due to...",
  "data/redirect-devtop/2022/4/1045622.json": "Thank you to everyone who weighed in about the most frustrating part of software development in..."
}