{
  "data/redirect-devtop/2021/11/883949.json": "In the evolution of software architecture, loose coupling has been at the centre. There is an...",
  "data/redirect-devtop/2021/11/883951.json": "I was a Windows fan all my life, both at home since I was 10 years old, and at work for 8 years of my...",
  "data/redirect-devtop/2021/11/884285.json": "Hey Coders! We all can agree that new-age Javascript has changed modern websites structure and the...",
  "data/redirect-devtop/2021/11/884039.json": "In a rush? Head down to the comments and share a domain name you own without a purpose, I (and...",
  "data/redirect-devtop/2021/11/883495.json": "Recently Visual Studio Code also launched an online version of their editor. It is a lightweight...",
  "data/redirect-devtop/2021/11/884471.json": "Frontend developers! Have you ever wondered why to choose a certain type of database for a project,...",
  "data/redirect-devtop/2021/11/884459.json": "Another fantastic Hacktoberfest is in the books! We hope everyone who participated learned something...",
  "data/redirect-devtop/2021/11/883944.json": "1. Creativity When problems surface, a creative developer knows solutions likely already exist. And...",
  "data/redirect-devtop/2021/11/885402.json": "TL;DR  Hoppscotch is an open-source API development ecosystem.  Today we're launching Teams...",
  "data/redirect-devtop/2021/11/885112.json": "Best CSS Frameworks in 2021    Bootstrap  Foundation  Bulma  Tailwind CSS  UI Kit  Milligram...",
  "data/redirect-devtop/2021/11/885132.json": "Hi there👋,  I wanted to build a portfolio which is different and unique with design and little bit...",
  "data/redirect-devtop/2021/11/884283.json": "Particles.js   It’s been a long time since I promised to get my hands dirty with the...",
  "data/redirect-devtop/2021/11/885821.json": "Hacktober is over, but that doesn't mean we shouldn't continue to encourage folks to contribute to...",
  "data/redirect-devtop/2021/11/884447.json": "A detailed write-up about a CityJS talk covering power tips of console, developer tools and how to use the tools outside the browser",
  "data/redirect-devtop/2021/11/885433.json": "There are many popular ecommerce platforms that come to developers’ minds first, and one of these is...",
  "data/redirect-devtop/2021/11/883882.json": "My 2021 Linux development machine explained",
  "data/redirect-devtop/2021/11/884297.json": "The useState and useEffect hooks were a godsend for the React community. However, like any tool,...",
  "data/redirect-devtop/2021/11/883629.json": "don't waste time in useless agile status update. here are a few tips to improve productivity and communication in your team.",
  "data/redirect-devtop/2021/11/885097.json": "What you’ll be building, Git Repo Here.               Featured Articles    Uber Clone Facebook...",
  "data/redirect-devtop/2021/11/885101.json": "Responsive personal portfolio website with html css js  In this video series,  I will show you...",
  "data/redirect-devtop/2021/11/884042.json": "Let's get straight to the answer. Rails is not dead. It is anything but dead.  Ruby on Rails is more...",
  "data/redirect-devtop/2021/11/885674.json": "Video   If you'd prefer a video with animated examples, you can check out the video that I...",
  "data/redirect-devtop/2021/11/885054.json": "The original article was published on Codica blog.  Web tools like Vue.js and React offer developers...",
  "data/redirect-devtop/2021/11/884958.json": "What is React Native?   React Native is a JavaScript framework that allows you to create...",
  "data/redirect-devtop/2021/11/885420.json": "Many engineering teams get stuck and cannot ship quality software fast because of technical...",
  "data/redirect-devtop/2021/11/885825.json": "Hi guys!.  In this post, we will be looking into the best ways CSS code can be added in React JS or...",
  "data/redirect-devtop/2021/11/886836.json": "This article was originally published on my blog: camchenry.com. If you enjoy this article, please...",
  "data/redirect-devtop/2021/11/885140.json": "Hello Folks 👋   This is Savio here. 14 year old, building useful products. Helping people...",
  "data/redirect-devtop/2021/11/884681.json": "I've been having a ton of fun creating interactive musical tools and references over at muted.io....",
  "data/redirect-devtop/2021/11/887053.json": "So I'd like you to think about it, you love building with flutter right? and flutter's like your best...",
  "data/redirect-devtop/2021/11/887140.json": "Hi there👋,  In this guide we will be learning how to integrate a payment gateway in our web...",
  "data/redirect-devtop/2021/11/884675.json": "What is burnout?   Burnout is an increasingly widespread and destructive mental health...",
  "data/redirect-devtop/2021/11/885906.json": "A round up of the most-read and most-loved contributions from the community this past week.",
  "data/redirect-devtop/2021/11/886013.json": "Introduction   If you're a developer, it's important for you to have a personal portfolio...",
  "data/redirect-devtop/2021/11/887529.json": "OK so I have read a few things about blockchain and dApps, I have listened to a few Twitter spaces...",
  "data/redirect-devtop/2021/11/886515.json": "Hello guys👋🏼, today we'd be talking about graphQL and how it works with React. We'd also be looking...",
  "data/redirect-devtop/2021/11/887274.json": "This post takes by granted that you already have Jest set up and a test script defined on your...",
  "data/redirect-devtop/2021/11/887478.json": "So few days ago I applied to a MNC and I had some interesting problems to solve in given amount of...",
  "data/redirect-devtop/2021/11/886471.json": "Some useful snippets for you to use.",
  "data/redirect-devtop/2021/11/887088.json": "In the Jamstack world the word “decoupling” is thrown around a lot, and it can be intimidating to not...",
  "data/redirect-devtop/2021/11/886845.json": "This article first appeared here: ...",
  "data/redirect-devtop/2021/11/888102.json": "I saw a lot of junior developper using forEach when they need to handle array.  I will show you and...",
  "data/redirect-devtop/2021/11/887878.json": "Development was always a way of evolution. The evolution of modern programming development brings a...",
  "data/redirect-devtop/2021/11/886762.json": "The road you need to take to become a senior developer is huge.  It is a difference that most...",
  "data/redirect-devtop/2021/11/885405.json": "Photo by Abby Chung from Pexels  You would like to continue your journey as a developer by...",
  "data/redirect-devtop/2021/11/888436.json": "Join me in this post as I create a React component using Test Driven Development (TDD) approach.  I...",
  "data/redirect-devtop/2021/11/887513.json": "Recently I heard about GitHub Copilot and thought it would be amazing.  I was right . I applied for...",
  "data/redirect-devtop/2021/11/887522.json": "After years of struggling when building a notification infrastructure for different projects I was...",
  "data/redirect-devtop/2021/11/886768.json": "This is a repost with little modifications of a post originally in my blog. zairiaimen.com If you...",
  "data/redirect-devtop/2021/11/888106.json": "What is Blockchain?   Blockchain is a digital chain of blocks where every block records...",
  "data/redirect-devtop/2021/11/888071.json": "Now a days a lots of people are working on a side projects or the PoC(proof of concept) to showcase...",
  "data/redirect-devtop/2021/11/888092.json": "Hello, buddies! Programming in itself is a very beautiful art. Sometimes we may face some problems...",
  "data/redirect-devtop/2021/11/888596.json": "What you’ll be building, Git Repo Here.               Featured Articles    Uber Clone Facebook...",
  "data/redirect-devtop/2021/11/888380.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/11/888404.json": "GitHub Copilot has surprised me beyond what I could have ever expected. I guess artificial...",
  "data/redirect-devtop/2021/11/886833.json": "In this article, you will learn how to create Random Quote Generator using JavaScript and API. I have...",
  "data/redirect-devtop/2021/11/889649.json": "When I read the document written by Phu Minh, I was curious about learning different concepts about...",
  "data/redirect-devtop/2021/11/889850.json": "Structure and Organize React Components for Enterprise Application  React is the most popular...",
  "data/redirect-devtop/2021/11/888601.json": "In this article we are going to learn how to implement Clean Architecture on .NET. We are going to...",
  "data/redirect-devtop/2021/11/887134.json": "At Forem a few coworkers and I have formed a Linux Club🤓.  Joe Doss is leading us on this adventure...",
  "data/redirect-devtop/2021/11/888838.json": "The current hands of the project hot update is getting slower and slower, so there is the emergence...",
  "data/redirect-devtop/2021/11/887492.json": "Hello readers my name is Abhinav maurya and I’m frontend developer and heading up towards backend....",
  "data/redirect-devtop/2021/11/888435.json": "A short journey in the csharp history",
  "data/redirect-devtop/2021/11/889626.json": "Python Objects 🐍   In Python everything is an object.  An object is formed by:   A memory...",
  "data/redirect-devtop/2021/11/890248.json": "Originally published at webdeasy.de.   Responsive web design has long been standard on the web....",
  "data/redirect-devtop/2021/11/888101.json": "In this article, we are going to deep dive into Node.js architecture and understand the asynchronous...",
  "data/redirect-devtop/2021/11/888401.json": "As you progress through your career as a developer, you’ll be required to think more and more about...",
  "data/redirect-devtop/2021/11/888831.json": "There was a study done by Pew Research a number of years ago that found that ⅔ of all tweets with...",
  "data/redirect-devtop/2021/11/890072.json": "Git is the free and open-source distributed version control system that's responsible for everything...",
  "data/redirect-devtop/2021/11/890074.json": "Overview   There are several approaches that we can take with implementing a Sidebar on our...",
  "data/redirect-devtop/2021/11/890025.json": "Table of content    Introduction What's the box model? Types of boxes Box sizing Bonus...",
  "data/redirect-devtop/2021/11/890350.json": "It has been long since I wanted to develop a website for blogging. Everytime I sat with it the one...",
  "data/redirect-devtop/2021/11/889335.json": "Next JS Starter template built with React, TypeScript, Tailwind CSS with awesome developer experience ESLint, Prettier.",
  "data/redirect-devtop/2021/11/888075.json": "You asked your teammate for help with a piece of code and they showed you the solution in their...",
  "data/redirect-devtop/2021/11/887093.json": "Accessibility Auditing My Portfolio Site - Part 3  Read Part 1 - The Audit and Part 2 - Quick...",
  "data/redirect-devtop/2021/11/885758.json": "XML? JSX? Sudo? Jamstack?            WTF is everyone talking about???   If you're new to...",
  "data/redirect-devtop/2021/11/890822.json": "When creating a website for Production, you would want the world to have a great experience using it....",
  "data/redirect-devtop/2021/11/890069.json": "Software developers implement codes to meet the users’ requirements and satisfy the clients. Some...",
  "data/redirect-devtop/2021/11/890528.json": "Design in detail based on codesandbox.io, hope you enjoy it!  I launched it on Product Hunt too and...",
  "data/redirect-devtop/2021/11/889581.json": "Can you learn to code by playing games? Can games make you a better developer? Yes. I am listing some...",
  "data/redirect-devtop/2021/11/888575.json": "C# was first released around 20 years ago and recently the pace of releases has increased with new...",
  "data/redirect-devtop/2021/11/889114.json": "ReactJS Optimization Techniques and Development Resources ebook helps you to optimize your React...",
  "data/redirect-devtop/2021/11/890207.json": "Couple of weeks ago I embarked on a challenge to prove you can build a product with just HTML and CSS...",
  "data/redirect-devtop/2021/11/890944.json": "Photo by AltumCode on Unsplash  Python is famous for its simplicity and ease of use. This is...",
  "data/redirect-devtop/2021/11/889413.json": "Programming is not always about writing code.  If you are a beginner programmer you might have fallen...",
  "data/redirect-devtop/2021/11/883677.json": "Hi there, welcome to this tutorial! 🎉  Today, I will be showing you how to perform super fast CRUD...",
  "data/redirect-devtop/2021/11/890538.json": "If you had asked me in June of 2020 if I would become a professional technical writer, I would have...",
  "data/redirect-devtop/2021/11/886814.json": "This is a common problem that beginner React developers face when working on a new project. I will...",
  "data/redirect-devtop/2021/11/891077.json": "In the past, CSS layouts have been a huge pain point for web designers. In order to create a...",
  "data/redirect-devtop/2021/11/890941.json": "Introduction   I recently discovered Pusher that provides real time communication amongst...",
  "data/redirect-devtop/2021/11/890195.json": "I've been using Tailwind CSS a lot lately and although I love the new way of working with utility...",
  "data/redirect-devtop/2021/11/890814.json": "I have data that is fetched from the API, and I would like to paginate this data. In this post, I’m...",
  "data/redirect-devtop/2021/11/890263.json": "In this article, we will learn to create an API server using the Express framework and Typescript.   ...",
  "data/redirect-devtop/2021/11/886445.json": "Working in a team is great. You can progress really fast and learn a lot from your colleagues. Having...",
  "data/redirect-devtop/2021/11/890689.json": "Hello everyone!  This week I am going to give a brief tutorial on how to get started with Docker. ...",
  "data/redirect-devtop/2021/11/891059.json": "Introduction   Hi, DEV friends! 😁  Today we'll talk about how to improve the UX of your...",
  "data/redirect-devtop/2021/11/888121.json": "From time to time someone still tells me that is using REDUX or similar tool in their project. I...",
  "data/redirect-devtop/2021/11/892009.json": "Join us for this opportunity to build projects with GitHub Actions while earning some fantastic prizes",
  "data/redirect-devtop/2021/11/891639.json": "Excellence is not an art. It is the habit of practice — Aristotle   Best way to be good at any piece...",
  "data/redirect-devtop/2021/11/890947.json": "Branches are an essential part of using Git. You can view a branch as separate versions of your...",
  "data/redirect-devtop/2021/11/890261.json": "This follows on from the post VS Code: You don't need that extension that I wrote last year.  There...",
  "data/redirect-devtop/2021/11/891764.json": "If you wish to make Web development a career or it is merely your hobby it can be overwhelming to...",
  "data/redirect-devtop/2021/11/890536.json": "Em maio de 2021 eu recebi minha primeira proposta para trabalhar no exterior; para algumas pessoas,...",
  "data/redirect-devtop/2021/11/891270.json": "JavaScript has been called the “assembly language of the web”. The analogy (it isn’t perfect, but...",
  "data/redirect-devtop/2021/11/892076.json": "These extensions will help you improve your workflow if you use VSCode every day, as I do, and make...",
  "data/redirect-devtop/2021/11/891963.json": "This article explain what the framework \"Socket.io\" means and Create a simple Group Chat App with...",
  "data/redirect-devtop/2021/11/890918.json": "FastAPI : a great framework for creating APIs, it takes very small effort to realize how fast it is...",
  "data/redirect-devtop/2021/11/889048.json": "A code review is a helpful tool for teams to improve code quality. Yet, there are many other benefits...",
  "data/redirect-devtop/2021/11/890948.json": "A pricing table is quite essential as it demonstrates the value of a company's product and represents...",
  "data/redirect-devtop/2021/11/891282.json": "Hi there, in today's article, we will be talking about responsive images, screen sizes, pixel...",
  "data/redirect-devtop/2021/11/891795.json": "A little bit of backstory   While I was designing my own portfolio, I was thinking to create...",
  "data/redirect-devtop/2021/11/891090.json": "We’ve all been there, you started to code your next million dollar idea and then you find yourself...",
  "data/redirect-devtop/2021/11/886547.json": "Being developers, we get zoned out in those standup calls when the server admins take over and flaunt...",
  "data/redirect-devtop/2021/11/891793.json": "React is one of the commonly used UI libraries that has been around for a long time (in programming...",
  "data/redirect-devtop/2021/11/891627.json": "Introduction   Atomic state management libraries are growing. Fast. As you can see in this...",
  "data/redirect-devtop/2021/11/892325.json": "The var keyword was JavaScript's first way to declare a variable. It fits, right? Var, variable, it's...",
  "data/redirect-devtop/2021/11/892544.json": "What exactly is JavaScript?   JavaScript is a High-Level programming language. It is...",
  "data/redirect-devtop/2021/11/892617.json": "Hello, everyone  Nomadev  here, back with another blog on tech. Today I will be sharing the top paid...",
  "data/redirect-devtop/2021/11/892144.json": "Many of us know what \"Coding\" is and maybe some of you've built really cool projects and have many...",
  "data/redirect-devtop/2021/11/892247.json": "Frosted glass effect or better known as Glassmorphism has been a trending UI feature for quite...",
  "data/redirect-devtop/2021/11/892008.json": "Have you ever dreamed of making money writing technical articles? How would you feel if I were to...",
  "data/redirect-devtop/2021/11/892345.json": "Github Actions: What is it?   GitHub Actions is a tool that conveniently enables you to...",
  "data/redirect-devtop/2021/11/891990.json": "According to a recent research by Cambridge University's Nicholas Boucher and Ross Anderson, there...",
  "data/redirect-devtop/2021/11/890508.json": "Youtube’s API provides developers with a way to get push notifications for when specific changes...",
  "data/redirect-devtop/2021/11/892546.json": "Hey Devs,  I just tried to make Windows-11 for the web. Made in HTML, CSS and JAVASCRIPT.![Image...",
  "data/redirect-devtop/2021/11/891786.json": "Most popular articles published on the dev.to",
  "data/redirect-devtop/2021/11/891588.json": "As a beginner in web development, you may always think about how to actually put a website you made,...",
  "data/redirect-devtop/2021/11/893720.json": "In this article I will show you how you can create a Drawing/Pain APP using JavaScript and HTML5...",
  "data/redirect-devtop/2021/11/891455.json": "Learning to become a Smart Contract and Blockchain Developer can seem like a daunting task, but it...",
  "data/redirect-devtop/2021/11/892323.json": "As a Django backend developer you might need to collaborate with a frontend dev who uses react or you...",
  "data/redirect-devtop/2021/11/893373.json": "CSS is weird. It's neither a programming language nor a design program such as Photoshop. It can be...",
  "data/redirect-devtop/2021/11/890961.json": "A general situation that we all might face while going through websites/apps is to wait for some...",
  "data/redirect-devtop/2021/11/893601.json": "Quick note! If you'd like to experience this post interactively, go to...",
  "data/redirect-devtop/2021/11/894005.json": "Today I will share with you some repository Github that will help you to be more efficient for every...",
  "data/redirect-devtop/2021/11/893700.json": "I'm sure this happens to everyone sometimes. You accidentally pushed a file with secrets or a...",
  "data/redirect-devtop/2021/11/893613.json": "Cover photo by Léonard Cotte on Unsplash.  This article contains a list of tips and best practices...",
  "data/redirect-devtop/2021/11/891248.json": "When engineering a new SaaS app, how you plan to handle customer data tenancy is usually one of the...",
  "data/redirect-devtop/2021/11/893095.json": "There are times when you might feel like reaching for the mouse to execute a certain task. But we all...",
  "data/redirect-devtop/2021/11/894666.json": "In this article, we will create a tap bar that you can use in your mobile projects. Let's first look...",
  "data/redirect-devtop/2021/11/892819.json": "An introduction to Pulumi ",
  "data/redirect-devtop/2021/11/892781.json": "With the multiplication of saas (service as a software) these last years and the security problems...",
  "data/redirect-devtop/2021/11/892615.json": "Python is one of the most popular and friendly programming languages, I learn Python myself a few...",
  "data/redirect-devtop/2021/11/894371.json": "Hi guys! In this post we will be learning what the useRef and useState hooks are, their differences...",
  "data/redirect-devtop/2021/11/893133.json": "Hello everyone, I have accumulated in my observations a lot of useful tips on how to start learning...",
  "data/redirect-devtop/2021/11/894621.json": "What is HTML All The Things   HTML All The Things is a web development podcast and...",
  "data/redirect-devtop/2021/11/893100.json": "While I was in bootcamp in 2020, I built REST APIs using JavaScript and Python.  Recently, using...",
  "data/redirect-devtop/2021/11/893032.json": "Sliders and Carousels   Sliders and carousels are on most websites used for presenting all...",
  "data/redirect-devtop/2021/11/894373.json": "JavaScript is one of the most popular languages you can learn. As many people say: “If you’re going...",
  "data/redirect-devtop/2021/11/892847.json": "I've been using Tailwind CSS for quite a while now and although I love working with the utility...",
  "data/redirect-devtop/2021/11/894894.json": "Hello Everyone,  The difference between for-of and for-in loop really troubled me when I was learning...",
  "data/redirect-devtop/2021/11/892632.json": "Intro   When it comes to version control systems, there are few software that can beat GIT...",
  "data/redirect-devtop/2021/11/893643.json": "If you are a newbie to programming and JavaScript, you might be confused about which conditional...",
  "data/redirect-devtop/2021/11/895249.json": "In this article you will learn how to create image sliders using html and css. Earlier I have shared...",
  "data/redirect-devtop/2021/11/895201.json": "Full responsive multipage educational website LMS website with HTML CSS &amp; JavaScript. This...",
  "data/redirect-devtop/2021/11/890206.json": "Kubernetes is complex, as accepted by Google itself. If you need more proof, here is an interesting...",
  "data/redirect-devtop/2021/11/894427.json": "The os module is a part of the standard library, or stdlib, within Python 3.  Python os module...",
  "data/redirect-devtop/2021/11/893900.json": "Introduction   Finding the proper treatment, especially drug treatment, can be a difficult...",
  "data/redirect-devtop/2021/11/893146.json": "This is an opinionated take on when to use each CSS unit, feel free and encouraged to disagree and...",
  "data/redirect-devtop/2021/11/887762.json": "As a huge Vue enthusiast, I am always on the hunt for high-quality templates, themes, and resources...",
  "data/redirect-devtop/2021/11/883991.json": "I see a lot of programming beginners doing webdev-projects building skill bars. When I was starting...",
  "data/redirect-devtop/2021/11/893528.json": "TLDR   Technical design documents (aka tech design docs or tech specs) are a great way of...",
  "data/redirect-devtop/2021/11/893154.json": "A curated list with open-source Flask Bootstrap Templates crafted on top of modern UI kist - all free, released under the MIT License on Github.",
  "data/redirect-devtop/2021/11/895165.json": "Today, many website owners want online payment gateways, especially as the industry has developed by...",
  "data/redirect-devtop/2021/11/895169.json": "Introduction   When images are fetched from API's we simply get the images via URLs and...",
  "data/redirect-devtop/2021/11/894597.json": "This post was originally written by me for CodeCast.   Whether you're just beginning your career, or...",
  "data/redirect-devtop/2021/11/896421.json": "The cloud’s scalability is both a blessing and a curse. Sure, you can experiment with new ideas...",
  "data/redirect-devtop/2021/11/895178.json": "In this blog, you will learn how to add a glass effect with Html &amp; CSS. You are going to learn...",
  "data/redirect-devtop/2021/11/894612.json": "Let's say we want to log obj inside this .map() function here:    const arr = [   { val: 1 },   {...",
  "data/redirect-devtop/2021/11/895754.json": "Transitional JavaScript Apps? What? Well honestly I'm not sure I know completely myself. It is an...",
  "data/redirect-devtop/2021/11/894655.json": "TLDR   With the evolution of AI comes many tools for product developers. AI isn’t replacing...",
  "data/redirect-devtop/2021/11/889603.json": "When it comes to Tailwind CSS containers, a lot of people will write max-w-screen-xl mx-auto px-4...",
  "data/redirect-devtop/2021/11/894590.json": "An Angular application that demonstrates best practices for user authentication flow.  By...",
  "data/redirect-devtop/2021/11/895436.json": "In this article, we will create a tap bar that you can use in your mobile projects. Let's first look...",
  "data/redirect-devtop/2021/11/896026.json": "Introduction   I know, calling APIs and fetching them can be really tough for beginners. It...",
  "data/redirect-devtop/2021/11/892782.json": "Responsive personal portfolio website with html css js  In this video series,  I will show you...",
  "data/redirect-devtop/2021/11/896376.json": "When it comes to setting the type of cursor we mostly use pointer eg.    .btn:hover{     cursor:...",
  "data/redirect-devtop/2021/11/894956.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/11/895218.json": "Welcome to part 2 of this series. Here we'll be creating the  api for a Notes application and also...",
  "data/redirect-devtop/2021/11/895441.json": "In this article I am going to show you how you can create this image color picker using JavaScript...",
  "data/redirect-devtop/2021/11/896108.json": "Join me in this post as I attempt to fix an elusive bug using tests to first spot the issue and then...",
  "data/redirect-devtop/2021/11/896144.json": "Windows 12 ui Design using HTML,CSS, JS  Hey Devs, From few days after making Windows 11 design i...",
  "data/redirect-devtop/2021/11/895294.json": "Hey guys, in this article, I will be going over some of the major changes that happened with Selenium...",
  "data/redirect-devtop/2021/11/896448.json": "Hello devs,  So this is a follow up of my previous post about the remaking of windows 11 in...",
  "data/redirect-devtop/2021/11/896843.json": "A quick tutorial on the future of website layouts.   Grid layouts are fundamental to the...",
  "data/redirect-devtop/2021/11/896826.json": "I will share my code here for better understanding the core...",
  "data/redirect-devtop/2021/11/896809.json": "Hello everyone! 💙  I remember once reading somewhere that the best way to be good at web development...",
  "data/redirect-devtop/2021/11/896344.json": "That might sound like a clickbait title, but it really isn't. You have with 99.9999% certainty helped...",
  "data/redirect-devtop/2021/11/893033.json": "Overview   One of my favorite components is undoubtedly cards and the reasons are very...",
  "data/redirect-devtop/2021/11/896081.json": "What is CSS Grid?   CSS Grid Layout is a two-dimensional grid-based layout system that is...",
  "data/redirect-devtop/2021/11/897489.json": "In this article, we will create a cool dashboard side menu that you can use in your web projects....",
  "data/redirect-devtop/2021/11/897430.json": "Learn how to correctly implement auto-logout logic in React",
  "data/redirect-devtop/2021/11/897266.json": "Creating a game with javascript is the most fun way to learn. It will keep you motivated and that is...",
  "data/redirect-devtop/2021/11/897308.json": "I made a mistake in my commit, how do I fix it ?  My commit history is a mess, how do I make it...",
  "data/redirect-devtop/2021/11/896688.json": "Ughh… why does form code in React always get so messy?  It starts out simple: a &lt;form&gt;...",
  "data/redirect-devtop/2021/11/895902.json": "The Visitor Pattern isn't used often. This is because there are few situations in which it is...",
  "data/redirect-devtop/2021/11/897567.json": "One of the member in webmatrices forum asked \"How do I make sure that the API I built is secure from...",
  "data/redirect-devtop/2021/11/897589.json": "\"Actually, I am thinking that if we can use other open-source projects and software to make money. Is...",
  "data/redirect-devtop/2021/11/896525.json": "Today I am going to teach you how to host website on google drive with custom free domain with free...",
  "data/redirect-devtop/2021/11/886782.json": "The UK coronavirus dashboard is the primary data reporting service for the COVID-19 pandemic in the...",
  "data/redirect-devtop/2021/11/895908.json": "In this article, we will use any video as the background of the text. As you may have already know...",
  "data/redirect-devtop/2021/11/897427.json": "Serie of videos about Docker. Explaining in a visual way Docker principles.",
  "data/redirect-devtop/2021/11/896670.json": "Firstly, what is a framework? A framework is essentially a platform that allows developers to build...",
  "data/redirect-devtop/2021/11/897669.json": "Hello, I am back with a new amazing article on Toggle Dark / Light Mode   Let's get started 🚀       ...",
  "data/redirect-devtop/2021/11/897584.json": "The Document Object Model (DOM) is one of the fundamental concepts of web development, but it is...",
  "data/redirect-devtop/2021/11/896842.json": "Nowadays we are using docker a lot in web development. It's easy to use, great in scaling, and gives...",
  "data/redirect-devtop/2021/11/897852.json": "Your complete guide to become a certified Spring Developer Professional in 2022 with resources like books, courses, mock tests and tutorials",
  "data/redirect-devtop/2021/11/897862.json": "Hello everyone,  We all need help when we are programming and we as a programmer are always waiting...",
  "data/redirect-devtop/2021/11/897867.json": "How to create a dynamic image placeholder?             TLDR   Check the full code here     ...",
  "data/redirect-devtop/2021/11/897812.json": "50 Ways You can Improve as a Programmer ",
  "data/redirect-devtop/2021/11/897928.json": "I am an extremely heavy user of YouTube and I decided to pay for YouTube Premium since last month...",
  "data/redirect-devtop/2021/11/890925.json": "There are plenty of articles and blogs that contain useful information on how to do things the right...",
  "data/redirect-devtop/2021/11/892301.json": "Hi Everyone!  Today, we will be walking through how to build a functional, yet very simple search bar...",
  "data/redirect-devtop/2021/11/897653.json": "In this article you will learn how to create Todo List using JavaScript. JavaScript Todo List helps...",
  "data/redirect-devtop/2021/11/896415.json": "The GitHub repository \"bulletproof-react\", which is published as an example of React application...",
  "data/redirect-devtop/2021/11/896806.json": "Yes I know, Higher Order Function seems a little bit daunting at first.   Higher order? What does...",
  "data/redirect-devtop/2021/11/898341.json": "Drawing an animated 3D store front with CSS (with video and demo)",
  "data/redirect-devtop/2021/11/897989.json": "E-Learning Websites    W3School freeCodeCamp GeeksforGeeks Udacity Udemy,...",
  "data/redirect-devtop/2021/11/898084.json": "Originally published on my blog.   Spring Boot is a more user-friendly version of the Spring...",
  "data/redirect-devtop/2021/11/898531.json": "Link: https://m4tt72.com           Why?   I'm a Linux enthusiast, and I tried creating something...",
  "data/redirect-devtop/2021/11/898512.json": "Hello Everyone,  In this post we will explore the HOF (Higher order function), Callbacks, and the...",
  "data/redirect-devtop/2021/11/898363.json": "The Why   I mentor at a few different online courses, and a common theme I've noticed across...",
  "data/redirect-devtop/2021/11/898018.json": "React Router version 6 was released recently, and it is important for us to understand the changes as...",
  "data/redirect-devtop/2021/11/897051.json": "Hello everyone from Siberia ❄!  TLDR This post is not about how to use Error Boundaries, but why we...",
  "data/redirect-devtop/2021/11/897599.json": "In my last post(Deep dive into Node.js Architecture), we learnt about the internals of Node.js and...",
  "data/redirect-devtop/2021/11/898816.json": "Use Medusa and Strapi to power your commerce setup for a full open-source headless solution. In...",
  "data/redirect-devtop/2021/11/897886.json": "So you're just starting out and you want to learn a new programming language. But the problem is,...",
  "data/redirect-devtop/2021/11/897842.json": "I mean, aren't they just beautiful to look at? I mean, look at them:             Amazing, aren't...",
  "data/redirect-devtop/2021/11/898224.json": "Mac OS emulator on the Web  Hi, I want to introduce my project, which I call Mac OS emulator on the...",
  "data/redirect-devtop/2021/11/899616.json": "Do you want to make a career change to something more lucrative? Or have you been putting in a lot of...",
  "data/redirect-devtop/2021/11/898848.json": "Hello all👋,  In this series we will see a lot of question that are asked in javascript interviews so...",
  "data/redirect-devtop/2021/11/891082.json": "Lately I've been involved in reviewing services developed using 'serverless' that had been struggling...",
  "data/redirect-devtop/2021/11/899036.json": "Pipeline operators are an upcoming feature to Javascript which gives us another way to pass values...",
  "data/redirect-devtop/2021/11/899442.json": "Ever since the Clubhouse app rose to fame, the popularity of drop-in audio-only rooms has been...",
  "data/redirect-devtop/2021/11/897860.json": "What is the localStorage?   The localStorage is a read-only property of the window interface...",
  "data/redirect-devtop/2021/11/899576.json": "CSS animations are a module that lets you animate the element which changes the element from one...",
  "data/redirect-devtop/2021/11/899684.json": "I've been using Tailwind CSS quite a lot lately for my web projects, however, one disadvantage that...",
  "data/redirect-devtop/2021/11/899244.json": "The concept of a closure in JavaScript can be confusing at first, this article sheds light on what it means!",
  "data/redirect-devtop/2021/11/899718.json": "It took me a while of looking around StackOverflow and such to find out how to send browser...",
  "data/redirect-devtop/2021/11/899646.json": "In this video, we will see how to create an interactive landing page with three js. We will add an...",
  "data/redirect-devtop/2021/11/898230.json": "Over the years, I’ve often found myself wishing for a mentor much more often than I’ve actually had...",
  "data/redirect-devtop/2021/11/899399.json": "Open-source seed project crafted with Laravel and React on top of Purity Dashboard, a pixel-perfect Chakra UI design. The product is published under the MIT License on Github.",
  "data/redirect-devtop/2021/11/899864.json": "Web development refers to the act of building and maintaining websites; these websites can range in...",
  "data/redirect-devtop/2021/11/899673.json": "How to create Responsive clipboard landing page with html css Frontend mentor  In this tutorial,...",
  "data/redirect-devtop/2021/11/899012.json": "Welcome everyone and a great morning to you all. Today we will continue the freecodecamp lessons...",
  "data/redirect-devtop/2021/11/897913.json": "Olá pessoal, neste artigo vou explicar um pouco sobre o micro front-end e as vantagens que ele...",
  "data/redirect-devtop/2021/11/898481.json": "Functional programming provides many useful concepts. One of these concepts is pipeline operator and...",
  "data/redirect-devtop/2021/11/896088.json": "Introduction   I created a crash course type video on using D3 and React.js. You can see the...",
  "data/redirect-devtop/2021/11/900694.json": "It takes time to build an appealing and functional website. Web developers are dedicated to...",
  "data/redirect-devtop/2021/11/899014.json": "If you want to improve the user experience on your website, you should implement a copy to clipboard...",
  "data/redirect-devtop/2021/11/900342.json": "I hope you're enjoying the Actions Hackathon 2021. I'm impressed by the participants' submissions...",
  "data/redirect-devtop/2021/11/899410.json": "All code from this tutorial as a complete package is available in this repository.  If you are...",
  "data/redirect-devtop/2021/11/900250.json": "Tailwind CSS comes with \"an opinionated set of base styles\" called Preflight. A helpful CSS reset...",
  "data/redirect-devtop/2021/11/899909.json": "Hi everyone,  I’m Haris and I’m a newbie to the developer realm. Today I'd like to share my favourite...",
  "data/redirect-devtop/2021/11/899337.json": "Are you naming variables too casually, or writing code without caring about the feelings of...",
  "data/redirect-devtop/2021/11/899400.json": "To learn closures, you need to understand how scope works.  In JavaScript, we have global and local...",
  "data/redirect-devtop/2021/11/899435.json": "Wondered on the GitHub IOS mobile app to check on some of my projects and stumbled upon the ability...",
  "data/redirect-devtop/2021/11/900270.json": "Prólogo   A pergunta mais constante entre os desenvolvedores que estão querendo sair do...",
  "data/redirect-devtop/2021/11/895567.json": "In this tutorial, you will learn how to work in a team with a central repository on GitHub. You will...",
  "data/redirect-devtop/2021/11/900705.json": "Hey guys 👋🏻, In this post, let us talk about Virtual DOM in React.js.  For this post we will...",
  "data/redirect-devtop/2021/11/899844.json": "What are React Hooks ?   React hooks are nothing but JavaScript functions that let you hook...",
  "data/redirect-devtop/2021/11/899855.json": "I've been using flex more and haven't really used float or grid. I think I should try to use them...",
  "data/redirect-devtop/2021/11/900459.json": "If you're looking to build no-code tools like FormBlob, one must-have feature is the ability to undo...",
  "data/redirect-devtop/2021/11/892403.json": "Here is a list of javascript operator and how to use it!  You should mark this and use it when you...",
  "data/redirect-devtop/2021/11/900744.json": "Author: Sergey Kononenko  The key concept of load testing is automating everything that can be...",
  "data/redirect-devtop/2021/11/901789.json": "After my first \"draft\" of Livaï Ackerman, I am back with another CSS art and this time I am exploring...",
  "data/redirect-devtop/2021/11/901186.json": "ockam-network        /          ockam                       ...",
  "data/redirect-devtop/2021/11/899924.json": "I created an oddly satisfying CSS animation on codepen, using only rotations. It turns out it went a...",
  "data/redirect-devtop/2021/11/901188.json": "For folks who still work with jQuery, for personal or professional projects, what is the overall...",
  "data/redirect-devtop/2021/11/900473.json": "Disclaimer   This is just my opinion as a newbie frontend engineer who was exhausted from...",
  "data/redirect-devtop/2021/11/899691.json": "There are many fantastic websites for designer on the internet.            The ones i will...",
  "data/redirect-devtop/2021/11/901834.json": "Motion One is a new animation library built on the Web Animations API. If you have used Popmotion or...",
  "data/redirect-devtop/2021/11/902808.json": "The pay-per-use model of the public cloud seemed too good to be true. And you probably quickly caught...",
  "data/redirect-devtop/2021/11/899926.json": "const clean = arr.filter(item =&gt; !!item || item === 0 || item === false);        Enter fullscreen...",
  "data/redirect-devtop/2021/11/901537.json": "Typescript 4.5 was just released and one of the features that stood out to me is the Template String...",
  "data/redirect-devtop/2021/11/901705.json": "Strapi will be used in this project. It saves our data in a JSON file and return data with JSON...",
  "data/redirect-devtop/2021/11/901017.json": "Isn't it wonderful how VS Code grays out obsolete lines of code? Oops, my return statement is on line...",
  "data/redirect-devtop/2021/11/901794.json": "Authentication and Authorization are costly affairs for organizations when it comes to their security...",
  "data/redirect-devtop/2021/11/899149.json": "We've just released v0.9.0 of the Azure Static Web Apps extension for VS Code. This release includes...",
  "data/redirect-devtop/2021/11/901467.json": "Javascript has some handy methods which is usefull to iterate arrays.The most two common methods is...",
  "data/redirect-devtop/2021/11/901827.json": "Useful Tmux Configuration Examples",
  "data/redirect-devtop/2021/11/901268.json": "Welcome, dear reader! If you're reading this, you're probably one of the many people who find...",
  "data/redirect-devtop/2021/11/902829.json": "In this post join me as I create a React Custom Hook which will encapsulate the logic behind a simple...",
  "data/redirect-devtop/2021/11/895610.json": "In this first part on Rust we'll cover why Rust and how to build your first program.",
  "data/redirect-devtop/2021/11/901513.json": "Hello World!  JavaScript is the most hated as well as the most loved programming language in the...",
  "data/redirect-devtop/2021/11/899989.json": "In this article, we are going to look at the different types of web storage such as Local Storage,...",
  "data/redirect-devtop/2021/11/902888.json": "Hello All, This happen to be my first post since I join this forum in 2019 and I’m happy to share...",
  "data/redirect-devtop/2021/11/902625.json": "So not too long ago the library React Router has updated to version 6 and with that it came with...",
  "data/redirect-devtop/2021/11/902911.json": "Over the past two weeks, we have been working hard on migrating parts of Medusa's codebase to...",
  "data/redirect-devtop/2021/11/896120.json": "Save you time and use these resources to perfect your Git and GitHub knowledge.  This week, I finally...",
  "data/redirect-devtop/2021/11/903350.json": "[Clique aqui para ler em português]  Let’s create an autocomplete so that clicking on an input...",
  "data/redirect-devtop/2021/11/901890.json": "These are the list of some top 5 growing programming, gamedev, android dev and webdev related forum...",
  "data/redirect-devtop/2021/11/903123.json": "In this blog you will learn how to add a video background to your landing page to make it more...",
  "data/redirect-devtop/2021/11/901025.json": "Full-stack project that uses a modern React UI powered by a simple Django API Server. ",
  "data/redirect-devtop/2021/11/903954.json": "The Problem   When it comes to viewing what's trending on twitter of some other location...",
  "data/redirect-devtop/2021/11/901739.json": "When jQuery came out it really was spectacular, it gave developers a common Vernacular, But times...",
  "data/redirect-devtop/2021/11/902709.json": "Hi dev.to!   I'm a software development student at Developers Institute NZ, and this is my first...",
  "data/redirect-devtop/2021/11/901753.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/11/903596.json": "Hey everyone, this is just an article portraying some basics of Java. Those who are new to Java,...",
  "data/redirect-devtop/2021/11/903607.json": "Hi folks, hope you are doing well. In this post I am going to share you some tips that I personally...",
  "data/redirect-devtop/2021/11/902899.json": "Yep we are creating a URL expander not a URL shortener     There are many tools like bitly,...",
  "data/redirect-devtop/2021/11/902923.json": "How to create responsive loopstudios landing page with html css js Frontend mentor  In this...",
  "data/redirect-devtop/2021/11/902848.json": "My favorite online courses to learn Python in depth for beginners and experienced developers. ",
  "data/redirect-devtop/2021/11/903764.json": "Hello, everyone  Nomadev  here, back with another blog on tech. Today I will be sharing the top 10...",
  "data/redirect-devtop/2021/11/902814.json": "Overview   One of the most important components to communicate something more effectively...",
  "data/redirect-devtop/2021/11/902841.json": "I know what you're thinking, building VR apps requires a PHD in Mathematics and Computer Graphics,...",
  "data/redirect-devtop/2021/11/904055.json": "Here is a crash course (series of articles) that will allow you to create an API in Python with...",
  "data/redirect-devtop/2021/11/904201.json": "First let us get over with the debate of Authentication vs Authorization.          ...",
  "data/redirect-devtop/2021/11/904223.json": "Node.JS is a technology that has transformed JavaScript, which is familiar to all web developers,...",
  "data/redirect-devtop/2021/11/897847.json": "Introduction   In this article, we will learn and use Object-Oriented Programming (OOP)...",
  "data/redirect-devtop/2021/11/903950.json": "Learning is by no means a linear process, even in hard sciences like Math.  It is very common to see...",
  "data/redirect-devtop/2021/11/903093.json": "In this second part, you'll learn how to work with variables, declare, assign them values and so on.",
  "data/redirect-devtop/2021/11/903928.json": "Recently I noticed something a little different in Chrome, all emojis are now outlines only (and the...",
  "data/redirect-devtop/2021/11/903884.json": "Mozilla Firefox    Mozilla Firefox is an open source web browser developed by Mozilla...",
  "data/redirect-devtop/2021/11/903190.json": "How to create sticky columns in Angular using directives. Implementing tables with sticky columns can...",
  "data/redirect-devtop/2021/11/904387.json": "So this is the part 2 of the User Authentication with NodeJS. You can check out the Part - 1 here. In...",
  "data/redirect-devtop/2021/11/903570.json": "Linux is a very popular and interesting operating system (OS), especially for programmers. The Linux...",
  "data/redirect-devtop/2021/11/899406.json": "There are different ways to connect react backend and NodeJS frontend. In this blog, I am going to...",
  "data/redirect-devtop/2021/11/903753.json": "Ok. Let's get this straight. PHP is not dead. It's not going to die anytime soon. Why? PHP released a...",
  "data/redirect-devtop/2021/11/904363.json": "As the saying goes:   Where attention goes, money follows   It is of utmost importance to effectively...",
  "data/redirect-devtop/2021/11/904550.json": "Docker adoption rises constantly 📈 and many are familiar with it, but not everyone is using Docker...",
  "data/redirect-devtop/2021/11/903704.json": "A complete guide to pass Azure Fundamentals or AZ-900 Certification exam and start your career in cloud computing as Certified Azure Professional in 2022.",
  "data/redirect-devtop/2021/11/904788.json": "Recently, I read an article outlining how to create CSS pixel art with box shadows. I thought it was...",
  "data/redirect-devtop/2021/11/899862.json": "As Halloween has come and gone, Thanksgiving and Black Friday are upon us. The holiday season is...",
  "data/redirect-devtop/2021/11/904555.json": "Save anything from web directly to your Notion page in one click.",
  "data/redirect-devtop/2021/11/904208.json": "Thinking these days how we probably started to value more building blocks of our existence. As it...",
  "data/redirect-devtop/2021/11/897076.json": "- English Version -      There are many pages wich explain what the Spread Operator (also...",
  "data/redirect-devtop/2021/11/903346.json": "After several weeks of writings about Kubernetes, I want to write a short post about React, about...",
  "data/redirect-devtop/2021/11/903688.json": "Heya Coders! What's poppin'?  Today, I'll be talking about which is better: React or Angular. Feel...",
  "data/redirect-devtop/2021/11/903766.json": "I found myself out of work for the last month and decided to use my time with my partner to build a...",
  "data/redirect-devtop/2021/11/900312.json": "Learn how to structure an API with Golang, dockerize it, setup VSCode debugger and improve your knowledge of the language",
  "data/redirect-devtop/2021/11/904635.json": "Building a software in a team requires a clear understanding and proper management of the codebase....",
  "data/redirect-devtop/2021/11/902261.json": "Let's talk about the infer keyword in TypeScript. I believe, there're a lot of developers, who've...",
  "data/redirect-devtop/2021/11/903578.json": "One of the most important things, when you're building a website, is ensuring its good performance....",
  "data/redirect-devtop/2021/11/904684.json": "Hello,  How are you all I am writing this post after so long break. Today I Created a simple...",
  "data/redirect-devtop/2021/11/905141.json": "When learning any programming language, you will come across the concept of control flow. This is...",
  "data/redirect-devtop/2021/11/904802.json": "Simple Notification Service and Simple Queue Service are the managed services which are offered by...",
  "data/redirect-devtop/2021/11/904347.json": "Salam and holla, amigos!  This article can be used other than React as well, but I will focused on...",
  "data/redirect-devtop/2021/11/905660.json": "In this article you will learn how to create Responsive Sidebar Menu using HTML CSS JavaScript....",
  "data/redirect-devtop/2021/11/904631.json": "So I've been wanting to write a post here for a while and I've been thing of the perfect article to...",
  "data/redirect-devtop/2021/11/905461.json": "This article was originally published on Dasha.  In case you are wondering, Dasha is a...",
  "data/redirect-devtop/2021/11/905344.json": "Introduction   In my previous tutorials, we showed you how to use our generative art...",
  "data/redirect-devtop/2021/11/904992.json": "Over two years ago (oof), I posted a walkthrough of my Rust implementation of todo-mvp by...",
  "data/redirect-devtop/2021/11/905286.json": "These are the best online courses to learn HTML and CSS for beginners from Udemy, Coursera, Pluralsight and edx to learn web development online in 2022. ",
  "data/redirect-devtop/2021/11/904690.json": "Hello devs!  About two months ago, I released the first version of Xplorer and wrote a post about...",
  "data/redirect-devtop/2021/11/904460.json": "With GitHub Actions, you can automate, customize, and execute your software development workflows...",
  "data/redirect-devtop/2021/11/906807.json": "Anyone who has ever worked with manual cost management tools knows how time-consuming they can be....",
  "data/redirect-devtop/2021/11/906353.json": "One of the most widely used JavaScript libraries for developing dynamic web apps is React. It has a...",
  "data/redirect-devtop/2021/11/906298.json": "Hi folks, I am Yash Makan and in today's blog, we are going to talk about one-liners in python. I...",
  "data/redirect-devtop/2021/11/905856.json": "Hydration uses client-side JavaScript to convert static HTML pages into dynamic web pages. Partial hydration aims to hydrate only the components of an application that need to be interactive.",
  "data/redirect-devtop/2021/11/903512.json": "In the previous part of this tutorial, we learned how Harry and Hermione decided to build a SaaS app...",
  "data/redirect-devtop/2021/11/906486.json": "You complete guide to crack AWS Certified Solution Architect associate exam and become a certified AWS Solution architect in 2022. ",
  "data/redirect-devtop/2021/11/906160.json": "Initial state   Having worked with Vue for the majority of the past 3 years, I got very used...",
  "data/redirect-devtop/2021/11/906301.json": "With the advent of tools that make building an e-commerce site or basic portfolio website simpler...",
  "data/redirect-devtop/2021/11/906282.json": "It all began when I failed miserably with my bulky monolithic web application which I developed for...",
  "data/redirect-devtop/2021/11/904846.json": "Watch Senior Principle Developer Karan Singh talk about the recipe to level up your software...",
  "data/redirect-devtop/2021/11/905207.json": "The idea of writing immutable JavaScript is becoming more and more popular. Primitive data types in...",
  "data/redirect-devtop/2021/11/900104.json": "Monsterjs Release  ",
  "data/redirect-devtop/2021/11/906804.json": "Hey guys 👋🏻, In this article, let us understand the roadmap that will help you in becoming a Frontend...",
  "data/redirect-devtop/2021/11/906494.json": "How to create animated content card using only html and css  In this video,  I will show you how...",
  "data/redirect-devtop/2021/11/906819.json": "You've been working on your task for two weeks, fixing bugs, adding features, writing hundreds and...",
  "data/redirect-devtop/2021/11/906786.json": "Whenever I encounter null or undefined, I get incredibly confused by how each data type is used in...",
  "data/redirect-devtop/2021/11/906100.json": "What is Modern Angular Tooling?   With the Angular CLI no longer including a complete...",
  "data/redirect-devtop/2021/11/907287.json": "Clean code is not just code that works, but rather code that can be easily read, reused, and...",
  "data/redirect-devtop/2021/11/905937.json": "What is useEffect?   useEffect is a react built-in hook that allows us to run code on the...",
  "data/redirect-devtop/2021/11/906734.json": "3 ways to center a div in HTML/CSS!!           With Position      /* Using positions */  .parent {   ...",
  "data/redirect-devtop/2021/11/907911.json": "Hey everyone, here's another VS Code extensions post that'll help you boost your productivity and...",
  "data/redirect-devtop/2021/11/906302.json": "What is Remix?   Remix is a relatively \"new\" React framework which was open sourced on 23rd...",
  "data/redirect-devtop/2021/11/907431.json": "Hello Everyone,  In this post we will explore the object oriented programming paradigm in JavaScript....",
  "data/redirect-devtop/2021/11/904451.json": "This article isn't going to teach you about the latest trends in frontend development. Or look in...",
  "data/redirect-devtop/2021/11/907412.json": "Overview    I have covered here 20+ design patterns explanations in javascript. We will be...",
  "data/redirect-devtop/2021/11/904072.json": "As a developer, my assumption is:    You are working with Git literally every hour.        Enter...",
  "data/redirect-devtop/2021/11/907388.json": "Hello, buddies! While playing with Python for a time, I found some quite interesting modules that are...",
  "data/redirect-devtop/2021/11/906552.json": "While building applications you would have noticed yourself using Array's a lot. So let's take a look...",
  "data/redirect-devtop/2021/11/907710.json": "Maybe you're a newbie dev, in a coding academy, or newly graduated. Or perhaps you're old and cynical...",
  "data/redirect-devtop/2021/11/907405.json": "The modern era of web development is fascinating. Plenty of frameworks and libraries to keep us...",
  "data/redirect-devtop/2021/11/908278.json": "Hey Dev friends! Forgive the shameless promotion, I'm so proud of my teammates and want to share, and...",
  "data/redirect-devtop/2021/11/905848.json": "Something that's being seen and felt throughout the technology space in today's world is how fast...",
  "data/redirect-devtop/2021/11/906312.json": "Introduction   I was working on a project that uses React and Material UI. For this project,...",
  "data/redirect-devtop/2021/11/908214.json": "JavaScript is a programming language used to develop dynamic and interactive websites. There are over...",
  "data/redirect-devtop/2021/11/908584.json": "Your complete guide to become a professional frontend developer in 2021. Learn these skills, tools, and tech for frontend development in 2022",
  "data/redirect-devtop/2021/11/907046.json": "What Is Memoization?   Memoization is an approach to designing effective algorithms by...",
  "data/redirect-devtop/2021/11/907047.json": "A curated list with nice BF offers for 2021",
  "data/redirect-devtop/2021/11/907945.json": "Create audio apps with flexible in-call user permissions",
  "data/redirect-devtop/2021/11/907888.json": "In Tolgee platform, we manage translations. So our most important view is a list of translations,...",
  "data/redirect-devtop/2021/11/906917.json": "Here is the story. Last year, I went to an interview (for an Angular position) and the interviewer...",
  "data/redirect-devtop/2021/11/908815.json": "In this blog tutorial, we are going to set up and build full-stack notebook applications using...",
  "data/redirect-devtop/2021/11/906328.json": "Hello friends! Hope you all are doing great.  Welcome back to my series of posts where I give 10 JS...",
  "data/redirect-devtop/2021/11/906785.json": "From outline icons to switch designs, the UIs of major OSes are all starting to...",
  "data/redirect-devtop/2021/11/908538.json": "Drag and drop is a very useful tool in applications as it can simplify a large part of the process...",
  "data/redirect-devtop/2021/11/908510.json": "What will be covered here?   We will be covering 10 essential visual studio code extensions...",
  "data/redirect-devtop/2021/11/909464.json": "Notion is pretty popular these days and I've had it for almost 2 years now. I've been experimenting...",
  "data/redirect-devtop/2021/11/908047.json": "This article was originally written by me for CodeCast.   If you’re just entering the world of...",
  "data/redirect-devtop/2021/11/909201.json": "If you were building an application consisting of a user interface and an API, what technology...",
  "data/redirect-devtop/2021/11/909507.json": "Javascipt is a great language and i believe every web developer in todays world should...",
  "data/redirect-devtop/2021/11/909054.json": "In one of my previous article I have showed you how to create a paint app using JavaScript. And in...",
  "data/redirect-devtop/2021/11/909320.json": "Redux a popular React and React Native state management library. Here is all component of redux in...",
  "data/redirect-devtop/2021/11/907924.json": "Managing a project with dependencies, metadata and more is made easy with the very competent tool Cargo",
  "data/redirect-devtop/2021/11/908376.json": "A reminder for those of you participating in the GitHub Actions Hackathon this year — or those considering it! ",
  "data/redirect-devtop/2021/11/908165.json": "Do you know that situation when you have a huge file with a lot of lines in vs code and you jump from...",
  "data/redirect-devtop/2021/11/907456.json": "In the last decade, there has been a change in how we use our computers. Web 2.0 was all about social...",
  "data/redirect-devtop/2021/11/907296.json": "If you would like to fork this project, the code and tutorial is available on Github.  If you are...",
  "data/redirect-devtop/2021/11/909316.json": "Trending Projects is available as a weekly newsletter please sign up at Stargazing.dev to ensure you...",
  "data/redirect-devtop/2021/11/908681.json": "So, we all have worked on React or React Native for developing web and mobile applications. There are...",
  "data/redirect-devtop/2021/11/909642.json": "Hello, everyone  Nomadev  here, back with another blog on tech. Today we will be discussing in brief...",
  "data/redirect-devtop/2021/11/903086.json": "Summary.   Greeting! folks, If you don't want to save your JWT-token in the client side then...",
  "data/redirect-devtop/2021/11/909794.json": "How to create nft preview card using only html and css.     HI 👋 I'm Sadee (webdev) In this...",
  "data/redirect-devtop/2021/11/909141.json": "I built my blog with MERN (MongoDB, Express, React.js, and Node.js) stack.  It's for my portfolio. I...",
  "data/redirect-devtop/2021/11/910038.json": "JavaScript, commonly known as JS, is a server-side programming language with a high level. Because...",
  "data/redirect-devtop/2021/11/910226.json": "Structuring React applications into files and folders is an opinionated topic, because there is no...",
  "data/redirect-devtop/2021/11/910494.json": "List of essential tech skills professional developers can learn in 2021. The list include best framework, libraries, tools, and platform for Java development.",
  "data/redirect-devtop/2021/11/909155.json": "I don’t know about you, but I fall asleep every time I’m trying to read typescript documentation....",
  "data/redirect-devtop/2021/11/909829.json": "I said I wasn't going to do angry rants anymore. I really did try. But fuck me people are still...",
  "data/redirect-devtop/2021/11/909568.json": "Hi developers, I am Yash Makan and in today's post, we are going to discuss 4 platforms where you can...",
  "data/redirect-devtop/2021/11/910552.json": "Hi folks, hope you are doing well. In this post, I am going to show you how to get started in open...",
  "data/redirect-devtop/2021/11/908823.json": "Whenever you get a new message the chat feed automatically scrolls to the bottom. This guide explains how you can do it in just 1 line of code.",
  "data/redirect-devtop/2021/11/909071.json": "What is Sass(SCSS)?   Sass is a preprocessor scripting language that is interpreted or...",
  "data/redirect-devtop/2021/11/908733.json": "To LeetCode or not to LeetCode? What if you don’t want to practice 100s of coding questions before...",
  "data/redirect-devtop/2021/11/896958.json": "Introduction   Libraries help us to code faster through their predefined classes for...",
  "data/redirect-devtop/2021/11/909593.json": "Goal: Make our code resilient against changes over time             A brief introduction to...",
  "data/redirect-devtop/2021/11/910652.json": "Let’s create from from scratch, a Simple Dropdown Menu Bar using just HTML &amp; CSS,...",
  "data/redirect-devtop/2021/11/909848.json": "In this article, we will set some CRUD API using:   NestJS (NodeJS Framework) Mongoose (ODM that...",
  "data/redirect-devtop/2021/11/908560.json": "FastAPI is a modern Python web framework based on standard Python type hints that makes it easy to...",
  "data/redirect-devtop/2021/11/910845.json": "A curated list with open-source templates and starters we can use in our project without an investment",
  "data/redirect-devtop/2021/11/910503.json": "Table Of Contents    App Overview Prerequisites Supabase Setup Create the Remix...",
  "data/redirect-devtop/2021/11/910314.json": "Photo by Chris Ainsworth on Unsplash  As 2022 approaches, Data Engineering is primed to be one of the...",
  "data/redirect-devtop/2021/11/910492.json": "Usernames should be formatted and they should conform to follow some validation...",
  "data/redirect-devtop/2021/11/910375.json": "Learn how to create an Instagram Navbar clone with pure HTML CSS and JavaScript!  This project is...",
  "data/redirect-devtop/2021/11/910712.json": "If you are thinking about styling the browser’s scrollbar then you are in the right place. You may...",
  "data/redirect-devtop/2021/11/911094.json": "The simplest way to pass data from a parent to a child in a React Application is by passing it on to...",
  "data/redirect-devtop/2021/11/911149.json": "Complete guide to pass the AWS Developer Associate Certification exam and become a certified AWS Developer in 2022 with links to courses, books, and practice tests",
  "data/redirect-devtop/2021/11/909457.json": "When you ship a new version for your product, the last thing you want to worry about are release...",
  "data/redirect-devtop/2021/11/911243.json": "Introduction   In a previous tutorial, we covered how to create and deploy an NFT...",
  "data/redirect-devtop/2021/11/910633.json": "Overview    I've decided to download my dev.to posts so that I can store them in git.  That...",
  "data/redirect-devtop/2021/11/910247.json": "Hello! Have you ever used style-components in a React project before? And, more generally, what are...",
  "data/redirect-devtop/2021/11/911156.json": "When working on a high throughput, low latency  system, it's important to measure the execution time...",
  "data/redirect-devtop/2021/11/911116.json": "I used to use Create React App (CRA) for building new applications (i.e. app.example.com). For...",
  "data/redirect-devtop/2021/11/911439.json": "In this article, we are gonna build a curved timeline for your website which you can use later on in...",
  "data/redirect-devtop/2021/11/911371.json": "Hello Guys,  Thank you guys for my last post response. Today I Created an Animated profile card using...",
  "data/redirect-devtop/2021/11/910487.json": "Overview   Validating user input on forms prior to submission is one of the most important...",
  "data/redirect-devtop/2021/11/911292.json": "JavaScript has grown way beyond the browser. Code School's Sergio Cruz reveals the new features,...",
  "data/redirect-devtop/2021/11/910862.json": "you are an array",
  "data/redirect-devtop/2021/11/911155.json": "&lt;1kb compiler-augmented virtual DOM. It's fast!   I initially started Million.js on a whim. I...",
  "data/redirect-devtop/2021/11/911253.json": "Hello, everyone  Nomadev  here, back with another blog on tech. So today I am here with the 5 top Vs...",
  "data/redirect-devtop/2021/11/910536.json": "Topics covered   Introduction to version control systems Git and GitHub Branching and merging How to...",
  "data/redirect-devtop/2021/11/911707.json": "A calendar widget is the most important component for events-related websites. It helps users to see...",
  "data/redirect-devtop/2021/11/909859.json": "Many modern web platforms leverage on maps and location-based features to provide services to users....",
  "data/redirect-devtop/2021/11/903345.json": "In the last episode of the Custom React Hooks series, we've implemented the useLocalStorage hook to...",
  "data/redirect-devtop/2021/11/902710.json": "Hello, wonderful DEV community!  My name is Amy, and I’m a product manager here at Forem. I started...",
  "data/redirect-devtop/2021/11/912169.json": "What is Speacode?   Speacode is a knowledge sharing platform that improves collaboration...",
  "data/redirect-devtop/2021/11/907360.json": "Clean Code by Robert C. Martin is the most recommended programming book of all time. Search any list...",
  "data/redirect-devtop/2021/11/911433.json": "It seems we have, in the web community, collectively forgotten the role of the URL in storing the...",
  "data/redirect-devtop/2021/11/908748.json": "In this blog tutorial, we will set up a full-stack app to perform CRUD operations using the MERN...",
  "data/redirect-devtop/2021/11/911549.json": "I used to use the console.log a lot. I still do, but I used to, too. However, my usage of the...",
  "data/redirect-devtop/2021/11/912152.json": "Variables in Javascript allow only one data to be stored at a time. However, given that it is often...",
  "data/redirect-devtop/2021/11/912882.json": "Hello Programmers,  Most of us are scared of algorithms, and don't ever start to learn it. But we...",
  "data/redirect-devtop/2021/11/912149.json": "Javascript is a high level language that has GC (garbage collections) being done by the modern...",
  "data/redirect-devtop/2021/11/911867.json": "When I first started working with more and more complex objects in JavaScript (such as API data), I...",
  "data/redirect-devtop/2021/11/912379.json": "\"It's not about syntax; it's about semantics.\" - Richard Feldman  This article is just a collection...",
  "data/redirect-devtop/2021/11/912070.json": "Jotai is a relatively new state management library for React. It's simple, but make no mistakes, it's...",
  "data/redirect-devtop/2021/11/911713.json": "We humans like dealing in absolutes. It's easy. Nuance is hard. Unfortunately for us, everything involves nuance.",
  "data/redirect-devtop/2021/11/909823.json": "Storybook is a UI development environment that allows developers interact with components in...",
  "data/redirect-devtop/2021/11/912405.json": "Forms are often tricky to get right with React. While there are great libraries like formik or React...",
  "data/redirect-devtop/2021/11/913705.json": "\"If you don't know all of these, don't call yourself a web developer\", followed by some list of web...",
  "data/redirect-devtop/2021/11/913134.json": "This Thanksgiving season, I'm especially grateful for Javascript. Since its announcement in December...",
  "data/redirect-devtop/2021/11/913150.json": "Quarkus, Spring Boot, MicroNaut, Vert.x, and Eclipse MicroProfile are the best Java framework for creating Microservices in Java. ",
  "data/redirect-devtop/2021/11/913172.json": "Blockchains are still prominent, and the industry is in desperate need of engineers right now. It's...",
  "data/redirect-devtop/2021/11/913533.json": "Functional components in React are most beautiful because of React Hooks. With Hooks, we can change...",
  "data/redirect-devtop/2021/11/912866.json": "If you are interested in a video version of this tutorial, check out the link below. You can follow...",
  "data/redirect-devtop/2021/11/912881.json": "Written in connection with the Write with Fauna Program.  This article focuses on the tutorial steps...",
  "data/redirect-devtop/2021/11/907419.json": "Hello, DEV community!  Today, I have a quick (but exciting!) update for those of you who write on...",
  "data/redirect-devtop/2021/11/909342.json": "Create and join a multi-participant video call in a React Native mobile app",
  "data/redirect-devtop/2021/11/912068.json": "Developers in general are in the best position to \"productize\" their work and start earning passive...",
  "data/redirect-devtop/2021/11/912036.json": "Finally DEV has an editor to make creating your MarkDown a little easier. I thought I would run it...",
  "data/redirect-devtop/2021/11/912262.json": "We released support for the new AVIF image format on the Contentful Images API at our Fast Forward...",
  "data/redirect-devtop/2021/11/913448.json": "A preloader is one of the important elements of the user-friendly interface. It indicates that...",
  "data/redirect-devtop/2021/11/913192.json": "MERN stack which stands for MongoDB, ExpressJS, ReactJS and NodeJS has become a popular choice for...",
  "data/redirect-devtop/2021/11/907604.json": "If you’re new to Ethereum development and wonder how to put the pieces together to build a...",
  "data/redirect-devtop/2021/11/888808.json": "Halo Guys 👋   In this tutorial we will show you how to add scroll the page to the top...",
  "data/redirect-devtop/2021/11/909586.json": "Hello my fellow readers! If you have really come this far in this series of posts, I would like to...",
  "data/redirect-devtop/2021/11/907580.json": "Hi 👋,  I'm Fatih, a frontend developer based in Istanbul and this is the short story of my project:...",
  "data/redirect-devtop/2021/11/911268.json": "Postman is an API platform that allows you to create and use APIs.  Postman streamlines collaboration...",
  "data/redirect-devtop/2021/11/908207.json": "When I first started working with React, I mostly used function components, especially because I read...",
  "data/redirect-devtop/2021/11/913720.json": "Lately, I've been tending to lean more towards employing a monolithic approach in system...",
  "data/redirect-devtop/2021/11/909344.json": "If you found value in this thread you will most likely enjoy my tweets too so make sure you follow me...",
  "data/redirect-devtop/2021/11/911404.json": "Hey fellow creators,  You want to add a loader to your app, but don't know where to start? Look no...",
  "data/redirect-devtop/2021/11/911395.json": "Hey fellow creators,  Learn how to use a loop in CSS with the help of the SASS preprocessor in less...",
  "data/redirect-devtop/2021/11/912375.json": "If you need the data on your page fetched, cached, and beautifully paginated for an amazing user...",
  "data/redirect-devtop/2021/11/913218.json": "React is one the biggest JavaScript frameworks, since then many react frameworks like NextJs,...",
  "data/redirect-devtop/2021/11/906450.json": "Hey fellow creators,  You don't know how to render a list with React? Jump in to learn how to do...",
  "data/redirect-devtop/2021/11/912340.json": "You've probably heard of Web3 unless you've been living under a rock. Web3 is widely regarded as the...",
  "data/redirect-devtop/2021/11/887880.json": "Back in the early days when I first started out in web development, I eventually stumbled across HTML...",
  "data/redirect-devtop/2021/11/911737.json": "The GitHub Actions Hackathon has just concluded. Congrats to everyone who submitted an Action....",
  "data/redirect-devtop/2021/11/912127.json": "CSS pseudo-elements creates a new virtual element that represents a part of the element which can be...",
  "data/redirect-devtop/2021/11/887533.json": "Organizations of all sizes have recognized that data is one of the key factors for increasing and...",
  "data/redirect-devtop/2021/11/912648.json": "In this articles I would like to share with you the process of development of the latest game that I...",
  "data/redirect-devtop/2021/11/902440.json": "Fable 3 made something I was not aware for some time, it moved to emitting ESM Modules and leaving...",
  "data/redirect-devtop/2021/11/884325.json": "You can see pretty much daily here in DEV an article about how great or how bad TypeScript is, and...",
  "data/redirect-devtop/2021/11/896950.json": "Introduction    Amazon Web Services (AWS) delivers a scalable cloud computing platform...",
  "data/redirect-devtop/2021/11/887535.json": "Most analytics applications require frequent batch processing, which allows them to process data in...",
  "data/redirect-devtop/2021/11/907559.json": "While a lot of programming languages that have a \"nullish\" type (null, nil, etc.) debate about...",
  "data/redirect-devtop/2021/11/887714.json": "Processing real-time streaming data requires throughput scalability, reliability, high availability,...",
  "data/redirect-devtop/2021/11/887731.json": "Across both real-time and batch processing, data flows through different stages. For each stage,...",
  "data/redirect-devtop/2021/11/896951.json": "Introduction    The AWS Well-Architected Framework helps you understand trade-offs for...",
  "data/redirect-devtop/2021/11/887717.json": "Every day, the people in your organization make decisions that affect your business. When they have...",
  "data/redirect-devtop/2021/11/898360.json": "Introduction    Amazon Redshift is a fast, fully-managed, petabyte-scale data warehouse...",
  "data/redirect-devtop/2021/11/900287.json": "A little more than two years ago, in October 2019, I began work on my first significant open source...",
  "data/redirect-devtop/2021/11/898445.json": "Introduction    AWS Lambda enables you to run code without provisioning or managing servers....",
  "data/redirect-devtop/2021/11/902333.json": "As a web developer, I sometimes describe my job as \"making things talk to each other over the...",
  "data/redirect-devtop/2021/11/908593.json": "Introduction    AWS offers the broadest and deepest set of machine learning services and...",
  "data/redirect-devtop/2021/11/898419.json": "Introduction    Amazon OpenSearch Service (OpenSearch Service) makes it easy to deploy,...",
  "data/redirect-devtop/2021/11/898374.json": "Introduction    Amazon QuickSight is a scalable, serverless, embeddable, machine..."
}