{
  "data/redirect-devtop/2021/2/592359.json": "Table of Contents :    Grid Architecture Parent Properties   grid-template-columns grid-temp...",
  "data/redirect-devtop/2021/2/590834.json": "Googling is one of the most important skills for every developer.  Let me show you how to get better...",
  "data/redirect-devtop/2021/2/617616.json": "Hi everyone 👋  Today I wanted to share with you the Ultimate Cheatsheet Compilation.  I hope aspiring...",
  "data/redirect-devtop/2021/2/588717.json": "What Is Cheat Sheet?   With the rapid development of technologies in web programming, the am...",
  "data/redirect-devtop/2021/2/604127.json": "Introduction   Hello Guys, Today I am going to start a series named \"Algorithm Every Program...",
  "data/redirect-devtop/2021/2/595913.json": "If you're looking to grab your website visitor's attention, what can be better than animations.  You...",
  "data/redirect-devtop/2021/2/614857.json": "Clean code is more than just working code. Clean code is easy to read, simple to understand, and neat...",
  "data/redirect-devtop/2021/2/606267.json": "Today I'm excited to announce the official release of Vite 2.0!  Vite (French word for \"fast\", pron...",
  "data/redirect-devtop/2021/2/611743.json": "Is color theory getting you down? Are you tired of the same old preset palettes? Sick of hitting “reg...",
  "data/redirect-devtop/2021/2/613429.json": "In this post I am gonna show you my personal vs code setup! Which makes me more productive. And gives...",
  "data/redirect-devtop/2021/2/590987.json": "UI Library For React            MATERIAL-UI(React)   The MATERIAL-UI (React) component makes...",
  "data/redirect-devtop/2021/2/606011.json": "Whilst learning web development, most of us don’t have much design experience or access to a UI desig...",
  "data/redirect-devtop/2021/2/601090.json": "One of the reasons VSCode is such an awesome code editor is the huge library of extensions created by...",
  "data/redirect-devtop/2021/2/590589.json": "Hey everyone,  We’re always working on awesome side projects at Flexiple, and I know a lot of you are...",
  "data/redirect-devtop/2021/2/593764.json": "A brief tutorial on how to create animated content placeholders with HTML and CSS.",
  "data/redirect-devtop/2021/2/615181.json": "As software developers, many of us heavily rely on Windows for our daily jobs. But a few months ago, I decided to give Linux another shot. In this article, I talk about how I manage to replace many of my daily tools to work on Linux.",
  "data/redirect-devtop/2021/2/595723.json": "Concept of Blockchain   Imagine an open platform in which anyone can join similar to whatsap...",
  "data/redirect-devtop/2021/2/592097.json": "What will be logged to the console?  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  At a fir...",
  "data/redirect-devtop/2021/2/592099.json": "Array? Object? Undefined? What’s the output?  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  ....",
  "data/redirect-devtop/2021/2/590778.json": "Generators is a feature you probably won't need every day. Does it mean you may ignore them completel...",
  "data/redirect-devtop/2021/2/605627.json": "Can you add multiple arrays in JavaScript? What’s the output?  .  .  .  .  .  .  .  .  .  .  .  ....",
  "data/redirect-devtop/2021/2/601532.json": "Software Engineering🔽    It is a systematic, disciplined, cost-effective technique for softw...",
  "data/redirect-devtop/2021/2/607554.json": "Months ago I wrote The reasons I don't use Typescript and one reason more than others struck a nerve...",
  "data/redirect-devtop/2021/2/606111.json": "Vue 3 introduced the composition API and while it looks intimidating, here's a few practical examples of components rewritten using this new interface.",
  "data/redirect-devtop/2021/2/613895.json": "let's be honest, many developers just hate working with CSS because:   you have to try a lot of CSS..."
}