{
  "data/tweet-economist/2022/4/1509687479506509828.json": "Hungary is still a democracy, but a damaged one. Its election on April 3rd will be seen as a global struggle between liberal democracy and populist autocracy  https://t.co/f1Fbys9zYP",
  "data/tweet-economist/2022/4/1509719965800316931.json": "“We believe in victory. It’s impossible to believe in anything else.” Ukraine’s president, Volodymyr Zelensky, speaks to The Economist’s editor-in-chief @zannymb and Russia editor @arkadyostrovsky, on a special episode of “The Economist Asks” podcast  https://t.co/glOHf65qrU",
  "data/tweet-economist/2022/4/1509715111065313283.json": "It seems that Russia is keen to use humanitarian gestures in Ukraine to the same effect as in Syria https://t.co/rpvYjM5pDB",
  "data/tweet-economist/2022/4/1509729670534729730.json": "EU leaders hope to send a message to China’s leader, Xi Jinping, that the Ukraine war is a defining moment for\nrelations, and for China’s image if it refuses to use its influence to end the bloodshed https://t.co/0ZiEtkKR2K",
  "data/tweet-economist/2022/4/1509760473801142311.json": "Ukraine has won the first phase of the war simply by surviving. Now it needs to advance, and so Volodymyr Zelensky needs redoubled Western help https://t.co/ZeyamMgvpV",
  "data/tweet-economist/2022/4/1509781503814873091.json": "KAL’s cartoon https://t.co/rd5oSKf73M",
  "data/tweet-economist/2022/4/1509710297854009351.json": "Macaroni cheese is now an American staple. But it probably arrived there via France – and Thomas Jefferson https://t.co/5i056D1xvd",
  "data/tweet-economist/2022/4/1509871159038418944.json": "The Economist’s editor-in-chief, Zanny Minton Beddoes, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky.\n\nIn a wide-ranging interview, the Ukrainian president discussed the state of the war and why Putin must be defeated https://t.co/T3dD5jhAMp",
  "data/tweet-economist/2022/4/1509814420742062108.json": "Vladimir Putin’s invasion of Ukraine has shown Europe that it needs a new China policy https://t.co/Sm5oXMrYaj",
  "data/tweet-economist/2022/4/1509857860242460673.json": "On March 25th @zannymb, editor-in-chief of The Economist, travelled to Kyiv to interview Volodymyr Zelensky. \n\nHere is the inside story of how she and @ArkadyOstrovsky, The Economist’s Russia editor, made it into the Ukrainian president’s war room https://t.co/QmH2g4kZac",
  "data/tweet-economist/2022/4/1509864876054913031.json": "“We believe in victory,” Volodymyr Zelensky told The Economist in a face-to-face interview in Kyiv last week https://t.co/oU8NdlxBNj",
  "data/tweet-economist/2022/4/1509887071049166884.json": "Russia claimed its attack on Kyiv was designed to distract Ukrainian forces from the real action in Donbas. Yet evidence shows that Russia intended to take Kyiv and expected to do so quickly https://t.co/EtY3iFF5DT",
  "data/tweet-economist/2022/4/1509934133451104298.json": "Before the Taliban seized power last year, almost 30% of civil servants were women. Now women have been purged from most workplaces https://t.co/DIxKsUq39P",
  "data/tweet-economist/2022/4/1509971861156757505.json": "“I will stay with these people until the end.”\n\nThe Economist’s editor-in-chief, @zannymb, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky https://t.co/VHu5GLP9Oy",
  "data/tweet-economist/2022/4/1509995523461324802.json": "The loss of so many generals in this way is embarrassing to the Russian army, epitomising its tactical failures in the first month of war https://t.co/KA1xNRMOWf",
  "data/tweet-economist/2022/4/1510007357400662022.json": "As the war enters its sixth week, the side contemplating victory is not Russia but Ukraine—and it would be a victory that redraws the map of European security https://t.co/MQRV40Yfk1",
  "data/tweet-economist/2022/4/1510024977516478478.json": "Vladimir Putin’s war in Ukraine has brought about a dramatic shift in Japan’s policy towards Russia https://t.co/bxcfgqoDME",
  "data/tweet-economist/2022/4/1510068503990177797.json": "Ukraine’s army has mounted a series of increasingly ambitious counterattacks. Some of these appear to have been devastatingly effective https://t.co/CjvmDW7Hno",
  "data/tweet-economist/2022/4/1510013398033088512.json": "Vladimir Putin returned to the presidency in 2012. Things have not gone well since https://t.co/w1y18JJBNe",
  "data/tweet-economist/2022/4/1509977926464417792.json": "Pulling back from Kyiv is probably a strategic decision by Russia to cut its losses, Western officials argue https://t.co/yLySGJOMn1",
  "data/tweet-economist/2022/4/1509870489392631813.json": "Morale has been low, logistics poor and casualties high. And that seems to have forced the generals to get their boots muddy https://t.co/XESNdXLeYx",
  "data/tweet-economist/2022/4/1510048080128794626.json": "Volodymyr Zelensky sees strength in the grit of the humble, unarmed Ukrainians who “waved their hands in the middle of the streets in order to stop tanks” https://t.co/ItAmcTtr1m",
  "data/tweet-economist/2022/4/1510043359401947144.json": "Joe Biden’s budget proposes that Americans worth more than $100m pay a minimum tax of 20% on all their income, including, controversially, the appreciation of their investments https://t.co/oP7rULq5hA",
  "data/tweet-economist/2022/4/1510093175972667393.json": "It has taken Chinese diplomats a while to realise that European leaders would not agree to a conventional, trade-focused summit amid the war in Ukraine https://t.co/PequsaaTs1",
  "data/tweet-economist/2022/4/1510119086461698048.json": "In 2021 alone, the country’s population dropped by 693,000, or about 0.5%. https://t.co/ERSSktx0iJ",
  "data/tweet-economist/2022/4/1510127405930848258.json": "“Impose an embargo on Russian oil and gas exports. All these sanctions are incomplete. They have been threatened, but not yet implemented.” Volodymyr Zelensky calls for Western-imposed economic measures to go further, on “The Economist Asks” https://t.co/MQOraKsF5l",
  "data/tweet-economist/2022/4/1509935126926532616.json": "Some 7,000 Russians are now stuck in Thailand, with 11,500 more in Sri Lanka and more than 19,000 on Bali. Cut off from their bank accounts, they are feeling the pinch https://t.co/skPfm9h9Dt",
  "data/tweet-economist/2022/4/1510055705474211853.json": "“Even before Russia’s war on Ukraine, far too much ink was wasted on whether NATO was at fault for Russia’s threat to Ukraine,” argues @IvoHDaalder in a guest essay  https://t.co/aSZJIl65kK",
  "data/tweet-economist/2022/4/1510168384645869571.json": "A decisive victory for Ukraine would deter yet another Russian invasion. The more convincingly Ukraine can see off the Russian army, the more able it will be to resist the compromises that could poison the peace https://t.co/01t5GR3R1i",
  "data/tweet-economist/2022/4/1510086319074074628.json": "He chose the most sensitive location in Lhasa. And he picked a sensitive time, days before the meeting of China’s parliament in Beijing. To pull off such an act shows not desperation, but the “utmost determination”, says a Tibet researcher https://t.co/mBIxWLXAFb",
  "data/tweet-economist/2022/4/1510115318479343621.json": "At least 153 Russian tanks have been destroyed during the invasion of Ukraine so far, along with 312 armoured vehicles https://t.co/b3d4uss6ks",
  "data/tweet-economist/2022/4/1510213704498909184.json": "“We believe in victory. It’s impossible to believe in anything else.”\n\nThe Economist’s editor-in-chief, Zanny Minton Beddoes, travelled to the heart of the Ukrainian war effort to interview President Volodymyr Zelensky https://t.co/dbax1oSHJQ",
  "data/tweet-economist/2022/4/1510206034786324485.json": "“The West has been slow to realise the seriousness of the threat the Belarusian dictatorship poses, and to react to it,” warns the country’s opposition leader. She calls on politicians to “stop recognising the regime in Minsk as legitimate or legal” https://t.co/cE3IKAGQQg",
  "data/tweet-economist/2022/4/1510215821708218370.json": "In the absence of alcohol, sweet treats unite the Middle East https://t.co/Ux0cNbzVGE",
  "data/tweet-economist/2022/4/1510184793992056835.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/32L11z13fe",
  "data/tweet-economist/2022/4/1510175720408064001.json": "The Taliban’s abrupt U-turn on education affects more than 1m school-age girls. Some are risking their lives to attend underground schools https://t.co/zGDeSOVPqk",
  "data/tweet-economist/2022/4/1509940678435946499.json": "“The fate of both Belarus and Ukraine is at stake,” warns @Tsihanouskaya. “Belarus can't be free without a free Ukraine and vice versa” https://t.co/i5y9zF3Bn6",
  "data/tweet-economist/2022/4/1510273616281317380.json": "Not only could a victory for Ukraine against Russia invigorate the cause of democracy, but it would also enhance European security https://t.co/KJ8279kljU",
  "data/tweet-economist/2022/4/1510250698478440448.json": "On March 25th Zanny Minton Beddoes, editor-in-chief of The Economist, travelled to Kyiv to interview Volodymyr Zelensky. \n\nHere is the inside story of how she and Arkady Ostrovsky, The Economist’s Russia editor, made it into the Ukrainian president’s war room https://t.co/HHJ1cuYUmD",
  "data/tweet-economist/2022/4/1510249702469648384.json": "Russian forces have paid a heavy price for their attack on Ukraine. Though Russia claims that only 1,351 of its soldiers have died, American and Ukrainian officials say the true number is much higher https://t.co/8LsTiemyur",
  "data/tweet-economist/2022/4/1510284948682514437.json": "Economists in the Biden administration have calculated that the 400 wealthiest American families pay an average federal income-tax rate of just 8% https://t.co/5qrr3MQe8l",
  "data/tweet-economist/2022/4/1510326703532429313.json": "The female literacy rate in Afghanistan more than doubled between 2000 and 2018 to 30%. Now a generation of girls is falling behind https://t.co/RLnlOo8Xsk",
  "data/tweet-economist/2022/4/1510289208040165381.json": "The official Indian response to Russia’s invasion of Ukraine has been so cold and tight-lipped that it has left everyone wondering where the world’s largest democracy stands https://t.co/GcPZiIfXtF",
  "data/tweet-economist/2022/4/1510140694983229444.json": "After redrawing voting districts in 2014, Fidesz won 91% of constituency seats and a two-thirds supermajority overall, despite getting just 45% of the vote https://t.co/12t9g3YbKI",
  "data/tweet-economist/2022/4/1510318147705966605.json": "In just one month, the refugees leaving Ukraine already outnumber those who left Iraq in 1991, Afghanistan in 2000, Syria in 2013 and Venezuela in 2018 https://t.co/lHKbOUnkid",
  "data/tweet-economist/2022/4/1510154584639119361.json": "Judges from Britain’s highest court have been doing double duty on Hong Kong’s since 1997. But this legacy of the city’s past will not feature in its future https://t.co/X4UwUhXwKh",
  "data/tweet-economist/2022/4/1510417623695171586.json": "Ukraine has won the first phase of the war simply by surviving. Now it needs to advance, and so Volodymyr Zelensky needs redoubled Western help https://t.co/FRpjQ86jB2",
  "data/tweet-economist/2022/4/1510413622744391681.json": "The goal of a spin dictator is to appear to allow political competition while making it nearly impossible in practice https://t.co/UdEh6wv86A",
  "data/tweet-economist/2022/4/1510409691045715968.json": "What does Volodymyr Zelensky believe victory will look like? “Victory is being able to save as many lives as possible...because without this nothing would make sense.” https://t.co/8tEVpLW6NR",
  "data/tweet-economist/2022/4/1510391629789609984.json": "The Economist’s editor-in-chief, Zanny Minton Beddoes, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky.\n\nIn a wide-ranging interview, the Ukrainian president discussed the state of the war and why Putin must be defeated https://t.co/dmx8o1aGfr",
  "data/tweet-economist/2022/4/1510373008132780040.json": "It is clear that Russia’s military top brass are suffering unusual attrition. Why? https://t.co/ySmtfxtEYo",
  "data/tweet-economist/2022/4/1510256244589797394.json": "It is the American president who seems frightened of tangling with Vladimir Putin, not the other way around https://t.co/OALNayA7gT",
  "data/tweet-economist/2022/4/1510448772844855297.json": "If Ukraine had been a member of NATO, Vladimir Putin would have “thought twice” before starting a war, argues America’s former ambassador to the organisation in a guest commentary for The Economist  https://t.co/bWgyf3fByl",
  "data/tweet-economist/2022/4/1510444491462914052.json": "“We believe in victory. It’s impossible to believe in anything else.” Ukraine’s president, Volodymyr Zelensky, speaks to The Economist’s editor-in-chief @zannymb and Russia editor @arkadyostrovsky, on a special episode of “The Economist Asks” podcast  https://t.co/b10socDcxz",
  "data/tweet-economist/2022/4/1510180638456008707.json": "Abe Shinzo met Vladimir Putin 27 times between 2012 and 2020. But under Kishida Fumio, Japan is backing Ukraine and beside the West https://t.co/gH1575r5eV",
  "data/tweet-economist/2022/4/1510490356126830594.json": "Breaking with pacifist precedent, Japan sent bulletproof vests to Ukraine’s army. It also cracked open its doors to refugees https://t.co/izvXVS9GZB",
  "data/tweet-economist/2022/4/1510431825251942401.json": "The brother of a disgraced prime minister, Shehbaz Sharif has been plagued by accusations of nepotism and corruption  https://t.co/mVzmuMHxoX",
  "data/tweet-economist/2022/4/1510499863452164097.json": "In the eyes of Indian generals, many of the country’s prestige military toys, such as nuclear-powered submarines and hypersonic cruise missiles, rely on Russian inputs https://t.co/APvp5LQM3E",
  "data/tweet-economist/2022/4/1510547981723914244.json": "A strong, democratic Ukraine would thwart Russia’s expansionism because its borders would be secure. Eventually Russia, following Ukraine’s example, would be more likely to solve its problems by reform at home rather than adventures abroad https://t.co/4NPsp5iRMA",
  "data/tweet-economist/2022/4/1510528988405538817.json": "Connecting human brains to computers could provide the biggest single upgrade to human intelligence since our species evolved. Brain-computer interfaces are coming. But are we ready? https://t.co/bey7hGpwmX",
  "data/tweet-economist/2022/4/1510495446967402497.json": "Saudi Arabia and Palestinians were notably absent from a recent flurry of diplomacy in the Middle East. It shows how low the Palestinian cause has fallen on Arab states’ agenda https://t.co/4NqY3c5LT9",
  "data/tweet-economist/2022/4/1510589745713364999.json": "In Vladimir Putin’s world honesty is weakness. His power is based on secrecy and deception. Volodymyr Zelensky’s strength lies in his openness and his ability to hear and reflect what people want of him https://t.co/xp1NxZQUKo",
  "data/tweet-economist/2022/4/1510405741890478091.json": "The Biden administration dubs the new proposal a “billionaire minimum income tax” https://t.co/KI2CWvF2OP",
  "data/tweet-economist/2022/4/1510629480443879431.json": "To still blame NATO for Russia’s war on Ukraine is “frankly, absurd”, argues @IvoHDaalder in a guest essay  https://t.co/R1601acPeA",
  "data/tweet-economist/2022/4/1510650598986768391.json": "Vladimir Putin “props up” Alexander Lukashenko’s regime, says @Tsihanouskaya. “The West’s weakness has led to Belarus becoming an accomplice in the most brutal European conflict since the second world war”  https://t.co/26ZhqEFrAZ",
  "data/tweet-economist/2022/4/1510668506685132800.json": "Kharkiv is largely Russian-speaking and used to be instinctively Russophile. Most of its residents are shocked by the Russian attack https://t.co/j3sJG2GkZV",
  "data/tweet-economist/2022/4/1510702946593517569.json": "Russia will have to deal with the risk of further and perhaps more ambitious counterattacks by Ukraine—which are possible, judging by Volodymyr Zelensky’s appeals to the West for heavier kit https://t.co/vLQtQmMBB6",
  "data/tweet-economist/2022/4/1510647588206301187.json": "The White House reckons the new tax would bring in $360bn over the next decade https://t.co/Nr5oxlpCSD",
  "data/tweet-economist/2022/4/1510747491142148096.json": "After redrawing voting districts in 2014, Fidesz won 91% of constituency seats and a two-thirds supermajority overall, despite getting just 45% of the vote https://t.co/4THfgv3zBo",
  "data/tweet-economist/2022/4/1510648426509312006.json": "“Some small cities have been destroyed. There are no people there anymore. And no houses. All that’s left is the name.” Volodymyr Zelensky tells @zannymb and @arkadyostrovsky about the destruction war has brought to his country, on “The Economist Asks” https://t.co/IqGZic6JRu",
  "data/tweet-economist/2022/4/1510686643832995842.json": "The world, its troubles and their possible solutions were utterly absorbing. She wanted to give freedom and democracy to everyone https://t.co/X7ZM9LTMuz",
  "data/tweet-economist/2022/4/1510773683236872196.json": "Volodymyr Zelensky does not know when or how the war will end, but he knows that “it will end with us still standing here defending” https://t.co/ei1ZbS3jeX",
  "data/tweet-economist/2022/4/1510795051701518336.json": "Years of progress are imperilled. Over 1m school-age girls have been sent home from school. Women have been purged from most workplaces, and are banned from travelling long distances without a male chaperone https://t.co/P46myTy839",
  "data/tweet-economist/2022/4/1510879541534801924.json": "A decisive victory for Ukraine would deter yet another Russian invasion. The more convincingly Ukraine can see off the Russian army, the more able it will be to resist the compromises that could poison the peace https://t.co/9M2Qv1FNdj",
  "data/tweet-economist/2022/4/1510908281371332611.json": "“We believe in victory. It’s impossible to believe in anything else.”\n\nThe Economist’s editor-in-chief, Zanny Minton Beddoes, travelled to the heart of the Ukrainian war effort to interview President Volodymyr Zelensky https://t.co/Ssque10XDc",
  "data/tweet-economist/2022/4/1510926559858896896.json": "This week’s cartoon from KAL: https://t.co/poJHfICdbK https://t.co/mvv8jG0WnI",
  "data/tweet-economist/2022/4/1510946129243955203.json": "We verified reports of what appear to be summary executions https://t.co/bgSxhWeIju",
  "data/tweet-economist/2022/4/1510935643458871302.json": "The goal of a spin dictator is to appear to allow political competition while making it nearly impossible in practice https://t.co/MUwbCPuM8k",
  "data/tweet-economist/2022/4/1510958636721393666.json": "There is evidence of summary executions and random murders—war crimes on a terrible scale. That will redouble Ukrainian resistance, spur Western help and set back already faint hopes for peace https://t.co/CWbLk3ejNU",
  "data/tweet-economist/2022/4/1510914351510740992.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/cQ3tAbt2j7",
  "data/tweet-economist/2022/4/1510517446624653314.json": "The Centre for Global Development, a think-tank, estimates that 40m people worldwide will be pushed into extreme poverty as a result of Russia’s invasion of Ukraine https://t.co/c540vHltSh",
  "data/tweet-economist/2022/4/1510715036133691399.json": "In the absence of alcohol, sweet treats unite the Middle East https://t.co/4voyz95oev",
  "data/tweet-economist/2022/4/1510991344310837255.json": "The bodies of 410 civilians have so far been found around Kyiv, said the Ukrainian prosecutor-general. Nobody doubts that the final toll will be much higher https://t.co/Lx6TmdDBf1",
  "data/tweet-economist/2022/4/1510981039199563782.json": "For a Czech refugee, America was a haven of peace, democracy and freedom. She never took it for granted  https://t.co/FJGY1mvCUg",
  "data/tweet-economist/2022/4/1510976250218790920.json": "The new Taliban are beginning to look a lot like the old Taliban https://t.co/DULl6HBIwm",
  "data/tweet-economist/2022/4/1510891441287057408.json": "A national­-security law imposed on Hong Kong in 2020 has had an “insidious effect” on the courts, says a British barrister   https://t.co/QxXpH86iPi",
  "data/tweet-economist/2022/4/1510942818822463491.json": "“Impose an embargo on Russian oil and gas exports. All these sanctions are incomplete. They have been threatened, but not yet implemented.” Volodymyr Zelensky calls for Western-imposed economic measures to go further, on “The Economist Asks” https://t.co/OQACAbTBgX",
  "data/tweet-economist/2022/4/1511013494908497925.json": "Corpses are still scattered over Bucha’s streets. Locals say that Russian troops had shot them for no reason. At least 280 have been buried in a makeshift mass grave https://t.co/MShL2PiIDo",
  "data/tweet-economist/2022/4/1510968182386966534.json": "The response to Russia’s invasion has deep roots in Ukrainian history, says Peter Pomerantsev https://t.co/RWlmKpEBqB",
  "data/tweet-economist/2022/4/1511034384496959491.json": "Not only could a victory for Ukraine against Russia invigorate the cause of democracy, but it would also enhance European security https://t.co/IaDcrlqNpV",
  "data/tweet-economist/2022/4/1511040923832049667.json": "The people living in countries opposing Russia account for only 36% of the world’s population https://t.co/FKCHOOu3TN",
  "data/tweet-economist/2022/4/1511033624887451660.json": "In Guatemala many lawyers, facing threats of prison or death, are fleeing north https://t.co/fkuIoJcFIc",
  "data/tweet-economist/2022/4/1510675015737528326.json": "As president, Gabriel Boric has vowed to forgive student loans and reduce testing in schools https://t.co/SxqzqHHMrQ",
  "data/tweet-economist/2022/4/1511048227486842882.json": "Catherine the Great of Russia’s decision to get both herself and her son inoculated against smallpox showed the power of leadership by example https://t.co/EH7Ev6BdFZ",
  "data/tweet-economist/2022/4/1511052004122144770.json": "An elderly woman in Bucha cries as she remembers Russia’s five-week occupation of her city: “we tied white ribbons to our arms so they wouldn't shoot” https://t.co/0XXW9X2DbW",
  "data/tweet-economist/2022/4/1511154215460249601.json": "The invasion of Ukraine has turned Japan definitively against Russia https://t.co/aXucZA2CPl",
  "data/tweet-economist/2022/4/1511134850560020488.json": "Russian troops retreating from Kyiv have left behind a landscape of atrocities  https://t.co/T7MGEluzoU",
  "data/tweet-economist/2022/4/1511094181795672064.json": "It is worth trying, even if success is likely to be limited  https://t.co/hTOKNJSfHJ",
  "data/tweet-economist/2022/4/1511044710231588871.json": "A fascinating new book contrasts “fear dictators” with “spin dictators”, who kill fewer\npeople, and deny it when they do. The latter are now more common https://t.co/c18k8yuXgo\"",
  "data/tweet-economist/2022/4/1511173695410249734.json": "Russia has not just lost a decade of growth—be it in economics, health or happiness. It is moving into the past https://t.co/QHYN48JSML",
  "data/tweet-economist/2022/4/1511178122133180416.json": "The renewed evidence of Russian atrocities has produced renewed condemnation  https://t.co/nYSD4pTIyG",
  "data/tweet-economist/2022/4/1511101328172408834.json": "About 30% of the global population live in countries whose governments are classed by the Economist Intelligence Unit as leaning towards Russia https://t.co/IZmBR530Hf",
  "data/tweet-economist/2022/4/1511219443350781956.json": "Ukrainians are eavesdropping on the invaders and broadcasting on their frequencies https://t.co/WCtH1I0doD",
  "data/tweet-economist/2022/4/1511239212502241285.json": "Vladimir Putin’s war in Ukraine has met widespread condemnation in the West. But for now, by no means does everyone regard him, and his country, as pariahs https://t.co/2RQArbJrKS",
  "data/tweet-economist/2022/4/1511183515198668808.json": "The reported toll is akin to the toughest days of the second world war https://t.co/LgO5uivUA4",
  "data/tweet-economist/2022/4/1511350666891075589.json": "The West has presented a united front against the invasion of Ukraine. But many people live in countries sympathetic to Russia",
  "data/tweet-economist/2022/4/1511345914895482880.json": "“I will stay with these people until the end.”\n\nThe Economist’s editor-in-chief, @zannymb, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky https://t.co/2T355r2VSr",
  "data/tweet-economist/2022/4/1511223809814286339.json": "“He wasn’t in the army or anything,” says a friend of one of the victims, fighting back tears. “His only crime was not immediately accepting Russky mir [Russian World].” https://t.co/UZEyBMjdkm",
  "data/tweet-economist/2022/4/1511377884325236750.json": "“They made us take our clothes off, lie face down, and then they searched our telephones and bodies for symbols and tattoos.” A survivor of a summary execution in Bucha tells us what happened https://t.co/2hcnJY9TEJ",
  "data/tweet-economist/2022/4/1511242513054584837.json": "Ukraine’s president and Poland’s prime minister have called it “genocide”. Joe Biden, America’s president, said what had happened in Bucha was a war crime and that Vladimir Putin, Russia’s president, should face an international tribunal for it  https://t.co/x4ehsRVrsa",
  "data/tweet-economist/2022/4/1511382477947944964.json": "Vladimir Putin thought Ukraine would fold after he invaded. But history shows its people come together in adversity https://t.co/5mWAopwpIt",
  "data/tweet-economist/2022/4/1511433621592227852.json": "We speak to a survivor of a summary execution in Bucha. He and other men were beaten, tortured and ordered to be killed by Russian soldiers https://t.co/7f55TbXm38",
  "data/tweet-economist/2022/4/1511214594433372165.json": "“We believe in victory. It’s impossible to believe in anything else.” Ukraine’s president, Volodymyr Zelensky, speaks to The Economist’s editor-in-chief @zannymb and Russia editor @arkadyostrovsky, on a special episode of “The Economist Asks” podcast  https://t.co/XpLcYzXJ1I",
  "data/tweet-economist/2022/4/1511487384361308162.json": "A new book describes how for most modern autocrats, lying matters more than killing https://t.co/Ix8uoTKfTF",
  "data/tweet-economist/2022/4/1511457890309222409.json": "Although the official number of deaths caused by covid-19 is now 6.2m, our single best estimate is that the actual toll is 20.5m people https://t.co/9D1THmVvAL",
  "data/tweet-economist/2022/4/1511418525453369357.json": "The evidence from the battlefield confirms that Russians have committed at least three types of criminal offence in war  https://t.co/fmhgtJB6mN",
  "data/tweet-economist/2022/4/1511291106138464259.json": "The presence of foreign judges on Hong Kong’s courts make them better than they would otherwise be. It also makes them seem better than they actually are https://t.co/4G5PIN8jua",
  "data/tweet-economist/2022/4/1510974730752471041.json": "If negotiations failed, Russia could garrison troops in Donbas for years. Yet if Russia held the territory without a deal, it would find itself locked in a protracted struggle https://t.co/dBui3adhNQ",
  "data/tweet-economist/2022/4/1511558905100390402.json": "For modern autocrats, lying is more useful than killing https://t.co/iqoThdll0p",
  "data/tweet-economist/2022/4/1511591401519259648.json": "If Vladimir Putin remains in power, or even if he resigns but continues to be protected by successors, international justice will not be seen to be done  https://t.co/TJO0xnw0vT",
  "data/tweet-economist/2022/4/1511625659164024834.json": "“I will stay with these people until the end.”\n\nThe Economist’s editor-in-chief, @zannymb, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky. \n\nRead more here: https://t.co/vNQISgXoFY https://t.co/e1cmAYsHbs",
  "data/tweet-economist/2022/4/1511518729674366977.json": "Proceedings have begun in several international courts to bring the perpetrators to justice. Two have made initial rulings in Ukraine’s favour  https://t.co/1ozSsF9sml",
  "data/tweet-economist/2022/4/1511654001779040256.json": "The official number of deaths from covid-19 is now 6.2m. But our model is 95% confident the true value lies between 14.2m and 24.3m excess deaths \nhttps://t.co/on8CRQvTL2",
  "data/tweet-economist/2022/4/1511659183829098500.json": "When compared with the world as a whole, or even rich countries in particular, Russia’s decline over the last decade looks even worse.\n\nRead more about the country's slide 👇",
  "data/tweet-economist/2022/4/1511699889931145220.json": "We were able to verify reports of what appears to be a summary execution in Bucha, where nine bodies lay at the side of a builder’s yard that had been used as a Russian base. A survivor tells us what happened https://t.co/TD7Zd5n3jt",
  "data/tweet-economist/2022/4/1511531679311138820.json": "The world’s first malaria vaccine will be rolled out later this year. What other scientific tools could help defeat the mosquito-borne killer? Listen to “Babbage” https://t.co/SjK8vF6LlF",
  "data/tweet-economist/2022/4/1511758652893450246.json": "“Ukraine is not a battlefield; it's a crime scene,” argues @kajakallas. In a guest essay, she urges the world to “act now” https://t.co/TMnQoNzyUb",
  "data/tweet-economist/2022/4/1511724157846921217.json": "The Economist’s editor-in-chief, Zanny Minton Beddoes, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky.\n\nIn a wide-ranging interview, the Ukrainian president discussed the state of the war and why Putin must be defeated https://t.co/yqANwLCQyH",
  "data/tweet-economist/2022/4/1511803267952619530.json": "RT @kajakallas: In my piece for @TheEconomist, I argue that although the Soviet Union collapsed, its imperialist ideology never did. \n\nTo s…",
  "data/tweet-economist/2022/4/1511830470828433410.json": "As Russian troops retreated over the border to Belarus and Russia, pursued by Ukrainians, Kyiv began returning to normal. But although the battle is won, the war is not  https://t.co/QVvIAvNJU5",
  "data/tweet-economist/2022/4/1511853762817703938.json": "Man-portable air defence systems (MANPADS) are playing an unexpectedly important role in the war in Ukraine https://t.co/rIsKZXp6WL",
  "data/tweet-economist/2022/4/1511840060030783490.json": "Catherine the Great of Russia’s decision to get both herself and her son inoculated against smallpox showed the power of leadership by example https://t.co/ydssRTVLq4",
  "data/tweet-economist/2022/4/1511925836701700097.json": "“We are witnessing a long-planned campaign by the Kremlin to exert control over neighbouring countries by brute force, no matter the human cost,” writes Estonia’s prime minister. She urges the world to “act now” https://t.co/EMCqIA5xrL",
  "data/tweet-economist/2022/4/1511921812032139272.json": "STARStreak missiles, and MANPADS more generally, could help Ukrainian forces to neutralise Russian airpower without the need for new jets or direct intervention by other states https://t.co/NG5zs61Vyo",
  "data/tweet-economist/2022/4/1511866110345453574.json": "There is already so much evidence of torture, rape and murder that Russian forces should be indicted. Unfortunately, as the war drags still more evidence will come to light \nhttps://t.co/SEeyqdLYCx",
  "data/tweet-economist/2022/4/1511940090112749572.json": "“They made us take our clothes off, lie face down, and then they searched our telephones and bodies for symbols and tattoos.” A survivor of a summary execution in Bucha tells us what happened https://t.co/LnSNus25pO",
  "data/tweet-economist/2022/4/1512021114150539265.json": "“We believe in victory. It’s impossible to believe in anything else.”\n\nThe Economist’s editor-in-chief, @zannymb, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky. \n\nRead more here: https://t.co/vNQISgFNho https://t.co/HLDL6wKUn1",
  "data/tweet-economist/2022/4/1511953121160929282.json": "The Taliban are pushing females out of public life https://t.co/jhtpi1afR5",
  "data/tweet-economist/2022/4/1512069010321383429.json": "RT @shashj: My piece on mass expulsion of over 400 Russian diplomats from Europe in recent days. It means that roughly half of undeclared R…",
  "data/tweet-economist/2022/4/1512068672642162701.json": "RT @PedderSophie: Why the French election matters, and why Emmanuel Macron is still the best option for France. \nOur cover story this week,…",
  "data/tweet-economist/2022/4/1512071703546916877.json": "This is a good time for Ukraine to press its counter-attack: on every day during the final week of March, it gained more territory than it lost https://t.co/U107sZPQbe",
  "data/tweet-economist/2022/4/1512060794938314755.json": "Liberal centrists around the world should see Emmanuel Macron as a cautionary tale: one person alone cannot sustain the radical centre. Our cover explains why he still gets our vote, but with reservations https://t.co/AbrlQYRcOo https://t.co/8Uo8XaXPnY",
  "data/tweet-economist/2022/4/1512085324633100290.json": "Ketanji Brown Jackson, President Joe Biden’s pick to succeed Justice Stephen Breyer, is on the brink of narrowly gaining Senate confirmation https://t.co/PTD7ocf9UL",
  "data/tweet-economist/2022/4/1512141023698374671.json": "Ketanji Brown Jackson is the first black woman to serve on the Supreme Court  https://t.co/1QB6l8Y8El",
  "data/tweet-economist/2022/4/1512113019698008072.json": "More and more leaders are seeking power by sowing fear. They do it because it works \nhttps://t.co/9msen37xsw",
  "data/tweet-economist/2022/4/1512147684165046275.json": "“We have let Vladimir Putin get away with this aggression several times before. We can’t let him get away with it again now,” urges Estonia’s prime minister. “Were that to happen, his appetite would only grow” https://t.co/dfkTdcF1Gk",
  "data/tweet-economist/2022/4/1512185953531662340.json": "The ejection of spooks on this scale is unprecedented: more than 400 Russian officials have been expelled from America and Europe since the war began https://t.co/xqa075466C",
  "data/tweet-economist/2022/4/1512149978281558021.json": "During the Senate hearings Ketanji Brown Jackson showed patience and command—traits she may need to draw upon as one of three liberal justices on a court with six conservatives https://t.co/OrzMDpD933",
  "data/tweet-economist/2022/4/1512142422855270410.json": "Emmanuel Macron looks likely to win re-election. Our model still finds him the favourite https://t.co/xtAmK0gr2X",
  "data/tweet-economist/2022/4/1512261362126311476.json": "Vladimir Putin’s gamble is that he can wear down Ukraine’s army before Russia runs out of money. Some think that Russian insolvency will come first https://t.co/J6kIsYPshF"
}