{
  "data/tweet-nytimes/2022/1/1477586743683690499.json": "These pancakes are perfectly fluffy because of the leavening agent and a vegan version of buttermilk: nondairy milk mixed with a couple teaspoons of vinegar. It works just as well for vegan waffles, muffins and coffee cake. https://t.co/Mvlh3NwQbO https://t.co/oOxPbUFW8m",
  "data/tweet-nytimes/2022/1/1477687403565535240.json": "Dr. Anthony Fauci said Sunday that the nation should focus less on the skyrocketing number of coronavirus infections and more on the number of hospitalizations and deaths. https://t.co/vloA5vgiXy",
  "data/tweet-nytimes/2022/1/1477799407173185536.json": "While watching a Vancouver Canucks hockey game, Nadia Popovici spotted a troubling mole on the neck of Brian Hamilton, an assistant equipment manager. So she wrote him a message and held it up to the plexiglass. It saved his life.\n\nhttps://t.co/ZPpCzaneua",
  "data/tweet-nytimes/2022/1/1477691161544380416.json": "Stacey Abrams, the Georgia Democrat running for governor, has admirers in both the progressive and moderate wings of her party. With Republicans eager to defeat her, her carefully calibrated positions face an electoral test in 2022.\n\nhttps://t.co/OpQUN3kd27",
  "data/tweet-nytimes/2022/1/1477684883669622784.json": "After selling the Iowa Cubs, the owner gave employees $2,000 for every year they had been with the minor league baseball team, for a total of $600,000. “My jaw dropped,” one worker said.\n\nhttps://t.co/yVoEqBGSNO",
  "data/tweet-nytimes/2022/1/1477465932431831041.json": "Sam Fender has become one of Britain’s biggest rock acts by singing about working-class life in all its complexity. Unusually, he still lives in the area of northern England where he grew up. https://t.co/4pATUOefDO",
  "data/tweet-nytimes/2022/1/1477391683339837442.json": "Desmond Tutu, a powerful opponent of apartheid and Cape Town’s first Black archbishop, was remembered in a modest ceremony scaled down further by pandemic restrictions. https://t.co/L6ISbhuzH7 https://t.co/fpXm97Cr8H",
  "data/tweet-nytimes/2022/1/1477277184532582400.json": "New studies on animals suggest why Omicron is less severe than earlier variants: It seems to cause much less damage to the lungs. https://t.co/BIoVOngQSr",
  "data/tweet-nytimes/2022/1/1478028889922416643.json": "Breaking News: The FDA cleared boosters of the Pfizer-BioNTech vaccine for 12- to 15-year-olds. The CDC is expected to sign off before shots are given out. https://t.co/LZo7bUwn50",
  "data/tweet-nytimes/2022/1/1478008249936977932.json": "Richard Leakey, the Kenyan paleoanthropologist and fossil hunter whose discoveries of ancient human skulls and skeletons helped cement Africa’s place as the cradle of humanity, died on Sunday in Kenya. He was 77. https://t.co/43YYRHxrAe",
  "data/tweet-nytimes/2022/1/1478041817589465089.json": "The New York State attorney general’s office is seeking to question Donald Trump Jr. and Ivanka Trump as part of a civil investigation into the Trump Organization. https://t.co/S17mZYKwvW",
  "data/tweet-nytimes/2022/1/1477975551411470338.json": "As the anniversary of the Jan. 6 Capitol riot approaches, the House committee investigating the day's events is preparing to hold public hearings and has not ruled out subpoenas for members of Congress, Mike Pence or Donald Trump.\n\nhttps://t.co/4rDa81Q79V",
  "data/tweet-nytimes/2022/1/1478074967665348610.json": "Facebook has suspended Rep. Marjorie Taylor Greene's account for 24 hours for spreading misinformation about the coronavirus. This comes a day after Twitter banned her personal account for posting a similar message. https://t.co/UkhQc4ddkv",
  "data/tweet-nytimes/2022/1/1478087531451359237.json": "Mayor Eric Adams of New York City insisted schools would remain open despite surging Omicron cases in the city. He said remote learning has been too damaging, especially to children in low-income neighborhoods and homeless students. https://t.co/LPCoVmXXcX https://t.co/UVEoPio4HM",
  "data/tweet-nytimes/2022/1/1478028411310333956.json": "Donald Trump endorsed Prime Minister Viktor Orban of Hungary on Monday, formally pledging his \"complete support\" to the far-right leader who has touted turning Hungary into an \"illiberal democracy.\" https://t.co/CCTLzKMpGW",
  "data/tweet-nytimes/2022/1/1478071426573869061.json": "Gov. Kathy Hochul will propose a limit of two four-year terms for New York governors in her State of the State address on Wednesday, a move that could allow her to distance herself from former Gov. Andrew M. Cuomo, who held outsize power for over a decade. https://t.co/Z1unBKAFh3",
  "data/tweet-nytimes/2022/1/1478158871726284801.json": "Breaking News: Elizabeth Holmes, the founder of the blood testing start-up Theranos, was found guilty of four counts of fraud in a case that symbolized Silicon Valley's culture of hype. https://t.co/0qsxC5ZUvj",
  "data/tweet-nytimes/2022/1/1478126548041539587.json": "Chronic psychological stress may be as important — and possibly more important — to the health of your heart as the traditional cardiac risk factors, new studies suggest. https://t.co/RNFZJfN6Hj",
  "data/tweet-nytimes/2022/1/1478095094645465095.json": "In August 2018, Apple became the first American company ever to be worth $1 trillion, an achievement that took 42 years. It surged past $2 trillion two years later. Its next trillion took just 16 months and 15 days. https://t.co/Qy8iGAxnJp https://t.co/RCDaeNCJNu",
  "data/tweet-nytimes/2022/1/1478069928766939147.json": "Josh Wardle, a software engineer in Brooklyn, knew his partner loved word games and created a guessing game for the two of them called Wordle. Just over two months after releasing it to the rest of the world, the once-a-day game has over 300,000 players. https://t.co/D1oBCwgpbW",
  "data/tweet-nytimes/2022/1/1477998194760069127.json": "A meteor likely either \"exploded or vaporized\" over Pittsburgh on Saturday, a meteorologist said, setting off a strong vibration that one resident likened to a \"shock wave.\" https://t.co/nItUut2xna",
  "data/tweet-nytimes/2022/1/1477819534870466566.json": "Mayor Eric Adams of New York said on Sunday, his second day in office, that city workers might be required to get Covid vaccine booster shots.\n\nhttps://t.co/OG41wd4lUn",
  "data/tweet-nytimes/2022/1/1477680341590548483.json": "Twitter permanently suspended the personal account of Representative Marjorie Taylor Greene on Sunday. The company said she had repeatedly violated its Covid-19 misinformation policies.\nhttps://t.co/Hdb9gddsiA https://t.co/KEvkaLvjRb",
  "data/tweet-nytimes/2022/1/1477667826047590405.json": "Breaking News: Twitter permanently suspended the personal account of Representative Marjorie Taylor Greene, a Republican of Georgia. The company said she had repeatedly violated its Covid-19 misinformation policies.\n\nhttps://t.co/v8LhiomB7x",
  "data/tweet-nytimes/2022/1/1477556547135979524.json": "In our anger-filled age, people are “devolving into children” when they need to shop or travel or cope with mild disappointment. https://t.co/162DHFCOsD",
  "data/tweet-nytimes/2022/1/1477503679519461376.json": "A Glasgow nightclub is installing technology that will turn dancers' body heat into renewable energy, which will then be used to heat or cool the club. https://t.co/h6A9iqFbSD",
  "data/tweet-nytimes/2022/1/1477413093198213122.json": "Surprise medical bills, issued by a doctor that a patient did not choose and who did not accept the patient's insurance, will be made illegal by a law that goes into effect today. https://t.co/joHEi3Unyo",
  "data/tweet-nytimes/2022/1/1477389192552460294.json": "South Korea is reckoning with a new type of political correctness enforced by angry young men who bristle at any forces they see as undermining opportunity — and feminists, in their minds, are enemy No. 1. https://t.co/FDvoBrhhtq",
  "data/tweet-nytimes/2022/1/1477298109030047752.json": "In our anger-filled age, people are “devolving into children” when they need to shop or travel or cope with mild disappointment. https://t.co/4pGZ0Qh6B7",
  "data/tweet-nytimes/2022/1/1477286007800307714.json": "Many paid tribute to Betty White as a performer who had been ahead of her times, championing equity causes before they became popular. https://t.co/n5VCCLXZZv",
  "data/tweet-nytimes/2022/1/1477263398303932420.json": "This large, fluffy pancake is excellent for New Year's Day breakfast, brunch, lunch and dessert.\n\n It comes together in about five minutes. https://t.co/scuNDQLRKs https://t.co/uvkQr4Ov3f",
  "data/tweet-nytimes/2022/1/1478171839839055874.json": "The conviction of Elizabeth Holmes signals \"the end of an era,\" David Streitfeld writes. \"In Silicon Valley, where the line between talk and achievement is often vague, there is finally a limit to faking it.\"\nhttps://t.co/mYJmxilMTA",
  "data/tweet-nytimes/2022/1/1478169640119508992.json": "Elizabeth Holmes, the founder of the blood testing start-up Theranos, faced 11 counts of fraud for lying to investors, patients and others to raise money and the profile for her company. Here’s what jurors decided:\nhttps://t.co/Ye6fA73Ucj https://t.co/rAaviWrsuV",
  "data/tweet-nytimes/2022/1/1478161795080761346.json": "The end of an era: Blackberry is ending service on its mobile devices on Jan. 4, 2022. https://t.co/jN69zoeera",
  "data/tweet-nytimes/2022/1/1478174360749883406.json": "Elizabeth Holmes, the founder of Theranos, now awaits sentencing after being found guilty of four of 11 charges of fraud on Monday. Each count of wire fraud carries up to 20 years in prison, and Holmes can appeal the conviction, her sentence or both. https://t.co/fudU5LExaW",
  "data/tweet-nytimes/2022/1/1477940312664424451.json": "Betty White died on Friday at 99. Her television career started in 1949 and included star turns on \"The Mary Tyler Moore Show\" in the 1970s and \"Golden Girls\" in the 1980s.\n\nhttps://t.co/LEccojh14O",
  "data/tweet-nytimes/2022/1/1478163568755421184.json": "Elizabeth Holmes, the founder of the failed blood testing start-up Theranos, was found guilty of four charges of fraud on Monday. She was found not guilty on four other counts. https://t.co/6nF4eZvupJ https://t.co/i9Uw8h3xJs",
  "data/tweet-nytimes/2022/1/1477703759144828930.json": "England is putting air purifiers in classrooms and strongly encouraging students to wear masks as schools prepare to reopen amid a record surge of coronavirus cases. France has also made masks mandatory indoors for everyone age 6 and over.\n\nhttps://t.co/dxaDOVsDFC",
  "data/tweet-nytimes/2022/1/1478113980472344584.json": "Viktor Orbán, Hungary’s far-right prime minister, has spent millions on an influence campaign in Washington to court the right, including Donald Trump and his allies. On Monday, Trump formally endorsed Orbán for re-election. https://t.co/jLe9a5cZPw",
  "data/tweet-nytimes/2022/1/1478053563293224963.json": "After selling the Iowa Cubs, the owner gave employees $2,000 for every year they had been with the minor league baseball team, for a total of $600,000. “My jaw dropped,” one worker said.\n\nhttps://t.co/o5nmDcKfdT",
  "data/tweet-nytimes/2022/1/1478305247152021505.json": "The conviction of Elizabeth Holmes signals \"the end of an era,\" David Streitfeld writes. \n\n\"In Silicon Valley, where the line between talk and achievement is often vague, there is finally a limit to faking it.\" https://t.co/73OHLAaRRF https://t.co/HP0SUE3ejX",
  "data/tweet-nytimes/2022/1/1478117730280685568.json": "Nearly two years into the pandemic, the Omicron variant has driven coronavirus cases to new highs, with the daily global case count surpassing a million for the first time at the end of December.\n\nWe're tracking the spread of the virus here. https://t.co/PJitGgrK8H https://t.co/g7cVzcJhwu",
  "data/tweet-nytimes/2022/1/1478135351805988867.json": "About one in 4 U.S. hospitals with intensive care units recently reported that at least 95% of their ICU beds were full. In the week ending Dec. 30, an average of 77% of beds were occupied nationwide, Department of Health and Human Services data shows. https://t.co/DVo8S13BSD",
  "data/tweet-nytimes/2022/1/1478139136938762241.json": "Without a headlining role in some of the most critical decisions facing the White House, Vice President Kamala Harris is caught between criticism that she is falling short and resentment from supporters who feel she is being undercut by the administration. https://t.co/PTaQuAqIMb https://t.co/GA6LRQNxJe",
  "data/tweet-nytimes/2022/1/1478392800957902854.json": "Breaking News: More than 4.5 million people in the U.S. quit their jobs in November, the most in two decades of tracking, as openings remained near a record. https://t.co/ZeAAVPxJiW",
  "data/tweet-nytimes/2022/1/1478454970055856133.json": "A federal judge has dismissed a lawsuit filed by a man who said he had been sexually exploited by Nirvana when the band used a photo of him as a baby, naked and drifting in a pool, for the cover of the group’s seminal album. https://t.co/zxOcDom7UU",
  "data/tweet-nytimes/2022/1/1478413440758788096.json": "Senator Tim Kaine was among the drivers stranded for more than 12 hours after a winter storm shut down parts of Interstate 95, one of the busiest travel corridors in the U.S. \"This has been a miserable experience,\" Kaine told WTOP, a radio station. https://t.co/e1Gh6kgtx5",
  "data/tweet-nytimes/2022/1/1478395833259339783.json": "American Girl has created a Chinese American doll to be its 2022 \"Girl of the Year.\" The company said it created the doll, named Corinne Tan, in response to increasing anti-Asian sentiment and to teach children to stand against racism. https://t.co/fLs1hLTu7U",
  "data/tweet-nytimes/2022/1/1478222171965214724.json": "Never miss a meteor shower, eclipse or rocket launch again. https://t.co/LAdGq5WSwx https://t.co/RGpOL0j7mS",
  "data/tweet-nytimes/2022/1/1478495055384096771.json": "Breaking News: Canada has reached a $31.5 billion settlement to repair its child welfare system and compensate Indigenous families separated by the government. https://t.co/RCGOQbgFEH",
  "data/tweet-nytimes/2022/1/1478350533215801353.json": "Interstate 95, one of the busiest U.S. travel corridors, was closed south of Washington, D.C., after a winter storm that caused at least five deaths and accidents involving several tractor-trailers. https://t.co/fJgQpAtPMw",
  "data/tweet-nytimes/2022/1/1478535477171044353.json": "Women who received Covid vaccines while pregnant were at no greater risk of delivering their babies prematurely or of giving birth to unusually small babies than pregnant women who did not get vaccinated, a new study reports. https://t.co/VY4ewSWIEZ",
  "data/tweet-nytimes/2022/1/1478522943479107585.json": "Breaking News: The House committee investigating the Jan. 6 attack has asked Sean Hannity, the Fox News host, to cooperate by answering questions about his communications with Donald Trump before and after the riot. https://t.co/qM5mA2vmji",
  "data/tweet-nytimes/2022/1/1478603212814966787.json": "Breaking News: Chicago school officials canceled classes for Wednesday amid a clash with the teachers’ union, which wants to pause in-person instruction as the Omicron variant pushes Covid cases in the city to record levels. https://t.co/8d7Itgby6l",
  "data/tweet-nytimes/2022/1/1478458728907214860.json": "April Ashley was one of the first people in Britain to undergo gender confirmation surgery. She modeled for Vogue and partied with John Lennon and Mick Jagger, all while fighting for legal recognition of her gender. She has died at age 86. https://t.co/qd9r34N7Oq",
  "data/tweet-nytimes/2022/1/1478675173977071616.json": "President Emmanuel Macron of France is facing a backlash after arguing that the government should make life miserable for the unvaccinated. His blunt statement comes as Covid infection rates spike ahead of a key presidential election.\nhttps://t.co/jYMn3s0zWI",
  "data/tweet-nytimes/2022/1/1478686483255021571.json": "Canada has reached a $31.5 billion settlement to repair its child welfare system and compensate Indigenous families separated by the government. https://t.co/NHKg8JMYDA https://t.co/kcRQ8tXBo7",
  "data/tweet-nytimes/2022/1/1478527946583420929.json": "President Biden announced on Tuesday that the U.S. government doubled its order for Pfizer's Covid pills, bringing the total order to 20 million treatment courses. https://t.co/8OFzlgi85a https://t.co/Q1hy0Yd0Pc",
  "data/tweet-nytimes/2022/1/1478709127799050241.json": "The news that Novak Djokovic, a prominent vaccination skeptic, received a medical exemption to play in the Australian Open, a procedure that suggested he remained unvaccinated against Covid, prompted outrage from some in Australia.\nhttps://t.co/WrlVw9WPWe",
  "data/tweet-nytimes/2022/1/1478847707640967168.json": "Breaking News: Novak Djokovic was refused entry to Australia and asked to leave the country after a 12-hour airport standoff over the validity of his visa and questions about his vaccine medical exemption for the Australian Open. https://t.co/B2wgwmj8OB",
  "data/tweet-nytimes/2022/1/1478845030710353925.json": "President Emmanuel Macron of France said Wednesday that he wanted to anger millions of his citizens who refuse to get vaccinated by squeezing them out of the country’s public spaces. https://t.co/yFBJ41tozj",
  "data/tweet-nytimes/2022/1/1478868944954044417.json": "Attorney General Merrick Garland vowed on Wednesday that the Justice Department would pursue its inquiry into the Capitol riot “at any level,” saying he would defend democratic institutions from attack and threats of violence. https://t.co/Ki1Jd1fCaK https://t.co/AZZEr1KXm7",
  "data/tweet-nytimes/2022/1/1478901665717760012.json": "Novak Djokovic was told to leave Australia following a 10-hour standoff with government officials at a Melbourne airport, ending his chance to defend his Australian Open title. https://t.co/2VhV1Gr1Wk https://t.co/EP7Xyjywov",
  "data/tweet-nytimes/2022/1/1478866223697960967.json": "Breaking News: A Russian-led military alliance said that it would send peacekeeping forces to Kazakhstan to help put down growing protests. https://t.co/1wHRkaCqQ0",
  "data/tweet-nytimes/2022/1/1478762374928732160.json": "Audie Cornish, a host of NPR’s \"All Things Considered,\" is leaving her job, becoming the latest prominent journalist of color to leave the public broadcaster. https://t.co/1XU1I0DbRT",
  "data/tweet-nytimes/2022/1/1478415933215551490.json": "Green: OK to hug.\nYellow: Let’s do the elbow/fist bump.\nRed: Let’s wave hello.\n\nEmployers who want workers to come back to their desks are trying to accommodate different degrees of Covid risk tolerance. Enter the humble wristband. https://t.co/fbTiMBsov7",
  "data/tweet-nytimes/2022/1/1479124383000113158.json": "Falsehoods about the Jan. 6 attack on the Capitol have persisted following efforts by Donald Trump's allies and influential conservative voices, who spent months denying, deflecting and downplaying the violence and chaos of the day. Here's a fact-check. https://t.co/RV5csyfrNm https://t.co/vIppJbeqww",
  "data/tweet-nytimes/2022/1/1479115618506866699.json": "Rep. Liz Cheney tells The Daily that the Republican Party and the country are at risk if her colleagues remain loyal to Donald Trump and \"the Big Lie\" for political reasons. Listen to our interview with Cheney a year after the Jan. 6 Capitol riot. https://t.co/5mJyvuEm7E https://t.co/rV0DJUaort",
  "data/tweet-nytimes/2022/1/1479110555000393730.json": "President Biden used the setting of his speech about the deadly Jan. 6 attack — the Capitol itself — to denounce the ransacking of the seat of American democracy.\n\nFollow our live updates. https://t.co/GghYP0YcIq https://t.co/x4Yg5SOLXy",
  "data/tweet-nytimes/2022/1/1479077309831393288.json": "People who have pets instead of children, Pope Francis said, were being selfish, exhibiting a “denial of fatherhood or motherhood” that “diminishes us, it takes away our humanity.” https://t.co/LTkrJKskqn",
  "data/tweet-nytimes/2022/1/1479043525199249413.json": "Breaking News: President Biden is expected to give a speech today warning Americans that peaceful democracy is at risk, one year after the Jan. 6 Capitol riot. https://t.co/8BKNyYAp7U",
  "data/tweet-nytimes/2022/1/1479011125995913219.json": "Novak Djokovic was told to leave Australia on Thursday following a 10-hour standoff with government officials at a Melbourne airport, ending his chance to defend his Australian Open title. https://t.co/wKDjfd81i1",
  "data/tweet-nytimes/2022/1/1478876495988805633.json": "For years, someone has been stealing hundreds of unpublished manuscripts by impersonating editors, authors, agents and scouts. Today, the FBI arrested Filippo Bernardini, an Italian citizen who worked at a major publisher.\nhttps://t.co/8y9SzjjCuh",
  "data/tweet-nytimes/2022/1/1478837470712283136.json": "Gov. Kathy Hochul of New York said Wednesday that she would propose spending $10 billion to help rebuild a health care work force exhausted and depleted by the pandemic. https://t.co/HHqtSF6rHk https://t.co/ioWHVjC6Hm",
  "data/tweet-nytimes/2022/1/1478769624737058818.json": "Three minutes of a home movie from 1938, the subject of a new documentary, depict Jewish life in a Polish town just before the Nazi invasion.\n\n\"When you see it, you want to scream to these people run away, go, go, go.\" https://t.co/NpCLhkTnoH",
  "data/tweet-nytimes/2022/1/1478730527167369216.json": "President Emmanuel Macron of France is facing a backlash after arguing that the government should make life miserable for the unvaccinated. His blunt statement comes as Covid infection rates spike ahead of a key presidential election.\nhttps://t.co/BA7Wo85qV2",
  "data/tweet-nytimes/2022/1/1479135255466545152.json": "Breaking News: Six advisers to President Biden’s transition team urged him to change his Covid strategy to address the \"new normal\" of living with the virus indefinitely, not wiping it out. https://t.co/1f4pjMFJ3p",
  "data/tweet-nytimes/2022/1/1479161361901015046.json": "President Biden on Thursday denounced Donald Trump for spreading lies about the 2020 election. \"I’ll allow no one to place a dagger at the throat of democracy,\" Biden said. https://t.co/wu3Cvm3xmL https://t.co/51qicotJp3",
  "data/tweet-nytimes/2022/1/1479176027339374606.json": "Top Republicans were nowhere to be found at the Capitol on Thursday as President Biden and lawmakers marked a year since the Jan. 6 riot, reflecting the party's refusal to accept or address its own role in stoking the violent attack. https://t.co/DJf2ikJMxY",
  "data/tweet-nytimes/2022/1/1479163847672012802.json": "Breaking News: Peter Bogdanovich, who directed films like \"The Last Picture Show\" and \"Paper Moon\" before a public fall from grace, is dead at 82. https://t.co/tkdRkvaQhL",
  "data/tweet-nytimes/2022/1/1479169688424828933.json": "Representatives Matt Gaetz and Marjorie Taylor Greene on Thursday went on Steve Bannon's show to try to redirect blame for the Capitol attack. They offered little evidence for their claims during the appearance. https://t.co/mAPaUHHJnn",
  "data/tweet-nytimes/2022/1/1479167157040824329.json": "President Biden accused Donald Trump of spinning a \"web of lies\" and imperiling democracy in a speech on the anniversary of the Capitol attack, calling the actions of Trump and his supporters \"un-American.\" https://t.co/p6spAT6zO0 https://t.co/UWdN38GqYc",
  "data/tweet-nytimes/2022/1/1479211607439908864.json": "The New York Times reached a $550 million deal to buy The Athletic, an online sports news outlet with 1.2 million subscriptions. https://t.co/gVJ0oygqnD",
  "data/tweet-nytimes/2022/1/1479131406370488326.json": "A Shiloh Shepherd dog in Vermont is being hailed as a \"real-life Lassie\" after getting help for two people injured in a pickup crash. But the science around such incidents remains unsettled. https://t.co/iqyMcQe73p",
  "data/tweet-nytimes/2022/1/1479173471850713088.json": "A Canadian law banning so-called conversion therapy is poised to go into effect on Friday, making it a crime to provide or promote services intended to change or repress a person’s sexual orientation or gender expression. https://t.co/eCNQGZILnQ",
  "data/tweet-nytimes/2022/1/1479233868603531267.json": "Representative Liz Cheney, and her father, Dick Cheney, the former vice president, were greeted warmly by Democrats at a Jan. 6 observance in the House chamber. They were the only Republicans present for a moment of silence. https://t.co/m25nSfvQL4",
  "data/tweet-nytimes/2022/1/1479231328361107457.json": "The Jan. 6 Capitol riot was perhaps the most documented act of political violence in history. Our investigation synchronized and mapped thousands of videos from that day, providing the most complete picture to date of what happened. https://t.co/Py0b84N2wX https://t.co/2MnqOu1grD",
  "data/tweet-nytimes/2022/1/1479274111864082432.json": "The Mayo Clinic said it would dismiss about 1% of its employees after they failed to comply with the clinic’s Monday deadline for its vaccine program. “The needs of the patient come first,” the health system said. https://t.co/ayYlyTYRd2",
  "data/tweet-nytimes/2022/1/1479147044489019392.json": "In Opinion\n\n“The most serious attempt to overthrow the American constitutional system since the Civil War would not have been feasible without the influence of America’s Christian nationalist movement,” writes Katherine Stewart, an author, in a guest essay.https://t.co/vCta7LlTQC",
  "data/tweet-nytimes/2022/1/1479296751458820106.json": "Falsehoods about the Jan. 6 attack on the Capitol have persisted following efforts by Donald Trump's allies and influential conservative voices, who spent months denying, deflecting and downplaying the violence and chaos of the day. Here's a fact-check. https://t.co/0e5QEZkzuY https://t.co/ARQQdusyEz",
  "data/tweet-nytimes/2022/1/1479482024251510792.json": "Breaking News: Sidney Poitier, the first Black performer to win an Oscar for best actor, is dead at 94. He was known for his portrayal of determined, dignified heroes in films like “To Sir With Love” and “Guess Who’s Coming to Dinner.” https://t.co/KJSfkFB4LR https://t.co/fQJhalOxS9",
  "data/tweet-nytimes/2022/1/1479490531101224966.json": "Sidney Poitier was the first Black performer to win the best actor Oscar. Throughout his career, a heavy weight of racial significance bore down on him. “I felt very much as if I were representing 15, 18 million people with every move I made,” he once said.https://t.co/d8qSjGiMm2",
  "data/tweet-nytimes/2022/1/1479438938179878922.json": "Before, during and now after her conservatorship, Britney Spears has used dance to assert her power and connect with her audience, conjuring a world of her own making in which she really is the boss, Madison Mainwaring writes.\nhttps://t.co/srMIxkv3n2",
  "data/tweet-nytimes/2022/1/1479505640875864068.json": "Sidney Poitier, who has died at age 94, was modest about his career, despite his role in changing American perceptions of race and opening the door to a new generation of Black actors. https://t.co/NCYi7kj13i https://t.co/BxCkb6QxwQ",
  "data/tweet-nytimes/2022/1/1479513218288660482.json": "Sidney Poitier, the pioneering actor who died at 94, has been chronicled in The New York Times for decades. Here is a look back at some of the coverage over the years. https://t.co/zNvT8x0VNZ https://t.co/e4GH5YTzZp",
  "data/tweet-nytimes/2022/1/1479498241007886345.json": "An 85-year-old retired postman in India says he has gotten 12 Covid vaccine shots, and still wants more. He believes the doses healed many of his ailments. “My backache has improved, my general weakness improved, and my appetite improved,” he said. https://t.co/lvG57XFGkZ",
  "data/tweet-nytimes/2022/1/1479528280780939269.json": "Barack Obama, who awarded Sidney Poitier with the Presidential Medal of Freedom during his first term, honored the actor on Friday, praising Poitier’s “singular talent” and ability to reveal “the power of movies to bring us closer together.” https://t.co/WbQJkHRBJJ https://t.co/KY4BJ8oBjI",
  "data/tweet-nytimes/2022/1/1479520739116167173.json": "Oprah Winfrey added her condolences to the chorus of praise for Sidney Poitier, calling him a mentor, friend, brother and confidant.\n\n“For me, the greatest of the ‘Great Trees’ has fallen,” she wrote. “He had an enormous soul I will forever cherish.” https://t.co/bt215kOLQH https://t.co/hVOXynhQIG",
  "data/tweet-nytimes/2022/1/1479548549960540170.json": "Breaking News: The three men convicted of killing Ahmaud Arbery were sentenced to life in prison. Only one will be eligible for parole. https://t.co/eIf85XjMkl",
  "data/tweet-nytimes/2022/1/1479545902473875461.json": "Before his death, Sidney Poitier’s family had agreed to work with a group of theater makers on a play about his life. The play is an adaptation of Poitier’s memoir, “The Measure of a Man: A Spiritual Autobiography.” https://t.co/7z7EaARsqS",
  "data/tweet-nytimes/2022/1/1479557234262745090.json": "The three men convicted of killing Ahmaud Arbery were sentenced to life in prison. Only one will be eligible for parole. https://t.co/ncXmXN1D9x https://t.co/c1bTZRuBxE",
  "data/tweet-nytimes/2022/1/1479566028837425153.json": "The prime minister of the Bahamas, Philip Davis, has ordered Bahamian flags in the country and at its embassies around the globe to be lowered to half-staff in tribute to Sidney Poitier. “Our country is in mourning,” he said. https://t.co/RCXdTS9wDa https://t.co/J2kGCD4xT4",
  "data/tweet-nytimes/2022/1/1479598758786707468.json": "Children who have recovered from Covid-19 appear to be at significantly increased risk of developing Type 1 or Type 2 diabetes, CDC researchers reported on Friday. https://t.co/tFTcb80MeR",
  "data/tweet-nytimes/2022/1/1479581156391759873.json": "Sidney Poitier made history in 1964 as the first Black performer to win an Oscar in the best-actor category, for the comedy-drama \"Lilies of the Field.\" Watch his acceptance speech here. https://t.co/DwN3EcS2b4",
  "data/tweet-nytimes/2022/1/1479447511458852876.json": "Breaking News: U.S. employers added only 199,000 jobs in December as hiring slowed and the economy stumbled, even before Omicron threatened the labor market.\nhttps://t.co/Tp0XMQ6FRh",
  "data/tweet-nytimes/2022/1/1479603812373614597.json": "A Georgia judge sentenced the three men convicted of killing Ahmaud Arbery to life in prison. Only one will be eligible for parole. https://t.co/13OJC0lTAA https://t.co/k9q5ML9ot5",
  "data/tweet-nytimes/2022/1/1479543390664597504.json": "At a time when Hollywood often relegated Black actors to roles as servants, Sidney Poitier was rarely a supporting player. These 11 movies, available to stream, span the 1950s to the ‘90s and highlight what made him popular with white and Black audiences. https://t.co/myzHaL4aeJ",
  "data/tweet-nytimes/2022/1/1479422614682677252.json": "Luiza Trajano, who turned a small family store into a Brazilian retail giant, has spoken bluntly about race, inequality and domestic violence.\n\nNow, a company policy limiting its executive training program to Black applicants is drawing praise and outrage. https://t.co/EcF52ebvOZ https://t.co/nco0fcX6vb",
  "data/tweet-nytimes/2022/1/1479362187810553858.json": "Women who received Covid shots had slightly longer menstrual cycles after being vaccinated, a study found, validating anecdotal reports of erratic cycles. But their periods themselves were not prolonged, and bounced back to normal within one or two months. https://t.co/5DR6PofP8U",
  "data/tweet-nytimes/2022/1/1479664182085750784.json": "On Friday, Amy Schneider became the first woman in the history of “Jeopardy!” to surpass $1 million in winnings during regular-season play. https://t.co/l2ZaeDs22O",
  "data/tweet-nytimes/2022/1/1479392401793953792.json": "Pakistan cleared the way for the first woman in its history to become a Supreme Court justice with the nomination of Justice Ayesha Malik to the top court. The move was hailed by lawyers and activists after decades of struggle for greater representation. https://t.co/laBEqD1XTL",
  "data/tweet-nytimes/2022/1/1479567282980405255.json": "Citigroup will dismiss unvaccinated employees by the end of the month as it presses on with a vaccine requirement the company announced in October. More than 90% of its 65,000 U.S. employees have complied with the requirement. https://t.co/Xl94a1Pxgo",
  "data/tweet-nytimes/2022/1/1479623906114019329.json": "\"Were anyone to ask me who’s the greatest American movie star,\" @Wesley_Morris writes, \"my answer would never change. And it will never change because the answer is easy. The greatest American movie star is Sidney Poitier.\" https://t.co/YtERPb4Ijf",
  "data/tweet-nytimes/2022/1/1479584898759471111.json": "In an instant, Sidney Poitier moved America into the age of Black Power, our critic writes. The year, 1967. The movie, “In the Heat of the Night.” It was “the slap heard around the world.” https://t.co/Inv9BzZ8eQ",
  "data/tweet-nytimes/2022/1/1479618895715708928.json": "A group of Canadian social media influencers and others flouted Covid-19 rules on a flight to Cancún, Mexico, resulting in airlines leaving many of them without a way home. https://t.co/LwEjVG33sa",
  "data/tweet-nytimes/2022/1/1479837841391763462.json": "Amy Schneider has become the first woman in the history of “Jeopardy!” to surpass $1 million in winnings during regular-season play. https://t.co/NpiB2l51Cr",
  "data/tweet-nytimes/2022/1/1479827750953394177.json": "“Dear Mom, Received another letter from you today and was happy to hear that everything is okay,” a 22-year-old soldier wrote on Dec. 6, 1945. “As for myself, I’m fine and getting along okay.”\n\nLast month, his letter was finally delivered. https://t.co/h7AzVBjd4H",
  "data/tweet-nytimes/2022/1/1479822722070949899.json": "New York Times readers are honoring Sidney Poitier by sharing tributes and memories.\n\nJoin the conversation: https://t.co/yB5nBP8Dn9 https://t.co/bqpS0DgjGV",
  "data/tweet-nytimes/2022/1/1479879078744412160.json": "In Opinion\n\n\"The Australian Border Force did what sports bodies are failing to do: say no. If athletes don’t like restrictions imposed on the unvaccinated, they could just get a shot like millions of other people,\" Lindsay Crouse writes. https://t.co/Ws8u67yADh",
  "data/tweet-nytimes/2022/1/1479886912785629197.json": "The James Webb Space Telescope has completed a final, crucial step: unfolding the last section of its golden, hexagonal mirrors. That amounts to it becoming fully deployed, according to NASA. https://t.co/rFaacTdYx2",
  "data/tweet-nytimes/2022/1/1479864259270123533.json": "In Opinion\n\n\"It’s disgusting that Republicans could not honor the institution they took an oath to protect, or even show up for the cops and other staffers they see every day who were traumatized by Jan. 6,\" Maureen Dowd writes. https://t.co/8tb6kOT8HP",
  "data/tweet-nytimes/2022/1/1479841986920255489.json": "Virus cases have hit new highs in the U.S.\nHospitalizations topped the height of the Delta wave.\nDeaths are starting to rise.\n\nIf the Omicron variant is less severe overall, it can be hard to understand the trends. Here’s how to think about the data now. https://t.co/GroeWzHhWi",
  "data/tweet-nytimes/2022/1/1479928415432105986.json": "Yao Pan Ma, an immigrant from China who was left in a coma after a brutal assault in April, died last week. The police called the attack a hate crime, and Ma, 61, had been a ventilator and was hospitalized since the assault occurred in East Harlem. https://t.co/xl8iWqsQBW",
  "data/tweet-nytimes/2022/1/1479880601595518984.json": "Russian forces now surround Ukraine on three sides — about 100,000 troops, according to Ukrainian and Western officials. See where, and why Western officials fear a military operation could start as soon as this month. https://t.co/pp9cHGz2cs",
  "data/tweet-nytimes/2022/1/1479885626556174336.json": "Luiza Trajano turned a small family store into a retail giant. Parties across the political spectrum have begged her to run for office — seeing in her a rare blend of pragmatism, charisma and smarts. https://t.co/fLdyzoHKBa https://t.co/bDf9lAp4B0",
  "data/tweet-nytimes/2022/1/1479922627762429955.json": "The number of hospitalized young children infected with the coronavirus rose precipitously last week to the highest levels since the beginning of the pandemic, according to data released on Friday by the CDC. Here's what to know. https://t.co/pLsf0QfqRI https://t.co/ATv7xT3E3K",
  "data/tweet-nytimes/2022/1/1480162512201035781.json": "Cinnamon rolls are always a good idea. This recipe comes together in under an hour. https://t.co/z23ge02pim https://t.co/JOAhBLcSCh",
  "data/tweet-nytimes/2022/1/1480181331908870148.json": "A clip of an exasperated Elmo on “Sesame Street” has captivated people online who see a reflection of their own frustrations. https://t.co/WMzoJzeg8Q",
  "data/tweet-nytimes/2022/1/1480212120595742723.json": "It’s too soon to predict the full impact Omicron could have on deaths and illness across the U.S. \n\nBut data in some of the earliest-hit cities is beginning to show what the future could hold. Here's what it shows. \n\nhttps://t.co/v3mJZ63Gji",
  "data/tweet-nytimes/2022/1/1480302155999457285.json": "A fire in a Bronx apartment building on Sunday killed at least 19 people, including nine children. A total of 63 people were injured.\n\n“This is going to be one of the worst fires that we have witnessed during modern times,” Mayor Eric Adams said. https://t.co/zHSQITGAtK https://t.co/Cl2pFncv1G",
  "data/tweet-nytimes/2022/1/1480177572113702918.json": "\"You’re seeing a broken system breaking down even further.\" A year into President Biden's term, only 41% of his nominees for Senate-confirmed posts have been approved, a new analysis found, the worst rate in decades. https://t.co/1xxJlMwabU",
  "data/tweet-nytimes/2022/1/1480271722918170638.json": "Breaking News: At least 19 people were killed, including 9 children, in a fire at a Bronx apartment building on Sunday. “The numbers are horrific,” Mayor Eric Adams said. Follow live updates here:\nhttps://t.co/U7bqiODZNt",
  "data/tweet-nytimes/2022/1/1480352467204325384.json": "Bob Saget, the actor known as Danny Tanner on “Full House” and the host of “America’s Funniest Home Videos,” has died. He was 65. https://t.co/PxNxEKYDdN https://t.co/k5sYJlZ09n",
  "data/tweet-nytimes/2022/1/1480351406913687558.json": "Breaking News: Bob Saget, the comedian and actor known for his role in “Full House” and as host of “America’s Funniest Home Videos,” has died at 65. https://t.co/d1tf4IM7Zj",
  "data/tweet-nytimes/2022/1/1480376864795512832.json": "\"I will never ever have another friend like him,\" John Stamos, who starred alongside Bob Saget in \"Full House,\" said in a tweet. \"I love you so much Bobby.\" https://t.co/mChbeu83UN https://t.co/ef8A2o3UcS",
  "data/tweet-nytimes/2022/1/1479972451396292608.json": "Jumping rope isn’t just for little kids and boxing montages. It's also a portable workout that builds strength, speed, and protects our bodies as we age. https://t.co/Ctf7WXkEcO",
  "data/tweet-nytimes/2022/1/1480429158329106437.json": "Breaking News: Novak Djokovic won a legal victory in his bid to avoid deportation from Australia and compete for a record 21st Grand Slam tennis title. https://t.co/wMtgtYGDr1",
  "data/tweet-nytimes/2022/1/1480336679894409216.json": "\"I almost got lost because it was so dark.\"\n\nResidents who survived the deadly fire in the Bronx on Sunday described a quiet morning that suddenly was overtaken by terror and tragedy. https://t.co/23F1OsKuUK",
  "data/tweet-nytimes/2022/1/1480333599777951746.json": "Josh Wardle, a software engineer in Brooklyn, knew his partner loved word games and created a guessing game for the two of them called Wordle. Just over two months after releasing it to the rest of the world, the once-a-day game has over 300,000 players. https://t.co/4hXBfIapxX",
  "data/tweet-nytimes/2022/1/1480317646532927495.json": "Mayor Eric Adams said Sunday's deadly fire in the Bronx was likely caused by a space heater. At least 19 people, including nine children, were killed. https://t.co/XA06IZBXO0",
  "data/tweet-nytimes/2022/1/1480524886821031938.json": "\"I will never ever have another friend like him,\" John Stamos, who starred alongside Bob Saget in \"Full House,\" said in a tweet. \"I love you so much Bobby.\" https://t.co/AJ6pUaBAff https://t.co/RZbGFaynCf",
  "data/tweet-nytimes/2022/1/1480108353359646720.json": "Scientists say a microscopic battle between fungus and bacteria on the skin of hedgehogs provides evidence that antibiotic resistance can occur in nature. https://t.co/Kzk1cidC0d",
  "data/tweet-nytimes/2022/1/1479930930995286017.json": "Never miss a meteor shower, eclipse or rocket launch again. https://t.co/J56IdaHRIN https://t.co/kSWu2GobTV",
  "data/tweet-nytimes/2022/1/1480612250452996102.json": "Breaking News: Robert Durst, the real estate tycoon who was long suspected in three killings, and found guilty of one of them, is dead at 78. https://t.co/wRM3cox34D",
  "data/tweet-nytimes/2022/1/1480619228390731781.json": "Clay Aiken, the former “American Idol” contestant, said that he was running for Congress in North Carolina. On his new website, Aiken, 43, referred to himself as a “loud and proud Democrat.” https://t.co/ov8WGN4XNY",
  "data/tweet-nytimes/2022/1/1480646441420873730.json": "Breaking News: A man received a new heart from a genetically modified pig, a medical first that offers hope to hundreds of thousands of patients with failing organs. https://t.co/CMQEPN9IL9 https://t.co/wSYwFwmqV9",
  "data/tweet-nytimes/2022/1/1480600418644336642.json": "Misinformation about Covid-19 tests — including PCR and at-home tests — has spiked across social media in recent weeks. The burst of misinformation threatens to further stymie public efforts to keep the health crisis under control. https://t.co/3gKByPKSzU https://t.co/cF9XYJWbTl",
  "data/tweet-nytimes/2022/1/1480656096519933957.json": "Breaking News: Privately insured Americans can be reimbursed starting Saturday for eight at-home coronavirus tests per person per month under a new plan announced on Monday by the Biden administration.\nhttps://t.co/Ze3y0gEx7h",
  "data/tweet-nytimes/2022/1/1480656968599625738.json": "In a first, a man receives a heart from a genetically altered pig https://t.co/gLavGM2fu2",
  "data/tweet-nytimes/2022/1/1480585287570919426.json": "Rapid at-home Covid tests are inaccessible to blind people as they require complex steps and have no Braille guides. Some apps offer support, but these interactions are difficult, and not everyone who is blind is able to use a smartphone. https://t.co/f9EGgV6vdW",
  "data/tweet-nytimes/2022/1/1480708545104556037.json": "For the first time, surgeons have successfully transplanted a genetically altered pig’s heart into a patient. The procedure may bring new hope to hundreds of thousands of people with organ failure. https://t.co/UFkJnUHTU5",
  "data/tweet-nytimes/2022/1/1480751355006537731.json": "Rachel Balkovec, a groundbreaking baseball coach, will become the manager of a team in the Yankees’ minor league system, making her the first woman to lead an affiliated professional baseball squad.\nhttps://t.co/HmEAMiiTZm",
  "data/tweet-nytimes/2022/1/1480700995885797383.json": "The number of Americans hospitalized with Covid-19 is higher than last winter’s peak as Omicron tears through the U.S. and overwhelms hospitals. https://t.co/viN5ezgEss",
  "data/tweet-nytimes/2022/1/1480675886861008897.json": "Robert Durst, the real estate tycoon who was long suspected in three killings, and found guilty of one of them, has died at age 78. https://t.co/918PkUoR7Z https://t.co/xafBIj2sia",
  "data/tweet-nytimes/2022/1/1480771476152360961.json": "David Sassoli, the president of the European Parliament, has died at 65. No cause of death was immediately available, but he had been hospitalized in Italy because his immune system was not functioning normally. https://t.co/8i5xVU3FWU",
  "data/tweet-nytimes/2022/1/1480851035778387972.json": "Breaking News: In a speech today, President Biden is expected to endorse changing rules around the Senate filibuster to pass new voting rights protections.\nhttps://t.co/BNnYUU54lM",
  "data/tweet-nytimes/2022/1/1480590289114996739.json": "Symone Sanders, the former chief spokeswoman for Vice President Kamala Harris, is joining MSNBC as an anchor and will host a new weekend program on the cable channel, the network said on Monday. https://t.co/TdTklFwMHw",
  "data/tweet-nytimes/2022/1/1480653352971218944.json": "The world is still beautiful — and in many places, things are changing for the better. Our \"52 Places\" list in 2022 is here to take you on a journey. https://t.co/DAD326gbkR https://t.co/YdPR013sx9",
  "data/tweet-nytimes/2022/1/1480940596722348037.json": "Magawa, a rat who sniffed out over 100 land mines and other explosives in Cambodia over a yearslong career, has died.\n\nThe charity that awarded him with a gold medal for his lifesaving contributions noted that \"his legacy will live on for decades to come.\" https://t.co/smtmeZvknF https://t.co/8sT5VHocxO",
  "data/tweet-nytimes/2022/1/1480907387213160457.json": "For the first time, surgeons have successfully transplanted a genetically altered pig’s heart into a patient. The procedure may bring new hope to hundreds of thousands of people with organ failure. https://t.co/HPK4YVsmlx",
  "data/tweet-nytimes/2022/1/1480868604891607050.json": "More than half of people in Europe will be infected with the coronavirus in the next six to eight weeks, the World Health Organization warned on Tuesday, amid “a new west-to-east tidal wave sweeping across the region.”\nhttps://t.co/MH3IpB2BqX",
  "data/tweet-nytimes/2022/1/1480952657686761476.json": "The writer and poet Maya Angelou has become the first Black woman to be featured on a quarter. The coins began shipping this week and are the first in a series that will commemorate female pioneers in various fields. https://t.co/5xH1j6KZi1",
  "data/tweet-nytimes/2022/1/1480977883183128578.json": "The writer and poet Maya Angelou has become the first Black woman to be featured on a quarter. The coins began shipping this week and are the first in a series that will commemorate female pioneers in various fields. https://t.co/l77iP5ruXG https://t.co/CEfSsqGxKc",
  "data/tweet-nytimes/2022/1/1481023139551264770.json": "After learning that he tested positive for the coronavirus, Novak Djokovic still continued making public appearances without a mask. Here's a comprehensive timeline of his whereabouts since the mid-December test. https://t.co/4emon78D8D https://t.co/gHZshyNTS9",
  "data/tweet-nytimes/2022/1/1481053358182088705.json": "Dr. Anthony Fauci and Senator Rand Paul engaged in a fierce back-and-forth during a Senate hearing on the federal government’s Covid response on Tuesday. \"In usual fashion, you are distorting everything about me,\" Fauci said to Paul. https://t.co/x5vYsSNVGn https://t.co/qumpC3DaHc",
  "data/tweet-nytimes/2022/1/1481102394108882944.json": "Omicron causes less severe disease than other coronavirus variants, according to a new study of nearly 70,000 Covid patients in California. The research aligns with similar findings from South Africa, Britain and Denmark. https://t.co/ta5K0Tq7J2",
  "data/tweet-nytimes/2022/1/1481132340311175170.json": "Novak Djokovic acknowledged that a travel document he presented to Australian border officials last week contained false information. He also said that he participated in an interview and photo shoot in Serbia after testing positive for Covid. https://t.co/Uj10Q52e0K",
  "data/tweet-nytimes/2022/1/1480898556064063489.json": "Private insurers will soon have to cover the cost of eight at-home coronavirus tests per member per month, the Biden administration said Monday. https://t.co/OeLE0z8QFw",
  "data/tweet-nytimes/2022/1/1480957698627805186.json": "More than half of people in Europe could be infected with Omicron in the next six to eight weeks, the WHO warned on Tuesday, adding that for countries not yet hit with the surge, \"there is a closing window to act now and plan for contingencies.\" https://t.co/tCmM0DjBi7",
  "data/tweet-nytimes/2022/1/1481068538999758848.json": "After learning that he tested positive for the coronavirus, Novak Djokovic still continued making public appearances without a mask. Here's a comprehensive timeline of his whereabouts since the mid-December test. https://t.co/xQ8XT6r1Ra",
  "data/tweet-nytimes/2022/1/1481241564726890497.json": "Novak Djokovic acknowledged that a travel document he presented to Australian border officials last week contained false information. He also said that he participated in an interview and photo shoot in Serbia after testing positive for Covid. https://t.co/RK0ky5vHo9",
  "data/tweet-nytimes/2022/1/1481268191603134466.json": "Penélope Cruz feels a mystical connection with the director Pedro Almodóvar. “We know each other, we can feel each other, we can read each other’s minds.”\n\nTheir seventh collaboration, “Parallel Mothers,” is one of their greatest, Kyle Buchanan writes.\nhttps://t.co/nb0mnrgp3m https://t.co/nQuFjK3Q69",
  "data/tweet-nytimes/2022/1/1481291216658575360.json": "A lawsuit against Prince Andrew brought by Virginia Giuffre, a woman who claimed he raped her when she was a teenager, will be allowed to proceed after a federal judge in Manhattan denied Andrew’s request to dismiss the suit.\nhttps://t.co/1tFXobIXM2",
  "data/tweet-nytimes/2022/1/1481083578670886913.json": "\"Don’t Look Up,\" a satirical film about a comet hurtling toward Earth, is a metaphor for climate change. And it's struck a nerve at a time when leaders are failing to take measures to tackle the planet emergency, writes @caraNYT, our climate reporter. https://t.co/smPvdETqOd",
  "data/tweet-nytimes/2022/1/1481312549727612930.json": "Donald Trump abruptly ended an interview with NPR on Tuesday after Steve Inskeep, a co-host of \"Morning Edition,\" repeatedly pushed back against his false claims about the 2020 election. https://t.co/AbSxLE0JCV",
  "data/tweet-nytimes/2022/1/1481302526490292226.json": "Cigarettes are still the No. 1 cause of preventable death in the U.S., according to the CDC. Yet, in 2020, for the first time in two decades, cigarette sales increased. https://t.co/LnnIEhh8so",
  "data/tweet-nytimes/2022/1/1481287405860753410.json": "Being physically active halves the risk of developing clinical anxiety over time, a study of almost 200,000 cross-country skiers found. Researchers in Sweden said almost any kind of aerobic activity likely helps protect us against excessive worry and dread.https://t.co/8UkS6JRanr",
  "data/tweet-nytimes/2022/1/1481395589799682050.json": "Ronnie Spector, the lead singer of the 1960s vocal trio the Ronettes, which released hits like “Be My Baby,” died on Wednesday. She was 78. https://t.co/c1nAKEBEmD",
  "data/tweet-nytimes/2022/1/1481109956468293635.json": "The Justice Department is creating a unit to fight domestic terrorism at a time when the threat of violent extremism has increased, a top official said on Tuesday. https://t.co/MOCBJgFOYj",
  "data/tweet-nytimes/2022/1/1481254700670464009.json": "Covid-19 was the leading cause of death for police officers in the U.S. for the second year in a row, a new report found. 301 law enforcement officers died in the line of duty because of direct exposure to the virus, it said. https://t.co/gpovMkikew",
  "data/tweet-nytimes/2022/1/1481433332789436417.json": "At 17, Genevieve Beacom became the first woman to play for one of Australia’s top pro baseball teams. With a fastball that tops out at 84 miles per hour, a solid changeup and an elliptical curve, she hopes her next stop is college ball in the U.S. https://t.co/MbA7hFx35l https://t.co/XwQVdnVYYq",
  "data/tweet-nytimes/2022/1/1481347793998524421.json": "Shirley McGreal, who became a formidable voice against man-made misery suffered by primates, died at age 87. She exposed smuggling rings and research laboratories and built a sanctuary for gibbons in South Carolina. https://t.co/xr0JpXhhLI",
  "data/tweet-nytimes/2022/1/1481666642958594049.json": "Breaking News: Navient, once one of the largest student loan servicing companies in the U.S., reached a deal to forgive $1.7 billion in debts for nearly 66,000 borrowers and pay $95 million to settle claims of predatory lending. https://t.co/G68evPaCDW",
  "data/tweet-nytimes/2022/1/1481665661139140616.json": "Breaking News: The Republican National Committee is preparing to require presidential candidates to not participate in debates run by the long-established commission. https://t.co/KpkOKAQjOB",
  "data/tweet-nytimes/2022/1/1481381754967572491.json": "Jonny Greenwood achieved global fame in Radiohead before starting to score films. Now, with 11 scores to his name, including “The Power of the Dog” and “Spencer,” he’s proven it’s no mere side hustle.\nhttps://t.co/GRjfDuwtz5",
  "data/tweet-nytimes/2022/1/1481683743760961536.json": "More than 100 leading American doctors and scientists have signed an open letter in support of Dr. Anthony Fauci, calling Republican attacks on him “inaccurate, unscientific, ill-founded in the facts and, increasingly, motivated by partisan politics.” https://t.co/XQGuoM6VfE",
  "data/tweet-nytimes/2022/1/1481682234167992324.json": "Breaking News: Prince Andrew has given up his military titles and royal charities, Buckingham Palace said, a stinging rebuke by the British royal family a day after a New York judge allowed a sexual abuse case against him to go ahead. https://t.co/x88Gc5EOYN",
  "data/tweet-nytimes/2022/1/1481698410315108357.json": "Breaking News: Stewart Rhodes, the leader and founder of the Oath Keepers militia, was arrested and charged with seditious conspiracy in connection with the Capitol riot, officials said. https://t.co/OINKubKTgW",
  "data/tweet-nytimes/2022/1/1481713781248040962.json": "Breaking News: The Supreme Court blocked President Biden’s vaccine-or-testing mandate for large employers, but allowed a requirement for health care workers. https://t.co/Tg5FiVPd85",
  "data/tweet-nytimes/2022/1/1481627757025144838.json": "Breaking News: Teachers in France staged a walkout to protest changing Covid testing rules that they say are now too lax to protect against Omicron.\n\nThe country is averaging nearly 300,000 new Covid cases a day, far more than at any earlier point.\nhttps://t.co/nu2nI9w33M",
  "data/tweet-nytimes/2022/1/1481418372667478016.json": "Inflation is higher than it has been in decades. What does it mean for you? @jeannasmialek will pose reader questions to @MaryDalyEcon, president of the Federal Reserve Bank of San Francisco, on Friday at 11 a.m. ET. Join us for the conversation. @sffed https://t.co/qxz7pAsLoc",
  "data/tweet-nytimes/2022/1/1481578037883908099.json": "President Biden plans to announce the deployment of 1,000 military medical personnel to Michigan, New Jersey, New Mexico, New York, Ohio and Rhode Island to help hospitals deal with a surge in Omicron cases, White House officials said. https://t.co/BIEv5VeDqY",
  "data/tweet-nytimes/2022/1/1481713932058476548.json": "Clyde Bellecourt, a founder of the American Indian Movement who led protests in the 1970s at Wounded Knee and in Washington over the U.S. government’s grim record of broken treaty obligations, died on Tuesday at his home in Minneapolis. He was 85. https://t.co/SJsS1mjTv2 https://t.co/MjvFJ76CL2",
  "data/tweet-nytimes/2022/1/1481732839976624143.json": "A Maryland man who received a pig’s heart last week in a pioneering transplant procedure has a criminal history stemming from an incident 34 years ago in which he repeatedly stabbed a young man, leaving him paralyzed. https://t.co/Ha8m0RsbUD",
  "data/tweet-nytimes/2022/1/1481795716783783936.json": "Nicholas Alahverdian, a suspect in a 2008 rape in Utah said to have died in 2020, turned up at a hospital in Glasgow, where he had been placed on a ventilator with Covid-19, the authorities said. https://t.co/8aVSaTLX0O",
  "data/tweet-nytimes/2022/1/1481885414696882176.json": "Breaking News: Australia revoked Novak Djokovic’s visa again, another twist in a drawn-out drama over his refusal to be vaccinated against Covid-19. https://t.co/o6uD8RPplP",
  "data/tweet-nytimes/2022/1/1481898921186234373.json": "Novak Djokovic had his visa revoked for a second time by the Australian authorities. \n\nAustralia’s immigration minister said in a statement that he was canceling the tennis star’s visa on the grounds of \"health and good order.\" https://t.co/8g0CI6lNJh https://t.co/4QQrVh7M0g",
  "data/tweet-nytimes/2022/1/1481914052733460492.json": "Pregnant women with Covid are more likely to lose their fetuses and babies in the womb or shortly after birth, new research shows. \"Quite strikingly, no baby deaths occurred in women who had SARS-CoV-2 and were vaccinated,\" the paper's first author said. https://t.co/pngQ9X7Bfs",
  "data/tweet-nytimes/2022/1/1481962570546360322.json": "Novak Djokovic had his visa revoked for a second time by the Australian authorities.\n\nThe decision was made on the grounds of “health and good order,” the country’s immigration minister said, adding that it was in the public interest to do so.\nhttps://t.co/S2eBBSRgkg",
  "data/tweet-nytimes/2022/1/1481980691336384516.json": "Australia’s prime minister defended the decision to cancel Novak Djokovic’s visa again.\n\n“Australians have made many sacrifices during this pandemic, and they rightly expect the result of those sacrifices to be protected,” he said.\nhttps://t.co/iCofIY2F6w",
  "data/tweet-nytimes/2022/1/1481609489799430150.json": "The famed Southernmost Point Buoy in Key West, Florida, was set afire by a pair of men on New Year’s Day. Two suspects were identified by their bartender, who said he remembered them because they didn’t tip. https://t.co/SboFAuQhwU",
  "data/tweet-nytimes/2022/1/1482030587967946757.json": "Breaking News: The U.S. accused Russia of sending saboteurs into Ukraine to stage “a false-flag operation” that would create a pretext for Moscow to invade. https://t.co/wiSXuzwhgO",
  "data/tweet-nytimes/2022/1/1481917771726393349.json": "Hackers brought down several Ukrainian government websites, posting a message on the Foreign Ministry's site saying, “Be afraid and expect the worst.”\n\nThe cyberattack came a day after high-stakes talks intended to forestall a Russian invasion. https://t.co/TsVEKC8TW3",
  "data/tweet-nytimes/2022/1/1482015933174591499.json": "The film “Encanto” might have cautioned against talking about Bruno, but a whole lot of people are obsessed with a song about him.\n\nHere’s how Disney created “We Don’t Talk About Bruno,” its biggest smash since “Let It Go.”\nhttps://t.co/20qipDU1Ax",
  "data/tweet-nytimes/2022/1/1482060304355889152.json": "Breaking News: The Ohio Supreme Court struck down a congressional map skewed to favor Republicans, ruling it was the equivalent of a dealer stacking the deck, and sent it back to state lawmakers to try again. https://t.co/QANVHZzPPI",
  "data/tweet-nytimes/2022/1/1482078806152257542.json": "Breaking News: Americans will be able to order free rapid coronavirus tests online beginning on Wednesday, U.S. officials said. The tests should ship within 7 to 12 days. https://t.co/jlnx5daMZC",
  "data/tweet-nytimes/2022/1/1482020123389186050.json": "Breaking News:  The Treasury Department warned Arizona officials that it could claw back pandemic relief money if the state does not stop ​undercutting mask requirements in schools. https://t.co/RLGXb5EkuN",
  "data/tweet-nytimes/2022/1/1482042372594745349.json": "\"Many Australians saw in Djokovic’s actions both dishonesty and a disregard for others,\" writes @damiencave. \"Some questioned whether he had really tested positive in the first place, given the convenient timing for his vaccination exemption.\" https://t.co/e0hahLQkfv",
  "data/tweet-nytimes/2022/1/1481803265008447494.json": "The House Jan. 6 panel subpoenaed four major social media companies — Alphabet, Meta, Reddit and Twitter — criticizing them for allowing extremism to spread on their platforms and saying they have failed to cooperate adequately with the inquiry. https://t.co/WCgG6QqBoH",
  "data/tweet-nytimes/2022/1/1482133695955931136.json": "Breaking News: For the first time, the CDC said cloth masks weren’t as effective as other options. “Wear the most protective mask you can,” the agency urged. https://t.co/zOIRim0WQZ",
  "data/tweet-nytimes/2022/1/1482130418925293573.json": "Martin Shkreli, the executive who raised the price of a life-saving drug, was ordered to repay $64.6 million and barred for life from the drug industry. https://t.co/yTrclyeDou",
  "data/tweet-nytimes/2022/1/1481823427401031680.json": "Navient, once one of the largest student loan servicing companies in the U.S., reached a deal to forgive $1.7 billion in debts for nearly 66,000 borrowers and pay $95 million to settle claims of predatory lending. https://t.co/HRyCqrNml1 https://t.co/x5pYwsO6H6",
  "data/tweet-nytimes/2022/1/1481973134672769039.json": "Novak Djokovic’s lawyers went to court to challenge the second cancellation of his Australian visa. They plan to file an appeal, but the tennis star will likely be taken back into immigration detention on Saturday.\n\nRead highlights from the hearing. https://t.co/UuRO9AEaG8",
  "data/tweet-nytimes/2022/1/1482095235102556161.json": "Beatrice Mintz, a cancer researcher who discovered that nearby tissue could help tame tumor cells without the use of harsh treatments like chemotherapy and radiation, died on Jan. 3. She was 100. https://t.co/eRYqOwPai3",
  "data/tweet-nytimes/2022/1/1482102789270560771.json": "In this vegan take on an iconic Chinese American stir-fry, cauliflower steps in for the chicken. https://t.co/9hAqUFc0JL https://t.co/sNVkVWVT30",
  "data/tweet-nytimes/2022/1/1482065023967051786.json": "Common bottlenose dolphins have sex frequently — very likely multiple times in a day. A close examination of 11 clitorises from female dolphins suggests they experience pleasure during frequent sexual activity. https://t.co/mf1bFFVQAi",
  "data/tweet-nytimes/2022/1/1482246222920716292.json": "This large, fluffy pancake, first featured in The New York Times for Mardi Gras in 1983, is excellent for breakfast, brunch, lunch and dessert. https://t.co/MH4djmWmGF https://t.co/5G1OpNTbKW",
  "data/tweet-nytimes/2022/1/1482178234561269761.json": "About 8,400 grocery workers went on strike at 80 Kroger-owned King Soopers stores in Colorado, after nearly two years on the front lines. They are seeking higher wages, better personal protection equipment and improved public safety measures in stores. https://t.co/syBjsiGI4P",
  "data/tweet-nytimes/2022/1/1482361549683630084.json": "A four-foot tsunami wave was reported to have hit Tonga’s capital on Saturday, sending people rushing to higher ground. The U.S. National Tsunami Warning Center issued a tsunami advisory for the Washington and Oregon coast on Saturday morning Pacific time. https://t.co/L0JK17OkJt",
  "data/tweet-nytimes/2022/1/1482377059854921737.json": "Novak Djokovic has done potentially irreparable harm to his own image, writes Michael Steinberger in @NYTMag. \"It is a sad coda to what is widely considered the greatest era in the history of men’s tennis.\" https://t.co/1vvszDOZ3I",
  "data/tweet-nytimes/2022/1/1482447761421262854.json": "The right-wing channel One America News Network — which has spread conspiracy theories about the 2020 election, the Capitol riot and the safety of coronavirus vaccines — will be dropped by DirecTV, one of its largest distributors, later this year. https://t.co/lTSwnPBy8G",
  "data/tweet-nytimes/2022/1/1482432412474912768.json": "A newly disclosed memo circulated among top census officials cites \"unprecedented\" interference by the Trump administration in the 2020 count, including political pressure on a crash program seeking to identify and count unauthorized immigrants. https://t.co/2lvYdMD0gL",
  "data/tweet-nytimes/2022/1/1482397242841518082.json": "This modern take on a classic hot toddy can be a comforting way to celebrate staying warm on a cold winter night. https://t.co/2U4ftDDWCv https://t.co/n5Xhdt9PO0",
  "data/tweet-nytimes/2022/1/1482462612327735300.json": "The CDC conceded on Friday that cloth masks won't protect Americans against the coronavirus as effectively as surgical masks or respirators. In East Asia, where people have worn surgical masks in public for years, it was already common knowledge. https://t.co/Wwa54MIen1",
  "data/tweet-nytimes/2022/1/1482442499855720451.json": "This large, fluffy pancake, first featured in The New York Times for Mardi Gras in 1983, is excellent for breakfast, brunch, lunch and dessert. https://t.co/TWx9NASh3v https://t.co/OT3ojt9Ah5",
  "data/tweet-nytimes/2022/1/1482533113859391494.json": "The underwater volcano that erupted near Tonga was heard some 1,100 miles away in New Zealand. Internet service in Tonga was disrupted, according to The Associated Press, making the extent of injuries and damage difficult to assess. https://t.co/XNXj0tYP5w",
  "data/tweet-nytimes/2022/1/1482548207099990017.json": "Netflix says \"Don't Look Up\" is one of its most popular films ever. Some scientists are hoping its success will prompt Hollywood to make more climate focused films. https://t.co/0ubTplsYqW",
  "data/tweet-nytimes/2022/1/1482482750858960899.json": "CVS and Walgreens are temporarily closing some stores in the U.S. this weekend because of staff shortages complicated by the soaring number of people infected with Omicron. https://t.co/9WJjzqR8cl",
  "data/tweet-nytimes/2022/1/1482510850623692800.json": "Breaking News: The FBI is at Congregation Beth Israel, a synagogue in Colleyville, Texas, where an official says four people appear to have been taken hostage by a man heard shouting on a livestream.\n\nFollow live updates: https://t.co/VPuNmlYX11",
  "data/tweet-nytimes/2022/1/1482387123126906888.json": "The Covid vaccines now protecting millions of people are the culmination of decades of fundamental discoveries once shrugged off as uninteresting. Scientists never imagined their work would one day come together to tame the pandemic of the century.  \n\nhttps://t.co/ieCZ2JeDFJ",
  "data/tweet-nytimes/2022/1/1482574556002926593.json": "Breaking News: The hostages who were held by a man at a Texas synagogue for about 11 hours have all been rescued safely, Gov. Greg Abbott said. The suspect died in the standoff. \n\nhttps://t.co/8VUsyC5sGN",
  "data/tweet-nytimes/2022/1/1482635674000007171.json": "Breaking news: Novak Djokovic lost his bid to stay in Australia, as judges said the immigration minister had the right to cancel the tennis star’s visa. Djokovic expressed disappointment at the ruling. https://t.co/FINVa3GlzE",
  "data/tweet-nytimes/2022/1/1481971886947028995.json": "Sidney Poitier, the first Black man to win an Oscar, died last week at 94.\n\nHow did he change U.S. cinema? Listen to today’s episode of The Daily.\nhttps://t.co/0z4xtSepxw",
  "data/tweet-nytimes/2022/1/1482702959427338249.json": "Analysis: Novak Djokovic's loss in court on Sunday ended his bid to win a 10th Australian Open. More broadly, he lost to a government determined to make him a symbol of unvaccinated celebrity entitlement.  https://t.co/a8BFyR3Xp9",
  "data/tweet-nytimes/2022/1/1482653913711063041.json": "\"We have a big problem.\" Makers of gruyère cheese in Switzerland and France are not happy that a federal judge sided with U.S. cheese producers and said the cheese — named for the Swiss town where it's been made for centuries — could be produced anywhere. https://t.co/ZX5kreUM3f",
  "data/tweet-nytimes/2022/1/1482699173006921733.json": "James Mtume, the musician, songwriter, producer, bandleader and talk-radio host whose 1983 hit “Juicy Fruit” has been sampled in more than 100 songs, died on Sunday at his home in South Orange, New Jersey. He was 76. https://t.co/5drSG7Klj5",
  "data/tweet-nytimes/2022/1/1482764605860499460.json": "Coverage of Novak Djokovic loomed large over the Australian Open before it even began. But plenty of other tennis stars and story lines are ready for the spotlight. https://t.co/YKomnCNDvF",
  "data/tweet-nytimes/2022/1/1482711759286943750.json": "CVS and Walgreens are temporarily closing some stores in the U.S. this weekend because of staff shortages complicated by the soaring number of people infected with Omicron. https://t.co/cCuvUZKvGk",
  "data/tweet-nytimes/2022/1/1482847650105987079.json": "Pitso Mosimane enjoyed a better 2021 than almost any coach in world soccer. Just don’t expect FIFA to notice, @RorySmith writes. https://t.co/ePzLpEpXDO",
  "data/tweet-nytimes/2022/1/1482794792480391175.json": "Throngs of mourners flocked to a mosque to say a final goodbye to friends, children, parents and cousins killed in a fire that took the lives of 17 members of a close-knit Gambian community in the Bronx. https://t.co/Icd7gKlfu9",
  "data/tweet-nytimes/2022/1/1482823970261016584.json": "Mourners flocked to a mosque in the Bronx for a final goodbye to 15 of the 17 people killed in the Jan. 9 apartment building fire, which was the city’s deadliest blaze in decades. https://t.co/ySqQA43gWB https://t.co/kzR5gSbEKM",
  "data/tweet-nytimes/2022/1/1482730627342508033.json": "New bicycle trails that wind through Normandy is a rewarding way to explore the sun-dappled French countryside. https://t.co/QT9IMZ0XWR",
  "data/tweet-nytimes/2022/1/1482962294321647617.json": "Two women were swept to their deaths in Peru some 6,000 miles from an undersea volcanic eruption so powerful that it churned waters halfway across the globe. But on Sunday, there was little word from Tonga, which is just 40 miles from the explosion. https://t.co/7DytdlET3f",
  "data/tweet-nytimes/2022/1/1482744503421345798.json": "Cinnamon rolls are always a good idea. This recipe comes together in under an hour. https://t.co/fyQBcYZQvV",
  "data/tweet-nytimes/2022/1/1482986055276109826.json": "The French government passed a law making proof of vaccination a requirement for restaurants, sporting events and public venues. The move comes days after President Emmanuel Macron used a vulgarity to urge the unvaccinated to get their shots. https://t.co/KN1nYTajRx",
  "data/tweet-nytimes/2022/1/1483031414073348099.json": "Charles McGee, one of the last surviving Tuskegee Airmen, died on Sunday at 102. As a fighter pilot, he flew a total of 409 combat missions in World War II and the Korean and Vietnam Wars. https://t.co/LoeBRjGoqB",
  "data/tweet-nytimes/2022/1/1483212612192153605.json": "In Opinion\n\n“A slaughter of wolves is underway in Montana, Idaho and Wyoming that has no precedent in the past 100 years,” writes Thomas McNamee, an author, in a guest essay. “In all three states, even wolf pups can be killed.”\nhttps://t.co/zZFK51np4m",
  "data/tweet-nytimes/2022/1/1483257874834989061.json": "Ruth Bader Ginsburg made her final appearance as a lawyer before the Supreme Court in 1978. More than 40 years later, still relatively few female lawyers argue cases there, our reporter Adam Liptak writes.\nhttps://t.co/LFtKGck9Zm",
  "data/tweet-nytimes/2022/1/1483435442926202882.json": "Breaking News: Microsoft agreed to buy the video game maker Activision Blizzard for $68.7 billion, its largest takeover ever and a big bet on the metaverse.\nhttps://t.co/dDofndd8yW",
  "data/tweet-nytimes/2022/1/1483288094531293190.json": "Detainees in an Arkansas jail who had Covid were unknowingly treated by the detention center’s doctor with ivermectin, a drug that health officials have said should not be used to treat or prevent the virus, according to a new lawsuit.\nhttps://t.co/SWKKGSDZvL",
  "data/tweet-nytimes/2022/1/1483412629645410308.json": "As Tonga struggles to clean up and reconnect with the world after a volcanic eruption set off a tsunami, the country is confronting the risk that international aid workers could bring Covid to the island nation, a virus it has so far kept out.\nhttps://t.co/EaCZhSCPIe https://t.co/u6m4s5UqaL",
  "data/tweet-nytimes/2022/1/1483506997014188038.json": "Weird Al is \"absolutely thrilled\" that Daniel Radcliffe will be portraying him in an upcoming biopic, saying \"I have no doubt whatsoever that this is the role future generations will remember him for.\" https://t.co/RsGJurHba0",
  "data/tweet-nytimes/2022/1/1483650465632034820.json": "Emily’s List announced on Tuesday that it would cut off its financial support if Senator Kyrsten Sinema continues to refuse to change the Senate’s filibuster rules to allow for passage of voting rights legislation. https://t.co/Nd4M7W3nDg",
  "data/tweet-nytimes/2022/1/1483668499713167361.json": "Breaking News: New York’s attorney general said in court papers that Donald Trump’s family business repeatedly engaged in “fraudulent or misleading” practices. https://t.co/RxlIu0Ycgp",
  "data/tweet-nytimes/2022/1/1483709227784937472.json": "Breaking News: André Leon Talley, the fashion editor who went from the Jim Crow South to the front rows of Paris couture, has died at 73. https://t.co/zHMtn2sS7p",
  "data/tweet-nytimes/2022/1/1483756169730613249.json": "\"André Leon Talley was a singular force in an industry that he had to fight to be recognized in,\" Darren Walker, the president of the Ford Foundation, said, calling him a \"creative genius.\" https://t.co/wGX0oqYgCE https://t.co/4YYQmLStmZ",
  "data/tweet-nytimes/2022/1/1483655613892734977.json": "A lawyer for Britney Spears, in an effort to thwart her father’s demand that she pay his legal bills, claimed in court papers that Jamie Spears and others involved in her conservatorship committed myriad financial improprieties over several years. https://t.co/hQP99PwpRd",
  "data/tweet-nytimes/2022/1/1483763177338937347.json": "Weird Al is \"absolutely thrilled\" that Daniel Radcliffe will be portraying him in an upcoming biopic, saying \"I have no doubt whatsoever that this is the role future generations will remember him for.\" https://t.co/FeTAEdQYae",
  "data/tweet-nytimes/2022/1/1483776270261493761.json": "The Biden administration plans to give out 400 million free N95 masks at health centers and pharmacies across the U.S. Officials called the move, which will be announced Wednesday, the “largest deployment of personal protective equipment in U.S. history.” https://t.co/TI4fz4ZpMK",
  "data/tweet-nytimes/2022/1/1483793929984258050.json": "New York’s attorney general said in court papers that Donald Trump’s family business repeatedly engaged in “fraudulent or misleading” practices. The filing was a response to Trump’s effort to block the questioning of him and two of his children under oath. https://t.co/P7leDhjaPI https://t.co/uHeqUixvKY",
  "data/tweet-nytimes/2022/1/1483866873380974603.json": "Kathy Griffin, seeking a career rebirth since a Trump joke gone wrong in 2017, is asking who among the canceled gets a second chance and says she wants to \"get back to making people laugh.\" \"More than anything else, that’s what has been robbed from me.\" https://t.co/Sm2zO6BdvZ",
  "data/tweet-nytimes/2022/1/1483778821753126918.json": "“We had been driving for four hours and had yet to see another soul. No people. No cars. Just eerie, lunar nothingness stretching south to the horizon.”\n\nSee Genna Martin’s photos of Namibia’s Skeleton Coast, a region often called the end of the Earth.\nhttps://t.co/bZJV721zj6 https://t.co/eTbpT9znlD",
  "data/tweet-nytimes/2022/1/1483944985875689474.json": "Breaking News: The Supreme Court refused a request from Donald Trump to block the release of White House records concerning the Jan. 6 Capitol riot. https://t.co/8tnYTjqMyl",
  "data/tweet-nytimes/2022/1/1483965524576980996.json": "The Supreme Court refused a request from Donald Trump to block the release of White House records concerning the Jan. 6 Capitol riot, meaning there is no legal obstacle to prevent the National Archives from providing the records to the Jan. 6 committee. https://t.co/Bf9AJW5Whz https://t.co/FOoPEFIhSB",
  "data/tweet-nytimes/2022/1/1483890779563122692.json": "Florida’s top public health official in Orlando, Dr. Raul Pino, was placed on administrative leave after sending an email to his employees urging vaccination against the coronavirus. State law bans Covid vaccine mandates, including for government workers. https://t.co/lh5F1wH72u",
  "data/tweet-nytimes/2022/1/1483874120232222729.json": "Breaking News: Newly declassified videos show for the first time the botched U.S. drone strike in Kabul that killed 10 Afghan civilians. https://t.co/CM7eyge0IS",
  "data/tweet-nytimes/2022/1/1483899596002766852.json": "The removal of a Theodore Roosevelt statue at the Natural History Museum in Manhattan, which stirred protests as a symbol of colonialism and racism, has begun. It will be sent to his presidential library in North Dakota in a few weeks. https://t.co/QdKcfWEzDG https://t.co/mnqJXYZ3Du",
  "data/tweet-nytimes/2022/1/1483782572937256962.json": "Novak Djokovic’s refusal to get vaccinated against the coronavirus could exclude him from both the French and U.S. Open tournaments, reflecting a major shift in how public officials approach Covid requirements and potential exemptions.\nhttps://t.co/7opnTDtZ4e",
  "data/tweet-nytimes/2022/1/1483501951841148935.json": "In July, 100 new mothers in parts of New York City began receiving up to $1,000 a month through a privately funded program — a test in the fast-growing field of anti-poverty policy known as guaranteed income. https://t.co/XdwIk5QqYj",
  "data/tweet-nytimes/2022/1/1484030593180569605.json": "Breaking News: Most cases of the mysterious “Havana syndrome” are unlikely to have been caused by Russia or another foreign adversary, the CIA found. https://t.co/1vadnmCM2K",
  "data/tweet-nytimes/2022/1/1484082337331789824.json": "Gaspard Ulliel, the French actor known for portraying a young Hannibal Lecter and the fashion designer Yves Saint Laurent, died on Wednesday at 37, the day after a skiing accident. His death comes weeks before he was to appear in a Disney+ series. https://t.co/7vYjc0Djl2 https://t.co/XjqPOZdyVL",
  "data/tweet-nytimes/2022/1/1484161303036010508.json": "An American Airlines flight to London from Miami turned around about an hour into its journey because of a passenger who refused to follow Covid masking rules, the airline said. https://t.co/Iw93WhlQLE",
  "data/tweet-nytimes/2022/1/1484182722796867587.json": "Bankers for Donald Trump’s social media start-up told potential investors they would get a call from the former president if they put in at least $100 million. Despite the deal being structured to make a profit, many of Wall Street’s big names passed.\nhttps://t.co/rk0sUCTkLd",
  "data/tweet-nytimes/2022/1/1484151238111469575.json": "In Opinion\n\n“The truth is I almost declined to be the inaugural poet,” Amanda Gorman writes in a guest essay. “I was terrified. I was scared of failing my people, my poetry. But I was also terrified on a physical level.” https://t.co/V5wfBP6Ht6",
  "data/tweet-nytimes/2022/1/1484147467411148803.json": "Zara Rutherford just became the youngest woman to fly around the world solo. The British and Belgian aviator is 19.\n\nShe dodged giant clouds and lightning flashes, crossed frozen, remote lands and was banned from airspaces during the 155-day journey. https://t.co/GR3F7TP4Kp https://t.co/mMvxLHf2vN",
  "data/tweet-nytimes/2022/1/1483795140724641804.json": "Dozens of theaters and museums in the Netherlands planned to open as hair salons and gyms on Wednesday in protest over a continued nationwide lockdown on arts venues. The Van Gogh Museum in Amsterdam is offering beard trims and Van Gogh-inspired nail art.\nhttps://t.co/lMaU5VjNwa",
  "data/tweet-nytimes/2022/1/1484213577959489540.json": "Breaking News: Ivanka Trump was asked by the Jan. 6 House committee to cooperate with its investigation into the Capitol riot. https://t.co/cihpeuS1Vv https://t.co/UwJ3JzZm8a",
  "data/tweet-nytimes/2022/1/1484197811008806919.json": "The son of the Czech folk singer Hana Horka, who deliberately exposed herself to the coronavirus, said her death should serve as a warning to others who remain unvaccinated. Horka believed naturally acquired immunity would allow a return to normalcy. https://t.co/3VvFHKqgx8",
  "data/tweet-nytimes/2022/1/1484227769433272324.json": "Breaking News: An Atlanta district attorney asked to convene a grand jury to investigate Donald Trump’s attempts to overturn Georgia’s 2020 election results. https://t.co/dMaZDu9w1K",
  "data/tweet-nytimes/2022/1/1484146201582784515.json": "The Supreme Court on Wednesday refused a request from Donald Trump to block the release of White House records concerning the Jan. 6 riot, meaning there is no legal obstacle to stop the National Archives from providing the records to the Jan. 6 committee. https://t.co/j5ehKs9qjg https://t.co/X2UqNtMaQZ",
  "data/tweet-nytimes/2022/1/1484288409921273858.json": "In Opinion\n\nWhen Senator Elizabeth Warren called out Elon Musk for not paying his fair share in taxes, he tweeted: “Please don’t call the manager on me, Senator Karen.” She defends her plan to tax billionaires on the Sway podcast. https://t.co/FO9AdwOBcW https://t.co/JLsysK2xeg",
  "data/tweet-nytimes/2022/1/1484141185606328325.json": "Sparks didn’t fly when Zhao Xiaoqing first met Zhao Fei on a blind date. But on their second date, they got stuck in lockdown together.\n\nNow, they're planning to get engaged. https://t.co/jzDP33BvRA https://t.co/SNnjxg1GXP",
  "data/tweet-nytimes/2022/1/1484169859432865795.json": "Breaking News: The Massachusetts attorney general, Maura Healey, a Democrat, joined the governor’s race. She is the most well-known candidate to enter the race to replace Gov. Charlie Baker, a Republican who is not seeking re-election.\nhttps://t.co/KRDh6IOHAB",
  "data/tweet-nytimes/2022/1/1484254486352875524.json": "Planning the Holocaust took all of 90 minutes. Eighty years after Nazis at the infamous Wannsee Conference meticulously mapped out the extermination of Jews in Europe, the bureaucratic efficiency of it remains as unnerving as ever. https://t.co/TOQtYEGAyU",
  "data/tweet-nytimes/2022/1/1484273314067587079.json": "The Omicron variant was probably in New York City as early as Nov. 21, four days before South African scientists first announced cases of the variant, a new report on wastewater samples suggests. https://t.co/qU4gKllO16",
  "data/tweet-nytimes/2022/1/1484446438268579843.json": "Breaking News: Meat Loaf, the larger-than-life singer and actor, is dead at 74. His “Bat Out of Hell” was one of the best-selling albums of all time.\nhttps://t.co/cOrKZzyqFL https://t.co/gVIdRgbIcg",
  "data/tweet-nytimes/2022/1/1484327403803463680.json": "Deep sea explorers have discovered a sprawling coral reef resembling a bed of roses off the coast of Tahiti that appears to be largely unscathed by climate change. https://t.co/wDoMIMqqLy",
  "data/tweet-nytimes/2022/1/1484460785590050819.json": "Meat Loaf, the singer and actor whose 1977 album “Bat Out of Hell” was one of the best-selling albums of all time, is dead at 74.\n\nIn six decades, he sold millions of albums and appeared in movies including “Fight Club” and “The Rocky Horror Picture Show.”\nhttps://t.co/fgx9whlfPO",
  "data/tweet-nytimes/2022/1/1484488207093968901.json": "Yakei, a female Japanese macaque in a nature reserve in southern Japan, violently overthrew the alpha male of her troop to become its first female leader in the reserve’s 70-year history.\n\nA messy love triangle could endanger her grip on power.\nhttps://t.co/MQ7NwcIv3U",
  "data/tweet-nytimes/2022/1/1484506085063110657.json": "Yakei, a female macaque in a nature reserve in Japan, violently overthrew the alpha male of her troop to become its first female leader in the reserve’s 70-year history.\n\nShe presides over 677 monkeys, but a messy love triangle could endanger her status. https://t.co/3sRa36vAHP https://t.co/Gooy6RxWJR",
  "data/tweet-nytimes/2022/1/1484450708988604421.json": "Elza Soares, a samba singer who rose from the favela to stardom and became one of the few Black women singers in Brazil to be featured in films in the '60s and on TV in the ’70s, died at 91. She \"sang until the end,\" a statement on her Instagram page said. https://t.co/aDrKONGWno",
  "data/tweet-nytimes/2022/1/1484352599784525824.json": "Austria’s lower house of Parliament voted on Thursday to make Covid vaccines mandatory for almost everyone 18 and over, putting it on the path to be the first European country with such a mandate. https://t.co/xjuBAMr4Od",
  "data/tweet-nytimes/2022/1/1484277108935479299.json": "The U.N. approved an Israeli measure to condemn Holocaust denial, a resolution aimed at fighting the rise of misinformation about the murder of nearly six million Jews and millions of others by the Nazis. https://t.co/mld66Anff2",
  "data/tweet-nytimes/2022/1/1484558300133965832.json": "Breaking News: Pfizer and Moderna booster shots were extremely effective in preventing those infected with Omicron from being hospitalized, new CDC data shows. https://t.co/unq1FE0oiL",
  "data/tweet-nytimes/2022/1/1484582844806713355.json": "Louie Anderson, the stand-up comedian, actor and television host known for the comedy series “Baskets,” for which he won an Emmy in 2016, died on Friday. He was 68. https://t.co/WlL0FU3n38 https://t.co/bgH3xFCHWp",
  "data/tweet-nytimes/2022/1/1484575318178504706.json": "Meat Loaf, who was born Marvin Lee Aday, had a career that few could match. He was a trained Broadway belter and a multiplatinum-selling megastar whose biggest hits, like “Bat Out of Hell” and “Paradise by the Dashboard Light,” were radio staples. https://t.co/ZrfOjqBFr7",
  "data/tweet-nytimes/2022/1/1484410459562381313.json": "Intel selected Ohio for its new $20 billion chip manufacturing complex, ramping up efforts to boost U.S. production and alleviate shortages. https://t.co/G8z1cixRWq",
  "data/tweet-nytimes/2022/1/1484645222445457411.json": "Breaking News: Thich Nhat Hanh, a Vietnamese Buddhist monk who was one of the world’s most influential Zen masters, has died at 95. https://t.co/flgq2gItxL",
  "data/tweet-nytimes/2022/1/1484650800920023047.json": "Munzir El Nezzel lost his leg in a bomb attack in Syria. His son, Mustafa, was born without limbs after his mother was exposed to nerve gas. A viral photo of the two won an international award, helping bring the family to Italy for better lives. https://t.co/BV9vq0rPbC",
  "data/tweet-nytimes/2022/1/1484329994176241667.json": "This one-pot Peruvian chicken and rice dish includes a bright green cilantro purée and is commonly served with salsa criolla, a tangy and spicy red onion relish. But a Louisiana-style hot sauce is a good alternative. https://t.co/RGQ9Fmcrrr",
  "data/tweet-nytimes/2022/1/1484248534044094472.json": "A Syrian dam was on a U.S. \"no-strike\" list. Some warned an attack could kill thousands. In 2017, a secret American force bombed it anyway. https://t.co/XOagYjtR2P",
  "data/tweet-nytimes/2022/1/1484508594334748672.json": "\"She should not have been put in this situation.\" Video of a TV reporter in West Virginia being hit by a car during a live shot has been met with outrage by broadcast journalists who said it underscored the risks of sending reporters out on their own. https://t.co/bVn7P9vxi8",
  "data/tweet-nytimes/2022/1/1484702389076697088.json": "A federal judge handed a crucial free-speech victory to six University of Florida professors Friday, ordering the university to stop enforcing a policy that had barred them from giving expert testimony in lawsuits against the state.\nhttps://t.co/iHMIuEGMx4",
  "data/tweet-nytimes/2022/1/1484689794051489798.json": "Two New York City police officers were killed in a shooting in Harlem on Friday, officials said. They were the third and fourth officers to be shot in the line of duty this week, according to the Police Department.\nhttps://t.co/kD4Dsd2zjk",
  "data/tweet-nytimes/2022/1/1484707442663608326.json": "Booster shots of the Pfizer-BioNTech and Moderna vaccines are not just reducing the number of infections with the highly contagious Omicron variant, they’re also keeping infected Americans out of hospitals, according to data published on Friday by the CDC. https://t.co/JN6rAjkyS6",
  "data/tweet-nytimes/2022/1/1484828704454893569.json": "Munzir El Nezzel lost his leg in a bomb attack in Syria. His son, Mustafa, was born without limbs after his mother was exposed to nerve gas. A viral photo of the two won an international award, helping bring the family to Italy for better lives. https://t.co/hdzuEa5vEA",
  "data/tweet-nytimes/2022/1/1484784924825735168.json": "Lisala Folau, 57, survived 26 hours floating in the sea after an underwater volcanic eruption sent a tsunami crashing through his home.\n\n“It’s one of these miracles that happens,” said New Zealand’s acting high commissioner in Tonga. https://t.co/0s8sxR9FAR",
  "data/tweet-nytimes/2022/1/1484571510350176260.json": "Lisala Folau, 57, survived 26 hours floating in the sea after an underwater volcanic eruption sent a tsunami crashing through his home.\n\n“It’s one of these miracles that happens,” said New Zealand’s acting high commissioner in Tonga. https://t.co/AAO7KUD9uI",
  "data/tweet-nytimes/2022/1/1484886075306823681.json": "Omicron now accounts for more than 99.5 percent of new infections in the United States, according to estimates from the CDC. Scientists have been working overtime to study this variant. Here's what they've learned so far. https://t.co/Bo8mmpJ5Z9",
  "data/tweet-nytimes/2022/1/1484616862755217409.json": "Pete Davidson (who still lives on Staten Island) and Colin Jost (who no longer lives on Staten Island) are among a group of investors who just bought a hulking Staten Island Ferry boat. The group hopes to turn it into an arts and entertainment venue. https://t.co/noskvuweq7",
  "data/tweet-nytimes/2022/1/1484992717948084234.json": "A rift between Senator Kyrsten Sinema and fellow Democrats in Arizona deepened on Saturday as the state party formally rebuked her for refusing to change the Senate’s filibuster rules to pass sweeping voting rights legislation. https://t.co/e2SpkItvXN",
  "data/tweet-nytimes/2022/1/1485018051951177734.json": "Breaking News: Britain said that Russia had begun developing plans to install a pro-Kremlin leader in Kyiv, as Russian troops threaten Ukraine’s borders. https://t.co/IcEsjUa1Xu",
  "data/tweet-nytimes/2022/1/1485034547314143232.json": "“Many of us have been running all our lives. Practice stopping”: Here is a modest selection of thoughts from Thich Nhat Hanh, the influential Zen master who died at 95 on Saturday.\nhttps://t.co/IbQ3FjQN39",
  "data/tweet-nytimes/2022/1/1485109538822963205.json": "The San Francisco 49ers upset the Green Bay Packers to advance to next Sunday's conference championship game. https://t.co/fHExZUpAqe",
  "data/tweet-nytimes/2022/1/1485084888772620291.json": "This may become your new favorite chocolate chip cookie recipe, if it isn’t already. https://t.co/LI7VKmp8qd",
  "data/tweet-nytimes/2022/1/1484891117988585474.json": "Applications now open: https://t.co/Nm7YAoZKxE",
  "data/tweet-nytimes/2022/1/1484732566464864256.json": "The Pennsylvania State Police said that a pickup truck with an enclosed trailer full of 100 monkeys had collided with a dump truck and that four of the monkeys had escaped. https://t.co/KKaWKaW1V0",
  "data/tweet-nytimes/2022/1/1484971653432029191.json": "A Jewish couple living in Tennessee planned to adopt in Florida. But the agency that had been scheduled to provide a family-training course required in their state backed out, saying the couple did not share its Christian beliefs, a lawsuit says.\nhttps://t.co/oKrLUttvwK",
  "data/tweet-nytimes/2022/1/1485243450970755073.json": "After last night's defeat by the 49ers, Aaron Rodgers must contemplate his future with the Green Bay Packers much sooner than he had hoped. https://t.co/znz0CPTXkc",
  "data/tweet-nytimes/2022/1/1485276164105154567.json": "New Zealand announced on Sunday that it would impose its highest level of Covid restrictions across the country at midnight and Prime Minister Jacinda Ardern said that her wedding would not be held in the coming weeks as planned. https://t.co/AAHa1Gidmu https://t.co/92Xfn49L4g",
  "data/tweet-nytimes/2022/1/1485306343535910912.json": "The Social Security Administration now allows gay men and lesbians to receive survivor’s benefits if they can show that they were in a committed relationship and would have married had that been possible. https://t.co/5xqTkoAeDc",
  "data/tweet-nytimes/2022/1/1485146313582858241.json": "Something infectious is spreading through the work force. Its symptoms present in a spate of two-week notices. Its transmission is visible in real time. And few bosses seem to know how to inoculate their staff against this quitagion.\nhttps://t.co/VE4GLDVUe0",
  "data/tweet-nytimes/2022/1/1485281197156622348.json": "A passenger from Galway, Ireland, refused to wear a mask on a flight from Dublin to New York, pulled down his pants and exposed his buttocks, threw a can at a passenger and put his cap on the captain’s head, prosecutors said. https://t.co/AgEjsYwDRI",
  "data/tweet-nytimes/2022/1/1485316412218527754.json": "Frontline medical workers in the U.S. are angry — at the patients who refuse to get vaccinated and at the political leaders who call them “health care heroes” while opposing mask and vaccine mandates. https://t.co/loxGg0BUxY",
  "data/tweet-nytimes/2022/1/1485160896032874496.json": "This popular Peruvian condiment requires only five ingredients, but it’s bursting with flavor. https://t.co/LjqAeecILS https://t.co/76k3UuJqtU",
  "data/tweet-nytimes/2022/1/1485374307652055046.json": "John Stockton, one of the most celebrated basketball players in history, is barred from attending games at his alma mater, Gonzaga University, because he refused to comply with the school’s mask mandate. His season tickets were revoked. https://t.co/ccncP1GfWI",
  "data/tweet-nytimes/2022/1/1485259292500504582.json": "Illinois homeowners can now remove from their property deeds racist language that was used to bar people of certain races and religious groups from buying property. https://t.co/KY1rBnnStp",
  "data/tweet-nytimes/2022/1/1485191334898151425.json": "Here’s how to use those bananas browning on your countertop. https://t.co/J6oEUxxyCq https://t.co/oTP9TWYXj0",
  "data/tweet-nytimes/2022/1/1485131438936756226.json": "As more vaccinated people are infected with Omicron, they may build “hybrid” immunity, which is what scientists call the combined protection of pre-existing vaccine antibodies and natural antibodies from a breakthrough infection.https://t.co/9YZNYqHzwO",
  "data/tweet-nytimes/2022/1/1485438730865459208.json": "Thierry Mugler, the genre-busting French designer who dominated European runways in the late 1980s and early 1990s, died. He was 73. https://t.co/jE2iJXHjLi",
  "data/tweet-nytimes/2022/1/1485451060265492485.json": "President Biden is considering deploying several thousand U.S. troops, as well as warships and aircraft, to NATO allies in the Baltics and Eastern Europe amid fears of a Russian incursion into Ukraine. https://t.co/uQrFEaz9zX",
  "data/tweet-nytimes/2022/1/1485586962794885125.json": "In Opinion\n\n\"This time, Mr. Putin’s aim is bigger than closing NATO’s 'open door' to Ukraine and taking more territory — he wants to evict the United States from Europe,\" writes Fiona Hill, who served as national intelligence officer for Russia and Eurasia.https://t.co/14zNmqhZjs",
  "data/tweet-nytimes/2022/1/1485583228144689152.json": "For an exhausted group of mothers in Boston, the pandemic had been so draining that they just wanted to scream. So they did. https://t.co/6oaO3EGjKG https://t.co/Z5DIoULSJg",
  "data/tweet-nytimes/2022/1/1485462417106784257.json": "Timothy Heaphy, the top staff investigator on the House committee investigating the Jan. 6 attack on the Capitol, has been fired by the state’s new Republican attorney general from his position as the top lawyer for the University of Virginia. https://t.co/2zXJ312BSr",
  "data/tweet-nytimes/2022/1/1485568124179169287.json": "Ukraine has a plan to defend an invasion of Chernobyl, one of the most radioactive places on earth. “We don’t know what will kill us first, the virus, radiation or war,” said a resident with a shrug. https://t.co/JbSBn8dja6",
  "data/tweet-nytimes/2022/1/1485575653995040770.json": "Thierry Mugler, the genre-busting French designer who dominated European runways in the late 1980s and early ’90s, died on Sunday at 73. He was one of the main architects of an aesthetic that married S&amp;M and high fashion. https://t.co/jvaeCdLCQ8 https://t.co/AlN4dnm2lm",
  "data/tweet-nytimes/2022/1/1485651123776147457.json": "Sarah Palin has tested positive for the coronavirus, forcing the delay of her defamation trial against The New York Times, which was set to begin with jury selection on Monday morning. Palin is not vaccinated, the judge in the case said. https://t.co/K1pGU14Oo5",
  "data/tweet-nytimes/2022/1/1485671242296406017.json": "Surgery to remove cataracts, which cause the eye’s normally clear lens to become cloudy, can restore vision almost instantaneously. But new research suggests it may have another benefit: a reduced risk for Alzheimer’s disease and other forms of dementia. https://t.co/bJDTmyfG5F"
}