{
  "data/tweet-nytimes/2022/1/1477586743683690499.json": "These pancakes are perfectly fluffy because of the leavening agent and a vegan version of buttermilk: nondairy milk mixed with a couple teaspoons of vinegar. It works just as well for vegan waffles, muffins and coffee cake. https://t.co/Mvlh3NwQbO https://t.co/oOxPbUFW8m",
  "data/tweet-nytimes/2022/1/1477687403565535240.json": "Dr. Anthony Fauci said Sunday that the nation should focus less on the skyrocketing number of coronavirus infections and more on the number of hospitalizations and deaths. https://t.co/vloA5vgiXy",
  "data/tweet-nytimes/2022/1/1477799407173185536.json": "While watching a Vancouver Canucks hockey game, Nadia Popovici spotted a troubling mole on the neck of Brian Hamilton, an assistant equipment manager. So she wrote him a message and held it up to the plexiglass. It saved his life.\n\nhttps://t.co/ZPpCzaneua",
  "data/tweet-nytimes/2022/1/1477691161544380416.json": "Stacey Abrams, the Georgia Democrat running for governor, has admirers in both the progressive and moderate wings of her party. With Republicans eager to defeat her, her carefully calibrated positions face an electoral test in 2022.\n\nhttps://t.co/OpQUN3kd27",
  "data/tweet-nytimes/2022/1/1477684883669622784.json": "After selling the Iowa Cubs, the owner gave employees $2,000 for every year they had been with the minor league baseball team, for a total of $600,000. “My jaw dropped,” one worker said.\n\nhttps://t.co/yVoEqBGSNO",
  "data/tweet-nytimes/2022/1/1477465932431831041.json": "Sam Fender has become one of Britain’s biggest rock acts by singing about working-class life in all its complexity. Unusually, he still lives in the area of northern England where he grew up. https://t.co/4pATUOefDO",
  "data/tweet-nytimes/2022/1/1477391683339837442.json": "Desmond Tutu, a powerful opponent of apartheid and Cape Town’s first Black archbishop, was remembered in a modest ceremony scaled down further by pandemic restrictions. https://t.co/L6ISbhuzH7 https://t.co/fpXm97Cr8H",
  "data/tweet-nytimes/2022/1/1477277184532582400.json": "New studies on animals suggest why Omicron is less severe than earlier variants: It seems to cause much less damage to the lungs. https://t.co/BIoVOngQSr",
  "data/tweet-nytimes/2022/1/1478028889922416643.json": "Breaking News: The FDA cleared boosters of the Pfizer-BioNTech vaccine for 12- to 15-year-olds. The CDC is expected to sign off before shots are given out. https://t.co/LZo7bUwn50",
  "data/tweet-nytimes/2022/1/1478008249936977932.json": "Richard Leakey, the Kenyan paleoanthropologist and fossil hunter whose discoveries of ancient human skulls and skeletons helped cement Africa’s place as the cradle of humanity, died on Sunday in Kenya. He was 77. https://t.co/43YYRHxrAe",
  "data/tweet-nytimes/2022/1/1478041817589465089.json": "The New York State attorney general’s office is seeking to question Donald Trump Jr. and Ivanka Trump as part of a civil investigation into the Trump Organization. https://t.co/S17mZYKwvW",
  "data/tweet-nytimes/2022/1/1477975551411470338.json": "As the anniversary of the Jan. 6 Capitol riot approaches, the House committee investigating the day's events is preparing to hold public hearings and has not ruled out subpoenas for members of Congress, Mike Pence or Donald Trump.\n\nhttps://t.co/4rDa81Q79V",
  "data/tweet-nytimes/2022/1/1478074967665348610.json": "Facebook has suspended Rep. Marjorie Taylor Greene's account for 24 hours for spreading misinformation about the coronavirus. This comes a day after Twitter banned her personal account for posting a similar message. https://t.co/UkhQc4ddkv",
  "data/tweet-nytimes/2022/1/1478087531451359237.json": "Mayor Eric Adams of New York City insisted schools would remain open despite surging Omicron cases in the city. He said remote learning has been too damaging, especially to children in low-income neighborhoods and homeless students. https://t.co/LPCoVmXXcX https://t.co/UVEoPio4HM",
  "data/tweet-nytimes/2022/1/1478028411310333956.json": "Donald Trump endorsed Prime Minister Viktor Orban of Hungary on Monday, formally pledging his \"complete support\" to the far-right leader who has touted turning Hungary into an \"illiberal democracy.\" https://t.co/CCTLzKMpGW",
  "data/tweet-nytimes/2022/1/1478071426573869061.json": "Gov. Kathy Hochul will propose a limit of two four-year terms for New York governors in her State of the State address on Wednesday, a move that could allow her to distance herself from former Gov. Andrew M. Cuomo, who held outsize power for over a decade. https://t.co/Z1unBKAFh3",
  "data/tweet-nytimes/2022/1/1478158871726284801.json": "Breaking News: Elizabeth Holmes, the founder of the blood testing start-up Theranos, was found guilty of four counts of fraud in a case that symbolized Silicon Valley's culture of hype. https://t.co/0qsxC5ZUvj",
  "data/tweet-nytimes/2022/1/1478126548041539587.json": "Chronic psychological stress may be as important — and possibly more important — to the health of your heart as the traditional cardiac risk factors, new studies suggest. https://t.co/RNFZJfN6Hj",
  "data/tweet-nytimes/2022/1/1478095094645465095.json": "In August 2018, Apple became the first American company ever to be worth $1 trillion, an achievement that took 42 years. It surged past $2 trillion two years later. Its next trillion took just 16 months and 15 days. https://t.co/Qy8iGAxnJp https://t.co/RCDaeNCJNu",
  "data/tweet-nytimes/2022/1/1478069928766939147.json": "Josh Wardle, a software engineer in Brooklyn, knew his partner loved word games and created a guessing game for the two of them called Wordle. Just over two months after releasing it to the rest of the world, the once-a-day game has over 300,000 players. https://t.co/D1oBCwgpbW",
  "data/tweet-nytimes/2022/1/1477998194760069127.json": "A meteor likely either \"exploded or vaporized\" over Pittsburgh on Saturday, a meteorologist said, setting off a strong vibration that one resident likened to a \"shock wave.\" https://t.co/nItUut2xna",
  "data/tweet-nytimes/2022/1/1477819534870466566.json": "Mayor Eric Adams of New York said on Sunday, his second day in office, that city workers might be required to get Covid vaccine booster shots.\n\nhttps://t.co/OG41wd4lUn",
  "data/tweet-nytimes/2022/1/1477680341590548483.json": "Twitter permanently suspended the personal account of Representative Marjorie Taylor Greene on Sunday. The company said she had repeatedly violated its Covid-19 misinformation policies.\nhttps://t.co/Hdb9gddsiA https://t.co/KEvkaLvjRb",
  "data/tweet-nytimes/2022/1/1477667826047590405.json": "Breaking News: Twitter permanently suspended the personal account of Representative Marjorie Taylor Greene, a Republican of Georgia. The company said she had repeatedly violated its Covid-19 misinformation policies.\n\nhttps://t.co/v8LhiomB7x",
  "data/tweet-nytimes/2022/1/1477556547135979524.json": "In our anger-filled age, people are “devolving into children” when they need to shop or travel or cope with mild disappointment. https://t.co/162DHFCOsD",
  "data/tweet-nytimes/2022/1/1477503679519461376.json": "A Glasgow nightclub is installing technology that will turn dancers' body heat into renewable energy, which will then be used to heat or cool the club. https://t.co/h6A9iqFbSD",
  "data/tweet-nytimes/2022/1/1477413093198213122.json": "Surprise medical bills, issued by a doctor that a patient did not choose and who did not accept the patient's insurance, will be made illegal by a law that goes into effect today. https://t.co/joHEi3Unyo",
  "data/tweet-nytimes/2022/1/1477389192552460294.json": "South Korea is reckoning with a new type of political correctness enforced by angry young men who bristle at any forces they see as undermining opportunity — and feminists, in their minds, are enemy No. 1. https://t.co/FDvoBrhhtq",
  "data/tweet-nytimes/2022/1/1477298109030047752.json": "In our anger-filled age, people are “devolving into children” when they need to shop or travel or cope with mild disappointment. https://t.co/4pGZ0Qh6B7",
  "data/tweet-nytimes/2022/1/1477286007800307714.json": "Many paid tribute to Betty White as a performer who had been ahead of her times, championing equity causes before they became popular. https://t.co/n5VCCLXZZv",
  "data/tweet-nytimes/2022/1/1477263398303932420.json": "This large, fluffy pancake is excellent for New Year's Day breakfast, brunch, lunch and dessert.\n\n It comes together in about five minutes. https://t.co/scuNDQLRKs https://t.co/uvkQr4Ov3f",
  "data/tweet-nytimes/2022/1/1478171839839055874.json": "The conviction of Elizabeth Holmes signals \"the end of an era,\" David Streitfeld writes. \"In Silicon Valley, where the line between talk and achievement is often vague, there is finally a limit to faking it.\"\nhttps://t.co/mYJmxilMTA",
  "data/tweet-nytimes/2022/1/1478169640119508992.json": "Elizabeth Holmes, the founder of the blood testing start-up Theranos, faced 11 counts of fraud for lying to investors, patients and others to raise money and the profile for her company. Here’s what jurors decided:\nhttps://t.co/Ye6fA73Ucj https://t.co/rAaviWrsuV",
  "data/tweet-nytimes/2022/1/1478161795080761346.json": "The end of an era: Blackberry is ending service on its mobile devices on Jan. 4, 2022. https://t.co/jN69zoeera",
  "data/tweet-nytimes/2022/1/1478174360749883406.json": "Elizabeth Holmes, the founder of Theranos, now awaits sentencing after being found guilty of four of 11 charges of fraud on Monday. Each count of wire fraud carries up to 20 years in prison, and Holmes can appeal the conviction, her sentence or both. https://t.co/fudU5LExaW",
  "data/tweet-nytimes/2022/1/1477940312664424451.json": "Betty White died on Friday at 99. Her television career started in 1949 and included star turns on \"The Mary Tyler Moore Show\" in the 1970s and \"Golden Girls\" in the 1980s.\n\nhttps://t.co/LEccojh14O",
  "data/tweet-nytimes/2022/1/1478163568755421184.json": "Elizabeth Holmes, the founder of the failed blood testing start-up Theranos, was found guilty of four charges of fraud on Monday. She was found not guilty on four other counts. https://t.co/6nF4eZvupJ https://t.co/i9Uw8h3xJs",
  "data/tweet-nytimes/2022/1/1477703759144828930.json": "England is putting air purifiers in classrooms and strongly encouraging students to wear masks as schools prepare to reopen amid a record surge of coronavirus cases. France has also made masks mandatory indoors for everyone age 6 and over.\n\nhttps://t.co/dxaDOVsDFC",
  "data/tweet-nytimes/2022/1/1478113980472344584.json": "Viktor Orbán, Hungary’s far-right prime minister, has spent millions on an influence campaign in Washington to court the right, including Donald Trump and his allies. On Monday, Trump formally endorsed Orbán for re-election. https://t.co/jLe9a5cZPw",
  "data/tweet-nytimes/2022/1/1478053563293224963.json": "After selling the Iowa Cubs, the owner gave employees $2,000 for every year they had been with the minor league baseball team, for a total of $600,000. “My jaw dropped,” one worker said.\n\nhttps://t.co/o5nmDcKfdT",
  "data/tweet-nytimes/2022/1/1478305247152021505.json": "The conviction of Elizabeth Holmes signals \"the end of an era,\" David Streitfeld writes. \n\n\"In Silicon Valley, where the line between talk and achievement is often vague, there is finally a limit to faking it.\" https://t.co/73OHLAaRRF https://t.co/HP0SUE3ejX",
  "data/tweet-nytimes/2022/1/1478117730280685568.json": "Nearly two years into the pandemic, the Omicron variant has driven coronavirus cases to new highs, with the daily global case count surpassing a million for the first time at the end of December.\n\nWe're tracking the spread of the virus here. https://t.co/PJitGgrK8H https://t.co/g7cVzcJhwu",
  "data/tweet-nytimes/2022/1/1478135351805988867.json": "About one in 4 U.S. hospitals with intensive care units recently reported that at least 95% of their ICU beds were full. In the week ending Dec. 30, an average of 77% of beds were occupied nationwide, Department of Health and Human Services data shows. https://t.co/DVo8S13BSD",
  "data/tweet-nytimes/2022/1/1478139136938762241.json": "Without a headlining role in some of the most critical decisions facing the White House, Vice President Kamala Harris is caught between criticism that she is falling short and resentment from supporters who feel she is being undercut by the administration. https://t.co/PTaQuAqIMb https://t.co/GA6LRQNxJe",
  "data/tweet-nytimes/2022/1/1478392800957902854.json": "Breaking News: More than 4.5 million people in the U.S. quit their jobs in November, the most in two decades of tracking, as openings remained near a record. https://t.co/ZeAAVPxJiW",
  "data/tweet-nytimes/2022/1/1478454970055856133.json": "A federal judge has dismissed a lawsuit filed by a man who said he had been sexually exploited by Nirvana when the band used a photo of him as a baby, naked and drifting in a pool, for the cover of the group’s seminal album. https://t.co/zxOcDom7UU",
  "data/tweet-nytimes/2022/1/1478413440758788096.json": "Senator Tim Kaine was among the drivers stranded for more than 12 hours after a winter storm shut down parts of Interstate 95, one of the busiest travel corridors in the U.S. \"This has been a miserable experience,\" Kaine told WTOP, a radio station. https://t.co/e1Gh6kgtx5",
  "data/tweet-nytimes/2022/1/1478395833259339783.json": "American Girl has created a Chinese American doll to be its 2022 \"Girl of the Year.\" The company said it created the doll, named Corinne Tan, in response to increasing anti-Asian sentiment and to teach children to stand against racism. https://t.co/fLs1hLTu7U",
  "data/tweet-nytimes/2022/1/1478222171965214724.json": "Never miss a meteor shower, eclipse or rocket launch again. https://t.co/LAdGq5WSwx https://t.co/RGpOL0j7mS",
  "data/tweet-nytimes/2022/1/1478495055384096771.json": "Breaking News: Canada has reached a $31.5 billion settlement to repair its child welfare system and compensate Indigenous families separated by the government. https://t.co/RCGOQbgFEH",
  "data/tweet-nytimes/2022/1/1478350533215801353.json": "Interstate 95, one of the busiest U.S. travel corridors, was closed south of Washington, D.C., after a winter storm that caused at least five deaths and accidents involving several tractor-trailers. https://t.co/fJgQpAtPMw",
  "data/tweet-nytimes/2022/1/1478535477171044353.json": "Women who received Covid vaccines while pregnant were at no greater risk of delivering their babies prematurely or of giving birth to unusually small babies than pregnant women who did not get vaccinated, a new study reports. https://t.co/VY4ewSWIEZ",
  "data/tweet-nytimes/2022/1/1478522943479107585.json": "Breaking News: The House committee investigating the Jan. 6 attack has asked Sean Hannity, the Fox News host, to cooperate by answering questions about his communications with Donald Trump before and after the riot. https://t.co/qM5mA2vmji",
  "data/tweet-nytimes/2022/1/1478603212814966787.json": "Breaking News: Chicago school officials canceled classes for Wednesday amid a clash with the teachers’ union, which wants to pause in-person instruction as the Omicron variant pushes Covid cases in the city to record levels. https://t.co/8d7Itgby6l",
  "data/tweet-nytimes/2022/1/1478458728907214860.json": "April Ashley was one of the first people in Britain to undergo gender confirmation surgery. She modeled for Vogue and partied with John Lennon and Mick Jagger, all while fighting for legal recognition of her gender. She has died at age 86. https://t.co/qd9r34N7Oq",
  "data/tweet-nytimes/2022/1/1478675173977071616.json": "President Emmanuel Macron of France is facing a backlash after arguing that the government should make life miserable for the unvaccinated. His blunt statement comes as Covid infection rates spike ahead of a key presidential election.\nhttps://t.co/jYMn3s0zWI",
  "data/tweet-nytimes/2022/1/1478686483255021571.json": "Canada has reached a $31.5 billion settlement to repair its child welfare system and compensate Indigenous families separated by the government. https://t.co/NHKg8JMYDA https://t.co/kcRQ8tXBo7"
}