{
  "data/tweet-nytimes/2022/6/1531807477095972866.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/fCeia4GPZo",
  "data/tweet-nytimes/2022/6/1531790145955020806.json": "Rafael Nadal beat Novak Djokovic in four sets to reach the French Open semifinals in a thrilling addition to their long rivalry. https://t.co/qgwhrhBA8X",
  "data/tweet-nytimes/2022/6/1531788134341541889.json": "In Opinion\n\n\"America’s goal is straightforward,\" President Biden writes in a guest essay. \"We want to see a democratic, independent, sovereign and prosperous Ukraine with the means to deter and defend itself against further aggression.\" https://t.co/c2AM54y140",
  "data/tweet-nytimes/2022/6/1531832958994227201.json": "The Russian military, demoralized after three months of war, is still facing morale and other problems, seven weeks after the Kremlin sent a new commander to oversee a refocused invasion, American officials say. https://t.co/WICddQYBem",
  "data/tweet-nytimes/2022/6/1531945422129926145.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/4Jx0iqVPHE",
  "data/tweet-nytimes/2022/6/1531893389314121729.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/wTtbsQd3X4",
  "data/tweet-nytimes/2022/6/1532044326733328384.json": "Elon Musk told SpaceX and Tesla employees that they were required to “spend a minimum of 40 hours in the office per week.” Those who did not do so would be fired, he wrote in a memo. https://t.co/eOwVV5UIGp https://t.co/pHzcnIDHm1",
  "data/tweet-nytimes/2022/6/1532021676677922818.json": "The Russian journalist Dmitri Muratov — whose paper suspended publication in late March, saying Russia’s press laws made it impossible to truthfully cover the war in Ukraine — will be auctioning his Nobel Peace Prize medal to benefit Ukrainian refugees. https://t.co/VZCVkZxmz1",
  "data/tweet-nytimes/2022/6/1532055902555099138.json": "Breaking News: The verdict in the Johnny Depp-Amber Heard trial is expected to be announced soon. Follow our live coverage. https://t.co/p4jBMSQyXF",
  "data/tweet-nytimes/2022/6/1532059477066731520.json": "After winning the Nobel Peace Prize, the journalist Dmitri Muratov said he thought the honor should have gone to a different Russian: the jailed opposition leader Aleksei Navalny. Now, he will auction it to help children who are refugees from Ukraine.\nhttps://t.co/JMgo2mtnNm https://t.co/FtdmydqjwK",
  "data/tweet-nytimes/2022/6/1532086163078631436.json": "Breaking News: A jury found Johnny Depp was defamed by his ex-wife, Amber Heard, in a Washington Post essay in which she described herself as a “public figure representing domestic abuse.” Heard was defamed by one of Depp’s lawyers, the jury found. https://t.co/0hFmUqNVCF",
  "data/tweet-nytimes/2022/6/1532097935563005952.json": "A jury found that Johnny Depp was defamed by Amber Heard when she described herself in a Washington Post essay as a “public figure representing domestic abuse,” but also found that she had been defamed by one of his lawyers. Read the latest: https://t.co/Ri0SE1vBiT https://t.co/2G4m0iPIYP",
  "data/tweet-nytimes/2022/6/1532103478369300484.json": "Johnny Depp said the jury “gave me my life back.” Amber Heard said she’s “heartbroken.”\n\nGet the latest following the verdict, in which a jury found that Depp was defamed by Heard but also that she'd been defamed by one of his lawyers. https://t.co/vumYhF2P3M https://t.co/3rOeNa2KY8",
  "data/tweet-nytimes/2022/6/1532088674317484034.json": "Breaking News: Sheryl Sandberg, the chief operating officer of Meta and the second in command to Mark Zuckerberg, said she was stepping down after 14 years. https://t.co/XlAL6zpeWe",
  "data/tweet-nytimes/2022/6/1532134961339412480.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/zfs5ayvggf https://t.co/IIWD3S54gl",
  "data/tweet-nytimes/2022/6/1532093536631496709.json": "Breaking News: The man accused of the racist shooting at a Buffalo supermarket that left 10 Black residents dead was charged with a 25-count indictment, including murder charges as hate crimes and domestic terrorism. https://t.co/xGqoFpC7Jj",
  "data/tweet-nytimes/2022/6/1532140570461851648.json": "Breaking News: Multiple people were shot and some were killed at a medical building in Tulsa, Oklahoma, the police said. The gunman is also dead. https://t.co/FdK5vhHOFS",
  "data/tweet-nytimes/2022/6/1532150130241044481.json": "Breaking News: In its largest student loan forgiveness action ever, the U.S. Education Dept. will cancel $5.8 billion owed by students of Corinthian Colleges. https://t.co/S5MKUs6KIB",
  "data/tweet-nytimes/2022/6/1531995262935355392.json": "A woman who approached a bison at Yellowstone National Park was gored by the animal on Monday, according to park officials. Her condition was not released, and it was unclear whether she had survived. https://t.co/bHlV2l41zW",
  "data/tweet-nytimes/2022/6/1532202883818704896.json": "Beto O’Rourke renewed his criticism of Gov. Greg Abbott over gun laws in Texas. “Not only did he not take action to save the lives of our kids,” O’Rourke said, “he took action to make it more certain that we would lose the lives of our kids.” https://t.co/RpkYJgQyAR",
  "data/tweet-nytimes/2022/6/1532197837894823941.json": "The Ukrainian national soccer team defeated Scotland, 3-1, on Wednesday, bringing Ukraine within reach of its second World Cup appearance. https://t.co/VNwVAQI0Wq",
  "data/tweet-nytimes/2022/6/1532195311300620294.json": "For six weeks, the defamation case that the actor Johnny Depp filed against his ex-wife Amber Heard offered a rare instance of high-profile #MeToo charges and countercharges being hashed out in the public spotlight of a courtroom. https://t.co/ItJXGvuXZ0",
  "data/tweet-nytimes/2022/6/1532124854899572736.json": "A 150-mile leisurely bike ride from Trieste, Italy, through Slovenia, to the ancient city of Pula, Croatia, brims with ancient traditions, sublime food and perched-village photo ops. https://t.co/jOeFDUHQX5 https://t.co/9sX6biHURi",
  "data/tweet-nytimes/2022/6/1532014220425961473.json": "In Opinion\n\n“I thought Vladimir Putin had invaded Ukraine. I was wrong. Putin had invaded Europe,” Thomas Friedman writes. “He shouldn’t have done that. This could be the biggest act of folly in a European war since Hitler invaded Russia in 1941.”\nhttps://t.co/mjvMBuMOeU",
  "data/tweet-nytimes/2022/6/1532255733387083782.json": "Queen Elizabeth II is celebrating 70 years on the British throne — her Platinum Jubilee. \n\nThe festivities will begin with a military parade, a flyover, a gun salute and the royal family’s appearance on the balcony of Buckingham Palace. Follow along live. https://t.co/7V2qH8J3Kg",
  "data/tweet-nytimes/2022/6/1532301015009177603.json": "Breaking News: Doctors successfully transplanted a 3-D printed ear made of living human cells, a major milestone in bioengineering. https://t.co/CdeAdCdoUx",
  "data/tweet-nytimes/2022/6/1532289697883496449.json": "The Ukrainian national soccer team defeated Scotland, 3-1, on Wednesday, bringing Ukraine within reach of its second World Cup appearance. https://t.co/Zt4c9G7CkA https://t.co/8h8ga5yjfz",
  "data/tweet-nytimes/2022/6/1532229292192681984.json": "The Natalie Medical Building, where a gunman opened fire and killed four people, is part of the campus of the Saint Francis Hospital in Tulsa.\n\nIt is home to ambulatory and breast cancer surgery centers, the hospital’s website says. https://t.co/oLv04nJ5M6",
  "data/tweet-nytimes/2022/6/1532275862892167168.json": "Queen Elizabeth II's seven decades on the throne: in photos. 👑\n\nHer long reign has made her a witness to cultural upheavals from the Beatles to Brexit, and political leaders from Winston Churchill to Boris Johnson. #PlatinumJubilee https://t.co/tIXJDxjXrm https://t.co/moYZNbyFPu",
  "data/tweet-nytimes/2022/6/1532311849160560645.json": "Prince George, Prince Louis and Princess Charlotte waved from the lead carriage during the Trooping the Color parade.\n\nQueen Elizabeth II is not attending this part of the #PlatinumJubilee events, but younger royals are featuring prominently. Watch live. https://t.co/sYscQ5uVhr https://t.co/jEeluoH3KQ",
  "data/tweet-nytimes/2022/6/1532299284489674753.json": "Barack Obama paid tribute to Queen Elizabeth II in a video message in which he said they had formed their own “special relationship.”\n\nFollow live updates on the #PlatinumJubilee celebrations. https://t.co/r2LBd7leXh https://t.co/Evum96FfL7",
  "data/tweet-nytimes/2022/6/1532304674560278528.json": "Crowds erupted in applause as Prince George, Princess Charlotte, Prince Louis and other members of the British royal family rode down the Mall in carriages and on horseback.\n\nWatch Queen Elizabeth II's #PlatinumJubilee celebrations live. https://t.co/cXViIsjfM6 https://t.co/tBSsrCo2ZG",
  "data/tweet-nytimes/2022/6/1532327606410006528.json": "In what was almost certain to be the emotional highlight of the #PlatinumJubilee, Queen Elizabeth II stepped out onto the balcony of Buckingham Palace. \n\nWatch the celebrations live. https://t.co/v5whDCyP1Z https://t.co/MeY00gcqb0",
  "data/tweet-nytimes/2022/6/1532112279692509185.json": "The Biden administration said on Wednesday it would cut in half the amount it charges companies to build wind and solar projects on federal lands, a move designed to encourage development of renewable energy. https://t.co/9VwIC8h7Jc",
  "data/tweet-nytimes/2022/6/1532316180349845505.json": "Johnny Depp has been the face of Dior’s Sauvage men’s scent since 2015. The verdict is still out on whether Depp’s defamation case against Amber Heard hurt or helped sales, writes our fashion critic, Vanessa Friedman. https://t.co/UCsvuWstx9",
  "data/tweet-nytimes/2022/6/1532167637890899970.json": "Frightened students. Phone calls. Memorials and stuffed animals. From the University of Texas in 1966, to Columbine in 1999 and now Uvalde, the images of school shootings across America reveal hauntingly similar scenes. https://t.co/ofQrdQuwhG https://t.co/AwW2OJiPhP",
  "data/tweet-nytimes/2022/6/1532190287434481665.json": "They oversee the flow of billions of dollars from Putin-connected Russians to companies involved in superyachts and villas. Now they’ve drawn the attention of a U.S. task force that is trying to disrupt the Russian war machine. https://t.co/KNKQ4fUuI1",
  "data/tweet-nytimes/2022/6/1532373732567687168.json": "Prince Louis didn’t appear to enjoy the military flyover for Queen Elizabeth II’s #PlatinumJubilee. The 4-year-old is the fifth in line to the British throne.\nhttps://t.co/dby2Q541ak https://t.co/UlQRmkwFwz",
  "data/tweet-nytimes/2022/6/1532369023903666178.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/55ehLTgbUZ",
  "data/tweet-nytimes/2022/6/1532022940883116036.json": "In Opinion\n\n\"We are not encouraging or enabling Ukraine to strike beyond its borders,\" President Biden writes in a guest essay. \"We do not want to prolong the war just to inflict pain on Russia.\" https://t.co/xU3nGxXFtY https://t.co/Sn8BA9uzkW",
  "data/tweet-nytimes/2022/6/1532180236925812739.json": "In the final moments of her life, Eva Mireles, a teacher at Robb Elementary School, was on the phone with her husband, a school district police officer. The call was among the new details that have added to the shifting portrait of the shooting in Uvalde. https://t.co/SOpZwt6ytX",
  "data/tweet-nytimes/2022/6/1532385063198916608.json": "Breaking News: A New York appeals court upheld Harvey Weinstein’s 2020 sex-crimes conviction, raising the likelihood he'll serve most of his 23-year sentence. https://t.co/qkRorc2iWl",
  "data/tweet-nytimes/2022/6/1532350075137138689.json": "Queen Elizabeth II was joined on the Buckingham Palace balcony by four generations of Britain’s royal family for her #PlatinumJubilee.\n\nIt was a smaller group than in previous jubilee years, with Prince Andrew and Prince Harry missing from the lineup.\nhttps://t.co/p9eVu3C8DU",
  "data/tweet-nytimes/2022/6/1532392879200559105.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/HK4DC61b3g",
  "data/tweet-nytimes/2022/6/1532319897564372996.json": "Ukraine accused Russia of forcibly deporting hundreds of thousands of Ukrainians from occupied territories. President Volodymyr Zelensky called the campaign “one of Russia’s most heinous war crimes.”\nhttps://t.co/nNReJBRSxw",
  "data/tweet-nytimes/2022/6/1532410185221799942.json": "Breaking News: The gunman who killed four people at a Tulsa medical building underwent back surgery last month and the doctor who performed it was one of the victims, police said. His weapons included an AR-15-style rifle he bought hours before the attack. https://t.co/lddrAIQxdj",
  "data/tweet-nytimes/2022/6/1531938636417073156.json": "The U.S. will send Ukraine advanced rocket systems and munitions as part of a new $700 million package of military aid intended to help Ukrainians fight back against Russia, President Biden said on Tuesday. https://t.co/Sjvc44IRsp",
  "data/tweet-nytimes/2022/6/1532431882448666625.json": "Doctors successfully transplanted a 3-D printed ear made of living human cells. The new ear, transplanted in March, will continue to regenerate cartilage tissue, giving it the look and feel of a natural ear, said the biotech company that made the implant. https://t.co/gCmmBnOsKF https://t.co/DZbke2sNUN",
  "data/tweet-nytimes/2022/6/1532205391265898496.json": "Having something to look forward to can boost your mood and lower your stress, studies suggest. Whether it's something small or large, like trying a new book or planning a trip, here are ways to incorporate the power of anticipation into everyday life. https://t.co/53fSJN7WaT",
  "data/tweet-nytimes/2022/6/1532454033667112975.json": "Breaking News: President Biden plans to travel to Saudi Arabia this month to rebuild relations in an effort to lower gas prices in the U.S. and isolate Russia. https://t.co/N2roZNSZbS",
  "data/tweet-nytimes/2022/6/1532346340201713664.json": "After he heard two loud noises he recognized as gunfire, Gannon Gill, a physician assistant, led his patient to safety at the Tulsa medical center that was the site of a mass shooting. https://t.co/sHhCA81Bst",
  "data/tweet-nytimes/2022/6/1532462077163585536.json": "“We value the comfort and self-regard of men, especially famous ones, more than we value the safety and dignity of women, even famous ones,” our critic @aoscott writes on the Johnny Depp-Amber Heard trial verdict. https://t.co/EOt3nrQCKr",
  "data/tweet-nytimes/2022/6/1532457042471952384.json": "The gunman who killed four people at a Tulsa medical building underwent back surgery last month and the doctor who performed it was one of the victims, police said. His weapons included an AR-15-style rifle he bought hours before the attack. https://t.co/IoqGq6jHjL https://t.co/byUy3Sk2sd",
  "data/tweet-nytimes/2022/6/1532515933834575901.json": "Breaking News: In a speech, President Biden urged Congress to ban assault-style weapons, expand background checks and pass “red flag” laws. https://t.co/jzZ8Q3Tfvt https://t.co/mJ6zqFAXvA",
  "data/tweet-nytimes/2022/6/1532540282050383872.json": "Breaking News: New York lawmakers passed a set of gun bills to raise the minimum age to buy a semiautomatic rifle to 21 and revise the state’s “red flag” laws.\nhttps://t.co/0ZIxXejuXX",
  "data/tweet-nytimes/2022/6/1532440701962797062.json": "Glittery butterflies. TikTok. Superman. Encanto. These are just a few of the details that families of the victims of the Uvalde mass shooting provided about their children to the team creating customized caskets for their funeral services. https://t.co/gkIUN2Y3TY https://t.co/maNlcjase2",
  "data/tweet-nytimes/2022/6/1532517192041898009.json": "Zaila Avant-garde was 14 last year when she became the first Black American to win the Scripps National Spelling Bee. Her ambitions do not stop there. She wants to play for the WNBA, work at NASA and develop a way for humans to survive longer in space. https://t.co/b1k5h3ym5s https://t.co/hu3euykPGW",
  "data/tweet-nytimes/2022/6/1532399184644546561.json": "At least a half-dozen current and former Proud Boys, the far-right nationalist group that was at the forefront of Jan. 6 Capitol riot, have secured seats on the Miami-Dade Republican Executive Committee, seeking to influence local politics from the inside. https://t.co/O7lyLahPur",
  "data/tweet-nytimes/2022/6/1532538833815879689.json": "“This is not about taking away anyone’s guns,” President Biden said in a speech calling on Congress to pass new federal gun legislation, including stopping the sale of assault-style weapons, expanding background checks and passing “red flag” laws. https://t.co/lW6DP428ML https://t.co/C400givGlO",
  "data/tweet-nytimes/2022/6/1532563421971025934.json": "Harini Logan, 14, won the Scripps National #SpellingBee, claiming victory in a blistering, first-of-its-kind spell-off that capped a marathon duel. The eighth-grader from San Antonio, Texas, was reinstated earlier in the final round. https://t.co/G3j9QFgQUQ https://t.co/UCY0g2ICKp",
  "data/tweet-nytimes/2022/6/1532487242320695314.json": "Queen Elizabeth II celebrated 70 years on the throne Thursday, as the first day of the Platinum Jubilee celebrations kicked off in London. The festivities included a military parade, a 41-gun salute and a 70-aircraft flyover. https://t.co/HOWsRNQmJp",
  "data/tweet-nytimes/2022/6/1532426868925812736.json": "Florida’s Supreme Court refused to consider a challenge to a new voting map approved by the Republican State Legislature that a lower court said illegally diluted the power of Black voters. https://t.co/yPl9PmorIy",
  "data/tweet-nytimes/2022/6/1532666989654818817.json": "Prince Harry and his wife, Meghan, have arrived for the service at St. Paul’s Cathedral, their first public appearance during the queen's #PlatinumJubilee celebrations. \n\nWatch live. https://t.co/eSGV3X15Mn https://t.co/Tvgsb1Ney1",
  "data/tweet-nytimes/2022/6/1532671574863667203.json": "It was a moment that royal watchers had been waiting for.\n\nPrince Harry and his wife, Meghan, made their first appearance at the #PlatinumJubilee. The prince surrendered his senior royal status in 2020 when the couple left Britain to live in California. https://t.co/eXwFs6vNey https://t.co/f1NaCmGFAT",
  "data/tweet-nytimes/2022/6/1532683444609859585.json": "Prince Harry and his wife, Meghan, walked hand-in-hand into St. Paul’s Cathedral, drawing loud cheers from the crowd outside and turning every head inside.\n\nIn the #PlatinumJubilee's meticulous choreography, their highly visible arrival was no accident.  https://t.co/BjIlyltqKX https://t.co/5rSSdINpn1",
  "data/tweet-nytimes/2022/6/1532670974868566017.json": "Johnny Depp’s victory against Amber Heard — when he was awarded more than $10 million in damages — could embolden others accused of abuse or misconduct to try their luck with juries, lawyers say. https://t.co/7JA4I8ChSD",
  "data/tweet-nytimes/2022/6/1532614334416883712.json": "Prince Harry and his wife, Meghan, are expected to make their first big appearance at Queen Elizabeth II's #PlatinumJubilee.\n\nThey will attend a service at St. Paul’s Cathedral, but the queen herself will skip the event. Follow live. https://t.co/LeusTsxQqq",
  "data/tweet-nytimes/2022/6/1532558372574306324.json": "Breaking News: Harini Logan, 14, won the 2022 Scripps National #SpellingBee after the competition headed to an unprecedented spell-off. She correctly spelled 21 words in 90 seconds. https://t.co/6cPy9YNee5",
  "data/tweet-nytimes/2022/6/1532774298976387074.json": "Breaking News: A day before the Jan. 6 assault on the Capitol, an aide to Mike Pence warned of a security risk to the vice president, saying President Donald Trump was going to publicly turn on him. https://t.co/5UGbG0bJi3",
  "data/tweet-nytimes/2022/6/1532764052497244162.json": "Barbados dropped Queen Elizabeth II as its head of state and became a republic. Now, six other Caribbean nations may follow.\nSince the Black Lives Matter movement, calls for reparations for Britain’s brutal role in the slave trade have been rising. https://t.co/X0lvWxxODW",
  "data/tweet-nytimes/2022/6/1532786713403203584.json": "Breaking News: The police chief who oversaw the response to a mass shooting in Uvalde, Texas, arrived on scene without his police radio, a law enforcement official said. A tactical team ultimately ignored directives not to breach the classroom. https://t.co/sShSGMqXxG",
  "data/tweet-nytimes/2022/6/1532703469504806912.json": "Breaking News: The U.S. hiring spree continued in May: Employers added 390,000 jobs and average hourly earnings rose 5.2% from a year ago. https://t.co/gj7PFTSYf2",
  "data/tweet-nytimes/2022/6/1532416796913029120.json": "Tosca Musk, Elon Musk’s younger sister, is the force behind Passionflix, a streaming service dedicated to adaptations of romance novels and erotic fan fiction. The online service costs $6 a month and organizes content by a “barometer of naughtiness.” https://t.co/nAx8KBaA5r",
  "data/tweet-nytimes/2022/6/1532760743040409600.json": "Breaking News: Peter Navarro, a White House adviser to Donald Trump, was charged with contempt of Congress for defying a subpoena from the Jan. 6 inquiry. https://t.co/sLYPtgRgDG",
  "data/tweet-nytimes/2022/6/1532820429131358209.json": "Representative Chris Jacobs, a Republican from New York, embraced gun control measures after the shootings in Buffalo and Uvalde, Texas. A week later, facing his party’s anger, he’s ending his re-election run. https://t.co/N6bypC4Tmd",
  "data/tweet-nytimes/2022/6/1532779179275583489.json": "Carbon dioxide in the atmosphere hit its highest level ever as humans pumped 36 billion tons of the planet-warming gas in 2021. https://t.co/8IfPjsxO8P",
  "data/tweet-nytimes/2022/6/1532633225922748417.json": "Barack Obama paid tribute to Queen Elizabeth II in a video message in which he said they had formed their own “special relationship.” https://t.co/eAqQqgn0Qm https://t.co/0LIP3q2phX",
  "data/tweet-nytimes/2022/6/1532745191202902017.json": "After mass shootings in the U.S., proposals to ban assault weapons follow. And gunmakers respond — by adapting guns in ways that keep them legal, but nearly indistinguishable from illegal assault weapons. https://t.co/0hyD4um6CW",
  "data/tweet-nytimes/2022/6/1532791759234912264.json": "The amount of carbon dioxide in the atmosphere broke a record in May, scientists said on Friday. Humans pumped 36 billion tons of the planet-warming gas into the atmosphere in 2021, more than in any previous year. https://t.co/3epCfNwl3z https://t.co/gstZUXSUd0",
  "data/tweet-nytimes/2022/6/1532701161114980357.json": "Zaila Avant-garde was 14 last year when she became the first Black American to win the Scripps National Spelling Bee. Her ambitions do not stop there. She wants to play for the WNBA, work at NASA and develop a way for humans to survive longer in space. https://t.co/XBoTSvwZX9 https://t.co/kFZsi5XZjs",
  "data/tweet-nytimes/2022/6/1533011186698141696.json": "Having something to look forward to can boost your mood and lower your stress, studies suggest. Whether it's something small or large, like trying a new book or planning a trip, here are ways to incorporate the power of anticipation into everyday life. https://t.co/lsaPt7uh7Y",
  "data/tweet-nytimes/2022/6/1533100027425574914.json": "Dozens of mariachi musicians had traveled to Uvalde with the hope that they could deliver a dose of comfort. With trumpets, strings and serenades, their music speaks to a community’s profound sorrow. https://t.co/m9iO3mpZ8f https://t.co/X2lju8kcPd",
  "data/tweet-nytimes/2022/6/1532875244771344384.json": "Breaking News: The Justice Department declined to charge Mark Meadows and Dan Scavino, two former Trump aides, for stonewalling the Jan. 6 inquiry. https://t.co/EWblVEZLli",
  "data/tweet-nytimes/2022/6/1533081163023237120.json": "Raquel Fortun is one of only two forensic pathologists in the Philippines. Before her, there had been no independent inquiry into the country's drug war. She has used her skills to show how other doctors falsely claimed some victims died natural deaths.\nhttps://t.co/ySiccf2z0V https://t.co/3qIp1F0KtJ",
  "data/tweet-nytimes/2022/6/1532854673388052483.json": "Special Olympics lifted its Covid vaccine requirement for athletes and staff after Florida officials threatened a $27.5 million fine over the mandate. Gov. Ron DeSantis, who has blocked vaccine and mask mandates, criticized the requirement on Friday. https://t.co/u6sBybMQJc",
  "data/tweet-nytimes/2022/6/1533071093052985350.json": "A 150-mile leisurely bike ride from Trieste, Italy, through Slovenia, to the ancient city of Pula, Croatia, brims with ancient traditions, sublime food and perched-village photo ops. https://t.co/xB4y3iVKMZ https://t.co/fR4IndCwIy",
  "data/tweet-nytimes/2022/6/1533144309154951169.json": "If four key gun control proposals now being considered in Congress had been law since the Columbine High School in 1999, they might have changed the course of 35 mass shootings that killed 446, a New York Times analysis found. https://t.co/DQEllQAcfi",
  "data/tweet-nytimes/2022/6/1533171778385858565.json": "If ever there was a potent symbol of how much Russia’s invasion of Ukraine has altered Europe, the sight of this enormous battleship in Stockholm, bristling with 26 warplanes and 2,400 Marines and sailors, would certainly be it. https://t.co/VKf2iDHQjC https://t.co/sRMB3lyxpA",
  "data/tweet-nytimes/2022/6/1533130220395454465.json": "Drivers in Miami faced slashing rains and flooded streets as a rapidly growing weather system moved into the South Florida region. https://t.co/zMSiS73aLq https://t.co/IURSembeBz",
  "data/tweet-nytimes/2022/6/1533190746869747713.json": "Dozens of mariachi musicians had traveled to Uvalde with the hope that they could deliver a dose of comfort. With trumpets, strings and serenades, their music speaks to a community’s profound sorrow. https://t.co/aefNYCmhbm https://t.co/N2Ay5XaKt7",
  "data/tweet-nytimes/2022/6/1533182310224474115.json": "President Emmanuel Macron of France, who has sought to position himself as the world’s chief negotiator with the Kremlin, pleaded Saturday to not \"humiliate\" Russia.\n\nUkraine’s foreign minister said Macron's advice \"can only humiliate France.\" https://t.co/DWbIoZdhkI",
  "data/tweet-nytimes/2022/6/1533164693266870274.json": "An emergency services dispatcher in Buffalo who was accused of hanging up on a 911 call from a supermarket employee during the mass shooting in May has been fired. The employee said the dispatcher yelled at her for whispering as she hid during the attack. https://t.co/ytiXrh11cY",
  "data/tweet-nytimes/2022/6/1533183076381114368.json": "“We value the comfort and self-regard of men, especially famous ones, more than we value the safety and dignity of women, even famous ones,” our critic writes on the Johnny Depp-Amber Heard trial verdict. https://t.co/tNWFewWQBJ",
  "data/tweet-nytimes/2022/6/1533198661081042944.json": "A former Air Force sergeant who participated online in an extremist anti-government movement was sentenced to 41 years in prison for murdering a federal security officer and injuring another outside a courthouse in Oakland, California. https://t.co/8Yq2O1yKOs",
  "data/tweet-nytimes/2022/6/1533145310339407873.json": "The police chief who oversaw the response to a mass shooting in Uvalde, Texas, arrived on scene without his police radio, a law enforcement official said. A tactical team ultimately ignored directives not to breach the classroom. https://t.co/oxClOIGg1c",
  "data/tweet-nytimes/2022/6/1533258571902865409.json": "Here is a collection of booze-free beverages for the season. https://t.co/EFyIh5P3j0 https://t.co/ycBVpU9uyp",
  "data/tweet-nytimes/2022/6/1533175528827527168.json": "John Fetterman, a heart patient, will be battling Dr. Mehmet Oz, a heart surgeon, in Pennsylvania for the Senate seat deemed most within reach for a Democratic takeover. Fetterman's recent health struggles have left some Democrats with a distinct unease. https://t.co/FUx1d80wkS",
  "data/tweet-nytimes/2022/6/1533441661732376576.json": "A boy who played Little League. A girl who dreamed of becoming a veterinarian. Several children who had just made the honor roll. \n\nIn all, 21 people — 19 students and two teachers — were killed by a gunman in Uvalde, Texas. These are their stories. https://t.co/T066oSv1Nv",
  "data/tweet-nytimes/2022/6/1533472229618491392.json": "Breaking News: Rafael Nadal beat Casper Ruud for his 14th title in Paris and his 22nd major trophy, extending his lead on the all-time list. https://t.co/UOu0W0hW66",
  "data/tweet-nytimes/2022/6/1533503927806832641.json": "\"There were a lot of happy tears.\"\n\nIt was a small trial, just 18 rectal cancer patients, every one of whom took the same drug.\n\nBut the results were astonishing. The cancer vanished in every single patient. https://t.co/mYnlfUkKAs",
  "data/tweet-nytimes/2022/6/1533492623981305856.json": "Rafael Nadal on Sunday extended his men’s singles record of 22 Grand Slam titles with a win in straight sets over Casper Ruud. The victory secured Nadal his 14th men’s singles title at the tournament, extending a French Open record. https://t.co/maRQonAR56 https://t.co/aKG3sPhDR8",
  "data/tweet-nytimes/2022/6/1533473755187630081.json": "For months after Russia invaded their country, the members of Ukraine’s national soccer team were unable to hold so much as a practice together, let alone play a game.\n\nOn Sunday, they will play Wales for a place in the World Cup. https://t.co/W5WjfAbsI2",
  "data/tweet-nytimes/2022/6/1533551964017119235.json": "It was a small trial, just 18 rectal cancer patients, every one of whom took the same drug.\n\nBut the results were astonishing. The cancer vanished in every single patient, and no further treatment was necessary. https://t.co/bW2SRCE5ft",
  "data/tweet-nytimes/2022/6/1533578589450412035.json": "Dozens were believed to be dead in southwestern Nigeria after assailants attacked a Catholic church on Sunday, firing on worshipers as they celebrated Mass, officials said. It was the deadliest attack on a church in years in Africa’s most populous nation. https://t.co/VopVcshQl4",
  "data/tweet-nytimes/2022/6/1533524363609268230.json": "Platinum Jubilee celebrations ended Sunday, with Queen Elizabeth II making another appearance on the Buckingham Palace balcony.\n\nOn Monday, Britain pivots from joyful tributes to the queen’s 70-year reign to renewed political ructions over Boris Johnson. https://t.co/C2jzmgFa7R https://t.co/dgzuh2jrBQ",
  "data/tweet-nytimes/2022/6/1533532667446190082.json": "The New York Times assessed four key gun-control proposals currently before Congress and found that they could have changed the course of dozens of mass shootings since the Columbine massacre in 1999. https://t.co/YbS6nB39wQ",
  "data/tweet-nytimes/2022/6/1533560556275236864.json": "Queen Elizabeth II joined other members of the royal family on the balcony of Buckingham Palace, as four days of Platinum Jubilee celebrations came to an end on Sunday. https://t.co/YZ4ny7Ge2I https://t.co/MIbBanbngP",
  "data/tweet-nytimes/2022/6/1532965435783749633.json": "California has some 700 certified farmers’ markets, featuring some of the world’s best produce — but it took legislative changes in the 1970s to help them flourish. https://t.co/LiaUFpa663 https://t.co/EwObwjB9N9",
  "data/tweet-nytimes/2022/6/1533721615053340673.json": "Prime Minister Boris Johnson of Britain will face a no-confidence vote that could force him from power.\n\nFollow our live updates. https://t.co/et1ZfYzBeg https://t.co/p5B8x4akFQ",
  "data/tweet-nytimes/2022/6/1533776728170143745.json": "The British military announced that it would send its most sophisticated multiple-launch rocket system to Ukraine, joining the U.S. in providing long-range artillery as Russia hits Ukrainian positions across the eastern front.\nhttps://t.co/FyYYc1noHg",
  "data/tweet-nytimes/2022/6/1533622248476708864.json": "Three people were killed and 12 others were injured, officials said, in a shooting on a packed street in downtown Philadelphia.\n\nOther shootings in Tennessee, Virginia, Arizona and South Carolina over the weekend left six more dead and dozens injured. https://t.co/xXWxNxegxc",
  "data/tweet-nytimes/2022/6/1533795885267689474.json": "President Volodymyr Zelensky met soldiers and handed out military awards near the frontline in eastern Ukraine, in a visit aimed at boosting morale.\n\n“I am proud of everyone with whom I met, whom I shook hands with,” he said of his visit.\nhttps://t.co/hshtbG131A https://t.co/4tSJMsDW3W",
  "data/tweet-nytimes/2022/6/1533815526576857088.json": "Breaking News: Elon Musk threatened to pull out of his $44 billion deal with Twitter, accusing the platform of “resisting” requests for data about fake accounts.\nhttps://t.co/CsYvrHAa2N",
  "data/tweet-nytimes/2022/6/1533811218187751425.json": "\"There were a lot of happy tears.\"\n\nIt was a small trial, just 18 rectal cancer patients, every one of whom took the same drug.\n\nBut the results were astonishing. The cancer vanished in every single patient. https://t.co/OwTCoylWYl",
  "data/tweet-nytimes/2022/6/1533801393210933248.json": "The U.S. alerted 14 countries, mostly in Africa, that Russian ships carrying stolen Ukrainian grain could be headed their way, posing a dilemma to countries facing dire food shortages.\nhttps://t.co/nl9tmN49uP",
  "data/tweet-nytimes/2022/6/1533900635183190016.json": "Breaking News: Five members of the Proud Boys, including the group’s former leader, Enrique Tarrio, were charged with seditious conspiracy for their roles in the Jan. 6 riot. https://t.co/2CdBwxo57q",
  "data/tweet-nytimes/2022/6/1533718441491943429.json": "Breaking News: Prime Minister Boris Johnson of Britain faces a no-confidence vote after months of crisis over lockdown-breaking parties at Downing Street.\n\nFollow our live updates. https://t.co/lfUGE9MKZK",
  "data/tweet-nytimes/2022/6/1533122672460185603.json": "A day before the Jan. 6 assault on the Capitol, an aide to Mike Pence warned of a security risk to the vice president, saying President Donald Trump was going to publicly turn on him. https://t.co/qP538AW6x8",
  "data/tweet-nytimes/2022/6/1533833617310371842.json": "The president of Mexico, Andrés Manuel López Obrador, will not attend the Summit of the Americas. Obrador said he made the decision, a blow to President Biden, because Cuba, Nicaragua and Venezuela were not invited to the meeting. https://t.co/tHOvxinp7H",
  "data/tweet-nytimes/2022/6/1533992156599296007.json": "A Florida woman was charged with manslaughter on Monday after her 2-year-old boy found a gun in their home and accidentally shot his father in the back, killing him, the authorities said.\nhttps://t.co/zgL0FnCvbF",
  "data/tweet-nytimes/2022/6/1533519037677936641.json": "Suffolk County on Long Island aggressively uses New York's \"red flag\" law to take guns from people in crisis. A New York Times examination of more than 100 cases filed in the county shows how that law has defused dozens of dangerous situations. https://t.co/qvDU5gCWNY",
  "data/tweet-nytimes/2022/6/1534002230264795136.json": "A federal judge ruled on Monday that Louisiana’s new congressional map represented a racial gerrymander and must be redrawn. https://t.co/C2HiM4OEeD",
  "data/tweet-nytimes/2022/6/1533919184450686976.json": "\"Crying in H Mart\"  has stayed on the New York Times best-seller list for more than 40 weeks. We spoke to Michelle Zauner about the runaway best seller — and what comes next. https://t.co/NNQJ96zC7M",
  "data/tweet-nytimes/2022/6/1534014802401583104.json": "A British journalist and a Brazilian expert on Indigenous peoples have been reported missing deep inside the Amazon rainforest, after the expert’s organization said it had received threats for its work monitoring illegal mining and fishing in the area. https://t.co/VMQQqUv9wl",
  "data/tweet-nytimes/2022/6/1534101126949355520.json": "A British journalist and a Brazilian expert on Indigenous peoples have been reported missing deep inside the Amazon rainforest, after the expert’s organization said it had received threats for its work monitoring illegal mining and fishing in the area. https://t.co/fF5RwHk8lG",
  "data/tweet-nytimes/2022/6/1533914134403751944.json": "Three Tempe, Arizona, police officers are on paid leave amid an investigation into their response to a man who jumped into a lake and, despite his repeated pleas for help, drowned as the officers watched, newly released video footage and records show. https://t.co/u66Oww7iAQ",
  "data/tweet-nytimes/2022/6/1534165842862145538.json": "A Florida woman was charged with manslaughter on Monday after her 2-year-old boy found a gun in their home and accidentally shot his father in the back, killing him, the authorities said.\nhttps://t.co/7I9kIECv2v",
  "data/tweet-nytimes/2022/6/1534089801581854720.json": "Fiji handed over to the U.S. a $325 million superyacht that American investigators say is owned by a Russian billionaire on a U.S. sanctions list, the island nation’s top prosecutor said.\nhttps://t.co/1JGgrRoRn0",
  "data/tweet-nytimes/2022/6/1534150946531561472.json": "A federal judge ruled on Monday that Louisiana’s new congressional map represented a racial gerrymander and must be redrawn. https://t.co/S8k667gFg4",
  "data/tweet-nytimes/2022/6/1533921702777966593.json": "Federal authorities intend to seize two aircraft believed to be owned by Roman Abramovich, saying that the Russian oligarch violated strict U.S. export regulations linked to Russia’s invasion of Ukraine, according to new court filings. https://t.co/Am2hBoQPIX",
  "data/tweet-nytimes/2022/6/1534222438300635136.json": "All new smartphones, tablets and laptops in the EU will be required to use a USB-C charger by 2026, under an agreement reached on Tuesday. The new law had been opposed by companies including Apple. https://t.co/tqsjWKGi5t",
  "data/tweet-nytimes/2022/6/1534272901255512066.json": "Exclusive: The NFL star Deshaun Watson, who has been accused of sexual misconduct during massage appointments, used resources provided by the Houston Texans, including nondisclosure agreements, to make appointments with more women than previously known. https://t.co/uUMPmv7E41 https://t.co/kLHTo8HdrN",
  "data/tweet-nytimes/2022/6/1534305472869806082.json": "Matthew McConaughey, a native of Uvalde, Texas, spoke at the White House on Tuesday to honor the victims of the mass shooting and urge bipartisan action on gun safety measures.\n\n“Children were left not only dead, but hollow,” McConaughey said. https://t.co/8dq1JaFVKZ",
  "data/tweet-nytimes/2022/6/1534256849800810497.json": "A bowl of toxic dust is threatening to poison the air around Salt Lake City, as climate change and rapid population growth shrink Utah's Great Salt Lake. https://t.co/BWyjW3gATG https://t.co/9Dx6DJrj1r",
  "data/tweet-nytimes/2022/6/1534324345220259841.json": "Matthew McConaughey, a native of Uvalde, Texas, spoke at the White House on Tuesday about the victims of the mass shooting in his hometown. He also spoke about a need for “responsible gun ownership,” including new gun safety regulations. https://t.co/kHS6svwFqS https://t.co/Vo4DEFfNkn",
  "data/tweet-nytimes/2022/6/1534301730002845698.json": "Monkeypox can be transmitted through the air, at least over short distances, similar to Covid, the CDC said. Airborne transmission is only a small factor in the overall spread, and experts say there are no firm estimates regarding how much it contributes. https://t.co/GoDq2f0DIY",
  "data/tweet-nytimes/2022/6/1534214882647846913.json": "The minimum age for elite figure skaters will gradually be increased to 17 over three years and be in place in time for the 2026 Olympics. A doping scandal involving the 15-year-old Russian Kamila Valieva sparked a debate about age limits. https://t.co/4yuHs2vjz0 https://t.co/hD1M8mC68q",
  "data/tweet-nytimes/2022/6/1534184694580924420.json": "Disneyland apologized to a couple after an employee at its Paris park disrupted their marriage proposal, snatching the ring and ushering them off a stage. \n\nThe man had been planning the proposal for months. “They can’t give us the moment back,” he said. https://t.co/J5L7uyYzPn",
  "data/tweet-nytimes/2022/6/1534375428277907463.json": "Breaking News: The Justice Department is investigating a retired U.S. general, who now heads a think tank, for secretly lobbying for Qatar, documents show. https://t.co/z9GayyukeX",
  "data/tweet-nytimes/2022/6/1534387743085699073.json": "Chesa Boudin, San Francisco’s progressive district attorney, was ousted by voters who grew agitated by persistent property crimes. https://t.co/MMWVwIWbNn",
  "data/tweet-nytimes/2022/6/1534492527017041920.json": "Breaking News: More than 90 women plan to sue the FBI for early failures in its investigation of Larry Nassar, the former doctor for USA Gymnastics who was convicted on state sexual abuse charges.\nhttps://t.co/Jm85rAiBCF",
  "data/tweet-nytimes/2022/6/1534349502915694600.json": "Doctors are being kidnapped to treat wounded gang members. Medical clinics are being charged an extortion fee. As criminal organizations in Mexico control more territory in rural regions, health care workers are increasingly ensnared in the violence. https://t.co/OCwCg8Ugk9",
  "data/tweet-nytimes/2022/6/1534509331961548800.json": "Miah Cerrillo, an 11-year-old who survived the school shooting in Uvalde, Texas, by smearing herself in a classmate’s blood and pretending to be dead, will testify on Wednesday at a House hearing on gun violence.\nhttps://t.co/teiDBrg4gV",
  "data/tweet-nytimes/2022/6/1534203594878201856.json": "Caviar bumps — in which a dollop of the fish roe is eaten (not snorted) off the back of one’s hand — have become a trendy way to consume the pricey delicacy.\n\n“People used to get high off of drugs. Now, we’re getting high off the food.”\nhttps://t.co/4zFaLhCMID",
  "data/tweet-nytimes/2022/6/1534567203625914368.json": "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to Congress the horrors he saw in an emergency room after the massacre, including children \"pulverized\" and \"decapitated\" by bullets.\n\n\"Those mothers' cries, I will never get out of my head.\" https://t.co/nesUOoDBE2",
  "data/tweet-nytimes/2022/6/1534573540250374145.json": "Zeneta Everhart brought a searing and emotional firsthand account to Congress of the damage done to her son, an employee at the Tops supermarket, by a racist gunman armed with an assault-style weapon in the Buffalo mass shooting. https://t.co/JMkX7UrIuZ https://t.co/IqKBjELV3p",
  "data/tweet-nytimes/2022/6/1534616273774071810.json": "Miah Cerrillo, a fourth grader who survived the Uvalde shooting by smearing a dead classmate’s blood on herself, described the attack to Congress. “He shot my friend that was next to me,” she said. “And I thought he would come back to the room.” https://t.co/u9of8xocf5 https://t.co/Fh1LS4HyHW",
  "data/tweet-nytimes/2022/6/1534631372878487553.json": "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to Congress seeing children so \"pulverized\" and \"decapitated\" by bullets \"that the only clue as to their identities was their blood-spattered cartoon clothes still clinging to them.\" https://t.co/w32qyGkFTx https://t.co/Tk4pFze2iD",
  "data/tweet-nytimes/2022/6/1534154494812069888.json": "Exiled leaders from the Russian-occupied city of Mariupol warned of the growing risk of disease outbreaks because sewage systems are not working, dead bodies are still rotting in the streets and tens of thousands of people do not have access to clean water.https://t.co/GqV3Bn72xF",
  "data/tweet-nytimes/2022/6/1534609986994814976.json": "Those from Uvalde, Texas, shared emotional testimonies during a House hearing on gun violence, hours before the lawmakers were scheduled to vote on a package of gun control measures, including prohibiting sales of semiautomatic rifles to people under 21. https://t.co/OAIyd6GZYf https://t.co/h6f0uywkx6",
  "data/tweet-nytimes/2022/6/1534651500768776200.json": "Kimberly Rubio, whose daughter was killed in the Uvalde school shooting, delivered an emotional speech to Congress about the final moments she spent with her daughter and the traumatic events of that day. https://t.co/eYDE0pCNoI https://t.co/1GWq25WgCD",
  "data/tweet-nytimes/2022/6/1534641458124410880.json": "Zeneta Everhart, whose son survived a racist attack on the Buffalo supermarket where he worked, described to Congress his wounds in detail and told lawmakers that “no citizen needs an AR-15.” https://t.co/cWZ7ChzxZW https://t.co/drHuXLKNHt",
  "data/tweet-nytimes/2022/6/1534671693066772486.json": "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to Congress the horrors he saw in an emergency room after the massacre, including children \"pulverized\" and \"decapitated\" by bullets.\n\n“I know I’ll never forget what I saw that day.” https://t.co/bF6xcnyT2z https://t.co/SvQ5eTRf7q",
  "data/tweet-nytimes/2022/6/1534658775466090496.json": "Breaking News: Donald Trump and two of his adult children are set to be questioned under oath next month by the New York State attorney general’s office as part of a civil investigation into his company’s business practices in New York. https://t.co/dqPpjnQngn",
  "data/tweet-nytimes/2022/6/1534701858090106880.json": "From 1907 to 1932, 32 states passed explicit eugenics laws that allowed the government to sterilize the “insane,” the “feebleminded,” the “dependent” and the “diseased” — all of whom were deemed incapable of making their own decisions about reproduction. https://t.co/5V05FQZW1X",
  "data/tweet-nytimes/2022/6/1534732042256146432.json": "The House voted to bar the sale of semiautomatic weapons to people under the age of 21 and ban the sale of large-capacity magazines, as parents of victims and survivors of mass shootings made wrenching appeals for Congress to act on gun violence. https://t.co/FXgyeaOf3I https://t.co/gnTe6n0qyR",
  "data/tweet-nytimes/2022/6/1534682563406614529.json": "Breaking News: The House approved a wide-ranging package of gun control legislation that includes raising the age to buy semiautomatic weapons to 21 and banning high-capacity magazines. But the measure is certain to go nowhere in the Senate. https://t.co/rid54vdSfe",
  "data/tweet-nytimes/2022/6/1534467808897249280.json": "Eight years after the Sewol ferry disaster killed 250 high school students in South Korea, their families continue to struggle with the lessons the tragedy brought to bear. https://t.co/gvkyoHGggV https://t.co/vkMm5BXVog",
  "data/tweet-nytimes/2022/6/1534734544137605122.json": "Oris Buckner, who as New Orleans’s only Black homicide detective in the early 1980s exposed one of the worst cases of police violence in the city’s history, leading to the conviction of three officers on civil rights charges, has died at 70. https://t.co/Y9ANzPKQNu",
  "data/tweet-nytimes/2022/6/1534636422782668806.json": "Twitter plans to give Elon Musk access to a large swath of its data, potentially down to its very last tweet, after he threatened to pull out of a $44 billion deal for the company, saying it has refused to give him information about fake accounts. https://t.co/XMKUDwtswh"
}