{
  "data/tweet-economist/2022/7/1542747369795686400.json": "Since the war began in Ukraine a new heroic figure has emerged: the woman with a gun. One of them is Olesia Vorotnyk https://t.co/ris78x4zNk",
  "data/tweet-economist/2022/7/1542787369056849921.json": "RT @suelinwong: How exactly did China turn Hong Kong into a police state? It wasn't just the national security law. It was decades in the m…",
  "data/tweet-economist/2022/7/1542848272154361858.json": "Ukraine, despite a smaller population, has a larger supply of eager recruits. Ukraine is also receiving ever more sophisticated Western weaponry as Russia cannibalises its own forces \nhttps://t.co/ceGVBSeeuh",
  "data/tweet-economist/2022/7/1542860919180509184.json": "Many Republicans knew all along what Donald Trump was. The main reason for Republicans’ capitulation is simpler. They hate their political opponents, who are his enemy, which made him their friend https://t.co/jfKQVO8b3T",
  "data/tweet-economist/2022/7/1542835329056514048.json": "Ferdinand “Bongbong” Marcos junior’s father was a murderous dictator who stole billions from the state and remained unrepentant to the end https://t.co/T3LW7P1yFn",
  "data/tweet-economist/2022/7/1542813534471524354.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/qUpafU4zg8 https://t.co/OzKOxp5xeC",
  "data/tweet-economist/2022/7/1542864873960476672.json": "Andrés Manuel López Obrador prefers to fight the drug war with “hugs not bullets”. This approach has failed: violence has intensified in Mexico and the pace of disappearances has increased https://t.co/AASae3BxSN",
  "data/tweet-economist/2022/7/1543017724330315778.json": "Provided Donald Trump can be stopped, which seems likelier than not, it is in theory easy to think that the right will return to sanity https://t.co/2GeAoKUtLS",
  "data/tweet-economist/2022/7/1543070968284946432.json": "In both neuroscience and artificial intelligence the next decade promises to be wild https://t.co/4B41cIZatK",
  "data/tweet-economist/2022/7/1543101386119856128.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/TAxmj6FEoh",
  "data/tweet-economist/2022/7/1542986919893766150.json": "Writing seems so fundamental that it is hard to believe just how recent—and miraculous—it really is https://t.co/ZdUtyG3w2C",
  "data/tweet-economist/2022/7/1543166163542282241.json": "Vladimir Putin hopes that the West will impose his terms on Ukraine. In exchange, he will spare the rest of the world from ruin, hunger and the threat of nuclear Armageddon. The thing is, to accept that deal would be a grave miscalculation \nhttps://t.co/Ei93nrhyk4",
  "data/tweet-economist/2022/7/1543211043547238401.json": "Some 80% of disappearances have occurred since 2006, when the government of Felipe Calderón launched a “war on drugs” https://t.co/A8bKxtmS1d",
  "data/tweet-economist/2022/7/1543259220547719170.json": "Ukraine’s national ballet no longer puts on work by Russians. “There is no more ‘Swan Lake’,” says Olesia Vorotnyk. Tchaikovsky is out https://t.co/GUVuk5gVG5",
  "data/tweet-economist/2022/7/1543284636226392070.json": "War is tipping a fragile world towards mass hunger. Fixing that is everyone’s business https://t.co/inRibOhDoL",
  "data/tweet-economist/2022/7/1543091635231363072.json": "A new book emphasises the imaginative leaps that were required to invent writing https://t.co/gr15QCZqOG",
  "data/tweet-economist/2022/7/1543332192260132864.json": "The war in Ukraine turned Poland into a star player. A wiser government would use its newfound centrality to increase its influence in Europe \nhttps://t.co/OG3yPKC47P",
  "data/tweet-economist/2022/7/1543175003159646208.json": "An alliance including Israel and stretching from Morocco all the way to the United Arab Emirates seems to be in the making https://t.co/0CyIx8s4ZO",
  "data/tweet-economist/2022/7/1543420195880030208.json": "Between 2006 and 2012 an average of eight people each day went missing in https://t.co/vQfqdF4BRR the daily toll of disappearances is 25 https://t.co/LrLrT0RurU",
  "data/tweet-economist/2022/7/1543455829696847872.json": "A Finnish study suggests all children may benefit from having male teachers https://t.co/XZKaiJAbLY",
  "data/tweet-economist/2022/7/1543319102156070913.json": "It was either the ancient Sumerians or the Egyptians who first resolved to make symbols stand for sounds https://t.co/7dpNeoXunl",
  "data/tweet-economist/2022/7/1543350307073171457.json": "Even without Donald Trump, culture warring will dominate conservatism until Republicans can no longer win power by it https://t.co/JRmepZOVEJ",
  "data/tweet-economist/2022/7/1543148755813269505.json": "Without a competent army, Congo will remain at the mercy of its predatory neighbours https://t.co/oHrQ47QAeT",
  "data/tweet-economist/2022/7/1543561423468601346.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/PBPdq3xpzg",
  "data/tweet-economist/2022/7/1543681751997874180.json": "When war began, Olesia Vorotnyk quit Ukraine’s national ballet and took up a position at a checkpoint, armed with an AK-47 https://t.co/94ThUbnIEq",
  "data/tweet-economist/2022/7/1543665909381963777.json": "If Ukraine can be kept supplied with arms and ammunition and uses its new firepower judiciously, it could recapture pockets of territory, sow chaos in Russia’s rear and inflict unsustainable losses  \nhttps://t.co/GRzUNM9DK0",
  "data/tweet-economist/2022/7/1543392660634861568.json": "Each neuron is a powerful an information processor. That has implications not only for learning how brains work—and how they go wrong—but also for designing artificial versions that more closely resemble the natural sort https://t.co/8s8RXIfdKY",
  "data/tweet-economist/2022/7/1543703227971125248.json": "Writing seems so fundamental that it is hard to believe just how recent—and miraculous—it really is https://t.co/YcAlZxmLrj",
  "data/tweet-economist/2022/7/1543721521931341830.json": "After Finland abolished a quota ensuring gender balance among primary-school teachers, pupils suffered https://t.co/9zQIH7VUjB",
  "data/tweet-economist/2022/7/1543808803287830530.json": "A Ukrainian ballerina goes to war https://t.co/ejZVTfodzk",
  "data/tweet-economist/2022/7/1543636968411652100.json": "Israel’s defence minister confirmed he had been working with America on a programme for strengthening defence co-operation between Israel and Arab countries https://t.co/TcrzN9hXk7",
  "data/tweet-economist/2022/7/1543818633557712896.json": "To understand why the Communist Party crushed Hong Kong when it did, rather than either doing so earlier or not doing so at all, the Chinese side of the story is vital—as it is to understanding why the clampdown has been so effective https://t.co/pkFYijc5gc",
  "data/tweet-economist/2022/7/1543980479384326146.json": "The overturning of Roe v Wade in America bucks a global trend towards more permissiveness of abortion that is highlighted in this map. \n\nBanning abortion tends not to reduce by much the number of abortions. But it can make every pregnancy less safe. Learn why ⬇️",
  "data/tweet-economist/2022/7/1544050163177734144.json": "The civic and environmental activist was killed near Izyum, aged 24 https://t.co/I8AVZtK3kS",
  "data/tweet-economist/2022/7/1544122745117712386.json": "War is tipping a fragile world towards mass hunger. Fixing that is everyone’s business https://t.co/IUMSuIFHDP",
  "data/tweet-economist/2022/7/1544147035766640642.json": "What to read to understand the history of Western capitalism https://t.co/jDqPxS2zY3",
  "data/tweet-economist/2022/7/1544080553166753792.json": "Society calls such tragedies natural disasters, but they often look man-­made https://t.co/9R5r3OKNY3",
  "data/tweet-economist/2022/7/1543833090388279297.json": "Ukraine’s national ballet no longer puts on work by Russians. “There is no more ‘Swan Lake’,” says Olesia Vorotnyk. Tchaikovsky is out https://t.co/ct6dTCzMag",
  "data/tweet-economist/2022/7/1544385349383774208.json": "Britain’s chancellor and health secretary have resigned, throwing Boris Johnson’s government into disarray. Catch up on the latest updates ⬇️",
  "data/tweet-economist/2022/7/1544199563061432321.json": "Suffering from a bad back, he spends seven-hour shifts seated at a sewing machine on a stool below knee height. To see a lawyer, he must skip a meal https://t.co/6rJFs353GT",
  "data/tweet-economist/2022/7/1544341133991739392.json": "Ferdinand “Bongbong” Marcos junior’s father was a murderous dictator who stole billions from the state and remained unrepentant to the end https://t.co/1ZTvBdjyn2",
  "data/tweet-economist/2022/7/1544486484547444736.json": "Olesia Vorotnyk danced with the national ballet. Then Russia invaded https://t.co/Y2gf4tW9P5",
  "data/tweet-economist/2022/7/1544477158327963648.json": "Motor-vehicle crashes were the leading cause of death for young people in America for more than 60 years. But since 2017, guns have killed more Americans between the ages of one and 24  \nhttps://t.co/dLyhTXAgFL",
  "data/tweet-economist/2022/7/1544529195438678016.json": "A Finnish study suggests all children may benefit from having male teachers https://t.co/mBuDH3znAb",
  "data/tweet-economist/2022/7/1544442045808496648.json": "Costly food and energy are fostering global unrest https://t.co/9mPcpkxuDB",
  "data/tweet-economist/2022/7/1544671027900211200.json": "The opposition politician does not complain easily. But he has been moved to a maximum-security prison notorious for its brutality—and is locked behind a six-metre-tall fence with murderers https://t.co/CFPyh9URwC",
  "data/tweet-economist/2022/7/1544666298621333512.json": "Olesia Vorotnyk danced with the national ballet. Then Russia invaded https://t.co/67spJBujFR",
  "data/tweet-economist/2022/7/1544725800720781319.json": "The fact that he is a serial liar and lacks the self-discipline to apply himself to hard problems is well-known. But the extent to which he poisons the reputations of those he comes into contact with is striking https://t.co/KPdYoH6kuS",
  "data/tweet-economist/2022/7/1544825415457509377.json": "It is a woke and fiscally irresponsible mess https://t.co/TlzZriYrqs",
  "data/tweet-economist/2022/7/1544742489524944896.json": "The British prime minister’s toxicity is not just a personal characteristic. It also says something important about the political system he sits atop https://t.co/pn5hAZhl7j",
  "data/tweet-economist/2022/7/1544907116154163201.json": "Ukraine’s national ballet no longer puts on work by Russians. “There is no more ‘Swan Lake’,” says Olesia Vorotnyk. Tchaikovsky is out https://t.co/h0r6UHjKWB",
  "data/tweet-economist/2022/7/1544960560978173956.json": "Boris Johnson is resigning. He leaves Britain in a dangerous state: the time when everything was possible is over https://t.co/brOwVBKw3s https://t.co/tPd98Inbhu",
  "data/tweet-economist/2022/7/1544972395752177665.json": "Boris Johnson is resigning as the leader of Britain’s Conservative Party. \n\nHe reportedly wants to stay on in a caretaker capacity until the autumn while a new leader is chosen.\n\nFollow the latest updates here 👇",
  "data/tweet-economist/2022/7/1544980327445270528.json": "Boris Johnson’s government has collapsed at last. For months Britain’s prime minister wriggled out of one scandal after another. He has asked to stay until the autumn, but he should go immediately https://t.co/RklTIylpZV",
  "data/tweet-economist/2022/7/1544997424829194241.json": "In his departure, as in government, Boris Johnson demonstrated a wanton disregard for the interests of his Conservative Party—and the country https://t.co/Kfu2GRlz59",
  "data/tweet-economist/2022/7/1545025955588194305.json": "For months Boris Johnson wriggled out of one scandal after another. He says he will stay on as prime minister until a new Conservative Party leader is chosen. He should go immediately https://t.co/M9dUPmFuA1",
  "data/tweet-economist/2022/7/1544989883877425155.json": "Voters should reject Chile’s new draft constitution https://t.co/L10ip2jecL",
  "data/tweet-economist/2022/7/1545052049686945794.json": "Boris Johnson did what he always does: he looked out for Boris Johnson. Now Britain faces the consequences https://t.co/s3tff9ORy0",
  "data/tweet-economist/2022/7/1545075438749360131.json": "The hype about TikTok is justiﬁed—and so are the concerns. There’s a reason why the world’s most exciting app is also its most mistrusted https://t.co/ZquBScEVEx https://t.co/h09eupWgRz",
  "data/tweet-economist/2022/7/1545044050021011457.json": "The British prime minister’s toxicity is not just a personal characteristic. It also says something important about the political system he sat atop https://t.co/kLPv48C8UC",
  "data/tweet-economist/2022/7/1544892085253427202.json": "Alaa Abd el-Fattah, a computer programmer, rocketed to fame as the voice of a new set of tech-savvy revolutionaries in Egypt. He has spent much of the past decade in prison https://t.co/7PGxAQ0kFe",
  "data/tweet-economist/2022/7/1545220087128408065.json": "A few ideas are laudable. But overall the draft is a confusing mess, full of woolly language that more or less guarantees decades of squabbling about what it actually means https://t.co/6DVtvkOPn6",
  "data/tweet-economist/2022/7/1545275984915492865.json": "Abe Shinzo, Japan’s longest-serving prime minister, is in a critical condition after being shot while making a campaign speech. In this article from 2020, we considered his political legacy https://t.co/qsFXoSbN0n",
  "data/tweet-economist/2022/7/1545281889807876096.json": "Abe Shinzo is in a critical condition in hospital after an assassination attempt. In May he gave an interview to The Economist, discussing Japan’s foreign and security policy—and his legacy https://t.co/tSd8y9JlHt",
  "data/tweet-economist/2022/7/1545259099432042496.json": "For months Boris Johnson wriggled out of one scandal after another. He says he will stay on as prime minister until a new Conservative Party leader is chosen. He should go immediately https://t.co/VopNea26A0",
  "data/tweet-economist/2022/7/1545239379928649728.json": "Chile’s new draft constitution would shift the country far to the left https://t.co/x1a5PQuATo",
  "data/tweet-economist/2022/7/1545128229882810368.json": "It is absurdly long, with 388 articles. It is also fiscally irresponsible and sometimes dotty https://t.co/WcnqFMPL59",
  "data/tweet-economist/2022/7/1545281040196960256.json": "Why do so many countries remain poor when some are fabulously rich? And what is work like today compared with the past? For the answers, you need to turn to economic history https://t.co/bkghfaecNH",
  "data/tweet-economist/2022/7/1545296680244871170.json": "The assassination attempt has sent shockwaves through a country where both gun crime and political violence are extremely rare https://t.co/kTmQ4g1UHL",
  "data/tweet-economist/2022/7/1545090505234595844.json": "About 70% of ten-year-olds in middle- and low-income countries cannot read and understand a simple story, the World Bank suggests. This should be seen for what it is: a global emergency https://t.co/WirCIPu5F1",
  "data/tweet-economist/2022/7/1545332768590254081.json": "Breaking news: Abe Shinzo, Japan’s longest-serving post-war prime minister, has died https://t.co/BeBBTLmRWZ",
  "data/tweet-economist/2022/7/1545328845389185028.json": "In an instant, the shooting shattered Japan’s sense of internal security. Yet the assassination attempt is not entirely without precedent https://t.co/bldtNA6EKQ",
  "data/tweet-economist/2022/7/1545339283036405762.json": "Japan’s longest-serving post-war prime minister has been assassinated. In May he spoke to The Economist, discussing the country’s foreign and security policy—and his legacy https://t.co/ENhzxfMpwA",
  "data/tweet-economist/2022/7/1545346011752763392.json": "♦️ Abe Shinzo, who was Japan’s longest-serving prime minister, has been assassinated.\n\n♦️ The race to be the next leader of Britain’s Conservative Party begins.\n\n♦️ Why Russian inflation is different.\n\nCatch up quickly on the global stories that matter 👇",
  "data/tweet-economist/2022/7/1544931985222942722.json": "Could the findings from the Large Hadron Collider’s next run help physicists achieve their ultimate goal: unifying the Standard Model and general relativity into an overarching “theory of everything”? We explain https://t.co/8EjK9K87yR",
  "data/tweet-economist/2022/7/1545353527458938881.json": "Abe Shinzo, Japan’s longest-serving post-war prime minister, has been assassinated. In this article from 2020, we considered his political legacy https://t.co/g0LZ7uQ0pB",
  "data/tweet-economist/2022/7/1545350662367711232.json": "RT @NoahSneider: 1/ The shooting of Abe Shinzo, Japan's former prime minister, has shocked Japan. It is likely to reshape the country in wa…",
  "data/tweet-economist/2022/7/1545375665846984705.json": "Abe Shinzo, Japan’s former prime minister, has been assassinated. On “The Intelligence”, @NoahSneider analyses the implications for the country and its politics https://t.co/xTNwk0uqMv",
  "data/tweet-economist/2022/7/1545376783142354945.json": "RT @t_wainwright: One of our covers this week is on the light-entertainment phenomenon that became an unlikely political force, even as it…",
  "data/tweet-economist/2022/7/1545419195805999106.json": "In an instant, the shooting shattered Japan’s sense of internal security https://t.co/f4G9uFsh6j",
  "data/tweet-economist/2022/7/1545393797605064704.json": "Chinese espionage against intellectual property is a “co-ordinated campaign on a grand scale”, MI5’s director-general says. The “strategic contest” will last decades https://t.co/E2fsNwPIw0",
  "data/tweet-economist/2022/7/1545454256001630210.json": "Abe Shinzo dreamed of being a filmmaker. He ended up his country’s most consequential prime minister in decades https://t.co/8sbjyLZQ5Z",
  "data/tweet-economist/2022/7/1545462985879060481.json": "Abe Shinzo served longer than any other post-war leader. When an assassin shot him at a campaign event, he became the first Japanese head of government to be killed in the post-war era https://t.co/jgsSnG1xnl",
  "data/tweet-economist/2022/7/1545483160904949761.json": "President Joe Biden has signed an executive order to safeguard the right to abortion in America, expanding access to medication abortion, contraception and emergency medical care. We explain the benefits of abortion-by-mail https://t.co/a46vrZXlLv",
  "data/tweet-economist/2022/7/1545542260946862081.json": "Ukraine’s comedian-turned-president was “visibly nervous” in his early bouts of diplomacy. Now he has an experience of statecraft that no modern Western leader can match, nor would wish to https://t.co/3YFl4YMVlr",
  "data/tweet-economist/2022/7/1545565611639578625.json": "Abe Shinzo dreamed of being a filmmaker. But his path into politics was all but predetermined https://t.co/ATx5hJGl7O",
  "data/tweet-economist/2022/7/1545639423890579456.json": "New data suggest that the damage from shutting down schools has been worse than almost anyone expected https://t.co/NFwisYrDsg",
  "data/tweet-economist/2022/7/1545416350151184386.json": "RT @majohns: Our story this week reproduces startling estimates (by McKinsey) of learning loss caused by covid school disruptions. Huge lag…",
  "data/tweet-economist/2022/7/1545481350064623621.json": "“Zelensky”, by Serhii Rudenko, is the first book in English about Ukraine’s comedian-turned-president-turned-war leader. It measures the gulf between before and now https://t.co/e74VDQk7EC",
  "data/tweet-economist/2022/7/1545561379922395137.json": "“America is basically going through the steepest episode of monetary tightening since 1981,” argues @S_Rabinovitch on our “Checks and Balance” podcast. “The precedent strongly suggests that...very likely will tip it into a recession” https://t.co/GedKDaaZZE",
  "data/tweet-economist/2022/7/1545719179193552896.json": "To critics, he represented a dangerous strain of nationalist revisionism. To supporters, he was the realist visionary Japan needed in a more turbulent modern world https://t.co/XBSYKnDU5K",
  "data/tweet-economist/2022/7/1545735276433137664.json": "Researchers at Imperial College London used an epidemiological model to calculate the pandemic deaths prevented by jabs https://t.co/tJl6KfgBVk",
  "data/tweet-economist/2022/7/1545743602206261249.json": "Whereas China’s “new Silk Road” has focused on hard infrastructure, the G7’s plan will prioritise climate and energy security, digital connectivity, health and equality https://t.co/MYitrfpLtE",
  "data/tweet-economist/2022/7/1545723206195204098.json": "War is the coldest, hardest of realities. It calls for virtues that are the opposite of acting. Volodymyr Zelensky’s is “unembellished courage”, writes Serhii Rudenko in a new book https://t.co/fUtmJrkRQ8",
  "data/tweet-economist/2022/7/1545816817679089664.json": "A few years ago Europe was deeply split over China. But at a recent NATO summit all 30 allies agreed that China was now in “strategic partnership” with Russia, and that the duo were “at the forefront of an authoritarian pushback” https://t.co/4hI7DTrERe",
  "data/tweet-economist/2022/7/1545528325682200579.json": "Elon Musk has ended his takeover bid of Twitter, according to a letter to the social-media firm from his lawyers. Earlier this year we assessed how the deal brought the whiff of the meme stock to the platform https://t.co/2eJHHCwQ4b",
  "data/tweet-economist/2022/7/1545812030694821891.json": "Britain’s last chief in Hong Kong describes China’s recent clampdown in the territory as “the destruction of one of the freest societies in Asia by communist tyranny” https://t.co/XofmYBM1UE",
  "data/tweet-economist/2022/7/1545900622876229632.json": "Abe Shinzo left an imprint on geopolitics. Diplomats across the world now speak of Asia in terms of the “Free and Open Indo-Pacific”, a coinage of his https://t.co/nARX8poipH",
  "data/tweet-economist/2022/7/1545901369143484418.json": "As bad as the past 18 months have been, they would have been worse without vaccines—perhaps about 2.7 times worse https://t.co/otoZ0XEkvR",
  "data/tweet-economist/2022/7/1545781113364291584.json": "Chile’s old constitution was hardly perfect. But compared with its proposed replacement, it is a paragon of clarity https://t.co/ujSF3YtJwY",
  "data/tweet-economist/2022/7/1545962579566231554.json": "The study found that vaccines helped both rich and poor countries. Nearly as many deaths were prevented in countries covered by the COVAX distribution scheme as in wealthy nations https://t.co/BD3xLi2nHc",
  "data/tweet-economist/2022/7/1545971271967596545.json": "Rather than scrapping the old constitution, Chileans should scrap the new one. We explain why https://t.co/YmbMZR16V9",
  "data/tweet-economist/2022/7/1545831428998545409.json": "Thousands of Ukrainians have been abducted from Russian-occupied areas, including activists, journalists and humanitarian workers https://t.co/tjfFDp8evC",
  "data/tweet-economist/2022/7/1545726727233720320.json": "Germany and Poland have never been great friends. Vladimir Putin’s invasion of Ukraine could have been a turning-point https://t.co/FrlFX5T4Ci",
  "data/tweet-economist/2022/7/1546088096856510464.json": "Thousands of Ukrainians have been abducted from Russian-occupied areas. Some victims have been tortured; others have turned up dead https://t.co/TvKeatFAc5",
  "data/tweet-economist/2022/7/1546038085049253889.json": "Gotabaya Rajapaksa said nothing throughout the day. Yet the longer he stayed silent, the darker the mood became. At around 10pm local time, the president at last recognised that it was over https://t.co/izZWiuWltl",
  "data/tweet-economist/2022/7/1545881742682333184.json": "In a country with deep ethnic divisions, and a 26-year-long civil war to show for them, the government’s catastrophic ineptitude served to bring Sri Lankans of all stripes together https://t.co/FcD5nXkpYZ",
  "data/tweet-economist/2022/7/1546122131045601282.json": "Boris Johnson had not merely one tragic flaw, but many. Dishonesty, arrogance, sexual incontinence, incompetence, an infantile irresponsibility https://t.co/SXg15KF8wX",
  "data/tweet-economist/2022/7/1546100678359060480.json": "When Volodymyr Zelensky first took office, he and his novice crew faced Ukraine’s challenges with more memes in their armoury than policies. Then, this February, came a war of national survival https://t.co/TTl7IBA1aq",
  "data/tweet-economist/2022/7/1546126872756592643.json": "Today we are dealing with the highest inflation since the 1970s. These three books and two papers will help you understand why we are where we are https://t.co/DpZZaR5M2a",
  "data/tweet-economist/2022/7/1545948676031483907.json": "Research suggests that globally schoolchildren may be eight months behind where they would normally be https://t.co/80jG3thc8X",
  "data/tweet-economist/2022/7/1546014963738853383.json": "Boris Johnson leaves Britain in a dangerous state. The time when everything was possible is over. Once he departs, politics must once more become anchored to reality https://t.co/2mxB5OLkQp",
  "data/tweet-economist/2022/7/1546172140013117445.json": "Germany and Poland have never been great friends. Vladimir Putin’s invasion of Ukraine could have been a turning-point https://t.co/DrSj64Gv7A",
  "data/tweet-economist/2022/7/1545924743106334720.json": "Opposition parties across the country will be worried by the BJP’s ability to split Shiv Sena, a usually disciplined group https://t.co/yrCL1WnHi0",
  "data/tweet-economist/2022/7/1546234540804415494.json": "A new study finds that jabs cut the disease’s death toll by 63% during their first year https://t.co/JMxHm9UhCI",
  "data/tweet-economist/2022/7/1546296073894989826.json": "His assassination is a tragic coda to the life of one of the most consequential politicians of modern Japan https://t.co/tKG9ZUOBeb",
  "data/tweet-economist/2022/7/1546088095799468033.json": "TikTok is only the fifth app to pass 3.5bn downloads, and the only one not owned by Meta, according to Sensor Tower https://t.co/UPbhXTFTEj",
  "data/tweet-economist/2022/7/1546332288392339456.json": "Without vaccines, the Delta- and Omicron-variant waves would have been almost three times deadlier, research suggests https://t.co/I8pfjUeLZF",
  "data/tweet-economist/2022/7/1546192844809031681.json": "On both the economy and culture, Republicans claim to be the rightful party of the working class, whether white or Hispanic https://t.co/iysSEVpa4o",
  "data/tweet-economist/2022/7/1546357247877464065.json": "Thousands of Ukrainians are disappearing. This is not new: Russia has deployed such terror tactics for decades https://t.co/2ZTboV1Mxw",
  "data/tweet-economist/2022/7/1546291694127222785.json": "Abe Shinzo’s killing jolted a country unaccustomed to gun violence or, in recent years, to explosive politics. It also resurfaced unsettling memories of turbulent past eras https://t.co/p77ne8Fvco",
  "data/tweet-economist/2022/7/1546127121592057856.json": "In the wake of the assassination Kishida Fumio, Japan’s current prime minister, vowed to “protect our democracy” and “not succumb to violence” https://t.co/49t1vUgZdI",
  "data/tweet-economist/2022/7/1546376834161442819.json": "Ukraine’s comedian-turned-president was “visibly nervous” in his early bouts of diplomacy. Now he has an experience of statecraft that no modern Western leader can match, nor would wish to https://t.co/g7WLq3E7IR",
  "data/tweet-economist/2022/7/1546068804257693696.json": "Germany and Poland bear historical grudges. Fanning them, as the Polish government is doing, does not help build European alliances against Russia https://t.co/xj1NUjoln5",
  "data/tweet-economist/2022/7/1546507455223439361.json": "Boris Johnson had not merely one tragic flaw, but many. Dishonesty, arrogance, sexual incontinence, incompetence, an infantile irresponsibility https://t.co/HMDg27aYuz",
  "data/tweet-economist/2022/7/1546161092803661827.json": "War is a rupture—in a country’s life and a leader’s. Amid the calamity, Ukrainians have proven lucky in theirs https://t.co/UaoI0wPv60",
  "data/tweet-economist/2022/7/1546451415203209216.json": "For the citizens of Maharashtra, the immediate worry is that the BJP’s divisive politics, and the violence and disharmony that come with it, will disrupt life in the state https://t.co/fUSCXwI0l9",
  "data/tweet-economist/2022/7/1546366921590931456.json": "As details about the killer have trickled out, Abe Shinzo’s death has come to look more like a tragic but isolated murder than the opening shot of a political battle. Nonetheless, his death will reshape Japan’s political landscape https://t.co/IwSkUYSjym",
  "data/tweet-economist/2022/7/1546665766233292800.json": "As bad as the past 18 months have been, they would have been worse without vaccines—perhaps about 2.7 times worse https://t.co/UmyOeP28ny",
  "data/tweet-economist/2022/7/1546670644171083781.json": "New data suggest that the damage from shutting down schools has been worse than almost anyone expected https://t.co/Qf1WbcRcaa",
  "data/tweet-economist/2022/7/1546551517007724544.json": "The world’s most famous school has produced 20 British prime ministers – including Boris Johnson. From 1843 magazine’s archive \nhttps://t.co/hZFzKYA1yo",
  "data/tweet-economist/2022/7/1546787217967923200.json": "Motor-vehicle crashes were the leading cause of death for young people in America for more than 60 years. But since 2017, guns have killed more Americans between the ages of one and 24  \nhttps://t.co/YBAF6tbCJT",
  "data/tweet-economist/2022/7/1546752530952110080.json": "Astronomy will never be the same again https://t.co/6gdmwWO6J4",
  "data/tweet-economist/2022/7/1546816300701421568.json": "Appeasing Vladimir Putin would bring dangers for the world. If he gets to keep the land he has occupied, he and despots elsewhere will conclude that warmongering pays https://t.co/peDxMkj4Yd",
  "data/tweet-economist/2022/7/1547010699737669633.json": "Why do so many countries remain poor when some are fabulously rich? And what is work like today compared with the past? For the answers, you need to turn to economic history https://t.co/gV6O2xB8Ie",
  "data/tweet-economist/2022/7/1547079137998815237.json": "Journalists in free countries should help those in autocracies. Cross-border collaborations have exposed scandals such as Pegasus and the Panama Papers https://t.co/t763u9h0TT",
  "data/tweet-economist/2022/7/1547074350330875904.json": "Less than 0.1% of graphene is needed to make concrete 30% stronger. And stronger concrete means less of it is needed, consequently reducing CO2 https://t.co/n3mWJhkMLz",
  "data/tweet-economist/2022/7/1547020039995494402.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/kV3beNjD5E",
  "data/tweet-economist/2022/7/1547111461775867904.json": "The effectiveness of Russian propaganda might be underestimated https://t.co/5CNeQOtjsX",
  "data/tweet-economist/2022/7/1547005851961118720.json": "The study found that vaccines helped both rich and poor countries. Nearly as many deaths were prevented in countries covered by the COVAX distribution scheme as in wealthy nations https://t.co/HKhe855KA9",
  "data/tweet-economist/2022/7/1547221262312898564.json": "When covid-19 first began to spread around the world, pausing normal lessons was a forgivable precaution. \n\nNew data suggests the damage has been worse than expected",
  "data/tweet-economist/2022/7/1547239188277387264.json": "“Only candour and an unflinching commitment to growth will chart a course back to shared prosperity,” argues the Conservative leadership candidate @TomTugendhat in a guest essay for The Economist https://t.co/1hzhK2ACgS",
  "data/tweet-economist/2022/7/1547244759038791681.json": "Muhammad bin Salman is opening up one of the world’s most closed and intolerant countries. But discontent is bubbling below the surface https://t.co/4DXlo25c0f",
  "data/tweet-economist/2022/7/1547238059137187841.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/dNAXLMNjeE",
  "data/tweet-economist/2022/7/1547307898816036864.json": "Russia’s army, which relies heavily on trains to move munitions and human muscle to load them onto trucks, has created big depots close to railheads. That was fine until the High Mobility Artillery Rocket System turned up https://t.co/mSQtuYNrv6"
}