{
  "data/tweet-economist/2021/3/1366328349619064835.json": "There’s a concerted push to make “ecocide”—the destruction of the environment—punishable by the International Criminal Court, like genocide or war crimes. By me for @TheEconomist https://t.co/o9qCj791JX",
  "data/tweet-economist/2021/3/1369309067538276356.json": "My piece on the Pacific Deterrence Initiative, which could reach $4.7bn in 2021-22 &amp; $22.7bn in 2022-27. A quarter would go to upgrading facilities across Pacific islands and SE Asian countries—part of a strategy of dispersal beyond Japan, S. Korea &amp; Guam https://t.co/YWOlUqfoDz https://t.co/a4KI0SLXXJ",
  "data/tweet-economist/2021/3/1368935416548712448.json": "Women and especially mothers have been hit hard by the economic impact of the pandemic. On #InternationalWomensDay I've written about what some experts call a \"she-cession\", America’s first female recession in 50 years. My latest piece for @TheEconomist: https://t.co/5oTUCqWT9X",
  "data/tweet-economist/2021/3/1370291155489935361.json": "The generals wanted to wind the clock back a decade, says @thantmyintu. But by repressing the protests with such brutality, they have turned the clock back further than intended, to the era when Myanmar was a pariah state. Great piece by our Asia columnist https://t.co/713KlqNZLE",
  "data/tweet-economist/2021/3/1371784485553995779.json": "Over the past months we have built a statistical model that estimates the likelihood of dying or being hospitalized from covid-19 using age, sex and underlying medical conditions https://t.co/mJw74vLy3Y https://t.co/Fro5j2fP8T",
  "data/tweet-economist/2021/3/1375177524779573251.json": "I wrote about growing pressure on corporate sponsors and political leaders over the 2022 Olympics in Beijing. As you can imagine from the current H&amp;M/Nike blow-up over Xinjiang, the companies I contacted about their Olympic sponsorships were not responsive https://t.co/CtTJJqB6mG",
  "data/tweet-economist/2021/3/1377297748853198849.json": "This week I went to what we now have to call “the red wall”.\nIf you step out of the town centres that have often seen better days, what you find is loads of developments full of home owning families. \nhttps://t.co/7crEfhuGYt",
  "data/tweet-economist/2021/3/1377297655953555467.json": "This week I asked several experienced Western envoys to Beijing to explain China's recent, v assertive diplomacy. The most striking reply? \"China thinks the West is weak, venal and ill-disciplined, and must be brought to heel, like a dog.\" My Chaguan https://t.co/u4zWIo7f80"
}