{
  "data/tweet-nytimes/2021/5/1390954671930580993.json": "The killing of a 17-year-old bear called Arthur has set off a wave of anger in Romania. Two environmental groups accused Prince Emanuel von und zu Liechtenstein of killing the bear. https://t.co/vMfe0bYhno",
  "data/tweet-nytimes/2021/5/1390739485185519623.json": "The home of Phyllis Lyon and Del Martin, the first same-sex couple to legally marry in California, will become a historical landmark, the San Francisco Board of Supervisors ruled this week. The couple bought the home in the Noe Valley neighborhood in 1955. https://t.co/LSXePoCXE9",
  "data/tweet-nytimes/2021/5/1390694420706627586.json": "Breaking News: The WHO approved China’s Sinopharm Covid-19 vaccine for emergency use, easing the way for poorer nations to obtain shots. https://t.co/BHDYd2WRRI",
  "data/tweet-nytimes/2021/5/1391191203065044994.json": "A photographer in Berlin is capturing the lives of women who chose not to have children in a portrait series called “We are Childfree.” https://t.co/wCyBAdyxSj",
  "data/tweet-nytimes/2021/5/1391181184647024642.json": "A new study shows that MDMA, known as Ecstasy or Molly, can bring relief when paired with talk therapy to those with severe post-traumatic stress disorder. https://t.co/MfASAaEdur",
  "data/tweet-nytimes/2021/5/1391161007192555527.json": "Some say the loss of Scotland would be the biggest blow to a British prime minister since Lord North lost the colonies in America in the 18th century. Here's what's driving the call. https://t.co/d38siKQ5UK",
  "data/tweet-nytimes/2021/5/1391155984236695555.json": "Norwegian Cruise Line is threatening to keep its ships out of Florida ports after the state enacted legislation that prohibits businesses from requiring proof of vaccination against Covid-19 in exchange for services. https://t.co/WqI9gNdYWr",
  "data/tweet-nytimes/2021/5/1391142883353403400.json": "Bo, the Portuguese water dog who became the first presidential pet in the Obama White House, has died at 12. https://t.co/bySRhuJoNY",
  "data/tweet-nytimes/2021/5/1391125781292666881.json": "Jaleel White, best known for playing the popular character Steve Urkel in the 1990s sitcom “Family Matters,” is among those leading the charge to increase Black and Latino representation in the cannabis business. https://t.co/YwKKefaUMm",
  "data/tweet-nytimes/2021/5/1391115493851996164.json": "Since Ma’Khia Bryant, 16, was fatally shot by a police officer in Columbus, Ohio while holding a knife, her siblings have spoken out about her life in the foster care system, which ignored efforts by their grandmother to reunite the family. https://t.co/YV7zGTcxYY https://t.co/yfVxgoTJ7p",
  "data/tweet-nytimes/2021/5/1391098098412359683.json": "A piece of China’s largest rocket is tumbling back to Earth this weekend. No one really knows when or where it will land 😬https://t.co/5hlrvE96EJ",
  "data/tweet-nytimes/2021/5/1391040201758236679.json": "Silicon Valley has remained one of the most unequal regions in the U.S. -- and for many midlevel engineers, food truck workers and longtime residents, it has become increasingly inhospitable. https://t.co/ix8FXtluGG",
  "data/tweet-nytimes/2021/5/1391025107775025152.json": "A police officer in Huntsville, Ala., was convicted of murder on Friday for fatally shooting a man who had called 911 to report that he was suicidal, and who was holding a gun to his head. https://t.co/BA5VSOBCX6",
  "data/tweet-nytimes/2021/5/1391021675253321734.json": "The coronavirus vaccines are not killing more people than the virus itself. These false claims have been repeatedly debunked, but they remain in circulation as prominent public figures like Tucker Carlson, a host on Fox News, continue to promote them. https://t.co/VdAt6VeXkU https://t.co/aRQ1NFJCsm",
  "data/tweet-nytimes/2021/5/1391017574201274369.json": "Breaking News: The NCAA president, under pressure to reshape college sports, told The Times he would push to let athletes cash in on their fame this year. https://t.co/adAEOkgqaK",
  "data/tweet-nytimes/2021/5/1391004402148954116.json": "A cyberattack forced the shutdown of a key U.S. pipeline said to carry almost half of the East Coast’s gasoline and jet fuel supply. https://t.co/bajo3vsQ0j",
  "data/tweet-nytimes/2021/5/1390871601806204935.json": "A police officer in Huntsville, Alabama, was convicted of murder on Friday for fatally shooting a man who had called 911 to report that he was suicidal and who was holding a gun to his head when the police arrived, prosecutors said. https://t.co/RsPVhY91X9",
  "data/tweet-nytimes/2021/5/1390833848565567489.json": "The Ohio Republican Party censured Representative Anthony Gonzalez on Friday and called for his resignation for voting to impeach Donald Trump in January. https://t.co/egRNfT4aGJ",
  "data/tweet-nytimes/2021/5/1390786035299274754.json": "No, vaccines are not killing more people than the coronavirus itself. The Fox News host Tucker Carlson recently repeated a false claim that Covid-19 vaccines have caused thousands of deaths. https://t.co/Makdcokdfx",
  "data/tweet-nytimes/2021/5/1390781507195883527.json": "The coronavirus is changing too quickly, new variants are spreading too easily and vaccination is proceeding too slowly for the U.S. to reach herd immunity anytime soon, scientists and public health experts have concluded. https://t.co/8CMi5XB0wa https://t.co/CfM0WFPh78",
  "data/tweet-nytimes/2021/5/1390765915621441541.json": "The coronavirus spreads through airborne transmission, particularly indoors, and even beyond six feet, the CDC emphasized on Friday. The new guidance is a change from the agency’s previous position that most infections were through “close contact.” https://t.co/d5WRvlZwEo https://t.co/9N1dt6hFH3",
  "data/tweet-nytimes/2021/5/1390750809005203462.json": "The coronavirus spreads through airborne transmission, particularly indoors, and even beyond six feet, the CDC emphasized on Friday. The new guidance is a change from the agency’s previous position that most infections were through “close contact.” https://t.co/Iq3BuxKcGE",
  "data/tweet-nytimes/2021/5/1390743246599557136.json": "4 years after an execution, a different man’s DNA is found on the murder weapon\nhttps://t.co/GKsOWDc48z",
  "data/tweet-nytimes/2021/5/1390715579036835842.json": "Are animated dads getting hotter? https://t.co/MTGyWtUfd9",
  "data/tweet-nytimes/2021/5/1390700464358973446.json": "“They’re humble-hot, often rumpled and lived-in, like you searched for a nice-looking ex on Facebook and found that he’s got a wife, kids and that certain something-something.” Our culture reporter @kylebuchanan on hot cartoon dads. https://t.co/6FBJuXhLVb",
  "data/tweet-nytimes/2021/5/1390670265324027910.json": "Vanessa Nakate, a climate activist from Uganda, was cut out of a news photo featuring her and four white campaigners.\n\nShe denounced her omission as a sign of the erasure of Black voices in environmental activism. Her message reverberated across the world.\nhttps://t.co/ELaUfwawFo https://t.co/tdOJYKA8zf",
  "data/tweet-nytimes/2021/5/1390663982462251013.json": "Ledell Lee was executed by lethal injection in Arkansas in 2017. Four years later, new DNA testing revealed that genetic material on the murder weapon — which was never previously tested — in fact belongs to another man, lawyers said.\nhttps://t.co/Dz4UAHB1LT",
  "data/tweet-nytimes/2021/5/1390656433801338882.json": "A morning shower can help you wake up. But showering at night can help sleep arrive faster. What to do? https://t.co/66rkukpJyE",
  "data/tweet-nytimes/2021/5/1390626238818099200.json": "A 10-story, 23-ton piece of a Chinese rocket will crash into Earth sometime over the weekend — but no one knows where. https://t.co/PCp6dl7D0k",
  "data/tweet-nytimes/2021/5/1390596026659180546.json": "Newly declassified information reveals why the CIA concluded that Russia had most likely offered bounties for attacks on U.S. and allied troops in Afghanistan.\nhttps://t.co/u6BMdt0Q2M",
  "data/tweet-nytimes/2021/5/1391239014376693760.json": "Breaking News: Debris from a large Chinese rocket, the Long March 5B, landed in the Indian Ocean near the Maldives, China’s space administration said. https://t.co/yLDyZX2RKP",
  "data/tweet-nytimes/2021/5/1391395056402173957.json": "Breaking News: Kentucky Derby winner Medina Spirit failed a post-race drug test, once more putting the practices of his Hall of Fame trainer Bob Baffert under uncomfortable scrutiny. https://t.co/YRBVDnVR2X",
  "data/tweet-nytimes/2021/5/1391427766655102986.json": "Two brothers, 8 and 5, were removed from their Oklahoma elementary school classrooms this past week and made to wait out the school day in a front office for wearing T-shirts that read “Black Lives Matter,” according to the boys’ mother. https://t.co/vrdjEdg8yC",
  "data/tweet-nytimes/2021/5/1391498254781661184.json": "The writer and poet Maya Angelou and the astronaut Sally Ride will be the first to appear on a series of quarters celebrating the accomplishments and contributions of prominent American women. https://t.co/9Kye3eDdg4",
  "data/tweet-nytimes/2021/5/1391473056812503040.json": "Ana Paredes paced back and forth in anxious anticipation at baggage claim, eyes fixed on the escalator. When the little girl emerged, she rushed forward to clutch and caress her — Melissa, the daughter she had not seen for seven years. https://t.co/evPjqmUDc6 https://t.co/g78Oosybo9",
  "data/tweet-nytimes/2021/5/1391533461018660869.json": "Our pets are a part of the everyday fabric of our lives in a way that few human relationships are. When you lose one that is close to you, something inside shifts. https://t.co/lNB837nFoy",
  "data/tweet-nytimes/2021/5/1391568680958504960.json": "To calm Mexico City’s elderly, who were arriving “really scared” at vaccination sites, officials cued up the bands and masked wrestlers.\nhttps://t.co/IdTncjnVFO",
  "data/tweet-nytimes/2021/5/1391558627538919424.json": "After decades of demonization and criminalization, psychedelic drugs are on the cusp of entering mainstream psychiatry, with profound implications for a field that has seen few new advancements for the treatment of mental disorders and addiction. https://t.co/NZG8FGp1Pg",
  "data/tweet-nytimes/2021/5/1391707105724444672.json": "A man in California bought a Lamborghini, a Ferrari and a Bentley after he received more than $5 million in Payment Protection Program loans, prosecutors said. He was arrested on charges including bank fraud and money laundering.\nhttps://t.co/IPf8KRzIRA",
  "data/tweet-nytimes/2021/5/1391732523525451778.json": "“Some people hesitate to get the second shot because they’ve heard the side effects can be nasty,” our health columnist Jane Brody writes. “Side effects are short-lived and not nearly as severe or persistent as the disease the vaccine protects against.”\nhttps://t.co/BZlpL3RNmq",
  "data/tweet-nytimes/2021/5/1391686965163089922.json": "The Chinese government, tightening its grip on Muslim ethnic minorities, is forcing women in Xinjiang to have fewer babies — just as women across China are being urged to have more.\n\n“The government wants to replace our people,” one woman said. https://t.co/jgW7TZzFvQ",
  "data/tweet-nytimes/2021/5/1391766111713177609.json": "Breaking News: Health care providers cannot discriminate against transgender people, the Biden administration announced, its latest reversal of a Trump-era policy. https://t.co/G5FxevywQC",
  "data/tweet-nytimes/2021/5/1391775273750777857.json": "Chipotle, looking to attract workers, said on Monday it was increasing its wages to an average of $15 an hour by the end of June. https://t.co/ngCfcNUsqI",
  "data/tweet-nytimes/2021/5/1391679483732766729.json": "The son of Italy’s last king has tapped his 17-year-old granddaughter, a burgeoning Instagram influencer, to eventually lead the House of Savoy, pretenders to Italy’s defunct throne. “Totally illegitimate,” says a rival clan. https://t.co/88o2s6rnf6",
  "data/tweet-nytimes/2021/5/1391860631024848896.json": "More than 100 Roman Catholic parishes in Germany offered blessings to gay couples on Monday in defiance of church teaching and their own bishops. https://t.co/Y5WbWz5Mat",
  "data/tweet-nytimes/2021/5/1391762680264937477.json": "Hugging and kissing in England could be government-approved starting next Monday, after a year of nodding, waving and bumping fists and elbows. https://t.co/Dj6zlYZ6vA",
  "data/tweet-nytimes/2021/5/1391865581721300992.json": "Breaking News: The FDA has authorized the use of the Pfizer vaccine for 12- to 15-year-olds, an important step toward ending the pandemic in the U.S.\nhttps://t.co/4NJQIT7TKB",
  "data/tweet-nytimes/2021/5/1391835449778450435.json": "Health care providers cannot discriminate against transgender people, the Biden administration announced, reversing a policy adopted by Donald Trump. https://t.co/F3m595k5ZC https://t.co/hf4DL6YCW9",
  "data/tweet-nytimes/2021/5/1391848029435617282.json": "The Rev. Megan Rohrer, a pastor in California, will become the first openly trans bishop in a major American Christian denomination after they were elected on Saturday to lead a synod in the Evangelical Lutheran Church in America. https://t.co/KmUtJjTENA",
  "data/tweet-nytimes/2021/5/1391493193376673801.json": "Dr. Anthony Fauci said he was open to relaxing indoor masking rules as more Americans get vaccinated against the virus, just two days after the Centers for Disease Control and Prevention belatedly emphasized the danger of airborne transmission. https://t.co/Kko5vaAVS9",
  "data/tweet-nytimes/2021/5/1391890805623828482.json": "The B.1.617 variant, which has been growing more common in India, is now officially a \"variant of concern,\" the World Health Organization said. https://t.co/VjlZTlw4TK",
  "data/tweet-nytimes/2021/5/1391788220589936640.json": "Breaking News: Gaza militants fired rockets and the Israeli police fought with Palestinian protesters in Jerusalem, in a sudden crescendo of violence that put Israel on edge. https://t.co/XJcETHZdOd",
  "data/tweet-nytimes/2021/5/1391831669980684291.json": "New York will set up temporary walk-in vaccination sites at eight subway and train stations this week, Governor Andrew Cuomo said. People who get their shots at the stations can get free MetroCards or tickets for the Long Island Rail Road or Metro-North. https://t.co/WKL9Qq4WDB",
  "data/tweet-nytimes/2021/5/1392030234174758912.json": "The Chinese government, tightening its grip on Muslim ethnic minorities, is forcing women in Xinjiang to have fewer babies — just as most other women across China are being urged to have more.\n\n“The government wants to replace our people,” one woman said. https://t.co/Em0izSz02u",
  "data/tweet-nytimes/2021/5/1392068229976272897.json": "Poor people in India are disposing of bodies in rivers because the cost of cremations has shot up during the country’s Covid-19 crisis, medical workers say.\n\nDozens of corpses were found on the banks of the Ganges River on Monday.\nhttps://t.co/ZsByItuKWt",
  "data/tweet-nytimes/2021/5/1392114727820668936.json": "Israeli airstrikes hit Gaza, killing at least 26 over two days as fighting escalates. Hamas launched a barrage of rockets at southern Israel, killing two Israelis.\nhttps://t.co/LwmACMLzWo",
  "data/tweet-nytimes/2021/5/1391930828599529475.json": "The gunman who killed six people at a birthday party in Colorado Springs on Sunday was the boyfriend of a victim, the police said. More than half of mass shootings in the U.S. involve a perpetrator who killed an intimate partner or family member. https://t.co/phPNEieHHU",
  "data/tweet-nytimes/2021/5/1391951219820830722.json": "President Biden said on Monday that the U.S. would “disrupt and prosecute” DarkSide, a gang of hackers believed to have roots in Eastern Europe, for its role in a ransomware attack that has disrupted the flow a major U.S. pipeline. https://t.co/qyrJvDuwT9",
  "data/tweet-nytimes/2021/5/1392197570085232649.json": "Breaking News: A Georgia prosecutor said that the Atlanta-area spa shootings were hate crimes, and that she would pursue the death penalty against the suspect, saying he targeted some victims because they were of Asian descent. https://t.co/bNwIo1mRmp",
  "data/tweet-nytimes/2021/5/1392214060175970307.json": "Breaking News: A federal judge dismissed the NRA’s bankruptcy case, filed this year in an attempt to avoid a legal challenge from New York’s attorney general, who is seeking to shut down the group amid a corruption investigation. https://t.co/UbTzVmpSK4",
  "data/tweet-nytimes/2021/5/1392232030918828034.json": "The Justice Department saw no evidence to undercut President Biden’s election win, according to prepared remarks to the House Oversight Committee from Jeffrey Rosen, who served as the acting attorney general for the final month of the Trump administration. https://t.co/0aTrqXWS7q",
  "data/tweet-nytimes/2021/5/1392217970282225666.json": "Uber and Lyft will provide free rides to vaccination sites from May 24 to July 4, President Biden said. The announcement marked a new phase of the administration’s efforts to combat vaccine hesitancy and help reach Biden’s vaccine goal. https://t.co/IX2E85ZiwF",
  "data/tweet-nytimes/2021/5/1392205379614937092.json": "The Biden administration on Tuesday announced its final approval of the nation’s first commercial-scale offshore wind farm. The Vineyard Wind project, off the coast of Massachusetts, would generate enough electricity to power 400,000 homes. https://t.co/Clou79lAka",
  "data/tweet-nytimes/2021/5/1392278354368376837.json": "Rep. Liz Cheney on Tuesday delivered a defiant speech hours before facing a vote to oust her from House Republican leadership for her repudiation of Donald Trump’s election lies. “Remaining silent and ignoring the lie emboldens the liar,” she said. https://t.co/RsQB1ox6Rc",
  "data/tweet-nytimes/2021/5/1392263277510541312.json": "More than 100 Republicans, including some former elected officials, are preparing to release a letter this week threatening to form a third party if the Republican Party does not make certain changes, according to an organizer of the effort. https://t.co/K6ANeMEO7Z",
  "data/tweet-nytimes/2021/5/1392253203216060420.json": "What’s the median price of a home in Brooklyn? Two New York City mayoral candidates guessed about $100,000. The outcry was swift. https://t.co/YnhInmFU33",
  "data/tweet-nytimes/2021/5/1392248175705174016.json": "Three New York Police Department officers, one of them retired, were charged with running a yearslong bribery scheme. The officers funneled work to a tow truck company for kickbacks and sold car crash victims’ personal information, prosecutors say. https://t.co/5M7v3qTkZ8",
  "data/tweet-nytimes/2021/5/1392049382040682499.json": "A tiger wandering in Houston set off a hunt on Sunday for a man who drove off with the animal, and who officials said had been charged with murder and released on bond.\n\nHe has been taken into custody, but the tiger’s whereabouts are still unknown.\nhttps://t.co/vj4Lvu2itE",
  "data/tweet-nytimes/2021/5/1392290978942357508.json": "Michael Bloomberg is donating a total of $150 million to Johns Hopkins University and six other institutions of higher learning to increase racial diversity among students seeking PhDs in science, technology, engineering and math. https://t.co/QFNVTlgGaq",
  "data/tweet-nytimes/2021/5/1392155098760060929.json": "The Israeli military has designated a code name for its operations in Gaza: Guardians of the Walls, a reference to the ancient ramparts of the Old City of Jerusalem. The Palestinian militant group Hamas has its own code name: Sword of Jerusalem. https://t.co/AIjCCJCmEr",
  "data/tweet-nytimes/2021/5/1392365928512376836.json": "142 years ago, seeds were buried in bottles on the Michigan State University campus.\n\nLast month, they sprouted for the very first time. 🌱 https://t.co/EtHpq69XPq",
  "data/tweet-nytimes/2021/5/1392358411963146240.json": "“I will not sit back and watch in silence while others lead our party down a path that abandons the rule of law,” Representative Liz Cheney said hours before facing a vote that will almost certainly purge her from House Republican leadership. https://t.co/iJnesHMrxJ",
  "data/tweet-nytimes/2021/5/1392477178219188225.json": "Colombia’s police fought rebel groups for years. Now, they’re accused of using battlefield tactics against protesters.\n\nAs anger over tax reforms has grown, officers have beaten and killed demonstrators, according to witnesses and victims’ family members.\nhttps://t.co/VJ9R5bGH9G https://t.co/Pw4zgCw1pM",
  "data/tweet-nytimes/2021/5/1392472746383323140.json": "Breaking News: House Republicans voted to oust Rep. Liz Cheney from their leadership ranks for her refusal to stay quiet over Donald Trump’s election lies.\nhttps://t.co/qznOPwCvNF",
  "data/tweet-nytimes/2021/5/1392460836833271811.json": "Park Na-rae, a comedian, was accused of sexual harassment by men in South Korea after she made a suggestive joke involving a male doll.\n\nHer supporters say the claims, which are being investigated by the police, illustrate a double standard for women.\nhttps://t.co/S1WyKrbwtG",
  "data/tweet-nytimes/2021/5/1392497678030942213.json": "Ellen DeGeneres will end her daytime talk show next year, according to her spokeswoman. https://t.co/U01kIMjhiP",
  "data/tweet-nytimes/2021/5/1392519954193334278.json": "Millions of low-income Americans are now eligible for a $50 discount on high-speed internet and a one-time $100 subsidy for a laptop or tablet as part of an emergency FCC program. https://t.co/4BcqRp9mLp",
  "data/tweet-nytimes/2021/5/1392596014507479046.json": "Breaking News: The Colonial Pipeline began resuming operations, its operator said. The fuel line had been shut down since Friday after a ransomware attack. https://t.co/fhNRAo5Qto",
  "data/tweet-nytimes/2021/5/1392629444808949763.json": "Gov. Mike DeWine of Ohio announced that the state would give five people $1 million each in return for having been vaccinated as part of a weekly lottery program. https://t.co/86FkotiMEi",
  "data/tweet-nytimes/2021/5/1392623158642028547.json": "Dozens of civilians are dead in airstrikes and rocket barrages in the worst violence between Israelis and Palestinians in years, and violent protests have erupted in mixed Jewish-Arab areas. Updates on the crisis: https://t.co/HfPvrqh012 https://t.co/VHcLRjZdEa",
  "data/tweet-nytimes/2021/5/1392585427111104515.json": "Representative Liz Cheney was booed by colleagues on Wednesday when she told Republicans that following Donald Trump would lead to their “destruction.” https://t.co/AppEK5f2gj",
  "data/tweet-nytimes/2021/5/1392575334600609792.json": "Millions of low-income Americans became eligible on Wednesday for an emergency discount on high-speed internet service and devices to get online. https://t.co/1tPlFrMP2C https://t.co/jaK6pqELX1",
  "data/tweet-nytimes/2021/5/1392678496674140167.json": "Her colleagues may have stripped Rep. Liz Cheney of her post as chair of the House Republican Conference, but they have effectively handed her a new platform and a new role as the leader of the small band of anti-Trump Republicans, @jmartNYT writes. https://t.co/J7yRJVAjNO",
  "data/tweet-nytimes/2021/5/1392660925723910147.json": "Dr. Patrick Soon-Shiong, the billionaire who owns The Los Angeles Times, announced that his corporation and his philanthropic foundation would commit about $210 million to transfer vaccine and therapy technology to South Africa, where he was born. https://t.co/KoHptZHK4y",
  "data/tweet-nytimes/2021/5/1392655863635222529.json": "Three months after Tesla said it would begin accepting the cryptocurrency Bitcoin as payment, the electric carmaker has abruptly reversed course. https://t.co/UbZjqzbc6O",
  "data/tweet-nytimes/2021/5/1392550400084021249.json": "Exercise can promote a sense of purpose in life and help you flourish, according to a new study on the reciprocal effects of feeling your life has meaning and being often in motion. https://t.co/gpmQQiUUv1",
  "data/tweet-nytimes/2021/5/1392789876240699392.json": "President Biden said that he spoke with Prime Minister Benjamin Netanyahu of Israel about the escalating fighting between Israelis and Palestinians, and he asserted his “unwavering support” for Israel’s “right to defend itself.” https://t.co/yfdQ7VVdvf",
  "data/tweet-nytimes/2021/5/1392514913474686978.json": "Epidemiologists are starting to hug again. They’re also running errands, gathering outdoors with friends and getting haircuts. \n\nHere's how 723 epidemiologists in the U.S. say they are navigating this in-between phase of the pandemic. https://t.co/pSuKyj4feh",
  "data/tweet-nytimes/2021/5/1392902944903868423.json": "Breaking News: Fully vaccinated Americans no longer need to wear masks or maintain social distance indoors or outdoors, with some exceptions, the CDC said. https://t.co/780TF4uaW0",
  "data/tweet-nytimes/2021/5/1392913806574161925.json": "“The science is clear: If you are fully vaccinated, you are protected, and you can start doing the things that you stopped doing because of the pandemic,” the CDC said in a statement on Thursday. https://t.co/jSDPwdK8t7 https://t.co/MQZbEV4Yxe",
  "data/tweet-nytimes/2021/5/1392925904637022209.json": "Exclusive: A network of conservative activists, aided by a British former spy, mounted a campaign during the Trump administration to discredit perceived enemies of Donald Trump in government, according to documents and people involved in the operations. https://t.co/jntYHAflww",
  "data/tweet-nytimes/2021/5/1392962777686421504.json": "Breaking News: Israel sent its military into Gaza, a major escalation. It was not immediately clear if it was a limited bid to destroy rocket bases or kill leaders of Hamas, the militant group that controls Gaza. https://t.co/4V48H3uDaY",
  "data/tweet-nytimes/2021/5/1392969327733784580.json": "Breaking News: Israel sent its military into Gaza, a major escalation. It was not immediately clear if it was a limited bid to destroy rocket bases or kill leaders of Hamas. https://t.co/VJ77S0N0FV https://t.co/NR05vHktyW",
  "data/tweet-nytimes/2021/5/1392996875150766101.json": "State prosecutors in Manhattan investigating Donald Trump and his family business are examining the extent to which Trump handed out valuable benefits to some of his executives and whether taxes were paid on those perks. https://t.co/WawUusSTyz",
  "data/tweet-nytimes/2021/5/1392819805254729738.json": "Breaking News: Randi Weingarten, president of America’s second-largest teachers’ union, plans to call for a full reopening of schools for the next academic year.\nhttps://t.co/0YWilRGrej",
  "data/tweet-nytimes/2021/5/1393030831392894980.json": "Delta Air Lines will require new hires to be vaccinated against the coronavirus, but will exempt current employees from that mandate, making it one of the first major corporations to embrace such a requirement.\nhttps://t.co/IfDcaeVvrK",
  "data/tweet-nytimes/2021/5/1393008204049694721.json": "Americans are now considering a behavior scarcely seen in the U.S. but long a fixture in other cultures: routinely wearing a mask when displaying symptoms of a cold or the flu, even in a future in which Covid-19 isn’t a primary concern. https://t.co/amYSOPgJWG",
  "data/tweet-nytimes/2021/5/1393078643124019201.json": "Scientists found a rare isotope of plutonium in a piece of crust from the Pacific Ocean floor nearly a mile down. They say it was made in colliding stars and rained down as cosmic dust millions of years ago. Their analysis opens a new window on the cosmos. https://t.co/omoSktUG1z https://t.co/QsoIizTMTx",
  "data/tweet-nytimes/2021/5/1392988053124354051.json": "President Biden issued remarks on Thursday following new guidance from the CDC, which said that fully vaccinated Americans no longer need to wear a mask in most indoor and outdoor settings. https://t.co/IlnSKBlBBG https://t.co/0eomKJqVUL",
  "data/tweet-nytimes/2021/5/1392894952242352131.json": "The Pfizer-BioNTech and Moderna coronavirus vaccines are safe and effective during pregnancy, according to a growing body of scientific evidence. The shots may also benefit infants and do not seem to damage the placenta, the latest research shows. https://t.co/hRP7rmOvde",
  "data/tweet-nytimes/2021/5/1393174305480056839.json": "It was meant to be a routine inspection. But when an engineer climbed out onto the Interstate 40 bridge over the Mississippi River, what he saw led to an urgent call to 911: “We need to get people off the bridge immediately!” https://t.co/Ll3ddyTynj https://t.co/KQrqHzN5xx",
  "data/tweet-nytimes/2021/5/1393176788138921984.json": "An early look into how President Biden operates reveals a leader with a short fuse who is obsessed with getting the details right, sometimes to a fault, according to interviews with more than two dozen of his associates. https://t.co/vZYPdaW14m",
  "data/tweet-nytimes/2021/5/1393215816364089348.json": "Prince Harry spoke candidly about his life in the British royal family in a new podcast interview, comparing it to “a mix between ‘The Truman Show’ and being in a zoo.”\n\n“I don’t want to be part of this,” he said of the monarchy. https://t.co/8UmJak4T7y",
  "data/tweet-nytimes/2021/5/1393288596392660994.json": "In Opinion\n\n\"Israel has the absolute right to live in peace and security, but so do the Palestinians,\" Sen. Bernie Sanders writes in a guest essay. \"We must recognize that Palestinian rights matter. Palestinian lives matter.\" https://t.co/YYfuPDh8uC",
  "data/tweet-nytimes/2021/5/1393196916566118408.json": "Glauber Contessoto, a 33-year-old in Los Angeles, used his life savings and borrowed money to invest about $250,000 in Dogecoin, a cryptocurrency started as a joke, in February.\n\nThe value now? Roughly $2 million. https://t.co/82tqLXbmt5",
  "data/tweet-nytimes/2021/5/1393325292983361536.json": "The Pfizer-BioNTech and Moderna vaccines are 94% effective at preventing symptomatic Covid illness, according to a new study released by the CDC on Friday. It provides more evidence that the vaccines are working well even outside controlled clinical trials.https://t.co/hcFlLAUygV",
  "data/tweet-nytimes/2021/5/1393179317505597440.json": "Misinformation about the violence between Israelis and Palestinians has run rampant on social media, a New York Times analysis found.\n\nThe effect of the lies could prove deadly, experts say.\nhttps://t.co/hT8pTmfXZI",
  "data/tweet-nytimes/2021/5/1393239710764617732.json": "Alexandria Ocasio-Cortez has in many ways become the face of progressivism in the U.S.\n\nBut there's another, hidden-in-plain-sight legacy of her 2018 election: a campaign logo that has reshaped the left's visual branding, across the U.S. and overseas. https://t.co/mBos4xIytX https://t.co/HbXr5C01jF",
  "data/tweet-nytimes/2021/5/1393368704021405700.json": "Breaking News: China successfully set its Zhurong rover down on Mars. Until now, only NASA spacecraft have explored the surface of the red planet. https://t.co/de0tj01q13",
  "data/tweet-nytimes/2021/5/1393383151263682561.json": "Gov. Kevin Stitt of Oklahoma was ousted from a commission set up to commemorate the centennial of the 1921 Tulsa race massacre, just days after he signed legislation that banned the teaching of certain concepts about race. https://t.co/YayEhkQB4q",
  "data/tweet-nytimes/2021/5/1393468726515847171.json": "Miss Universe Myanmar, Ma Thuzar Wint Lwin, is in Florida for the global pageant this week. After using her platform to protest the military coup in her country, she says she can't return home and doesn't know where she'll go after the competition ends. https://t.co/KqKlZv5dcw",
  "data/tweet-nytimes/2021/5/1393453647560908801.json": "Prince Harry spoke candidly about his life in the British royal family in a new podcast interview, comparing it to “a mix between ‘The Truman Show’ and being in a zoo.”\n\n“I don’t want to be part of this,” he said of the monarchy. https://t.co/MvMTq6wNml",
  "data/tweet-nytimes/2021/5/1393183078755995650.json": "Fully vaccinated Americans no longer need to wear masks or maintain social distance indoors or outdoors, with some exceptions, the CDC said Thursday. https://t.co/5cFnjPjviK",
  "data/tweet-nytimes/2021/5/1393555591507976193.json": "Breaking News: Israel destroyed a high-rise tower in Gaza City that housed media outlets including the Associated Press and Al Jazeera. Here’s the latest. https://t.co/NS8TTFKkQb",
  "data/tweet-nytimes/2021/5/1393546714854854658.json": "NYT Investigation: They died in police custody — at least 47 Black people in the past 25 years; 15 since 2015.\n\nWhen blame was put on sickle cell trait, a condition mostly found in Black people that is almost always benign, it often ended further scrutiny.\nhttps://t.co/2Bwg3lbByn",
  "data/tweet-nytimes/2021/5/1393576921246601218.json": "NYC Pride announced steps to take the NYPD out of Pride, including banning police from marching in a group. https://t.co/S0XnqzFzby",
  "data/tweet-nytimes/2021/5/1393572108769300485.json": "More than 70 percent of Americans 65 or older are fully vaccinated against the coronavirus. https://t.co/r8hDN2TLXx",
  "data/tweet-nytimes/2021/5/1393287513830301703.json": "Scientists warned that coronavirus variants might lead to a crushing fourth wave in the U.S. But masks, distancing and other precautions — and luck — helped buy time for tens of millions of Americans to get vaccinated. https://t.co/SUrFPZOwyV",
  "data/tweet-nytimes/2021/5/1393631864984899586.json": "Breaking News: These retailers are lifting mask requirements for the fully vaccinated, moving to an honor system in which they trust that only those who qualify will bare their faces:  \n\n→ Costco\n→ Publix\n→ Starbucks\n→ Trader Joe's \n→ Walmart\n\nhttps://t.co/yYDFojehxI",
  "data/tweet-nytimes/2021/5/1393597150597156868.json": "A rift among Democrats is growing as the left defends the Palestinians in their conflict with Israel, with some seeing it as a racial justice issue. https://t.co/vfSsqJLFSt",
  "data/tweet-nytimes/2021/5/1393685135694999553.json": "Damon Weaver who, at 11 years old, gained national attention when he scored an interview with President Barack Obama, making him one of the youngest people to interview a sitting president has died at 23. https://t.co/vSDVs5Cpo0",
  "data/tweet-nytimes/2021/5/1393657497387507718.json": "A U.S. government program intended to protect wild horses is instead subsidizing their path to destruction. https://t.co/JEq21g7EK5 https://t.co/KehC1PVxCQ",
  "data/tweet-nytimes/2021/5/1393672969516421124.json": "How did things explode between Israel and Palestine after years of quiet? Here's what we know: https://t.co/LWUfgnBcwS",
  "data/tweet-nytimes/2021/5/1393165462410760196.json": "Philadelphia’s health commissioner resigned after acknowledging that he had authorized the cremation and disposal of human remains from the 1985 bombing of the MOVE house without notifying family members. \nhttps://t.co/NwiOx8S8Mg",
  "data/tweet-nytimes/2021/5/1393677584970534917.json": "The pandemic left New York City with a lot of empty buildings, much of it office space owned by companies whose workers may not return. Pessimists say it is a harbinger of the city’s demise. Optimists see it as a blank slate for better things ahead. https://t.co/nuv2Flw69L",
  "data/tweet-nytimes/2021/5/1393919183038164993.json": "The U.S.'s largest union of registered nurses condemned the CDC on Saturday for lifting mask recommendations for vaccinated people and called on the agency to “do the right thing” and revise its guidance. https://t.co/6PUvA6yUKD",
  "data/tweet-nytimes/2021/5/1393758108472811526.json": "A reader asks The Ethicist: \n\nMy adult daughter started falling for a man until he asked her to marry him so he could get his green card. When she said no, he ghosted her. Should I report him to immigration? https://t.co/eOdahpHBrG",
  "data/tweet-nytimes/2021/5/1393617192172855296.json": "An American envoy landed in Israel for cease-fire talks with Palestinians and Israelis. But as of Saturday evening, fighting continued, and a media center in Gaza was destroyed. https://t.co/rl4J0vOpXl",
  "data/tweet-nytimes/2021/5/1393924220812419077.json": "The CDC has clarified coronavirus advice for U.S. schools, recommending the continued, universal use of masks and physical distancing. https://t.co/GRDq79EF2a",
  "data/tweet-nytimes/2021/5/1393592018186670086.json": "With Covid-19 cases decreasing in the U.S., and masks no longer required everywhere, a sense of normalcy is starting to return. The New York Times asked 723 epidemiologists what it will really take for us to get there, and how long. https://t.co/GJX4M6c3U8",
  "data/tweet-nytimes/2021/5/1393949391292145670.json": "Pro-Palestinian demonstrations were held in cities around the world as the conflict between Israel and Hamas stretched into its seventh day. https://t.co/w1SO3G42FV",
  "data/tweet-nytimes/2021/5/1393934292766674947.json": "A tiger cub named India that was last seen wandering around Houston last weekend has been found.  https://t.co/zmAVFLLzoj",
  "data/tweet-nytimes/2021/5/1393951890971496449.json": "Local health officials said an Israeli airstrike in Gaza overnight killed more than two dozen people, including women and children. International pressure to bring an end to the conflict is mounting. https://t.co/CAc8r4HrTB",
  "data/tweet-nytimes/2021/5/1393939317555441664.json": "“He and Gigi deserve to be here to witness this.\" \n\nVanessa Bryant, the wife of the late Kobe Bryant, accepted a posthumous induction into the Basketball Hall of Fame on his behalf. https://t.co/ijBPJqVkvw",
  "data/tweet-nytimes/2021/5/1394015112567181312.json": "Melinda French Gates was said to be aware of Bill Gates’ wandering eye. However, two things shook their marriage in recent years: his response to a sexual harassment claim against one of his employees and his relationship with Jeffrey Epstein. https://t.co/ZLyow3MNef",
  "data/tweet-nytimes/2021/5/1393969508226899973.json": "\"We haven’t seen this anywhere else in the world.”\n\nExperts say Covid-19 doesn't usually cause serious symptoms in children. So why are so many dying in Brazil? https://t.co/elYUzrbL4L",
  "data/tweet-nytimes/2021/5/1394003415429259270.json": "The head of the CDC, facing blowback over the agency’s new liberalized mask guidelines, offered a stark reassurance on Sunday: Only unvaccinated people are at risk if they take off their masks. https://t.co/9fJ91bUjPj",
  "data/tweet-nytimes/2021/5/1393863818359549954.json": "We’ve published *a lot* of chocolate chip cookie recipes, but these are the ones our readers return to again and again 🍪 https://t.co/qsi2nhla6F",
  "data/tweet-nytimes/2021/5/1394090316454666241.json": "The CDC has clarified coronavirus advice for U.S. schools, recommending the continued, universal use of masks and physical distancing. https://t.co/DX6x2tNsgO",
  "data/tweet-nytimes/2021/5/1394039972672462849.json": "What makes some people more resilient than others? The very earliest days of our lives, and our closest relationships, can offer clues about how we cope with adversity. https://t.co/30PbRIA13T",
  "data/tweet-nytimes/2021/5/1394024875069739012.json": "Civilians are paying an especially high price in the latest bout of violence between Israel and Hamas in the Gaza Strip, raising urgent questions about how the laws of war apply to the conflict. https://t.co/wlNiV9FsH2",
  "data/tweet-nytimes/2021/5/1394242569320734721.json": "Melinda French Gates was said to be aware of Bill Gates’s wandering eye. But two things shook their marriage in recent years: his response to a sexual harassment claim against one of his employees and his relationship with Jeffrey Epstein. https://t.co/ZrVPjmLzZw",
  "data/tweet-nytimes/2021/5/1394249849021870084.json": "Members of the Class of 1970 at what is now Jackson State University in Mississippi finally wore their caps and gowns on Saturday. Their first graduation was canceled after police violence at campus protests over racial injustice.\nhttps://t.co/YIoQiXg5dG",
  "data/tweet-nytimes/2021/5/1394238276131823616.json": "Rural communities in the U.S. have complained for years about their lack of internet access. The pandemic has given new urgency to those concerns, at the same time that President Biden’s infrastructure plan has raised hope for a solution. https://t.co/JWXCTOlZ0y",
  "data/tweet-nytimes/2021/5/1394287874078646278.json": "American families will start getting monthly child tax credit payments in July.\n\nFamilies with children under 6 years old can receive $300, while those with children over 6 can receive $250. The payments are phased out based on income levels. https://t.co/RimBThJ324",
  "data/tweet-nytimes/2021/5/1393717859151499266.json": "A U.S. government program intended to protect wild horses is instead subsidizing their path to destruction. https://t.co/hEVnAxUWHN",
  "data/tweet-nytimes/2021/5/1394430044261527558.json": "They’re vaccinated and keeping their masks on, maybe forever. https://t.co/91j2kUntvJ https://t.co/IQLkZjqeXj",
  "data/tweet-nytimes/2021/5/1394326882087223298.json": "Top Republicans in Arizona's Maricopa County are running out of patience with their fellow party members in the state legislature over their review of election results: \"We can’t indulge these insane lies any longer.\" https://t.co/wYLJ23DNId",
  "data/tweet-nytimes/2021/5/1394440153326931974.json": "The Justice Department under President Trump secretly obtained a grand-jury subpoena last year in an attempt to identify the person behind a Twitter account dedicated to mocking Rep. Devin Nunes of California, according to a newly unsealed court document. https://t.co/5KkppF8pOt",
  "data/tweet-nytimes/2021/5/1394442635897679877.json": "President Biden released tax forms on Monday showing that he and his wife, Jill Biden, earned just over $600,000 in 2020. The release resumed a presidential tradition of disclosure broken by Donald Trump. https://t.co/wwy7SQXclu",
  "data/tweet-nytimes/2021/5/1394390309971300355.json": "Apple has compromised on data security to placate Chinese authorities, according to internal company documents reviewed by The New York Times and interviews with current and former Apple employees and security experts. https://t.co/rklL3ojOIt",
  "data/tweet-nytimes/2021/5/1394359712695603208.json": "Rudy Giuliani's lawyers on Monday asked a judge to block any review of records seized when federal investigators conducted searches of Giuliani’s home, office and iCloud account. https://t.co/FfWCU8nRhh",
  "data/tweet-nytimes/2021/5/1394450539673530371.json": "Two intellectually disabled half brothers who spent more than three decades in prison after being wrongfully convicted in the rape and murder of an 11-year-old girl have been awarded $75 million by a jury in a federal civil rights case in North Carolina. https://t.co/tYwURIEO6z",
  "data/tweet-nytimes/2021/5/1394291851528638473.json": "Breaking News: The Supreme Court said it would hear a major case on abortion from Mississippi that could undermine Roe v. Wade.\nhttps://t.co/7yn4aqM4dN",
  "data/tweet-nytimes/2021/5/1394344495567806469.json": "Covid-19 cases are decreasing in the United States, and masks are no longer required everywhere, but the pandemic is not over — and won’t be until younger children can also be vaccinated, epidemiologists said in a new survey by The New York Times. https://t.co/OxKWVAi0Pd",
  "data/tweet-nytimes/2021/5/1394336980155125775.json": "Face coverings have been a political flash point during the pandemic. Now, as more Americans become vaccinated and restrictions are eased, those who want to keep wearing masks say they are facing pressure to take them off.\nhttps://t.co/Z1l2bH414x",
  "data/tweet-nytimes/2021/5/1394518124439932929.json": "Two sheriff’s deputies in South Carolina were fired for their role in the death of a Black man. They had used pepper spray and Tasers on him after he was taken to jail from a mental health facility in January. https://t.co/KNXfRRFx5x",
  "data/tweet-nytimes/2021/5/1394528198373871617.json": "The world’s leading energy agency said nations must drop fossil fuels, and fast, if they want to avert catastrophic climate change. https://t.co/VtbhwxPDSL",
  "data/tweet-nytimes/2021/5/1394651506901725185.json": "The only lab in Gaza that processes Covid-19 tests has become temporarily inoperable after it was damaged by an Israeli airstrike on a nearby building, officials in Gaza said.\nhttps://t.co/Iq7bmkPrEt",
  "data/tweet-nytimes/2021/5/1394673844661727237.json": "\"Shrek,\" which came out 20 years ago today, might be a fan favorite now, but no one at DreamWorks expected that when it was getting made. As one director put it, \"Getting sent to 'Shrek' felt like being sent to Siberia.\" https://t.co/wnwLdbxnPG https://t.co/EF69NXLYOJ",
  "data/tweet-nytimes/2021/5/1394675735491719169.json": "Rep. Val Demings, Democrat of Florida, intends to challenge Sen. Marco Rubio in 2022, giving him a high-profile challenger. Demings was an impeachment manager for Donald Trump’s first trial last year and was also a contender to be Joe Biden's running mate. https://t.co/pcDvKP2Ceh",
  "data/tweet-nytimes/2021/5/1394655270358368264.json": "Long working hours are leading to hundreds of thousands of deaths per year, according to a WHO study.\n\nWorking more than 55 hours per week was associated with an increased risk of stroke and heart disease, the report said.\nhttps://t.co/Q9bo3LAfbs",
  "data/tweet-nytimes/2021/5/1394699396374204416.json": "83% of people polled in Japan said they did not want Tokyo to hold the upcoming Olympics, a new survey found.\nOpposition to the Games comes as growing areas of the country have been placed under a state of emergency because of surging Covid-19 cases.\nhttps://t.co/HKoxBiksbg",
  "data/tweet-nytimes/2021/5/1394716958445219841.json": "The actor Charles Grodin had a talent for deadpan comedy that he showcased in movies like “The Heartbreak Kid,” “Midnight Run” and “Beethoven.” After decades of work on Broadway, on TV and in movies, he died on Tuesday at 86. https://t.co/XN1kJnpMRX",
  "data/tweet-nytimes/2021/5/1394759744796114947.json": "Representative Rashida Tlaib, Democrat of Michigan, confronted President Biden on Tuesday over his support for Israel, urging him to do more to protect Palestinian lives and human rights, according to an aide familiar with their exchange. https://t.co/K2HNQiJAJg",
  "data/tweet-nytimes/2021/5/1394725744123781121.json": "President Biden is said to have warned Prime Minister Benjamin Netanyahu of Israel in a private phone call on Monday that he could only put off for so long the growing pressure to call on Israel to change its approach in Gaza. https://t.co/a4rdU8tEWg",
  "data/tweet-nytimes/2021/5/1394799981069062146.json": "For decades, children seen in rare footage of a train bound for a Nazi death camp were nameless victims. Now, researchers have identified them, and two are still alive. \"I feel that I can shout from the roofs, I’m still here,\" said Marc Degen, 80. https://t.co/jkLIyDMNZ0",
  "data/tweet-nytimes/2021/5/1394830193357885445.json": "83% of people polled in Japan said they did not want Tokyo to host the Olympics this summer. Opposition to the Games comes as growing areas of the country have been placed under a state of emergency because of surging coronavirus cases. https://t.co/IWWjmCHbDF",
  "data/tweet-nytimes/2021/5/1394578551408676865.json": "A week of fighting between Israel and Hamas has left more than 200 people dead. Maps show the extent of the devastation. https://t.co/qqykx7Wvt0",
  "data/tweet-nytimes/2021/5/1394864128255275009.json": "Breaking News: The New York attorney general’s office joined the Manhattan district attorney in its criminal inquiry of Donald Trump and his family business. https://t.co/XezYtWxpHQ",
  "data/tweet-nytimes/2021/5/1394601201782730756.json": "A 33-year-old migrant from Sri Lanka died in a Japanese detention center in March.\n\nThe case has spurred a national reckoning over Japan’s at-times inhumane treatment of foreigners, especially people of color, and many are calling for change.\n\nhttps://t.co/T9dSGgviju",
  "data/tweet-nytimes/2021/5/1394840249159884810.json": "Conditions in Gaza were already dire. The war with Israel has made it worse, leaving more than 200 people dead, the health and sewage systems damaged, schools closed and tens of thousands displaced. https://t.co/BSrh1cCQ7b",
  "data/tweet-nytimes/2021/5/1394805366626603012.json": "Breaking News: Emergent BioSolutions, the company whose plant in Baltimore ruined millions of coronavirus vaccine doses, spent years building influence with political donations. Its founder now must answer to Congress. https://t.co/SdAdkEaQbf",
  "data/tweet-nytimes/2021/5/1394748637574582276.json": "The mainstream narrative of Sinead O'Connor is that she ripped up a photo of the pope on “Saturday Night Live” and killed her career. What if the opposite were true? https://t.co/ruA2SUWbyM",
  "data/tweet-nytimes/2021/5/1394893096664633344.json": "India reported the highest single daily death toll of any country during the pandemic with 4,529 new Covid-19 deaths. https://t.co/hk5kCLhFae",
  "data/tweet-nytimes/2021/5/1394850361811296259.json": "Of the 1,300 top-grossing films in the U.S. released from 2007 through 2019, just 44 featured an Asian or Pacific Islander character in a leading role — and one-third of the roles went to a single actor, Dwayne Johnson, a study has found. https://t.co/rnQVdjKi1c",
  "data/tweet-nytimes/2021/5/1394984957173452808.json": "The New York attorney general’s office joined the Manhattan district attorney in its criminal inquiry of Donald Trump and his family business. https://t.co/9vREY2yEHh",
  "data/tweet-nytimes/2021/5/1394986270753951748.json": "President Recep Tayyip Erdogan of Turkey, already facing an economic crisis and surging coronavirus cases, has been hit by a corruption scandal in his ranks.\n\nAccusations made by a convicted organized crime boss living in exile have rocked the country.\nhttps://t.co/uVJnbX4ejC",
  "data/tweet-nytimes/2021/5/1395074282028425217.json": "Paul Mooney, the trailblazing comedian best known for his blunt, boundary-pushing routines about racism and social justice and for his work with Richard Pryor and Dave Chappelle, died on Wednesday. He was 79. https://t.co/XX8ShvXMnc",
  "data/tweet-nytimes/2021/5/1395045348335357956.json": "They are “an army of 16-year-olds,” as one political veteran put it, who can “do anything on the internet.” Young progressives are emerging as a political force in Massachusetts elections, and taking aim at the Democratic establishment. https://t.co/noInmaN9sK",
  "data/tweet-nytimes/2021/5/1395192816247185408.json": "Ford unveiled the electric version of its F-150 pickup, the core of the best-selling vehicle line in the U.S., at a price thousands less than a Tesla. https://t.co/ZbxZ29e0KO",
  "data/tweet-nytimes/2021/5/1395177462766739459.json": "\"It feels different this time.\" As images of destruction in Gaza spread, people around the world are rallying for the Palestinian cause and linking arms with social justice movements like Black Lives Matter. https://t.co/wtKKkDtZ5l",
  "data/tweet-nytimes/2021/5/1395207679749021701.json": "Two former police officers in Colorado are facing criminal charges in connection with the arrest last year of a 73-year-old woman with dementia during which she was thrown to the ground, prosecutors announced on Wednesday. https://t.co/gGAbW2GmeT",
  "data/tweet-nytimes/2021/5/1395153968527986690.json": "A sharply divided House voted to create an independent commission to investigate the Jan. 6 Capitol assault, overcoming opposition from Republicans determined to stop a high-profile accounting of the pro-Trump riot. Four-fifths of Republicans voted no. https://t.co/K6uI1fVyjf https://t.co/1hXLRk9y62",
  "data/tweet-nytimes/2021/5/1395152563104796676.json": "Breaking News: The House voted 252 to 175 to create an independent commission to investigate the Jan. 6 Capitol assault, overcoming broad opposition from Republicans. https://t.co/o0cJwKdm5K",
  "data/tweet-nytimes/2021/5/1395284438825717762.json": "Often overlooked in Western countries, Dr. Wu Lien-Teh is recognized in world history as a pioneer of public health. He helped change the course of a plague epidemic in the early 20th century and promoted the use of masks. https://t.co/PxKi6Naqqb",
  "data/tweet-nytimes/2021/5/1395099489745182720.json": "The Biden administration has reappointed Michael Kuperberg, the scientist responsible for the National Climate Assessment, after he was removed from his post last year by Donald Trump. https://t.co/hFgNlIpz1B",
  "data/tweet-nytimes/2021/5/1395359928651591681.json": "The three known survivors of the 1921 Tulsa race massacre, in which white mobs are estimated to have killed hundreds of Black people, shared their stories before a congressional committee, arguing that justice was far overdue.\nhttps://t.co/Dn9bbz5WTv",
  "data/tweet-nytimes/2021/5/1395375035645321227.json": "Viola Ford Fletcher is one of three known survivors of the 1921 Tulsa race massacre.\n\n\"I'm here seeking justice,\" she told a congressional committee that is considering reparations for survivors and their descendants.\nhttps://t.co/PEXP1mPv2t https://t.co/6He4bohwSm",
  "data/tweet-nytimes/2021/5/1395406487208476675.json": "Watch: Representative Tim Ryan, Democrat of Ohio, tore into House Republicans on Wednesday, after a vast majority voted against an independent commission to investigate the deadly Jan. 6 attack on the Capitol. https://t.co/h3EJPIuHT2 https://t.co/jqkGTKgpgZ",
  "data/tweet-nytimes/2021/5/1395453034063405060.json": "Senator Bernie Sanders introduced a resolution on Thursday to block the sale of $735 million of precision-guided weapons to Israel. It's unlikely that the resolution will delay or halt the arms sale. https://t.co/Vs7j6d1h2y",
  "data/tweet-nytimes/2021/5/1395479341035888642.json": "Breaking News: Israel and Hamas have agreed to a cease-fire mediated by Egypt after days of fighting that claimed more than 200 lives. Follow live coverage here: https://t.co/gEEafe5A82 https://t.co/q3lkyvri1T",
  "data/tweet-nytimes/2021/5/1395475628791578625.json": "Breaking News: Israel and Hamas have agreed to a cease-fire mediated by Egypt after days of fighting that claimed more than 200 lives. https://t.co/ag0bMvSpMI",
  "data/tweet-nytimes/2021/5/1395372927491706881.json": "A $260 million park that juts out onto the Hudson River opens Friday. Opponents battled it for years. Here’s what our architecture critic thinks.\nhttps://t.co/YhmYiazWm2",
  "data/tweet-nytimes/2021/5/1395134729117224967.json": "The Trump Justice Department secretly obtained a grand jury subpoena last year in an attempt to reveal who was behind a Twitter account devoted to mocking Rep. Devin Nunes. It stemmed from an investigation into a purported threat to Sen. Mitch McConnell. https://t.co/K6Og2PA3tD",
  "data/tweet-nytimes/2021/5/1395487009775423489.json": "The Biden administration proposed a global tax on multinational corporations of at least 15% in the latest round of international tax negotiations, Treasury Department officials said on Thursday. https://t.co/vFzhQdjMbK",
  "data/tweet-nytimes/2021/5/1395515960874999809.json": "Breaking News: An Israel-Hamas cease-fire is set to begin now, offering hope of a respite from fighting that killed more than 230 people in Gaza and 12 people in Israel.\nhttps://t.co/9NRqICjCL7",
  "data/tweet-nytimes/2021/5/1395585160091930628.json": "For the first time in nearly three decades, Alabama will allow yoga to be taught in its public schools, but teachers will be barred from saying the traditional salutation “namaste” and using Sanskrit names for poses. \nhttps://t.co/MQHNyGkHI9",
  "data/tweet-nytimes/2021/5/1395493313982124044.json": "“I’m proud today,” President Biden said on Thursday, after signing a bill addressing hate crimes against Asian-Americans into law. “I’m proud today that Democrats and Republicans have stood up together to say something.” https://t.co/h2pfA2PCvv https://t.co/sdQBcJG4Vp",
  "data/tweet-nytimes/2021/5/1395587671456628736.json": "The federal authorities have confiscated 69 big cats from an Oklahoma animal park run by Jeffrey Lowe, the man who took control of an exotic-animal complex at the center of the popular Netflix documentary “Tiger King,” the Justice Department announced. https://t.co/El8bPnN7Ef",
  "data/tweet-nytimes/2021/5/1395703453012398085.json": "For the first time in nearly three decades, Alabama will allow yoga to be taught in its public schools, but teachers will be barred from saying the traditional salutation “namaste” and using Sanskrit names for poses. \nhttps://t.co/sswEG6JiCM",
  "data/tweet-nytimes/2021/5/1395783964158222337.json": "Roman Kent, who told the world of his hellish experience at Auschwitz and urged Germany to provide reparations for Jewish Holocaust survivors, died on Friday. He was 92.\nhttps://t.co/IHqdLuhwes",
  "data/tweet-nytimes/2021/5/1395813074150387712.json": "A man whose father died of the virus last fall has a spreadsheet of the outstanding medical debts: It has 457 rows, totaling over $1 million. He's one of many Americans whose lives and finances have been upended by medical bills resulting from Covid. https://t.co/XYIuMpyaO2",
  "data/tweet-nytimes/2021/5/1395737400723267589.json": "Prince Harry has spoken about his struggles with mental health as a member of the British royal family.\n\n“I was willing to drink, I was willing to take drugs,” he said of his efforts to cope with grief after the death of his mother, Princess Diana.\nhttps://t.co/eOfCQIZk1w",
  "data/tweet-nytimes/2021/5/1395763865561047040.json": "Ralph Puckett Jr., 94, will receive the Medal of Honor from President Biden on Friday. Colonel Puckett led 51 Army Rangers in fighting off successive waves of enemy counterattacks after he was gravely wounded by a hand grenade during the Korean War. https://t.co/IBqmyF9ZFD",
  "data/tweet-nytimes/2021/5/1396096052344889347.json": "Animal lovers can breathe a sigh of relief — pandemic pups aren't being abandoned. https://t.co/oDynN8L9IC",
  "data/tweet-nytimes/2021/5/1396159183595188224.json": "The pandemic has taken an emotional toll on many of us. Here’s how to decide whether you would benefit from mental health counseling. https://t.co/sMYR0r1Jv2 https://t.co/jerQuOzNxo",
  "data/tweet-nytimes/2021/5/1396211969242304512.json": "The Netherlands' #Eurovision entry, “Birth of a New Age” performed by Jeangu Macrooy, paid tribute to the Black Lives Matter movement. https://t.co/AlE0cjRmn3",
  "data/tweet-nytimes/2021/5/1396204242084499458.json": "Rick Santorum, the former Pennsylvania senator and Republican presidential candidate, has been dropped from his role as a CNN political commentator amid controversy over recent remarks that seemed to erase the role of Native Americans in U.S. history. https://t.co/d1BWh7OB8a",
  "data/tweet-nytimes/2021/5/1396229412518043654.json": "\"Shrek,\" which came out 20 years ago, might be a fan favorite now, but no one at DreamWorks expected that when it was getting made. As one director put it, \"Getting sent to 'Shrek' felt like being sent to Siberia.\" https://t.co/mVdmSFCCI3 https://t.co/BW1xEPdIWD",
  "data/tweet-nytimes/2021/5/1396245783758917640.json": "Breaking News: Italy won the Eurovision Song Contest, one of the first major global cultural events to be held since the coronavirus pandemic hit. https://t.co/hzKITCQWwG",
  "data/tweet-nytimes/2021/5/1396330063675658241.json": "Roman Kent, who told the world of his hellish experience at Auschwitz and urged Germany to provide reparations for Jewish Holocaust survivors, died on Friday. He was 92. https://t.co/EZuF9LbLNS",
  "data/tweet-nytimes/2021/5/1396175193853374466.json": "\"It makes you want to take revenge, to defend yourself. But we have nothing to defend ourselves with.”\n\nAn eviction spurred a conflict that led Israel and Hamas to war. But for many Palestinians, the indignities of occupation are part of daily life. https://t.co/lhcoKRoTGt",
  "data/tweet-nytimes/2021/5/1396340141506146306.json": "What does it mean to be “climatarian?”\n\n🥦 Eating produce that’s in season relative to your region.\n🍗 Avoiding meat that comes from factory farms. \n🔎 Seeking local ingredients with lower carbon footprints. https://t.co/1eBOy1q6Lo",
  "data/tweet-nytimes/2021/5/1396556590187220992.json": "In May, the Pfizer-BioNTech vaccine was approved by the FDA for young people aged 12 to 17. Moderna and Johnson &amp; Johnson vaccines are likely to be approved for children in the coming months. https://t.co/zRoi7knSR8 https://t.co/tR86vq7hX7",
  "data/tweet-nytimes/2021/5/1396541707672563715.json": "Coronavirus cases and deaths in the U.S. have dropped to the lowest levels in nearly a year. https://t.co/gQaiNSBknW https://t.co/zXRa01ifG9",
  "data/tweet-nytimes/2021/5/1396531409104289795.json": "Any day now, billions of cicadas will emerge from underground tunnels to sing, mate and die across the eastern U.S. The once-in-a-cicada-lifetime party will be hosted by a cohort called Brood X. https://t.co/SYwPAFAXdu https://t.co/PkHElQp8Xo",
  "data/tweet-nytimes/2021/5/1396576693029064705.json": "No, procrastination isn't about laziness or bad time-management. “Procrastination is an emotion regulation problem, not a time management problem.” https://t.co/30fZw9ww8U",
  "data/tweet-nytimes/2021/5/1396199209561362439.json": "New York and New Jersey are running short on (legal) marijuana. https://t.co/6M7A4BUHmc",
  "data/tweet-nytimes/2021/5/1396604906438529025.json": "Breaking News: Phil Mickelson, who turns 51 next month, won the PGA Championship to become the oldest golfer to claim a major title. https://t.co/ErvrrDjfws",
  "data/tweet-nytimes/2021/5/1396667287361499137.json": "A commercial flight from Greece to Lithuania was intercepted by a fighter jet and diverted to Belarus on Sunday in order to arrest a dissident journalist on board: 26-year-old Roman Protasevich. Here's what we know. https://t.co/951W5yaD0X",
  "data/tweet-nytimes/2021/5/1396459703111143427.json": "A House representative from New Jersey's choice of what painting will represent his district in the Capitol has turned the heads of \"Hannibal\" fans, who recognized it as \"slash\" fan art of two of the series' main characters. https://t.co/jduREPlGlG",
  "data/tweet-nytimes/2021/5/1396571659356839939.json": "A year after the murder of George Floyd, Los Angeles and other American cities are facing a surge in violent crime, forcing cities whose leaders embraced the idea of police reform to reassess how far they are willing to go to reimagine public safety. https://t.co/RMzadl6Pib",
  "data/tweet-nytimes/2021/5/1396737756966051840.json": "Yuan Longping, a Chinese plant scientist who helped to alleviate famine and poverty across much of Asia and Africa, died on Saturday. He was 90. https://t.co/oWQUIwrZWb",
  "data/tweet-nytimes/2021/5/1396621983941550083.json": "Hollywood undervalued Jean Smart for years. With \"Mare of Easttown\" and \"Hacks,\" she brings about her own career resurgence. https://t.co/FS63bFIneX",
  "data/tweet-nytimes/2021/5/1396786819509927938.json": "International outrage is growing after Belarus forced a Ryanair passenger jet to land and then arrested a dissident journalist who was on board.\n\nFollow updates here.\nhttps://t.co/7ADYZ5P88k",
  "data/tweet-nytimes/2021/5/1396843472116756483.json": "Simone Biles executed a vault considered so dangerous that no other woman has attempted it in competition. For now, gymnastics limits the scoring rewards for trying it.\n\nWhen the Olympic medalist was asked why she does it, she answered, “Because I can.”\nhttps://t.co/PLp1ZWiT23",
  "data/tweet-nytimes/2021/5/1396877416199512066.json": "For the first time, humpback whales were heard singing in waters off New York. The songs are otherworldly. https://t.co/uJlZFBEle8",
  "data/tweet-nytimes/2021/5/1396798216855826432.json": "Eurovision, the largest music contest in the world, is more than just weird. It celebrates Europe’s cultural diversity, and anything goes. And, a shocker perhaps for a U.S. audience, the three-hour show is completely commercial-free. https://t.co/FO1STtKikn",
  "data/tweet-nytimes/2021/5/1396289791096934400.json": "Children 12 to 17 are now eligible to get vaccinated against Covid-19. Here’s what we know about giving Covid shots to kids. https://t.co/fXa5RrIe7Z",
  "data/tweet-nytimes/2021/5/1396895035279429635.json": "A former Minnesota police officer was sentenced to six years in prison for kicking a Black man who was on the ground, breaking seven ribs and causing his lungs to collapse. The man was also attacked by a police dog after police mistook him for a suspect. https://t.co/DOu8VQEBQV",
  "data/tweet-nytimes/2021/5/1396893790955315200.json": "A team of scientists announced they had partially restored the sight of a blind man by building light-catching proteins in one of his eyes. The result of 13 years of work, it is the first published study to describe the successful use of this treatment. https://t.co/7hTIVtRhXn https://t.co/itryRgYLxx",
  "data/tweet-nytimes/2021/5/1396916683709767689.json": "When it was suddenly announced that Ryanair Flight 4978 would land in Belarus, passengers said that the dissident journalist Roman Protasevich, 26, gave his girlfriend his computer and phone and told others on the plane that the death penalty awaited him. https://t.co/qox3UAkXhg https://t.co/1SCq9VxOoa",
  "data/tweet-nytimes/2021/5/1396946631971459074.json": "Florida on Monday became the first state to approve fines on social media companies that permanently bar political candidates in the state. The law is a direct response to Facebook and Twitter’s suspension of Donald Trump. https://t.co/y62STjncsX",
  "data/tweet-nytimes/2021/5/1396964267316875264.json": "A century ago, a prosperous Black neighborhood perished in the Tulsa Race Massacre at the hands of a white mob. Hundreds were killed. Buildings burned. Years of Black success were erased.\n\nWe recreated the neighborhood in 3D to show what was lost. https://t.co/hpkZgULdLe",
  "data/tweet-nytimes/2021/5/1396981865437872130.json": "The original 2007 video “Charlie Bit My Finger,” a standard-bearer of viral internet fascination, has sold as a nonfungible token for $760,999, and the family who created it will take down the original from YouTube for good.\nhttps://t.co/P5Coz17dSn",
  "data/tweet-nytimes/2021/5/1396959226472407047.json": "There’s been a surge in the number of start-ups, especially in Black communities, that seems to coincide with federal stimulus, according to new data. A large part of this surge was in businesses providing services for adapting to the pandemic. https://t.co/lreXfi6oVI",
  "data/tweet-nytimes/2021/5/1397004521906315267.json": "Bob Dylan turned 80 years old on Monday. Here's what to watch to celebrate the enigmatic singer. https://t.co/gHohrU9KD7",
  "data/tweet-nytimes/2021/5/1396930283950252032.json": "As states announce the return of in-person schools this fall, there are questions about proper ventilation. The New York Times worked with experts to understand the simple steps schools can take to reduce coronavirus exposure in the classroom. https://t.co/Ro1MK3nK6f",
  "data/tweet-nytimes/2021/5/1396892275301654530.json": "Stephen Colbert’s late-night talk show will return to filming in front of a studio audience on June 14, CBS said on Monday. About 400 audience members will be allowed to attend, provided they can show proof of vaccination. https://t.co/Er51bwUtnS",
  "data/tweet-nytimes/2021/5/1396882461435568129.json": "21 runners died after high winds and freezing rain struck an ultramarathon mountain race in China on Saturday. One competitor said after he passed out, he woke up in a cave, wrapped in a quilt next to a fire built by a shepherd who carried him to safety. https://t.co/HVeEol78fP",
  "data/tweet-nytimes/2021/5/1396897566013509634.json": "“It’s a dying field,” said a teacher at a Maine school where two students won cursive awards last week. “But it’s something that our school takes a lot of pride in, and the kids take a lot of pride in it, too.” https://t.co/vO9cGj5n3n",
  "data/tweet-nytimes/2021/5/1397130360358572038.json": "The moon will enter Earth’s shadow and turn a blood red color during a total lunar eclipse on May 26.\n\nHere’s what to know about the “super blood moon.”\nhttps://t.co/iEy1o7AWHV",
  "data/tweet-nytimes/2021/5/1397107709233831939.json": "Damiano David of the Italian rock band Maneskin hunched over a table during the Eurovision finale, fueling speculation that he was using drugs. He has since taken a drug test and passed it. https://t.co/lK1tdtMqKn",
  "data/tweet-nytimes/2021/5/1397024648148230151.json": "Donald Trump’s former White House counsel, Donald McGahn, has agreed to testify behind closed doors before the House Judiciary Committee about Trump’s efforts to obstruct the Russia investigation, according to people familiar with the matter. https://t.co/TEhn9973xG",
  "data/tweet-nytimes/2021/5/1397110208753770496.json": "More than 30 poets have been imprisoned, and at least four have been killed, since the army seized control in Myanmar.\n\nPolitical poetry has a long history in the country, and poets are continuing to provide the battle cries of the resistance movement.\nhttps://t.co/VLfh3l5hAs https://t.co/CeLWuRTiKf",
  "data/tweet-nytimes/2021/5/1397193244950269955.json": "The moon will enter Earth’s shadow and turn a blood red color during a total lunar eclipse on May 26.\n\nHere’s what to know about the “super blood moon.”\nhttps://t.co/uVL9es8cH0",
  "data/tweet-nytimes/2021/5/1397166819346194432.json": "George Floyd’s murder prompted protests around the world and an uprising for racial justice nearly unparalleled in American history.\n\nHere is a look back at what has transpired in the year since his death.\nhttps://t.co/JXr0cbXltn",
  "data/tweet-nytimes/2021/5/1396845965034799104.json": "The safety of flights operated by U.S. airlines over Belarus should be reviewed after the country forced a commercial flight to land in order to seize a dissident journalist on board, the transportation secretary Pete Buttigieg said on Monday. https://t.co/SJprtNLWqP",
  "data/tweet-nytimes/2021/5/1397209742041300995.json": "A century ago, a prosperous Black neighborhood perished in the Tulsa Race Massacre at the hands of a white mob. Hundreds were killed. Buildings burned. Years of Black success were erased.\n\nWe recreated the neighborhood in 3D to show what was lost. https://t.co/WapNTamw0K https://t.co/Sn1QtEfIDh",
  "data/tweet-nytimes/2021/5/1397223461668405256.json": "John Cena, who stars in the latest installment in the “Fast and Furious” movie franchise, apologized in Mandarin to fans in China on Tuesday after he referred to Taiwan as a country in an interview. https://t.co/UPsouQ2u77",
  "data/tweet-nytimes/2021/5/1397178146223501313.json": "The drugmaker Moderna said its Covid-19 vaccine was powerfully effective in 12- to 17-year-olds. It plans to apply for FDA authorization.\nhttps://t.co/impvDDXG0f",
  "data/tweet-nytimes/2021/5/1397168106351566857.json": "In Opinion\n\n\"Asking Bill Gates to fix inequality is like asking an arsonist to hose down your house after he just set it on fire,\" writes Linsey McGoey, an author and professor of sociology, in a guest essay.\nhttps://t.co/HITUFr9ydz",
  "data/tweet-nytimes/2021/5/1397270028739883009.json": "George Floyd’s family will direct money from its $27 million settlement with the city of Minneapolis to fund $500,000 in grants for businesses and other organizations in the community where Floyd was killed by police. https://t.co/Ft2UzGKKun",
  "data/tweet-nytimes/2021/5/1397298954920988686.json": "George Floyd's family members described their meeting with President Biden on Tuesday as a “very personal” check-in with a family he has gotten to know over the past year. “He genuinely wanted to know exactly how we were doing,” said Floyd’s nephew. https://t.co/uSWwi7dTzh",
  "data/tweet-nytimes/2021/5/1397257425531686913.json": "A series of loud noises that sounded like at least 10 gunshots broke the quiet Tuesday morning at George Floyd Square on the anniversary of his killing. The police later said one person was being treated for a gunshot wound at a nearby hospital. https://t.co/2OuNHSgoFd https://t.co/ieWcsytljQ",
  "data/tweet-nytimes/2021/5/1397351793131196418.json": "The moon will enter Earth’s shadow and turn a blood red color during a total lunar eclipse on May 26.\n\nHere’s what to know about the “super blood moon.”\nhttps://t.co/4Iu1WawF3m",
  "data/tweet-nytimes/2021/5/1397250162091778048.json": "India recorded the largest daily death toll for any country last week — a figure that is likely an undercount. Our estimates show that even in even the most conservative of scenarios, estimated Covid infections and deaths far exceed official figures. https://t.co/gA7b4gCJUm",
  "data/tweet-nytimes/2021/5/1397417267902783490.json": "More than 30 poets have been imprisoned, and at least four have been killed, since the army seized control in Myanmar.\n\nPolitical poetry has a long history in the country, and poets are continuing to provide the battle cries of the resistance movement.\nhttps://t.co/6CU0Rt2Yur https://t.co/6eRom24YcC",
  "data/tweet-nytimes/2021/5/1397382008687448064.json": "How safe is flying? The air in planes is refreshed more often than most grocery stores. But that doesn’t guarantee it's completely free of Covid-19. Watch how air moves through a plane, and see what it means for the risk of flying now. https://t.co/iKs2khyz2o",
  "data/tweet-nytimes/2021/5/1397259957955878912.json": "Texas lawmakers are poised to allow most adults over the age of 21 to openly carry a handgun without a permit. Gov. Greg Abbott, who said he would sign the bill, called it “the strongest Second Amendment legislation in Texas history.” https://t.co/HyiHhC7UjS",
  "data/tweet-nytimes/2021/5/1397487700916199425.json": "Just minutes after the war between Israel and Hamas broke out, Baraa al-Gharabli, 5, was killed in Gaza.\n\nHe was one of at least 68 children killed during the conflict. Nearly all were Palestinian.\n\nThese are the children who died.\nhttps://t.co/cUGR9yLvSd",
  "data/tweet-nytimes/2021/5/1397412199736528899.json": "India recorded the largest daily death toll for any country last week — a figure that is likely an undercount. Our estimates show that even in even the most conservative of scenarios, estimated Covid infections and deaths far exceed official figures. https://t.co/viiYq1pZ1Y https://t.co/JaZdi2E9mB",
  "data/tweet-nytimes/2021/5/1397514109986422784.json": "The Louvre will have a female president for the first time in its 228-year history. Laurence des Cars, who is currently president of the Musée d’Orsay, will take over the job — one of the most important in the art world — in September.\nhttps://t.co/nKmd2Ov4Lp",
  "data/tweet-nytimes/2021/5/1397540542758666241.json": "A supermoon and a total lunar eclipse combined to form a “super blood moon” on Wednesday, putting on a striking display of sunset colors like red and burnt orange.\nhttps://t.co/7D8Ohbr95z https://t.co/kYg6PGYO3i",
  "data/tweet-nytimes/2021/5/1397560672829980675.json": "The Louvre will have a female president for the first time in its 228-year history. Laurence des Cars, the current head of the Musée d’Orsay, will become the president of the world’s most visited museum in September. https://t.co/MNoKFqaavi",
  "data/tweet-nytimes/2021/5/1397608495466352640.json": "Immunity to the coronavirus lasts at least a year, probably longer, and improves over time especially after vaccination, according to two new studies. https://t.co/GYV1YGUKQH",
  "data/tweet-nytimes/2021/5/1397606103844855810.json": "Breaking News: President Biden has asked U.S. intelligence to submit a report within 90 days on whether the coronavirus emerged from an accidental lab leak. https://t.co/HVNcd3B5ZY",
  "data/tweet-nytimes/2021/5/1397622929135915010.json": "At least 66 children were killed in Gaza and 2 in Israel during 11 days of fighting this month between Israel and Hamas, according to initial reports.\n\nThis is who they were. https://t.co/v40FIMwrKR",
  "data/tweet-nytimes/2021/5/1397637428597362695.json": "These are the children who were killed in the Israel-Hamas war. https://t.co/ZiQpVFaao7 https://t.co/SItatvTu9r",
  "data/tweet-nytimes/2021/5/1397621238055452681.json": "Neither a supermoon nor a blood moon is that rare, but seeing both together is unusual, scientists say. It usually happens once every several years, depending on where in the world you live. https://t.co/quTdygVscK https://t.co/C0YQmlEJCC",
  "data/tweet-nytimes/2021/5/1397616041157595144.json": "Laurence des Cars will lead the Louvre, the world’s most visited museum, starting in September. She will be the first woman to do so in the museum's 228-year history. https://t.co/1RSzBXNzJX https://t.co/XSsnXuvERt",
  "data/tweet-nytimes/2021/5/1397311542031433729.json": "Kristen Clarke on Tuesday became the first woman of color to be confirmed by the Senate to lead the Justice Department’s civil rights division. She is best known as a leading advocate for voting rights protections. https://t.co/QaZbYgLZRm",
  "data/tweet-nytimes/2021/5/1397691577481502721.json": "Eric Carle, the artist and author of “The Very Hungry Caterpillar,” a tale that has charmed generations of children and parents alike, died on Sunday at 91. He wrote and illustrated more than 70 books for young children. https://t.co/XCjXo96mqi",
  "data/tweet-nytimes/2021/5/1397704144908083201.json": "The mother of Tamir Rice, the 12-year-old Black boy who was fatally shot by a white police officer in Cleveland in 2014, is asking the Ohio Supreme Court to prevent the man who killed her son from being reinstated as an officer. https://t.co/CKGjfAXWwH",
  "data/tweet-nytimes/2021/5/1397751025864486914.json": "The victims of the San Jose shooting on Wednesday were identified as:\n— Paul Delacruz Megia\n— Taptejdeep Singh\n— Adrian Balleza\n— Jose Dejesus Hernandez III\n— Timothy Michael Romo\n— Michael Joseph Rudometkin\n— Abdolvahab Alaghmandan\n— Lars Kepler Lane\nhttps://t.co/LhVL78fcBN",
  "data/tweet-nytimes/2021/5/1397696593860698116.json": "Gov. Gavin Newsom of California condemned the “rinse and repeat” cycle of mass shootings in the U.S. on Wednesday after eight people were killed in San Jose. “What the hell is wrong with us?” Newsom said. https://t.co/GSWMcUsH10",
  "data/tweet-nytimes/2021/5/1397655872369725440.json": "Exclusive: The man who manages Bill Gates’s fortune and his foundation’s endowment engaged in a pattern of workplace misconduct that prompted some employees to complain to Gates. The money manager, Michael Larson, is still in charge of the investments. https://t.co/WyJJmwdsbe",
  "data/tweet-nytimes/2021/5/1397866451877478403.json": "It's been 3,000 years, but seven baby Tasmanian devils have brought a new hope for the species. https://t.co/c2XZRQdkyX",
  "data/tweet-nytimes/2021/5/1397730535905140739.json": "Samuel Wright, a veteran stage actor who was best known for voicing the headstrong crab Sebastian in the 1989 animated film “The Little Mermaid,” died at 72. Wright also earned a Tony nomination as Mufasa in the original cast of the “The Lion King.” https://t.co/haWf2P5rFh",
  "data/tweet-nytimes/2021/5/1397886758679986178.json": "Breaking News: President Biden will propose a $6 trillion budget that would take the U.S. to its highest sustained levels of federal spending since World War II.\nhttps://t.co/QhXqgAug27",
  "data/tweet-nytimes/2021/5/1397903930676424704.json": "Eric Carle, the artist and author of “The Very Hungry Caterpillar,” a tale that has charmed generations of children and parents alike, died on Sunday at 91. He wrote and illustrated more than 70 books for young children. https://t.co/XQ9cBVPlUo",
  "data/tweet-nytimes/2021/5/1397928108418756609.json": "Howard University will name its newly re-established College of Fine Arts in honor of the actor and alumnus Chadwick Boseman, who expressed support for the college before his death and, as a student in the 1990s, led a protest against its consolidation. https://t.co/rtmsJ09hpF",
  "data/tweet-nytimes/2021/5/1397925607464325132.json": "Immunity to the coronavirus lasts at least a year, probably longer, and improves over time especially after vaccination, according to two new studies. https://t.co/2LxMbzi4Zh",
  "data/tweet-nytimes/2021/5/1397963328920735746.json": "Meet the Ohio vaccine lottery’s $1 million winner: a 22-year-old who thought the whole thing was \"a prank.\" https://t.co/SVNBOzfj98",
  "data/tweet-nytimes/2021/5/1397965852264304642.json": "In Opinion\n\n“President Jair Bolsonaro apparently intended to lead the country to herd immunity by natural infection,” writes Vanessa Barbara in a guest essay. “Mr. Bolsonaro effectively planned for at least 1.4 million deaths in Brazil.”\nhttps://t.co/sacWwhfrbS",
  "data/tweet-nytimes/2021/5/1397970798271352833.json": "Highways radically reshaped American cities: They destroyed dense downtown neighborhoods, divided many Black communities and increased car dependence.\n\nNow, some cities are looking to take them out. https://t.co/PqG2xOiTXj https://t.co/hpngWKm5dL",
  "data/tweet-nytimes/2021/5/1397614853389529088.json": "Breaking News: Eight people were killed in a shooting at a rail yard in San Jose, California. The gunman, whose home was on fire this morning, is dead, officials said. https://t.co/zqozISoixD",
  "data/tweet-nytimes/2021/5/1397953288830603270.json": "Watch: \"What the hell is wrong with us?\" Governor Gavin Newsom of California condemned the “rinse and repeat” cycle of mass shootings in America after a gunman killed eight people at a rail yard in San Jose. https://t.co/QSi99Vv5yn https://t.co/prLsj4gR4h",
  "data/tweet-nytimes/2021/5/1398025010950901767.json": "Protests erupted across Colombia in late April, sparking a violent response from the Colombian national police. Our visual investigations team analyzed videos that reveal their indiscriminate, and often deadly, use of force. https://t.co/ad61rx2SW7",
  "data/tweet-nytimes/2021/5/1398052373482909696.json": "Breaking News: U.S. prosecutors are said to be investigating whether several Ukrainian officials tried to meddle in the 2020 presidential election, including using Rudy Giuliani to spread their misleading claims about Joe Biden. https://t.co/ZEwhB8qlgE",
  "data/tweet-nytimes/2021/5/1398033784759533580.json": "Paul Ryan, the former Republican speaker of the House, is set to re-enter the political arena on Thursday night with a speech obliquely criticizing Donald Trump and warning Republicans not to move the party forward in his image. https://t.co/tlmMNxhGDT",
  "data/tweet-nytimes/2021/5/1398006124545200128.json": "Walter Kissinger, a successful businessman and brother to the former secretary of state, has died at 96. He shed his Bavarian accent, while Henry notably did not. Asked why he lost his, Walter told interviewers, “Because I am the Kissinger who listens.” https://t.co/RyzcbaVcSA",
  "data/tweet-nytimes/2021/5/1398106918225387521.json": "Seven Tasmanian devils were born on the Australian mainland for the first time in almost 3,000 years. https://t.co/Qsvc1gz8Kv https://t.co/pyfXxnv0dM",
  "data/tweet-nytimes/2021/5/1398043870353674253.json": "Three police officers in Tacoma, Washington, were charged on Thursday in the 2020 killing of Manuel Ellis, a Black man who had pleaded “I can’t breathe” after they punched him, squeezed his neck, pressed on his back and placed a spit hood over his head. https://t.co/zj6FTKPgFA",
  "data/tweet-nytimes/2021/5/1398130304993333248.json": "Breaking News: Hackers linked to Russian intelligence seized an email system used by a U.S. agency and then mounted attacks on groups critical of Vladimir Putin. https://t.co/u9B2Ih8lq2",
  "data/tweet-nytimes/2021/5/1397875246674366466.json": "A broad coalition of over 150 Democrats plans to start a campaign to pressure President Biden to include a major expansion of Medicare in his infrastructure package. https://t.co/kvPOjCc2Uj",
  "data/tweet-nytimes/2021/5/1398230102845136898.json": "14% of Americans believe in QAnon, the false conspiracy theory spread by some supporters of Donald Trump, according to a poll released on Thursday. Among Republicans only, that number rises to roughly 25%, or one in four. https://t.co/uEmZjz8mVt",
  "data/tweet-nytimes/2021/5/1398206177591320579.json": "Nike ended a sponsorship deal with the Brazilian soccer player Neymar last year after he refused to cooperate with an investigation into an accusation that he had sexually assaulted a Nike employee, the company confirmed Thursday.\nhttps://t.co/JDQkAdGeAm",
  "data/tweet-nytimes/2021/5/1398209950644682753.json": "After years of negotiation, Germany formally recognized the colonial-era mass killing of people from two ethnic groups in what is now Namibia as genocide.\n\nIt will also set up a fund of 1.1 billion euros to support projects in the affected communities.\nhttps://t.co/smVVWXJTgn",
  "data/tweet-nytimes/2021/5/1398289229357146113.json": "Vice President Kamala Harris will be the first woman to address the graduating class of the U.S. Naval Academy in its 175-year history when she delivers the commencement address later today. https://t.co/2YmIzenN40",
  "data/tweet-nytimes/2021/5/1398333280764706827.json": "President Biden’s $6 trillion budget would raise taxes on high earners and corporations and redistribute wealth to grow the middle class. It would also invest heavily in climate change, education and infrastructure. https://t.co/5zGILLnhzh",
  "data/tweet-nytimes/2021/5/1398354694897123330.json": "President Biden’s $6 trillion budget would raise taxes on high earners and corporations to help grow the middle class and pay for his infrastructure, education and climate change proposals. https://t.co/YZ4Bjyb8gL https://t.co/wroaB8e4rk",
  "data/tweet-nytimes/2021/5/1398343349623459840.json": "Genevieve Kingston’s mother died of cancer when she was 7. But before she died, she packed presents and letters for the milestones of her daughter’s life she would miss — driver’s license, graduation and every birthday until the age of 30. https://t.co/p7Xvbt2eEd https://t.co/TROYvWOo3i",
  "data/tweet-nytimes/2021/5/1398348370117337088.json": "New stamps from Spain’s postal service that were intended to condemn racism have backfired: The stamps were issued in skin tones — the lighter the shade, the more valuable the stamp — and set off waves of criticism. https://t.co/nTy0scNN41",
  "data/tweet-nytimes/2021/5/1398454060949331969.json": "After four years when the National Endowment for the Arts lived under the threat of elimination, President Biden on Friday proposed a 20% increase in the budget for the agency. https://t.co/SjmgoenmLc",
  "data/tweet-nytimes/2021/5/1398367238562910210.json": "An Indigenous community in British Columbia reported finding a mass grave with the remains of 215 children on the grounds of a former residential school, which operated from 1890 until 1978.  https://t.co/oLlzzxjBN7",
  "data/tweet-nytimes/2021/5/1398511941530918913.json": "This tea-time treat features a chocolate chip cake with a tender crumb and a silky mocha frosting. https://t.co/6T9mecl8je",
  "data/tweet-nytimes/2021/5/1398369751307632641.json": "A day after Idaho's lieutenant governor issued a ban on mask mandates while the governor was out of state, the governor repealed her ban, calling it a \"irresponsible, self-serving political stunt.”\nhttps://t.co/tUeKA0NIet",
  "data/tweet-nytimes/2021/5/1398610133261991936.json": "Genevieve Kingston’s mother died of cancer when she was 7. But before she died, she packed presents and letters for the milestones of her daughter’s life she would miss — driver’s license, graduation and every birthday until the age of 30. https://t.co/dyotF84cEV https://t.co/oKLp8uiuDG",
  "data/tweet-nytimes/2021/5/1398595034744819713.json": "Bunny, a sheepadoodle who has more than 6 million followers on TikTok, has learned 92 words — almost as much as a human toddler. Her language acquisition has brought attention to animal cognition and the use of assistive technology. https://t.co/QuLnFuolme",
  "data/tweet-nytimes/2021/5/1398579940019290137.json": "In Opinion\n\n“Covid-19 revealed how teachers — in addition to nurturing, protecting and mentoring our children — are essential to a smoothly running society,” says Colette Coleman, an ed tech strategist, in a guest essay. “It’s time to pay them accordingly.”https://t.co/TpR0fs3GfW",
  "data/tweet-nytimes/2021/5/1398630232022716416.json": "Seventeen years after the final “Friends” episode, students and educators say that the show, still seen widely in syndication around the world, is a surprisingly effective resource for learning English. https://t.co/pkMGkWOfgY",
  "data/tweet-nytimes/2021/5/1398747806756704257.json": "Chelsea beat Manchester City, 1-0, to win the Champions League final matching two of the richest and talented teams in England’s Premier League. #UCLFinal https://t.co/Dmfo0X12Jf",
  "data/tweet-nytimes/2021/5/1398730898837839874.json": "A century ago, a prosperous Black neighborhood perished in the Tulsa Race Massacre at the hands of a white mob. Hundreds were killed. Buildings burned. Years of Black success were erased. We recreated the neighborhood in 3D to show what was lost. https://t.co/AwnX8lGwoZ https://t.co/OnS4TkdDkj",
  "data/tweet-nytimes/2021/5/1398771154534506497.json": "Faye Schulman was spared by German officers on the condition that she would photograph them. She would ultimately use those photographs against them as proof of their barbarity. She was believed to be 101 when she died in April. https://t.co/x01a12pX3X",
  "data/tweet-nytimes/2021/5/1398387361055232005.json": "Nikole Hannah-Jones, a New York Times journalist and a creator of the 1619 Project, has retained lawyers to represent her in a tenure dispute with the University of North Carolina. https://t.co/JDKfmesrQn",
  "data/tweet-nytimes/2021/5/1398680566753603585.json": "In Opinion\n\n@rgay writes police officers “aren’t actually being rejected; they are being asked to respect boundaries. LGBTQ officers are more than welcome to join Pride celebrations — unarmed and in civilian clothing.\" https://t.co/gNmlfrq6wd",
  "data/tweet-nytimes/2021/5/1398760084482793476.json": "We have just never seen anything like this,\" said Sara Nelson, the international president of the Association of Flight Attendants. \"We’ve never seen it so bad.”  https://t.co/P3pHzlzsOD",
  "data/tweet-nytimes/2021/5/1398755380470108165.json": "Gavin MacLeod, who played Murray Slaughter on “The Mary Tyler Moore Show” and Capt. Merrill Stubing on “The Love Boat,” is dead at 90. https://t.co/fvAeg7PpmZ",
  "data/tweet-nytimes/2021/5/1398685587675168774.json": "Saturday will bring New Yorkers their first shot at “the best sunset picture of the year,” known as Manhattanhenge, when the sunset aligns perfectly with the borough's street grid. https://t.co/r65D4zT19X",
  "data/tweet-nytimes/2021/5/1398991703105736708.json": "Genevieve Kingston’s mother died of cancer when she was 11. But before she died, she packed presents and letters for the milestones of her daughter’s life she would miss — driver’s license, graduation and every birthday until the age of 30. https://t.co/j9C8tWdEuI https://t.co/EaPRoFeIJp",
  "data/tweet-nytimes/2021/5/1399017788686188548.json": "The tragic death of six-year-old Nahla al-Othman, who spent her final years in a camp for displaced Syrians, has drawn rare attention to the suffering of millions of children affected by the war in their home country. https://t.co/vdiH4KX7P7",
  "data/tweet-nytimes/2021/5/1398705722100232195.json": "In Opinion\n\n\"They got what they wanted,\" former NYPD and LAPD commissioner Bill Bratton tells @MaureenDowd. \"They defunded the police. What do they get? Rising crime, cops leaving in droves, difficulty recruiting.\" https://t.co/AKmp2yeIIQ",
  "data/tweet-nytimes/2021/5/1399083208839475202.json": "When the FDA paused the use of Johnson &amp; Johnson's coronavirus vaccine to explore the risk of clots, the decision stoked anger in many women — because most contraceptives available to women are much riskier, yet safer alternatives aren't available. https://t.co/bWMENjviuG",
  "data/tweet-nytimes/2021/5/1399012739746570246.json": "A hat store in Nashville came under fire for selling “not vaccinated” Star of David patches and comparing vaccine passports to the Nazi practice of requesting “your papers.\" https://t.co/WaUbNCtf6X",
  "data/tweet-nytimes/2021/5/1399143596893392900.json": "For the first time, humpback whales were heard singing in waters off New York. Listen to how they sound. https://t.co/6f2u7apxTx",
  "data/tweet-nytimes/2021/5/1399108391549779973.json": "In Opinion\n\n\"If the mission of these aliens calls for stealth, they seem surprisingly incompetent,\" Adam Frank, a professor of astrophysics, writes. https://t.co/yoYX2pwgtC",
  "data/tweet-nytimes/2021/5/1399219184660254721.json": "Breaking News: Democrats prevented Texas Republicans from passing a major bill to restrict voting. But a special session could be called to restart the process. https://t.co/oICwmK908g",
  "data/tweet-nytimes/2021/5/1399050479120916482.json": "Naomi Osaka won her opening match at the #FrenchOpen, but was warned that she risked escalating penalties, including default, if she failed to fulfill her media obligations. https://t.co/qMSJrvbMYU",
  "data/tweet-nytimes/2021/5/1399214100786331649.json": "This classic street food, served throughout Mexico, is encountered often in open air markets, beaches and parks. The original is often made with tajín; this take uses a homemade chile-lime salt. https://t.co/KWgllHymCH",
  "data/tweet-nytimes/2021/5/1399078163796398089.json": "In Opinion\n\n\"Too many were hostile to the very idea that they should alter their behavior even in the smallest way for the sake of strangers,\" Margaret Renkl writes of Americans' response to the pandemic. https://t.co/iLDqyzlKF5",
  "data/tweet-nytimes/2021/5/1399272704616894465.json": "Breaking News: China announced that it would allow all families to have three children, ending a two-child policy that failed to boost declining birthrates. https://t.co/gotjGU3sh1",
  "data/tweet-nytimes/2021/5/1399334882950647809.json": "The Virginia Theological Seminary began giving cash payments to the descendants of Black Americans who were forced to work there during the time of slavery and Jim Crow.\n\nThe checks, about $2,100 this year, will come annually. https://t.co/BZ4UxaKYtQ",
  "data/tweet-nytimes/2021/5/1399327335342555138.json": "China announced that it would allow all families to have three children, ending a two-child policy that failed to boost declining birthrates. https://t.co/h1p8pm3Z90",
  "data/tweet-nytimes/2021/5/1399375126416740353.json": "When the FDA paused the use of Johnson &amp; Johnson's coronavirus vaccine to explore the risk of clots, the decision stoked anger in many women — because most contraceptives available to women are much riskier, yet safer alternatives aren't available. https://t.co/tEdOL73g5X",
  "data/tweet-nytimes/2021/5/1399426267783569411.json": "Breaking News: Naomi Osaka dropped out of the French Open one day after officials threatened to expel her from the season’s second Grand Slam tournament if she continued to refuse to attend news conferences after her matches. https://t.co/9dzlrIsSmq",
  "data/tweet-nytimes/2021/5/1399387712466063370.json": "President Biden plans to significantly expand legal immigration and make the process easier for applicants, according to documents obtained by The New York Times. The effort would undo much of Donald Trump’s immigration legacy. https://t.co/adxNidB44N",
  "data/tweet-nytimes/2021/5/1399331090742059008.json": "Democrats prevented Texas Republicans on Sunday from passing a major bill to restrict voting. But a special session could be called to restart the process. https://t.co/gH42Z7RoBs"
}