{
  "data/tweet-nytimes/2022/8/1553938991711490048.json": "Anatoly Chubais, who resigned as a top Kremlin adviser after Russia’s invasion of Ukraine, was hospitalized in a western European country in critical condition with the symptoms of a rare neurological disorder. He had grown numb in his hands and legs. https://t.co/mQ1f59t3Lk",
  "data/tweet-nytimes/2022/8/1554078266872528898.json": "Mark Finchem, a full-throated MAGA warrior, is a leading contender to be Arizona’s next secretary of state. He has said that he won’t concede if he loses. https://t.co/T7XeXsKLqP",
  "data/tweet-nytimes/2022/8/1554021656703733762.json": "The Biden administration is suing to block the publisher Penguin Random House from buying Simon &amp; Schuster.\n\n\"The more the big publishers consolidate, the harder it is for indie publishers to survive,\" the author Stephen King said. https://t.co/6Pz3KTlt1f",
  "data/tweet-nytimes/2022/8/1554143699696746496.json": "An expansive new study based on 21 billion Facebook connections — about 84% of U.S. adults aged 25 to 44 — has uncovered a key to reducing poverty: more friendships between the rich and poor. https://t.co/tkPwztnObQ https://t.co/Q18rvtPtk1",
  "data/tweet-nytimes/2022/8/1554216327795150848.json": "Breaking News: The first defendant to go on trial in the Justice Department’s Capitol riot inquiry was sentenced to more than seven years in prison. https://t.co/d8SkUGhTqG",
  "data/tweet-nytimes/2022/8/1554225488234774528.json": "Breaking News: The top leader of Al Qaeda, Ayman al-Zawahri, was killed by a U.S. drone strike in Afghanistan over the weekend, officials said. https://t.co/8F1j0HjTEE",
  "data/tweet-nytimes/2022/8/1554234280984956949.json": "Ayman al-Zawahri, who took over the leadership of Al Qaeda after the death of Osama bin Laden, was killed in the U.S. drone strike, the first attack in Afghanistan since American forces left last year. https://t.co/2BF6BSaKpy https://t.co/iw0IGaGW5V",
  "data/tweet-nytimes/2022/8/1554248126713794563.json": "Ayman al-Zawahri, who took over Al Qaeda after the death of Osama bin Laden, was killed in the U.S. drone strike. Zawahri was the No. 2 in Al Qaeda on Sept. 11, and American officials considered him a central plotter of the attacks. \n\nFollow live updates: https://t.co/xrZO8TujRC",
  "data/tweet-nytimes/2022/8/1554301007672360961.json": "Two House Democrats called for officials at the Department of Homeland Security’s independent watchdog to testify to Congress about the agency’s handling of missing Secret Service text messages from Jan. 6, accusing their office of engaging in a cover-up. https://t.co/4MDC4QNCvg",
  "data/tweet-nytimes/2022/8/1554329834641408000.json": "California declared a state of emergency to address a monkeypox outbreak, elevating its public health response to the rapidly spreading disease.\n\nThree states have now issued emergency declarations in the past week, as have New York City and San Francisco. https://t.co/Q4fjodbcI6",
  "data/tweet-nytimes/2022/8/1554311046860619776.json": "Accusations that hundreds of ballots were cast in Arizona in 2020 in the name of dead voters are unfounded, the state’s Republican attorney general said in a letter to the president of the Arizona Senate, who has advanced false claims of voter fraud. https://t.co/H84LWq3ESJ",
  "data/tweet-nytimes/2022/8/1553914681374507009.json": "Tamil Nadu was not the first state in India to try to curtail plastic pollution, but it was relentless in enforcing its law. Now, it offers lessons for the rest of India, where an ambitious countrywide ban on some single-use plastic took effect this month. https://t.co/aiHpCBBQzz",
  "data/tweet-nytimes/2022/8/1554457009646346240.json": "Speaker Nancy Pelosi is expected to arrive in Taiwan on Tuesday. The trip, the highest-level U.S. visit to the island since 1997, would set up a tense standoff with China that could lead to more aggressive military posturing.\n \nFollow live updates. https://t.co/INTtrkxKFJ",
  "data/tweet-nytimes/2022/8/1554454720126898177.json": "“No matter how long it takes, no matter where you hide, if you are a threat to our people, the United States will find you and take you out,” President Biden said moments after announcing that a drone strike had killed Ayman al-Zawahri, Al Qaeda’s leader. https://t.co/Xvq90SHNSC https://t.co/Tr8a86L9rL",
  "data/tweet-nytimes/2022/8/1554480882081316864.json": "Breaking News: Speaker Nancy Pelosi arrived in Taiwan, marking the highest-level visit by a U.S. official in 25 years amid strong warnings from Beijing. Follow live updates. https://t.co/uEdi2Wq8Ra",
  "data/tweet-nytimes/2022/8/1554512397016207370.json": "Speaker Nancy Pelosi has arrived in Taiwan, making the highest-level visit by a U.S. official in 25 years. The trip sets up a standoff with China, which claims Taiwan, a democracy, as its territory and has vowed to take it back, by force if necessary. https://t.co/mCzEWTRXHz https://t.co/6hrV8Pg6K0",
  "data/tweet-nytimes/2022/8/1554514980107681795.json": "Speaker Nancy Pelosi has arrived in Taiwan. It's the highest-level visit to the island by a U.S. official in 25 years and has prompted a sharp response from China.\n\nHere’s what you need to know about why China has so vigorously protested Pelosi’s trip. https://t.co/XcR1EdxGTy https://t.co/2h9By549YD",
  "data/tweet-nytimes/2022/8/1554519925489811456.json": "Over two dozen Republican senators issued a joint statement on Tuesday in support of Speaker Nancy Pelosi’s visit to Taiwan. https://t.co/qHiYm2qYCt",
  "data/tweet-nytimes/2022/8/1554485953204469761.json": "Hundreds of airstrips have been illegally and secretly built on protected lands in Brazil to fuel the criminal mining industry, a New York Times investigation has found. https://t.co/J35Nc53u3j",
  "data/tweet-nytimes/2022/8/1554528972607832064.json": "Donald Trump will face questions under oath as he and Ivanka Trump are set to be questioned this month by the New York State attorney general's office in an investigation that may affect his real estate business' future. https://t.co/4EvVmRua0u",
  "data/tweet-nytimes/2022/8/1554542577621278727.json": "Speaker Nancy Pelosi's visit to Taiwan is her latest clash in her three-decade career of challenging the Chinese government. It was an example of the most powerful woman in Washington not shying away from a fight if she considers it worthy. https://t.co/1O0o5P7f8J",
  "data/tweet-nytimes/2022/8/1554197799339806730.json": "Maryland's Republican governor condemned his own party’s far-right nominee for state attorney general for previously promoting a conspiracy theory about the Sept. 11 attacks, accusing the candidate of \"blaming our country for Al Qaeda’s atrocities.\" https://t.co/DM58iLt5Fu",
  "data/tweet-nytimes/2022/8/1554543766056435712.json": "Breaking News: The Justice Department sued Idaho over a law the agency said would inhibit ER doctors from performing abortions that are necessary to stabilize the health of a patient. https://t.co/yz1A6FzmEq",
  "data/tweet-nytimes/2022/8/1554545085706113026.json": "With four store-bought ingredients, you can make an ice cream cake that’s creamy, crunchy and fudgy in every bite. https://t.co/wMLNnwkp5T https://t.co/XA0bCG7gNF",
  "data/tweet-nytimes/2022/8/1554402917364502530.json": "The U.S. will send another $550 million in arms to Ukraine, the White House announced, increasing the total American investment in war fighting there to more than $8 billion since Russia’s invasion began. https://t.co/RIdN6hZDA2",
  "data/tweet-nytimes/2022/8/1554660858130825220.json": "Breaking News: Kansans rejected an amendment removing the right to abortion from the State Constitution, a backlash to the end of Roe v. Wade. https://t.co/yp1vmo2lDZ",
  "data/tweet-nytimes/2022/8/1554620572843245569.json": "Breaking News: The Senate passed a bill to expand benefits to roughly 3.5 million veterans who may have been exposed to toxins from burn pits on military bases.\nhttps://t.co/ydg8OGl2eL",
  "data/tweet-nytimes/2022/8/1554560183090675712.json": "Helicopter rescue teams evacuated people from rooftops during deadly floods in Kentucky’s southeast. Hundreds of people are displaced from their homes, and the death toll of 37 is expected to climb. https://t.co/MKVOXoIFsP https://t.co/TOlLTZ8Y90",
  "data/tweet-nytimes/2022/8/1554669901805142016.json": "Speaker Nancy Pelosi has met with Taiwan’s president, Tsai Ing-wen.\n\nPelosi called Taiwan \"among the freest societies in the world.\" Her trip is taking place against the backdrop of heated warnings from China, which claims Taiwan as its territory. https://t.co/6PrFOseKAz https://t.co/QaFiICFUh8",
  "data/tweet-nytimes/2022/8/1554499798996221960.json": "The U.S. would be much closer to its goal of cutting global warming pollution in half by 2030 under a major climate and energy package that Senate Democrats announced last week, several independent analyses say.\n\nHere's a look at how emissions could fall. https://t.co/DyqvFGw4eR https://t.co/UMYqEX4XTX",
  "data/tweet-nytimes/2022/8/1554686813293486082.json": "Katie Hobbs, who defended Arizona’s 2020 election results against Republican attempts to overturn the outcome, won the Democratic primary for governor, The AP reported. She will face the Republican primary winner, either Kari Lake or Karrin Taylor Robson. https://t.co/5fDbDvsTT6",
  "data/tweet-nytimes/2022/8/1554723764448919552.json": "Abortion rights supporters won a huge victory in Kansas, one of the most conservative U.S. states, with voters rejecting a constitutional amendment that would have let legislators ban or significantly restrict abortion.\n\nHere's a look at what happened. https://t.co/84946JThax",
  "data/tweet-nytimes/2022/8/1554682391247167490.json": "Breaking News: A federal grand jury has subpoenaed Pat Cipollone, the Trump White House counsel who tried to stop extreme efforts to overturn the 2020 election. https://t.co/6k4Kt6HnLZ",
  "data/tweet-nytimes/2022/8/1554674759383793665.json": "Breaking News: Vin Scully, the voice of Dodgers baseball games for 67 summers in Brooklyn and then Los Angeles, has died at 94. https://t.co/tno4XcR96O",
  "data/tweet-nytimes/2022/8/1554799317394853889.json": "Abortion rights supporters won a huge victory in Kansas, one of the most conservative U.S. states, with voters rejecting a constitutional amendment that would have let legislators ban or significantly restrict abortion.\n\nHere's a look at what happened. https://t.co/5bBVjOcAOS",
  "data/tweet-nytimes/2022/8/1554744003287044097.json": "China’s military has said it would conduct a series of live-fire drills circling Taiwan beginning on Thursday, a day after Speaker Nancy Pelosi departs.\n\nHere's a look at where China plans military exercises.\nhttps://t.co/nE3meIiydo https://t.co/eDnYYmmyTZ",
  "data/tweet-nytimes/2022/8/1554833006715514886.json": "“My state just showed up and boldly told me that they are going to take care of me.”\n\nVoters in Kansas resoundingly decided against removing the right to abortion from the State Constitution.\nhttps://t.co/oGSCLveciA https://t.co/RvNa4W7s2u",
  "data/tweet-nytimes/2022/8/1554580319554224130.json": "The author Stephen King testified in a suit filed by the Justice Department to block Penguin Random House from buying Simon &amp; Schuster, saying the merger of two of the U.S.’s largest publishers would make it harder for writers to earn a living. https://t.co/oUbpqaYaBB",
  "data/tweet-nytimes/2022/8/1554441905643085825.json": "Access to the world’s tallest living tree, a California redwood known as Hyperion, has been closed off by the National Park Service after visitors left behind garbage and human waste. Those who get too close could face time in jail and a $5,000 fine. https://t.co/OddiwOAbs8",
  "data/tweet-nytimes/2022/8/1554795241630310403.json": "“America’s determination to preserve democracy here in Taiwan and around the world remains ironclad,” Speaker Nancy Pelosi said during her trip to Taiwan, which took place amid heightened tensions with China.\n\nFollow our updates.\nhttps://t.co/JHI1yafM4L https://t.co/wjIN6XNWzT",
  "data/tweet-nytimes/2022/8/1554625642108538882.json": "Two Republicans involved in Donald Trump’s effort to falsely claim he had won Arizona told lawyers that they feared their actions could be seen as treason. https://t.co/gnFvEmabgI https://t.co/Lkle9N7U89",
  "data/tweet-nytimes/2022/8/1554787948192829440.json": "In Opinion\n\n“Taiwan will not be more secure or more prosperous as a result of this purely symbolic visit, and a lot of bad things could happen,” Thomas Friedman writes of Speaker Nancy Pelosi’s trip to Taiwan.\nhttps://t.co/9wgYEEjqnR",
  "data/tweet-nytimes/2022/8/1554557679011565568.json": "Shortly after Speaker Nancy Pelosi’s plane touched down in Taiwan, China’s military said it would conduct drills that appeared to infringe on Taiwan’s territorial waters, setting the stage for a new potential showdown between China and the U.S.\nhttps://t.co/y3Pwssxo5J",
  "data/tweet-nytimes/2022/8/1554940688416051200.json": "Alex Jones's text messages — which showed he withheld evidence — were read to him in a brutal cross-examination on Wednesday after his lawyers apparently mistakenly sent them to a lawyer for Sandy Hook parents. \"Do you know what perjury is?\" he was asked. https://t.co/wIznbLEKYq",
  "data/tweet-nytimes/2022/8/1554922565919031299.json": "Iced Einspänner: your new favorite way to do iced coffee. https://t.co/gE12cToY5F https://t.co/onOdlPU6x4",
  "data/tweet-nytimes/2022/8/1554956545917607936.json": "Breaking News: The U.S. supply of the monkeypox vaccine will be limited for months after officials waited too long to ask the maker to process enough vials. https://t.co/XqsBMKg6EJ",
  "data/tweet-nytimes/2022/8/1555003128709251073.json": "Senator Richard Durbin, the chairman of the Judiciary Committee, called for an inspector general investigation into missing text messages from top Defense Department officials in the Trump administration related to the Jan. 6 attack on the U.S. Capitol. https://t.co/DVyiJnKgXD",
  "data/tweet-nytimes/2022/8/1554982987921592331.json": "The Senate overwhelmingly voted to add Finland and Sweden to NATO, setting up one of the alliance’s most significant expansions in decades in the face of Russia’s continued assault on Ukraine. https://t.co/V6yrCJnhNh https://t.co/UQfSi9Jq3Q",
  "data/tweet-nytimes/2022/8/1554882308133502981.json": "Alex Jones has regularly berated Sandy Hook families on the air, but rarely appears in the same room as them. On Tuesday, a mom who lost her 6-year-old in the shooting spoke to Jones directly, fixing her gaze on him in a searing face-to-face confrontation. https://t.co/2vRfufoCcv https://t.co/0fkNMxAzta",
  "data/tweet-nytimes/2022/8/1554854486476210178.json": "The pigs were dead. Then researchers pumped a custom chemical into them. What followed raises questions about what science considers death. https://t.co/ZajCQqlyrz",
  "data/tweet-nytimes/2022/8/1554889901061165058.json": "Crunchy cucumbers and creamy avocados are the stars of this simple five-ingredient salad. https://t.co/cBMYECpIja https://t.co/xRaDuv9QwR",
  "data/tweet-nytimes/2022/8/1555208535746674688.json": "Breaking News: Brittney Griner has been found guilty by a Russian court of an attempt to smuggle illegal narcotics into the country, according to her lawyers. https://t.co/PpseIxClgp",
  "data/tweet-nytimes/2022/8/1555218160692994048.json": "Breaking News: The U.S. charged four police officers in the raid that killed Breonna Taylor in Louisville, Kentucky. The charges include lying on the warrant that was used to search her home. https://t.co/YPOu85Da6o",
  "data/tweet-nytimes/2022/8/1555217057515536384.json": "Breaking News: Brittney Griner has been sentenced to nine years in a penal colony by a Russian court. Her defense team called the verdict \"absolutely unreasonable\" and said they \"will certainly file an appeal.\" https://t.co/FDKEbLKbLJ",
  "data/tweet-nytimes/2022/8/1554831971594842116.json": "The first Ukrainian ship to carry grain through Russia’s blockade of the Black Sea was cleared to sail to Lebanon, in what the UN called a “proof of concept” of a deal to free 20 million tons of grain trapped in a war zone.\nhttps://t.co/6o8KqlZfBe",
  "data/tweet-nytimes/2022/8/1555219904118284294.json": "Breaking News: Merrick Garland, the U.S. attorney general, said federal prosecutors believe the officers \"violated federal civil rights laws, and that those violations resulted in Ms. Taylor’s death.\" https://t.co/FXON9NYslr https://t.co/TRy7ASCVoE",
  "data/tweet-nytimes/2022/8/1555033300498104322.json": "The victory for abortion rights in Kansas relied on a coalition of voters who turned out in huge numbers and crashed through party and geographic lines to maintain abortion access in the state. The result was an election with a stunning 18-point margin. https://t.co/zNeab7n6pV",
  "data/tweet-nytimes/2022/8/1554907480773332994.json": "Speaker Nancy Pelosi on Wednesday in Taiwan met with activists who have spoken out against China, including a former Tiananmen protest student leader, a former political prisoner in China, a Tibetan activist and a Hong Kong bookseller. https://t.co/KJ3EoYETCt",
  "data/tweet-nytimes/2022/8/1555168432869490688.json": "Thousands of migrants have been arriving in Washington, D.C., on buses sent by the governors of Texas and Arizona. With nonprofits and volunteer groups overwhelmed, many have ended up in homeless shelters and on the streets. https://t.co/AN2iRCje1M",
  "data/tweet-nytimes/2022/8/1555258242653118464.json": "The lawyer representing Sandy Hook parents in Alex Jones's defamation trial said he plans to turn over Jones's texts to the Jan. 6 committee, which has been pushing to obtain them for months to understand his role in organizing the rally before the attack. https://t.co/d6EC1RhyTZ",
  "data/tweet-nytimes/2022/8/1555256035358679040.json": "Before her sentencing in a Moscow courtroom, Brittney Griner said she had made an \"honest mistake\" in bringing hashish oil into Russia. \n\nShe was sentenced to nine years in a penal colony. https://t.co/GXr3VWeNcG https://t.co/NeC2enSd0s",
  "data/tweet-nytimes/2022/8/1555276788938555395.json": "The U.S. charged four police officers in the raid that killed Breonna Taylor in Louisville, Kentucky. The charges include lying on the warrant that was used to search her home. https://t.co/6f3VXw1xMm https://t.co/DDfP0douPd"
}