{
  "data/tweet-nytimes/2022/4/1509687016732123140.json": "President Biden announced on Thursday that the U.S. would release up to 180 million barrels of oil from a strategic reserve to counteract the economic impact of Russia’s invasion of Ukraine.\nhttps://t.co/86ha1QTWVn https://t.co/ZDxwm36APQ",
  "data/tweet-nytimes/2022/4/1509712169058897924.json": "A bill to limit the cost of insulin to $35 a month for most Americans who depend on it passed the House on Thursday. To become law, the bill will need to attract at least 10 Republican votes in the Senate to overcome a filibuster. https://t.co/E0FkuiRN6P",
  "data/tweet-nytimes/2022/4/1509694552986300421.json": "A law keeps personal census data secret for 72 years. The 1950 census goes public on Friday, a bonanza for historians and the merely curious. https://t.co/rLCkybleho",
  "data/tweet-nytimes/2022/4/1509727310710284296.json": "Russia is running its military campaign against Ukraine out of Moscow, with no central war commander on the ground to call the shots, according to American officials who have studied the five-week-old war. https://t.co/SPNJJZsCh2",
  "data/tweet-nytimes/2022/4/1509799241937723398.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/4prgyfysgf",
  "data/tweet-nytimes/2022/4/1509855670782283779.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/ZMPpOhC3OL https://t.co/XjNMQCiXmi",
  "data/tweet-nytimes/2022/4/1509852093439426565.json": "The U.S. Navy will name a new ship after the late Supreme Court Justice Ruth Bader Ginsburg.\n\nThe ship will join a class of vessels named after those who have fought for civil and human rights, including Harvey Milk, Robert F. Kennedy and Sojourner Truth.\nhttps://t.co/T1RDtIUw7w"
}