{
  "data/tweet-crypto/2021/3/1366438743545118729.json": "Bitcoin: In my view, bitcoin has evolved to the point that it could be treated as a form of digital gold…a possible counterweight to future monetary inflation. My current take on the cryptocurrency, here: https://t.co/Ud6GrBpIp2",
  "data/tweet-crypto/2021/3/1366669129667796999.json": ".@100trillionUSD released this model two years ago. Even after everything that has happened in bitcoin and the world over the last two years, the bitcoin market price has never diverged more than 1 standard deviation from the model's predicted price. https://t.co/0eH09v2hg2",
  "data/tweet-crypto/2021/3/1367025767184551936.json": "Chart: The increase in Bitcoin users visible on its blockchain per day.\n\nRetail investors arrived in Jan.\n\nLike prior cycles, I expect this peak to top out higher than the ones before it.\n\nGives you an idea how this bull market is just warming up. \n\nData: @glassnode https://t.co/csGLp9sLze",
  "data/tweet-crypto/2021/3/1367399724823805956.json": "An excellent and inspiring introduction to, and reminder of, #Bitcoin's value to the world, all through a comprehensive and historical lens on money. https://t.co/7XsLye608n",
  "data/tweet-crypto/2021/3/1368256778195116036.json": "*BIDEN'S $1.9 TRILLION STIMULUS BILL PASSED BY U.S. SENATE",
  "data/tweet-crypto/2021/3/1368526393584279553.json": "The \"halvings cause BTC price rises\" theory is unfalsifiable:\n\nWas the peak before the halving? Then it \"rose in anticipation of the halving\"\nDuring? \"Because of the halving\"\nAfter? \"Because of...\"\n\nThe last $20k peak was near the halfway point between the 2016 and 2020 halvings. https://t.co/dhVxhmECQS",
  "data/tweet-crypto/2021/3/1368950563300343809.json": "Institutional funds are now flowing into #Bitcoin at an accelerated rate via private equity, public equity, public debt, direct purchases of the commodity, &amp; commodity futures.  Insurance firms have crossed $1 billion in exposure with @NYDIG_BTC.\n\nhttps://t.co/NNl9nywu3I",
  "data/tweet-crypto/2021/3/1368951052133928962.json": "\"use BTC as treasury asset &amp; join the community. In Bitcoin speak we will be hodlers\" Norwegian billionaire Kjell Inge Roekke chairman &amp; majority owner of Aker said in shareholder letter https://t.co/asFgBs8cIJ Canada’s @Blockstream for work on bitcoin mining &amp; sidechain projects",
  "data/tweet-crypto/2021/3/1369241888948125702.json": "New edition of the Rekt Capital newsletter is live 🔥\n\n\"Stock To Flow Deviations\"\n\nI examine Bitcoin's historical price deviations beyond the S2F to better understand where #BTC could peak\n\nThis edition is free for everybody to read\n\n$BTC #Bitcoin \n\nhttps://t.co/HDaIVrV3cP",
  "data/tweet-crypto/2021/3/1369640655664857099.json": "👥 @jack (CEO of Twitter and Square) is now following @100trillionUSD",
  "data/tweet-crypto/2021/3/1369563047212150785.json": "Ditto. My account was suspended for ~6 hrs.\n\nI went through the process mentioning @100trillionUSD was taken down also and this was the email response they gave when they reactivated.\n\nLet's hope at least the scam accounts get under control. https://t.co/sW1BHkxXmN https://t.co/JGeVPaCnDN",
  "data/tweet-crypto/2021/3/1372108408673951745.json": "The bitcoin price chart on a log scale is one of the most astounding things I have ever seen.\n\n12+ years of being a monetary metronome. https://t.co/TARoGOWE54",
  "data/tweet-crypto/2021/3/1372282002699911169.json": "NYDIG is proud to partner with Morgan Stanley, the first US bank to offer access to #Bitcoin for their wealth management clients. https://t.co/Xq9ZjQ2yjn",
  "data/tweet-crypto/2021/3/1372473938979254272.json": "#Bitcoin after the Halving\nMar. 17, 2021\n\n309 days after the 3rd halving.\n#BTC at $55,297.\n\nThere is no particular reason for the growth trajectory to follow the average line. \n\nThe only thing that matters is that the growth continues to be exponential. https://t.co/cEWUJTaPnq",
  "data/tweet-crypto/2021/3/1372558240232390662.json": "\"It was 1500-something when Copernicus said we may be revolving around the sun. Things do change,\" says @Scaramucci on #bitcoin #btc. \"In a lot of ways if you really study it, it's better than gold. It's easier to store. You can move it around more quickly.\" https://t.co/X7vfu1A9eU",
  "data/tweet-crypto/2021/3/1373328183114792978.json": "[NEW POST] Bitcoin's Information Insurgency\n\n\"The memes are the message. You are watching information warfare conducted in a way that can’t be responded to by the elite and the establishment.\"\n\nhttps://t.co/wE4WVGwAwN",
  "data/tweet-crypto/2021/3/1374008678907584517.json": "FED'S POWELL: CRYPTO ASSETS MORE LIKE GOLD THAN THE DOLLAR",
  "data/tweet-crypto/2021/3/1374642858502807555.json": "It is almost like having 100% certainty on one side of a supply-demand equation could make you deadly accurate in predicting the future 😉 @100trillionUSD https://t.co/iFsg1weF6p",
  "data/tweet-crypto/2021/3/1374640569499185153.json": "Tesla is using only internal &amp; open source software &amp; operates Bitcoin nodes directly.\n\nBitcoin paid to Tesla will be retained as Bitcoin, not converted to fiat currency.",
  "data/tweet-crypto/2021/3/1374640389081169921.json": "Pay by Bitcoin capability available outside US later this year",
  "data/tweet-crypto/2021/3/1374640309376843777.json": "You can now buy a Tesla with Bitcoin",
  "data/tweet-crypto/2021/3/1376088694877216778.json": "The US government will never ban #bitcoin. These questions have been asked and answered by regulators and courts for the last decade. This ship has sailed.",
  "data/tweet-crypto/2021/3/1376285718704705541.json": "BNY Mellon, the largest custodian bank in the world, just cited work by @100trillionUSD, @hasufl, and @nic__carter in their latest research report on #Bitcoin https://t.co/FrvByStES7",
  "data/tweet-crypto/2021/3/1376281328266674178.json": "BIDEN TO ROLL OUT ANOTHER COVID STIMULUS RELIEF BILL IN APRIL, SEPARATE FROM INFRASTRUCTURE PLAN: PSAKI",
  "data/tweet-crypto/2021/3/1376300840311525379.json": "#bitcoin linear scale by epoch - Each epoch scale is 20x the prior one\n\n1st draft - feedback welcome https://t.co/Bu5i8Z3QIr",
  "data/tweet-crypto/2021/3/1376282089247621120.json": "The New Zealand Pension Fund announced a $ 17.5 million #bitcoin (BTC) investment in October https://t.co/eVYBOqWgvz",
  "data/tweet-crypto/2021/3/1376609015216635906.json": "My confidence in 2019 published S2F model and 2020 S2FX model is high. It is based on S2F(X) performance &amp; track record. And also on confirmation by my other (unpublished) on-chain model. This model counts specific transactions and recognizes bull/bear markets (green started Dec) https://t.co/fy8VjJPUE1",
  "data/tweet-crypto/2021/3/1376591377551785988.json": "BNY Mellon just issued a report comparing Bitcoin to gold. \n\nThe best part... \n\nThey highlighted @100trillionUSD's stock-to-flow model as key to their predictions.\n\nhttps://t.co/1FRLJlfzi7",
  "data/tweet-crypto/2021/3/1376799394096418817.json": "We're overdue on approving a #Bitcoin ETF.  \n- SEC Commissioner, Hester Peirce",
  "data/tweet-crypto/2021/3/1376801712556638209.json": "Important to keep in mind:\n\nBitcoin's Proof-of-Work was invented to escape Proof-of-Stake financial systems, where the largest asset owners can unduly influence the rules of the game.\n\nThanks to PoW + full nodes, neither miners nor the biggest BTC hodlers can change the protocol.",
  "data/tweet-crypto/2021/3/1376839252500221952.json": "Exclusive: PayPal launches crypto checkout service, a move that could significantly boost use of digital assets in everyday commerce https://t.co/M0NW57I5Th by @annairrera",
  "data/tweet-crypto/2021/3/1376998872032116740.json": "KYC is short for \"divulging your holdings and personal information to any and all criminals who take interest in the inevitable leak of the database that information is stored in\".",
  "data/tweet-crypto/2021/3/1377196658090459136.json": "The biggest experiment in monetary history is being continued. What we are looking for is the point at which confidence in the #ECB collapses because they overstretch their balance sheet. Total assets now account for &gt;75% of the #Eurozone's GDP. https://t.co/oRYXVZFqhc",
  "data/tweet-crypto/2021/3/1377240885189033987.json": "BREAKING: $GS will begin offering #bitcoin and other digital assets related investments to its private wealth management clients in the second quarter, @hugh_son reports: https://t.co/kgStpd9lFm"
}