{
  "data/tweet-wsj/2022/4/1509685737498755081.json": "A former coal company executive from Knoxville, Tenn., was arrested Thursday for his role in an alleged scheme to bribe government officials in Egypt in exchange for contracts with a state-owned company, U.S. prosecutors said https://t.co/zEtAQIoz9E",
  "data/tweet-wsj/2022/4/1509682054476222466.json": "Before The Weeknd became famous, he rented a one-bedroom with friends. Now he owns a portfolio of properties, including a swanky Bel-Air mansion he purchased for $69 million last year. https://t.co/Pdcnad31zS",
  "data/tweet-wsj/2022/4/1509723497962123276.json": "Day after day, Russian forces bombed the city of Mariupol. Hundreds of Ukrainians hid inside a theater where one couple took charge of keeping everyone alive. https://t.co/wxQiiAvNYx",
  "data/tweet-wsj/2022/4/1509708409154772994.json": "Political freedoms and the rule of law have continued to deteriorate in Hong Kong over the past year, threatening American interests and Hong Kong’s autonomy, a State Department report says https://t.co/Khq78QATZn",
  "data/tweet-wsj/2022/4/1509700868832116736.json": "“Party on the bottom, business on the top.”  Employees returning to the office are coming up with new dress codes. https://t.co/vVOw6fiuNo",
  "data/tweet-wsj/2022/4/1509697127877853191.json": "From @WSJopinion: There is hope amid the heartbreaking carnage in Ukraine that one nation’s valiant struggle for survival may bring a rules-based world order closer to realization, writes @JoshuaMuravchik\nhttps://t.co/xpRCp0O4lA",
  "data/tweet-wsj/2022/4/1509712188948287493.json": "The Razzie Awards, a satirical awards organization that recognizes actors and movies for subpar work, rescinded a worst-performance award it gave to Bruce Willis after the actor’s family said he suffers from aphasia https://t.co/uLSSQ6Xejm",
  "data/tweet-wsj/2022/4/1509740152666697744.json": "A Ukrainian mother fled Syria's war with her baby boy in her arms. A decade later, her 11-year-old son escaped Ukraine alone: “I had already given up on myself, but I wanted him to live.” https://t.co/TOBLhaKIGU",
  "data/tweet-wsj/2022/4/1509743636338122752.json": "Washington Gov. Jay Inslee has signed a bill creating the country's first statewide alert system for missing indigenous people https://t.co/JtIlkmXtyU",
  "data/tweet-wsj/2022/4/1509821638451380267.json": "Ukrainian attack helicopters executed a low-flying predawn raid on Russian territory, a Russian official said, signaling Kyiv’s ability to broaden the field of the war https://t.co/PAIBaH5BwV",
  "data/tweet-wsj/2022/4/1509855623697125384.json": "Russia’s army has suffered serious losses amid fierce Ukrainian resistance. A less visible failure to supply its troops has hobbled Moscow’s invasion plans, according to Western intelligence. https://t.co/TLXPDdVD4q",
  "data/tweet-wsj/2022/4/1509869475130232838.json": "Pope Francis asked forgiveness for the abuse of Canadian indigenous children at Catholic Church-run residential schools over more than a century. The is part of an extraordinarily elaborate gesture of penitence by the pope. https://t.co/p2CmSSlGL1",
  "data/tweet-wsj/2022/4/1509897155837898774.json": "Ukrainian President Volodymyr Zelensky stripped two generals of their rank for what he said was their failure to live up to their oath of allegiance. “I do not have time to deal with all the traitors. But gradually they will all be punished.” https://t.co/0OHoc1XjAj",
  "data/tweet-wsj/2022/4/1509836739942273026.json": "Russia’s factories cut production and jobs in March after the U.S. and its allies adopted economic sanctions over Moscow’s invasion of Ukraine  https://t.co/33ys35Go2s",
  "data/tweet-wsj/2022/4/1509900928266219549.json": "From @WSJopinion: Only Russians can remove Putin from power. That is why, in addition to supplying arms to Ukraine, the U.S. needs to take steps to reach the Russian people, writes @DavidSatter. https://t.co/GWYOq29jlV",
  "data/tweet-wsj/2022/4/1509916266051612673.json": "Moscow’s pivot from focusing on Kyiv and cities in the north to seizing parts of the country’s east is an indication of the effectiveness of Ukraine’s resistance and signals a Kremlin decision to pursue what is likely to become a prolonged war of attrition https://t.co/rhoHj56mQJ",
  "data/tweet-wsj/2022/4/1509934891353395205.json": "Amazon workers in New York voted to form a union. It's the first successful unionization effort by U.S. workers at the tech giant. https://t.co/OrH9t7xmlG",
  "data/tweet-wsj/2022/4/1509946351693484041.json": "Essay: Vladimir Putin made no secret of his obsession with Ukraine. It took decades for the West to realize how serious he was. https://t.co/gbINrvEaLk"
}