{
  "data/tweet-economist/2022/3/1498626733024727040.json": "Where in Russia do people oppose the war? I tracked the use of protest hashtag #нетвойнеI (\"no war\"), and found opposition in all of Russia’s 50 largest cities, in all 11 time zones and in 83 out of 85 federal subjects. https://t.co/OW0p1Ipo5b",
  "data/tweet-economist/2022/3/1499355491692158976.json": "I can’t tell you what is happening where there is fighting but my local supermarket has reopened after being closed for a week. Only a small queue. Importantly it has had deliveries including bread and milk! #Kyiv #Ukraine https://t.co/sXirFoA1HH",
  "data/tweet-economist/2022/3/1500431745329553412.json": "More Russians are asking Google “how to leave Russia” than have done so in the last 18 years since such data became public. We used search data from the country to track discontent: https://t.co/t99bflGx95",
  "data/tweet-economist/2022/3/1501233912361725955.json": "In honour of #IWD2022, I worked with @TheEconomist to invite four women to each contribute a guest essay on four issues deeply connected to girls’ education: conflict, climate, digital inclusion and discrimination.\n\nA thread on each incredible contributor and her piece👇🏽",
  "data/tweet-economist/2022/3/1501481953324904451.json": "We look at why Russia's air force has played more limited role than expected (though perhaps now growing). Air activity hard to track w/ open sources, but I cite @RALee85's remark: Rus failure to take out Ukr air defences one of \"key mistakes of this war\" https://t.co/pedGVuZRow",
  "data/tweet-economist/2022/3/1501981348030038017.json": ".@ArkadyOstrovsky &amp; me with one of this week's cover briefings in @TheEconomist: on the course of the Russia-Ukraine war and Russia's slide deeper into dictatorship\nhttps://t.co/IdFkhdUV7V",
  "data/tweet-economist/2022/3/1501980765445308423.json": "How much support does Russia have in Africa for its invasion of Ukraine? This was a question we tried to answer in @TheEconomist this week with the help of @premisedata \nIt turns out, quite a lot in Mali. Almost none in Nigeria or SA 1/\nhttps://t.co/rIoVkC0Ufe https://t.co/GKULLzJXD8",
  "data/tweet-economist/2022/3/1504512639820521472.json": "“No matter how the war unfolds, China will treat its relationship with the Kremlin as a means of boosting Chinese power, not Russia’s”—several of my colleagues explain how China thinks it can benefit from the Ukraine conflict \n https://t.co/z01fcfSqzX"
}