{
  "data/tweet-nytimes/2022/6/1531807477095972866.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/fCeia4GPZo",
  "data/tweet-nytimes/2022/6/1531790145955020806.json": "Rafael Nadal beat Novak Djokovic in four sets to reach the French Open semifinals in a thrilling addition to their long rivalry. https://t.co/qgwhrhBA8X",
  "data/tweet-nytimes/2022/6/1531788134341541889.json": "In Opinion\n\n\"America’s goal is straightforward,\" President Biden writes in a guest essay. \"We want to see a democratic, independent, sovereign and prosperous Ukraine with the means to deter and defend itself against further aggression.\" https://t.co/c2AM54y140",
  "data/tweet-nytimes/2022/6/1531832958994227201.json": "The Russian military, demoralized after three months of war, is still facing morale and other problems, seven weeks after the Kremlin sent a new commander to oversee a refocused invasion, American officials say. https://t.co/WICddQYBem",
  "data/tweet-nytimes/2022/6/1531945422129926145.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/4Jx0iqVPHE",
  "data/tweet-nytimes/2022/6/1531893389314121729.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/wTtbsQd3X4",
  "data/tweet-nytimes/2022/6/1532044326733328384.json": "Elon Musk told SpaceX and Tesla employees that they were required to “spend a minimum of 40 hours in the office per week.” Those who did not do so would be fired, he wrote in a memo. https://t.co/eOwVV5UIGp https://t.co/pHzcnIDHm1",
  "data/tweet-nytimes/2022/6/1532021676677922818.json": "The Russian journalist Dmitri Muratov — whose paper suspended publication in late March, saying Russia’s press laws made it impossible to truthfully cover the war in Ukraine — will be auctioning his Nobel Peace Prize medal to benefit Ukrainian refugees. https://t.co/VZCVkZxmz1",
  "data/tweet-nytimes/2022/6/1532055902555099138.json": "Breaking News: The verdict in the Johnny Depp-Amber Heard trial is expected to be announced soon. Follow our live coverage. https://t.co/p4jBMSQyXF",
  "data/tweet-nytimes/2022/6/1532059477066731520.json": "After winning the Nobel Peace Prize, the journalist Dmitri Muratov said he thought the honor should have gone to a different Russian: the jailed opposition leader Aleksei Navalny. Now, he will auction it to help children who are refugees from Ukraine.\nhttps://t.co/JMgo2mtnNm https://t.co/FtdmydqjwK",
  "data/tweet-nytimes/2022/6/1532086163078631436.json": "Breaking News: A jury found Johnny Depp was defamed by his ex-wife, Amber Heard, in a Washington Post essay in which she described herself as a “public figure representing domestic abuse.” Heard was defamed by one of Depp’s lawyers, the jury found. https://t.co/0hFmUqNVCF",
  "data/tweet-nytimes/2022/6/1532097935563005952.json": "A jury found that Johnny Depp was defamed by Amber Heard when she described herself in a Washington Post essay as a “public figure representing domestic abuse,” but also found that she had been defamed by one of his lawyers. Read the latest: https://t.co/Ri0SE1vBiT https://t.co/2G4m0iPIYP",
  "data/tweet-nytimes/2022/6/1532103478369300484.json": "Johnny Depp said the jury “gave me my life back.” Amber Heard said she’s “heartbroken.”\n\nGet the latest following the verdict, in which a jury found that Depp was defamed by Heard but also that she'd been defamed by one of his lawyers. https://t.co/vumYhF2P3M https://t.co/3rOeNa2KY8",
  "data/tweet-nytimes/2022/6/1532088674317484034.json": "Breaking News: Sheryl Sandberg, the chief operating officer of Meta and the second in command to Mark Zuckerberg, said she was stepping down after 14 years. https://t.co/XlAL6zpeWe",
  "data/tweet-nytimes/2022/6/1532134961339412480.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/zfs5ayvggf https://t.co/IIWD3S54gl",
  "data/tweet-nytimes/2022/6/1532093536631496709.json": "Breaking News: The man accused of the racist shooting at a Buffalo supermarket that left 10 Black residents dead was charged with a 25-count indictment, including murder charges as hate crimes and domestic terrorism. https://t.co/xGqoFpC7Jj",
  "data/tweet-nytimes/2022/6/1532140570461851648.json": "Breaking News: Multiple people were shot and some were killed at a medical building in Tulsa, Oklahoma, the police said. The gunman is also dead. https://t.co/FdK5vhHOFS",
  "data/tweet-nytimes/2022/6/1532150130241044481.json": "Breaking News: In its largest student loan forgiveness action ever, the U.S. Education Dept. will cancel $5.8 billion owed by students of Corinthian Colleges. https://t.co/S5MKUs6KIB",
  "data/tweet-nytimes/2022/6/1531995262935355392.json": "A woman who approached a bison at Yellowstone National Park was gored by the animal on Monday, according to park officials. Her condition was not released, and it was unclear whether she had survived. https://t.co/bHlV2l41zW"
}