{
  "data/tweet-crypto/2022/3/1498577211997270016.json": "The intrinsic value of #Bitcoin is now in full display on the whole world.",
  "data/tweet-crypto/2022/3/1498614152583127041.json": "BINANCE: We will not unilaterally freeze millions of innocent users’ accounts. 👏",
  "data/tweet-crypto/2022/3/1498722644384006144.json": "#Bitcoin hit fresh ATH measured in #Russia Ruble. https://t.co/tlEhXFYX7W",
  "data/tweet-crypto/2022/3/1498717047076929540.json": "Dr. Ryan Cole - Pathologist.\n\"I have a post-vaccine nine-year-old on my desk. Dead. I don't want to see one more child post-vaccine, ever, on my desk.\" https://t.co/6F8VecEwsn",
  "data/tweet-crypto/2022/3/1498767866937720835.json": "Lawmakers have removed the ‘#Bitcoin ban’ from latest version of EU’s crypto legislation.\n\nThe EU 🇪🇺 continues to embrace #bitcoin \n\nhttps://t.co/kNfTPcmKLX",
  "data/tweet-crypto/2022/3/1498788184213364736.json": "To summarize my chat with @cvpayne today:\n \n-#Bitcoin has defined rules but no rulers\n- Two systems are colliding, the old based on manipulation -- the new based on freedom and hope\n- People don't want war, they want economic opportunity\n- #Gold is old\n\nThanks for having me! https://t.co/ZrG7gmQsQK",
  "data/tweet-crypto/2022/3/1499377654365147138.json": "Are governments worldwide just going to ignore Pfizer's Adverse Events Review?🤔🤔",
  "data/tweet-crypto/2022/3/1499500331562061827.json": "Name this Bond movie https://t.co/WGkul675Xj",
  "data/tweet-crypto/2022/3/1499667534521548801.json": "[1/9] This is the untold and shocking story of Pfizer’s 12-to-15-year-old clinical trial. Just 2264 adolescents were randomised between October 2020 and January 2021. I will describe the various related, serious and life-threatening injuries sustained by these youngsters. https://t.co/z03rrp9umq",
  "data/tweet-crypto/2022/3/1500237107570384897.json": "Hate to say it, but we need to increase oil &amp; gas output immediately. \n\nExtraordinary times demand extraordinary measures.",
  "data/tweet-crypto/2022/3/1500236382756876295.json": "BREAKING NEWS: Dr. Malone calls out the CDC for scientific fraud and criminal activity for willfully withholding data that resulted in harm and death. The CDC is spreading medical misinformation. We are completely vindicated, they were hiding the data. \n https://t.co/XMcTz8qta6",
  "data/tweet-crypto/2022/3/1500234392685490176.json": "This clip is infuriating. It is an admission of public health malpractice by the @CDCDirector.  \n\nThe main clinical endpoint of the vaccine trials was symptomatic infection at 3-4 months post vax, not infection or disease transmission: \nhttps://t.co/xPFUOUc6Px\n[1/4] https://t.co/rf0d9ahAfT",
  "data/tweet-crypto/2022/3/1500394689974910980.json": "BREAKING: Visa and Mastercard dig their own graves by politicizing their products and pushing people all over the world toward bitcoin."
}