{
  "data/tweet-quora/2022/3/1498775952632922112.json": "It's Mardi Gras Day in New Orleans and we're missing the parades and the king cake. Anyone in New Orleans want to send us one? https://t.co/8ADohUNZ4a https://t.co/kLgwLTSRM2",
  "data/tweet-quora/2022/3/1498802557862301701.json": "What's it like in Kyiv right now? Find out from Yulia Ko, resident: https://t.co/ugXdnOXwcy",
  "data/tweet-quora/2022/3/1499074970600624130.json": "If Vladimir Putin went off the deep end and decided to unilaterally launch a nuclear strike on the United States, could he do it? Do the Russians have any system in place to prevent one unstable person from starting WW3? Andrey Yanovski explains: https://t.co/piPg4HfPDb",
  "data/tweet-quora/2022/3/1499190403781718016.json": "Does the west have a satellite with a weapon, such as a laser that can disable the Russian convoy? Bill Otto, engineer on the Space Based Laser project, explains: https://t.co/EH55WHBTS6",
  "data/tweet-quora/2022/3/1499777166812356619.json": "What are some ways to make friends and find a community as you age? Answer by Lawrence Kosick (@lawrencekosick), President and Co-Founder at GetSetUp. https://t.co/S1Rwj4VAbx https://t.co/Tkb2PcVJb0",
  "data/tweet-quora/2022/3/1499817382444867584.json": "Which warrior was the most dangerous in singles combat in the history of the world? https://t.co/4TjiircFO9 https://t.co/dSp1VAMIrQ",
  "data/tweet-quora/2022/3/1500139410465173504.json": "How can you use curiosity as a tool to improve your relationships at work? Katie McCleary, Co Founder: How to Bridge the Gap &amp; Podcast on NPR CapRadio, shares 3 ways. https://t.co/K4R62HbB2u https://t.co/DYM7VQiWxr",
  "data/tweet-quora/2022/3/1500501735323971588.json": "What are the best yoga exercises for anxiety? Arunima Singhdeo (@arunima), CEO at https://t.co/OznUabzWjG, gives expert advice. https://t.co/jtP38Gy85I https://t.co/99NQYjirqx",
  "data/tweet-quora/2022/3/1500607225882099722.json": "How can leaders break down initiatives into bite-sized milestones that can be built upon? Kian Gohar (@fromthekgb), CEO at Geolab, says, \"rather than getting lost in vague visions, the most successful teams identify short-term goals.\" Read his piece here: https://t.co/mLqLLe4N10 https://t.co/04KijDPh8Q",
  "data/tweet-quora/2022/3/1500864312860102662.json": "Ready for more behind-the-scenes movie secrets? Read this piece by @NorthwesternU film professor, Clayton Brown: How powerful is the cameraman in moviemaking? https://t.co/c5rUDZTm3E https://t.co/VslQqqYLr5",
  "data/tweet-quora/2022/3/1500897391053991936.json": "We have been wondering this, seeing all the Cyrillic script about lately. How similar are Russian and Ukrainian? Are they mutually intelligible or more like Spanish and Portuguese? https://t.co/dMPiMmza3p",
  "data/tweet-quora/2022/3/1501347733575114753.json": "Whatever happened to Nancy Kerrigan? Quora star writer Stephanie Vardavas has the story, straight from the source! https://t.co/WhzBWHy4bu",
  "data/tweet-quora/2022/3/1501589249703006209.json": "What are some approaches to help people stay mentally, physically, and socially healthy as they age? Answer by Lawrence Kosick (@lawrencekosick), President and Co-Founder at GetSetUp. https://t.co/NBvIXLeI4w https://t.co/NWBcbj6jG0",
  "data/tweet-quora/2022/3/1501689333656526861.json": "Getting excited for the Oscars later this month? Ken Miyamoto (@KenMovies), screen writer and script reader, shares some fun Oscars history! \nhttps://t.co/DiM5X9nrAL",
  "data/tweet-quora/2022/3/1502314127368273922.json": "Do customers really like personalization, or do they find it creepy? @AlexandreRbcqt, CEO @Crossing_Minds shares insights. https://t.co/uQgjuLV3bX https://t.co/2PIYdCOojY",
  "data/tweet-quora/2022/3/1502676184844414981.json": "How can leaders measure whether or not their teams are resilient? Keith Ferrazzi (@ferrazzi), Bestselling Author and Ferrazzi Greenlight Founder, says regular assessments are key. Read what he has to say here: https://t.co/CkyfNltMUO https://t.co/KBdkaJ1vED",
  "data/tweet-quora/2022/3/1502781584113639425.json": "How can you build self awareness in conversations? Katie McCleary, Co Founder: How to Bridge the Gap &amp; Podcast on NPR CapRadio and author of @bridgethegapbk, explains how having the right people around you is crucial. Read her full piece here: https://t.co/FDwcHyMGFa https://t.co/9jjl8Hnycu"
}