{
  "data/tweet-quora/2022/5/1520780223855407105.json": "With organizations starting to reopen offices, what are the best practices to ensure consistency, avoid confusion, and keep employees happy? Chief HR Legal Expert, Kara Govro, shares advice. https://t.co/ZBQg0k9MkA https://t.co/TiZQBYxEgp",
  "data/tweet-quora/2022/5/1521639375049687040.json": "True professionals don't just answer the question that was asked, they answer what the asker meant. Optical engineer Bill Otto demonstrates in his answer to \"How far has the light from our Sun made it?\" https://t.co/cqDcsTClNW",
  "data/tweet-quora/2022/5/1522361674526724096.json": "How did Mariupol get its name? Greek linguists and historians explain the connection to Catherine the Great: https://t.co/1cdpylqA8Y",
  "data/tweet-quora/2022/5/1522359750079352832.json": "What do lawyers think about #RoeVWade? A very illuminating discussion (and don't skip the comments!) https://t.co/bc4L1UNxfb",
  "data/tweet-quora/2022/5/1522592170838003712.json": "Are Amber Heard's lawyers particularly bad, or is this just how trials normally are? @NeamaRahmani, President of @WestCoastTrial, gives his take. https://t.co/oXZ0Cl3xTq https://t.co/SJsGfmTOJc",
  "data/tweet-quora/2022/5/1522758170661302278.json": "Why is it important to flip the fertility script away from a solely female perspective? Khaled Kteily (@kkteily), CEO of @legacy, shares why we should consider all sides. https://t.co/tQL5dMneqJ https://t.co/dhVlFofLwx",
  "data/tweet-quora/2022/5/1522954605440643073.json": "What kinds of services does @WeatherWorks offer? You'd be surprised! https://t.co/7582CydL3y https://t.co/5UkSrppoGO",
  "data/tweet-quora/2022/5/1523060245026656257.json": "How does @Writefullapp use AI to help with academic writing? See their answer here: https://t.co/QhomTtJh7z https://t.co/be0F6oS6qx",
  "data/tweet-quora/2022/5/1523317060197298176.json": "What is the women peace and security (WPS) agenda? @_Nisha_Singh, Global Policy and Advocacy Manager at @womenforwomenUK and @WomenforWomen, explains. https://t.co/f9aalIppgY https://t.co/n0PjKE5IaW",
  "data/tweet-quora/2022/5/1523422599622979585.json": "How can workplaces better prevent staff burnout? Answer by Global President at @deputyapp. https://t.co/6KYYZXc3OU https://t.co/nVh11RAvO7",
  "data/tweet-quora/2022/5/1523761368599392257.json": "How is it possible that, after all that Ferdinand and Imelda Marcos did throughout their political history, their son Bongbong Marcos is now about to win the presidency in the Philippines? Quora contributor Jean-Marie Valheur summarizes: https://t.co/wynqYj4xxB",
  "data/tweet-quora/2022/5/1525596909926289418.json": "When should you hire a personal injury lawyer? @NeamaRahmani President of @WestCoastTrial, explains when it's important to consult a legal expert. https://t.co/eQO99JYCMf https://t.co/YKPED1zE6B",
  "data/tweet-quora/2022/5/1525853659367710724.json": "How can you hack the hiring process to get the job I really want? Former Bachelorette contestant and author of 'Restart Roadmap', @Jason_Tartick, shares his best advice. https://t.co/TuPr9dw39m https://t.co/O66DVvfM74",
  "data/tweet-quora/2022/5/1526351000503693314.json": "What do psychologists think of Jordan Peterson as a therapist? https://t.co/g1TyMdVA7S",
  "data/tweet-quora/2022/5/1526349690656043008.json": "You might not ever need to polish out scuff marks from the gleaming exterior of Air Force One, but isn't it cool that someone knows how? https://t.co/CDfe1IY750 https://t.co/ttAGwvC8va",
  "data/tweet-quora/2022/5/1526625085829677057.json": "Ever wondered what cursive Cyrillic looks like? We did! Here's Brian Collins, Slavic linguist, with a beautiful answer on cursive forms of various languages: https://t.co/JHmYcM2oVh https://t.co/nE0ZOhxA3Q",
  "data/tweet-quora/2022/5/1527042520798023680.json": "People are wondering what the war in #Ukraine means for #Taiwan. Experts on Quora think it doesn't change the odds but the odds jumped 15% on @metaculus. Who is right? https://t.co/g2SlRfyNEU",
  "data/tweet-quora/2022/5/1527082063441952768.json": "Quora contributor and whiskey drinker Jason Almendra posits an interesting theory for why whiskey was stored in charred barrels: the charcoal absorbs any residual methanol. Plausible? https://t.co/eyBhVEf1mC",
  "data/tweet-quora/2022/5/1527079950318129152.json": "Quora contributor and world-traveler Peter Wade says Hungary is the Alabama of Europe. Agree or disagree?\nhttps://t.co/1JaVytd1b8",
  "data/tweet-quora/2022/5/1527650734384226305.json": "How has climate change impacted the snowpack and snowfall processes? Andrew Schwartz (@snow_d0c), Atmospheric scientist specializing in snow @UCBerkeley, Lead Scientist at UC Berkeley Central Sierra Snow Laboratory, gives his expert take. https://t.co/4byt1n85pU https://t.co/Wki41xYxXK",
  "data/tweet-quora/2022/5/1528028015539666947.json": "Why do habits created for healthy eating and exercise often fail when real life gets in the way? Answer by @MichelleSegar PhD, author of  The Joy Choice. https://t.co/1zLisQJvGf https://t.co/cvXwIClRrx",
  "data/tweet-quora/2022/5/1528133632724029442.json": "Why are there so many people who are food insecure? Jack Griffin, Founder and CEO of @FoodFinderUS, shares how current events have made food insecurities even worse. https://t.co/a1tRbt2Thf https://t.co/SRZhiM2DwJ",
  "data/tweet-quora/2022/5/1528390337084932097.json": "Is job hopping seen as good or bad by employers? @CWaltersPhD, business &amp; branding mentor, corporate training, shares her expert advice. https://t.co/zrZKCUXpmU https://t.co/hjZzDfBs6o",
  "data/tweet-quora/2022/5/1528495995587375105.json": "In a time of war, is there any progress in the global movement toward peace as a norm? Emma Varvaloucas (@heyemmavarv), host of What Could Go Right? podcast explains why we should hold some optimism. https://t.co/MF343g7dsY https://t.co/4jWE1e6Q7c",
  "data/tweet-quora/2022/5/1529462504253947904.json": "Who is the victim in the Amber Heard v. Johnny Depp trial? @NeamaRahmani, President of @WestCoastTrial answers. https://t.co/qYf2PveCJb https://t.co/vDpZgs0Hoj",
  "data/tweet-quora/2022/5/1529593049537564672.json": "How did sunflowers, a new-world plant domesticated by Native Americans, become one of the main agricultural products of Ukraine? It's a bit of a Johnny Appleseed story! https://t.co/F0r5KKPsPj",
  "data/tweet-quora/2022/5/1529917447976849408.json": "When is the sun like caramel corn? Physics teacher and Quora contributor Philip Freeman explains it's all about the H-alpha filter: https://t.co/q10rtvPWQ4 https://t.co/HqLOXA5EP5",
  "data/tweet-quora/2022/5/1529941501798518785.json": "Ever wondered what it's like to work at Quora? Check out this @builtin profile of senior leadership, find out what makes Quora special, and get a little glimpse of what the future holds! https://t.co/snV7PHvm3A"
}