{
  "data/tweet-quora/2021/12/1466119866675433472.json": "What was the last real breakthrough in computer programming? Monads/monoids? Functional programming? The debate heats up: https://t.co/ASEPFxpTkP",
  "data/tweet-quora/2021/12/1467161979307626499.json": "Should you keep your personal goals a secret? Expert goal setter, Corey Fradin, founder of QuickBooost, literally weighs in. https://t.co/C2OiDNG4Eb https://t.co/GHRuiXE1HA",
  "data/tweet-quora/2021/12/1467267546286075904.json": "Getting some negative feedback? Business and branding mentor, @CWaltersPhD gives four tips for productively responding to criticism. https://t.co/cQ02bC2EgO https://t.co/wDlJ8DuK1E",
  "data/tweet-quora/2021/12/1467524365331976198.json": "Does taking a gap year make you seem undesirable to colleges? Founder &amp; CEO @moon_prep, Kristen Moon, who provides personalized application guidance, tells you what she thinks! https://t.co/1tpQWrcIY0 https://t.co/IZfQlU06Xq",
  "data/tweet-quora/2021/12/1467629930552905737.json": "Why does \"finding your flow\" matter for creative entrepreneurs? Co-Founder of Bullfrog Agency, and stunt marketing expert, @stuntmanhunter, breaks down his three part strategy. https://t.co/6L1uiSXo9h https://t.co/zc6gmyBuZF",
  "data/tweet-quora/2021/12/1468036768687538177.json": "Didn't I just see @buster talking about the challenges of scaling a community? Will NFT communities scale or just proliferate in number, and will that address the issues of moderation he highlighted? https://t.co/VWTIgZJI1v",
  "data/tweet-quora/2021/12/1468719478896660481.json": "How do you know if someone really knows what they're talking about or is just making it up as they go? How would you assess Bill Otto's expertise in satellite imaging? https://t.co/ze0KVdy5Il https://t.co/yqbNFYFreK",
  "data/tweet-quora/2021/12/1468712054118772736.json": "Question: What's a forgotten gaming fad? https://t.co/IycAx9AT3E https://t.co/3XAJaflgjz",
  "data/tweet-quora/2021/12/1469698727875166214.json": "What are three simple ways that companies can start to address the climate emergency in their business today? Bestselling author &amp; founder/CEO of @WeFirstBranding, @simonmainwaring, shares his expert opinion. https://t.co/CDWoFiBC3B",
  "data/tweet-quora/2021/12/1470471790862520325.json": "Is this the scene that broke up the USSR? https://t.co/UgAi2hj3ld",
  "data/tweet-quora/2021/12/1470526523484430341.json": "What is the fastest speed ever attained by a man-made object? Sebastian Lender discusses an unusual candidate for the title https://t.co/XWXRyQjRE0 https://t.co/C5eLaj9O9J",
  "data/tweet-quora/2021/12/1470864655731990532.json": "It's company party season! Do you like them or are you Jim? https://t.co/SKstgKUN2g https://t.co/YCm4CWlacj",
  "data/tweet-quora/2021/12/1470921020773068801.json": "Where else but Quora could someone ask \"Why has a focus on oppressed groups become the dominant mode of literary analysis in academia?\" and get a well-reasoned thoughtful answer. https://t.co/IQxAFcWoye https://t.co/Lf4hAZ2abn",
  "data/tweet-quora/2021/12/1471220477775413251.json": "Wisdom doesn't only come with age. What's the wisest thing you've heard a child say? https://t.co/GE7IJVMeTn",
  "data/tweet-quora/2021/12/1471930421126393859.json": "What animal is responsible for saving the most human lives? https://t.co/gTlSKnIcWB https://t.co/rWfy3CgH8B",
  "data/tweet-quora/2021/12/1472235429516697605.json": "Dealing with difficult in-laws? Here are four tips on how to handle your feelings about them this holiday season. https://t.co/KhioJJi8eP https://t.co/Rru8kNjy5x",
  "data/tweet-quora/2021/12/1473048524526788608.json": "It's amazing to think that there are still massive undiscovered civilizations on our own planet. How old do you think these paintings are? https://t.co/cmkZjNLwXo https://t.co/PAT4nlp7Dg",
  "data/tweet-quora/2021/12/1473411730415915008.json": "Have you tried the world's rarest pasta? https://t.co/dDBVqt6OFx",
  "data/tweet-quora/2021/12/1473741695829553152.json": "Who's excited for the @NASAWebb launch of the James Webb Space telescope on Christmas? Quora Optical Physicist and Engineer Bill Otto has all the details! https://t.co/LOEePcrhwa https://t.co/5NF2nGFlTR",
  "data/tweet-quora/2021/12/1474077533314371584.json": "Interested in how Paxlovid works? Read this answer from Drug Development expert Christopher VanLang: https://t.co/QWnc1BVKg2\nCoronaviruses have to assemble themselves in an infected cell to reproduce. Paxlovid blocks a tool used in assembly from working right.",
  "data/tweet-quora/2021/12/1474171720370163714.json": "What's it like being a transgender athlete? Find out from Jo Wolfe: https://t.co/yoFAxbVv1f",
  "data/tweet-quora/2021/12/1474198211908808704.json": "Ever wonder what it's like to wear those fur hats that the Queen's Guard wear? Find out from Michael Cunliffe on Quora! https://t.co/moFNWRk6HC",
  "data/tweet-quora/2021/12/1474439923587596290.json": "What happens during a failed landing attempt on a commercial airliner? Find out from Randy Duncan, airline pilot: https://t.co/XiHfDUTeQm",
  "data/tweet-quora/2021/12/1475164621740904451.json": "What's Christmas like in Finland, where reindeer live? Let's ask Kari Autero, a native Finn: https://t.co/jHqguAZmhE https://t.co/YujPzRKkp7",
  "data/tweet-quora/2021/12/1475527117890891778.json": "What's the mythology associated with mistletoe? Let Druid John Young explain: https://t.co/MfyMX8Bzbt https://t.co/rcGQ3cdip0",
  "data/tweet-quora/2021/12/1475497124779417604.json": "What do generally happy people do differently? Read three strategies that Corey Fradin, founder of QuickBooost, uses to feel a better physically and mentally. https://t.co/FEqGzdrDsT https://t.co/6sMxVMo6jU",
  "data/tweet-quora/2021/12/1475602465382928387.json": "Have you ever seen a door blown off its hinges by the wind? David Thomas has and tells the story: https://t.co/BOzT1dDZSh",
  "data/tweet-quora/2021/12/1475889576023670784.json": "Why was PARC able to do such innovative, blue-sky research and how did that change? None other than Alan Kay explains: https://t.co/pRoRtJ3Tig",
  "data/tweet-quora/2021/12/1475964871065931784.json": "What was computing like in the 1970s? Geoff Caplan was there and tells us all about it: https://t.co/NqGu51okXq",
  "data/tweet-quora/2021/12/1476251965927608325.json": "How do people come up with the names of their companies? Dan Shapiro, CEO of Glowforge, tells us how we arrived at his: https://t.co/6HUVt02irM",
  "data/tweet-quora/2021/12/1476327259904839682.json": "What was it like flying a plane on 9/11? Let pilot Randy Duncan tell you: https://t.co/rz3t6qAdqX"
}