{
  "data/tweet-stocks/2022/1/1479066687508992009.json": "Breaking News: Novak Djokovic was refused entry to Australia and asked to leave the country after a 12-hour airport standoff over the validity of his visa and questions about his vaccine medical exemption for the Australian Open. https://t.co/B2wgwmj8OB",
  "data/tweet-stocks/2022/1/1480081747983360002.json": "Mayor Eric Adams says allowing non-citizens to vote for NYC elections is 'best choice' https://t.co/BM2NfjH4rw https://t.co/dhN9BVTz28",
  "data/tweet-stocks/2022/1/1480283358030708742.json": "CDC Director Sheepishly Admits Justice Sotomayor Issued COVID Misinformation On Hospitalized Kids https://t.co/luR9CGjeHx",
  "data/tweet-stocks/2022/1/1480298561539653637.json": "This point has not yet been appreciated by many. A prerequisite for vaccine mandates is gone. Vax confers personal health benefit to avoid severe disease. But the value of societal transmission is rapidly evaporating. Thus, all mandates are unjustifiable. https://t.co/JUoOoDvaeO",
  "data/tweet-stocks/2022/1/1480341248464625665.json": "REST IN PEACE BOB SAGET 🙏 https://t.co/cv4JSCN5ZR",
  "data/tweet-stocks/2022/1/1480875783610675201.json": "\"Mass Vaccination Should End\" - Former UK Task-Force Chair Says We Should \"Treat COVID Like The Flu\" https://t.co/bCW3pW1DvL",
  "data/tweet-stocks/2022/1/1482101571387281408.json": "Video taken at a trainyard in Chicago. \"Let me know if this video plays\" - Ron https://t.co/uyZ64uNTxV",
  "data/tweet-stocks/2022/1/1482483164241174534.json": "I once had a retired Swedish general tell me that (even though Sweden is not in NATO), every time they wargamed a major conflict, whoever was playing the Russian side seized Gotland as a first move, thus cutting the Baltics off from the rest of the alliance https://t.co/HlXGt2Xc0u",
  "data/tweet-stocks/2022/1/1482454153221840901.json": "While it has become conventional wisdom that the @federalreserve will raise rates 3 to 4 times this year to mitigate inflation, the market expects 25 bp increments. The unresolved elephant in the room is the loss of the Fed’s perceived credibility as an inflation fighter and"
}