{
  "data/tweet-wsj/2022/2/1488346426442764288.json": "Ricky Gervais doesn't think any subject should be off-limits in comedy. “I think a lot of this pious offense comes from people mistaking the target of the joke with the subject. You can joke about anything, but it depends on what the actual target is.” https://t.co/1iyaqtKNnb",
  "data/tweet-wsj/2022/2/1488308666071670787.json": "Many teachers are leaving schools for better pay and more autonomy in new careers. “My happiness was worth more.” https://t.co/3kNxytFhzn",
  "data/tweet-wsj/2022/2/1488365256128745472.json": "“Maus,” a graphic novel about the Holocaust published decades ago, reached the top of Amazon’s bestsellers list after a Tennessee school board’s decision to remove the book spurred criticism nationwide https://t.co/Ft3zNofIJf",
  "data/tweet-wsj/2022/2/1488369040879988741.json": "Many teachers are leaving schools for better pay and more autonomy in new careers. “My happiness was worth more.” https://t.co/DttHK72Sm6",
  "data/tweet-wsj/2022/2/1488357713235091463.json": "Rihanna and A$AP Rocky’s unborn baby is already wearing coronation-level jewels https://t.co/JCVDuoDU5N",
  "data/tweet-wsj/2022/2/1488335074881847297.json": "The New York Times has bought Wordle, the word game that has become an online phenomenon, for an undisclosed price in the low-seven figures. The media company said the game would continue to be free to play. https://t.co/rGhIpPKpNc",
  "data/tweet-wsj/2022/2/1488429443358068739.json": "“I think a lot of this pious offense comes from people mistaking the target of the joke with the subject. You can joke about anything, but it depends on what the actual target is” https://t.co/0j5ms5I3co",
  "data/tweet-wsj/2022/2/1488372810766594048.json": "“It’s catastrophic.” Since the start of the pandemic, about 6.8 million Americans have died—roughly a million more than would have been expected in that time. Families and communities will feel the impact for years to come. https://t.co/UMdcvFBRP2",
  "data/tweet-wsj/2022/2/1488452096596795397.json": "Somaliland is offering the U.S. military use of a seaport and airfield in exchange for steps toward recognizing the region as a sovereign country https://t.co/ThEIN9pEcY",
  "data/tweet-wsj/2022/2/1488380351005265921.json": "An addiction to the viral online word game Wordle is pushing people to rediscover games they played as kids https://t.co/owJpcrBXMe",
  "data/tweet-wsj/2022/2/1488528790208892941.json": "Quarterback Tom Brady announced his retirement from the NFL after days of speculation over his future. At 44, he led the league in passing yards and touchdowns this season for the Tampa Bay Buccaneers. https://t.co/U3BDGQOJUa",
  "data/tweet-wsj/2022/2/1488527593460670468.json": "The booming cryptocurrency sector’s complaints that Washington has gone too far in cracking down on its unregulated products are getting tested in a key lawsuit targeting Ripple Labs and its digital coin, XRP https://t.co/6qzv6dCh4r",
  "data/tweet-wsj/2022/2/1488512462680846338.json": "The exodus of teachers is worsening a nationwide shortage, and businesses eager to hire are offering former educators better pay and more autonomy #WSJWhatsNow https://t.co/ZPVDbXCMVg https://t.co/yFafY1Nu2A",
  "data/tweet-wsj/2022/2/1488639525853216768.json": "Recently fired Miami Dolphins head coach Brian Flores filed a class-action lawsuit against the NFL and three teams, alleging that Black coaches are discriminated against in pursuing coaching opportunities https://t.co/4XtzZLgC25",
  "data/tweet-wsj/2022/2/1488591759630295041.json": "Tom Brady is finally stepping away from football at age 44, but the NFL icon won’t be a stranger from public life, writes @jasongay https://t.co/SFJGfreUoU",
  "data/tweet-wsj/2022/2/1488742763512406019.json": "ABC News has suspended Whoopi Goldberg from “The View” after she said on a broadcast that the Holocaust was “not about race,” but rather “man’s inhumanity to man.” https://t.co/70kmPskShD",
  "data/tweet-wsj/2022/2/1488669764927033344.json": "New Orleans on Tuesday launched a Covid-19 vaccine mandate in public schools for students five years of age and older, making it the first major U.S. city to require coronavirus shots in schools https://t.co/Ju9dm9UIdD",
  "data/tweet-wsj/2022/2/1488727653863636992.json": "The U.S. national debt exceeded $30 trillion for the first time, reflecting increased federal borrowing during the Covid-19 pandemic https://t.co/M2F4K5he2r",
  "data/tweet-wsj/2022/2/1488603104543191050.json": "Musicians Graham Nash and India Arie said they plan to pull their music from Spotify following Neil Young in objection to the platform’s star podcaster Joe Rogan https://t.co/cXzt81Op4A",
  "data/tweet-wsj/2022/2/1488868117904244738.json": "Melinda French Gates will no longer give most of her wealth to the Gates Foundation and instead plans to spread it among philanthropies, people familiar say https://t.co/fCzMmGGzcX",
  "data/tweet-wsj/2022/2/1488871227355709445.json": "Washington’s NFL team finally has a new name after two seasons of playing without one: the Commanders https://t.co/6LI5m2KCX6",
  "data/tweet-wsj/2022/2/1488875811071537157.json": "Breaking: President Biden will deploy more than 3,000 troops to bolster the defense of NATO allies, the first major movement of U.S. forces in the Ukraine-Russia standoff https://t.co/Yo6eXj0Dle",
  "data/tweet-wsj/2022/2/1488909427583426562.json": "CNN President Jeff Zucker resigned, citing his failure to disclose a consensual relationship with a close colleague, according to an email he sent to staff https://t.co/kGmtmeTtHm",
  "data/tweet-wsj/2022/2/1488937141296058384.json": "A trio of CNN executives—Michael Bass, Amy Entelis and Ken Jautz—will lead the network on an interim basis following the resignation of President Jeff Zucker, people familiar with the situation said https://t.co/L44BKmz47l",
  "data/tweet-wsj/2022/2/1488863560381906947.json": "President Biden pledged during his campaign to reduce or eliminate student debt for millions of Americans. His supporters are still waiting for him to act. https://t.co/bFhnaVZu89",
  "data/tweet-wsj/2022/2/1488978279671508995.json": "Neil Young’s former bandmates David Crosby and Stephen Stills are joining his protest against Spotify, saying they want to pull their music from the platform over opposition to what they say is Covid-19 misinformation spread by podcaster Joe Rogan https://t.co/UNVUSG20cn",
  "data/tweet-wsj/2022/2/1488996965618757637.json": "Facebook parent Meta's shares fell 20% after hours as it said revenue growth will slow partly because users were spending less time on lucrative services https://t.co/2EYBeLlcLy",
  "data/tweet-wsj/2022/2/1489105125608202248.json": "A summit between Russian President Vladimir Putin and Chinese leader Xi Jinping alongside the opening of the Beijing Winter Olympics will put on display a partnership that is complicating U.S. foreign policy and influence around the world https://t.co/TY3IpuSbvo",
  "data/tweet-wsj/2022/2/1488973037047328770.json": "From @WSJopinion: Measures like masking and social distancing may be doing long-term damage to our immune systems, writes Eran Bendavid https://t.co/1GZzhgk6Mv",
  "data/tweet-wsj/2022/2/1489112696284979201.json": "Take an early look at the front page of The Wall Street Journal https://t.co/oUjeE6k34B https://t.co/i2KjntA58A",
  "data/tweet-wsj/2022/2/1489126498103611394.json": "U.S. special forces carried out a combat operation to kill or capture a high-level terrorist in northwest Syria along the Turkish border https://t.co/nCG9pxyDWA",
  "data/tweet-wsj/2022/2/1489158486076313603.json": "U.S. and Ukrainian officials continue to differ over how immediate a threat Russian forces arrayed around Ukraine could pose, even as Western military supplies flow into the embattled country https://t.co/7abUcueBSL",
  "data/tweet-wsj/2022/2/1489226536775467013.json": "The leader of Islamic State was killed during a U.S. military operation in Syria, President Biden said https://t.co/jrl6LD0HcC",
  "data/tweet-wsj/2022/2/1489180637558943745.json": "Take an early look at the front page of The Wall Street Journal https://t.co/UmZSEq57if https://t.co/bawCXBYPGY",
  "data/tweet-wsj/2022/2/1489286343205216256.json": "Research confirms that Covid-19 vaccinations can affect menstrual cycles, with one recent study linking vaccination to a slight increase in menstrual-cycle length https://t.co/JBiiK4D7qj",
  "data/tweet-wsj/2022/2/1488693743838449678.json": "How to make February less gloomy. (Or at least better than January.)  https://t.co/8H3y7QKhn2",
  "data/tweet-wsj/2022/2/1489331233893097485.json": "The U.S. said Russia is planning to stage a false attack by Ukraine to justify an invasion of the country, according to newly declassified intelligence https://t.co/T736XUI7JN",
  "data/tweet-wsj/2022/2/1489350515267977221.json": "Retired Lt. Col. Alexander Vindman has sued Donald Trump Jr., Rudy Giuliani and other associates, alleging that they conspired to intimidate him from testifying against President Donald Trump during his first impeachment hearing https://t.co/nWJnz571oq",
  "data/tweet-wsj/2022/2/1489361854472327170.json": "Tom Brady may go down as the National Football League’s most accomplished quarterback, but in Brazil he is simply “Giselo,” the husband of supermodel Gisele Bündchen https://t.co/7ULBCROhBR",
  "data/tweet-wsj/2022/2/1489320315280928770.json": "Phil Spencer, the executive who engineered Microsoft’s $75 billion deal to buy Activision Blizzard, is such a videogame fan that he sometimes plays on his Xbox during conference calls. “Phil at his core is a gamer.” https://t.co/lj6vPA3wA0",
  "data/tweet-wsj/2022/2/1489373179386728452.json": "The WNBA has raised $75 million from a group of investors that includes Nike, Michael Dell, and Condoleezza Rice in an effort to revamp the league and appeal to more fans. It's the largest-ever capital investment for a women’s sports property. https://t.co/6k4jNzZTb0",
  "data/tweet-wsj/2022/2/1489385731177041921.json": "Amazon is raising the cost of its Prime membership in the U.S. to $139 a year from $119 https://t.co/vQCexAFYlR",
  "data/tweet-wsj/2022/2/1489344405735718916.json": "Tech shares led a broad stock selloff. Facebook parent Meta erased more than $230 billion in market value, the largest one-day loss ever by a U.S. company. https://t.co/887Y5eKj90",
  "data/tweet-wsj/2022/2/1489592843576528898.json": "U.S. payrolls grew sharply by 467,000 in January, and the jobless rate rose to 4% as the economy weathered the Omicron wave and staffing shortages https://t.co/PELU63Abl2",
  "data/tweet-wsj/2022/2/1489563662675320843.json": "New allegations of sexual misconduct inside the Washington NFL team, including against owner Dan Snyder, have reignited scrutiny of the league’s investigation and the behavior of the club’s boss.  https://t.co/U1klSZtQ0s",
  "data/tweet-wsj/2022/2/1489524196686405632.json": "Research confirms that Covid-19 vaccinations can affect menstrual cycles, with one recent study linking vaccination to a slight increase in menstrual-cycle length https://t.co/vTJMYtXQ44",
  "data/tweet-wsj/2022/2/1489663817009221632.json": "Domino’s Pizza is letting customers who pick up their orders in stores claim a $3 tip, a move that comes as companies nationwide face a labor shortage https://t.co/Od2jyJci1X",
  "data/tweet-wsj/2022/2/1489648706924208130.json": "Used Teslas can now sell for more than new ones. That has driven owners to a fork in the road. https://t.co/tuB2dTw80l",
  "data/tweet-wsj/2022/2/1489624677219774469.json": "Mark Zuckerberg's net worth dropped by $31 billion after a steep decline in Meta's stock price. The Facebook founder is still the 10th richest person in the world. https://t.co/mT9aK0bzNg",
  "data/tweet-wsj/2022/2/1489692236585517056.json": "Breaking: Disgraced celebrity lawyer Michael Avenatti was convicted Friday of stealing nearly $300,000 from his former client and onetime ally, the adult-film actress Stormy Daniels https://t.co/BDJZjti4gR",
  "data/tweet-wsj/2022/2/1489701568924553228.json": "Republicans censured Reps. Liz Cheney of Wyoming and Adam Kinzinger of Illinois for serving on the select committee investigating the Jan. 6, 2021, attack on the U.S. Capitol, accusing them of disloyalty to the party    https://t.co/0kPWNgM3P5",
  "data/tweet-wsj/2022/2/1489585585601884160.json": "News Corp was the target of a hack linked to China that accessed some emails of journalists and others https://t.co/RWrrubosOa",
  "data/tweet-wsj/2022/2/1489755684166152192.json": "From @WSJopinion: The RNC pledged to “immediately cease any and all support” of Reps. Liz Cheney and Adam Kinzinger. This kind of ritual purification is bad politics. https://t.co/MDSeJDJqCY",
  "data/tweet-wsj/2022/2/1489788422952783874.json": "Fourteen years apart, two young Uyghurs gripped the Olympic torch. One is now in the U.S., his father in prison. https://t.co/danRqiRmqG",
  "data/tweet-wsj/2022/2/1489780844961148935.json": "A 19-year-old college freshman who publicly tracks Elon Musk's private jet on Twitter has spurned a $5,000 cash offer to stop. His new demand: A Tesla Model 3. “If I got an actual Tesla, then I would take it down.” https://t.co/9h7IlPR4I1",
  "data/tweet-wsj/2022/2/1489848820657709058.json": "Most young adults believe it’s best to delay marriage past your 20s and to live together first. New research challenges both assumptions. https://t.co/CaoTPQ48Fa",
  "data/tweet-wsj/2022/2/1489814801924734976.json": "Blood donations have dropped during the pandemic, while demand has increased as people resume routine or preventative care, leading some hospitals to space out procedures https://t.co/0GnftWjbI0",
  "data/tweet-wsj/2022/2/1489894071887962114.json": "Mike Pence said former President Donald Trump was mistaken in saying the vice president could overturn election results, calling that notion un-American. “President Trump is wrong,” the former vice president said at an event in Florida on Friday. https://t.co/7bUY9U6Qzh",
  "data/tweet-wsj/2022/2/1489830016334585858.json": "The U.S. race for lithium runs beneath a California lake https://t.co/KOdBgQoOOM",
  "data/tweet-wsj/2022/2/1489950951117135879.json": "Habitual late riser @jasongay has discovered the strange joy of waking up at 4 a.m. It’s not for everyone, but it’s working for him. https://t.co/3h7CDQEgej",
  "data/tweet-wsj/2022/2/1489969589916254208.json": "Omicron appears to have made more people ill at the same time than in any period since the flu pandemic of 1917-1918, experts say https://t.co/zp7WGvsuVs",
  "data/tweet-wsj/2022/2/1490033763384008708.json": "Research confirms that Covid-19 vaccinations can affect menstrual cycles, with one recent study linking vaccination to a slight increase in menstrual-cycle length https://t.co/UrryW0eQ5Q",
  "data/tweet-wsj/2022/2/1490045110498775042.json": "From @WSJopinion: A critical achievement of modern civilization may rest on the fate of these two small countries, Ukraine and Taiwan, in danger of being swallowed by imperial neighbors, writes Christopher DeMuth https://t.co/OvoYLgHTC4",
  "data/tweet-wsj/2022/2/1490014859622244355.json": "Mounting tensions on the Russia-Ukraine border are driving wheat prices higher on both sides of the Atlantic, leaving traders bracing for more volatility ahead, explains @ahirtens #WSJWhatsNow https://t.co/TZsx7p51bi https://t.co/9A8sUpzqWU",
  "data/tweet-wsj/2022/2/1490082864083480576.json": "Many teachers are leaving schools for better pay and more autonomy in new careers. “My happiness was worth more.” https://t.co/8YfC7y6xKa",
  "data/tweet-wsj/2022/2/1490180989871665153.json": "Tom Brady may go down as the National Football League’s most accomplished quarterback, but in Brazil he is simply “Giselo,” the husband of supermodel Gisele Bündchen https://t.co/G4qnwmp561",
  "data/tweet-wsj/2022/2/1490196068193161217.json": "Domino’s Pizza is letting customers who pick up their orders in stores claim a $3 tip, a move that comes as companies nationwide face a labor shortage https://t.co/4fMjW68UwG",
  "data/tweet-wsj/2022/2/1489890304488624131.json": "\"We don’t want to live in such a zombie zone.\" Ukrainians see the grim existence in Russian-occupied eastern Ukraine as fuel for the resistance. https://t.co/BVn0E4ADLU",
  "data/tweet-wsj/2022/2/1490295483570524165.json": "Queen Elizabeth says she wants Camilla, Duchess of Cornwall, to take the title \"Queen Consort\" when Prince Charles comes to the throne https://t.co/RsHt6lRmD5",
  "data/tweet-wsj/2022/2/1490135681926057985.json": "Scientists explored a stunning deep-water coral reef off Tahiti that was in \"pristine\" condition. It's a rare find, considering that from 2009 to 2018, the world lost roughly 13% of its hard coral. https://t.co/yig0bGwPpX",
  "data/tweet-wsj/2022/2/1490301796329443330.json": "From @WSJopinion: Measures like masking and social distancing may be doing long-term damage to our immune systems, writes Eran Bendavid https://t.co/2hC0XF4YGG",
  "data/tweet-wsj/2022/2/1490325713228025858.json": "Andrew Cuomo and his aides are planning a comeback, attacking his accusers and eyeing his first public appearance since he resigned, people close to him say https://t.co/qj3SQNqO5g",
  "data/tweet-wsj/2022/2/1490169622603124736.json": "Julia Marino finished second in snowboard slopestyle, winning the first medal for Team USA in the Beijing Olympics. https://t.co/AzMrtogXe0",
  "data/tweet-wsj/2022/2/1490279123532632068.json": "Lata Mangeshkar, an Indian singer and cultural icon who enchanted generations of Bollywood audiences, died at age 92 https://t.co/eZ7AceReHj",
  "data/tweet-wsj/2022/2/1490377300919083011.json": "Planeloads of missiles, ammunition and arms from the U.S. and NATO allies to Ukraine are aiming to deter a Russian invasion by making it more costly https://t.co/a98RRbFsNO",
  "data/tweet-wsj/2022/2/1490411247459872769.json": "Who will dominate the Super Bowl? A whole lot of crypto ads. https://t.co/TfAVuFSUzL",
  "data/tweet-wsj/2022/2/1490233834209792002.json": "Israel and the United Arab Emirates are discussing new ways to protect the Persian Gulf state, including the sale of advanced Israeli air-defense systems, according to people familiar with the matter. https://t.co/olsQztTMMD",
  "data/tweet-wsj/2022/2/1490396153506144265.json": "The opening day of the Winter Olympics in Beijing drew nearly 16 million viewers in the U.S. across NBC’s TV and streaming platforms, a roughly 43% drop from the kickoff of the Games in 2018 https://t.co/Fxvz4Mk23y",
  "data/tweet-wsj/2022/2/1490392400711327756.json": "From @WSJopinion: It is manifestly clear that the panic phase of the Covid-19 pandemic has to end. The costs are too high, writes @DanHenninger https://t.co/BEWuq4moxW",
  "data/tweet-wsj/2022/2/1490460359605506049.json": "Habitual late riser @jasongay has discovered the strange joy of waking up at 4 a.m. It’s not for everyone, but it’s working for him. https://t.co/IUJS6wSFTL",
  "data/tweet-wsj/2022/2/1490516940640641028.json": "Tom Brady may go down as the National Football League’s most accomplished quarterback, but in Brazil he is simply “Giselo,” the husband of supermodel Gisele Bündchen https://t.co/GazVGZ6E7I",
  "data/tweet-wsj/2022/2/1490456540213616640.json": "From @WSJopinion: “Rather than leveling the playing field, letting meritocracy determine who gets into the university, American colleges allow blatant racism and discrimination against Asians,” writes Charlotte McKinley, a student at Biola University. https://t.co/7Yi2QMBDLg",
  "data/tweet-wsj/2022/2/1490524488714403847.json": "A 19-year-old college freshman who publicly tracks Elon Musk's private jet on Twitter has spurned a $5,000 cash offer to stop. His new demand: A Tesla Model 3. “If I got an actual Tesla, then I would take it down.” https://t.co/3A3RZrLJxQ",
  "data/tweet-wsj/2022/2/1490513189829754882.json": "Many teachers are leaving schools for better pay and more autonomy in new careers. “My happiness was worth more.” https://t.co/kOIe6yAZln",
  "data/tweet-wsj/2022/2/1490549621290061826.json": "Breaking: The Spotify CEO said in a letter that he has no plans to remove the star podcaster from the streaming platform. ​https://t.co/AXBI21FXP6",
  "data/tweet-wsj/2022/2/1490094144034938881.json": "From @WSJopinion: Joe Rogan’s existence ought to make you feel better about our society, writes @HolmanJenkins. His success speaks to a desire by his large audience for contradictory, dissenting, off-kilter, even absurd views. https://t.co/GI75zMMzAl",
  "data/tweet-wsj/2022/2/1490666638970167298.json": "A state of emergency was declared in Ottawa, where protests against Covid-19 vaccine mandates have clogged traffic and closed businesses. Demonstrations also took place in other Canadian cities over the weekend. #WSJWhatsNow https://t.co/qwnUydBJbw https://t.co/tCTZ63JtrY",
  "data/tweet-wsj/2022/2/1490702363002351623.json": "A Uyghur skier became the face of China's Winter Olympics. The next day, she vanished from the spotlight. https://t.co/iUl90PCFqn",
  "data/tweet-wsj/2022/2/1490520728164306948.json": "Charli D'Amelio made nearly $2 million more than ExxonMobil CEO Darren Woods last year, and she's not the only influencer out-earning S&amp;P 500 companies' top brass https://t.co/ce1g7JdhBN",
  "data/tweet-wsj/2022/2/1490781182195376134.json": "Most young adults believe it’s best to delay marriage past your 20s and to live together first. New research challenges both assumptions. https://t.co/ZXthqzYJcp",
  "data/tweet-wsj/2022/2/1490788726217261066.json": "The IRS won’t use a facial recognition program to verify taxpayers’ identities online, backing away from a plan that drew bipartisan criticism https://t.co/GceTlBC1SL",
  "data/tweet-wsj/2022/2/1490661902204096513.json": "Spirit Airlines and Frontier Group are merging in a cash-and-stock deal valued at $6.6 billion https://t.co/bhebwDWiL9",
  "data/tweet-wsj/2022/2/1490810114902790148.json": "Joe Rogan has been offered $100 million from the social video website Rumble to take his podcast exclusively to the platform amid weeks of controversy at Spotify https://t.co/UWTIDlHXXd",
  "data/tweet-wsj/2022/2/1490799606783000577.json": "Peter Thiel plans to leave the board of Facebook parent Meta, where he was the first outside investor and a director since 2005. Thiel intends to focus on helping GOP candidates in the midterm elections, a person familiar with the matter said. https://t.co/JEyf4Wu2On",
  "data/tweet-wsj/2022/2/1490844078216560640.json": "A former bank executive was sentenced to a year and a day in prison for corruptly arranging $16 million in loans to former Trump campaign chairman Paul Manafort in an effort to obtain a high-ranking government job https://t.co/pnXL5TFx7D",
  "data/tweet-wsj/2022/2/1490894445855784963.json": "Simon Leviev, the subject of Netflix's documentary “The Tinder Swindler,\" has been banned from Tinder along with several other dating apps and websites https://t.co/voslgxnBmd",
  "data/tweet-wsj/2022/2/1490909518208847875.json": "Most young adults believe it’s best to delay marriage past your 20s and to live together first. New research challenges both assumptions. https://t.co/Uy4XGWbIlg",
  "data/tweet-wsj/2022/2/1490248932953403397.json": "Hollywood hasn't cast China as the villain in more than a decade. The story of \"Red Dawn\" explains why. https://t.co/l6fwxDeOwd",
  "data/tweet-wsj/2022/2/1490426340931219458.json": "Birds moved into quiet airports during the pandemic. Now, planes are flying again, creating collision hazards. https://t.co/DUFAj6ofhr",
  "data/tweet-wsj/2022/2/1490880989077323779.json": "President Biden’s top science adviser has resigned after an internal White House investigation found that he violated the administration’s workplace behavior rules https://t.co/MjKpS3jw4j",
  "data/tweet-wsj/2022/2/1491042128251740162.json": "Footage shows trucks in gridlock on the Ambassador Bridge, a key trading link between the U.S. and Canada. It was temporarily closed early Tuesday amid growing protests against Canada’s Covid-19 vaccine mandates. #WSJWhatsNow https://t.co/1ia6TY4KIa",
  "data/tweet-wsj/2022/2/1491039141630459912.json": "Ukraine prepared for military exercises in response to Russia’s troop buildup as French President Emmanuel Macron shuttled between the countries in an attempt to ease tensions https://t.co/xRkGWY9jnx",
  "data/tweet-wsj/2022/2/1491256823290249223.json": "President Zelensky’s approach to Russia: Pick only certain battles with the Kremlin, urge calm to keep Ukraine and its economy secure, and avoid being big-footed by Western powers https://t.co/QH2nSjmT3S",
  "data/tweet-wsj/2022/2/1491156559585501185.json": "Senate Minority Leader Mitch McConnell criticized the RNC’s censure of Republican lawmakers Liz Cheney and Adam Kinzinger for sitting on the committee investigating the Capitol attack https://t.co/ciK3lPuAwn",
  "data/tweet-wsj/2022/2/1491305916024696835.json": "Simon Leviev, the subject of Netflix's documentary “The Tinder Swindler,\" has been banned from Tinder along with several other dating apps and websites https://t.co/aeUNuqgng8",
  "data/tweet-wsj/2022/2/1491143568299376646.json": "Simon Leviev, the subject of Netflix's documentary “The Tinder Swindler,\" has been banned from Tinder along with several other dating apps and websites https://t.co/mwA73seGr2",
  "data/tweet-wsj/2022/2/1491200223342964747.json": "Unvaccinated residents in Hong Kong will be barred from supermarkets, restaurants and malls as the city combats a record Covid-19 outbreak https://t.co/5ARXVl26I3",
  "data/tweet-wsj/2022/2/1491253042582364162.json": "Vladimir Putin and Russian propaganda say the West is goading Moscow into war with Ukraine—and many Russians agree https://t.co/hutbHb4XlI",
  "data/tweet-wsj/2022/2/1491283259732512769.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/cohJkVKeZv",
  "data/tweet-wsj/2022/2/1491094567646543879.json": "The Justice Department says it seized over $3.6 billion of bitcoin stolen in a 2016 hack of the crypto exchange Bitfinex and has arrested two suspects https://t.co/xVuHR9OKQu",
  "data/tweet-wsj/2022/2/1491098267320528903.json": "Billionaire investor Carl Icahn, known for his merciless campaigns against CEOs and rivals, is on a mission to help pigs. “Animals are one of the things I feel really emotional about.” https://t.co/h0RashvquM",
  "data/tweet-wsj/2022/2/1491132248669704195.json": "Vermont lawmakers approved a state constitutional amendment on Tuesday enshrining abortion rights, the culmination of a yearslong legislative effort that could make the New England state the first in the U.S. with such protections https://t.co/DyOVj9DQ07",
  "data/tweet-wsj/2022/2/1491170061494718464.json": "President Biden wants to bolster the post-Cold War order. President Putin wants to win back what Russia lost. Ukraine’s president is caught in between. https://t.co/FctqMVQ8Lo",
  "data/tweet-wsj/2022/2/1491358775663542272.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/oswiF8lVto",
  "data/tweet-wsj/2022/2/1491450964838166532.json": "Breaking: Barry Diller’s media group will stop publishing print editions of Entertainment Weekly, InStyle and four other magazines it acquired last year. The titles will live on digitally. https://t.co/quY2k7CJY5",
  "data/tweet-wsj/2022/2/1491477357584130050.json": "From @WSJopinion: The lesson for the Covid-19 police is that when you’ve lost even Canadians, arguably the most law-abiding people on the planet, you’ve lost the political plot. It’s time for the pandemic emergency orders to end. https://t.co/eLQiCH0ORZ",
  "data/tweet-wsj/2022/2/1491354946691899393.json": "The University of California has agreed to pay $243.6 million to settle allegations that hundreds of women were sexually abused by a former UCLA gynecologist https://t.co/cXpDeBphmC",
  "data/tweet-wsj/2022/2/1491618895844851712.json": "U.S. snowboarder Chloe Kim has won halfpipe gold in Beijing, defending her 2018 Winter Olympics win https://t.co/77d0bqS1px",
  "data/tweet-wsj/2022/2/1491604117575319555.json": "An autopsy concluded that Bob Saget died in his sleep last month after suffering a brain bleed from a bump on the head, his family said https://t.co/nH2xtuXDqK",
  "data/tweet-wsj/2022/2/1491650400767909889.json": "Four years after stumbling on the biggest stage, the American delivered a rapturous free program and enters the conversation as the greatest skater of his generation https://t.co/8V6j06i9ot",
  "data/tweet-wsj/2022/2/1491539930249629697.json": "Nancy Pelosi said she expected Democrats to soon reach consensus on restricting stock trading by members of Congress, amid debate over the scope of legislation, including whether to extend a ban to lawmakers’ spouses https://t.co/28cODDl3jy",
  "data/tweet-wsj/2022/2/1491698975929516032.json": "Nathan Chen won figure skating gold at the Beijing Olympics, delivering a rapturous free program, four years after stumbling on the biggest stage https://t.co/GLGa2wXMN6",
  "data/tweet-wsj/2022/2/1491766952502648833.json": "U.S. inflation accelerated to a 7.5% annual rate in January, rising to a new four-decade high https://t.co/X1WX7nluap",
  "data/tweet-wsj/2022/2/1491762656478437383.json": "A diamond that could have originated from space has sold at auction for $4.3 million to a buyer who paid in cryptocurrency https://t.co/QIO7KFNIZr",
  "data/tweet-wsj/2022/2/1491566350153752581.json": "During the pandemic, the National Guard has taken on roles that members never expected to find themselves filling—like eighth-grade algebra teacher. “Some kids think it’s cool. Some kids are like, ‘Oh, it’s kind of weird.’” https://t.co/Cm6DmhI9UM",
  "data/tweet-wsj/2022/2/1491785310207979521.json": "The average U.S. household is spending an additional $250 a month because of inflation that is rising at its fastest rate in nearly 40 years, a new economic analysis showed https://t.co/UG0XOcJUgC",
  "data/tweet-wsj/2022/2/1491747559790059528.json": "Russian and Ukrainian negotiators are meeting to discuss ways to end the conflict in eastern Ukraine and a solution to the monthslong crisis triggered by Russia’s troop buildup https://t.co/oeKlHN2sr6",
  "data/tweet-wsj/2022/2/1491765106723676163.json": "Yuzuru Hanyu finished fourth in the men's figure skating singles event at the Beijing Olympics, but the lack of a podium spot didn’t diminish Chinese fans’ ardor for him https://t.co/YaD0ZMEoCU",
  "data/tweet-wsj/2022/2/1491800419772747781.json": "The House Oversight Committee opened an investigation Thursday into Donald Trump’s handling of official records following news that 15 boxes of material were recently recovered at the former president’s Florida estate https://t.co/sBO8tz70Uj",
  "data/tweet-wsj/2022/2/1491977615145685000.json": "Elon Musk says SpaceX’s massive rocket should soon be able to reach orbits for less than $10 million, a fraction of typical launch costs https://t.co/2DjhT4XRw9",
  "data/tweet-wsj/2022/2/1491996691779702786.json": "A secret program at the CIA relied on a form of mass surveillance activity that included the gathering of some records belonging to Americans, according to a new letter from two Democratic senators https://t.co/PZ6ijutrQV",
  "data/tweet-wsj/2022/2/1491777762687918085.json": "A record 31.4 million Americans plan to bet on Super Bowl LVI, a 35% increase from last year’s game. Bettors are estimated to wager $7.61 billion, up 78% jump from a year ago. The growing legalization of sports betting is fueling rapid growth. https://t.co/vBzHZ2ySBs",
  "data/tweet-wsj/2022/2/1492075953794785280.json": "The average U.S. household is spending an additional $250 a month because of inflation that is rising at its fastest rate in nearly 40 years, a new economic analysis showed https://t.co/XyHZdHATpf"
}