{
  "data/tweet-stocks/2022/3/1498453260788813829.json": "69/ New satellite imagery shows that the Russian convoy heading toward Kyiv (ref. tweets 60, 62 and 64) is actually 40 miles long, stretching from Prybirsk to Antonov Airport.\n\nSome homes near Ivankiv along the convoy route are shown burning.\n\n📸: @Maxar https://t.co/3tpZlgHsr7",
  "data/tweet-stocks/2022/3/1498527194355847169.json": "Russian commercial cargo aircraft seemed to violate the EU airspace closure. Landing in Slovakia now. https://t.co/0yckAE5lYt",
  "data/tweet-stocks/2022/3/1498526718658809858.json": "This is Very Unusual a Ilyushin Il-76TD “VI5956” Operated by Volga-Dnepr Airlines a Russian Cargo Transport Company that is Currently banned from EU Airspace is currently Cruising over Poland from Moscow heading South, there are Unconfirmed Reports she has been intercepted. https://t.co/KONAKzBMPG",
  "data/tweet-stocks/2022/3/1498687867895361539.json": "The new NLAW and Javelin systems arrived in #Ukraine. Thank you! https://t.co/gAnT6a07ZG https://t.co/zKLbfSXxjV",
  "data/tweet-stocks/2022/3/1498687459340791809.json": "Lukashenko, addressing his security council, points to a map of Ukraine that shows what look like planned troop movements, infrastructure targets, and the country divided into four parts https://t.co/O81hpIvZM3",
  "data/tweet-stocks/2022/3/1498579798402158596.json": "Maersk, one of largest transport companies, temprarily suspends Russia bookings. Company controls 17% of world’s container fleet.",
  "data/tweet-stocks/2022/3/1498752669879619589.json": "UKRAINE PRESIDENT SAYS BIDEN TOLD ME IT WASN'T TIME YET TO INTRODUCE NO FLY ZONE",
  "data/tweet-stocks/2022/3/1498914881243918339.json": "A Russian helicopter violated our territorial airspace over Nemuro Peninsula this morning.",
  "data/tweet-stocks/2022/3/1499154183307595778.json": "I am now finally a part of the Ukrainian foreign legion. From Finnish reservist Lt. to UA recruit. People from all over the world have come here to help to defend Ukraine. My bunkmates are Norwegian and American. There is still plenty of room for more!\n#Ukraine #StandWithUkraine https://t.co/kYh46gH4Mv",
  "data/tweet-stocks/2022/3/1499234135998672897.json": "Финляндия и Швеция, не входящие в НАТО, получили письма Кремля с требованием предоставить РФ гарантии безопасности",
  "data/tweet-stocks/2022/3/1499401346197319685.json": "Russian MPs – including Andrei Lugovoi, of Litvinenko poisoning fame – are introducing a bill to send anyone arrested protesting the war in Ukraine to \"perform military service on the territory of the Donetsk and Luhansk People's Republics\" https://t.co/mzJt1bSXV3",
  "data/tweet-stocks/2022/3/1499466355065729025.json": "Kyrgyz man (probable labor migrant) in video: “Kyrgyzstani in Russia, we are just informed that on March 4, the martial law is likely to be enacted. This means the borders will shut down, and all the men aged up to 50 will be mobilized for the army. I suggest you to leave ASAP”. https://t.co/ZmBNahIp08",
  "data/tweet-stocks/2022/3/1499587244780408832.json": "@eddyiskongz Turn on Starlink only when needed and place antenna away as far away from people as possible",
  "data/tweet-stocks/2022/3/1499587201444761637.json": "@tobyliiiiiiiiii Almost all Viasat Ukraine user terminals were rendered permanently unusable by a Russian cyberattack on day of invasion, so … yes",
  "data/tweet-stocks/2022/3/1499585282207027204.json": "The last time the Moscow Stock Exchange was closed for this long was in 1917. It stayed closed for 75 years.",
  "data/tweet-stocks/2022/3/1499647885616594945.json": "Ukrainian oligarch found dead in UK mansion https://t.co/hZBVBubLTB https://t.co/PE562eVPjs",
  "data/tweet-stocks/2022/3/1499733937756717066.json": "BREAKING: China slams US for “disinformation” and attempting to “escape its own responsibility” while “benefiting” from the Ukraine conflict.  https://t.co/XLqZ1oMZ8e",
  "data/tweet-stocks/2022/3/1499920216117161987.json": "This is really funny. Now that Apple has left Russia, Apple Maps has put Crimea back in Ukraine https://t.co/sZbei4kFIz",
  "data/tweet-stocks/2022/3/1500187981969252360.json": "Zoltan Pozsar: \"If you believe that the West can craft sanctions that maximize pain for Russia, while minimizing financial stability risks in the West, you could also believe in unicorns\"",
  "data/tweet-stocks/2022/3/1500180235496538114.json": "Companies that left the Russian market so far. https://t.co/0s2IMhjB5V",
  "data/tweet-stocks/2022/3/1500271674368966656.json": "The current CIA Director, William Burns [left], and a former CIA Director (and US Defense secretary), Robert Gates [right], both warned years ago, in the clearest terms, of the inevitable Russian response to any attempt to expand NATO to include Ukraine. \nAre these two Putinists? https://t.co/IHsid3Lf6z",
  "data/tweet-stocks/2022/3/1500341009800216576.json": "CARD DECLINED   Hours after President Zelenskyy urged US lawmakers to block the use of American brand credit, Visa and Mastercard, in Russia, both companies announced they are suspending service in Russia.",
  "data/tweet-stocks/2022/3/1500564170126807044.json": "I can't believe our policy is literally \"crash the Russian economy, hope the current gov disappears, then by magic something better comes along and leaves Ukraine.\" This war has shown how much people rely on emotion rather than reason, even among those who I thought knew better."
}