{
  "data/tweet-wsj/2022/3/1498459298371940354.json": "TikTok has joined Meta in restricting access to some Russian state-controlled media accounts in the European Union, including RT and Sputnik https://t.co/F9jDq725Cd",
  "data/tweet-wsj/2022/3/1498450471291437057.json": "Elon Musk acknowledged that SpaceX delivered to Ukraine terminals that connect to the company's Starlink satellite-based internet service https://t.co/aH1PK7IO0o",
  "data/tweet-wsj/2022/3/1498478154230476804.json": "The U.S. is expelling a dozen Russian diplomats assigned to the United Nations in New York on allegations that they're intelligence agents https://t.co/GCacOwtXtY",
  "data/tweet-wsj/2022/3/1498474358737616902.json": "Loosely organized groups of hackers appeared to bring down several key Russian websites Monday, suggesting the digital front of the deadly conflict is entering an unpredictable new phase https://t.co/3cekZjA6Cg",
  "data/tweet-wsj/2022/3/1498452982698061826.json": "U.S. is sanctioning Russia’s central bank to prevent the government from using its emergency reserve currencies to protect the economy from Western pressure campaign https://t.co/SZiyIxS6wE",
  "data/tweet-wsj/2022/3/1498493667245535232.json": "Talks between Russia and Ukraine on a potential cease-fire ended with no deal Monday as Moscow intensified its assault, killing at least 10 civilians in a shelling attack in the eastern city of Kharkiv https://t.co/V9xHiwJzDC",
  "data/tweet-wsj/2022/3/1498497018515316740.json": "Disney will delay the release of its films in Russian movie theaters in response to Moscow’s “unprovoked invasion of Ukraine and the tragic humanitarian crisis” accompanying it https://t.co/BrxGi4oswf",
  "data/tweet-wsj/2022/3/1498500791346376705.json": "Google and Alphabet CEO Sundar Pichai is a night owl who's most productive after 10 p.m., and powers through a lot of work at that hour. “I really value quiet time in the morning.” https://t.co/RwUhhIYyBB",
  "data/tweet-wsj/2022/3/1498519754344124422.json": "Elon Musk acknowledged that SpaceX delivered to Ukraine terminals that connect to the company's Starlink satellite-based internet service https://t.co/3NtwPYKr93",
  "data/tweet-wsj/2022/3/1498463053268103172.json": "Sen. Joe Manchin joined all GOP senators Monday in voting against a measure seeking to solidify access to abortion https://t.co/Kw6gX9GAgo",
  "data/tweet-wsj/2022/3/1498531907272851457.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/YDQsgCP6WT",
  "data/tweet-wsj/2022/3/1498523230663057409.json": "Biden administration officials told lawmakers that Ukrainians have weeks—not months—to mount a successful pushback against Russian advances, and it may need to involve guerrilla warfare, according to a person familiar with the matter https://t.co/4l0gRs31SB",
  "data/tweet-wsj/2022/3/1498515898398826497.json": "The world’s biggest commercially operated aircraft, an object of fascination among aviation enthusiasts, was heavily damaged in fighting in Ukraine https://t.co/y3mskfXj2i",
  "data/tweet-wsj/2022/3/1498458010838085637.json": "“From Fortress Russia to Rubble Russia in a week.” How the West turned back the clock on 30 years of post-Cold War engagement with Russia. https://t.co/6ps28PO8sZ",
  "data/tweet-wsj/2022/3/1498561189323882500.json": "New Zealand, a close U.S. ally, has been limited in how far it can go punishing Russia over its invasion of Ukraine https://t.co/BPeQiyC0uD",
  "data/tweet-wsj/2022/3/1498553695730126849.json": "Target says it will pay employees as much as $24 an hour in some markets as part of efforts to boost pay and benefits for its staff  https://t.co/p9gKUbsGCB",
  "data/tweet-wsj/2022/3/1498591388937687042.json": "Russian forces struck the central square of the Ukrainian city of Kharkiv as Moscow, frustrated in its plans for a quick victory, switched to a new strategy of pummeling civilian areas in an attempt to demoralize Ukrainian resistance https://t.co/v9ojbYzRwj",
  "data/tweet-wsj/2022/3/1498504565502660614.json": "Toyota said a computer virus at Kojima, a supplier of plastic parts for car interiors, led to the shutdown Tuesday at all of the car maker’s factories in Japan https://t.co/qFggIjCn2j",
  "data/tweet-wsj/2022/3/1498613786051239938.json": "Netflix said it has no plans to add any Russian channels to its service there despite a regulation that would require the streaming giant to carry several Russian state-run broadcasters  https://t.co/u5YNs4h6jW",
  "data/tweet-wsj/2022/3/1498606537434140675.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/FS29wFUpiX",
  "data/tweet-wsj/2022/3/1498640474478948353.json": "Watch: Russian rockets hit Ukraine’s civilian areas as a miles-long convoy of Russian armored vehicles inched closer to Kyiv https://t.co/g9LQ72BtEh",
  "data/tweet-wsj/2022/3/1498648013035737088.json": "On Yellowstone's 150th anniversary, here's a look at how America's first national park paved the way for others across the U.S., and what’s in store to preserve its future https://t.co/mP7Tvy07zj",
  "data/tweet-wsj/2022/3/1498470616327933957.json": "President Biden is expected to address Ukraine, Covid-19 and his Build Back Better agenda when he speaks before Congress Tuesday evening. Here's what to know about the State of the Union. https://t.co/7IfHXrKEZa",
  "data/tweet-wsj/2022/3/1498670677892734979.json": "As Russian attacks mount, Ukraine’s President Zelensky delivered an emotional video address to the European Parliament: “We are giving our lives for the right to be equal” https://t.co/ftOpGqI8L5",
  "data/tweet-wsj/2022/3/1498663106406494212.json": "Far from the war zone, the Russian invasion of Ukraine is causing major disruptions for the global shipping industry. Hundreds of vessels are trapped and freight rates have surged. https://t.co/ZPk1roI9LM",
  "data/tweet-wsj/2022/3/1498677554424827909.json": "Heard on the Street: Russia’s economic isolation is a boon for China in some ways but sends a strong signal on the West’s willingness and ability to employ brutal financial sanctions when roused https://t.co/P39jVucDgO",
  "data/tweet-wsj/2022/3/1498674469702877187.json": "The International Skating Union announced a ban on Russian figure skaters ahead of the world championships in late March https://t.co/czMbgxhhYl",
  "data/tweet-wsj/2022/3/1498685767056605185.json": "The number of Ukrainian refugees fleeing the country is rising rapidly and reached 660,000 early Tuesday, according to the United Nations refugee agency. If the situation escalates, 4 million people could flee, the agency said. https://t.co/YNnIjJFfRi",
  "data/tweet-wsj/2022/3/1498696694573289478.json": "U.S. and other major oil-consuming nations will release 60 million barrels of oil from emergency stockpiles amid a price surge caused by the Ukraine crisis https://t.co/B0aIzEvtCD",
  "data/tweet-wsj/2022/3/1498636721356955651.json": "What to know about Vladimir Putin's nuclear arsenal https://t.co/Gk6ZPslqrf",
  "data/tweet-wsj/2022/3/1498702617349926912.json": "The Russian advance on Kyiv has \"stalled amid food and fuel shortages, Ukrainian resistance, and slower than expected troop movement toward the capital,\" a senior U.S. defense official said https://t.co/ldEp6vM2DK",
  "data/tweet-wsj/2022/3/1498701363206893581.json": "“I live in fear, but not for myself.” A children’s hospital in Kyiv is under strain—and doctors are bracing for an influx of casualties. https://t.co/N5cOnbnSGM",
  "data/tweet-wsj/2022/3/1498710154761670665.json": "The U.S. and other producers are set to release oil from their emergency stockpiles as crude prices surge, amid supply concerns after Russia invaded Ukraine, explains @ahirtens #WSJWhatsNow https://t.co/LreE3yJe0P https://t.co/rLqUilbU9A",
  "data/tweet-wsj/2022/3/1498715979307798544.json": "Russian booze is getting the boot from more American shelves, as state leaders denounce the country’s invasion of Ukraine https://t.co/wgbMb5KGss",
  "data/tweet-wsj/2022/3/1498723511841472515.json": "From @WSJopinion: Ukraine’s fight for survival ought to give us some pause from the hysterical tenor of our domestic political debate, writes @gerardtbaker. It’s a reminder that freedom isn’t something we can take for granted. https://t.co/27KAkh0O7S",
  "data/tweet-wsj/2022/3/1498727345812824065.json": "With a website and social-media channel, Ukrainians are posting about Russian military deaths that Moscow hasn’t disclosed. “Those are the horrors of war launched by your president.” https://t.co/yayjH1c28s",
  "data/tweet-wsj/2022/3/1498738609029099527.json": "Several Russian oligarchs are rushing to distance themselves from Russian President Vladimir Putin, as Western countries threaten to squeeze their assets with an unprecedented sanctions drive https://t.co/VBzXEijZZP",
  "data/tweet-wsj/2022/3/1498746174009978893.json": "The International Criminal Court opened an investigation into possible war crimes in Ukraine, an early step in a process that potentially could lead to Russian President Vladimir Putin and other Kremlin leaders being charged at The Hague https://t.co/bLblZxTctq",
  "data/tweet-wsj/2022/3/1498742410926563328.json": "For 20 years, Russia had a partner in global sports institutions. It installed Putin associates in governance roles and cleared the way for Russian athletes to compete despite an elaborate, state-sponsored doping scheme. That order came crashing down. https://t.co/75yrRfD7sF",
  "data/tweet-wsj/2022/3/1498753720863100938.json": "With time potentially running out for Kyiv amid escalating Russian attacks, the U.S. and its allies face limited supply routes and challenges in providing Ukraine with the right weapons https://t.co/nzvHEp8Kr9",
  "data/tweet-wsj/2022/3/1498712201649082376.json": "The son of Microsoft Chief Executive Satya Nadella has died, a spokesperson for the company said. Zain Nadella, who was in his mid-20s, was born with cerebral palsy, which his father has credited for softening his outlook on work and life. https://t.co/SYAallMu12",
  "data/tweet-wsj/2022/3/1498761285080649733.json": "The operator of the Nord Stream 2 gas pipeline connecting Russia with Germany has laid off more than 100 workers and wound down its operations, according to a Swiss official https://t.co/FsZwK1vAye",
  "data/tweet-wsj/2022/3/1498773496440266754.json": "Apple has stopped selling all of its products in Russia following the country’s invasion of Ukraine\nhttps://t.co/hbsT9XKfco",
  "data/tweet-wsj/2022/3/1498772727590793220.json": "How Volodymyr Zelensky rose from television comedian to become Ukraine's wartime leader https://t.co/byOKhlOy8o",
  "data/tweet-wsj/2022/3/1498768817505378311.json": "YouTube parent Google said Tuesday that the online-video platform would block access to Russian state-controlled media channels RT and Sputnik for users in Europe effective immediately https://t.co/NH5M4y7J60",
  "data/tweet-wsj/2022/3/1498765068548419598.json": "Russian forces struck Kyiv's iconic TV tower, temporarily disabling the broadcasting ability of Ukraine’s central television channels. Follow our live coverage. https://t.co/EdbOZMYWdN",
  "data/tweet-wsj/2022/3/1498783901648834561.json": "The Florida teen who garnered attention for tracking Elon Musk’s private jet is now publicizing the movements of planes owned by Russian oligarchs and aircraft associated with Vladimir Putin https://t.co/fpYMz4f578",
  "data/tweet-wsj/2022/3/1498809666977112066.json": "Breaking: The U.S. is expected to ban Russian planes from its airspace, people familiar with the matter say, following prohibitions by Europe and Canada https://t.co/UZRnZALKBO",
  "data/tweet-wsj/2022/3/1498823429327405063.json": "Exxon said it is halting operations at a multibillion-dollar oil and gas project in Russia and will make no further investments in the country https://t.co/wMczphfe7R",
  "data/tweet-wsj/2022/3/1498795293273321473.json": "Pfizer's Covid-19 vaccine was highly effective at reducing the risk of severe disease in children 17 years and younger during the Omicron surge but didn’t work as well at preventing infection, according to a new government study https://t.co/aJMfFpBJRc",
  "data/tweet-wsj/2022/3/1498839580782604289.json": "President Biden delivers the State of the Union address https://t.co/9HiSzeDhng",
  "data/tweet-wsj/2022/3/1498838393169629186.json": "Among first lady Jill Biden's guests at the State of the Union will be Frances Haugen, a former Facebook employee who gained attention last year for disclosing documents showing how the company struggled to deal with harms from its products #SOTU https://t.co/A1NyuuXRgn",
  "data/tweet-wsj/2022/3/1498825953107230722.json": "Oksana Markarova, Ukraine’s ambassador to the U.S., will be among the guests joining first lady Jill Biden in her viewing box at Tuesday’s State of the Union address, the White House said https://t.co/t3eyjpucEs",
  "data/tweet-wsj/2022/3/1498852272289292292.json": "President Biden defended the $1.9 trillion American Rescue Plan in his State of the Union address. Some economists argue that the Democrats’ Covid-relief law, which passed nearly a year ago, was too big and helped fuel high inflation. #SOTU https://t.co/OjaOKDL6pZ",
  "data/tweet-wsj/2022/3/1498847663646773248.json": "“Let each of us here tonight stand and send an unmistakable signal to the world and Ukraine,” President Biden said during his State of the Union address. “Yes, we the United States of America stand with the Ukrainian people.” #SOTU https://t.co/NVRip8Qtp9",
  "data/tweet-wsj/2022/3/1498854437246353415.json": "President Biden made a renewed push at the #SOTU for his tax-policy agenda, which would cut taxes on lower-income households and raise taxes on high-income people and companies https://t.co/sG8cEVkNl4",
  "data/tweet-wsj/2022/3/1498862846930731008.json": "Nodding to Facebook whistleblower Frances Haugen, President Biden pushed Congress to adopt new online privacy protections for children as part of his effort to address what the White House terms a national mental health crisis #SOTU https://t.co/vCvOUtQ8Nf",
  "data/tweet-wsj/2022/3/1498871223526305793.json": "\"We should all agree, the answer is not to defund the police,\" President Biden said during the #SOTU. \"The answer is to fund the police with the resources and training they need to protect our communities.\" https://t.co/Bjxub2VVFC",
  "data/tweet-wsj/2022/3/1498863785272127492.json": "Iowa Gov. Kim Reynolds delivers the Republican response to the State of the Union address https://t.co/rT2ccNe1F1",
  "data/tweet-wsj/2022/3/1498836762780647426.json": "Hollywood studios, Netflix, big-ticket rock bands and sporting events are pausing or pulling their business out of Russia in response to President Vladimir Putin’s invasion of neighboring Ukraine https://t.co/m8xVv2Dul9",
  "data/tweet-wsj/2022/3/1498900952300011523.json": "How Volodymyr Zelensky rose from television comedian to become Ukraine's wartime leader https://t.co/0poJOb3Tx4",
  "data/tweet-wsj/2022/3/1498904714997641221.json": "From @WSJopinion: The Biden administration should see this conflict for what it is: a big Russian mistake, writes @ProfessorHannah. Putin’s overconfident assessment of his own power has been matched by his underestimation of Ukrainian resolve. https://t.co/ABEviPJtgs",
  "data/tweet-wsj/2022/3/1498861204290342923.json": "Saying the U.S. has “reached a new moment in the fight against Covid-19,” President Biden announced a “Test to Treat” initiative so people can get tested at a pharmacy, and if they’re positive, receive antiviral pills on the spot #SOTU (corrects link) https://t.co/MDGjXGXIaJ",
  "data/tweet-wsj/2022/3/1498916063463026688.json": "The Florida teen who garnered attention for tracking Elon Musk’s private jet is now publicizing the movements of planes owned by Russian oligarchs and aircraft associated with Vladimir Putin https://t.co/1IUFG5sZmm",
  "data/tweet-wsj/2022/3/1498908497496481794.json": "Global companies with IT staff in Ukraine are working to stay in contact with software teams on the ground in some of the hardest hit areas of the country as invading Russian forces increasingly set their sights on civilian targets https://t.co/V4IW4vnfba",
  "data/tweet-wsj/2022/3/1498897179712311296.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/Up5Mtpq5Gw",
  "data/tweet-wsj/2022/3/1498931166224785408.json": "With a website and social-media channel, Ukrainians are posting about Russian military deaths that Moscow hasn’t disclosed. “Those are the horrors of war launched by your president.” https://t.co/4onVWyKYa3",
  "data/tweet-wsj/2022/3/1498912253856428032.json": "The Russian invasion of Ukraine has driven demand for cryptocurrencies in both countries, helping boost the price of bitcoin https://t.co/5eXGBqsU3R",
  "data/tweet-wsj/2022/3/1498880535053099008.json": "President Biden united the room in solidarity with Ukraine during his State of the Union address, but it didn’t last. Here are six takeaways from his first #SOTU. https://t.co/1OOrvpFamF",
  "data/tweet-wsj/2022/3/1498938692668465154.json": "The 60,000-ton merchant ship that caught fire last month carrying around 4,000 Lamborghini, Porsche, Bentley, Audi, and Volkswagen vehicles sank in the Atlantic Ocean https://t.co/vY3HpZkWqj",
  "data/tweet-wsj/2022/3/1498946238930210823.json": "Russian forces resumed airstrikes on Ukraine’s second-largest city and continued pounding other cities as they sought to break the will of Ukraine’s resistance https://t.co/uLJpkYSy8e",
  "data/tweet-wsj/2022/3/1498800268468760578.json": "Senate Minority Leader Mitch McConnell rebuked a policy agenda crafted by fellow Republican Sen. Rick Scott, saying it would raise taxes on lower-income Americans https://t.co/QV4C5ETqPg",
  "data/tweet-wsj/2022/3/1498790487431553024.json": "President Biden will say in his State of the Union address that Putin miscalculated by invading Ukraine and underestimated the response from Western allies https://t.co/QDiSbSARZS",
  "data/tweet-wsj/2022/3/1498996930134880257.json": "President Biden announced new sanctions against Russia in his first State of the Union address and sought to reassure Americans that the U.S. economy would face limited knock-on effects #SOTU #WSJWhatsNow https://t.co/p6WKS4IX9l https://t.co/Mebg0S0VT9",
  "data/tweet-wsj/2022/3/1498857554151186439.json": "In his prepared #SOTU remarks, President Biden mentioned Afghanistan only in reference to supporting American veterans and mentioned China just twice, leaving thorny foreign policy challenges unmentioned https://t.co/mHOvvEgfjS",
  "data/tweet-wsj/2022/3/1498999118680756229.json": "The Biden administration is preparing to confront China on its industrial subsidies and seek ways to protect America’s edge in new technologies https://t.co/tdLblB0639",
  "data/tweet-wsj/2022/3/1499010415900168200.json": "Jihadist cells in Africa are infiltrating as far as Ghana and Ivory Coast, the world’s top cocoa producers, as western counterterrorism strategy stutters https://t.co/PJHAQZaN8p",
  "data/tweet-wsj/2022/3/1499017960656097285.json": "After playing down U.S. warnings of a Russian invasion, China is struggling to evacuate its citizens—while fighting a perception in Ukraine that it has sided with Moscow https://t.co/GmdO7s6ZlE",
  "data/tweet-wsj/2022/3/1499014183001669633.json": "During President Biden’s State of the Nation address, he garnered bipartisan applause as he warned Russia that more coordinated measures were coming in response to its invasion of Ukraine. He also laid out ways to help tame inflation. https://t.co/F4mq3vHLe6",
  "data/tweet-wsj/2022/3/1499073957877760000.json": "Russian tycoon Roman Abramovich is trying to sell his English soccer club Chelsea FC, a person familiar with the matter said, amid calls by some U.K. lawmakers for him to face sanctions over his past ties to the Kremlin https://t.co/J0j2WBtnPT",
  "data/tweet-wsj/2022/3/1499087708039397386.json": "U.N. members voted 141 to 5 to condemn Russian President Vladimir Putin’s “special military operation” in Ukraine and affirm that no territorial gains stemming from the use of force—or threatened use of force—will be recognized as legal there https://t.co/tnnULqwowR",
  "data/tweet-wsj/2022/3/1499092185798561792.json": "Local residents and doctors in a Belarusian border city said a steady flow of wounded Russian soldiers have arrived for treatment in recent days. “There has been a constant flow.” https://t.co/zVf5Oj2RWv",
  "data/tweet-wsj/2022/3/1499097258641526785.json": "Putin sees NATO as a threat and has sought to use Ukraine's potential membership as a reason for his invasion. Here's what to know about the alliance. https://t.co/PrBWsyCld8",
  "data/tweet-wsj/2022/3/1499104786075037697.json": "The U.S. and its NATO allies are coming under increasing pressure to do more to help Ukraine, even as they face diminishing options for doing so https://t.co/3TYes6n4bU",
  "data/tweet-wsj/2022/3/1499123641392537605.json": "The Biden administration has canceled a routine test launch of an Air Force Minuteman III missile to avoid escalating nuclear tensions with Russia, U.S. officials said Wednesday https://t.co/Wv1ImwTd6s",
  "data/tweet-wsj/2022/3/1499119925050413068.json": "From @WSJopinion: European governments are scrambling to shore up their natural gas supply if Russia cuts off exports. But one question worth raising: How in the world did Europe leave itself so vulnerable to Vladimir Putin’s energy extortion?\nhttps://t.co/ByQjX4vMK0",
  "data/tweet-wsj/2022/3/1499127501020446726.json": "While Vladimir Putin faces united Western opposition to his Ukraine onslaught, a key question for him and his economy is where China and India will land, writes @GeraldFSeib https://t.co/v3M7s9Ipse",
  "data/tweet-wsj/2022/3/1499146305456672770.json": "To Ukrainian Jews, Russian President Vladimir Putin’s false claims that Kyiv is controlled by American-sponsored neo-Nazis is an insult to the memory of the Holocaust, especially now that Moscow is indiscriminately shelling Ukrainian cities https://t.co/SCsFZFsYWh",
  "data/tweet-wsj/2022/3/1499142538342588416.json": "The International Court of Justice has scheduled public hearings beginning Monday on Ukraine’s claims against Russia under the Genocide Convention, expediting proceedings in light of Moscow’s February invasion of its neighbor https://t.co/93Y3gFsqz4",
  "data/tweet-wsj/2022/3/1499134971251994628.json": "Amid an increasingly violent Russian invasion, Ukraine’s long-vibrant software sector is managing to churn out code for clients overseas and help the country’s war effort https://t.co/jXPeyf8tru",
  "data/tweet-wsj/2022/3/1499094701902860299.json": "From @WSJopinion: Olaf Scholz has risen to the occasion. Now it is President Biden’s turn, writes @BillGalston. As Germany begins its rearmament, the U.S. must continue to help Ukraine’s resistance. https://t.co/AoHtkIOozs",
  "data/tweet-wsj/2022/3/1499157709387702272.json": "From @WSJopinion: Putin’s isolation and miscalculation make him dangerous but they also make him vulnerable, writes @HolmanJenkins. His regime is destroying itself over a fictional threat of NATO aggression. https://t.co/IyAQZLhXJY",
  "data/tweet-wsj/2022/3/1499167690212184067.json": "Former Illinois House Speaker Michael Madigan was indicted Wednesday by a federal grand jury on charges of racketeering conspiracy, bribery, wire fraud and extortion https://t.co/isYFrvkbZB",
  "data/tweet-wsj/2022/3/1499162655516467201.json": "Roughly $1.2 billion of Visa's annual net revenue comes from Russia and Ukraine, where sanctions and war have made it difficult to do business https://t.co/UIvRTQH3YC",
  "data/tweet-wsj/2022/3/1499150074768723977.json": "Ukraine’s government is seeking a fast track to join the European Union as the country fights a Russian invasion. Here's why Ukraine’s request for EU membership is a long shot. https://t.co/bmDWM5hPFz",
  "data/tweet-wsj/2022/3/1499200392671993857.json": "Russia’s Defense Ministry acknowledged extensive losses for the first time, saying 498 Russian troops have been killed. Ukraine hasn’t released casualties, but says its military has killed 5,840 Russian troops, and put civilian death toll at about 2,000. https://t.co/nFLUGr5AXi",
  "data/tweet-wsj/2022/3/1499198133183696899.json": "A Texas judge granted a request by the parents of a transgender teen girl to temporarily forbid the state from investigating whether helping their daughter obtain certain medical treatments constituted child abuse https://t.co/11VKVZnArh",
  "data/tweet-wsj/2022/3/1499193356102115329.json": "Russian missile debris fell near Kyiv’s central train station on Wednesday night, where thousands of civilians are sheltering as they await evacuation. Ukrainian officials said the missile was shot down by Kyiv’s air defenses. https://t.co/YD0tScL6vK",
  "data/tweet-wsj/2022/3/1499188621252960268.json": "Elon Musk offered advice to Ukraine Wednesday on how to keep Starlink, the satellite-based internet service provided by SpaceX, operating as the country battles invading Russian forces https://t.co/ljn4ozbVDI",
  "data/tweet-wsj/2022/3/1499184043853811716.json": "U.S. officials are increasingly concerned that Sudan’s military junta will allow Russia to build a naval base on the country’s strategic Red Sea coast https://t.co/uj1HxCCmyy",
  "data/tweet-wsj/2022/3/1498788951703928833.json": "Major League Baseball canceled its opening games after owners and locked-out players failed to agree on a new labor contract https://t.co/UFCUT79oya",
  "data/tweet-wsj/2022/3/1499101013390897160.json": "Apple sent an invitation for a product-launch event scheduled for March 8, which is expected to reveal a new, cheaper iPhone https://t.co/jPdFhWKlgb",
  "data/tweet-wsj/2022/3/1499244435162415105.json": "The Florida teen who garnered attention for tracking Elon Musk’s private jet is now publicizing the movements of planes owned by Russian oligarchs and aircraft associated with Vladimir Putin https://t.co/1f5b1MKdSt",
  "data/tweet-wsj/2022/3/1499243612474859521.json": "The House Jan. 6 panel said in a court filing that it has evidence to suggest former President Trump violated several laws in an attempt to keep Congress from certifying President Biden’s victory https://t.co/0JRMw2uNIH",
  "data/tweet-wsj/2022/3/1499220664087199745.json": "The U.N. refugee agency says 1 million people have fled Ukraine since Russia’s invasion: \"For many millions more, inside Ukraine, it’s time for guns to fall silent, so that life-saving humanitarian assistance can be provided.\" https://t.co/bO4o17jBVS",
  "data/tweet-wsj/2022/3/1499267093501521926.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/2VUeKsnJtu",
  "data/tweet-wsj/2022/3/1499180296960364544.json": "A state court judge dismissed the New York Attorney General’s attempt to dissolve the National Rifle Association https://t.co/CJQOfPwXvJ",
  "data/tweet-wsj/2022/3/1499221790308339712.json": "Here's what to know about Russian oligarchs and why they're facing heightened scrutiny by Western governments amid the Ukraine crisis https://t.co/8oLcIOOvNa",
  "data/tweet-wsj/2022/3/1499040610120085506.json": "Airlines world-wide are altering routes and canceling flights to avoid Russian airspace, changes that will lengthen journey times and raise costs for carriers that were starting to bounce back from their pandemic slump https://t.co/HFev0calrn",
  "data/tweet-wsj/2022/3/1499356696598224898.json": "Russia’s war on Ukraine has unleashed auto makers’ third supply-chain crisis in as many years https://t.co/Os4rK49MOc",
  "data/tweet-wsj/2022/3/1499366220847632390.json": "Broadcasters around the world are buying the rights to “Servant of the People,” an old TV show starring Ukrainian President Volodymyr Zelensky as the Ukrainian president #WSJWhatsNow https://t.co/KjIVhYDGXU https://t.co/UgcX2jOV6Z",
  "data/tweet-wsj/2022/3/1499365249727840261.json": "French authorities said they seized a yacht belonging to Russian oligarch Igor Sechin, who is among a group of individuals sanctioned by the EU https://t.co/llathLKWSA",
  "data/tweet-wsj/2022/3/1499375311355527174.json": "Volkswagen on Thursday joined other western car makers in suspending production of all vehicles at its factories in Russia, citing its “great dismay and shock” over Russia’s invasion of Ukraine https://t.co/XKhGBZxIgA",
  "data/tweet-wsj/2022/3/1499380336635097091.json": "French authorities said they seized a yacht belonging to a company majority owned by Igor Sechin, the chief executive of Russian oil producer Rosneft who was among a group of individuals sanctioned by the European Union over Russia’s invasion of Ukraine https://t.co/3TYu7vskyS",
  "data/tweet-wsj/2022/3/1499372795310096385.json": "The protests that rocked Canada are over, but they have undermined Canadians’ faith in their government and hurt the image of Prime Minister Justin Trudeau, new polling shows https://t.co/09YmEHB9Px",
  "data/tweet-wsj/2022/3/1499347608527118340.json": "Businesses that divest from Russia will have to book big losses on their income statements https://t.co/Ja2doOoqVZ",
  "data/tweet-wsj/2022/3/1499206710677934084.json": "Attorney General Merrick Garland said Wednesday that the Justice Department is launching an interagency task force focused on enforcing U.S. sanctions, export restrictions and economic countermeasures imposed on Russia https://t.co/tpingPBmsW",
  "data/tweet-wsj/2022/3/1499397456517206024.json": "Iran significantly increased its stockpile of highly enriched uranium, moving closer than ever to having enough near-weapons grade material for a nuclear weapon, the U.N. atomic agency reported https://t.co/6AhKyNW8jJ",
  "data/tweet-wsj/2022/3/1499414308140290053.json": "On Feb. 4, Xi Jinping and Vladimir Putin declared their countries’ friendship had “no limits.” Then Russia invaded Ukraine. https://t.co/rRjyJ7TFWL",
  "data/tweet-wsj/2022/3/1499406809416843275.json": "From @WSJopinion: The U.S. doesn’t want to fight the Russian army and air force, but the moral and political price will be high if it watches from the sidelines as Ukrainians die by the thousands\nhttps://t.co/Ac1jwa49Xi",
  "data/tweet-wsj/2022/3/1499402989135708161.json": "Melinda French Gates says she told Mr. Gates she didn’t like Mr. Epstein and regretted meeting the convicted sex offender herself; \"I had nightmares about it afterwards.\" https://t.co/CSkGyYDRbD",
  "data/tweet-wsj/2022/3/1499421910987325445.json": "\"In crypto we trust, for Ukraine we pray.\" Ukraine’s largest crypto exchange, Kuna, set up a fund to accept crypto donations, which have helped finance military equipment and medical supplies. https://t.co/QjZaHQYQWc",
  "data/tweet-wsj/2022/3/1499418083487850503.json": "The Biden administration has increased to $10 billion the amount of money it is seeking immediately from Congress in aid for Ukraine and Eastern European partners https://t.co/xLGKoKdm0E",
  "data/tweet-wsj/2022/3/1499439569854509059.json": "In an exclusive excerpt from his new memoir, former Attorney General William Barr recalls confronting President Trump and rejecting his claims of election fraud: “They are bullshit” https://t.co/C54qhEdPqd",
  "data/tweet-wsj/2022/3/1499455853254094854.json": "President Biden held a video call Thursday with the leaders of Australia, India and Japan—known as the Quad—\"to discuss the war against Ukraine and its implications for the Indo-Pacific,\" the White House said https://t.co/1Sp647eaoD",
  "data/tweet-wsj/2022/3/1499471052136751110.json": "Talks ended between Russia and Ukraine without a deal on a cease-fire, but the two sides agreed to organize corridors for civilian evacuations and to deliver food and medicine to besieged cities https://t.co/tY3ICzo0Ny",
  "data/tweet-wsj/2022/3/1499467194002022408.json": "Companies including Microsoft, SpaceX and Airbnb are offering assistance beyond humanitarian aid to Ukraine, helping guard against cyberattacks, setting up internet services, and providing refugees with free housing https://t.co/C4HdT02kze",
  "data/tweet-wsj/2022/3/1499474765161062405.json": "Airlines around the world are rerouting flight paths after the recent surge of airspace-travel restrictions following Russia’s invasion of Ukraine, while experts warn that flight times will increase, costs will rise and revenues will drop in response https://t.co/Umv1tMTJJC",
  "data/tweet-wsj/2022/3/1499478495172481029.json": "The moon is about to get another crater: A four-ton hunk of space junk will careen into the lunar surface early Friday. Astronomers say it will be the first unintentional impact of human-made debris on the lunar surface. https://t.co/K1tCDiFik0",
  "data/tweet-wsj/2022/3/1499497372996575240.json": "A bipartisan group of lawmakers unveiled a bill that would ban domestic imports of Russian crude oil, petroleum, liquefied natural gas and coal, in a step aimed at choking a critical source of revenue for Russian President Vladimir Putin https://t.co/pbxNBZwq1l",
  "data/tweet-wsj/2022/3/1499504934093471746.json": "The Ukrainian defense of Hostomel Airport was a crucial turning point in the early days of Russia’s invasion. Defenders blocked Russia from using the landing strip, forced it to move soldiers and supplies over land and prevented a move on Kyiv. https://t.co/iPnqka85No",
  "data/tweet-wsj/2022/3/1499520075405180933.json": "From @WSJopinion: Ukraine voluntarily surrendered its post-Soviet arsenal. Now that seems like a mistake, write John Ullyot and Thomas D. Grant https://t.co/adh5yaonzU",
  "data/tweet-wsj/2022/3/1499528856016936964.json": "The Biden administration is granting Temporary Protected Status to Ukrainians present in the U.S. after their country came under attack, Homeland Security Secretary Alejandro Mayorkas announced on Thursday https://t.co/If3346FOwI",
  "data/tweet-wsj/2022/3/1499553210113085440.json": "Ukraine's foreign minister, Dmytro Kuleba, said on Twitter that Russian troops were shelling Europe’s largest nuclear power plant in the southern city of Enerhodar https://t.co/NI3TnlQzOf",
  "data/tweet-wsj/2022/3/1499545174300667920.json": "Essay: Nuclear weapons were once thought to deter conventional conflict. Now Russia is using them to shield its aggression—an example China is watching. https://t.co/Hm69RnQ9rN",
  "data/tweet-wsj/2022/3/1499535183208271873.json": "“An awkward nexus.” Xi Jinping and Vladimir Putin presented a united front against the U.S. on Feb. 4. That’s now proving a problem for China. https://t.co/mo39juNnWV",
  "data/tweet-wsj/2022/3/1499448293981626374.json": "From @WSJopinion: In the U.S. we’re shocked at the images from Ukraine, writes @DanHenninger. Whether we’re willing to change our own complacent status quo in the face of manifestly real external and internal threats to our security is less clear. https://t.co/LafrXkaeVb",
  "data/tweet-wsj/2022/3/1499572133290201107.json": "President Biden spoke with Ukrainian President Volodymyr Zelensky about the situation at Ukraine’s Zaporizhzhia nuclear power plant Thursday night Washington time, according to an administration official https://t.co/kFgphvYSQI",
  "data/tweet-wsj/2022/3/1499570071424933892.json": "Ukrainian officials said Russian forces shelled Ukraine’s Zaporizhzhia nuclear power plant, the largest in Europe, prompting Ukraine’s foreign minister to call for a ceasefire so authorities can secure the area https://t.co/H37gpoWw2D",
  "data/tweet-wsj/2022/3/1499517489402757122.json": "Venezuela asks Wall Street debtholders to help get U.S. sanctions lifted so its oil can flow again https://t.co/eHGovxr0S3",
  "data/tweet-wsj/2022/3/1499589874940362752.json": "A fire at Ukraine’s Zaporizhzhia nuclear power plant, the largest nuclear power plant in Europe, didn't affect essential equipment at the facility, according to the United Nations' International Atomic Energy Agency https://t.co/6eOKySZ4wO",
  "data/tweet-wsj/2022/3/1499595559178489858.json": "From @WSJopinion: Putin’s disdain for the will of the Ukrainian people and others in Eastern Europe has led Russia into a new cold war, which Russia will lose as it did the first one, writes @JackDevine_TAG https://t.co/f371sESgm6",
  "data/tweet-wsj/2022/3/1499601544542666752.json": "South Carolina Sen. Lindsey Graham said Thursday night that Russian President Vladimir Putin should be assassinated by his own people, suggesting it would be the only way to end the crisis in Ukraine https://t.co/iyW4pAvQyv",
  "data/tweet-wsj/2022/3/1499599752375197696.json": "“Only immediate action can stop the Russian troops. Do not let Europe die in the nuclear catastrophe,” Ukrainian President Volodymyr Zelensky said in a video stating that Russia’s actions show “Europe needs to wake up.” https://t.co/eUsPCZObCY",
  "data/tweet-wsj/2022/3/1499599300082425869.json": "The Ukrainian defense of Hostomel Airport was a crucial turning point in the early days of Russia’s invasion. Defenders blocked Russia from using the landing strip, forced it to move soldiers and supplies over land and prevented a move on Kyiv. https://t.co/MNJVyDAOk4",
  "data/tweet-wsj/2022/3/1499587986689859584.json": "Media coverage of Russian troops invading Ukraine is unfolding differently in Russia than in the U.S. Using maps and disinformation, many television programs are shaping public opinion by justifying Moscow’s decision to attack its neighbor. https://t.co/3e8EYMT4Z3",
  "data/tweet-wsj/2022/3/1499612582843461633.json": "Airbnb is suspending operations in Russia and Belarus, becoming the latest Western company to pause its business following the invasion of Ukraine https://t.co/e9EOiefrvr",
  "data/tweet-wsj/2022/3/1499625709349871617.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/pl3vjU3Lpn",
  "data/tweet-wsj/2022/3/1499229350658547717.json": "Russian forces have performed poorly thus far, but Ukraine’s military is expected to eventually crack. Five factors will shape the outcome. https://t.co/kPhC6Z7gKb",
  "data/tweet-wsj/2022/3/1499608088055357440.json": "Here's what to know about Russian oligarchs and why they're facing heightened scrutiny by Western governments amid the Ukraine crisis https://t.co/NjytrMUYCZ",
  "data/tweet-wsj/2022/3/1499648361095434241.json": "Russian shelling in southern Ukraine caused a fire at the compound housing Europe’s largest nuclear power plant, highlighting the increasingly indiscriminate nature of the war pursued by Moscow https://t.co/PQZS7hse1Z",
  "data/tweet-wsj/2022/3/1499686143167799297.json": "The Ukrainian defense of Hostomel Airport was a crucial turning point in the early days of Russia’s invasion. Defenders blocked Russia from using the landing strip, forced it to move soldiers and supplies over land and prevented a move on Kyiv. https://t.co/gTEQUiXD7k",
  "data/tweet-wsj/2022/3/1499693666268557317.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/1GBzZjo4mX",
  "data/tweet-wsj/2022/3/1499721470922080257.json": "Companies including Microsoft, SpaceX and Airbnb are offering assistance beyond humanitarian aid to Ukraine, helping guard against cyberattacks, setting up internet services, and providing refugees with free housing https://t.co/Usx9WApOIW",
  "data/tweet-wsj/2022/3/1499754060706197514.json": "A $600 million Superyacht, Swiss mansions, and billions in assets at stake: Governments are hitting some of Russia’s richest citizens with sanctions over the Ukraine war https://t.co/wlz3nMbCe5",
  "data/tweet-wsj/2022/3/1499739535521071112.json": "The U.S. added 678,000 jobs in February and the jobless rate fell to 3.8%, signs of a robust labor market as the Fed prepares to raise rates https://t.co/Jc5eXctYFL",
  "data/tweet-wsj/2022/3/1499766875613536263.json": "RT America is pulling the plug: The company behind the Kremlin-backed network sent a memo to staff announcing that it is ceasing production and laying off most of its staff as a result of “unforeseen business interruption events” https://t.co/X6R1JXBO7t",
  "data/tweet-wsj/2022/3/1499701220147138563.json": "The moon is about to get another crater: A four-ton hunk of space junk will careen into the lunar surface early Friday. Astronomers say it will be the first unintentional impact of human-made debris on the lunar surface. https://t.co/xkhpHfpoiS",
  "data/tweet-wsj/2022/3/1499788041824653317.json": "Tesla has got approval in Germany to formally begin electric-vehicle productions at its new plant outside Berlin, a key pillar of CEO Elon Musk’s expansion drive https://t.co/SegIT5TxDT",
  "data/tweet-wsj/2022/3/1499819814222716936.json": "Hundreds of thousands of Ukrainian technology workers have taken part in cyberattacks against Russia’s government, media and financial institutions in recent days, a top Ukrainian cybersecurity official said Friday https://t.co/SENFMAZuOh",
  "data/tweet-wsj/2022/3/1499818233125351425.json": "Sen. Lindsey Graham (R., S.C.) doubled down Friday on his call for the Russian people to assassinate or overthrow Russian President Vladimir Putin, even after a backlash from peers in Congress, as well as from Russian officials https://t.co/btfRvHMxu8",
  "data/tweet-wsj/2022/3/1499829576498823169.json": "Weapons from the West have made make a big difference, as have the Russians’ Soviet-style tactics, Ukrainian officers say. “We go out to hunt and destroy them,” says one Ukranian special-forces team leader on Kyiv’s front lines. https://t.co/NZgwXD6qQJ",
  "data/tweet-wsj/2022/3/1499803135413526531.json": "Ukrainian and international food manufacturers, distributors and aid workers are scrambling to keep grocery stores and pharmacies open, and shelves stocked https://t.co/RytxnperB2",
  "data/tweet-wsj/2022/3/1499789729197404163.json": "The Supreme Court reinstated the death sentence for Boston Marathon bomber Dzhokhar Tsarnaev. An appeals court set aside the sentence after finding trial errors that might have prejudiced the jury (corrects now-deleted tweet that misspelled his first name) https://t.co/mbmOySiN5C",
  "data/tweet-wsj/2022/3/1499840876494864394.json": "Ukraine has accused Russia of using thermobaric weapons. Here’s what makes them so devastating. https://t.co/Vz98lVeVAM",
  "data/tweet-wsj/2022/3/1499855979239952392.json": "From @WSJopinion: Friday marks a month since Xi Jinping and Vladimir Putin signed a declaration that there are “no limits” to their friendship. Pardon Xi if he’s already concluding that with friends like this he doesn’t need enemies. https://t.co/27ArcXZxZW",
  "data/tweet-wsj/2022/3/1499876114902179842.json": "Vice President Kamala Harris will travel next week to Poland and Romania, NATO members that border Ukraine, her spokeswoman said Friday https://t.co/zbZFT40vS2",
  "data/tweet-wsj/2022/3/1499883673172197376.json": "A $600 million Superyacht, Swiss mansions, and billions in assets at stake: Governments are hitting some of Russia’s richest citizens with sanctions over the Ukraine war https://t.co/T7T08rudhw",
  "data/tweet-wsj/2022/3/1499901274992648197.json": "In just one week, Western financial firms severed practically every artery of money between Russia and the rest of the globe. In some cases they went further than what sanctions required. https://t.co/YZMi3mt2Nm",
  "data/tweet-wsj/2022/3/1499844666119933952.json": "Experts say a big hunk of space junk just hit the moon. A NASA orbiter is being enlisted to confirm the impact. https://t.co/ioxihMUPLA",
  "data/tweet-wsj/2022/3/1499927749808594945.json": "Turkish drones, American and British antitank weapons, and antiaircraft missiles, small arms and ammunition from other NATO countries have contributed to Ukraine’s unexpected ability to withstand the Russian assault https://t.co/l3QjFAzvWg",
  "data/tweet-wsj/2022/3/1499923932178259969.json": "Heard on the Street: Sanctions on Russia have shown that central-bank reserves can be taken away—and China is taking note https://t.co/gveM3RbPMX",
  "data/tweet-wsj/2022/3/1499920168012685313.json": "A global watchdog censured the United Arab Emirates for not doing enough in confronting money laundering and terrorism financing activities, adding it to a list of countries requiring increased monitoring https://t.co/WHI74Hp36O",
  "data/tweet-wsj/2022/3/1499950342762602496.json": "News from the Ukraine battlefront some 5,000 miles away has dominated headlines and airwaves in Taiwan—and spurred new interest in battle readiness https://t.co/Q2jPINVmV2",
  "data/tweet-wsj/2022/3/1499838851648528392.json": "Bishop Gustavo Zanchetta, a longtime associate of Pope Francis, was convicted by an Argentine court of sexually assaulting young men in a case that has raised questions about the pope’s handling of sexual abuse at the highest level https://t.co/Czg9XNqqa1",
  "data/tweet-wsj/2022/3/1499972998253760518.json": "People around the world have booked over 60,000 nights in Ukrainian Airbnbs as a way to get aid to residents during the Russian attack https://t.co/IaKi6Ivftf",
  "data/tweet-wsj/2022/3/1499961667517624324.json": "On paper, China’s banks and its homegrown payments system could offer Russia respite from crippling Western sanctions. In practice, it isn’t that simple. https://t.co/6AiI1Wjqvz",
  "data/tweet-wsj/2022/3/1499980566913069057.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/HNUJRh84dK https://t.co/tI3xnyvrEM",
  "data/tweet-wsj/2022/3/1500003221993107458.json": "China’s state-run broadcaster didn’t translate the International Paralympic Committee president’s remarks on war. English soccer broadcasts will also be blacked out this weekend. https://t.co/7cCoK2sHes",
  "data/tweet-wsj/2022/3/1500018350730141699.json": "Russia’s initial struggles in its invasion of Ukraine have offered a vivid illustration to China’s leaders of the military challenges if they tried to seize control of Taiwan through force https://t.co/ZudFYm8cFM",
  "data/tweet-wsj/2022/3/1500025864553213958.json": "Ukraine has accused Russia of using thermobaric weapons. Here’s what makes them so devastating. https://t.co/j90tci1EzO",
  "data/tweet-wsj/2022/3/1500037437627801601.json": "Russia and Ukraine agreed to open humanitarian corridors for evacuating civilians from the besieged eastern Ukrainian cities of Mariupol and Volnovakha https://t.co/bKe6DhyH8H",
  "data/tweet-wsj/2022/3/1500033442016342020.json": "Ukraine is putting up as much of a fight against Russia in cyberspace as it is on the ground https://t.co/7nDj0C4hu4",
  "data/tweet-wsj/2022/3/1500040960100737024.json": "Hundreds of thousands of Ukrainian technology workers have taken part in cyberattacks against Russia’s government, media and financial institutions in recent days, a top Ukrainian cybersecurity official said Friday https://t.co/A6i6yrOHpB",
  "data/tweet-wsj/2022/3/1499999408015958020.json": "China set an economic growth target of around 5.5% for the year, the lowest level in more than a quarter century of economic planning, reflecting heightened domestic and global uncertainties https://t.co/s68VJ82vBi",
  "data/tweet-wsj/2022/3/1500056055329562636.json": "Take a look at the front page of today's Wall Street Journal https://t.co/6Qd0STLl4K https://t.co/Zs5nZ9zHnC",
  "data/tweet-wsj/2022/3/1500081629456388106.json": "An agreement on evacuating civilians from two besieged Ukrainian cities collapsed, as Kyiv accused Moscow of violating the cease-fire https://t.co/Kg8IZmbuBP",
  "data/tweet-wsj/2022/3/1500059815363629056.json": "How much oil does the U.S. import from Russia, and why? What might happen if the U.S. and other countries slow the flow of Russian crude? Here is a look at why the U.S. still imports Russian crude and where it goes. https://t.co/qSg003Vgd4",
  "data/tweet-wsj/2022/3/1500093858352402432.json": "How Volodymyr Zelensky rose from television comedian to become Ukraine's wartime leader https://t.co/NtDWXCOwaL",
  "data/tweet-wsj/2022/3/1500105131244900353.json": "Russia demanded that Western sanctions over Ukraine wouldn’t prevent it from trading with Iran under a revived nuclear deal, potentially derailing the talks https://t.co/75NaVKkLpz",
  "data/tweet-wsj/2022/3/1500086277831643140.json": "The world relies on the financial system’s plumbing—and as Russia has shown in the past week, a few concerted moves can flatten a major economy. “As investors, we need to look at things differently now.” https://t.co/gxJSbPwLt1",
  "data/tweet-wsj/2022/3/1500120210011041794.json": "From @WSJopinion: The people of Ukraine are showing a too complacent West what it means to fight for freedom. The brave resistance to Putin is an inspiration and lesson to the world. https://t.co/6mhEThJra3",
  "data/tweet-wsj/2022/3/1499663481204793346.json": "Get ready for a Sony car: The electronics maker is teaming up with Honda to start selling electric vehicles in 2025 https://t.co/S8BsL2g6q5",
  "data/tweet-wsj/2022/3/1500135327142498304.json": "More than 1.45 million people have left Ukraine, representing the largest and fastest displacement of people in Europe since World War II, the U.N. says https://t.co/cFK2tYe5bR",
  "data/tweet-wsj/2022/3/1500146662047637510.json": "Ukraine is putting up as much of a fight against Russia in cyberspace as it is on the ground https://t.co/sY4DmqkSqo",
  "data/tweet-wsj/2022/3/1500161721444581378.json": "Broadcasters around the world are buying the rights to “Servant of the People,” an old TV show starring Ukrainian President Volodymyr Zelensky as the Ukrainian president #WSJWhatsNow https://t.co/KjIVhYDGXU https://t.co/ncRTLkNkX1",
  "data/tweet-wsj/2022/3/1499912642403655683.json": "U.S. drug regulators approved a new customized, cell-based treatment for blood cancer from Johnson &amp; Johnson that is the first such therapy in the U.S. to be developed initially in China https://t.co/sJTmbUumgM",
  "data/tweet-wsj/2022/3/1500188180854759440.json": "Italian police said they seized a number of yachts and villas scattered around the country from wealthy Russian individuals targeted by European Union sanctions following Russia’s invasion of Ukraine https://t.co/pggcsF4GKa",
  "data/tweet-wsj/2022/3/1500184454635171845.json": "“An awkward nexus.” Xi Jinping and Vladimir Putin presented a united front against the U.S. on Feb. 4. That’s now proving a problem for China. https://t.co/FPDOgg46SD",
  "data/tweet-wsj/2022/3/1500191961902456832.json": "From @WSJopinion: Ukraine’s fight for survival ought to give us some pause from the hysterical tenor of our domestic political debate, writes @gerardtbaker. It’s a reminder that freedom isn’t something we can take for granted. https://t.co/fkEYdaTy5z",
  "data/tweet-wsj/2022/3/1500204523624800256.json": "Aeroflot-Russian Airlines said it is suspending almost all international flights in response to government instructions, increasing Russia’s isolation from the global air transport system https://t.co/yZrWN5vnuC",
  "data/tweet-wsj/2022/3/1500212073233620993.json": "Ukrainian President Volodymyr Zelensky asked for assistance in obtaining more lethal military aid—especially Russian-made jet fighters that Ukrainian pilots can fly—and supported a proposal to ban U.S. imports of Russian oil. https://t.co/HLwYvLkVVI",
  "data/tweet-wsj/2022/3/1500218370033176578.json": "Naftali Bennett’s meeting with Vladimir Putin took place with the blessing of the U.S. administration, the Israeli prime minister’s office said. https://t.co/tPZF4GqtXY",
  "data/tweet-wsj/2022/3/1500225892341088257.json": "Wheat futures are at their highest levels since the global financial crisis, amid Russia’s war in Ukraine #WSJWhatsNow https://t.co/7DRg459mPi https://t.co/NCg8YghicW",
  "data/tweet-wsj/2022/3/1500241005555109895.json": "From @WSJopinion: The Biden administration should see this conflict for what it is: a big Russian mistake, writes @ProfessorHannah. Putin’s overconfident assessment of his own power has been matched by his underestimation of Ukrainian resolve. https://t.co/uffT9dTFWl",
  "data/tweet-wsj/2022/3/1500214664097144833.json": "Russia’s war on Ukraine has unleashed auto makers’ third supply-chain crisis in as many years https://t.co/K9FzCTRx7b",
  "data/tweet-wsj/2022/3/1499984306181185537.json": "The parents of Katie Meyer, the Stanford University soccer team captain who was found dead in a dormitory this week, said that a potential disciplinary action from the university might have contributed to her death https://t.co/2kucK9vqMl",
  "data/tweet-wsj/2022/3/1500267720239161347.json": "The U.S. is exploring a deal in which Poland would send Soviet-era aircraft to Ukraine in return for American F-16 jet fighters https://t.co/JV8E9aD9iB",
  "data/tweet-wsj/2022/3/1500286302146678787.json": "The U.S. National Park Service has roots in the democratic idea that natural beauty should be preserved for public enjoyment. https://t.co/F84sQ9g6XQ",
  "data/tweet-wsj/2022/3/1500278769931665415.json": "In 1862, Congress made paper money legal tender for all debts. What started as a way of paying for the Civil War ended up transforming the American economy.  https://t.co/qEAfNhWnOn",
  "data/tweet-wsj/2022/3/1500297650284994564.json": "Visa and Mastercard are suspending their Russian operations. Among the debit and credit cards issued in Russia, Visa and Mastercard cards accounted for 74% of payment transactions in the country in 2020. https://t.co/XVXWO1sd4k",
  "data/tweet-wsj/2022/3/1500275046505488395.json": "Here's what to know about Russian oligarchs and why they're facing heightened scrutiny by Western governments amid the Ukraine crisis https://t.co/9LTbTmJnbM",
  "data/tweet-wsj/2022/3/1500308951690358784.json": "Canada is opening its doors to an unlimited number of Ukrainians fleeing Russia’s invasion https://t.co/zZu7z7T1dC",
  "data/tweet-wsj/2022/3/1500316491014713345.json": "In the cobblestoned city of Lviv, resisting Russia was part of the local folklore. Now they're making Molotov cocktails out of craft-beer bottles. https://t.co/Zx4ZdZZX44",
  "data/tweet-wsj/2022/3/1500331595793944581.json": "How thermobaric weapons work https://t.co/8oDBZKEQU0",
  "data/tweet-wsj/2022/3/1500358055636180995.json": "On paper, China’s banks and its homegrown payments system could offer Russia respite from crippling Western sanctions. In practice, it isn’t that simple. https://t.co/ihSHE3zxZL",
  "data/tweet-wsj/2022/3/1500365605261791235.json": "Ukrainian President Volodymyr Zelensky brought up instituting a no-fly zone over Ukraine, but said, through a translator, “if you can’t do that, at least get me planes,” according to a person on the call. https://t.co/ewS9VpWmna",
  "data/tweet-wsj/2022/3/1500373141612384256.json": "Nuclear weapons were once thought to deter conventional conflict. Now Russia is using them to shield its aggression—an example China is watching. https://t.co/QY9zXvyhdt",
  "data/tweet-wsj/2022/3/1500380723815104516.json": "News from the Ukraine battlefront some 5,000 miles away has dominated headlines and airwaves in Taiwan—and spurred new interest in battle readiness https://t.co/pMCZGFra44",
  "data/tweet-wsj/2022/3/1500395781479665665.json": "Italy seizes Russian oligarchs’ yachts and villas. The most valuable was the yacht Lady M, estimated to be worth some 65 million euros. https://t.co/wJdWmsyC8c",
  "data/tweet-wsj/2022/3/1500418448333099013.json": "Russian metals giant Norilsk Nickel, a key supplier of nickel and palladium, might be too big to sanction https://t.co/OyNjPj8Wq5",
  "data/tweet-wsj/2022/3/1500433559764574210.json": "Western sanctions on Russia could prove less effective if China offers Moscow access to what some see as the bazaar of choice for rogue nations https://t.co/1GuA6K8D3N",
  "data/tweet-wsj/2022/3/1500448672340926472.json": "From @WSJopinion: Putin’s isolation and miscalculation make him dangerous but they also make him vulnerable, writes @HolmanJenkins. His regime is destroying itself over a fictional threat of NATO aggression. https://t.co/PpB1NrmVoe",
  "data/tweet-wsj/2022/3/1500444846900891653.json": "War trade: Hedge funds are buying Ukraine and Russia bonds for cents on the dollar. https://t.co/cYnroVn3gG",
  "data/tweet-wsj/2022/3/1500437296033714177.json": "Here's what to know about Russian oligarchs and why they're facing heightened scrutiny  by Western governments amid the Ukraine crisis https://t.co/CuKJJbT0U4",
  "data/tweet-wsj/2022/3/1500452413957971970.json": "Here's what to know about Russian oligarchs and why they're facing heightened scrutiny  by Western governments amid the Ukraine crisis https://t.co/dVBrjHPQdf",
  "data/tweet-wsj/2022/3/1500429760484233222.json": "Kyiv is making a second attempt to evacuate civilians from its besieged cities saying a cease-fire is set after accusing Moscow of resuming attacks on residential areas https://t.co/Kry2FXdWwl",
  "data/tweet-wsj/2022/3/1500486978328043526.json": "Russian forces shelled Ukrainian civilians trying to escape a Kyiv suburb, and a second evacuation attempt from southeast cities failed https://t.co/WQlsbmeYm7",
  "data/tweet-wsj/2022/3/1500493429100498948.json": "Pope Francis on Sunday deplored the “rivers of blood and tears” flowing in Ukraine, using his strongest language yet to criticize the war, though he stopped short of blaming Russia https://t.co/W5vsu2gZSY",
  "data/tweet-wsj/2022/3/1500244840377987079.json": "It's important to adjust your workouts when you hit 50. Here are some exercises to help keep you strong and safe into the decades to come. https://t.co/PuLfHAEbj8",
  "data/tweet-wsj/2022/3/1500497709979082758.json": "In Kherson, the only regional capital that Russia has conquered since it unleashed the war on Ukraine, thousands of people came out for the third day of protests against the occupation, waving Ukrainian flags https://t.co/ODf8J0yvm7",
  "data/tweet-wsj/2022/3/1500494818325282826.json": "On Sunday, Ukrainian authorities said they had to abandon efforts to evacuate civilians from the southern city of Mariupol, for the second day in a row, saying Russia shelled the southeastern port city as evacuation convoys were gathering https://t.co/4757RDmJFH",
  "data/tweet-wsj/2022/3/1500502974157758466.json": "The U.S. and European partners are discussing a ban on imports of Russian oil, Secretary of State Anthony Blinken said Sunday https://t.co/BczZw2pb6R",
  "data/tweet-wsj/2022/3/1500509032641146885.json": "“Beyond Putin, this is very damning for one person in particular, and that is Sergei Shoigu.\" Russia’s defense chief modernized its armed forces, but their failure to quickly seize Ukraine has shown he didn’t create the fighting machine he touted. https://t.co/NktFLpNdHk",
  "data/tweet-wsj/2022/3/1500516602135076869.json": "“The armed forces of Ukraine are now, at least on the European continent, the only armed forces that have permanent eight-year combat experience,” said Yurii Biriukov, a former adviser to the Ukrainian president. “Now here is the result.” https://t.co/qLlPa953g5",
  "data/tweet-wsj/2022/3/1500522108396449793.json": "Investors are starting to buy Ukrainian and Russian bonds that plummeted to discounted prices, betting that they will recover if the war between the two countries comes to an end https://t.co/xQJ00aunBy",
  "data/tweet-wsj/2022/3/1500520350983016457.json": "French President Emmanuel Macron urged Russian President Vladimir Putin to ensure the protection and security of Ukraine’s nuclear sites in a phone call Sunday https://t.co/KxtmSL58oa",
  "data/tweet-wsj/2022/3/1500518344319021057.json": "Ukrainian fighters wounded while battling the Russian invasion will be treated in hospitals in Germany and Poland, officials from both countries said Sunday https://t.co/J7aBq5L2kr",
  "data/tweet-wsj/2022/3/1500505271633915907.json": "The skyrocketing price of oil has President Biden facing a quandary: He'll be unable to respond to calls to ban Russian imports without risking even higher prices at the pump. https://t.co/S0zA1Nlu9L",
  "data/tweet-wsj/2022/3/1500527892446552067.json": "Russian banks that have been cut off from global payments networks are turning to China’s state-owned UnionPay system as the country tries to sidestep boycotts by Western businesses https://t.co/HQJqxEsK2Q",
  "data/tweet-wsj/2022/3/1500540668204265478.json": "Russian police detained thousands of people protesting the war in Ukraine Sunday, as the Kremlin—which has banned Facebook and Twitter and shut down independent media—moved to silence any dissent against the military operations https://t.co/z0fSlVj84v",
  "data/tweet-wsj/2022/3/1500537207714635780.json": "The U.N. atomic agency said Sunday that staff at Ukraine’s largest nuclear plant were now under orders from the commander of Russian forces there, and that communication channels between the plant and Ukraine’s nuclear regulator had sharply reduced https://t.co/iv032f0yEm",
  "data/tweet-wsj/2022/3/1500539243621404674.json": "From @WSJopinion: Western democracies have culpably failed to boost their military capability while indulging acts of economic and cultural self-harm, writes @HonTonyAbbott https://t.co/s9zXFPr7pM",
  "data/tweet-wsj/2022/3/1500550548461957127.json": "Secretary of State Antony Blinken said preliminary reports indicate that Russia is deliberately targeting civilians as part of its invasion of Ukraine—allegations that if true would amount to war crimes under international law https://t.co/LeqRFLMRFb",
  "data/tweet-wsj/2022/3/1500543005232615425.json": "Western sanctions on Russia could prove less effective if China offers Moscow access to what some see as the bazaar of choice for rogue nations https://t.co/dxl9fGecf9",
  "data/tweet-wsj/2022/3/1500556992238309379.json": "Israeli Prime Minister Naftali Bennett held talks with President Vladimir Putin Saturday in the Kremlin and then spoke with Ukrainian leader Volodymyr Zelensky, followed by talks with each leader again on Sunday https://t.co/wVsURpm5J7",
  "data/tweet-wsj/2022/3/1500547526088445953.json": "A brutal brawl between rival fans at a first-division soccer match in Mexico left at least 26 people hospitalized, including three in critical condition https://t.co/W4tn6cq2O3",
  "data/tweet-wsj/2022/3/1500569417306062850.json": "Secretary of State Antony Blinken said the U.S. government is actively pursuing ways to address Ukraine’s request for combat jets https://t.co/iqgdYzvA40",
  "data/tweet-wsj/2022/3/1500578365119643648.json": "The Biden administration is seeking to ease oil sanctions on Venezuela’s oil industry as part of a broader U.S. strategy to temper oil prices that have skyrocketed because of Russia’s war in Ukraine, people familiar said https://t.co/4O3ZWy2J1l",
  "data/tweet-wsj/2022/3/1500585784704909323.json": "Ukraine is now preparing for a second wave of Russian attacks focused on major population centers around the country, Ukraine’s national security adviser, Oleksiy Danilov, said on social media Sunday https://t.co/uEl4yMOmYV",
  "data/tweet-wsj/2022/3/1500580742593748997.json": "Escalating conflict between Russia and Ukraine has sent investors dashing to safer assets, propelling the dollar to its highest level since the coronavirus-induced volatility of two years ago https://t.co/s2Xll7i7m7",
  "data/tweet-wsj/2022/3/1500573217882316804.json": "\"The Batman\" posted the best opening weekend for a film this year in the U.S., grossing $128.5 million in an encouraging sign for studios https://t.co/5fJrpv8XXI",
  "data/tweet-wsj/2022/3/1500566535898906639.json": "Carl Icahn has exited a big bet on Occidental Petroleum, selling the last of what was once a roughly 10% stake in the oil-and-gas producer. His two remaining board representatives are also resigning. https://t.co/WqAue0t1rl",
  "data/tweet-wsj/2022/3/1500605629701963777.json": "Breaking: Moscow is recruiting Syrians skilled in urban combat to fight in Ukraine as Russia’s invasion is poised to expand deeper into cities, according to U.S. officials https://t.co/MMGl4YuxBF",
  "data/tweet-wsj/2022/3/1500607194831593472.json": "The Florida college student who garnered attention for tracking the private planes of Elon Musk and Russian oligarchs has a new Twitter target: the luxury yachts of Russia’s elite https://t.co/wansJ0pOkR",
  "data/tweet-wsj/2022/3/1500610948838666244.json": "TikTok has suspended new content from Russia and Netflix halted its service in the country Sunday, adding to moves by tech and media companies to pull back from Russia following its invasion of Ukraine https://t.co/h29cyR3X79",
  "data/tweet-wsj/2022/3/1500618489035476999.json": "The mayhem of Russia’s war on Ukraine is rippling on distant shores, driving up prices at supermarkets, retailers and gas stations in the U.S. and around the world https://t.co/P3LyPEp9mn",
  "data/tweet-wsj/2022/3/1500614745996550145.json": "American Express says its globally issued cards won’t work at merchants or ATMs in Russia, and cards issued by Russian banks won’t work outside the country on the AmEx network https://t.co/x0wPASnPFI",
  "data/tweet-wsj/2022/3/1500608932334690307.json": "Shell said it would donate profits from purchases of Russian oil to efforts to alleviate the humanitarian crisis in Ukraine, after an outcry over the company’s bid for a cargo of Russian crude https://t.co/kr1HfWeiQW",
  "data/tweet-wsj/2022/3/1500622276861251587.json": "“Beyond Putin, this is very damning for one person in particular, and that is Sergei Shoigu.\" Russia’s defense chief modernized its armed forces, but their failure to quickly seize Ukraine has shown he didn’t create the fighting machine he touted. https://t.co/dSJ4sK2d9w",
  "data/tweet-wsj/2022/3/1500663799518539777.json": "The U.S. National Park Service has roots in the democratic idea that natural beauty should be preserved for public enjoyment. https://t.co/JytMjSGlfL",
  "data/tweet-wsj/2022/3/1500690224254533635.json": "In a matter of days, the West unplugged the world's 11th biggest economy. How it happened and what it means. https://t.co/eFQ9uXaFKT",
  "data/tweet-wsj/2022/3/1500701546870358016.json": "New Zealand, an American ally, has been limited in how far it can go in punishing Russia over its invasion of Ukraine because it doesn't have an independent sanctions law. https://t.co/QkRSfOc13A",
  "data/tweet-wsj/2022/3/1500720686947614720.json": "Take an early look at the front page of The Wall Street Journal https://t.co/eMnjmddimu https://t.co/br05ZNQ22a",
  "data/tweet-wsj/2022/3/1500712863576608768.json": "Israeli Prime Minister Naftali Bennett held talks with President Vladimir Putin Saturday in the Kremlin and then spoke with Ukrainian leader Volodymyr Zelensky, followed by talks with each leader again on Sunday https://t.co/scZkKHHURH",
  "data/tweet-wsj/2022/3/1500727989998436355.json": "Russian banks that have been cut off from global payments networks are turning to China’s state-owned UnionPay system. UnionPay is ubiquitous in China and expanded globally as Chinese traveled abroad, often to buy luxury goods. https://t.co/oiVrIvBKpt",
  "data/tweet-wsj/2022/3/1500735533164765184.json": "U.S. officials began rare face-to-face meetings with Venezuelan officials in Caracas over the weekend, with a view to allowing Venezuelan crude oil back on to the open international market https://t.co/yRy0sF02tT",
  "data/tweet-wsj/2022/3/1500773308479987714.json": "He promised Putin a quick victory. Now he could become the scapegoat for Russia's flawed strategy in Ukraine. https://t.co/ZgMCDncMCL",
  "data/tweet-wsj/2022/3/1500765743683719175.json": "Moscow is recruiting Syrians skilled in urban combat to fight in Ukraine as Russia’s invasion is poised to expand deeper into cities, according to U.S. officials. https://t.co/ZsGFcHiayD",
  "data/tweet-wsj/2022/3/1500739305790128136.json": "News from the Ukraine battlefront some 5,000 miles away has dominated headlines and airwaves in Taiwan—and spurred new interest in battle readiness https://t.co/363xsSvtCG",
  "data/tweet-wsj/2022/3/1500784584052686850.json": "Russia launched nighttime strikes on civilian targets as the war entered its 12th day, while Kyiv’s military held fast along several fronts ahead of planned cease-fire talks https://t.co/P9dFgBLmaI",
  "data/tweet-wsj/2022/3/1500799716883324928.json": "Boeing has suspended purchasing Russian titanium but must still deal with ties with a company linked to Sergei Chemezov, a sanctioned oligarch and Putin ally https://t.co/R1Mbr5QQhb",
  "data/tweet-wsj/2022/3/1500843683788300290.json": "President Biden will hold a call with the leaders of France, Germany and the U.K. to take stock of the situation in Ukraine. They are expected to discuss further coordination on sanctions among other matters, Western officials say. https://t.co/GEtH986evH",
  "data/tweet-wsj/2022/3/1500863917035249669.json": "In parts of Ukraine where Russian troops were confident of victory, protests are growing, showing how hard it will be to occupy the country https://t.co/rtir8BLMk8",
  "data/tweet-wsj/2022/3/1500780843807264770.json": "Take an early look at the front page of The Wall Street Journal https://t.co/dtYfzrAuWF https://t.co/DLy3cAWYiC",
  "data/tweet-wsj/2022/3/1500897845125292035.json": "From @WSJopinion: The reality of Israel’s dependence on Russia shows again that if the U.S. wants to lead the free world in confronting tyranny, its actions in confronting tyrants must be clear and consistent, writes @NatanSharansky https://t.co/iAJu9TP8vE",
  "data/tweet-wsj/2022/3/1500905408638201863.json": "“We’ve effectively walked away from our business in Russia.” Western oil giants spent decades building inroads to Russia. Those collaborations collapsed after the Ukraine invasion, leaving no clear path to recoup billions of dollars.  https://t.co/CVfy3M142R",
  "data/tweet-wsj/2022/3/1500912959392043014.json": "The letter Z has emerged for those supporting Russia’s invasion of Ukraine as a symbol of pride in the attacking armed forces. In the West, it is being condemned as a sign of nationalist sentiment. https://t.co/8H92hQcqBZ",
  "data/tweet-wsj/2022/3/1500920491040772102.json": "As Ukrainian cities are being hit by deadly Russian artillery and airstrikes—an assault that Europe hasn’t seen since the 1940s—the memory of Nazi onslaught during World War II provides a frame of reference for many https://t.co/2K9DOBu9NV",
  "data/tweet-wsj/2022/3/1500924319026888710.json": "Russia’s war against Ukraine is raising questions over whether President Vladimir Putin or his commanders will be charged with war crimes. Here’s what you need to know. https://t.co/B41vJgP3FQ",
  "data/tweet-wsj/2022/3/1500758224072499201.json": "Thermobaric weapons have been around for decades and have been used by the U.S. and Russia in previous battles https://t.co/SUTEHsOumK",
  "data/tweet-wsj/2022/3/1500954509098500096.json": "Russia passed a law that threatens prison time for anyone publishing what authorities consider to be false information about the country’s invasion of Ukraine https://t.co/AEEtpZC0sL",
  "data/tweet-wsj/2022/3/1500973333365547008.json": "Australia is planning to build a naval base that could help resupply and maintain American nuclear submarines, increasing capabilities in countering China in the Indo-Pacific region https://t.co/btH3INn2V3",
  "data/tweet-wsj/2022/3/1500942636668104708.json": "The Nasdaq slid 3.6% to fall into a bear market, and the Dow lost about 800 points to close in correction territory. Global oil jumped to $123.21 a barrel. https://t.co/04TYM44q8B",
  "data/tweet-wsj/2022/3/1500982154620248064.json": "The parent company of Tommy Hilfiger and Calvin Klein said it is temporarily closing its stores and suspending commercial operations in Russia and Belarus as a result of the war in Ukraine https://t.co/hlGMUaMexx",
  "data/tweet-wsj/2022/3/1500818551623536643.json": "China logged its highest daily total of locally transmitted Covid-19 infections since the 2020 Wuhan outbreak https://t.co/xWLkhvMpSM",
  "data/tweet-wsj/2022/3/1501011096156753920.json": "Brazil is the top importer of Russian fertilizer and the largest producer of soy, coffee and sugar. If its farmers have to pay significantly more for fertilizer, the cost of agricultural products is likely to climb, driving up global inflation. https://t.co/P73p80p4fE",
  "data/tweet-wsj/2022/3/1501001525451272195.json": "Legislation to designate lynching a federal hate crime passed Congress Monday, after more than 100 years of effort and 200 failed bills https://t.co/nqrSSB93RY",
  "data/tweet-wsj/2022/3/1500970818590892035.json": "The U.S. Supreme Court on Monday let stand a North Carolina congressional map redrawn by the state’s highest court https://t.co/cZ85QN0aGQ",
  "data/tweet-wsj/2022/3/1501019906044833793.json": "Ukrainian President Volodymyr Zelensky repeated his plea for the U.S. and other countries to clear the way for Soviet-era fighter aircraft to supplement his military, and to enforce a no-fly zone over his country, in an interview Monday https://t.co/Uc5EpYwkgj",
  "data/tweet-wsj/2022/3/1501004942299086848.json": "Ukrainian and Russian negotiators ended a third round of talks Monday with little progress, while Ukraine’s military held fast along several fronts and Russia continued to shell cities and residential areas https://t.co/pnJDQjJfkO",
  "data/tweet-wsj/2022/3/1501026227334828034.json": "“It shows you what a breaking point this is.” BP, Shell and Exxon's rapid pullouts from Russia after decades of cultivating relationships show the mounting perils of doing business with Moscow. https://t.co/7YTdLSdMAB",
  "data/tweet-wsj/2022/3/1501041296458276864.json": "Russia’s war against Ukraine is raising questions over whether President Vladimir Putin or his commanders will be charged with war crimes. Here’s what you need to know. https://t.co/pPxsOaMdBn",
  "data/tweet-wsj/2022/3/1501018635820744707.json": "The U.S. Treasury Department is warning financial institutions and cryptocurrency firms to be on the lookout for attempts to evade sanctions and other restrictions imposed as a result of Russia’s ongoing invasion of Ukraine https://t.co/hMm82aRgbu",
  "data/tweet-wsj/2022/3/1501075273269362694.json": "He promised Putin a quick victory. Now he could become the scapegoat for Russia's flawed strategy in Ukraine. https://t.co/4wcMF79sGj",
  "data/tweet-wsj/2022/3/1501022410606354435.json": "The letter Z has emerged for those supporting Russia’s invasion of Ukraine as a symbol of pride in the attacking armed forces. In the West, it is being condemned as a sign of nationalist sentiment. https://t.co/Wi135mxp4T",
  "data/tweet-wsj/2022/3/1501153283179745281.json": "Shell said it would halt all purchases of Russian crude and shut its gas stations, aviation-fuel and lubricant operations in the country  https://t.co/mfyKBf2RSi",
  "data/tweet-wsj/2022/3/1501105519070781444.json": "From @WSJopinion: Putin is attacking not only Ukraine but the international order that protects the peaceful use of nuclear power. Securing Ukraine’s nuclear power plants and radioactive material is urgent, write James L. Regens and Eugene A. Hughes. https://t.co/ZZcc5hk9wB",
  "data/tweet-wsj/2022/3/1501170895989227529.json": "The number of people fleeing the war in Ukraine has reached two million, the United Nations refugee agency said https://t.co/xI1dmbgoMc",
  "data/tweet-wsj/2022/3/1501163341993201669.json": "Europe is importing more Russian natural gas than before the invasion. Ukrainian gas pipeline workers put themselves in harm’s way to make sure it arrives. https://t.co/l5pmKi1Zpk",
  "data/tweet-wsj/2022/3/1501113016519176195.json": "The facility will also serve as home port for Australia’s nuclear submarines https://t.co/KRbQEhVnZ5",
  "data/tweet-wsj/2022/3/1501191396841172999.json": "The U.S. is planning to ban imports of Russian oil, people familiar with the matter say. An announcement could come today. https://t.co/pML187guPD",
  "data/tweet-wsj/2022/3/1501214152173498372.json": "Gasoline hit $4.173 a gallon—the most expensive it’s ever been, according to AAA’s nationwide average https://t.co/LlQeiuYaiL",
  "data/tweet-wsj/2022/3/1501175914553618434.json": "Google said it agreed to buy cybersecurity company Mandiant for $23 a share in an all-cash deal valued at about $5.4 billion  https://t.co/xbfbPOHYOU",
  "data/tweet-wsj/2022/3/1500890312490762240.json": "The rare axolotl salamander is disappearing in real life. But its popularity has skyrocketed among a half-billion gamers who know them from videogames like \"Fortnite\" and \"Minecraft.\" https://t.co/JNCDdnew7f",
  "data/tweet-wsj/2022/3/1501220476609343492.json": "House Speaker Nancy Pelosi told House Democrats that she planned to move ahead with legislation banning Russian oil imports, according to a Democratic aide. \nShe said the White House had been telling her for days they would impose the ban, the aide said. https://t.co/ORkXG3j2sr",
  "data/tweet-wsj/2022/3/1501242803250151426.json": "The U.K. will phase out Russian oil imports by the end of the year, joining the U.S. in shunning Russian crude. Oil prices are up about 7%. https://t.co/qtm3xztFVz",
  "data/tweet-wsj/2022/3/1501245371712000002.json": "Hackers believed to be sponsored by the Chinese government have compromised at least six U.S. state governments in a continuing espionage campaign https://t.co/UVW98hd7yc",
  "data/tweet-wsj/2022/3/1501216491043266571.json": "The White House is set to task several federal agencies with studying the creation of U.S. digital currency and the risks of crypto assets #WSJWhatsNow https://t.co/lDmAouHPk8 https://t.co/F0dc6dCOKu",
  "data/tweet-wsj/2022/3/1501279141781454857.json": "Russia’s invasion of Ukraine has set off one of the largest and fastest arms transfers in history, as Western nation seek to help the Ukrainian defenders https://t.co/9gCatPU3yV",
  "data/tweet-wsj/2022/3/1501276596350640131.json": "McDonald’s said it is temporarily closing its 847 restaurants in Russia, after investors and consumers called for the chain to cut ties with the country in light of its invasion of Ukraine https://t.co/Y9My8alGrI",
  "data/tweet-wsj/2022/3/1501274063104364549.json": "Spotify and Discord said Tuesday that they were experiencing outages that were disrupting service https://t.co/pVVkJYuzYZ",
  "data/tweet-wsj/2022/3/1501270881825345543.json": "Breaking: A Texas man was convicted on all counts in the first Jan. 6 criminal trial, a verdict that could reverberate through hundreds of other Capitol riot cases https://t.co/utKAIhchKo",
  "data/tweet-wsj/2022/3/1501284631164841988.json": "Germany’s federal prosecutor’s office said on Tuesday that it opened an investigation into suspected war crimes and crimes against humanity committed by Russian forces during the war in Ukraine https://t.co/NHkjyGCDTz",
  "data/tweet-wsj/2022/3/1501295452863578117.json": "Russia is facing military shortcomings in its invasion of Ukraine, including morale and logistical problems, and will be hard-pressed to control territory and install a pro-Moscow regime in the face of a “persistent and significant” Ukrainian insurgency https://t.co/vBD8tk5smM",
  "data/tweet-wsj/2022/3/1501280611658608642.json": "Pepsi is exploring options for its business in Russia but is reluctant to shut down its Russian unit because tens of thousands depend on it for their livelihoods and for daily essentials like milk and baby formula, people familiar with the matter said https://t.co/50NoLGm8zm",
  "data/tweet-wsj/2022/3/1501290444604514309.json": "“Optimism is indispensable”: Local Ukrainian politicians fighting to keep citizen spirits up and information flowing with the latest wartime information https://t.co/Kzvb015tyl",
  "data/tweet-wsj/2022/3/1501168368560263176.json": "Businesspeople, academics and students take flight amid worry over what comes next in Russia after the country’s invasion of Ukraine https://t.co/JosmgyJApI",
  "data/tweet-wsj/2022/3/1501321891432349703.json": "Venezuelan President Nicolás Maduro said his government will restart talks with the opposition after he met with senior U.S. officials who are considering lifting oil sanctions on Caracas as energy prices surge because of war in Ukraine https://t.co/ouWbVXzPdt",
  "data/tweet-wsj/2022/3/1501332167401500674.json": "Leaders of Saudi Arabia and the United Arab Emirates declined requests to speak to President Biden during the Ukraine crisis, officials say. They both took calls from Putin. https://t.co/McsybyBKw8",
  "data/tweet-wsj/2022/3/1501336997570523136.json": "The world’s largest music company, Universal Music, said it is suspending all operations in Russia and closing its offices there immediately. Similar discussions are happening at Sony Music and Warner Music, according to people close to the companies. https://t.co/Tex3XuCJHm",
  "data/tweet-wsj/2022/3/1501335721881358337.json": "Starbucks is suspending all business activity in Russia, including shipment of all Starbucks products https://t.co/94gxK5tyUb",
  "data/tweet-wsj/2022/3/1501339494615822338.json": "Poland said it would make its MiG-29 combat jets available to the U.S. after days of talks about how to get such planes into the hands of Ukraine https://t.co/49EJ9qGpMn",
  "data/tweet-wsj/2022/3/1501352081873154049.json": "From @WSJopinion: Putin is beginning to understand the immense difficulty of the war he cavalierly launched in Ukraine, writes @wrmead. Why would he yield power without using every available method to hold on? https://t.co/4byjeReyla",
  "data/tweet-wsj/2022/3/1501326908704890882.json": "Removing sensitive equipment allowed the Pentagon to get antiaircraft missiles delivered to Kyiv, but the delay points to larger lessons in sending arms to Ukraine https://t.co/10rvAYlwrr",
  "data/tweet-wsj/2022/3/1501373483695095811.json": "Venezuela has released a former American oil executive from prison, just days after President Nicolas Maduro met with senior U.S. officials who are considering lifting oil sanctions on Caracas https://t.co/Bi0qm4sLQA",
  "data/tweet-wsj/2022/3/1501241025079173128.json": "Proud Boys leader Enrique Tarrio was arrested and indicted on conspiracy and other charges related to the Jan. 6 attack on the Capitol https://t.co/YjO0BlEa0q",
  "data/tweet-wsj/2022/3/1501378291009216518.json": "Poland said it would make its MiG-29 combat jets available to the U.S. after days of talks about how to get planes to Ukraine https://t.co/ilb5TCaQpC",
  "data/tweet-wsj/2022/3/1501233835580837898.json": "\"I'll be fine,\" a sailor on a ship stranded off Ukraine reassured his family in Bangladesh. Then the missile came down. https://t.co/CHp039TLa1",
  "data/tweet-wsj/2022/3/1501397407006957570.json": "Fitch Ratings cut its credit ratings on Russia further into junk territory and warned that Moscow was likely to default on its debts shortly https://t.co/Gf6j3uo5Du"
}