{
  "data/tweet-economist/2021/7/1410724405890613250.json": "I didn't think the Voting Rights Act was quite *this* doomed after the oral argument. But the 6-3 majority has rewritten the VRA to kill off challenges to restrictive election rules. My @TheEconomist examination of the stunning result in Brnovich v. DNC https://t.co/Ba4KXd5s38",
  "data/tweet-economist/2021/7/1410908238552391684.json": "I designed my first double-page #dataviz for The Economist!\n\nIt depicts our new 'Normalcy index', which tracks the world's return to pre-pandemic life &gt;&gt; https://t.co/Iko6totfJN https://t.co/1sIUMoZco1",
  "data/tweet-economist/2021/7/1411004378513825794.json": "Brilliant article by @ruthbenghiat on the \"anti-authoritarian playbook\": how society can resist strongmen leaders.\n\nIn short: probe corruption, prosecute, unite opponents, get defections from elites who enable them and apply pressure via foreign orgs.\nhttps://t.co/SAr7uBo4wM",
  "data/tweet-economist/2021/7/1413169594462883847.json": "NEW: @ipsosmori polling for The Economist shows some Brits support anti-covid restrictions *permanently*, regardless of covid risk. Inc:\n\n- 19% for nighttime curfews \n- 26% for closing casinos and clubs\n- 35% for travel quarantine\n- 40% for masks\n\nhttps://t.co/bcYpSbCFNB https://t.co/I7K3fEn2YC",
  "data/tweet-economist/2021/7/1413183975179313170.json": "The clash in Peru over the election result continues. My column:\nhttps://t.co/prMrSpAgCs",
  "data/tweet-economist/2021/7/1413189748928045057.json": "Do you love data visualisation? @TheEconomist's data team is hiring! We're looking for two data visualisation trainees: https://t.co/E8gcscIyTy",
  "data/tweet-economist/2021/7/1413446000757280768.json": "Macron has presided over a massive expansion of France's already-generous welfare state, and introduced progressive rights such as free fertility treatment for gay women. Yet he is still perceived as on the right. Charlemagne: the surreptitious socialist https://t.co/0dcDM4nfoq",
  "data/tweet-economist/2021/7/1413598728708104194.json": "Finally put down a more coherent account, and a few wider thoughts.\nhttps://t.co/4uLTDxLhir",
  "data/tweet-economist/2021/7/1418121507377717250.json": "For the first time since The Economist and YouGov began regularly conducting polls in 2009, Americans rate climate change ranks as their second most important issue — ranking it above every other problem except health care https://t.co/IVjBfI5OAY https://t.co/9V7l81bPuM",
  "data/tweet-economist/2021/7/1420801159460237320.json": "Here is a short story on a covid-19 model we built using our The Economist/YouGov poll to see just how much likelier a person was to get the vaccine conditional on being a Trump supporter, evangelical, high school grad, etc &amp; holding all else equal:\n\nhttps://t.co/pj615JdfBP https://t.co/nNofo45VmM"
}