{
  "data/tweet-wsj/2022/3/1498459298371940354.json": "TikTok has joined Meta in restricting access to some Russian state-controlled media accounts in the European Union, including RT and Sputnik https://t.co/F9jDq725Cd",
  "data/tweet-wsj/2022/3/1498450471291437057.json": "Elon Musk acknowledged that SpaceX delivered to Ukraine terminals that connect to the company's Starlink satellite-based internet service https://t.co/aH1PK7IO0o",
  "data/tweet-wsj/2022/3/1498478154230476804.json": "The U.S. is expelling a dozen Russian diplomats assigned to the United Nations in New York on allegations that they're intelligence agents https://t.co/GCacOwtXtY",
  "data/tweet-wsj/2022/3/1498474358737616902.json": "Loosely organized groups of hackers appeared to bring down several key Russian websites Monday, suggesting the digital front of the deadly conflict is entering an unpredictable new phase https://t.co/3cekZjA6Cg",
  "data/tweet-wsj/2022/3/1498452982698061826.json": "U.S. is sanctioning Russia’s central bank to prevent the government from using its emergency reserve currencies to protect the economy from Western pressure campaign https://t.co/SZiyIxS6wE",
  "data/tweet-wsj/2022/3/1498493667245535232.json": "Talks between Russia and Ukraine on a potential cease-fire ended with no deal Monday as Moscow intensified its assault, killing at least 10 civilians in a shelling attack in the eastern city of Kharkiv https://t.co/V9xHiwJzDC",
  "data/tweet-wsj/2022/3/1498497018515316740.json": "Disney will delay the release of its films in Russian movie theaters in response to Moscow’s “unprovoked invasion of Ukraine and the tragic humanitarian crisis” accompanying it https://t.co/BrxGi4oswf",
  "data/tweet-wsj/2022/3/1498500791346376705.json": "Google and Alphabet CEO Sundar Pichai is a night owl who's most productive after 10 p.m., and powers through a lot of work at that hour. “I really value quiet time in the morning.” https://t.co/RwUhhIYyBB",
  "data/tweet-wsj/2022/3/1498519754344124422.json": "Elon Musk acknowledged that SpaceX delivered to Ukraine terminals that connect to the company's Starlink satellite-based internet service https://t.co/3NtwPYKr93",
  "data/tweet-wsj/2022/3/1498463053268103172.json": "Sen. Joe Manchin joined all GOP senators Monday in voting against a measure seeking to solidify access to abortion https://t.co/Kw6gX9GAgo",
  "data/tweet-wsj/2022/3/1498531907272851457.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/YDQsgCP6WT",
  "data/tweet-wsj/2022/3/1498523230663057409.json": "Biden administration officials told lawmakers that Ukrainians have weeks—not months—to mount a successful pushback against Russian advances, and it may need to involve guerrilla warfare, according to a person familiar with the matter https://t.co/4l0gRs31SB",
  "data/tweet-wsj/2022/3/1498515898398826497.json": "The world’s biggest commercially operated aircraft, an object of fascination among aviation enthusiasts, was heavily damaged in fighting in Ukraine https://t.co/y3mskfXj2i",
  "data/tweet-wsj/2022/3/1498458010838085637.json": "“From Fortress Russia to Rubble Russia in a week.” How the West turned back the clock on 30 years of post-Cold War engagement with Russia. https://t.co/6ps28PO8sZ",
  "data/tweet-wsj/2022/3/1498561189323882500.json": "New Zealand, a close U.S. ally, has been limited in how far it can go punishing Russia over its invasion of Ukraine https://t.co/BPeQiyC0uD",
  "data/tweet-wsj/2022/3/1498553695730126849.json": "Target says it will pay employees as much as $24 an hour in some markets as part of efforts to boost pay and benefits for its staff  https://t.co/p9gKUbsGCB",
  "data/tweet-wsj/2022/3/1498591388937687042.json": "Russian forces struck the central square of the Ukrainian city of Kharkiv as Moscow, frustrated in its plans for a quick victory, switched to a new strategy of pummeling civilian areas in an attempt to demoralize Ukrainian resistance https://t.co/v9ojbYzRwj",
  "data/tweet-wsj/2022/3/1498504565502660614.json": "Toyota said a computer virus at Kojima, a supplier of plastic parts for car interiors, led to the shutdown Tuesday at all of the car maker’s factories in Japan https://t.co/qFggIjCn2j",
  "data/tweet-wsj/2022/3/1498613786051239938.json": "Netflix said it has no plans to add any Russian channels to its service there despite a regulation that would require the streaming giant to carry several Russian state-run broadcasters  https://t.co/u5YNs4h6jW",
  "data/tweet-wsj/2022/3/1498606537434140675.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/FS29wFUpiX",
  "data/tweet-wsj/2022/3/1498640474478948353.json": "Watch: Russian rockets hit Ukraine’s civilian areas as a miles-long convoy of Russian armored vehicles inched closer to Kyiv https://t.co/g9LQ72BtEh",
  "data/tweet-wsj/2022/3/1498648013035737088.json": "On Yellowstone's 150th anniversary, here's a look at how America's first national park paved the way for others across the U.S., and what’s in store to preserve its future https://t.co/mP7Tvy07zj",
  "data/tweet-wsj/2022/3/1498470616327933957.json": "President Biden is expected to address Ukraine, Covid-19 and his Build Back Better agenda when he speaks before Congress Tuesday evening. Here's what to know about the State of the Union. https://t.co/7IfHXrKEZa",
  "data/tweet-wsj/2022/3/1498670677892734979.json": "As Russian attacks mount, Ukraine’s President Zelensky delivered an emotional video address to the European Parliament: “We are giving our lives for the right to be equal” https://t.co/ftOpGqI8L5",
  "data/tweet-wsj/2022/3/1498663106406494212.json": "Far from the war zone, the Russian invasion of Ukraine is causing major disruptions for the global shipping industry. Hundreds of vessels are trapped and freight rates have surged. https://t.co/ZPk1roI9LM",
  "data/tweet-wsj/2022/3/1498677554424827909.json": "Heard on the Street: Russia’s economic isolation is a boon for China in some ways but sends a strong signal on the West’s willingness and ability to employ brutal financial sanctions when roused https://t.co/P39jVucDgO",
  "data/tweet-wsj/2022/3/1498674469702877187.json": "The International Skating Union announced a ban on Russian figure skaters ahead of the world championships in late March https://t.co/czMbgxhhYl",
  "data/tweet-wsj/2022/3/1498685767056605185.json": "The number of Ukrainian refugees fleeing the country is rising rapidly and reached 660,000 early Tuesday, according to the United Nations refugee agency. If the situation escalates, 4 million people could flee, the agency said. https://t.co/YNnIjJFfRi"
}