{
  "data/tweet-nytimes/2021/10/1443737463667703815.json": "A month after they escaped from a farm in Maryland, five zebras have evaded capture and are continuing to ramble across the wilds of suburban Prince George’s County. \nhttps://t.co/xtYbf39Iel",
  "data/tweet-nytimes/2021/10/1443840366105538563.json": "Princess Mako of Japan is going to marry her college boyfriend, a commoner, after a long and arduous engagement. The pressure has been so intense that the princess has been diagnosed with post-traumatic stress disorder, Japan’s public broadcaster reported. https://t.co/SVtIfDD4Ci",
  "data/tweet-nytimes/2021/10/1443883577490411527.json": "The drug maker Merck will seek authorization for the first antiviral pill for Covid. The drug, molnupiravir, cut the risk of hospitalization or death in half when given to high-risk people early in their infections, a clinical trial found.\nhttps://t.co/6VyYq3iDtJ",
  "data/tweet-nytimes/2021/10/1443727419194675203.json": "Jeff Ament of Pearl Jam is bringing high-end skate parks to every city and town in Montana that will have one. “It’s much bigger than skateboarding,” he said. https://t.co/DcmScrkIWY https://t.co/yWMpgsuXk3",
  "data/tweet-nytimes/2021/10/1443912096912187416.json": "Portugal is among the world’s leaders in vaccinations, with roughly 86% of its population fully inoculated.\n\nVice Adm. Henrique Gouveia e Melo, who turned the country’s vaccine campaign around, said there was a key to his success: Keep politics out of it.\nhttps://t.co/ZGFNBv7SRX",
  "data/tweet-nytimes/2021/10/1443787808175448068.json": "California is the latest example of vaccine requirements leading to more vaccinations.\n\nIn a survey of more than a dozen of the state’s major hospital systems, most health care employers reported vaccination rates this week of 90% or higher. Read more: https://t.co/Czt7XTcDva https://t.co/i8q5Cdsc9a",
  "data/tweet-nytimes/2021/10/1444029375272325124.json": "A Danish museum gave an artist about $83,000 to reproduce pieces reflecting the nature of work in the modern world.\n\nHe pocketed the cash and delivered two blank canvases titled \"Take the Money and Run.\" https://t.co/CjyA115QVt",
  "data/tweet-nytimes/2021/10/1444032229781409795.json": "Nearly 700,000 people in the U.S. have now died of Covid-19 — making this the deadliest pandemic in American history.\n\nA majority who died recently were in the South and unvaccinated. Many of the victims were also younger than before. https://t.co/SqffAYhunH",
  "data/tweet-nytimes/2021/10/1444072655431290880.json": "Breaking News: Over 700,000 Americans have died of Covid-19. This pandemic is the deadliest in U.S. history, overtaking the toll from the influenza pandemic of 1918 and 1919. Every age group under 55 saw its highest death toll of the pandemic this August. https://t.co/mNP4pysUKq https://t.co/X9FhcZFtey",
  "data/tweet-nytimes/2021/10/1444003573377994760.json": "Breaking News: California plans to require FDA-approved Covid vaccines for K-12 students as early as next fall, the first U.S. state to announce such a mandate. https://t.co/hrJklHvUiU",
  "data/tweet-nytimes/2021/10/1444026132303581189.json": "After George Floyd’s murder, some New York City firefighters shared racist messages mocking his death. They gloated about how police could \"legally shoot Black children.\" After Black firefighters complained, officials quietly suspended nine firefighters. https://t.co/UO2DXOd1qe",
  "data/tweet-nytimes/2021/10/1444014282543403011.json": "Alex Jones, the Infowars founder and conspiracy theorist who claimed that the Sandy Hook school shooting in 2012 was a hoax, lost two defamation lawsuits filed in Texas by victims' families because he failed to provide requested information to the court. https://t.co/MIedyWFLP8",
  "data/tweet-nytimes/2021/10/1444130028208467971.json": "American Airlines told employees on Friday that it would require all U.S.-based employees and some international crew members to be vaccinated. Separately, Alaska Airlines and JetBlue said that they, too, would mandate the vaccine for employees. https://t.co/FNpnFiRINY",
  "data/tweet-nytimes/2021/10/1444009246639722511.json": "California would be the first U.S. state to mandate the Covid vaccine for K-12 students attending school in-person, beginning next fall. https://t.co/aF6dfr8d8H https://t.co/DdV0IoZEf2",
  "data/tweet-nytimes/2021/10/1444119957248389121.json": "Any New York City police officer who is found to have pledged allegiance to the Oath Keepers or other “far-right nationalist” groups should be investigated by the Police Department, charged internally and removed from the force, Mayor Bill de Blasio said. https://t.co/fhfFBGPGZL",
  "data/tweet-nytimes/2021/10/1444198473230921730.json": "Portugal is among the world’s leaders in vaccinations, with roughly 86% of its population fully inoculated.\n\nVice Adm. Henrique Gouveia e Melo, who turned the country’s vaccine campaign around, said there was a key to his success: Keep politics out of it.\nhttps://t.co/eOqoaFhOfT",
  "data/tweet-nytimes/2021/10/1443938831393243139.json": "“A lot of students on campus want to see the fraternity completely abolished.”\n\nAnti-fraternity protests have taken place across the country as students respond to sexual assault allegations against fraternity members and demand an end to Greek life.\nhttps://t.co/jBw2vnFjNk",
  "data/tweet-nytimes/2021/10/1444257125711101955.json": "When a school board in Pennsylvania voted to effectively ban hundreds of books from being taught in classrooms, high school students led a revolt against the decision.  https://t.co/9m1ozAMmLL",
  "data/tweet-nytimes/2021/10/1444145126188765188.json": "On Friday, Matt Amodio won his 33rd \"Jeopardy!\" game, surpassing James Holzhauer's winning streak and taking his place as No. 2 in the record book for most games won in a row. https://t.co/ThrO7yrGEs",
  "data/tweet-nytimes/2021/10/1444150179100250119.json": "After her son was found to be autistic, Ruth Sullivan became a tireless advocate for people with the condition. She also consulted on the film \"Rain Man.\" She has died at age 97. https://t.co/S1QxDo9iyz",
  "data/tweet-nytimes/2021/10/1444311921453379584.json": "A staggering 700,000 people in the U.S. have now died of Covid-19 — making this the deadliest pandemic in American history.\n\nA majority who died recently were in the South and unvaccinated. Many of the victims were also younger than before. https://t.co/ECeo1Oh3IY",
  "data/tweet-nytimes/2021/10/1444321288714133506.json": "Scott Kirby, the chief executive of United Airlines, decided that it was time to require employees to get vaccinated after learning two employees had died of Covid-19. \n\nThe effort, one of the largest of its kind, worked. https://t.co/KqpE0TJgcl",
  "data/tweet-nytimes/2021/10/1444309077186732033.json": "Breaking News: Mohammed Khalifa, a Canadian man who narrated two infamous videos from ISIS to recruit Westerners, was arrested by the FBI this week and secretly whisked back to the U.S. to face federal prosecution. https://t.co/hDObbhgVle",
  "data/tweet-nytimes/2021/10/1444336386228772864.json": "Portugal is among the world’s leaders in vaccinations, with roughly 86% of its population fully inoculated.\n\nVice Adm. Henrique Gouveia e Melo, who turned the country’s vaccine campaign around, said there was a key to his success: Keep politics out of it. https://t.co/xYPE27pBPG",
  "data/tweet-nytimes/2021/10/1444419440557309955.json": "About three years ago, Stanley Tucci was in a New York hospital receiving radiation therapy to get rid of a tumor at the base of his tongue.\n\nThroughout this harrowing experience, he wasn’t afraid of death. He feared losing his sense of taste. https://t.co/NKJQpcJD5e",
  "data/tweet-nytimes/2021/10/1444530171147653123.json": "To live longer and healthier, it's more important to exercise than it is to lose weight, according to a new review of studies on the relationships between fitness, weight, heart health and longevity. https://t.co/7X6XOLCq82",
  "data/tweet-nytimes/2021/10/1444600638172798978.json": "Sculptures of George Floyd, Breonna Taylor and John Lewis are on display in a Manhattan park known as a site of protests.\n\n\"These monuments have meaning,\" Terrence Floyd, a brother of George Floyd, said. https://t.co/E6HdUs51yU",
  "data/tweet-nytimes/2021/10/1444640937267900416.json": "When a school board in Pennsylvania voted to effectively ban hundreds of books from being taught in classrooms, high school students led a revolt against the decision. https://t.co/WOfoj50F3V",
  "data/tweet-nytimes/2021/10/1444631084721971208.json": "Scott Kirby, the chief executive of United Airlines, decided that it was time to require employees to get vaccinated after learning two employees had died of Covid-19. \n\nThe effort, one of the largest of its kind, worked. https://t.co/pqvTyHsEnj",
  "data/tweet-nytimes/2021/10/1444653479704809472.json": "Our investigation found that as homelessness exploded in New York City, executives at nonprofits personally benefited from the crisis, collecting large salaries, spending money on companies that they or their families controlled and hiring relatives. https://t.co/yUdWQT4w6R",
  "data/tweet-nytimes/2021/10/1444515053538103298.json": "Fat Bear Week, a contest to crown a champion among hundreds of hefty bears, has returned for 2021.\n\nHere’s what to know → https://t.co/eRMUeTxSqZ",
  "data/tweet-nytimes/2021/10/1444688075083460619.json": "A bitter fight with Senator Ted Cruz of Texas over a Russian gas pipeline has created what Biden officials call a personnel crisis, as Cruz delays dozens of State Department nominees, including 59 would-be ambassadors, and vows to block dozens more. https://t.co/mlzk1pC8M2",
  "data/tweet-nytimes/2021/10/1444714874119012360.json": "Breaking News: Dead fish and birds are washing up on the coast of Orange County, California, after a pipeline failure on Saturday caused at least 126,000 gallons of oil to spill into the Pacific Ocean, creating a 13-square-mile slick that’s still growing. https://t.co/rgDqx6Ithg",
  "data/tweet-nytimes/2021/10/1444688726962151432.json": "Texas Republicans released a new congressional map this week. It aims to lock in the party’s advantage in D.C. over the next decade.\n\nThe proposed district lines also aim to offset recent population growth spurred by communities of color. https://t.co/RHCsmyMf58",
  "data/tweet-nytimes/2021/10/1444565404396007427.json": "\"I’m not a capitalist. So I see the wealthy all finally getting hoisted by their own petard.\" Read David Marchese's full interview with Brian Cox, who plays Logan Roy in the hit HBO series “Succession,” which returns this month for a third season. https://t.co/spi6BYkNhK",
  "data/tweet-nytimes/2021/10/1444794420151427073.json": "To live longer and healthier, it's more important to exercise than it is to lose weight, according to a new review of studies on the relationships between fitness, weight, heart health and longevity. https://t.co/i8auGPX3qP",
  "data/tweet-nytimes/2021/10/1444829671191891972.json": "A bitter fight with Senator Ted Cruz of Texas over a Russian gas pipeline has created what Biden officials call a personnel crisis, as Cruz delays dozens of State Department nominees, including 59 would-be ambassadors, and vows to block dozens more. https://t.co/pOWAhoWsow",
  "data/tweet-nytimes/2021/10/1444849777288548357.json": "Frances Haugen, a former Facebook product manager, revealed herself as the whistle-blower behind a major leak of company documents. https://t.co/8JFzqcPvXb",
  "data/tweet-nytimes/2021/10/1444927530973155333.json": "The police are investigating whether the son of a prominent Indian politician was in a vehicle that slammed into protesting farmers in the state of Uttar Pradesh. Eight people were killed in the incident. https://t.co/oDVCB220J5",
  "data/tweet-nytimes/2021/10/1444814577863217152.json": "Dead fish and birds are washing up on the coast of Orange County, California, after a pipeline failure on Saturday caused at least 126,000 gallons of oil to spill into the Pacific Ocean, creating a 13-square-mile slick that’s still growing. https://t.co/sIOwsbuyjt",
  "data/tweet-nytimes/2021/10/1445003323799638017.json": "At least 98% of principals and 93% of teachers in New York had been vaccinated by Friday, city officials said. https://t.co/G4ZrhdEiXX",
  "data/tweet-nytimes/2021/10/1444859838329131011.json": "\"I’m not a capitalist. So I see the wealthy all finally getting hoisted by their own petard.\" Read David Marchese's full interview with Brian Cox, who plays Logan Roy in the hit HBO series “Succession,” which returns this month for a third season. https://t.co/BuYr2uSHHw",
  "data/tweet-nytimes/2021/10/1444962874917539844.json": "Breaking News: The Nobel Prize in Physiology or Medicine went to David Julius and Ardem Patapoutian for their research about temperature and touch. https://t.co/ZAaPSeDRBy https://t.co/T3jMII8yBo",
  "data/tweet-nytimes/2021/10/1444809504101703687.json": "Two days after being unveiled in New York’s Union Square, a statue of George Floyd was vandalized. The accompanying statues of Breonna Taylor and John Lewis were not touched. https://t.co/dUhitnRMPF",
  "data/tweet-nytimes/2021/10/1445067582059470859.json": "William Shatner, who played Captain James T. Kirk in \"Star Trek,\" will launch to the edge of space this month on New Shepard, a tourist rocket built by Blue Origin, the company owned by Jeff Bezos. Shatner, 90, would be the oldest person to fly to space. https://t.co/TUbxI4zdfz",
  "data/tweet-nytimes/2021/10/1445063328733216775.json": "Facebook and some of its apps, including Instagram and WhatsApp, appeared to go down on Monday for many users. The social network and its apps began displaying error messages before noon Eastern time, users reported.  https://t.co/G1fnRCHK9C",
  "data/tweet-nytimes/2021/10/1445061184030453761.json": "New Zealand is abandoning its \"Covid zero\" goal of eliminating the coronavirus. Prime Minister Jacinda Ardern acknowledged an end to the strategy seven weeks into a lockdown that has failed to halt an outbreak of the Delta variant. https://t.co/NmMx4PsmJz https://t.co/dM2OPxLsk9",
  "data/tweet-nytimes/2021/10/1445071254403305482.json": "Dead fish and birds washed up on the coast of Orange County, California, after a pipeline failure on Saturday caused at least 126,000 gallons of oil to spill into the Pacific Ocean, creating a 13-square-mile slick that’s still growing. https://t.co/bHc3caXROU https://t.co/XFGZ0JUtUt",
  "data/tweet-nytimes/2021/10/1445078833292619787.json": "Andrew Yang, who ran unsuccessfully for president in 2020 and for mayor of New York this year, says he has left the Democratic Party and become an independent. https://t.co/TZeLlhZaOy",
  "data/tweet-nytimes/2021/10/1445064252490985475.json": "All over Mexico, mothers are wandering under scorching sun, poking at the earth and sniffing for the scent of decomposing flesh in hopes of finding their missing children.\n\nMost never will. Nearly 100,000 people in the country have disappeared. https://t.co/EsThEoKNet",
  "data/tweet-nytimes/2021/10/1445094396152713224.json": "Facebook’s internal communications platform, Workplace, also went down on Monday, leaving most employees unable to do their jobs. Two Facebook workers called it the equivalent of a “snow day.” https://t.co/XlS2iqDfR5",
  "data/tweet-nytimes/2021/10/1445041055657779202.json": "One way to interpret the trove of leaked internal Facebook documents is that the company is in trouble, writes Kevin Roose.\n\n“A kind of slow, steady decline that anyone who has ever seen a dying company up close can recognize.”\nhttps://t.co/A5BvqGMVi4",
  "data/tweet-nytimes/2021/10/1444852295729045505.json": "A new generation has become engrossed by \"The Sopranos,\" the early 2000s hit. Its creator, David Chase, told @willystaley about how it captured a country in decline — where things had become so selfish and narcissistic, that even the mob couldn’t take it. https://t.co/s3CxNvHH3W",
  "data/tweet-nytimes/2021/10/1445111526487203851.json": "Did death cheat Stephen Hawking of a Nobel Prize?\n\nA recent study of black holes has confirmed a fundamental prediction made nearly five decades ago by the iconic physicist, who died in March 2018. Hawking never won a Nobel and now never will.\nhttps://t.co/TKL8jP1oju",
  "data/tweet-nytimes/2021/10/1445116780146532352.json": "President Biden urged congressional leaders to raise the debt ceiling on Monday, chastising Republicans for what he said was \"reckless\" and \"disgraceful\" obstruction ahead of a default deadline later this month. https://t.co/woIZkEkkst https://t.co/ihfHTVSGZb",
  "data/tweet-nytimes/2021/10/1445122167620849665.json": "A widespread outage is crippling Facebook’s sites and apps and its employee systems like phones and badges. The cause of the issue is unclear. https://t.co/63qhAV16ok",
  "data/tweet-nytimes/2021/10/1445121632549408768.json": "Northwell Health, New York State’s largest health care provider, which employs more than 76,000 people, announced on Monday that it had fired 1,400 of its employees who refused to get vaccinated against the coronavirus. https://t.co/F9Rrjjt9Je",
  "data/tweet-nytimes/2021/10/1445129127670034439.json": "Monday's crossword puzzle may be just what you need until you can check your Instagram. https://t.co/CRojJaM2yC https://t.co/DRhstftiOH",
  "data/tweet-nytimes/2021/10/1444867389313671176.json": "A new study, one of the largest and most rigorous trials of the subject to date, suggests that eating a diet low in carbohydrates and higher in fats could be beneficial for cardiovascular health. https://t.co/owoQ1v5QgC",
  "data/tweet-nytimes/2021/10/1445136779443679241.json": "Breaking News: The Biden administration reversed a Trump-era policy that barred clinics that provide abortion referrals from receiving federal funding. https://t.co/zSygcBk3f1",
  "data/tweet-nytimes/2021/10/1445109023179739146.json": "In this simple, homey weeknight dinner, boneless chicken thighs are tossed with garlic, herbs and red-pepper flakes, then roasted along with lemon wedges in the pan. https://t.co/Wc4HY94WKv",
  "data/tweet-nytimes/2021/10/1445139200421027847.json": "New coronavirus cases in the U.S. have fallen by more than a third in the past month. Worldwide, cases have also dropped more than 30% since late August. https://t.co/84tYL7tHy6 https://t.co/Gf4WJUkU3D",
  "data/tweet-nytimes/2021/10/1445141735663935490.json": "Senator Elizabeth Warren on Monday called for an investigation into whether top Federal Reserve officials engaged in insider trading in 2020. https://t.co/w4pu7ndass",
  "data/tweet-nytimes/2021/10/1445081515659075585.json": "Facebook filed a motion on Monday to dismiss the FTC’s revised antitrust lawsuit against the company, saying the agency’s complaint still lacked evidence that the company had violated antitrust laws. https://t.co/I63oqxLseq",
  "data/tweet-nytimes/2021/10/1445131901057085443.json": "A federal drug enforcement agent was killed and another was seriously injured in a shooting at an Amtrak train station in Tucson, Arizona, on Monday morning, a city councilman said. All of those aboard a train were safely evacuated, Amtrak said. https://t.co/9KAdQMqdMN",
  "data/tweet-nytimes/2021/10/1445082573298937857.json": "More than 18,000 shots were given to New York City school employees ahead of a vaccine deadline, and 95% have received at least one dose. https://t.co/gGS5IZRYOo",
  "data/tweet-nytimes/2021/10/1445150655337881609.json": "Breaking News: Facebook and its apps, including Instagram and WhatsApp, are slowly coming back online after a widespread outage disrupted services for over 5 hours. https://t.co/CwmOvbve8m",
  "data/tweet-nytimes/2021/10/1445161821623758854.json": "\"Dear fellow social media managers… y'all doing ok?\"\n\"hello literally everyone\"\n\"I haven’t been this productive since 2006.\"\n\nWith Facebook and Instagram down for several hours on Monday, Twitter appeared to embrace its moment in the spotlight. https://t.co/xQ7HQwNKf7",
  "data/tweet-nytimes/2021/10/1445154328080175109.json": "Pvt. Danny Chen died by suicide in 2011 after he was brutally hazed and subjected to racist treatment in Afghanistan by his fellow soldiers. On Sunday, people in Manhattan's Chinatown, where he was born and raised, gathered for a walking tour in his honor. https://t.co/Rg7WUPhcbA",
  "data/tweet-nytimes/2021/10/1445165613958246401.json": "The Pfizer vaccine is 90% effective at preventing hospitalization for up to six months, according to a large new U.S. study. The findings, which also document a waning of protection against infection, come as officials debate the need for booster shots. https://t.co/7vKNH1b6tE",
  "data/tweet-nytimes/2021/10/1445178194286546947.json": "Bubba Wallace became the first Black driver to win a NASCAR Cup event since 1963. Wallace's win on Monday at Talladega Speedway also made him the second Black winner in NASCAR's top series. https://t.co/SOiMNCgqsq",
  "data/tweet-nytimes/2021/10/1445169383442157568.json": "Pope Francis and two members of Congress have asked Missouri's governor to stop the scheduled execution on Tuesday of Ernest Johnson, a 61-year-old man, saying he should be spared because he is intellectually disabled. https://t.co/uB4yLiVwkG",
  "data/tweet-nytimes/2021/10/1445199586667245571.json": "Bubba Wallace’s NASCAR Cup win on Monday was the first by a Black driver since 1963 and also the inaugural victory in the sport's top series for Michael Jordan, the co-owner of Wallace's team. https://t.co/3z1LKL8Eq2 https://t.co/3gsUTgRzQX",
  "data/tweet-nytimes/2021/10/1445222247308922881.json": "A jury ordered Tesla to pay $137 million to Owen Diaz, a Black former employee who accused the carmaker of ignoring racial abuse he faced while working there, his lawyer said on Monday. https://t.co/ws4jffG4bP",
  "data/tweet-nytimes/2021/10/1445048582617411593.json": "No treatment helped her depression — until this. In a first, a \"pacemaker for the brain\" has successfully treated a case of severe depression.\n\n\"Within a few weeks, the suicidal thoughts just disappeared,\" said the first participant in the unusual study. https://t.co/U5ySOXhFrX",
  "data/tweet-nytimes/2021/10/1445202099650826248.json": "Revelations from nearly 12 million leaked confidential financial records have thrown light on the concealed wealth of powerful public figures around the world. How do they hide their money, and why is this information important? https://t.co/25QhsiF9Oi",
  "data/tweet-nytimes/2021/10/1445219818311983113.json": "The world lost about 14% of its coral reefs in the decade after 2009, mainly because of climate change, according to a sweeping new international report. https://t.co/zh4B1RDAlU",
  "data/tweet-nytimes/2021/10/1445335509564280837.json": "A jury ordered Tesla to pay $137 million to Owen Diaz, a Black former employee who accused the carmaker of ignoring racial abuse he faced while working there, his lawyer said on Monday. https://t.co/H76Wl33s4u",
  "data/tweet-nytimes/2021/10/1445380814238363652.json": "The Nobel Prize in Physics was awarded on Tuesday to three scientists whose work “laid the foundation of our knowledge of the Earth’s climate and how humanity influences it.”\nhttps://t.co/Mx72wNVmVU https://t.co/TKWPpeIjbo",
  "data/tweet-nytimes/2021/10/1445373288809746438.json": "Southwest Airlines said on Monday that it would require all of its more than 54,000 employees to be fully vaccinated against Covid-19 by the first week in December to remain employed.\nhttps://t.co/UTYvDNn9ZB",
  "data/tweet-nytimes/2021/10/1445309118970007553.json": "Breaking News: Roman Catholic clergy in France have sexually abused about 216,000 minors since 1950, according to a report detailing the church’s failings.\nhttps://t.co/2DJB9ORXxk",
  "data/tweet-nytimes/2021/10/1445075025502089233.json": "Todd Akin, a six-term Republican representative from Missouri whose Senate bid failed after he said in 2012 that women's bodies could somehow reject pregnancies in instances of what he called \"legitimate rape,\" has died at age 74. https://t.co/gcqUwbw55g",
  "data/tweet-nytimes/2021/10/1445320384883085314.json": "The Facebook outage on Monday demonstrated globally how the company’s apps are critical for doing business, arranging medical care, conducting virtual classes, carrying out political campaigns, responding to emergencies and much, much more.\nhttps://t.co/4Tuk0z62u1",
  "data/tweet-nytimes/2021/10/1445358166104068101.json": "Louisiana’s largest nonprofit health care provider will increase its employees’ insurance fees by about $200 a month from next year if their spouses or domestic partners are not vaccinated against the coronavirus.\nhttps://t.co/JOsUuRj3AJ",
  "data/tweet-nytimes/2021/10/1445407569544204289.json": "Read an excerpt from the whistleblower Frances Haugen's opening statement: \"The company’s leadership knows ways to make Facebook and Instagram safer and won’t make the necessary changes because they have put their immense profits before people.\" https://t.co/5LkF09KX8K https://t.co/Vz0zOvKydf",
  "data/tweet-nytimes/2021/10/1445397051974508555.json": "Frances Haugen left her job at Facebook in May — but not before exfiltrating thousands of pages of internal research and documents. They showed that Facebook knew about the harms it was causing, particularly to teens. Watch her Senate testimony live: https://t.co/dM0io5SSaC",
  "data/tweet-nytimes/2021/10/1445414759310954506.json": "Federal investigators raided the Manhattan office of one of New York City’s main police unions in connection with an ongoing investigation. The union’s president, Edward D. Mullins, has become known for making brash and incendiary remarks on social media. https://t.co/MGiNqDuHEI",
  "data/tweet-nytimes/2021/10/1445426081499172864.json": "A top-secret cable warned every CIA base last week about troubling numbers of foreign informants who have been killed, arrested or turned into double agents. Intelligence services in Russia, China, Iran and Pakistan have been hunting down CIA sources. https://t.co/4H5TBG7M3L",
  "data/tweet-nytimes/2021/10/1445437623586021380.json": "Facebook’s own research concluded that Instagram, which it owns, was toxic for teen girls and made body image issues worse for one in three of them. The revelations, which came from documents shared by a former employee, weren't a surprise to young women. https://t.co/K9PMwopIZ8 https://t.co/suQYT4Ia98",
  "data/tweet-nytimes/2021/10/1445483944741322752.json": "Frances Haugen, a former product manager at Facebook, accused the company of knowing its platforms are harmful and putting profits before safety in congressional testimony on Tuesday. \"They won't solve this crisis without your help,\" she said. https://t.co/GH75M1JoCE https://t.co/O7KDlWhw7K",
  "data/tweet-nytimes/2021/10/1445501584104951808.json": "Frances Haugen, a former Facebook product manager, told senators on Tuesday that there were solutions to problems seen across social media platforms and that a safer, free-speech-respecting, more enjoyable social media was possible. https://t.co/ponvj2DB7G https://t.co/By1H6HxIRM",
  "data/tweet-nytimes/2021/10/1445524250849284115.json": "For 84 years, Army soldiers have performed the changing of the guard at the tomb at Arlington National Cemetery. Last month, for the first time, it was carried out by three women.\nhttps://t.co/b9RFTsvsv3",
  "data/tweet-nytimes/2021/10/1445531784318382083.json": "Frances Haugen, the Facebook whistle-blower, detailed the dangers of engagement-based ranking, which is used by Facebook and other social media platforms to determine which content they believe is most relevant to users’ interests. https://t.co/1fApBKXLPY https://t.co/NCcJtgsAyi",
  "data/tweet-nytimes/2021/10/1445516667589513217.json": "The Facebook whistle-blower Frances Haugen spent hours on Tuesday detailing to lawmakers the ways she said the social network harmed young people. https://t.co/wQyxq2jkYz https://t.co/0UqJIsxrw5",
  "data/tweet-nytimes/2021/10/1445443559054786561.json": "When the U.S. left Afghanistan, there were no American troops reported missing in action. It is a stunning change from previous wars that ended with thousands of troops forever lost, their families left to wonder what had happened to them. https://t.co/9nDnw1uCpi",
  "data/tweet-nytimes/2021/10/1445546884798377991.json": "Ernest Lee Johnson was executed on Tuesday night, according to the Missouri Department of Corrections, despite calls for clemency from Pope Francis and other supporters who said Johnson’s intellectual disabilities made the execution unconstitutional. https://t.co/U5FvInlXBb",
  "data/tweet-nytimes/2021/10/1445214693061181441.json": "Dead fish and birds washed ashore in Orange County, California, after a pipeline failure on Saturday caused at least 126,000 gallons of oil to spill into the Pacific Ocean, prompting fresh calls for a permanent end to offshore oil production in the state. https://t.co/7nEUNCaoeU",
  "data/tweet-nytimes/2021/10/1445577078141636614.json": "About 1,400 workers who make Kellogg cereals went on strike on Tuesday at factories in Michigan, Nebraska, Pennsylvania and Tennessee. https://t.co/TPwKTKddXm",
  "data/tweet-nytimes/2021/10/1445422305258221568.json": "New York City's public libraries have eliminated all late fines. Officials said that fines no longer served to bring back books, but you are not off the hook if you lost something that you borrowed. Read more in our NY Today newsletter. https://t.co/DQcDgrNJCl https://t.co/h5rHX44Qwj",
  "data/tweet-nytimes/2021/10/1445476401092562951.json": "Senator Elizabeth Warren and Representative Pramila Jayapal are seeking information from the biggest accounting firms in the U.S. after a New York Times report detailed how accounting giants effectively draft favorable tax rules from inside the government. https://t.co/FgTlOz8c9v",
  "data/tweet-nytimes/2021/10/1445716754907475969.json": "Rich countries contribute an average of $14,000 per year for a toddler’s care. In the U.S. it’s $500.\n\nHere’s a look at how other nations pay for child care.\nhttps://t.co/eBPO5R6Aj3",
  "data/tweet-nytimes/2021/10/1445675233726193668.json": "“Squid Game,” the dystopian Netflix hit, taps into South Korea’s unease over growing inequality and fierce competition for opportunities.\n\nThe show reflects “the problems and realities of Korean society,” Hwang Dong-hyuk, the show’s creator, said.\nhttps://t.co/R0VoQIbMKD",
  "data/tweet-nytimes/2021/10/1445731834743037957.json": "There’s a new heavyweight champion of Fat Bear Week: 480 Otis.\n\nOtis took back his title, his fourth, in the annual competition that celebrates the pre-hibernation weight gain of bears at Katmai National Park and Preserve in Alaska.\nhttps://t.co/LMxm9bcnFD",
  "data/tweet-nytimes/2021/10/1445735666973691906.json": "For 84 years, Army soldiers have performed the changing of the guard at the tomb at Arlington National Cemetery. Last month, for the first time, it was carried out by three women.\nhttps://t.co/JK8eOLjKuB",
  "data/tweet-nytimes/2021/10/1445554447053066240.json": "Citing a “disturbing spike” in harassment against school personnel, Attorney General Merrick Garland issued a memo directing the FBI and U.S. attorneys’ offices to meet with local officials over the next month to coordinate a response to the threats. https://t.co/Yv8ox6pfmG",
  "data/tweet-nytimes/2021/10/1445778603329740800.json": "Breaking News: The WHO approved the first ever malaria vaccine, which could save tens of thousands of children in sub-Saharan Africa. The quest for this vaccine has been underway for a hundred years, a WHO official said, and is a \"historic event.\" https://t.co/i1hcYBhbvb https://t.co/wTNg6xWmzU",
  "data/tweet-nytimes/2021/10/1445769181547298832.json": "A Colorado health system told a prospective kidney transplant recipient that she would not receive an organ donation if she remained unvaccinated against the coronavirus, a state lawmaker said. https://t.co/483rYUJw55",
  "data/tweet-nytimes/2021/10/1445594044541784071.json": "The Yankees’ season is over after one playoff game. They lost to the Red Sox in an American League wild-card showdown. https://t.co/4X1BEi0zLi",
  "data/tweet-nytimes/2021/10/1445668161555087369.json": "England took a gamble when it sent millions of students back to school last month with neither vaccines nor a mask requirement. Many parents approve, but more than 186,000 students were absent last week with confirmed or suspected cases of the coronavirus. https://t.co/IPFrn9tZIC",
  "data/tweet-nytimes/2021/10/1445562002126954501.json": "The Senate confirmed two U.S. attorneys for New York: Breon Peace and Damian Williams, the first African American to lead the powerful U.S. attorney's office for the Southern District of New York. https://t.co/1twhPT4kEY",
  "data/tweet-nytimes/2021/10/1445797268997685253.json": "A ‘Historical Event’: First Malaria Vaccine Approved by the World Health Organization https://t.co/e3i0KYlHvN",
  "data/tweet-nytimes/2021/10/1445784699347996676.json": "“Squid Game,” the dystopian Netflix hit, taps into South Korea’s unease over growing inequality and fierce competition for opportunities.\n\nThe show reflects “the problems and realities of Korean society,” Hwang Dong-hyuk, the show’s creator, said.\nhttps://t.co/ckMgm0n4R6",
  "data/tweet-nytimes/2021/10/1445815643270533123.json": "Los Angeles will require proof of Covid vaccination to enter many indoor businesses starting Nov. 4, in one of the strictest rules in the U.S. https://t.co/I9yxi3wHit",
  "data/tweet-nytimes/2021/10/1445846346284474373.json": "Canada will make Covid vaccines mandatory for air and rail passengers as of next Tuesday. Federal government workers, including members of the military and the Royal Canadian Mounted Police, will be required to get vaccinated by Oct. 29. https://t.co/VoiZvGYtUG",
  "data/tweet-nytimes/2021/10/1445806102625480710.json": "The U.S. is an outlier in its low levels of financial support for young children’s care — something Democrats, with their safety net spending bill, are trying to change. https://t.co/h6gA7SwTgg https://t.co/1UFQEwRfAK",
  "data/tweet-nytimes/2021/10/1445875545858879491.json": "Malaria kills about 500,000 people each year, about half of them children in Africa. For the first time, a vaccine shown to prevent the disease has been approved by the WHO. https://t.co/2zVmvk6SD6 https://t.co/rbQzICq0qA",
  "data/tweet-nytimes/2021/10/1445871519335333889.json": "A Texas man who, according to federal prosecutors, wrote on Facebook that he had paid someone infected with the coronavirus to lick groceries at a supermarket has been sentenced to 15 months in prison. https://t.co/Od37kqzP6k",
  "data/tweet-nytimes/2021/10/1445832486349541377.json": "In the developed world, the U.S. is an outlier in its low levels of financial support for young children’s care.\n\nTwo-year-olds in the country are less likely to attend formal child care — and if they do, their parents pay full price. https://t.co/s57TabMk0h https://t.co/SIA1vmKqF0",
  "data/tweet-nytimes/2021/10/1445421037081042951.json": "Dawn Dorland was so moved by donating one of her kidneys that she wrote a heartfelt letter about it on Facebook. And then the letter turned up in someone else's short story. Art often draws inspiration from life — but what happens when it’s your life?\nhttps://t.co/0WWmOiPhIh",
  "data/tweet-nytimes/2021/10/1445920681192005635.json": "Breaking News: A federal judge temporarily blocked a near-total ban on abortion in Texas in a challenge brought by the Biden administration. https://t.co/ApZ1sqsUbk",
  "data/tweet-nytimes/2021/10/1445749685679886351.json": "Senate Democrats are weighing changing filibuster rules as Republicans blockade a vote to raise the federal debt limit.\nhttps://t.co/zxuJoYJjZj",
  "data/tweet-nytimes/2021/10/1445941970229207042.json": "\"Last night I spent a solid hour looking at throw pillows on the internet when I should have been sleeping.\" https://t.co/qHZxF9Mw0V https://t.co/hvIrLma6zI",
  "data/tweet-nytimes/2021/10/1446033822978564097.json": "Ndakasi, a gorilla who found fame after she photobombed a selfie at a national park in Congo, died at 14.\n\n“I loved her like a child,” her longtime caregiver said, “and her cheerful personality brought a smile to my face every time I interacted with her.”\nhttps://t.co/asS9Yy3WmE",
  "data/tweet-nytimes/2021/10/1445758341976711181.json": "In Opinion\n\n“Facebook has had more than 15 years to demonstrate that algorithmic personal feeds can be built responsibly; if it hasn’t happened by now, it’s not going to happen,” writes Roddy Lindsay, a former Facebook data scientist, in a guest essay.\nhttps://t.co/gZggCYgxjO",
  "data/tweet-nytimes/2021/10/1446085620087013380.json": "Breaking News: Pfizer asked the FDA to authorize its Covid vaccine for ages 5 to 11, bringing more than 28 million children closer to being eligible for the shot.\nhttps://t.co/8ojNZjFpdr",
  "data/tweet-nytimes/2021/10/1445960505672314885.json": "Breaking News: A new report provides fresh details of how officials fought off Donald Trump’s efforts to press the Justice Department to pursue voter fraud claims. https://t.co/LBsQMbIsnD",
  "data/tweet-nytimes/2021/10/1446116610368958464.json": "France will charge unvaccinated people for Covid tests, officials said.\n\n“It is no longer legitimate to pay for unlimited comfort tests at taxpayers’ expense,” Prime Minister Jean Castex said.\nhttps://t.co/F5laFcwAEG",
  "data/tweet-nytimes/2021/10/1446090964511207428.json": "Pfizer asked the FDA to authorize emergency use of its Covid vaccine for children ages 5 to 11, bringing more than 28 million children closer to being eligible for the shot.\nhttps://t.co/2C4y4U9nla https://t.co/MUgIzM9VrF",
  "data/tweet-nytimes/2021/10/1446120693783875594.json": "In Opinion\n\n“Vaccination during pregnancy provides triple protection: to the mother, the developing fetus and the future health of the newborn,” writes Dr. Gil Mor, a reproductive immunologist, in a guest essay.\nhttps://t.co/6NxOnaLFkf",
  "data/tweet-nytimes/2021/10/1445653063146954755.json": "In what was said to be the most complex fashion NFT yet, Dolce &amp; Gabbana sold a nine-piece collection of nonfungible tokens called \"Collezione Genesi\" at auction last week. They are now worth more than $6 million. https://t.co/JXV1GRP3b3",
  "data/tweet-nytimes/2021/10/1446128274103406595.json": "Ndakasi, a gorilla who found fame after she photobombed a selfie taken by a ranger at a national park in Congo, died at 14.\nhttps://t.co/I6UaBoyEyz https://t.co/LXKUm51nNS",
  "data/tweet-nytimes/2021/10/1446138258937757697.json": "Damian Williams, the U.S. attorney for the Southern District of New York, is now the most powerful federal law enforcement official in Manhattan. https://t.co/EQFXXgvLll https://t.co/KIHlK6wJ91",
  "data/tweet-nytimes/2021/10/1446154612302622723.json": "Archaeologists believe they have uncovered the original foundation of one of the oldest historically Black churches in the U.S. Formed in 1776, its members met in secret in defiance of laws that forbade the congregation of African Americans. https://t.co/uDP6IagHIt",
  "data/tweet-nytimes/2021/10/1446233889077407754.json": "President Biden is set to restore sweeping environmental protections to three major national monuments in Utah and New England, including Bears Ears and Grand Staircase-Escalante, that had been stripped away by Donald Trump.\nhttps://t.co/dM2HvuxDtb",
  "data/tweet-nytimes/2021/10/1446230125155074051.json": "Google said it will no longer display advertisements on YouTube videos and other content that promote inaccurate claims about climate change. https://t.co/V7rHpORwxt",
  "data/tweet-nytimes/2021/10/1446052698831429632.json": "A new report provides fresh details of how officials fought off Donald Trump’s efforts to press the Justice Department to pursue voter fraud claims. https://t.co/5ZpuIo3Qty",
  "data/tweet-nytimes/2021/10/1446286754303070213.json": "An Illinois woman will spend four days in jail and will be barred for a year from Yellowstone National Park for not moving out of the way of a grizzly bear and three cubs while visiting the park in May.\nhttps://t.co/vqe13eBTjL",
  "data/tweet-nytimes/2021/10/1446256542894936070.json": "Elon Musk said Tesla would move its headquarters from California to Austin, Texas, making good on a threat after virus lockdowns last year.\nhttps://t.co/ZBOefQfEl6",
  "data/tweet-nytimes/2021/10/1446226368518311939.json": "A false conspiracy theory about Covid-19 vaccines may have driven a Maryland man to kill three people last week, including his brother, a pharmacist, the authorities said.\nhttps://t.co/R1akYS2R4k",
  "data/tweet-nytimes/2021/10/1446191118710976523.json": "Nearly 140 countries, including Ireland, are expected to settle on a 15% global minimum tax rate this week — a significant step forward for the most sweeping overhaul of the international tax system in a century. https://t.co/s3mAKMYRzC",
  "data/tweet-nytimes/2021/10/1446400013693771796.json": "France will charge unvaccinated people for Covid tests, officials said.\n\n“It is no longer legitimate to pay for unlimited comfort tests at taxpayers’ expense,” Prime Minister Jean Castex said.\nhttps://t.co/I2yuBHMpmZ",
  "data/tweet-nytimes/2021/10/1446412570026467342.json": "The winners of the Nobel Peace Prize were recognized for “their courageous fight for freedom of expression in the Philippines and Russia,” with the committee noting that they were part of a broader struggle to protect press freedoms.\nhttps://t.co/0oQmiau86X https://t.co/uOgBXM0XJW",
  "data/tweet-nytimes/2021/10/1446114366206537729.json": "A new report provides fresh details of how officials fought off Donald Trump’s efforts to press the Justice Department to pursue voter fraud claims. https://t.co/MxGCdI9KDx https://t.co/2AUlsLOOO7",
  "data/tweet-nytimes/2021/10/1446402639521013773.json": "Breaking News: The Nobel Peace Prize went to the journalists Maria Ressa and Dmitry Muratov for their efforts to safeguard freedom of expression.\nhttps://t.co/NnffKESth8",
  "data/tweet-nytimes/2021/10/1446449077814693902.json": "Maria Ressa, a Philippine journalist who co-founded the news site Rappler, is only the 18th woman to be awarded the Nobel Peace Prize in its 126-year history.\nhttps://t.co/EVhqti1nal",
  "data/tweet-nytimes/2021/10/1446475527934652418.json": "Maria Ressa, the Philippine journalist who is the 18th woman to be awarded the Nobel Peace Prize, co-founded Rappler.\n\nThe news site has faced President Duterte’s wrath for its investigations into extrajudicial killings, malfeasance ​and misinformation.\nhttps://t.co/55g4fKHzqI",
  "data/tweet-nytimes/2021/10/1446513259297845250.json": "California became the first state to make stealthing, the act of removing a condom without consent during intercourse, illegal after Gov. Gavin Newsom signed a bill into law.\n\n\"We are underlining the importance of consent,\" the governor's office said.\nhttps://t.co/pJt9thhpf1",
  "data/tweet-nytimes/2021/10/1446511195331117060.json": "Breaking News: An agreement to set a 15% global minimum tax rate was reached by nearly 140 countries. Tech giants like Amazon and Facebook will be required to pay taxes in nations where their services are sold, even if they have no physical presence there. https://t.co/Fm2ef2Jxrg",
  "data/tweet-nytimes/2021/10/1446495629593747503.json": "The journalists Maria Ressa, of the Philippines, and Dmitry Muratov, of Russia, were awarded the Nobel Peace Prize for their efforts to safeguard freedom of expression. https://t.co/wbWJbAJuys https://t.co/cqRVdfy1Bv",
  "data/tweet-nytimes/2021/10/1446515808788783130.json": "Maria Ressa, one of two journalists awarded the Nobel Peace Prize, said the Philippine government had filed 10 arrest warrants against her and banned her from traveling, even when her mother was diagnosed with cancer. https://t.co/jFLFLaUCzj https://t.co/Ymvw2lPYLr",
  "data/tweet-nytimes/2021/10/1446510866690723843.json": "Maria Ressa, the Philippine journalist who was awarded the Nobel Peace Prize, said the prize was a recognition of the dangers of being a journalist at a time when freedom of the press was under attack.\nhttps://t.co/fE21sAquxi https://t.co/cNnEE2NrKQ",
  "data/tweet-nytimes/2021/10/1446501913508392966.json": "Dmitri Muratov, the Russian newspaper editor awarded the Nobel Peace Prize on Friday, said he would have given the honor to a different Russian: Aleksei Navalny, the jailed opposition leader. https://t.co/vnbXZQIoIf",
  "data/tweet-nytimes/2021/10/1446469199237419011.json": "The Nobel Peace Prize went to the journalists Maria Ressa, of the Philippines, and Dmitry Muratov, of Russia, for “their courageous fight for freedom of expression, which is a precondition for democracy and lasting peace.”\nhttps://t.co/VmFxa0YhX0",
  "data/tweet-nytimes/2021/10/1446590007570059265.json": "\"Stealthing is not just immoral but illegal,\" said Assemblywoman Cristina Garcia, who represents part of Los Angeles County and who sponsored the bill, which makes stealthing a civil offense and gives victims grounds to sue their assailants for damages. https://t.co/hyt823hIcN https://t.co/jxXxRh8nzD",
  "data/tweet-nytimes/2021/10/1446588723966140418.json": "The $100 billion in cuts that Senator Kyrsten Sinema of Arizona is said to want in major pending legislation could force Democrats to cut or shrink programs designed to help poor communities adapt to climate change. https://t.co/TzCD3vf4Px",
  "data/tweet-nytimes/2021/10/1446681857421189123.json": "Women who went to prison for killing their abusive partners are finding refuge, and a chance to start over, at a complex of apartments called \"Home Free\" on Treasure Island, a former Navy base in San Francisco. https://t.co/W7o0tIGb0w",
  "data/tweet-nytimes/2021/10/1446793078170324993.json": "This lightly spiced apple cake comes together in no time at all, and a few swoops of fluffy cinnamon cream cheese frosting dress it up for dessert. https://t.co/baONVLHlgI",
  "data/tweet-nytimes/2021/10/1446827808559407109.json": "The U.S. is an outlier in its low levels of financial support for young children’s care. Rich countries contribute an average of $14,000 per year for a toddler’s care, compared with $500 in the U.S. The Democrats’ spending bill tries to shrink the gap. https://t.co/convDaRSG6 https://t.co/dLOnFhydNd",
  "data/tweet-nytimes/2021/10/1446370800114806832.json": "One of the first things the New York Times photographer Tyler Hicks saw in Afghanistan in 2001 was the execution of a wounded Taliban fighter who was shot in the chest after begging for his life. It upended everything Hicks thought he knew about war. https://t.co/SPUpAmuUk4 https://t.co/GfLHkpOltK",
  "data/tweet-nytimes/2021/10/1446837880501022728.json": "When Sarah Butler, 20, went missing in November 2016, her sister and friends took action. \n\nTheir sleuthing helped police catch a serial killer. https://t.co/VMsxsBSMs2",
  "data/tweet-nytimes/2021/10/1446817750538653696.json": "Taiwan is now at the heart of dangerous discord between China and the U.S. \"There’s very little insulation left on the wiring in the relationship,\" a former diplomat said, \"and it’s not hard to imagine getting some crossed wires and that starting a fire.\" https://t.co/8j6SdaLshj",
  "data/tweet-nytimes/2021/10/1446868071541612546.json": "John Lennon would’ve been 81 today. More than 40 years after his death, students at University of Liverpool can now pursue a master’s degree devoted entirely to the Beatles. https://t.co/cJbdsD4dnL",
  "data/tweet-nytimes/2021/10/1446901285152772101.json": "Breaking News: Chancellor Sebastian Kurz of Austria announced on Saturday that he would resign, days after prosecutors launched a criminal investigation into allegations he used federal money to pay off pollsters and journalists for favorable coverage. https://t.co/mRQGD3rfGZ",
  "data/tweet-nytimes/2021/10/1446893259087822848.json": "Britons are lining up for gas, finding empty grocery shelves, paying higher taxes and worrying about spiraling prices as a grim winter approaches.\nPrime Minister Boris Johnson’s jovial optimism despite these troubles is causing cognitive dissonance. https://t.co/rj8rLfWnK0",
  "data/tweet-nytimes/2021/10/1446948861507952645.json": "Milk is a favorite drink in Rwanda, and milk bars serve it up in abundance, fresh or fermented, hot or cold. \n\n\"When you drink milk, you always have your head straight and your ideas right.\" https://t.co/R6H97e11Tp https://t.co/IXlMFc9A9w",
  "data/tweet-nytimes/2021/10/1447084508369534978.json": "The Balenciaga-Simpsons episode took nearly a year to make. The 10 minutes are packed with Easter eggs for die-hard fans of both brands. https://t.co/SzsZbKzwoP",
  "data/tweet-nytimes/2021/10/1447200257813647365.json": "Moderna, whose coronavirus vaccine appears to be the world’s best defense against Covid-19, has shipped a greater share of its doses to wealthy countries than any other vaccine manufacturer, keeping poorer countries waiting and earning billions in profit. https://t.co/4n8QkG4F7M",
  "data/tweet-nytimes/2021/10/1447225436879085575.json": "Pfizer will fully vaccinate everyone in a Brazilian city over the age of 12 to study the safety and efficacy of their vaccine.\n\nThe study will follow participants for up to one year to chart how long protection lasts against Covid-19 and the new variants.\nhttps://t.co/MiUq1nQTDE",
  "data/tweet-nytimes/2021/10/1447114710642528256.json": "This classic shrimp recipe makes a simple garlic, white wine and butter sauce that goes well with a pile of pasta or with a hunk of crusty bread. https://t.co/qhLPYL21Q4",
  "data/tweet-nytimes/2021/10/1447119729462743054.json": "Black Native Americans in the Seminole Nation, known as the Freedmen, will now be eligible for health care through the Indian Health Service, the agency announced. But the battle for them to be treated as equal tribal citizens remains. https://t.co/6XBoiUSAks",
  "data/tweet-nytimes/2021/10/1446898286581923840.json": "“Real Housewives of Beverly Hills” star Erika Girardi is ensnared in legal drama as her husband’s law firm is accused of misappropriating funds — including $25 million for her personal and professional expenses. And it’s all unfolding on TV. https://t.co/qhRbZ7rJvK",
  "data/tweet-nytimes/2021/10/1447276354433691648.json": "Breaking News: A nuclear engineer for the U.S. Navy and his wife have been charged with trying to share some of the United States’ most closely held secrets on submarine technology with another country, according to court documents unsealed on Sunday. https://t.co/fIbHvm8zPk",
  "data/tweet-nytimes/2021/10/1447024110488408067.json": "What makes these cookies truly “perfect” isn’t anything radical; it’s simply an attention to detail. \nhttps://t.co/At6hxAaZHE",
  "data/tweet-nytimes/2021/10/1447326098937810945.json": "Moderna, whose coronavirus vaccine appears to be the world’s best defense against Covid-19, has shipped a greater share of its doses to wealthy countries than any other vaccine manufacturer, keeping poorer countries waiting and earning billions in profit. https://t.co/senKKL8IPb",
  "data/tweet-nytimes/2021/10/1447255631346421765.json": "Southwest Airlines canceled hundreds of flights over the weekend. It blamed air traffic control issues and \"disruptive weather,\" but no other carrier reported problems. https://t.co/Leq3WpP87g",
  "data/tweet-nytimes/2021/10/1447244302497816580.json": "Dr. Anthony Fauci said in an interview on Sunday that outdoor trick-or-treating is perfectly safe. While he still endorsed vaccinations for all who are eligible, he said Halloween was \"a very important part of the year for children.\" https://t.co/vQTVv7r8hq",
  "data/tweet-nytimes/2021/10/1447190193577111552.json": "With its new nonbinary characters and its scenes depicting chest binding and disabled intimacy, \"Sex Education,\" the British teen comedy-drama, continues to widen its lens. https://t.co/McG8dqWLEG",
  "data/tweet-nytimes/2021/10/1447406623685742595.json": "“Squid Game,” the dystopian Netflix hit, taps into South Korea’s unease over growing inequality and fierce competition for opportunities. The show reflects “the problems and realities of Korean society,” Hwang Dong-hyuk, the show’s creator, said. https://t.co/ZmoGqd1GbT",
  "data/tweet-nytimes/2021/10/1447426779543650305.json": "Shortly after the pandemic erupted last year, doctors were baffled by a surge of patients who came in complaining of painful lesions on their toes — a condition that came to be known as \"Covid toes.\" Now, a new study has shed some light on their cause. https://t.co/wJGAXcFzYR",
  "data/tweet-nytimes/2021/10/1447536243173117959.json": "A bottle of Japanese whiskey, a 22-karat gold coin and three white tiger and cheetah fur robes, which later turned out to be fakes, show how gift exchanges between the U.S. and foreign leaders devolved into shambles during the Trump administration.\nhttps://t.co/I6dWxVSZrU",
  "data/tweet-nytimes/2021/10/1447524920305623041.json": "Pfizer will fully vaccinate everyone in a Brazilian city over the age of 12 to study the safety and efficacy of their vaccine.\n\nThe study will follow participants for up to one year to chart how long protection lasts against Covid-19 and the new variants.\nhttps://t.co/XxxioFLpdO",
  "data/tweet-nytimes/2021/10/1447551341354749955.json": "Indigenous Peoples’ Day is being observed in many U.S. cities and states.\n\nHere’s some of the history behind the day.\nhttps://t.co/iVp5T0OK6v",
  "data/tweet-nytimes/2021/10/1447577781492092928.json": "The new Superman will soon begin a romantic relationship with a male friend, DC Comics announced. \n\n\"The idea of replacing Clark Kent with another straight white savior felt like a missed opportunity,\" said Tom Taylor, who writes the series. https://t.co/nzSsfpgddr",
  "data/tweet-nytimes/2021/10/1447590831452532737.json": "Superman Comes Out, as DC Comics Ushers In a New Man of Steel https://t.co/FsNpyTcpm9",
  "data/tweet-nytimes/2021/10/1447596622465142795.json": "For the first time, the Boston Marathon began with an acknowledgement that the race's 26.2 miles run through Indigenous homeland. https://t.co/cVIbTs79j8",
  "data/tweet-nytimes/2021/10/1447585695678320642.json": "Diana Kipyogei of Kenya won the Boston Marathon on Monday, finishing in 2:24:45. This was the 27-year-old's first victory in a major marathon. https://t.co/dRrrKXeZQk https://t.co/BUeXrISfgO",
  "data/tweet-nytimes/2021/10/1447601654803615750.json": "Roberta Gibb was the first woman to finish the Boston Marathon in 1966, when women were barred because they were thought \"physiologically incapable.\" A statue of her now sits between the starting line and where she snuck into the race to avoid being caught.https://t.co/6HKtpMYKhm",
  "data/tweet-nytimes/2021/10/1447505280414138372.json": "Breaking News: The Nobel in economics went to David Card for his work in labor economics, and to Joshua Angrist and Guido Imbens for analyzing relationships.\nhttps://t.co/sFDNP7tb9g",
  "data/tweet-nytimes/2021/10/1447662054379241478.json": "Diana Kipyokei of Kenya won the Boston Marathon on Monday, finishing in 2:24:45. This was the 27-year-old's first victory in a major marathon. https://t.co/5DDOkIihgt https://t.co/zZ5Wpc3rch",
  "data/tweet-nytimes/2021/10/1447694786392215552.json": "A Black man who was grabbed by the hair and pulled from a car by a police officer in Dayton, Ohio, while he was yelling \"I'm paraplegic\" has filed a complaint with the NAACP. The police in Dayton said they were investigating the incident.\nhttps://t.co/MyM1Ormr5O",
  "data/tweet-nytimes/2021/10/1447714413608374278.json": "Breaking News: The NFL coach Jon Gruden used misogynistic and homophobic language for years, a review of his emails shows. He denounced the emergence of women referees, the drafting of a gay player and the tolerance of protests during the national anthem. https://t.co/F3QpqV9yZS",
  "data/tweet-nytimes/2021/10/1447702322268844036.json": "Netflix recently suspended three employees, including a transgender employee who posted a Twitter thread last week criticizing a new Dave Chappelle stand-up special on the streaming service as being transphobic. https://t.co/pyOLCOVQZ0",
  "data/tweet-nytimes/2021/10/1447748888765546496.json": "Jon Gruden resigned as the coach of the Las Vegas Raiders on Monday. He had denounced the emergence of women as referees, the drafting of a gay player and the tolerance of players protesting during the national anthem, a review of his emails showed. https://t.co/mNUDnhYZfd https://t.co/RFyEMHiSxL",
  "data/tweet-nytimes/2021/10/1447691015494713346.json": "Black business owners were more likely to get Paycheck Protection Program loans from online lenders than from smaller banks, a new study says. Human bias appears to be the main reason. https://t.co/8H5NYSlTf2",
  "data/tweet-nytimes/2021/10/1447626835337125888.json": "Unvaccinated pregnant women make up nearly 20% of the most critically ill Covid patients in England, according to data released by the NHS on Monday. https://t.co/brYZlqZcaX",
  "data/tweet-nytimes/2021/10/1447766495912775680.json": "In Opinion\n\n“The best hope for the rational remnants of the GOP is for us to form an alliance with Democrats to defend American institutions,” write Miles Taylor and Christine Todd Whitman, both Republicans, in a guest essay.\nhttps://t.co/5FbV0ewywf",
  "data/tweet-nytimes/2021/10/1447904905482719235.json": "Prince Harry and Meghan, the Duchess of Sussex, are joining Ethic, a fintech asset manager in the environmental, social and governance space, as “impact partners” and investors.\n\nRead more in our @dealbook newsletter.\nhttps://t.co/HsSUYkpy8n",
  "data/tweet-nytimes/2021/10/1447864655452549120.json": "You should still get vaccinated even if you have had Covid before, scientists say. Here’s why.\nhttps://t.co/C7gaU26Hy5",
  "data/tweet-nytimes/2021/10/1447937613655068673.json": "Sally Rooney turned down an offer from an Israeli publisher to translate her most recent book, \"Beautiful World, Where Are You,\" to Hebrew, citing her support for Palestinians \"in their struggle for freedom, justice and equality.\" https://t.co/Z8dimYfIXD",
  "data/tweet-nytimes/2021/10/1447957754954584066.json": "The Brooklyn Nets barred Kyrie Irving, a prominent vaccine skeptic, from all games until he is \"eligible to be a full participant.\" https://t.co/oFGzvhq0BK",
  "data/tweet-nytimes/2021/10/1447680961769054209.json": "Deb Haaland, President Biden’s secretary of the Interior and the first Native American to lead a cabinet agency, says she ran the Boston Marathon on Monday as a tribute to the sacrifices of Indigenous people. https://t.co/6YqkiyFgi4",
  "data/tweet-nytimes/2021/10/1447940773262077966.json": "Breaking News: Low-dose aspirin should no longer be initially prescribed to try to prevent a first heart attack, stroke or colon cancer, a U.S. panel of experts suggested. https://t.co/zJlxyaGLiS",
  "data/tweet-nytimes/2021/10/1447932598148341769.json": "Thousands of people in India — including poets, political organizers and a Catholic priest — have been jailed under an antiterror law with roots in the British colonial era. The law is being challenged by the courts, which say it is an abuse of power.\nhttps://t.co/egmqdUz6vN",
  "data/tweet-nytimes/2021/10/1447717435604353029.json": "Matt Amodio's \"Jeopardy!\" streak is over: The game show's reigning contestant lost his 39th game on Monday. Amodio, a doctoral student at Yale, had the second-longest streak in the show's history. https://t.co/nthOeFZFfK",
  "data/tweet-nytimes/2021/10/1448013184800104452.json": "Gabrielle Petito, whose disappearance has led to a wide-ranging investigation into her fiancé, died of strangulation, the authorities said on Tuesday. https://t.co/93LLBIQg9U",
  "data/tweet-nytimes/2021/10/1448049624284008452.json": "An elk in Colorado who somehow shoved its head through a tire has finally had the object removed after two years. https://t.co/53IZ4eXEjx",
  "data/tweet-nytimes/2021/10/1448121480039047168.json": "Breaking News: The U.S. will open the Canada and Mexico borders for fully vaccinated travelers in November, lifting a 19-month ban that began with the pandemic. https://t.co/w8Og7vSOsn",
  "data/tweet-nytimes/2021/10/1448123845144162308.json": "The opening of the land borders 19 months after they closed will reconnect the United States with its neighbors, and is one of the last steps to opening the country's borders to vaccinated travelers throughout the world. https://t.co/afKh58sb9W https://t.co/kWQ9O7rOK1",
  "data/tweet-nytimes/2021/10/1447736314963632130.json": "Gov. Greg Abbott of Texas on Monday issued a broad executive order that bars vaccine mandates in the state. The order acknowledges that \"vaccines are strongly encouraged for those eligible to receive one, but must always be voluntary for Texans.\" https://t.co/Bds0SgYyQM",
  "data/tweet-nytimes/2021/10/1447947860918550535.json": "“We are living in the Covid-19 era, not the Covid-19 crisis,” says Allan Bran, a historian of science and medicine at Harvard University. “We will be dealing with many of the ramifications of Covid-19 for decades.” https://t.co/Wt2lU2XqJF",
  "data/tweet-nytimes/2021/10/1448072277652819969.json": "Gov. Greg Abbott of Texas issued an order on Monday barring nearly all Covid-19 vaccine mandates in the state. But it doesn't supersede President Biden’s orders requiring vaccine mandates for many kinds of employees, legal experts say. https://t.co/cD0xlr0M7g",
  "data/tweet-nytimes/2021/10/1448035766496595968.json": "History repeatedly demonstrates how difficult it is to decisively declare that a pandemic is over. https://t.co/eLaJOEdpEK https://t.co/sz7hiceZ0J",
  "data/tweet-nytimes/2021/10/1448260995839889410.json": "William Shatner, the actor who played Captain Kirk in “Star Trek,” is set to be launched to the edge of space on Wednesday, in a rocket made by Jeff Bezos’ company Blue Origin.\n\nHere’s how to watch.\nhttps://t.co/CcUqGOr9xL",
  "data/tweet-nytimes/2021/10/1447981673639993350.json": "Far more law enforcement officers in the U.S. have died from Covid-19 than from any other work-related cause in 2020 and 2021. Even so, police unions are fighting vaccine mandates. https://t.co/NUiijYNSI8 https://t.co/ecjzvSTpsi",
  "data/tweet-nytimes/2021/10/1448230801884262405.json": "The U.S. will open the Canada and Mexico borders for fully vaccinated travelers in November, lifting a 19-month ban that began with the pandemic. https://t.co/J0MEYesV63",
  "data/tweet-nytimes/2021/10/1448301818447081474.json": "Breaking News: William Shatner launched to the edge of space on a Blue Origin rocket. At 90, he is the oldest person to travel to those heights. Watch live here. https://t.co/MuQ8RedFgs",
  "data/tweet-nytimes/2021/10/1448322651718623233.json": "By traveling to the edge of space William Shatner, 90, became the oldest person ever to reach such heights. \"I'm so filled with emotion with what just happened,\" Shatner said after returning to Earth. \"I hope I never recover from this.\" https://t.co/QoDvuBKWig",
  "data/tweet-nytimes/2021/10/1448346961912991745.json": "William Shatner, 90, was emotional after returning to Earth. \"What you have given me is the most profound experience I can imagine,\" he told Jeff Bezos. \"I hope I never recover from this, I hope that I can maintain what I feel now. I don’t want to lose it.\"https://t.co/NdoH6vb7I6",
  "data/tweet-nytimes/2021/10/1448344048717139976.json": "Space agencies and astronauts said they were thrilled to see William Shatner become the oldest person to enter space. \"You are, and always shall be, our friend,\" NASA said in a tweet, paraphrasing Spock. https://t.co/mDgWl9E8Hn",
  "data/tweet-nytimes/2021/10/1448352706255536128.json": "William Shatner, 90, eternally famous as Captain James T. Kirk, returned to Earth apparently moved beyond measure. Brushing the edge of space left the actor full of wonder mixed with unease. https://t.co/9y0nqcsE0o https://t.co/kYNtyvZOBz",
  "data/tweet-nytimes/2021/10/1448333991686377473.json": "Adele's long-awaited return to music will start this week: She announced the release of a new single, “Easy on Me,” coming this Friday, to be followed by a new album on Nov. 19. https://t.co/sqfnawoqBJ",
  "data/tweet-nytimes/2021/10/1448102458241212416.json": "Nearly 4.3 million workers voluntarily quit their jobs in August, the Labor Department said Tuesday, the most in the two decades the government has been keeping track. https://t.co/gsAR17ug3B",
  "data/tweet-nytimes/2021/10/1448352710647066625.json": "The actor William Shatner became the oldest person to travel to space. The “Star Trek” star traveled to space with three other passengers on a mission that lasted about 10 minutes. Champagne corks popped. There was lots of laughter, high-spirited relief. https://t.co/usxXJKBDs7 https://t.co/SPH1Inv6F9",
  "data/tweet-nytimes/2021/10/1448393137081262087.json": "William Shatner's trip aboard Jeff Bezos’ rocket might have been conceived as a publicity stunt, but brushing the edge of the sky left the actor full of wonder. Shatner, 90, talked about space as the final frontier while Bezos listened, still as a statue. https://t.co/LL0QUsHt5t https://t.co/oaKwFinKTh",
  "data/tweet-nytimes/2021/10/1448388091408945158.json": "The Biden administration announced on Wednesday a plan to develop large scale wind farms along nearly the entire coastline of the U.S — part of the most forceful push ever by federal government to promote offshore wind development. https://t.co/pESrGJMVGn",
  "data/tweet-nytimes/2021/10/1448408282813673477.json": "Many experts are arguing that the U.S. should follow Canada's lead and require passengers flying domestically to be vaccinated or tested for the coronavirus in order to fly. https://t.co/j0IdRHEBUG",
  "data/tweet-nytimes/2021/10/1448117566526926849.json": "These tender cookies are packed with bright lemon flavor. Bake them all at once or save half of the dough in the freezer for later. https://t.co/PyhD44Elti",
  "data/tweet-nytimes/2021/10/1448418301084934147.json": "Nearly 70 years after her death, Henrietta Lacks — whose cancer cells were taken without her knowledge or consent and led to world-changing advances in medical and scientific research— was honored by the World Health Organization. https://t.co/IVzsuygwvy",
  "data/tweet-nytimes/2021/10/1448448483883634697.json": "Mississippi is threatening to sue Brett Favre, the Hall of Fame quarterback, if he does not repay $828,000 that he owes within 30 days. Favre and others are being asked to repay tens of millions of dollars connected to an extensive welfare fraud scheme. https://t.co/YYdCFOHK66",
  "data/tweet-nytimes/2021/10/1448131664312426498.json": "Anne Saxelby, who championed American artisanal cheeses for more than 15 years, died on Saturday. She was 40. https://t.co/HGLOTaxR0M",
  "data/tweet-nytimes/2021/10/1448521478446718979.json": "A coalition of Czech parties defeated the populist prime minister, offering a road map for toppling strongmen to opposition forces in Europe. https://t.co/B6WYIXOkEu",
  "data/tweet-nytimes/2021/10/1448476171692384266.json": "With the Senate out of session, Senator Kyrsten Sinema, the moderate Arizona Democrat who has objected to the size and scope of President Biden's sweeping legislative agenda, has been in Europe on a fund-raising trip. https://t.co/YbNeHMwKQ2",
  "data/tweet-nytimes/2021/10/1448381816876961804.json": "Ruthie Tompson, who worked on nearly every one of Disney's animated features over four decades, including \"Snow White and the Seven Dwarfs,\" \"Pinocchio\" and \"Dumbo,\" has died at 111. https://t.co/z3N0UBwPDf",
  "data/tweet-nytimes/2021/10/1448380299713335296.json": "Breaking News: A man reported to be armed with a bow and arrow went on a rampage in a Norwegian town on Wednesday, killing and wounding several people, the authorities said. This is a developing story. https://t.co/J3g5njispo",
  "data/tweet-nytimes/2021/10/1448395626417467392.json": "In Opinion\n\n@RGay writes about Dave Chappelle's new Netflix special: \"Many of Chappelle’s rants are extraordinarily dated, the kind of comedy you might expect from a conservative boomer, agog at the idea of homosexuality.\" https://t.co/f7AQpLjeTa",
  "data/tweet-nytimes/2021/10/1448374295214923782.json": "Blue Origin wants to go to the moon, build larger rockets and, according to Jeff Bezos, eventually move all polluting industries off Earth and into space. https://t.co/UepXabskmB",
  "data/tweet-nytimes/2021/10/1448604533299556355.json": "Kyrie Irving, an NBA player for the Brooklyn Nets, spoke out publicly for the first time since the team barred him from the court because of his refusal to get the Covid-19 vaccine. He said his decision was a matter of personal freedom. https://t.co/8NcVFDSwIm",
  "data/tweet-nytimes/2021/10/1448626885475307526.json": "Nicholas Kristof, after 37 years at The New York Times as a reporter, editor and opinion columnist, is leaving the newspaper as he considers running for governor of Oregon, the state where he grew up. https://t.co/0mVig79bFP",
  "data/tweet-nytimes/2021/10/1448589434316808193.json": "Ruth Hamilton was fast asleep when a 2.8-pound meteorite crashed through the ceiling of her home in British Columbia, landing between her pillows and barely missing her head.\n\n“Oh, my gosh,” she told the emergency operator, “there’s a rock in my bed.” https://t.co/yMInpxvzSg",
  "data/tweet-nytimes/2021/10/1448654835121725441.json": "Ruth Hamilton was fast asleep when a 2.8-pound meteorite crashed through the ceiling of her home in British Columbia, landing between her pillows and barely missing her head.\n\n“Oh, my gosh,” she told the emergency operator, “there’s a rock in my bed.” https://t.co/OODcIuO614",
  "data/tweet-nytimes/2021/10/1448683809784963073.json": "A Texas man was sentenced to 23 years in federal prison on Wednesday for his connection in a scheme that used the dating app Grindr to target gay men for violent hate crimes, prosecutors said. https://t.co/ANKagRezuy",
  "data/tweet-nytimes/2021/10/1448662398215147531.json": "The 25 largest orchestras in the U.S. have something in common: Not one is led by a woman. But that will change when Nathalie Stutzmann, a French conductor and singer, takes the Atlanta Symphony Orchestra’s podium next year. https://t.co/UCvjgAWDtm",
  "data/tweet-nytimes/2021/10/1448720042242330624.json": "Breaking News: The panel investigating the Jan. 6 attack on the Capitol will vote next week to recommend that Steve Bannon face criminal contempt charges for not complying with a subpoena. https://t.co/0k0ETI9gZR",
  "data/tweet-nytimes/2021/10/1448776044274757634.json": "Andrew McCabe, a former FBI deputy director who was fired under Donald Trump, won back his pension and other benefits after settling a lawsuit against the Justice Department in which he asserted that he was dismissed for political reasons. https://t.co/UFGNsbvgIT",
  "data/tweet-nytimes/2021/10/1448747969252057089.json": "The Banksy painting that sensationally self-destructed three years ago after being sold at auction was resold by Sotheby’s Thursday for 18.6 million pounds, or $25.4 million, a record for the artist. https://t.co/BwxkYZhd2F",
  "data/tweet-nytimes/2021/10/1448767543926267906.json": "Lora Reinbold, a Republican state senator who was barred from Alaska Airlines flights after she refused to wear a mask, disclosed that she had tested positive for the coronavirus. https://t.co/deLx04emha",
  "data/tweet-nytimes/2021/10/1448830351242051584.json": "Breaking News: Jeff Pash, the NFL's top lawyer, had a cozy relationship with a longtime president of the troubled Washington Football Team, emails show. Pash and the executive brokered penalties, discussed a cheerleading scandal and arranged perks. https://t.co/BYAuScv3FJ",
  "data/tweet-nytimes/2021/10/1448828498148270082.json": "California recently became the first U.S. state to:\n— Ban the sale of gas-powered lawn mowers\n— Make the garment industry pay workers by the hour, instead of per item\n— Require public high school students to take an ethnic studies course before graduating\nhttps://t.co/zQ9EyiT4Y6",
  "data/tweet-nytimes/2021/10/1448800820150034437.json": "Dave Chappelle's comments on transgender people and gender in his latest Netflix special, \"The Closer,\" have led to outside criticism and internal unrest at the company.\n\n\"We'll continue to work with Dave Chappelle in the future,\" one executive said. https://t.co/l8LZ3OCHHt",
  "data/tweet-nytimes/2021/10/1448831506374447106.json": "Bill Clinton has been hospitalized with a \"non-Covid-related infection,\" a spokesman said on Thursday.\n\"He is on the mend, in good spirits and is incredibly thankful to the doctors, nurses, and staff providing him with excellent care,\" the spokesman added. https://t.co/5qZhYCyJO6",
  "data/tweet-nytimes/2021/10/1448857442046128172.json": "A Texas man was sentenced to 23 years in federal prison on Wednesday for his connection in a scheme that used the dating app Grindr to target gay men for violent hate crimes, prosecutors said. https://t.co/TreNGvMF98",
  "data/tweet-nytimes/2021/10/1448916563353128972.json": "Italy introduced a sweeping Covid vaccine mandate on Friday that requires the country’s entire work force to either be vaccinated or take a test every two days. Workers who do not meet the new requirements must take unpaid leave.\n\nFollow updates here.\nhttps://t.co/CT43phvhyo",
  "data/tweet-nytimes/2021/10/1448960621383462912.json": "Italy is requiring all workers to be vaccinated or take frequent coronavirus tests, the most sweeping mandate yet by a major Western democracy.\nhttps://t.co/6brkTA5W6Q",
  "data/tweet-nytimes/2021/10/1448853687074500634.json": "Ruth Hamilton was fast asleep when a 2.8-pound meteorite crashed through the ceiling of her home in British Columbia, landing between her pillows and barely missing her head.\n\n“Oh, my gosh,” she told the emergency operator, “there’s a rock in my bed.” https://t.co/zlEbrTWUVr https://t.co/7W7IrWWK0O",
  "data/tweet-nytimes/2021/10/1449014820880125955.json": "Breaking News: Fully vaccinated foreigners can enter the U.S. starting Nov. 8, a White House official said.\nhttps://t.co/IuRfqayrYt",
  "data/tweet-nytimes/2021/10/1448958480388345857.json": "Port workers in Trieste, one of Italy’s largest shipping and transport hubs, blocked access to the port in protest of the country’s new Covid health pass mandate that came into effect on Friday.\nhttps://t.co/SRblzLXUG3",
  "data/tweet-nytimes/2021/10/1448999621108318235.json": "Dave Chappelle's comments on transgender people and gender in his latest Netflix special, \"The Closer,\" have led to outside criticism and internal unrest at the company.\n\n\"We'll continue to work with Dave Chappelle in the future,\" one executive said. https://t.co/DdDSUxh0n0",
  "data/tweet-nytimes/2021/10/1449063115203792905.json": "Breaking News: The Biden administration will ask the Supreme Court to block a Texas law that bars most abortions after six weeks of pregnancy while a challenge to it moves forward, a Justice Department spokesman said on Friday. https://t.co/G66G5JXVYd",
  "data/tweet-nytimes/2021/10/1449065695816392707.json": "\"We recognize there are not two sides of the Holocaust.\" A Texas school superintendent apologized to his district after one of his top officials advised teachers that students learning about the Holocaust should have access to \"opposing\" perspectives. https://t.co/MTXjz1NUVq",
  "data/tweet-nytimes/2021/10/1449091484368703489.json": "A Texas school superintendent apologized to his district after one of his top officials advised teachers to \"make sure that if you have a book on the Holocaust, that you have one that has an opposing, that has other perspectives.\" https://t.co/waMROVA2s7 https://t.co/27PhXmVqAF",
  "data/tweet-nytimes/2021/10/1449066304904781824.json": "Hannah Gadsby publicly upbraided the Netflix CEO Ted Sarandos for citing her specials on the platform in his defense of Dave Chapelle, telling him not to \"drag my name\" into his justifications of \"hate speech dog whistling you refuse to acknowledge.\" https://t.co/k244bKRBr4",
  "data/tweet-nytimes/2021/10/1449121669482786822.json": "Italy's requirement that all workers be vaccinated shows it is willing to use the full leverage of the state to try to curb the pandemic and get the economy moving. Most Italians accept it as a tolerable sacrifice. https://t.co/B2DOfeG1ku",
  "data/tweet-nytimes/2021/10/1449150745354412035.json": "Breaking News: The heart of President Biden's climate agenda — a push to replace coal- and gas-fired power plants — is said to likely be cut from the budget bill because Senator Joe Manchin opposes it. https://t.co/h73QT7NDpe",
  "data/tweet-nytimes/2021/10/1449116643653791745.json": "Netflix fired an employee for leaking documents about Dave Chappelle's new special, which critics inside and outside the company have called transphobic. The comedian Hannah Gadsby on Friday rebuked the Netflix co-chief executive Ted Sarandos by name. https://t.co/m8KmXUQa4G",
  "data/tweet-nytimes/2021/10/1449189612157538304.json": "Illinois Democrats on Friday proposed a new set of highly gerrymandered congressional maps that would consolidate Democratic power in the state’s congressional delegation, most likely cutting the number of Republican seats in the state to three from five. https://t.co/BQRc67D01K",
  "data/tweet-nytimes/2021/10/1448951816419483659.json": "Bill Clinton has been hospitalized after he had a urological infection that developed into sepsis, an aide said on Thursday. The aide said it was not considered to be acute. https://t.co/z6GuVA0maU",
  "data/tweet-nytimes/2021/10/1449350677830983681.json": "The habit of sea otters digging for food and disturbing eelgrass seems to make oceanic ecosystems more resilient, scientists found, highlighting the importance of restoring missing predators like sea otters to marine ecosystems. https://t.co/59uNWB53BU",
  "data/tweet-nytimes/2021/10/1449379631572955144.json": "Part of the Catholic church in Sicily has imposed a three-year prohibition on naming godparents, arguing that the tradition has become merely a way to fortify family ties — and mob ties, too.\nhttps://t.co/ASXmB51NZY",
  "data/tweet-nytimes/2021/10/1449558072884670468.json": "Breaking News: Gang members in Haiti kidnapped as many as 17 American missionaries and their family members as they were leaving an orphanage, Haitian officials said.\nhttps://t.co/yrWqP7HiJ2",
  "data/tweet-nytimes/2021/10/1449460140449615875.json": "\"I’m world famous for hiding in plain sight,\" says Questlove, the drummer, D.J. and producer who is everywhere and loved by everyone. But few understand what drives him: an obsession with spreading the joys of Black music. https://t.co/nojDuxgs6f",
  "data/tweet-nytimes/2021/10/1449087716986179586.json": "All workers in Italy must be vaccinated against Covid-19 or take frequent coronavirus tests. Opponents of the measure tried to mount protests, but most Italians appeared to accept the rule as necessary. https://t.co/HqjneKYw7h https://t.co/GgU8T1AqWw",
  "data/tweet-nytimes/2021/10/1449484064067624961.json": "\"Insecure\" was only the second comedy created by and starring a Black woman when it debuted in 2016. Now in its final season, the show depicts its characters as authentically flawed. We spoke to creator and star Issa Rae about portraying vulnerability. https://t.co/OPQ0kJBxDX",
  "data/tweet-nytimes/2021/10/1449622472245104640.json": "Here’s how to make Dalgona Candy, or Ppopgi, the South Korean treat featured in an episode of the Netflix hit “Squid Game.”  https://t.co/r7h8zC37mT",
  "data/tweet-nytimes/2021/10/1449531876859944961.json": "Iztapalapa, the most populous neighborhood in Mexico City, has become a giant art gallery, blanketed with almost 7,000 pieces of commissioned public art commissioned by the government. But poverty and attacks against women are still pervasive in the area. https://t.co/Z3SdQ6xo25 https://t.co/OEsY9FhtSl",
  "data/tweet-nytimes/2021/10/1449752086078447623.json": "During the siege of the U.S. Capitol on Jan. 6, seemingly average citizens — believing the lie that the 2020 presidential election was stolen — united in breathtaking acts of brutality. Amid a flash of violence, seven men from seven states stood out. https://t.co/xSQGXy9TmR",
  "data/tweet-nytimes/2021/10/1449778523653214217.json": "Former President Bill Clinton was released from a California hospital on Sunday after being admitted on Tuesday for treatment of a urological infection that developed into sepsis, officials said. https://t.co/sQaAyPyfGl",
  "data/tweet-nytimes/2021/10/1449812502766886919.json": "As Senator Joe Manchin blocks President Biden’s climate plan, new data shows that no state is more exposed to flood damage than his own. https://t.co/DsuRUGPZGc",
  "data/tweet-nytimes/2021/10/1449489213334986752.json": "Breaking news: Robert Durst, 78, is on a ventilator in a Los Angeles hospital after testing positive for Covid-19, days after being sentenced to life in prison for murder, his lawyer said on Saturday. https://t.co/cB8MIrJngu",
  "data/tweet-nytimes/2021/10/1449819861408960512.json": "Sister Megan Rice was a nun who was arrested more than 40 times for protesting America’s military industrial complex, most spectacularly for breaking into one of the world’s largest uranium storage sites. She has died at age 91. https://t.co/lBA3pegFRN",
  "data/tweet-nytimes/2021/10/1449815548360110085.json": "As a woman was being raped while on a train near Philadelphia on Wednesday night, riders watched, failed to intervene and did not call 911, the authorities said. https://t.co/IzbwLNrgTO",
  "data/tweet-nytimes/2021/10/1449714330287624194.json": "These spiced pumpkin cookies are delightfully tender and moist, simple, and absolutely divine with a cup of coffee. ☕️ 🎃\nhttps://t.co/1n68Fxi2it",
  "data/tweet-nytimes/2021/10/1449833943419826177.json": "The powerful German media company Axel Springer is ahead on digital media but seems stuck in the past when it comes to workplace conditions. \"Those who sleep with the boss get a better job,\" a woman told investigators. https://t.co/txqeoVphlt",
  "data/tweet-nytimes/2021/10/1449804938494763010.json": "Police officers and others responsible for public safety should view vaccination against Covid-19 as a key part of their role, Dr. Anthony Fauci said. Police unions in cities across the U.S. are urging members to resist Covid vaccine requirements. https://t.co/ELP7kiMPay",
  "data/tweet-nytimes/2021/10/1449876634169905162.json": "What happens when tattoos are no longer permanent? A company called Ephemeral has engineered body ink that disappears in 15 months or less, setting off an existential debate about commitment. https://t.co/wMhoYF9DHG",
  "data/tweet-nytimes/2021/10/1449895544629903365.json": "Gary Paulsen, a prolific writer and the author of more than 200 young-adult novels like \"Hatchet\" and \"Dogsong\" that inspired generations of would-be adventurers with tales of survival, exploration and nature, died on Wednesday. He was 82. https://t.co/RJmntoej1R",
  "data/tweet-nytimes/2021/10/1449786059919925254.json": "Bill Clinton was released from a California hospital on Sunday after treatment for a urological infection that developed into sepsis, officials said. Sepsis, a life-threatening response to infection, is a common cause of death in hospitals. https://t.co/lElRhEQ8WJ https://t.co/eCMQpY52gY",
  "data/tweet-nytimes/2021/10/1449925085205254146.json": "Costa Rica and the city of Milan were among the first to be awarded the Earthshot Prize, presided over by Prince William and the Duchess of Cambridge, for their sustainability and conservation efforts. https://t.co/Q2jEo0lbhI",
  "data/tweet-nytimes/2021/10/1450074208638230536.json": "Breaking News: Colin Powell has died at 84 of Covid-19. He was fully vaccinated, his family said.\n\nIn four decades of public life, he served in top national security roles and helped pave the way for the war in Iraq.\nhttps://t.co/RdMQfkUaS3",
  "data/tweet-nytimes/2021/10/1450038974282620929.json": "As Senator Joe Manchin blocks President Biden’s climate plan, new data shows that no state is more exposed to flood damage than his own. https://t.co/snOWC4rLcJ",
  "data/tweet-nytimes/2021/10/1450088925956034570.json": "Colin Powell, who was the first Black national security adviser, chairman of the Joint Chiefs of Staff and secretary of state in U.S. history, died at 84 of Covid-19. He was fully vaccinated, his family said.\nhttps://t.co/XjF4aptWrT https://t.co/FWSkeiSbUk",
  "data/tweet-nytimes/2021/10/1450108901727277059.json": "Breaking News: The Biden administration said it would regulate PFAS, the \"forever chemicals\" in many household items that have contaminated drinking water. Exposure to the chemicals has been linked to certain cancers and other health issues. https://t.co/yDMwRIAsMX",
  "data/tweet-nytimes/2021/10/1450106922384957441.json": "Colin Powell is being honored as a statesmen and public servant after he died of Covid-19.\n\n“He was such a favorite of presidents that he earned the Presidential Medal of Freedom — twice,” George W. Bush said.\nhttps://t.co/9KQnbCXM8a",
  "data/tweet-nytimes/2021/10/1450115754716590087.json": "Here’s a look back at Colin Powell’s military and political career in photos. https://t.co/RHVNiQ3bLV https://t.co/Jyqky9UdRf",
  "data/tweet-nytimes/2021/10/1450119711648256000.json": "Within minutes of news on Colin Powell’s death on Monday morning, politicians of both parties, public figures and celebrities honored him as a statesman and public servant. https://t.co/yMsiWDHpJC https://t.co/KY6UARiQ3h",
  "data/tweet-nytimes/2021/10/1450133432638529536.json": "Former Secretary of State Colin Powell was fully vaccinated against Covid, but his battle against a type of blood cancer had weakened his immune system. https://t.co/RVMa14U8Lz https://t.co/mj6pzY4MLx",
  "data/tweet-nytimes/2021/10/1450147973556473862.json": "Breaking News: The German media giant Axel Springer removed Julian Reichelt, the editor of its powerful tabloid Bild, from his duties after our media columnist revealed allegations that he had behaved inappropriately with women. https://t.co/jEpZ87vzwC",
  "data/tweet-nytimes/2021/10/1450125798179020809.json": "Days after the Jan. 6 riot at the U.S. Capitol, Colin Powell, who had long identified as a Republican and a conservative, said he was leaving the party.\n\n\"I can no longer call myself a fellow Republican,\" he said. https://t.co/Vo0ouPRnnr",
  "data/tweet-nytimes/2021/10/1450159804530442250.json": "After more than two decades, the official wizard of Christchurch, New Zealand has lost his job. He was believed to be the world's only wizard on a government payroll, paid $10,000 annually by the city for \"acts of wizardry and other wizard-like services.\" https://t.co/YTZqv7751L",
  "data/tweet-nytimes/2021/10/1450174858202124288.json": "Colin Powell had multiple myeloma. The form of blood cancer hobbles the immune system and makes vaccines, including those for Covid-19, largely ineffective. https://t.co/kuUaPqcB6q",
  "data/tweet-nytimes/2021/10/1450220922791677952.json": "Breaking News: The FDA is moving to allow people to get a different Covid vaccine as a booster than the one they initially received. https://t.co/uOSPwD2fHV",
  "data/tweet-nytimes/2021/10/1450163567991345161.json": "President Biden said Colin Powell embodied \"the highest ideals of both warrior and diplomat.\"\n\n\"Above all, Colin was my friend. Easy to share a laugh with. A trusted confidant in good and hard times,\" Biden said. https://t.co/GbKumxonWE https://t.co/orDeDtI5WF",
  "data/tweet-nytimes/2021/10/1450257920768217093.json": "Breaking News: Washington State University is said to have fired its football coach, Nick Rolovich, and four of his assistants for failing to comply with the state's vaccine mandate. https://t.co/DZhDCnlRAs",
  "data/tweet-nytimes/2021/10/1450240288304373762.json": "A 900-year-old sword that a scuba diver found off the Carmel coast of Israel weighs four pounds, measures about four feet long and originated from the Third Crusade, experts said. https://t.co/jZnftfpGoj",
  "data/tweet-nytimes/2021/10/1450266971375820802.json": "After more than two decades, the official wizard of Christchurch, New Zealand, has lost his job. He was believed to be the world's only wizard on a government payroll, paid $10,000 annually by the city for \"acts of wizardry and other wizard-like services.\" https://t.co/nRzuy70dKZ https://t.co/3pvQAwC8B6",
  "data/tweet-nytimes/2021/10/1450008777294483465.json": "Costa Rica and the city of Milan were among the first to be awarded the Earthshot Prize, presided over by Prince William and the Duchess of Cambridge, for their sustainability and conservation efforts. https://t.co/EJFZ1Lx56G",
  "data/tweet-nytimes/2021/10/1449955942032977932.json": "\"Like a good book or piece of music, a park bench allows for a sense of solitude and community at the same time, a simultaneity that’s crucial to life in a great city.\" In a world that wants you to pay for everything, public seating is becoming a luxury. https://t.co/wtsUEFDReh",
  "data/tweet-nytimes/2021/10/1450152230087274498.json": "President Biden paid tribute to Colin Powell, calling him a friend and a \"patriot of unmatched honor.\"\n\n\"Over our many years working together — even in disagreement — Colin was always someone who gave you his best and treated you with respect,\" Biden said. https://t.co/vvhpmLAyZG",
  "data/tweet-nytimes/2021/10/1450333416256380931.json": "Washington State University fired its football coach, Nick Rolovich, and four of his assistants on Monday for failing to comply with the state's Covid-19 vaccination mandate. https://t.co/AM7H22zi9Z",
  "data/tweet-nytimes/2021/10/1450381224330022916.json": "After more than two decades, the official wizard of Christchurch, New Zealand, has lost his job. He was believed to be the world's only wizard on a government payroll, paid $10,000 annually by the city for \"acts of wizardry and other wizard-like services.\" https://t.co/AuUVRVGqIH https://t.co/uMA84vSdYy",
  "data/tweet-nytimes/2021/10/1450230244514881539.json": "A statue of Thomas Jefferson will be removed from the City Council chambers in New York after a debate over his legacy and association with slavery. https://t.co/24p8qloLdn",
  "data/tweet-nytimes/2021/10/1450363613974249472.json": "A 900-year-old sword that a scuba diver found off the Carmel coast of Israel weighs four pounds, measures about four feet long and originated from the Third Crusade, experts said. https://t.co/67k137yRB2",
  "data/tweet-nytimes/2021/10/1450473081047326725.json": "In Opinion\n\n“I’d like to hope that Manchin is sincere — that he actually believes that he’s protecting his state’s interests,” Paul Krugman writes. “The problem is that he seems to have a decades-out-of-date vision of what his state needs.”\nhttps://t.co/doVW3UpLCe",
  "data/tweet-nytimes/2021/10/1450515869407272970.json": "The Pfizer-BioNTech vaccine was 93% effective against hospitalization with Covid-19 among 12- to 18-year-olds, the CDC reported on Tuesday. https://t.co/dWZLQr1ezI",
  "data/tweet-nytimes/2021/10/1450541375888535553.json": "Breaking News: President Jair Bolsonaro of Brazil should face homicide charges over his mishandling of the pandemic, a Brazilian Senate report said, asserting that his policies intentionally let the virus kill hundreds of thousands of people in Brazil. https://t.co/E9M07K75wK",
  "data/tweet-nytimes/2021/10/1450563717620437000.json": "A 900-year-old sword that a scuba diver found off the Carmel coast of Israel weighs four pounds, measures about four feet long and originated from the Third Crusade, experts said. https://t.co/HYBh222kGf https://t.co/lxoXfF4jsl",
  "data/tweet-nytimes/2021/10/1450480651065561089.json": "Democrats agreed to scale back a plan for the IRS to try to crack down on tax cheats, bowing to an aggressive lobbying campaign by the banking industry and pushback from Republicans. https://t.co/owwTEod1kM",
  "data/tweet-nytimes/2021/10/1450587597340913664.json": "Dr. Rachel Levine was sworn in as  the first female four-star admiral in the history of the U.S. Public Health Service Commissioned Corps, a uniformed service of more than 6,000 health, science and engineering professionals.\nhttps://t.co/vR69Ae18qB https://t.co/94phwg83KO",
  "data/tweet-nytimes/2021/10/1450658324542857222.json": "Breaking News: In a first, a kidney grown in a genetically altered pig was found to work normally after it was attached to a human patient. https://t.co/WJawx4qTJy",
  "data/tweet-nytimes/2021/10/1450613265822846977.json": "Breaking News: A House panel recommended charging Steve Bannon with contempt for refusing to comply with a subpoena in the Capitol riot inquiry. The House is expected to approve the move and hand the matter over to the Justice Department for prosecution. https://t.co/V3cPn11NCa",
  "data/tweet-nytimes/2021/10/1450680710784851971.json": "Neil Cavuto, a Fox News anchor, has tested positive for the coronavirus. “Had I not been vaccinated, and with all my medical issues, this would be a far more dire situation,” he said. https://t.co/5CgkYDkizZ",
  "data/tweet-nytimes/2021/10/1450590118235054092.json": "President Jair Bolsonaro of Brazil should face homicide charges over his mishandling of the pandemic, a report by a panel of Brazilian senators said, asserting that his policies intentionally let the virus kill hundreds of thousands of people in Brazil. https://t.co/rQhHATHwmW https://t.co/UTzlE7ppZy",
  "data/tweet-nytimes/2021/10/1450749925474586629.json": "Mark Zuckerberg will be added to a data privacy lawsuit in one of the first efforts by a regulator to expose him personally to potential penalties.\nhttps://t.co/0r0Wj5wBxH",
  "data/tweet-nytimes/2021/10/1450781967423885312.json": "Breaking News: New York City will require all city workers to be vaccinated against the coronavirus or risk losing their jobs, Mayor Bill de Blasio said. Regular testing will not be an option for workers who refuse to get vaccinated, he said.\nhttps://t.co/zMyAjI4ZXI",
  "data/tweet-nytimes/2021/10/1450821620206084104.json": "Aleksei Navalny, the imprisoned Russian opposition leader, was awarded the EU’s top human rights award.\n\n“Today’s prize recognizes his immense bravery and we reiterate our call for his immediate release,” the president of the European Parliament said.\nhttps://t.co/tuA5r1imGs",
  "data/tweet-nytimes/2021/10/1450763775599128595.json": "In a first, a kidney grown in a genetically altered pig was found to work normally after it was attached to a human patient. https://t.co/EjjQOknyEQ https://t.co/n2zzW3ejjZ",
  "data/tweet-nytimes/2021/10/1450786389268779011.json": "Senate Republicans were expected again to block action on voting rights legislation. Lawmakers and activists are becoming increasingly alarmed that the proposed legislation will stall and put Democrats at a disadvantage in coming elections. https://t.co/EOywTMPMUt",
  "data/tweet-nytimes/2021/10/1450824135681183744.json": "New York City will require all city workers to be vaccinated by the end of the month or lose their paychecks, a new mandate for the largest municipal work force in the U.S., Mayor Bill de Blasio said. https://t.co/9fI9W9M0in https://t.co/P9e2bkGZqi",
  "data/tweet-nytimes/2021/10/1450846902950547460.json": "The movie theater chain AMC will offer open captions, which are displayed on screen in a way similar to subtitles, at 240 locations in the U.S.\n\nThe move was praised by advocates for the deaf and the hard of hearing, who have long sought better captioning.\nhttps://t.co/eH2z4VXz0t",
  "data/tweet-nytimes/2021/10/1450879513143898112.json": "\"It was the first time the Atlantic Ocean was crossed.\" Scientists say they have pinned down a precise year that Norse explorers from Europe were on land that came to be Newfoundland — the year A.D. 1021, or exactly 1,000 years ago. https://t.co/w5b4Bs7KDx",
  "data/tweet-nytimes/2021/10/1450880758059610112.json": "A man said he asked two police officers to wear masks in accordance with MTA and New York City Police Department policy before he was eventually pushed out of the station. “If you’re not going to ride the train, just get out,” he said an officer told him. https://t.co/B6C8zdF5N8",
  "data/tweet-nytimes/2021/10/1450567457807245316.json": "In the spring of 2020, Donald Trump’s ​defense secretary quashed a proposal to send up to 250,000 U.S. troops to seal the border with Mexico. Top national security aides also talked Trump out of launching military raids against drug cartels inside Mexico. https://t.co/Yc8q23Y6eN",
  "data/tweet-nytimes/2021/10/1450892089361903617.json": "Amherst College announced on Wednesday that it would end legacy admissions, becoming one of the first highly selective colleges in the U.S. to abandon a practice that has been a persistent barrier to increasing student diversity. https://t.co/UHHRWGocaZ",
  "data/tweet-nytimes/2021/10/1450931145969971210.json": "Breaking News: The FDA authorized Moderna and Johnson &amp; Johnson for booster shots, and allowed the mixing and matching of different types of Covid vaccines. https://t.co/TDnHmi08Uw",
  "data/tweet-nytimes/2021/10/1450938631393271811.json": "Human remains were found in a Florida wildlife reserve on Wednesday, near items belonging to Brian Laundrie, who has been declared a \"person of interest\" in the murder of his fiancée, Gabrielle Petito, the FBI said. https://t.co/VwBgnOvbJ7",
  "data/tweet-nytimes/2021/10/1450977657844293636.json": "Nadia Chaudhri was a neuroscientist with terminal ovarian cancer who used her final months to raise money for graduate students of diverse backgrounds and to educate the public about her disease. She has died at age 43. https://t.co/tedGqj0TVP",
  "data/tweet-nytimes/2021/10/1450944958068838400.json": "Mayor Bill de Blasio said 46,000 unvaccinated New York City workers must get a coronavirus shot by November or lose their paychecks. Regular testing will not be an option for workers who refuse to get vaccinated, he said. https://t.co/lsYdEH4uJV",
  "data/tweet-nytimes/2021/10/1450970108004872192.json": "New York City will require all city workers to be vaccinated by the end of October or lose their paychecks. City employees will no longer be allowed to submit to regular testing as an alternative. https://t.co/FoyCgY2AiY https://t.co/99RknRhnjv",
  "data/tweet-nytimes/2021/10/1450926076272812039.json": "Dozens of Netflix employees walked out of a Los Angeles office building on Wednesday, protesting Dave Chappelle's recent stand-up special. They carried signs that read \"Team Trans\" and \"Transphobia Is Not a Joke.\"  https://t.co/5YTYK93dGl",
  "data/tweet-nytimes/2021/10/1450935621212643338.json": "Amid cheers and chants of “Team trans!,” dozens of Netflix employees walked out of a Los Angeles office building, protesting Dave Chappelle's stand-up special. In addition, many staffers working remotely called off work for the day at noon. https://t.co/DtoyDxEnzZ https://t.co/QzsYmoZl5t",
  "data/tweet-nytimes/2021/10/1450863154502803459.json": "The U.S. government sold Wu-Tang Clan’s one-of-a-kind album \"Once Upon a Time in Shaolin\" to satisfy a judgment against its first owner, Martin Shkreli.\n\nNow we know who bought it. https://t.co/jl8XE1Igjf",
  "data/tweet-nytimes/2021/10/1451136945325752321.json": "Boston Celtics games were pulled from the Chinese internet after Enes Kanter, a center on the team, said on social media that Xi Jinping, China's leader, was a \"brutal dictator.\" https://t.co/0QKKINfkBv",
  "data/tweet-nytimes/2021/10/1451111063181742082.json": "In Opinion\n\n\"Marriage as the prevailing ideal is losing its grip. And the stigma of being unmarried is also losing its grip, as it should. Now government policy that rewards the married while punishing the single must also loosen up,\" Charles Blow writes. https://t.co/JrgPlkPbBc",
  "data/tweet-nytimes/2021/10/1451194095670415384.json": "Five veterans tapped to advise Senator Kyrsten Sinema, an Arizona Democrat, resigned from their posts on Thursday, publicly accusing her of \"hanging your constituents out to dry\" and \"answering to big donors rather than your own people.\" https://t.co/oSVqSoB72X",
  "data/tweet-nytimes/2021/10/1451197852663771157.json": "Organizers at Amazon’s only fulfillment center in New York City are nearing enough signatures to file for a union election. If their request is validated, it could bring the second unionization vote at an Amazon warehouse in less than a year. https://t.co/PW18wWNoBV",
  "data/tweet-nytimes/2021/10/1451152559557816327.json": "Will today be a bones day? 🦴 Millions of people are checking on Noodle, a TikTok-famous pug, every day to find out. https://t.co/obgP8nAzgC",
  "data/tweet-nytimes/2021/10/1450904676413607942.json": "Scientists now believe that a site known as L’Anse aux Meadows was inhabited by Vikings who came from Greenland. To this day, it remains the only conclusively identified Viking site in the Americas outside of Greenland. https://t.co/omri1Lx7At https://t.co/BnXo6xO2kn",
  "data/tweet-nytimes/2021/10/1451312355695026177.json": "Dental records confirmed that the human remains found in a thickly wooded Florida park were those of Brian Laundrie, a “person of interest” in the murder of his fiancée, Gabrielle Petito, the FBI said on Thursday. \nhttps://t.co/wUQ7LH67AD",
  "data/tweet-nytimes/2021/10/1451282362994728975.json": "Breaking News: The House voted to find Steve Bannon in criminal contempt for stonewalling the Capitol riot inquiry. The Justice Department will decide whether to prosecute. https://t.co/79Tg6JB1Kv",
  "data/tweet-nytimes/2021/10/1451381737607634947.json": "Breaking News: Alec Baldwin fired a prop firearm while filming the movie \"Rust\" in New Mexico, killing a crew member and injuring the film’s director, the authorities said. https://t.co/65DyjQC63q",
  "data/tweet-nytimes/2021/10/1451277136891887627.json": "During the Mozambican Civil War from 1977 to 1992, humans killed so many elephants for their lucrative ivory that the animals seem to have evolved in the space of a generation. The result was that a large number are now naturally tuskless. https://t.co/Q41vkiO27o",
  "data/tweet-nytimes/2021/10/1451160125973086211.json": "Over the past decade, the waters around Cape Cod have become host to one of the densest seasonal concentrations of adult white sharks in the world. https://t.co/LcICQ7GEhk",
  "data/tweet-nytimes/2021/10/1451248489455816705.json": "Breaking News: The Federal Reserve announced sweeping new limits on trading by senior Fed officials after repeated criticism of its ethics rules. https://t.co/e3eLeGTml4",
  "data/tweet-nytimes/2021/10/1451407983078952976.json": "President Biden said that he was open to ending the Senate filibuster so Democrats could pass voting rights legislation, raise the federal debt limit and possibly enact other parts of his agenda that had been blocked by Republicans. https://t.co/Tc2miH268q",
  "data/tweet-nytimes/2021/10/1451126147975102466.json": "Buying a $1,000 iPhone can be equivalent to giving up $17,000 in retirement savings or 2,500 cups of coffee. Yet one in five people surveyed by WalletHub thought a new phone was worth going into debt for. https://t.co/YnM3J84NlA",
  "data/tweet-nytimes/2021/10/1451493560990244864.json": "During the Mozambican Civil War from 1977 to 1992, humans killed so many elephants for their lucrative ivory that the animals seem to have evolved in the space of a generation. The result was that a large number are now naturally tuskless. https://t.co/RpMq8WN9tN https://t.co/uOK8pyowhp",
  "data/tweet-nytimes/2021/10/1451458361074110477.json": "OnlyFans has a surprising new member: the Vienna Tourist Board.\n\nThe account will display artworks that other social platforms have censored. https://t.co/XNa1Ul0NX7",
  "data/tweet-nytimes/2021/10/1451503653647421461.json": "Alec Baldwin discharged a prop firearm on the set of \"Rust,\" a Western he was making in New Mexico, killing the film’s director of photography and wounding the movie’s director, the authorities said. https://t.co/iFRCvt6mUp",
  "data/tweet-nytimes/2021/10/1451544206338629637.json": "Breaking News: Pfizer said its vaccine was 90.7% effective in preventing symptomatic Covid in children ages 5 to 11, citing clinical trial data. The FDA is expected to release its own analysis of the data later on Friday.\nhttps://t.co/PwdbazWJSb",
  "data/tweet-nytimes/2021/10/1451571599094714374.json": "Friends described Halyna Hutchins, who was killed when Alec Baldwin discharged a firearm being used as a prop, as someone whose talents had propelled her from Ukraine to success in Hollywood but who never forgot her home country. https://t.co/mCcgQO1yDf",
  "data/tweet-nytimes/2021/10/1451498574156533790.json": "Within hours of Donald Trump announcing his new social media network, hackers gained access to a private version of the platform. The Anonymous-affiliated group posted images of defecating pigs, wrote expletive-laced rants and created fake accounts.\nhttps://t.co/mXF84BXzNe",
  "data/tweet-nytimes/2021/10/1451307351491895297.json": "Censored on Facebook and Instagram, the Vienna Tourist Board is taking its images of nude fine art to a new platform: OnlyFans. https://t.co/6sLT0viSRz",
  "data/tweet-nytimes/2021/10/1451585406147960836.json": "Alec Baldwin on Friday spoke publicly for the first time about the fatal shooting on the set of the film \"Rust,\" where officials said he had fired a gun used as a prop.\n\n\"There are no words to convey my shock and sadness,\" he said on Twitter.\nhttps://t.co/KfGC0v3IwQ",
  "data/tweet-nytimes/2021/10/1451589645494595586.json": "The police are still investigating the shooting on the set of the movie \"Rust\" that killed the film’s cinematographer and wounded the director. Alec Baldwin, one of the starring actors and a producer of the film, fired a weapon used as a prop. https://t.co/1PP8qym48s https://t.co/E7b5u0AlH4",
  "data/tweet-nytimes/2021/10/1451654616794402816.json": "Barbados has elected its first head of state, replacing Queen Elizabeth II with Sandra Mason, a female former jurist who was born on the island. The move represents the nation’s most decisive break yet with its colonial past. https://t.co/di3CWMtebf",
  "data/tweet-nytimes/2021/10/1451677803909419009.json": "Breaking News: Internal Facebook documents show that employees repeatedly warned of misinformation about the 2020 election. Executives have placed blame elsewhere. https://t.co/xzE7WOvTlB https://t.co/Ft1dN1XZsI",
  "data/tweet-nytimes/2021/10/1451672231940087813.json": "Halyna Hutchins, who was killed when Alec Baldwin discharged a gun being used as a prop, was described as a skilled cinematographer with an artistic vision. \"She could have been among the top Hollywood stars on camera, not behind it.\" https://t.co/OZF0QHjhRc https://t.co/PxXlQkDe6t",
  "data/tweet-nytimes/2021/10/1451697414721654790.json": "Breaking News: Alec Baldwin was told that a gun was safe before he fired it on the set of the film “Rust,” fatally striking the cinematographer, an affidavit said. https://t.co/taaGgonSC1",
  "data/tweet-nytimes/2021/10/1451725072595628032.json": "Pfizer reported data showing that its coronavirus vaccine had a 90.7% efficacy rate in preventing symptomatic Covid-19 in a clinical trial of 5- to 11-year-olds, a finding that may lead to the first authorization of a vaccine to protect young children. https://t.co/NefaRavi00",
  "data/tweet-nytimes/2021/10/1451745470477488131.json": "Breaking News: FDA regulators said the Pfizer vaccine’s benefits outweigh its risks for 5- to 11-year-olds. Emergency authorization could come as early as next week. https://t.co/wr2iNjE7Em",
  "data/tweet-nytimes/2021/10/1451693858178351105.json": "Facebook employees repeatedly flagged misinformation and inflammatory content about the U.S. election, though leadership has publicly placed the blame elsewhere. Documents obtained by The New York Times give new insight into what went on behind the scenes. https://t.co/KYc3c8M1yv",
  "data/tweet-nytimes/2021/10/1451760341755564036.json": "Klay Thompson commutes to work in a 37-foot fishing boat. “You can’t have a bad day when you’re on the boat,” he said. “It’s been so good for my mental health.” https://t.co/WwIa6JlxYm https://t.co/JIvMTHoi7U",
  "data/tweet-nytimes/2021/10/1451855929461383171.json": "Nadia Chaudhri was a neuroscientist with terminal ovarian cancer who used her final months to raise money for graduate students of diverse backgrounds and to educate the public about her disease. She has died at age 43. https://t.co/v0LXD9Jjzs",
  "data/tweet-nytimes/2021/10/1451876068177190913.json": "\"It was the first time the Atlantic Ocean was crossed.\" Scientists say they have pinned down a precise year that Norse explorers from Europe were on land that came to be Newfoundland — the year A.D. 1021, or exactly 1,000 years ago. https://t.co/o6mzjekhNL",
  "data/tweet-nytimes/2021/10/1451624500685152261.json": "Despite mounting pressure, the chief executives of Moderna and Pfizer have declined to license their mRNA technology to developing countries, arguing that it's simply not feasible for those countries to manufacture their own Covid vaccines. In fact, it is. https://t.co/yA894v5ZOL",
  "data/tweet-nytimes/2021/10/1451897464487825413.json": "Col. Wang Yaping is set to make history as the first Chinese woman to walk in space. But in the eyes of officials and the media, her accomplishments seem to have taken a back seat to questions about makeup, menstrual cycles and child care. https://t.co/bgfTfJuKY5 https://t.co/nmZjhdrOpu",
  "data/tweet-nytimes/2021/10/1451620638540673032.json": "Halyna Hutchins, who was killed when Alec Baldwin discharged a gun being used as a prop, was described as a skilled cinematographer with an artistic vision. \"She could have been among the top Hollywood stars on camera, not behind it.\" https://t.co/MFbFeppkCN",
  "data/tweet-nytimes/2021/10/1451860964299653120.json": "A 900-year-old sword that a scuba diver found off the Carmel coast of Israel weighs four pounds, measures about four feet long and originated from the Third Crusade, experts said. https://t.co/YfbxMRXb9p",
  "data/tweet-nytimes/2021/10/1451488575447515142.json": "More than 1,800 sexual assaults occurred during Lyft rides in 2019, the company said in its first-ever safety report. https://t.co/La7x5uBn1Y",
  "data/tweet-nytimes/2021/10/1451952822765985792.json": "In Opinion\n\n\"When Queen Elizabeth dies, it’s doubtful that Prince Charles or Prince William, the next two in line to sit on the British throne, will ever fill her royal slippers. She may be the world’s last global monarch,\" Serge Schmemann writes. https://t.co/P0VbKcmq8C",
  "data/tweet-nytimes/2021/10/1451907520675598343.json": "This traditional Moroccan cake is made with ingredients that you likely have on hand, and it doesn’t require a mixer. https://t.co/pgkxABXUOL",
  "data/tweet-nytimes/2021/10/1451930188380614666.json": "The U.S. has suffered through five waves of the pandemic — and now the Delta surge is subsiding.\n\nExperts say what comes next is hard to predict. But looking back at previous outbreaks can provide clues about the future of the pandemic in the U.S. https://t.co/SytgLCVwsc",
  "data/tweet-nytimes/2021/10/1451987108692910082.json": "Breaking News: There were at least 2 accidental gun discharges on the set of the Alec Baldwin film before a woman was fatally shot, ex-crew members said. https://t.co/qVSlW3fOfr",
  "data/tweet-nytimes/2021/10/1451866002610921477.json": "When done well, this age-old combination of tomato soup with grilled cheese can be exactly what you want. https://t.co/JeqKNhMLiC",
  "data/tweet-nytimes/2021/10/1451999393557663747.json": "Over four days in Montana, members of the Blackfeet Nation honored Chief Earl Old Person, who led the tribe and preserved its history for more than 60 years before dying at age 92. https://t.co/FFD2Zh6wDH https://t.co/qc7YMytgwl",
  "data/tweet-nytimes/2021/10/1452038819012825092.json": "Breaking News: Vanessa Bryant describes in a newly public deposition how she learned her husband, Kobe Bryant, and daughter died. She is suing Los Angeles County.\nhttps://t.co/eqlf6neyTc",
  "data/tweet-nytimes/2021/10/1451998137632100353.json": "Donald Kirk Hartle, a Republican, had claimed that someone voted in the 2020 election by using the mail-in ballot of his wife, who died in 2017. He now faces two counts of voter fraud. https://t.co/pKZ26jMP7O",
  "data/tweet-nytimes/2021/10/1452208506073927682.json": "In Opinion\n\n\"When Queen Elizabeth dies, it’s doubtful that Prince Charles or Prince William, the next two in line to sit on the British throne, will ever fill her royal slippers. She may be the world’s last global monarch,\" Serge Schmemann writes. https://t.co/kb9MBbXaZu",
  "data/tweet-nytimes/2021/10/1452233425541271562.json": "\"It was the first time the Atlantic Ocean was crossed.\" Scientists say they have pinned down a precise year that Norse explorers from Europe were on land that came to be Newfoundland — the year A.D. 1021, or exactly 1,000 years ago. https://t.co/vSfbQTPKhY",
  "data/tweet-nytimes/2021/10/1452142830177107971.json": "Pancake batter can be made from scratch in about the same time it takes to make toast. Here’s how. https://t.co/zwzGla2ZzT",
  "data/tweet-nytimes/2021/10/1452238468105519115.json": "When done well, this age-old combination of tomato soup with grilled cheese can be exactly what you want. https://t.co/mHcsba2vb3",
  "data/tweet-nytimes/2021/10/1452283756828635143.json": "Cambodia is pressing the Metropolitan Museum of Art to document how it acquired dozens of Khmer Empire antiquities that Cambodian officials, citing new evidence, believe were looted during the country’s decades of war and tumult. https://t.co/SohRgS8Mfj",
  "data/tweet-nytimes/2021/10/1452112624053891073.json": "For the unorthodox and provocative score to \"Dune,\" Hans Zimmer worked with a far-flung \"band\" of collaborators who sung, scraped metal, invented instruments and more. https://t.co/k3M1Ls91E1",
  "data/tweet-nytimes/2021/10/1452248529511010309.json": "Klay Thompson commutes to work in a 37-foot fishing boat. “You can’t have a bad day when you’re on the boat,” he said. “It’s been so good for my mental health.” https://t.co/8FFI8QhgcT",
  "data/tweet-nytimes/2021/10/1452093768774135808.json": "Breaking News: Colombian military forces captured Dairo Antonio Úsuga, a major drug cartel leader who is considered the most wanted man in the country, President Iván Duque said.\nhttps://t.co/LKYPyQuegs",
  "data/tweet-nytimes/2021/10/1452322502533861386.json": "Using a combination of digital sleuthing and a 19th-century law written to curb the Ku Klux Klan, the lawyers for the nine plaintiffs in the Charlottesville case are hoping their civil suit will both punish the organizers and deter others. https://t.co/RznrlKygwg",
  "data/tweet-nytimes/2021/10/1452218316681007104.json": "This traditional Moroccan cake is made with ingredients that you likely have on hand, and it doesn’t require a mixer. https://t.co/tdYFZnsTbF",
  "data/tweet-nytimes/2021/10/1452339128931082253.json": "Children ages 5 to 11 may be eligible for Covid vaccines by early next month, according to Dr. Anthony Fauci. He projected a timetable for young Americans to have at least one dose by Thanksgiving, and to be fully immunized by the holidays. https://t.co/ID6oVfUlhc",
  "data/tweet-nytimes/2021/10/1452162957748707333.json": "\"Insecure\" was only the second comedy created by and starring a Black woman when it debuted in 2016. Now in its final season, the show depicts its characters as authentically flawed. We spoke to creator and star Issa Rae about portraying vulnerability. https://t.co/Dkql9oGJK8",
  "data/tweet-nytimes/2021/10/1452305154221481985.json": "India and Pakistan are halfway through their face off in the cricket World Cup. It's one of the biggest sporting rivalries, watched by hundreds of millions of people around the world. Here's why. https://t.co/lRjq32AV3d",
  "data/tweet-nytimes/2021/10/1452253556422107146.json": "Pancake batter can be made from scratch in about the same time it takes to make toast. Here’s how. https://t.co/UoiBP3LByq",
  "data/tweet-nytimes/2021/10/1452372764330012682.json": "The singer Ed Sheeran announced Sunday that he had tested positive for the coronavirus and would be canceling public appearances. https://t.co/iE5jBQ8IFX",
  "data/tweet-nytimes/2021/10/1452296337593090051.json": "As vaccine mandates took effect in New York, the mass resignations some experts had predicted did not occur. But for 4% of NYC public school employees — part of a sizable contingent across the U.S. — resistance to the vaccines has won out over paychecks. https://t.co/b8W6k2NN58 https://t.co/GM5FxyvEk4",
  "data/tweet-nytimes/2021/10/1452298850371346432.json": "One of the toughest places to be a woman in Japan is within its royal family.\n\nEarlier this month, the imperial household revealed that Princess Mako, 30, had suffered from PTSD because of unrelenting public disapproval of her fiancé. https://t.co/liswGjGXpH",
  "data/tweet-nytimes/2021/10/1452449206346686467.json": "Breaking News: James Michael Tyler, known for his role as Gunther on the hit TV show “Friends,” has died of prostate cancer. He was 59. https://t.co/KkSVv0VJvJ",
  "data/tweet-nytimes/2021/10/1452384433521274884.json": "Children ages 5 to 11 may be eligible for Covid vaccines by early next month, according to Dr. Anthony Fauci. He projected a timetable for young Americans to have at least one dose by Thanksgiving, and to be fully immunized by the holidays. https://t.co/0ZosnbADYj",
  "data/tweet-nytimes/2021/10/1452374362376523792.json": "Left for dead in the 1980s, vinyl records are now the music industry’s most popular and highest-grossing physical format. But there are worrying signs that the vinyl bonanza has exceeded the industrial capacity needed to sustain it. https://t.co/WcGJnRsVzi",
  "data/tweet-nytimes/2021/10/1452376883270758402.json": "California bore the brunt on Sunday of a \"bomb cyclone\" and an \"atmospheric river,\" a convergence of storms that brought more than half a foot of rain to parts of the Bay Area, along with high winds and concerns about flash floods. https://t.co/QwLdda3ZKc",
  "data/tweet-nytimes/2021/10/1452478177545277440.json": "Alec Baldwin was rehearsing a scene in which he draws a gun and points it at the camera when he accidentally shot and killed a cinematographer, according to an affidavit. The director of \"Rust\" gave the most detailed account yet of the incident. https://t.co/21JZduflJF",
  "data/tweet-nytimes/2021/10/1452560609543954435.json": "James Michael Tyler, known for his role as Gunther on “Friends,” has died of prostate cancer. He was 59. \n\nA real barista who was cast as a Central Perk co-worker of his crush, Jennifer Aniston’s character, he appeared in 150 \"Friends\" episodes. https://t.co/HDYsh2GFWn",
  "data/tweet-nytimes/2021/10/1452528289327853573.json": "Breaking News: Military forces detained Sudan’s prime minister in an apparent coup that endangered the country’s fragile transition to democracy. https://t.co/1qGbPFj8t2",
  "data/tweet-nytimes/2021/10/1452602110797926407.json": "Children ages 5 to 11 could begin getting Covid vaccines in early November, Dr. Anthony Fauci said. These younger children could be fully immunized by the holidays, if an FDA panel approves Pfizer’s application on Tuesday.\nhttps://t.co/YW8AfW0ZQ5",
  "data/tweet-nytimes/2021/10/1452632683801194500.json": "Breaking News: Moderna’s Covid vaccine is safe and produces a powerful immune response in children aged 6 through 11, the company said.\n\nThe results come one day before an FDA panel is set to review data for Pfizer’s vaccine in children 5 through 11.\nhttps://t.co/VPeip7qfqI",
  "data/tweet-nytimes/2021/10/1452658729393000449.json": "The U.S. is one of six nations in the world without any form of national paid leave. The Democrats are proposing four weeks, but even that is low. Of the 185 countries that offer paid leave for new mothers, only one, Eswatini, offers fewer than four weeks. https://t.co/kkzG92E9qA",
  "data/tweet-nytimes/2021/10/1452595842955808774.json": "Pro-democracy protesters flooded into the streets of Khartoum, Sudan’s capital, on Monday, as the military detained the prime minister and other civilian officials in an apparent coup.\n\n“The people are stronger,” the crowds chanted.\nhttps://t.co/aEN84SKc5z https://t.co/PkMySBfMop",
  "data/tweet-nytimes/2021/10/1452714097817051152.json": "The U.S. is an outlier in its low levels of financial support for young children’s care. Rich countries contribute an average of $14,000 per year for a toddler’s care, compared with $500 in the U.S. https://t.co/IDDWK4Po2s https://t.co/eGlp1A5O10",
  "data/tweet-nytimes/2021/10/1452629881800507398.json": "Exclusive: The gravest problem with the way Amazon treats employees may be one you’ve never heard of. As the company hit record profits, it fired and underpaid employees who sought leaves for medical issues, new parenthood and life crises.\nhttps://t.co/inWMAdmmNo",
  "data/tweet-nytimes/2021/10/1452723665578176515.json": "The U.S. is an outlier in its low levels of financial support for young children’s care. Rich countries contribute an average of $14,000 per year for a toddler’s care, compared with $500 in the U.S. https://t.co/XjppMxjKpU https://t.co/zGxzeu3OE6",
  "data/tweet-nytimes/2021/10/1452771992193675270.json": "During testimony before the British Parliament, Frances Haugen, a former Facebook product manager, said that the tech company was aware of its harmful effects on society but was unwilling to act.\nhttps://t.co/oTxiFDNcaR https://t.co/PNxujgba6C",
  "data/tweet-nytimes/2021/10/1452737989910618113.json": "For the first time, researchers have found a nonhuman animal that seems to have a sense of the beat. https://t.co/7Dfl8VOrQJ https://t.co/50w6RedSuY",
  "data/tweet-nytimes/2021/10/1452700249408131074.json": "Thanksgiving 2021 is shaping up to be the most expensive meal in the history of the holiday. Nearly every ingredient, from the turkey to the after-dinner coffee, is expected to cost more than ever. https://t.co/JIVaUiucuC",
  "data/tweet-nytimes/2021/10/1452628563228770317.json": "Facebook employees repeatedly flagged misinformation and inflammatory content about the U.S. election, though leadership has publicly placed the blame elsewhere. Documents obtained by The New York Times give new insight into what went on behind the scenes. https://t.co/a8dIcyCnA3",
  "data/tweet-nytimes/2021/10/1452819786401042438.json": "The U.S. is one of six nations in the world without any form of national paid leave. The Democrats are proposing four weeks, but even that is low. Of the 185 countries that offer paid leave for new mothers, only one, Eswatini, offers fewer than four weeks. https://t.co/CzjS74JlUd",
  "data/tweet-nytimes/2021/10/1452848726012317699.json": "Princess Mako of Japan is married, after a simple trip to a registry office in Tokyo. The path to this moment has been torturous. https://t.co/Uc5JEnTL4j",
  "data/tweet-nytimes/2021/10/1452877694161539080.json": "In the predawn light, Lorene de Guzman paddles out to sea in the Philippines to hand-feed the giants living in the water. One of the behemoths swims up.\n\n\"Where have you been?\" de Guzman asks the whale shark. \"You must have traveled to a far-off place.\"\nhttps://t.co/zAmXcOvVsn https://t.co/LWmorqRqEB",
  "data/tweet-nytimes/2021/10/1452896550842245122.json": "There was no televised wedding or a balcony kiss, but the romance was there. \n\nWith just a trip to a Tokyo registry office, handled by royal representatives, Princess Mako of Japan was married to Kei Komuro. But the path to this moment has been torturous. https://t.co/sQde7jliPE https://t.co/KB3YoA1Yyy",
  "data/tweet-nytimes/2021/10/1452978349899456519.json": "There was no televised wedding or a balcony kiss, but the romance was there. \n\nWith just a trip to a Tokyo registry office, handled by royal representatives, Princess Mako of Japan was married to Kei Komuro. But the path to this moment has been torturous. https://t.co/wr2I8j7cXd https://t.co/xRk86EWWQo",
  "data/tweet-nytimes/2021/10/1452961983083450384.json": "More than 96% of Tyson employees are vaccinated against the coronavirus, nearly three months after the company mandated shots for its 120,000 U.S. workers, the firm’s chief executive said.\nhttps://t.co/pT4t28AQ8v",
  "data/tweet-nytimes/2021/10/1452584245231296515.json": "Frances Haugen, the Facebook whistle-blower who shared internal company documents, is set to testify before British lawmakers on Monday.\n\nHer testimony in London starts a tour across Europe, home to some of the world’s most aggressive tech regulation.\nhttps://t.co/JfLi00v6jq",
  "data/tweet-nytimes/2021/10/1453043180098793479.json": "Deborah Birx, who helped run the coronavirus response for Donald Trump, said that he did not do everything he should have to counter the pandemic. \"I was very clear to the president in specifics of what I needed him to do,\" Birx said. https://t.co/f1ZhZo5F4a",
  "data/tweet-nytimes/2021/10/1453075232659476491.json": "The U.S. is one of six nations in the world without any form of national paid leave. The Democrats are proposing four weeks, but even that is low. Of the 185 countries that offer paid leave for new mothers, only one, Eswatini, offers fewer than four weeks.https://t.co/6gJOQRHJgH https://t.co/tXUBgmdo2O",
  "data/tweet-nytimes/2021/10/1452802224346779655.json": "In Opinion\n\n\"Gasoline-powered leaf blowers are invaders, the most maddening of all the maddening, environment-destroying tools of the American lawn-care industry,\" Margaret Renkl writes. https://t.co/Esbt7uEQoz",
  "data/tweet-nytimes/2021/10/1453095373111713799.json": "Breaking News: A key FDA advisory panel recommended the use of the Pfizer coronavirus vaccine in 5- to 11-year-olds, who could start getting shots late next week. https://t.co/tUa7p3KzSp https://t.co/AmO0ymq7Ok",
  "data/tweet-nytimes/2021/10/1453097363690643464.json": "When she was 15, Claudette Colvin refused to give up her bus seat to a white woman in Montgomery, Alabama, in March 1955, nine months before Rosa Parks. Now 82, she has filed a petition to have her juvenile arrest record expunged. https://t.co/Mr6uJUpp5h",
  "data/tweet-nytimes/2021/10/1453013635173961739.json": "\"This is an incredible result,\" said Tyson's chief executive. Tyson was one of the first major companies to mandate vaccines for workers. https://t.co/dPjJ0SJIhy https://t.co/gw6IKTPxAL",
  "data/tweet-nytimes/2021/10/1453149467281088519.json": "When she was 15, Claudette Colvin refused to give up her bus seat to a white woman in Montgomery, Alabama, in March 1955, nine months before Rosa Parks. Now 82, she has filed a petition to have her juvenile arrest record expunged. https://t.co/b7O0MVNOYQ https://t.co/wzO70AHcjw",
  "data/tweet-nytimes/2021/10/1453194812530778112.json": "Not long after Japan's Princess Mako and Kei Komuro, a commoner, announced their engagement, tabloids and the public began to question her choice. Years of attacks left her with PTSD, and to be with Komuro, the princess has renounced her royal heritage. https://t.co/SDDI6ymKRZ https://t.co/y0ibR2vFTL",
  "data/tweet-nytimes/2021/10/1453292917737627648.json": "After 40 years, Abba is back with a new album and a stage show featuring digital versions of themselves from 1979.\n\nThe Swedish pop group is also risking perhaps its most valuable asset — its legacy. ​“You just take a chance,” Bjorn Ulvaeus said.\nhttps://t.co/eVDSTxDVLS https://t.co/71EXc4tsSa",
  "data/tweet-nytimes/2021/10/1453323102599983111.json": "Merck has granted a royalty-free license for its Covid antiviral pill to a UN-backed nonprofit. The deal will allow the drug to be manufactured and sold cheaply in 105 developing nations. https://t.co/R0Qr8Kr87F",
  "data/tweet-nytimes/2021/10/1453329420509454338.json": "Democrats plan to tax the richest of the rich — about 700 people in the U.S. — hoping to raise hundreds of billions of dollars to help pay for social safety net and climate change policies.\nhttps://t.co/8m7Pp5kMAV",
  "data/tweet-nytimes/2021/10/1453355842506481668.json": "In Opinion\n\n\"Gasoline-powered leaf blowers are invaders, the most maddening of all the maddening, environment-destroying tools of the American lawn-care industry,\" Margaret Renkl writes. https://t.co/iAykfS21Bn https://t.co/lti537Asya",
  "data/tweet-nytimes/2021/10/1453383152513298440.json": "Breaking News: Senate Democrats’ plan to tax billionaires to fund their domestic agenda hit a major snag when Senator Joe Manchin denounced it as divisive. https://t.co/L37ugHa6fK",
  "data/tweet-nytimes/2021/10/1453354559733129217.json": "Not long after Japan's Princess Mako and Kei Komuro, a commoner, announced their engagement, tabloids and the public began to question her choice. Years of attacks left her with PTSD, and to be with Komuro, the princess has renounced her royal heritage. https://t.co/yV7GUZzeGN https://t.co/GbGkhQzL4b",
  "data/tweet-nytimes/2021/10/1453427561967542274.json": "The U.S. has issued its first U.S. passport with an “X” gender marker, acknowledging the rights of people who do not identify as male or female, the State Department said on Wednesday. https://t.co/3hQg2DlOaS",
  "data/tweet-nytimes/2021/10/1453421283325222919.json": "Someone put an image of B.J. Novak into the public domain, and now his face can be found on:\n— Calvin Klein’s Encounter cologne in Sweden\n— Certain brands of face paint in Uruguay\n— Electric razors in China\nhttps://t.co/8UhhCLaLTw https://t.co/Xw1MhK0ENB",
  "data/tweet-nytimes/2021/10/1453398627838271500.json": "For the first time, oil executives will be pressed to answer, under oath, whether their companies misled the public about the reality of climate change. The heads of Exxon Mobil, Shell, Chevron and BP will testify at Congress on Thursday. https://t.co/06rQY4Ov3z",
  "data/tweet-nytimes/2021/10/1453445161854423043.json": "Merck has granted a royalty-free license for its Covid antiviral pill to a UN-backed nonprofit. The deal will allow the drug to be manufactured and sold cheaply in 105 developing nations. https://t.co/rAsA22a9wS",
  "data/tweet-nytimes/2021/10/1453569736957173763.json": "A large clinical trial has found that a common and inexpensive antidepressant lowered the odds that high-risk Covid-19 patients would be hospitalized. The results could open the door to new guidelines for the drug’s use both in the U.S. and globally. https://t.co/Hfvd6yW0mz",
  "data/tweet-nytimes/2021/10/1453544562471882753.json": "Steven Donziger, the environmental and human rights lawyer who won a $9.5 billion settlement against Chevron, surrendered himself to authorities to begin a six-month prison sentence. Donziger was found guilty of six counts of criminal contempt of court. https://t.co/wcdImDU1YK",
  "data/tweet-nytimes/2021/10/1453792449449635845.json": "Breaking News: Facebook will change its corporate name to Meta, with Facebook, Instagram and WhatsApp remaining under the Meta umbrella. With his company under fire for a host of issues, Mark Zuckerberg said the change was part of a bet on the \"metaverse.\" https://t.co/lFQmkKerMf",
  "data/tweet-nytimes/2021/10/1453758485624197120.json": "As politically active Gen Z workers come to determine the norms and styles of the workplace, some managers are struggling to balance the demands of employees for political engagement with their own sense of what’s appropriate for their brands. https://t.co/BDJIGQlbdw https://t.co/K26bnDLOyK",
  "data/tweet-nytimes/2021/10/1453723290975948809.json": "In Opinion\n\n\"If my country had managed just an average response to the pandemic, over 400,000 Brazilians would still be alive,\" Vanessa Barbara writes in a guest essay. https://t.co/QRfzUzujIL",
  "data/tweet-nytimes/2021/10/1453884314458939403.json": "Citigroup told employees on Thursday that it would require vaccination against Covid-19 as a condition of employment in the U.S., making it the first major bank to issue such a mandate.\nhttps://t.co/THAgPJa5pW",
  "data/tweet-nytimes/2021/10/1453821407532625920.json": "The CDC added mental health illnesses, including depression and schizophrenia, to its list of conditions that make people of any age more likely to become severely ill with Covid. It makes about 85% of the adult U.S. population eligible for booster shots. https://t.co/XN4aNTWdwS",
  "data/tweet-nytimes/2021/10/1453733332483641364.json": "\"I feel very sure that I’m uncool,\" Andy Dunn, the 42-year-old co-founder of Bonobos, said of the way Gen Z has come to determine the norms and styles of the workplace. \"I’ve come to accept that.\" https://t.co/VZiIjzc2yR",
  "data/tweet-nytimes/2021/10/1453662852275916808.json": "Brett Favre, the Hall of Fame quarterback, paid the state of Mississippi back $600,000 that he owed after he improperly received welfare money as part of an extensive fraud scheme, according to the state auditor’s office. https://t.co/GFg2e4JFOf",
  "data/tweet-nytimes/2021/10/1453927171546882049.json": "Breaking News: For the first time in public, a U.S. detainee described his torture at CIA black sites, including forced feedings, waterboarding and sexual abuse. https://t.co/y7PLfIfsLh",
  "data/tweet-nytimes/2021/10/1453798765694005252.json": "Mark Zuckerberg said the change was part of a bet on the \"metaverse,\" a future unification of online, virtual and augmented worlds. Facebook, Instagram and WhatsApp will remain, but under the Meta umbrella. https://t.co/S3N9WwgFH9 https://t.co/iemdGFtdZ0",
  "data/tweet-nytimes/2021/10/1454021455612719105.json": "France began the formal transfer of 26 artifacts to Benin, where colonial troops ransacked a royal palace more than a century ago. It’s the first large-scale act of restitution to Africa by a former European colonial power.\nhttps://t.co/CnRBG2w3hG",
  "data/tweet-nytimes/2021/10/1454028744461541385.json": "Britain, which lifted nearly all Covid restrictions in July, is in the midst of another surge of cases, driven by high levels of infection in school-age children.\n\nHere’s a look at the data.\nhttps://t.co/GBi5jIjhBy",
  "data/tweet-nytimes/2021/10/1454110355957891074.json": "Breaking News: President Biden said Pope Francis told him that he was a “good Catholic” and should keep receiving communion. Some U.S. bishops argue that Catholic politicians who support abortion rights should be denied the sacrament. https://t.co/5RCtGajV8J",
  "data/tweet-nytimes/2021/10/1454152322733445129.json": "Letitia James, the New York attorney general who oversaw the Andrew Cuomo sexual harassment inquiry, is running for governor. https://t.co/7Cc80P2bH0 https://t.co/rCiZd9zpUo",
  "data/tweet-nytimes/2021/10/1454142596100599816.json": "Breaking News: Letitia James, the New York attorney general, declared her bid for governor. She oversaw the sexual harassment inquiry against Andrew Cuomo that ultimately led to his resignation.  https://t.co/rafIfyLCad",
  "data/tweet-nytimes/2021/10/1454167383279644688.json": "Breaking News: The FDA authorized Pfizer-BioNTech's Covid vaccine for children ages 5 to 11. If the CDC signs off, the vaccinations could begin next week. https://t.co/vmmg0SOgsu https://t.co/ptYiJLJfMQ",
  "data/tweet-nytimes/2021/10/1454186288710565893.json": "President Biden and Jill Biden, the first lady, visited the Vatican for Mr. Biden’s private meeting with Pope Francis. During the visit, the president shared gifts and jokes with the pope. https://t.co/hvOnaGFeq8 https://t.co/tTKEQ32ucR",
  "data/tweet-nytimes/2021/10/1454144013586534403.json": "A DNA analysis confirmed that Ernie LaPointe, a South Dakota writer, is the great-grandson of Sitting Bull, a legendary Native American chief. LaPointe said he hoped there was finally proof that would bolster his campaign to relocate the chief’s remains. https://t.co/PNtuBgYbff",
  "data/tweet-nytimes/2021/10/1454274879772139524.json": "The Justice Department on Friday revived an Obama-era office that was created to make legal aid accessible to citizens who cannot afford it, more than three years after it was essentially shuttered under the Trump administration. https://t.co/71OTjfLuju",
  "data/tweet-nytimes/2021/10/1454201405682638849.json": "Donald Trump’s new media venture is backed by a company that may have skirted securities laws, a New York Times investigation shows.\nhttps://t.co/46b12PX9M6",
  "data/tweet-nytimes/2021/10/1454422868197101568.json": "President Biden and other world leaders endorsed a landmark global agreement at the G20 opening on Saturday that seeks to block large corporations from shifting profits and jobs across borders to avoid taxes. https://t.co/L0BumqSI5R",
  "data/tweet-nytimes/2021/10/1454427892826378242.json": "Donald Trump is seeking to block the release of a wide range of documents related to the Jan. 6 attack on the Capitol, the National Archives said Saturday. An early-morning federal court filing details what the former president is fighting to keep secret. https://t.co/GwSv7ZoiZ2",
  "data/tweet-nytimes/2021/10/1454530019284377603.json": "Watch: Protesters flooded the streets in Sudan in defiance of a military coup that derailed the nation’s transition to civilian rule. Three people were fatally shot and more than 100 injured in the demonstrations on Saturday. https://t.co/zyZ5rkUfRr https://t.co/JEXe5ppibw",
  "data/tweet-nytimes/2021/10/1454473190462328840.json": "Donald Trump’s new media venture is backed by a company that may have skirted securities laws, a New York Times investigation shows. https://t.co/gay8oAbzpH",
  "data/tweet-nytimes/2021/10/1454374024847544320.json": "When the female crime writer Carmen Mola won one of Spain's biggest literary awards, three men came to collect the prize. They had been writing under a woman's name for years. https://t.co/yg3MAb46Ys",
  "data/tweet-nytimes/2021/10/1454624189139275777.json": "Donald Trump is seeking to block the release of a wide range of documents related to the Jan. 6 attack on the Capitol, the National Archives said Saturday. An early-morning federal court filing details what the former president is fighting to keep secret. https://t.co/gdmSoxR9KU",
  "data/tweet-nytimes/2021/10/1454567574172221447.json": "The northern lights could be visible in the parts of the United States this weekend. https://t.co/kgbBSeibWm",
  "data/tweet-nytimes/2021/10/1454543646750031877.json": "Day 1 of the G20 summit, in photos 📷 https://t.co/oFCJugSa8D https://t.co/FbAZiIFKEG",
  "data/tweet-nytimes/2021/10/1454760070898765825.json": "President Biden and other world leaders endorsed a landmark global agreement at the G20 opening on Saturday that seeks to block large corporations from shifting profits and jobs across borders to avoid taxes. https://t.co/GjYVDwXcML",
  "data/tweet-nytimes/2021/10/1454794037265944576.json": "President Biden received communion Saturday evening at St. Patrick’s Church in Rome, a day after he announced that Pope Francis had told him during a private meeting at the Vatican that he should continue taking the sacrament.\nhttps://t.co/MOwEOeoE2i",
  "data/tweet-nytimes/2021/10/1454810415809056770.json": "Traffic stops are by far the most common police encounters with civilians. But the risk to officers has been overstated. The police and the courts presume danger. This has contributed to a series of seemingly avoidable killings across the U.S. https://t.co/Trx5lklSSK",
  "data/tweet-nytimes/2021/10/1454801591094108166.json": "Authorities at an airport last year seized a bag of cash that Kermit Warren was carrying to buy a truck. It was his life’s savings but prosecutors contended the money was linked to drugs. https://t.co/dUVnF2RrkC",
  "data/tweet-nytimes/2021/10/1454875843927359495.json": "Arrested for busted taillights.\n\nTased during a stop for missing plates.\n\nJailed over tinted windows.\n\nAcross the U.S., towns rely on traffic ticket revenue for their budgets — and to pay the salaries of the officers responsible for finding violations. https://t.co/jdSJxP5qUQ",
  "data/tweet-nytimes/2021/10/1454281928031485954.json": "Three University of Florida professors have been barred from assisting plaintiffs in a lawsuit to overturn the state’s new law restricting voting rights, lawyers said in a federal court filing on Friday. https://t.co/dnTAIxMhIY",
  "data/tweet-nytimes/2021/10/1454932455165775881.json": "Jen Psaki, the White House press secretary, has tested for positive for the coronavirus. https://t.co/K0szbWHU5O",
  "data/tweet-nytimes/2021/10/1454926173738307591.json": "\"Vaccine\" was already a common-enough word in English. But the jaunty \"vax\" — a word that has skulked around the margins of the language since it first appeared in the 1980s — surged dramatically in 2021.\n\nIt is Oxford Languages' word of the year. https://t.co/VKdl0iKBTl https://t.co/O7d4pY7olm",
  "data/tweet-nytimes/2021/10/1454463119707738115.json": "Conservation geneticists working to preserve endangered California condors have discovered two instances of chicks hatching from unfertilized eggs — the first known cases of so-called virgin births within the species. https://t.co/EofKiY2An2"
}