{
  "data/tweet-wsj/2021/10/1443745149205598211.json": "Disney and Scarlett Johansson have resolved their legal battle over her salary in “Black Widow,” ending a two-month fight between the media giant and one of Hollywood’s biggest stars https://t.co/LBkWmqjcZK",
  "data/tweet-wsj/2021/10/1443738705173401601.json": "An organization representing school boards across the U.S. is asking the federal government for help in response to threats and harassment over Covid-19 protocols in schools https://t.co/r4SEjSHwmD",
  "data/tweet-wsj/2021/10/1443731139047432197.json": "From @WSJopinion: Democrats will lose more seats in 2022 if the huge tax and spending bill passes, writes @KarlRove https://t.co/35P2uAkOYI",
  "data/tweet-wsj/2021/10/1443765137169604610.json": "Democratic Sen. Joe Manchin called for shrinking Democrats’ sweeping education, healthcare and climate package by more than half—to $1.5 trillion https://t.co/bjfHQwMT3h",
  "data/tweet-wsj/2021/10/1443810432435859457.json": "Sen. Blumenthal wanted to see what life was like on Instagram for teens, so his office set up an account that identified as a 13-year-old girl. Within a day, Instagram had served up content that promoted eating disorders and self injury, he said. https://t.co/FtuxHlQO7Z",
  "data/tweet-wsj/2021/10/1443802876309118976.json": "From @WSJopinion: Saule Omarova is the wrong nominee for the wrong industry in the wrong country in the wrong century https://t.co/893JYJIH4D",
  "data/tweet-wsj/2021/10/1443883322585780238.json": "Merck said its experimental pill helped prevent serious illness and death in high-risk people infected with Covid-19, a step toward the virus’s first at-home treatment https://t.co/kxJ6A7wfSr",
  "data/tweet-wsj/2021/10/1443795327652442112.json": "A pregnant woman didn't know the hospital where she was about to give birth was fighting a ransomware attack. Her baby was in distress, and later died. Are the hackers or the hospital to blame? https://t.co/7dEeE3lnr5",
  "data/tweet-wsj/2021/10/1443934996738228236.json": "Merck said its experimental pill helped prevent serious illness and death in high-risk people infected with Covid-19, a step toward the virus’s first at-home treatment https://t.co/C5QbJD5hng",
  "data/tweet-wsj/2021/10/1443901769059344401.json": "U.S. deaths from Covid-19 have leveled off at about 2,000 a day, following a two-month surge of the Delta variant that led to an additional 82,000 Covid deaths https://t.co/m1xJahUv2l",
  "data/tweet-wsj/2021/10/1443905267658264576.json": "Scarlett Johansson and Disney have resolved their legal battle over the online release of “Black Widow” #WSJWhatsNow https://t.co/hZ89fp5dmS",
  "data/tweet-wsj/2021/10/1443958911254634507.json": "Vice President Kamala Harris has sold her Washington, D.C., condo for $1.85 million more than five months after settling into her official residence on the grounds of the U.S. Naval Observatory https://t.co/3PA0LFRZ73",
  "data/tweet-wsj/2021/10/1443840647845326886.json": "A 96-year-old woman charged with Holocaust-related crimes for her role as a secretary in a Nazi concentration camp was detained by police on Thursday after she absconded before her trial https://t.co/PR7YOJAxlA",
  "data/tweet-wsj/2021/10/1443987863754973187.json": "Alex Jones, the radio host and right-wing provocateur, will be financially responsible for damages to parents of two children who were killed at Sandy Hook Elementary School in 2012, a Texas judge ruled this week https://t.co/ZxIbyPOnkt",
  "data/tweet-wsj/2021/10/1443994302317793284.json": "Breaking: All eligible students in California will be required to get vaccinated against Covid-19, Gov. Gavin Newsom said, marking the first such mandate in a U.S. state https://t.co/RAz05IjTSp",
  "data/tweet-wsj/2021/10/1444078448801091584.json": "From @WSJopinion: Pelosi and Schumer’s big mistake was to think they could bully Joe Manchin into submission, writes @KimStrassel https://t.co/MTbWWVErkV",
  "data/tweet-wsj/2021/10/1444123746764218370.json": "A Chinese citizen journalist whose viral videos offered an unfiltered early glimpse of the Covid-19 outbreak as it consumed the city of Wuhan has resurfaced more than 600 days after he went missing https://t.co/cbGX8FjyZB",
  "data/tweet-wsj/2021/10/1443961436821237764.json": "China is struggling with widespread power shortfalls, risking disruption to global supply chains and heightened inflationary pressure around the world https://t.co/QXN4YAvtZC",
  "data/tweet-wsj/2021/10/1444127519049986054.json": "From @WSJopinion: The House tax package would hit privately held companies twice as hard as publicly traded C corporations. The bill is bad for Main Street and bad for the country, writes Brian Reardon. https://t.co/kKWHyQkuPP",
  "data/tweet-wsj/2021/10/1444093542230642689.json": "A lawsuit involving a baby in Alabama, if proven in court, will mark the first alleged death from a ransomware attack. “This was preventable.” https://t.co/pmF5u1M61P",
  "data/tweet-wsj/2021/10/1444018051570143236.json": "A federal judge Friday questioned Texas’s defense of a new abortion law that is the most restrictive in the U.S. and which has significantly limited the procedure in the state https://t.co/L6pwZA83q6",
  "data/tweet-wsj/2021/10/1444169029418110976.json": "From @WSJopinion: When two-thirds of self-identified moderates are scared to express their views in public for fear of losing their jobs, America has ceased to be a free society, writes @tedrall https://t.co/lDWHEw4qSX",
  "data/tweet-wsj/2021/10/1444135101588250627.json": "Vice President Kamala Harris has sold her Washington, D.C., condo for $1.85 million more than five months after settling into her official residence on the grounds of the U.S. Naval Observatory https://t.co/Sw5FpFxC3W",
  "data/tweet-wsj/2021/10/1444112444520124417.json": "An organization representing school boards across the U.S. is asking the federal government for help in response to threats and harassment over Covid-19 protocols in schools https://t.co/U4RzvBQdhF",
  "data/tweet-wsj/2021/10/1444157714641326083.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/oiRCOejdSr https://t.co/BlGEMogxQC",
  "data/tweet-wsj/2021/10/1444248311976837121.json": "Germany’s youngest voters are turning their backs on big, established parties and casting their ballots for two smaller groups that are calling for change: one focused on climate and social justice, the other on freer markets and personal liberties https://t.co/DIiljR793K",
  "data/tweet-wsj/2021/10/1444101088903315456.json": "The humanitarian crisis in Ethiopia’s Tigray region continues to escalate, with only a fraction of needed aid allowed to enter, the United Nations said https://t.co/RstWPtuWmK",
  "data/tweet-wsj/2021/10/1444271022497218560.json": "More than 130 federal judges have violated U.S. law and judicial ethics by overseeing court cases involving companies in which they or their family owned stock, a WSJ investigation found. Many of the cases could now be reopened. https://t.co/uG0i4XYSPm",
  "data/tweet-wsj/2021/10/1444225672889700357.json": "Tim Cook quietly turned Apple into a superpower in the videogame business. Now he’s fighting rivals in a multiplayer universe. https://t.co/B5tlEN4LDA",
  "data/tweet-wsj/2021/10/1444233252458442755.json": "Take a look at the front page of today's Wall Street Journal https://t.co/TECCbVPM06 https://t.co/BbggmPoIhk",
  "data/tweet-wsj/2021/10/1444195447900344320.json": "When you get a work email during off-hours, does it stress you out? Research shows that you may be suffering from “email urgency bias.” https://t.co/UhLojtxf6q",
  "data/tweet-wsj/2021/10/1444240790830657537.json": "Since signing off from the TV airwaves, Conan O’Brien has been as busy as ever, building a podcast empire. Not everyone got the memo: “Everywhere I go, people say, ‘Congratulations on your retirement!’ ”  https://t.co/SVod0GphhJ",
  "data/tweet-wsj/2021/10/1444308747753508870.json": "A surge in toxic customers and poor behavior has prompted many restaurants to rethink the adage that the customer is always right https://t.co/gFsAo5MbuJ",
  "data/tweet-wsj/2021/10/1444316286016757763.json": "\"Squid Game,\" the South Korean survival drama that was for a decade dismissed as grotesque and unrealistic, is now on track to become Netflix’s most-watched show https://t.co/41OKn7bbPW",
  "data/tweet-wsj/2021/10/1444301216670957574.json": "Harvard Business School moved most of its M.B.A. classes online following a spate of breakthrough Covid-19 infections among its students https://t.co/OfL9q4JCkQ",
  "data/tweet-wsj/2021/10/1444323845364666368.json": "A couple's property in Iceland has views of an extinct volcano, the top of the country’s second-largest glacier and something less common: lush, green surroundings. “This place is like walking into a green haven.” https://t.co/YWfLTpTm9V",
  "data/tweet-wsj/2021/10/1444255872222384134.json": "More airlines are telling employees they must be vaccinated under new federal rules for government contractors  https://t.co/FWI8YuSWzo",
  "data/tweet-wsj/2021/10/1444350229537493001.json": "Alex Jones, the radio host and right-wing provocateur, will be financially responsible for damages to parents of two children who were killed at Sandy Hook Elementary School in 2012, a Texas judge ruled this week https://t.co/wwi7jLwsdV",
  "data/tweet-wsj/2021/10/1444342684462813187.json": "Tim Cook quietly turned Apple into a superpower in the videogame business. Now he’s fighting rivals in a multiplayer universe. https://t.co/RFOni6lSia",
  "data/tweet-wsj/2021/10/1444361565415817218.json": "Tesla overcame snarled global-supply chains to deliver a record number of vehicles in the third quarter https://t.co/SlWex6mrzr",
  "data/tweet-wsj/2021/10/1444433267558604808.json": "South Korea’s dystopian drama “Squid Game” might become Netflix’s biggest hit ever. But for a decade, local studios rejected the fictionalized show’s pitch as too grotesque and too unrealistic. https://t.co/frBAhPilnZ",
  "data/tweet-wsj/2021/10/1444448389614219272.json": "A pregnant woman didn't know the hospital where she was about to give birth was fighting a ransomware attack. Her baby was in distress, and later died. Are the hackers or the hospital to blame? https://t.co/HQXwYK9iBb",
  "data/tweet-wsj/2021/10/1444444585170665475.json": "Ford says it will invest $7 billion in a new assembly plant and three EV battery factories, aiming to create 11,000 jobs in the South. It’s the car maker’s largest ever manufacturing investment. #WSJWhatsNow https://t.co/txTbkaZlMD",
  "data/tweet-wsj/2021/10/1444459698133012480.json": "From @WSJopinion: Biden’s nominee for Comptroller of the Currency admires the Soviet economic system and thinks the Fed should “effectively ‘end banking,’ as we know it” https://t.co/9ak7TPamTj",
  "data/tweet-wsj/2021/10/1444331438208323593.json": "The U.S. spent $145 billion over two decades to build a self-sustaining economy in Afghanistan—an economy that is now on the verge of collapse https://t.co/Afx4N56PEe",
  "data/tweet-wsj/2021/10/1444482387216420874.json": "Before she accepted a part in “Flashdance,” Jennifer Beals made sure she could return to Yale after filming. “The dean was understanding. He let me defer a term.” https://t.co/M4YS4QlyEL",
  "data/tweet-wsj/2021/10/1444455940854530051.json": "With the release of the sci-fi epic \"Dune\" and her upcoming role in \"Mission: Impossible 7,\" Rebecca Ferguson is at the top of her game https://t.co/lUYvaMFuCp",
  "data/tweet-wsj/2021/10/1444604177091596293.json": "Tesla overcame snarled global-supply chains to deliver a record number of vehicles in the third quarter https://t.co/QNUxNklQq1",
  "data/tweet-wsj/2021/10/1444542772111974407.json": "Mexico is weighing a bill to change the country’s constitution to boost state control of the electricity industry, a move that would jeopardize billions of dollars of investments by private power generators https://t.co/mmEkq4bsaw",
  "data/tweet-wsj/2021/10/1444640879742840834.json": "Satellite images show the scale of the backlog at ports in California. The ongoing supply chain issues are now threatening holiday shopping plans. #WSJWhatsNow https://t.co/EyYZeaOWVv",
  "data/tweet-wsj/2021/10/1444625808405024769.json": "From @WSJopinion: OSHA’s job is to promote safe workplaces, not to dictate medical decisions to employees, write @DavidRivkin and Robert Alt https://t.co/gdFCgftsaZ",
  "data/tweet-wsj/2021/10/1444387971919228931.json": "Scientists have found a sharp increase in possible Covid-19 spread during in-flight meal service. They’ve also learned more about the importance of precautions during boarding and deplaning. https://t.co/Dsglb98QOD",
  "data/tweet-wsj/2021/10/1444629571362594820.json": "Would-be home buyers are getting hit with a double whammy: soaring home prices and incomes that can’t keep pace. Some are scrimping; others are just giving up.  https://t.co/tU5n5PQVFE",
  "data/tweet-wsj/2021/10/1444659781768294407.json": "From @WSJopinion: Widespread immunity, vaccinated and natural, will bring control and a full return to normal, writes @MonicaGandhi9 https://t.co/AStoXRd5xm",
  "data/tweet-wsj/2021/10/1444406930206863362.json": "Job seekers are considering a new addition to their résumés: Covid-19 vaccination status https://t.co/H3V7Q3y2zB",
  "data/tweet-wsj/2021/10/1444652005490929664.json": "At one hospital, the cost for a severe-respiratory patient was around $55,182 if the person were insured by Aetna—or $94,357 if covered by Anthem's Empire Blue Cross Blue Shield https://t.co/pv6KPEaL3Y",
  "data/tweet-wsj/2021/10/1444671864085925888.json": "Americans looking for their first homes will have to sign up for larger monthly payments, buy less desirable homes or step back from the market altogether, economists said https://t.co/De6XOLOkQC",
  "data/tweet-wsj/2021/10/1444618304774184964.json": "In Alaska, where Covid-19 cases are surging, an Anchorage hospital is rationing care while rural hospitals try to make supplies last until they can transfer patients https://t.co/0VQb9CQTcl",
  "data/tweet-wsj/2021/10/1444680000893038599.json": "“We didn’t sign up for this.” Medical staff at Alaska’s largest hospital are for the first time being forced to decide who should get treatment and who must wait, even if they might not survive. https://t.co/KboQ0gzaor",
  "data/tweet-wsj/2021/10/1444675378191249412.json": "Job seekers are considering a new addition to their résumés: Covid-19 vaccination status https://t.co/LlAcoCVuak",
  "data/tweet-wsj/2021/10/1444711253713244170.json": "Evergrande is the largest property developer in a Chinese real-estate bubble that has been expanding for years. It had more than 700 projects under construction as of the end of last year, covering 132 million square meters of total floor area. https://t.co/cd6BwEh8ef https://t.co/l4ky1meHzB",
  "data/tweet-wsj/2021/10/1444746631182700549.json": "Afghanistan’s capital could be plunged into darkness this winter because the new Taliban rulers haven’t paid Central Asian electricity suppliers or resumed collecting money from consumers https://t.co/yA4IlfNqBh",
  "data/tweet-wsj/2021/10/1444714126941560836.json": "India is preparing to produce its own mRNA-based Covid-19 vaccine by the end of the year, in what would be a scientific breakthrough for the country https://t.co/lvjfVuNB92",
  "data/tweet-wsj/2021/10/1444765463121178624.json": "South Korea’s dystopian drama “Squid Game” might become Netflix’s biggest hit ever. But for a decade, local studios rejected the fictionalized show’s pitch as too grotesque and too unrealistic. https://t.co/9oPKLoSKKF",
  "data/tweet-wsj/2021/10/1444784465092481024.json": "A surge in toxic customers and poor behavior has prompted many restaurants to rethink the adage that the customer is always right https://t.co/CtqHzEAykt",
  "data/tweet-wsj/2021/10/1444788130205339656.json": "Evergrande, the largest property developer in a Chinese real-estate bubble that has been expanding for years, had more than 700 projects under construction as of the end of last year. Its potential default stands to be one of the largest ever. https://t.co/JupnHOIuFN https://t.co/HF5A4CRAE9",
  "data/tweet-wsj/2021/10/1444809031323987970.json": "As a Facebook employee, Frances Haugen tried to find solutions for how its platforms could cause harm. But she didn’t have the resources or power to act—so she turned whistleblower https://t.co/P1OlMFg0Pm",
  "data/tweet-wsj/2021/10/1444822114939330561.json": "Meet the Facebook whistleblower: 37-year-old Frances Haugen, who was hired to help stop election misinformation and grew frustrated by the company's approach to fixing its flaws https://t.co/xv26167KMv",
  "data/tweet-wsj/2021/10/1444844787748704258.json": "Beijing has deployed 93 military aircraft near Taiwan over three days, its largest incursion in the past year, prompting the U.S. to warn against what it called provocative military activity https://t.co/boSYJZQwQi",
  "data/tweet-wsj/2021/10/1444856072402096129.json": "South Korea’s dystopian drama “Squid Game” might become Netflix’s biggest hit ever. But for a decade, local studios rejected the fictionalized show’s pitch as too grotesque and too unrealistic. https://t.co/gwO9jQPgCQ",
  "data/tweet-wsj/2021/10/1444742825963397122.json": "Swiss police raided Credit Suisse offices, the bank said, as part of an investigation into collapsed finance firm Greensill Capital https://t.co/Nl4gdVCS53",
  "data/tweet-wsj/2021/10/1444871166351613952.json": "“We didn’t sign up for this.” Medical staff at Alaska’s largest hospital are for the first time being forced to decide who should get treatment and who must wait, even if they might not survive. https://t.co/x2yZp0abNe",
  "data/tweet-wsj/2021/10/1444891319298572292.json": "New Japanese Prime Minister Fumio Kishida seeks to stimulate the economy by distributing money to middle- and lower-income earners https://t.co/Lfj3UJWC9d",
  "data/tweet-wsj/2021/10/1444686288075042825.json": "For decades, one of the most effective tools to prevent wildfires was to thin forests by removing dead trees and brush, or by using controlled burns. Forest thinning may no longer be enough to keep up today's rising wildfire risk. https://t.co/7ohfrKmKK0",
  "data/tweet-wsj/2021/10/1444878708351901697.json": "At one hospital, the cost for a severe-respiratory patient was around $55,182 if the person were insured by Aetna—or $94,357 if covered by Anthem's Empire Blue Cross Blue Shield https://t.co/yfif77gNg1",
  "data/tweet-wsj/2021/10/1444897595210534915.json": "U.S. regulators start a three-year countdown that would force many Chinese companies to leave American stock exchanges after a long U.S.-China audit fight https://t.co/6bpmacL4lB",
  "data/tweet-wsj/2021/10/1444848519521648643.json": "Since signing off from the TV airwaves, Conan O’Brien has been as busy as ever, building a podcast empire. Not everyone got the memo: “Everywhere I go, people say, ‘Congratulations on your retirement!’ ”  https://t.co/w0LQiOCdS0",
  "data/tweet-wsj/2021/10/1444886261110554629.json": "Would-be home buyers are getting hit with a double whammy: soaring home prices and incomes that can’t keep pace. Some are scrimping; others are just giving up.  https://t.co/MyaJdXrPLe",
  "data/tweet-wsj/2021/10/1444882506327678983.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/B1GcNmQya4",
  "data/tweet-wsj/2021/10/1444920272545529857.json": "Who is the Facebook whistleblower? Frances Haugen, a former employee hired to work on election misinformation, explains herself https://t.co/f9BUDf7iIS",
  "data/tweet-wsj/2021/10/1444833432446640141.json": "Tim Cook quietly turned Apple into a superpower in the videogame business. Now he’s fighting rivals in a multiplayer universe. https://t.co/HjsmMz9jlS",
  "data/tweet-wsj/2021/10/1444944634476646401.json": "Meet the Facebook whistleblower: 37-year-old Frances Haugen, who was hired to help stop election misinformation and grew frustrated by the company’s approach to fixing its flaws https://t.co/PIgJqAnVJV",
  "data/tweet-wsj/2021/10/1444963513789726720.json": "The Nobel Prize in Physiology or Medicine was awarded to David Julius and Ardem Patapoutian for work on receptors for temperature and touch https://t.co/pZEegndxkB",
  "data/tweet-wsj/2021/10/1444946656781295619.json": "Has work taken over your life? Here’s how to reclaim control https://t.co/Ba0GqCNXhT",
  "data/tweet-wsj/2021/10/1444954220470362112.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/EXnimrSXSP",
  "data/tweet-wsj/2021/10/1444657250241548294.json": "Scientists have found a sharp increase in possible Covid-19 spread during in-flight meal service. They’ve also learned more about the importance of precautions during boarding and deplaning. https://t.co/d0GoXwXyAa",
  "data/tweet-wsj/2021/10/1444995731836735490.json": "As a Facebook employee, Frances Haugen tried to find solutions for how its platforms could cause harm. But she didn’t have the resources or power to act—so she turned whistleblower https://t.co/Jd8ErBJPGd",
  "data/tweet-wsj/2021/10/1445027711269888005.json": "“I miss Steve desperately.” On the 10th anniversary of Steve Jobs’s death, Jony Ive remembers the last day they spent together. https://t.co/XbUjLpc7MH",
  "data/tweet-wsj/2021/10/1444535201007276033.json": "The pandemic is the latest challenge and opportunity for Michael Dell, the personal computing veteran, in a career that began in the 1980s https://t.co/xax1tUKG6s",
  "data/tweet-wsj/2021/10/1445062847709523981.json": "Facebook's entities, WhatsApp, Instagram and Facebook weren’t accessible to users Monday morning https://t.co/N8ihS6uOku",
  "data/tweet-wsj/2021/10/1445056125561294853.json": "Here’s what you need to know about the popular altcoin Cardano’s Ada #WSJWhatsNow https://t.co/IcgDl7dMKf https://t.co/ewLTq6QqBY",
  "data/tweet-wsj/2021/10/1445044824697147393.json": "William Shatner is slated to join the next spaceflight from Amazon founder Jeff Bezos' Blue Origin, the company said https://t.co/YGGQ5sSGvj",
  "data/tweet-wsj/2021/10/1445075059580751886.json": "John McEnroe likes to tap into the artistic side of his brain to de-stress. “I love to play guitar. At least I’m improving at something, whereas in tennis I’m getting worse every year.” https://t.co/lJX14pnNCT",
  "data/tweet-wsj/2021/10/1445071395105513484.json": "Saturday morning, workers from Houston-based Amplify Energy Corp. noticed oil in the water near an oil-processing plant off the coast of Huntington Beach, Calif. Here's what we know about the oil spill. https://t.co/Y6uKmGXl5Q",
  "data/tweet-wsj/2021/10/1445078824773955595.json": "China’s military flew 56 sorties, including a dozen bombers, near Taiwan from the predawn hours into the night Monday, after the U.S. warned against such activity https://t.co/3RsNACHoF9",
  "data/tweet-wsj/2021/10/1445082576146866181.json": "Sen. Elizabeth Warren asked the SEC to investigate whether personal financial investments by senior Federal Reserve officials, including Vice Chairman Richard Clarida, violated insider-trading rules  https://t.co/HPcrrZVlpQ",
  "data/tweet-wsj/2021/10/1445093848812765191.json": "A selloff in Facebook stock and shares of other Big Tech companies pushed major U.S. indexes down Monday https://t.co/lxsRVK66I0 #WSJWhatsNow https://t.co/UTlNyNzl6l",
  "data/tweet-wsj/2021/10/1445064973047246858.json": "After a vicious foul tip to the fact, minor-league umpire Jason Klein set out to create a mask to protect his colleagues from concussion. Now, catchers around the major leagues have caught on. https://t.co/vlauljEpaU",
  "data/tweet-wsj/2021/10/1445105231705124865.json": "Members of an internationally renowned orchestra of Afghan women and girls have been evacuated from Afghanistan after protracted negotiations among the musicians’ supporters in the U.S., the Qatari government and Taliban leaders in Kabul https://t.co/cchAZkYSns",
  "data/tweet-wsj/2021/10/1445101453757067270.json": "Thousands of New York City school staff were barred from returning to work Monday for failing to comply with a vaccination mandate. About 95% of the 150,000 employees at the city’s Department of Education have been vaccinated, the mayor said. https://t.co/aDjhUTlfLj",
  "data/tweet-wsj/2021/10/1445109047208943633.json": "Hulu president Kelly Campbell has resigned from her position and is in negotiations to take a senior role at NBCUniversal, people familiar with the matter said https://t.co/VQTaDVyLQp",
  "data/tweet-wsj/2021/10/1445116573568618509.json": "To understand Evergrande’s rapid decline, consider its unfinished apartments, EV factory and “Fairyland” theme park in provincial Lu’an, China https://t.co/YxYeFJhUOS",
  "data/tweet-wsj/2021/10/1445122834037149699.json": "Justin Timberlake and Jessica Biel are listing a gated Los Angeles estate that spans roughly 10 acres in the Hollywood Hills for $35 million https://t.co/yhWHpA6Y7j",
  "data/tweet-wsj/2021/10/1445112769641127937.json": "From @WSJopinion: Visas for migrants and freer regional trade are the win-win the U.S. needs, writes @MaryAnastasiaOG https://t.co/g1ONTnwGXT",
  "data/tweet-wsj/2021/10/1445132379719454721.json": "A Facebook outage disrupted the app, WhatsApp and Instagram for hours. The company told employees the cause was unknown. https://t.co/JlXAZm7qVv",
  "data/tweet-wsj/2021/10/1445135433726320651.json": "Hollywood production workers authorized their union to strike if necessary, a move that would shut down production of shows and films https://t.co/sYZt5Nb4VH",
  "data/tweet-wsj/2021/10/1445139204669911043.json": "“I miss Steve desperately.” On the 10th anniversary of Steve Jobs’s death, Jony Ive remembers the last day they spent together. https://t.co/PnDEkfJD1O",
  "data/tweet-wsj/2021/10/1445146792140709894.json": "Facebook filed a new motion Monday seeking the dismissal of a government antitrust case alleging the company engaged in unlawful monopolization, four months after it succeeded in getting an earlier version of the complaint thrown out https://t.co/pJwdzkSoTb",
  "data/tweet-wsj/2021/10/1445142980151676936.json": "Sixty miles, 21 deaths: Survivors recount the tragedy that unfolded on the Chinese ultramarathon trail that became one of the deadliest sites in modern sports history. https://t.co/fS2B7k3nYh",
  "data/tweet-wsj/2021/10/1445052371076370448.json": "The Treasury Department will soon begin to claw back federal rental assistance from groups that haven’t distributed or committed enough of the money and reallocate it to communities with greater need, according to new guidance published Monday https://t.co/9iCQNPD38y",
  "data/tweet-wsj/2021/10/1445154331725021189.json": "A new report named dozens of world leaders and hundreds of politicians, public officials, billionaires, religious leaders and celebrities who have used offshore tax havens to conceal their financial activities, and in many cases, avoid paying taxes https://t.co/DTqXNlmhbD",
  "data/tweet-wsj/2021/10/1445150522080735239.json": "Bubba Wallace, the Black Nascar driver who became a face of social change last year, won his first Nascar Cup Series race Monday—a historic victory that came at the same place where a noose was found in his garage stall last year https://t.co/bPVVv51gST",
  "data/tweet-wsj/2021/10/1445090137218637825.json": "A waterfront mansion in the affluent neighborhood of West Bellevue, Washington, has closed for $22.75 million—one of the state’s priciest deals so far this year https://t.co/2D1y78L77r",
  "data/tweet-wsj/2021/10/1445165607427710981.json": "Americans looking for their first homes will have to sign up for larger monthly payments, buy less desirable homes or step back from the market altogether, economists said https://t.co/X8KAaHTktj",
  "data/tweet-wsj/2021/10/1445161825948127233.json": "Southwest Airlines on Monday joined rivals in requiring employees to be vaccinated against Covid-19, citing new rules for companies that do business with the federal government https://t.co/OF8Ie5bUcd",
  "data/tweet-wsj/2021/10/1445180714614411268.json": "New Zealand is ending its effort to keep Covid-19 out of the country as the economic costs mount and after its latest lockdown failed to halt the spread of the virus https://t.co/IPJCjcx57f",
  "data/tweet-wsj/2021/10/1445159317829718019.json": "From @WSJopinion: If we erase sex-specific words from our language, we erase, too, what it means to be a man or a woman. Where does it stop, asks @NicoleReneeAult. https://t.co/WcLQNjW1kD",
  "data/tweet-wsj/2021/10/1445195811739025409.json": "Members of an internationally renowned orchestra of Afghan women and girls have been evacuated from Afghanistan, more than a month after a prior attempt was unsuccessful https://t.co/XRKChaQr7d",
  "data/tweet-wsj/2021/10/1445194043693146114.json": "Tesla subjected a Black former worker to a racially hostile work environment and failed to take reasonable steps to prevent him from being racially harassed, a federal jury has found https://t.co/hUdTqTzU5P",
  "data/tweet-wsj/2021/10/1445188265032785920.json": "Bubba Wallace became the first Black driver to win a Nascar Cup Series race in more than half a century, and just the second-ever to do so, after his victory at Talladega Monday https://t.co/4GXAryBhZJ",
  "data/tweet-wsj/2021/10/1445222246738497537.json": "Did the Facebook, Instagram and WhatsApp outages make you realize just how much you depend on those platforms for personal connections? Columnist @JoannaStern explains what to do next. https://t.co/KTBNenW1Vs",
  "data/tweet-wsj/2021/10/1445233553248301058.json": "Do you need to care less about your job? Here’s how to gain perspective. https://t.co/H7qFOLdxhj",
  "data/tweet-wsj/2021/10/1445226004222464000.json": "Afghanistan’s capital could be plunged into darkness this winter because the new Taliban rulers haven’t paid Central Asian electricity suppliers or resumed collecting money from consumers https://t.co/nAjQIVlfok",
  "data/tweet-wsj/2021/10/1444890060323704832.json": "Tesla overcame snarled global-supply chains to deliver a record number of vehicles in the third quarter https://t.co/uSojD7XB1v",
  "data/tweet-wsj/2021/10/1445248642483474432.json": "\"Squid Game,\" the South Korean survival drama that was for a decade dismissed as grotesque and unrealistic, is on track to become Netflix’s most-watched show https://t.co/i43oG7TxRc",
  "data/tweet-wsj/2021/10/1445192056729657345.json": "Facebook, Instagram and WhatsApp went down, and you realized how dependent you were on them for your personal connections. Columnist @JoannaStern explains what to do next. https://t.co/717oc0H2k9",
  "data/tweet-wsj/2021/10/1445256202863226882.json": "Wealthy individuals around the globe have used offshore tax havens to conceal their financial activities, creating shell companies, foundations and trusts to make purchases, and in many cases, avoid paying taxes, according to an expansive new report https://t.co/ppXsWEHg5R",
  "data/tweet-wsj/2021/10/1445263741960998912.json": "As a Facebook employee, Frances Haugen tried to find solutions for how its platforms could cause harm. But she didn’t have the resources or power to act—so she turned whistleblower https://t.co/r2YmWj15Dv",
  "data/tweet-wsj/2021/10/1445244900421865474.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/neBFkkEo2t",
  "data/tweet-wsj/2021/10/1445278866185068545.json": "“I miss Steve desperately.” On the 10th anniversary of Steve Jobs’s death, Jony Ive remembers the last day they spent together. https://t.co/kaKSQpuVFl",
  "data/tweet-wsj/2021/10/1445267542554124292.json": "Fantasia Holdings, a developer of luxury apartments in China, said it didn’t make a U.S. dollar bond payment that was due Oct. 4 https://t.co/hBG3oJT1Sr",
  "data/tweet-wsj/2021/10/1445241107214897152.json": "Global markets dropped, tracking a technology-driven selloff in U.S. shares https://t.co/LxCYVg8CsV",
  "data/tweet-wsj/2021/10/1445169394137579526.json": "Runny nose? Fever? Fatigue? Here’s what doctors want you to know about how to tell the difference between illnesses as we head into flu season https://t.co/p0aGDcTcat",
  "data/tweet-wsj/2021/10/1445312840651481088.json": "Catholic priests, church employees and volunteers in France sexually abused approximately 330,000 minors since 1950, according to an investigation https://t.co/HI0lCf75v3",
  "data/tweet-wsj/2021/10/1445331334294085637.json": "The Nobel Prize in Physics was awarded to a trio of scientists for the study of complex systems, including climate-change modeling https://t.co/L3LeaJ3dor",
  "data/tweet-wsj/2021/10/1445358606203895808.json": "A Russian actress and director were launched to the International Space Station to spend 12 days making the world’s first movie shot in orbit, getting in ahead of Tom Cruise and NASA #WSJWhatsNow https://t.co/4VTBzXMfMf",
  "data/tweet-wsj/2021/10/1445361923583889418.json": "Your T-shirts might be getting more expensive. Cotton prices are the highest they’ve been in a decade. https://t.co/tm9UCZIUva",
  "data/tweet-wsj/2021/10/1445335496138313733.json": "AstraZeneca asked U.S. regulators for emergency-use authorization for an antibody drug that earlier this year showed strong efficacy in preventing symptomatic Covid-19, offering a potential alternative in evading the disease https://t.co/Y4WhFIap9a",
  "data/tweet-wsj/2021/10/1445392109960318983.json": "Johnson &amp; Johnson has asked U.S. health regulators to authorize a booster dose for its Covid-19 vaccine, citing studies showing it improved protection among adults who previously received a single shot https://t.co/pumRSfxREc",
  "data/tweet-wsj/2021/10/1445388492574498818.json": "As a Facebook employee, Frances Haugen tried to find solutions for how its platforms could cause harm. But she didn’t have the resources or power to act—so she turned whistleblower. https://t.co/nSvTfPQAFV",
  "data/tweet-wsj/2021/10/1445386141490892816.json": "From @WSJopinion: Is Kyrsten Sinema the Democrats’ John McCain? It turns out the word maverick applies only to Republicans opposing a Republican agenda, writes @wjmcgurn https://t.co/xBE6TnyD0T",
  "data/tweet-wsj/2021/10/1445343054399954948.json": "Nikki Haley calls Donald Trump a friend, but disagrees with him on the 2020 results. “There was fraud in the election, but I don’t think that the numbers were so big that it swayed the vote in the wrong direction.” https://t.co/5fGpRCiWcc",
  "data/tweet-wsj/2021/10/1445395943222808586.json": "Wyndham, Marriott and Hyatt Hotels are latching on to all-inclusive resorts, betting that the pandemic will boost a business model that encourages guests to stay in one place https://t.co/FKtzUIEJ9b",
  "data/tweet-wsj/2021/10/1445403499211202569.json": "The romance between Elizabeth Holmes and her top deputy spanned more than a decade, growing and fading alongside the rise and fall of Theranos. Now, the relationship and the pair’s intimate text messages are an important part of her criminal-fraud trial. https://t.co/IsTpcVLpMD",
  "data/tweet-wsj/2021/10/1445426581753696260.json": "In her Senate testimony, Facebook whistleblower France Haugen detailed the documents she gathered showing a range of negative impacts from the company’s products—revelations that senators said would build momentum for tougher regulations on Big Tech https://t.co/MjYxbcAzpa",
  "data/tweet-wsj/2021/10/1445460060369350657.json": "In Senate testimony, Facebook whistleblower Frances Haugen detailed documents she gathered showing a range of negative impacts from the company’s products—revelations senators said would build momentum for tougher regulations on Big Tech (corrects typo) https://t.co/CGJUAa6Rca",
  "data/tweet-wsj/2021/10/1445470554555772933.json": "The Justice Department is reviewing its decision not to prosecute the FBI agents who disregarded Olympic gymnasts’ allegations and later made false statements to cover their mistakes https://t.co/h7LOJgb5kH",
  "data/tweet-wsj/2021/10/1445475146085457933.json": "Former Facebook employee Frances Haugen faces an uncertain legal landscape as she speaks publicly about the social-media company’s practices, said attorneys who specialize in federal whistleblower laws https://t.co/siwaWjzXsb",
  "data/tweet-wsj/2021/10/1445448752374824963.json": "Nikki Haley calls Donald Trump a friend and says she’d consult with him before embarking on a White House bid. \"We need him in the Republican Party. I don't want us to go back to the days before Trump.\" https://t.co/REO0NjfO3u",
  "data/tweet-wsj/2021/10/1445512917688877057.json": "Catholic priests, church employees and volunteers in France sexually abused approximately 330,000 minors since 1950, according to an investigation https://t.co/ZMRQrioPDc",
  "data/tweet-wsj/2021/10/1445527991350530051.json": "From @WSJopinion: The problem is not that Gen. Milley deviated from policy; the problem is the policy. No president should have the sole authority to start a nuclear war, writes @SecDef19. https://t.co/cOBsSuKkSz",
  "data/tweet-wsj/2021/10/1445565735661490190.json": "When Dave Grohl told his mother he was dropping out of school to be in a rock band, she told him, \"You’d better be good.\" https://t.co/W4ne0qXF1J",
  "data/tweet-wsj/2021/10/1445561973039534085.json": "Mark Zuckerberg said Facebook's work and motives have been mischaracterized in recent media reports and whistleblower testimony https://t.co/Z3y7Vk6jfK",
  "data/tweet-wsj/2021/10/1445592194572636167.json": "Halloween is still weeks away, but the Netflix smash hit \"Squid Game\" is already looking to sweep the costume category https://t.co/LwufJf8zvk",
  "data/tweet-wsj/2021/10/1445558202419060736.json": "Former Facebook employee Frances Haugen faces an uncertain legal landscape as she speaks publicly about the social-media company’s practices, said attorneys who specialize in federal whistleblower laws https://t.co/2rlLw2WTQ5",
  "data/tweet-wsj/2021/10/1445320412615827458.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/OEz5Wh97gL",
  "data/tweet-wsj/2021/10/1445607275121414146.json": "New Zealand has raised interest rates, making it one of the first developed nations to do so as much of the world emerges from the Covid-19 pandemic https://t.co/bUi5y5WNCU",
  "data/tweet-wsj/2021/10/1445652564658188288.json": "Your T-shirts might be getting more expensive. Cotton prices are the highest they’ve been in a decade. https://t.co/Lg3zOtHccN",
  "data/tweet-wsj/2021/10/1445580861517164551.json": "Health officials knew of complaints about a pedophile doctor abusing Native American boys at U.S. Indian Health Service hospitals years earlier than previously acknowledged, according to an internal investigation https://t.co/TeBRBsrMnB",
  "data/tweet-wsj/2021/10/1445584641776181261.json": "Some Democrats are floating possible changes to the Senate’s filibuster rule to resolve an impasse over the debt ceiling https://t.co/OgIFXUBQyV",
  "data/tweet-wsj/2021/10/1445695357678092299.json": "The Biden administration plans to expand its student loan forgiveness program to help more than half a million public-sector workers https://t.co/X2yIYyl73y",
  "data/tweet-wsj/2021/10/1445693917647704072.json": "The Nobel Prize in Chemistry was awarded to U.S.-based scientist David MacMillan and Benjamin List of Germany for developing a tool for building molecules https://t.co/2drrcNyRmZ",
  "data/tweet-wsj/2021/10/1445697892337938441.json": "Former Facebook employee Frances Haugen faces an uncertain legal landscape as she speaks publicly about the social-media company’s practices, said attorneys who specialize in federal whistleblower laws https://t.co/qCNypG666t",
  "data/tweet-wsj/2021/10/1445713007841984513.json": "Here’s what we’re watching ahead of Wednesday’s open https://t.co/4f5V58ggkQ",
  "data/tweet-wsj/2021/10/1445701643190759427.json": "BlackRock said five employers have signed up for a new retirement product that will allow workers to receive a stream of payments for the rest of their lives https://t.co/OswWIwVlJ5",
  "data/tweet-wsj/2021/10/1445746967552745474.json": "From @WSJopinion: Facebook has become a political scapegoat for deeper-seated cultural problems. Teens' mental health is a problem that can’t be solved by government. https://t.co/gLZurpKUQ6",
  "data/tweet-wsj/2021/10/1445739405004603406.json": "China’s People’s Liberation Army would be able to launch a full-blown attack on Taiwan with minimal cost by 2025, said Taiwan's defense minister https://t.co/18MGqXpxBq",
  "data/tweet-wsj/2021/10/1445783949024776192.json": "The world's first malaria vaccine was endorsed by the World Health Organization for widespread use in sub-Saharan Africa. It comes decades after scientists began work on the shot. https://t.co/qN9qp2sAco",
  "data/tweet-wsj/2021/10/1445777148246040595.json": "Dozens of pieces of art created by boxing legend Muhammad Ali sold in an auction Tuesday for nearly $1 million https://t.co/LlMCKkGdTe",
  "data/tweet-wsj/2021/10/1445614816580694021.json": "From @WSJopinion: The Nobel Prize should be given posthumously, since many laureates go on to do great evil. As in investing, past performance is no guarantee of future results, writes @AdamWSJ. https://t.co/5vzT6qxW3r",
  "data/tweet-wsj/2021/10/1445813625210355715.json": "From @WSJopinion: Four studies—including two from WHO—provide powerful evidence favoring the lab-leak theory, write Richard Muller and Steven Quay https://t.co/HmK5FAk4WL",
  "data/tweet-wsj/2021/10/1445822442413363201.json": "The Netflix dystopian blockbuster \"Squid Game\" uses a mysterious phone number. Real people are getting inundated with calls. https://t.co/WUZWu2A3P2",
  "data/tweet-wsj/2021/10/1445837527382908929.json": "The CIA opened a secret back door to the Kabul airport, known by the code names Glory Gate and Liberty Gate, to evacuate Afghans working at the U.S. Embassy and others who could not make it through Taliban checkpoints while trying to escape the country https://t.co/gFCVAFsX7L",
  "data/tweet-wsj/2021/10/1445791057313079305.json": "From @WSJopinion: If Congress fails to raise the debt limit, the Democrats who run both ends of Pennsylvania Ave. will be responsible for the consequences https://t.co/3vpNLNrRi9",
  "data/tweet-wsj/2021/10/1445920594428456963.json": "The Justice Department is creating a specialized team to investigate and prosecute crimes involving cryptocurrency https://t.co/xoVyvodzIs",
  "data/tweet-wsj/2021/10/1445917523464105992.json": "A federal judge has blocked a Texas ban on abortions after six weeks of pregnancy, a blow against a law that has limited the procedure statewide https://t.co/VfDilUEvcA",
  "data/tweet-wsj/2021/10/1445882819624964103.json": "The Mom Project, a recruitment firm focused on mothers, raised $80 million in new capital at what may be a pivotal moment for working women and the companies that want to hire them https://t.co/UTy7mhPcdK",
  "data/tweet-wsj/2021/10/1445924366257213440.json": "The CIA opened a secret back door to the Kabul airport, known by the code names Glory Gate and Liberty Gate, to evacuate Afghans working at the U.S. Embassy and others who could not make it through Taliban checkpoints while trying to escape the country https://t.co/KdOb497PtS",
  "data/tweet-wsj/2021/10/1445950781698494469.json": "Star stock picker Cathie Wood’s ARK Investment Management is closing its New York headquarters and moving to Florida https://t.co/BUH2DLUyP4",
  "data/tweet-wsj/2021/10/1445897936802652160.json": "From @WSJopinion: The worldview of Marxists and woke leftists alike is fundamentally primitive, writes Paul H. Rubin https://t.co/Ve96GRcbje",
  "data/tweet-wsj/2021/10/1445682802196811786.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDOUKJQ https://t.co/6qJEpltvYu",
  "data/tweet-wsj/2021/10/1445984764603867139.json": "The CIA opened a secret back door to the Kabul airport, known by the code names Glory Gate and Liberty Gate, to evacuate Afghans working at the U.S. Embassy and others who could not make it through Taliban checkpoints while trying to escape the country https://t.co/DIV38d4QJG",
  "data/tweet-wsj/2021/10/1445954568119017474.json": "“Is this ‘Squid Game’?” Fans of the Netflix dystopian hit are calling the phone number in the show, swamping the phones of real-life people https://t.co/XyGrPUl2FG",
  "data/tweet-wsj/2021/10/1445765804641845255.json": "Wooden barracks at the Auschwitz-Birkenau Memorial and Museum were vandalized Tuesday with anti-Semitic inscriptions, the memorial said https://t.co/FNw0WDGS04",
  "data/tweet-wsj/2021/10/1445943231146074115.json": "At-home exercise injuries resulting in an emergency room visit increased by more than 48 percent from 2019 to the end of 2020. Here, exercise experts share their best tips for staying safe while working out at home. https://t.co/MWuzLA76PP",
  "data/tweet-wsj/2021/10/1445962130935750665.json": "A federal judge has blocked a Texas ban on abortions after six weeks of pregnancy, a blow against a law that has limited the procedure statewide https://t.co/MTbntw4g2s",
  "data/tweet-wsj/2021/10/1446048936339386373.json": "Moderna, which has faced criticism for not supplying more Covid-19 vaccine doses to middle- and low-income countries, plans to build a $500 million plant in Africa https://t.co/725tGGAVrm",
  "data/tweet-wsj/2021/10/1446071223964819458.json": "The Nobel Prize in Literature was awarded to novelist Abdulrazak Gurnah for his writing on the effects of colonialism and the fate of refugees https://t.co/XSKTVFxRDS",
  "data/tweet-wsj/2021/10/1445848884580954115.json": "A port support-services company is accused of overcharging the U.S. Navy $50 million in a federal prosecution highlighting persisting corruption in naval contracting and the Navy’s failure to root it out https://t.co/sVovjZpqIS",
  "data/tweet-wsj/2021/10/1446093456766644231.json": "Breaking: Pfizer asked the FDA to authorize its Covid-19 vaccine for children 5 to 11 years old. A shot could be available to kids in weeks. https://t.co/sJJztiDcN1",
  "data/tweet-wsj/2021/10/1446109997847416835.json": "U.S. troops have been in Taiwan for at least a year secretly training its military, officials say, as concern over potential Chinese aggression mounts https://t.co/pNuMXXZMmE",
  "data/tweet-wsj/2021/10/1446113093382115334.json": "Saudi Arabia’s sovereign wealth fund moved close to a deal to acquire Newcastle United in the English Premier League, giving it a foothold in the world’s most popular sports enterprise after more than two years of on and off talks https://t.co/hSP6Jy8lfW",
  "data/tweet-wsj/2021/10/1446105549150564358.json": "Finland joined Sweden, Denmark and Norway in recommending against use of Moderna's Covid-19 vaccine in younger age groups, citing risks of rare cardiovascular side effects they said warranted the precautionary steps https://t.co/HsK2o6mSnU",
  "data/tweet-wsj/2021/10/1446128199344136209.json": "An earthquake with an estimated magnitude of 6.1 caused significant shaking in Tokyo and surrounding areas on Thursday night local time https://t.co/XhfApueTWK",
  "data/tweet-wsj/2021/10/1446135791051288582.json": "From @WSJopinion: Biden’s plan would empower the government, pile burdens on the private economy, and erode upward mobility by encouraging people not to work. That’s the real recipe for decline.\nhttps://t.co/sW6I8cRFpN",
  "data/tweet-wsj/2021/10/1446116882700857346.json": "Considered the original influencer, Paris Hilton looks to expand her brands with a new company. “I wanted to take it to the next level and bring all my companies under one media entity.” https://t.co/RJREwFWNQL",
  "data/tweet-wsj/2021/10/1446139531367960585.json": "The CIA opened a secret back door to the Kabul airport, known by the code names Glory Gate and Liberty Gate, to evacuate Afghans working at the U.S. Embassy and others who could not make it through Taliban checkpoints while trying to escape the country https://t.co/ptC8t3Josj",
  "data/tweet-wsj/2021/10/1445719485588115458.json": "President Biden said his spending proposals would keep the U.S. competitive, highlighting China’s investment in its infrastructure and electric vehicles during a visit to Michigan, the center of the U.S. automotive industry #WSJWhatsNow https://t.co/vbVE9EGQbI",
  "data/tweet-wsj/2021/10/1446131983327899648.json": "Eighteen months ago, Huawei was a world-beating technology company. Now it's hobbled, and a relentless U.S. campaign is the cause. https://t.co/urffLbNDt0",
  "data/tweet-wsj/2021/10/1446246170624471045.json": "Tesla said it will move its headquarters to Austin, Texas, from its longtime base in Silicon Valley https://t.co/dBQ7Pe2kJP",
  "data/tweet-wsj/2021/10/1446248984478208002.json": "Google will no longer allow digital ads bought on its platform to appear next to online content that denies climate change, a ban that will also apply to YouTube, the company’s giant online-video service https://t.co/Cj5X6gTw1L",
  "data/tweet-wsj/2021/10/1446030073778393091.json": "“Is this ‘Squid Game’?” Fans of the Netflix dystopian hit are calling the phone number in the show, swamping the phones of real-life people https://t.co/orKATnBL91",
  "data/tweet-wsj/2021/10/1446299339337478176.json": "President Biden will restore protections for two national monuments in Utah and an undersea monument off New England, reversing actions taken by Trump https://t.co/EHdL7OlxA6",
  "data/tweet-wsj/2021/10/1446320713309245441.json": "Tesla said it will move its headquarters to Austin, Texas, from its longtime base in Silicon Valley https://t.co/xGLcYZHhrA",
  "data/tweet-wsj/2021/10/1445970913367834625.json": "Take an early look at the front page of The Wall Street Journal https://t.co/ueG6JDT1dO https://t.co/O0bfl9t3XN",
  "data/tweet-wsj/2021/10/1446296819789705242.json": "U.S. troops have been in Taiwan for at least a year secretly training its military, officials say, as concern over potential Chinese aggression mounts https://t.co/hfN8KSUKaq",
  "data/tweet-wsj/2021/10/1446347134396215302.json": "Google will no longer allow digital ads bought on its platform to appear next to online content that denies climate change, a ban that will also apply to YouTube, the company’s giant online-video service https://t.co/Kdv0PR3l2o",
  "data/tweet-wsj/2021/10/1446309414886125568.json": "If authenticated, a painting by the Baroque master  Caravaggio—initially listed at auction this past spring for around $1,800 and potentially worth millions—could become one of the most valuable old master artworks in the world https://t.co/DNPsL8lAa8",
  "data/tweet-wsj/2021/10/1446354716846403595.json": "U.S. troops have been in Taiwan for at least a year secretly training its military, officials say, as concern over potential Chinese aggression mounts https://t.co/nFRBAPvEBm",
  "data/tweet-wsj/2021/10/1446226399556251656.json": "Eighteen months ago, Huawei was a world-beating technology company. Now it's hobbled, and a relentless U.S. campaign is the cause. https://t.co/FUp877dx3D",
  "data/tweet-wsj/2021/10/1446404500990877707.json": "The Nobel Peace Prize was awarded to journalists Maria Ressa in the Philippines and Dmitry Muratov in Russia for their efforts to safeguard freedom of expression https://t.co/42MwamuzWO",
  "data/tweet-wsj/2021/10/1446332029071724544.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/hVWrJg9OVm",
  "data/tweet-wsj/2021/10/1446445593916805121.json": "Elon Musk announced that Tesla will move its headquarters to Austin, Texas, but said that the electric-vehicle maker will maintain a significant presence in longtime base California #WSJWhatsNow https://t.co/YBJQVrI25r",
  "data/tweet-wsj/2021/10/1446453523940528131.json": "The U.S. economy added 194,000 jobs in September and the unemployment rate fell to 4.8%. The Delta variant and a tight labor market held back hiring. https://t.co/Qa3Bs8tPaD",
  "data/tweet-wsj/2021/10/1446403759890915350.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/rSjK8SyNMX",
  "data/tweet-wsj/2021/10/1446230123527688193.json": "The CIA's newly announced China Mission Center, part of an agencywide pivot toward China, will bring together case officers who recruit spies, intelligence analysts, technology experts and other specialists in a single unit https://t.co/SgzsnQCytX",
  "data/tweet-wsj/2021/10/1446151115901444100.json": "Two NYC lawyers are expected to plead guilty to federal charges stemming from an attack on an empty police car during protests in the aftermath of the death of George Floyd last year https://t.co/Z2GrHvARlN",
  "data/tweet-wsj/2021/10/1446512734703689744.json": "Breaking: Nearly 140 countries agreed to set a global minimum corporate tax rate. The deal—a decade in the making—could be tough to implement, especially in the U.S. https://t.co/jHmrXIfBpf",
  "data/tweet-wsj/2021/10/1446494352570818561.json": "Essay: Water crises in multiple cities have left Americans uncertain that what flows from their taps is safe to drink https://t.co/Qchzuu7Elq",
  "data/tweet-wsj/2021/10/1446539680816766979.json": "The nation’s largest teachers union is urging TikTok, Facebook, Instagram and Twitter to halt the dissemination and spread of dangerous viral challenges and misinformation it says pose a threat to educators and students https://t.co/ZruuftrzLg",
  "data/tweet-wsj/2021/10/1446561798879121409.json": "Jon Gruden, head coach of the Las Vegas Raiders, used a racist trope when describing the top NFL players' executive in a 2011 email https://t.co/FYHLHqrOsY",
  "data/tweet-wsj/2021/10/1446556023045689369.json": "President Biden has denied an attempt by former President Donald Trump to assert executive privilege and prevent lawmakers from obtaining certain records related to the Jan. 6 riot at the Capitol https://t.co/b5tHhUSudi",
  "data/tweet-wsj/2021/10/1446551687330730025.json": "Breaking: Two parents were found guilty of all charges in the college admissions cheating scandal. The trial was the first of several expected in the case. https://t.co/Qvo4gOZgh7",
  "data/tweet-wsj/2021/10/1446566084715352067.json": "From @WSJopinion: The early data indicate that molnupiravir is the greatest scientific advancement against Covid since the vaccines. Will the FDA act to save lives today? asks @MartyMakary https://t.co/vXO4khsdPm",
  "data/tweet-wsj/2021/10/1446573679182290951.json": "Billionaire mogul and former Los Angeles Dodgers owner Frank McCourt has a new mission: fixing social media to “strengthen our democracy” https://t.co/LPsg9Bhbxa",
  "data/tweet-wsj/2021/10/1446626498182619141.json": "The Nobel Peace Prize was awarded to journalists Maria Ressa in the Philippines and Dmitry Muratov in Russia for their efforts to safeguard freedom of expression https://t.co/3aGgany5Gs",
  "data/tweet-wsj/2021/10/1446596294802296832.json": "Tesla is the latest California company to leave the Bay Area for Austin. Here's how the two regions stack up. https://t.co/Os84YXRivN",
  "data/tweet-wsj/2021/10/1446554755166265345.json": "The $14 trillion shipping industry, ferrying 90% of world trade, has left in its wake a record number of crews abandoned at sea without pay or supplies https://t.co/aOjCFkLbwA",
  "data/tweet-wsj/2021/10/1445977210167382018.json": "Cloud companies are having a hard time hiring and retaining experienced talent as Covid-19 has inflated internet use https://t.co/Jiyr4HkJup",
  "data/tweet-wsj/2021/10/1446679338947158017.json": "“We cannot survive here.” Around the world, record numbers of seafarers are stuck aboard decrepit cargo ships, abandoned by owners without pay or a way home. https://t.co/bIJjfm0Axm",
  "data/tweet-wsj/2021/10/1446649117950844932.json": "From @WSJopinion: Modern technology has created untold vistas for the tyranny of the crowd. Mobs that form from the bottom up may prove even harder to defeat than totalitarian regimes, writes Robert D. Kaplan. https://t.co/AkyPNlgtUz",
  "data/tweet-wsj/2021/10/1446732186053484552.json": "Essay: Water crises in multiple cities have left Americans uncertain that what flows from their taps is safe to drink https://t.co/AuLhIiIt7W",
  "data/tweet-wsj/2021/10/1446634066527330304.json": "From @WSJopinion: If we erase sex-specific words from our language, we erase, too, what it means to be a man or a woman. Where does it stop? asks @NicoleReneeAult https://t.co/Vp2gWcd2kG",
  "data/tweet-wsj/2021/10/1446799607552425988.json": "The nation’s largest teachers union is urging big tech companies to halt the dissemination and spread of dangerous viral challenges and misinformation it says pose a threat to educators and students https://t.co/JetqN4YOCM",
  "data/tweet-wsj/2021/10/1446777495680847872.json": "China’s president called for a “peaceful reunification” with Taiwan in a speech marking the 110th anniversary of the revolution that overturned imperial rule https://t.co/o6NoE173nR",
  "data/tweet-wsj/2021/10/1446807687900053511.json": "An investigation of the Catholic Church in France found that priests, church employees and volunteers sexually abused approximately 330,000 minors since 1950 https://t.co/QftMuNJpri",
  "data/tweet-wsj/2021/10/1446652902047686663.json": "More than 1,000 seafarers have been abandoned aboard container ships and bulk carriers in seas around the world, some with no food, no pay and no way home https://t.co/3MdOOkltJl",
  "data/tweet-wsj/2021/10/1446834101001105416.json": "From @WSJopinion: The bigger threat of giving the IRS access to the details of your bank account is that politicians will eventually find a way to control how you save and spend your own money. This is a bad idea that deserves to die. https://t.co/aELr3xwldt",
  "data/tweet-wsj/2021/10/1446845681214365698.json": "As a Facebook employee, Frances Haugen tried to find solutions for how its platforms could cause harm. But she didn’t have the resources or power to act—so she turned whistleblower https://t.co/yFufNfORVB",
  "data/tweet-wsj/2021/10/1446815270924963841.json": "The CIA opened a secret back door to the Kabul airport, known by the code names Glory Gate and Liberty Gate, to evacuate Afghans working at the U.S. Embassy and others who could not make it through Taliban checkpoints while trying to escape the country https://t.co/T8yreWEgiD",
  "data/tweet-wsj/2021/10/1446864311427768325.json": "U.S. troops have been in Taiwan for at least a year secretly training its military, officials said, as concern over potential Chinese aggression mounts https://t.co/MjdhFuoL9Q",
  "data/tweet-wsj/2021/10/1446871859904098317.json": "A report named dozens of world leaders and hundreds of politicians, public officials, billionaires, religious leaders and celebrities who have used offshore tax havens to conceal their financial activities, and in many cases, avoid paying taxes https://t.co/QnxT5pmSui",
  "data/tweet-wsj/2021/10/1446909606647762950.json": "China is struggling with widespread power shortfalls, risking disruption to global supply chains and heightened inflationary pressure around the world https://t.co/kwI7OfqIqw",
  "data/tweet-wsj/2021/10/1446294322383495172.json": "A natural-gas supply crisis means shippers are diverting tankers to the highest bidder, and manufacturers are slowing production because of high energy prices https://t.co/3Glw0JuNJ9",
  "data/tweet-wsj/2021/10/1446939546340442117.json": "Chinese President Xi Jinping called for a “peaceful reunification” with Taiwan days after China’s People’s Liberation Army sent a record 56 bombers and other aircraft on sorties near the self-ruled island in a single day https://t.co/zQ2ljKMiha",
  "data/tweet-wsj/2021/10/1446905850103320579.json": "From @WSJopinion: Progressives know that entitlements, once created, are almost impossible to repeal. The real sticker shock will come later, after the programs are on autopilot. https://t.co/ZIoy2LKPpy",
  "data/tweet-wsj/2021/10/1446902289160187909.json": "“We cannot survive here.” Around the world, record numbers of seafarers are stuck aboard decrepit cargo ships, abandoned by owners without pay or a way home. https://t.co/G1kdJRIxS1",
  "data/tweet-wsj/2021/10/1446954894741712897.json": "Eighteen months ago, Huawei was a world-beating technology company. Now it's hobbled, and a relentless U.S. campaign is the cause. https://t.co/RYmaROUTbQ",
  "data/tweet-wsj/2021/10/1446988879773507584.json": "Tesla is the latest California company to leave the Bay Area for Austin. Here's how the two regions stack up. https://t.co/FoKvQWAqDx",
  "data/tweet-wsj/2021/10/1447022851324846080.json": "South Korea’s dystopian drama “Squid Game” might become Netflix’s biggest hit ever. But for a decade, local studios rejected the fictionalized show’s pitch as too grotesque and too unrealistic. https://t.co/7MDsa44Yb1",
  "data/tweet-wsj/2021/10/1447026598830563341.json": "A Russian actress and director were launched to the International Space Station to spend 12 days making the world’s first movie shot in orbit, getting in ahead of Tom Cruise and NASA #WSJWhatsNow https://t.co/kd9TSvT6rM",
  "data/tweet-wsj/2021/10/1446992652055023616.json": "Review: In their memoir \"The Boys,\" brothers Ron Howard and Clint Howard recall a Tinseltown childhood free of malice, regret or self-pity. It’s like a Ron Howard movie between two covers. https://t.co/8q1fs6AE5v",
  "data/tweet-wsj/2021/10/1446547205150629898.json": "President Biden on Friday signed a law providing financial support for U.S. government personnel who have suffered the mysterious neurological attacks known as Havana Syndrome https://t.co/YvWEG5yJrx",
  "data/tweet-wsj/2021/10/1447083234190372864.json": "Taiwanese President Tsai Ing-wen said “there should be absolutely no illusions” about the willingness of Taiwanese people to stand up to Beijing https://t.co/XJjhbPlsKB",
  "data/tweet-wsj/2021/10/1447056821299126273.json": "Research shows that listening to the same narrative leads our heart rates to rise and fall in unison https://t.co/CDXwBfptcO",
  "data/tweet-wsj/2021/10/1447087027778899970.json": "A pair of signed Nike sneakers worn by Michael Jordan in one of his first NBA games is expected to fetch up to $1.5 million at auction later this month https://t.co/JpQx3VLl8Q",
  "data/tweet-wsj/2021/10/1446951154458451978.json": "More than 1,000 seafarers have been abandoned aboard container ships and bulk carriers in seas around the world, some with no food, no pay and no way home https://t.co/K1Ql7bSKoN",
  "data/tweet-wsj/2021/10/1447162764489859074.json": "From @WSJopinion: Outright evil can surely be dealt with, but a self-righteous conformity is harder to resist. Left unchecked, this is how the West slowly dies, writes Robert D. Kaplan https://t.co/Yv0ZIJFF62",
  "data/tweet-wsj/2021/10/1447064418446098433.json": "Some teachers are finding students’ learning loss during remote learning is worse than they expected. \"I feel like we’re running out of time.\" https://t.co/JgwYLGN2Hs",
  "data/tweet-wsj/2021/10/1447181392241172487.json": "Costco, Home Depot and other big retailers have resorted to an extreme, and expensive, tactic to get around supply-chain snarls for the holidays: “Let’s just charter a ship.” https://t.co/goh3D3KUUu",
  "data/tweet-wsj/2021/10/1447188932282748935.json": "America's largest teachers union asked TikTok, Facebook, Instagram and Twitter to halt the spread of dangerous viral challenges that dare students to slap teachers, vandalize or steal from school bathrooms https://t.co/AmmDjLhpM2",
  "data/tweet-wsj/2021/10/1447158747340681224.json": "Abdul Qadeer Khan, a Pakistani scientist who shared nuclear-weapons technology and know-how with countries the U.S. regards as rogue states after helping his country build its first atomic bomb, has died at 85 years old https://t.co/R7p243E0Va",
  "data/tweet-wsj/2021/10/1447196476526968837.json": "From @WSJopinion: A new diagnostic blood test can now detect 50 types of cancer and has the potential to save tens of thousands of lives a year if it becomes widely available. But regulators may slow the process, writes @AllysiaFinley https://t.co/2sMyWGg97U",
  "data/tweet-wsj/2021/10/1447166295363948549.json": "Young adults choosing between debit and credit cards should consider the upsides and downsides of each. Three financial experts offer advice on when it makes sense to use one or the other. https://t.co/vVTb17LPSG",
  "data/tweet-wsj/2021/10/1447204038366449665.json": "Do you need to care less about your job? Here’s how to gain perspective https://t.co/dlci53XEJ3",
  "data/tweet-wsj/2021/10/1447200268152676359.json": "Texas A&amp;M pulled off the upset of the season, knocking off No. 1 Alabama on a last-second field goal to shake up the College Football Playoff picture https://t.co/7OFCCTzMOc",
  "data/tweet-wsj/2021/10/1447215606592425988.json": "What do the wealthy pay in federal taxes? On paper, the top marginal income-tax rate is 37% on ordinary income and 23.8% on capital gains. A new Biden administration analysis, however, pegs the average tax rate for the 400 wealthiest households at 8.2%. https://t.co/8Jb8DE1SgD",
  "data/tweet-wsj/2021/10/1447226692532121603.json": "Star stock picker Cathie Wood’s ARK Investment Management is closing its New York headquarters and moving to Florida https://t.co/ikIXuZ5Eo7",
  "data/tweet-wsj/2021/10/1447144925905174528.json": "The taste of freedom offered by remote work during the pandemic has given us an appetite for greater liberty in all aspects of our work lives, writes @adammgrant https://t.co/rskq6HtU6A",
  "data/tweet-wsj/2021/10/1447102127013257218.json": "The definitive guide to making pro-level pizza at home https://t.co/vWWj0O04j9",
  "data/tweet-wsj/2021/10/1447241280363376652.json": "Chinese housing developers ran up trillions in debt. Now the ground is shifting under them. https://t.co/q55RW0xOAZ",
  "data/tweet-wsj/2021/10/1447254361919328256.json": "President Biden issued a proclamation naming Oct. 11 Indigenous Peoples’ Day. It will be observed the same day as Columbus Day, which was first declared a national holiday in 1934. https://t.co/dKWcBe8Guf",
  "data/tweet-wsj/2021/10/1446943576999538698.json": "Czech Prime Minister Andrej Babis lost his re-election bid on Saturday, a major upset against a billionaire businessman who had personified the rise of populist nationalism in Central Europe https://t.co/kIHl2N5XAR",
  "data/tweet-wsj/2021/10/1447251861413715970.json": "The 25th installment in the Bond franchise, “No Time to Die,” opened to an estimated $56 million in the U.S. and Canada after the movie was delayed https://t.co/3JHpvlQ19Q",
  "data/tweet-wsj/2021/10/1447286924595576833.json": "South Korea’s dystopian drama “Squid Game” might become Netflix’s biggest hit ever. But for a decade, local studios rejected the fictionalized show’s pitch as too grotesque and too unrealistic. https://t.co/QVPMAmTAQM",
  "data/tweet-wsj/2021/10/1447309741663916045.json": "A U.S. Navy engineer and his wife have been charged with attempting to share secrets about nuclear submarine technology with a foreign country https://t.co/3YJwJmL9Uj",
  "data/tweet-wsj/2021/10/1447290889823469577.json": "“Our children are crying because there is nothing to eat.” Severe drought in Afghanistan is compounding the economic crisis that deepened when the Taliban overthrew the previous government. https://t.co/disCHDLwl7",
  "data/tweet-wsj/2021/10/1447377679355875331.json": "Chinese housing developers ran up $5 trillion of debt in a historic real-estate boom. Beijing is trying to cool things down without hurting the economy. https://t.co/lALO2SLvAd",
  "data/tweet-wsj/2021/10/1447373927022538765.json": "An investigation of the Catholic Church in France found that priests, church employees and volunteers sexually abused approximately 330,000 minors since 1950 https://t.co/Qdl9IY0cnp",
  "data/tweet-wsj/2021/10/1447366357587214338.json": "Southwest Airlines canceled more than 1,000 flights Sunday, or 28% of its schedule, according to FlightAware https://t.co/elkf1O9uyG",
  "data/tweet-wsj/2021/10/1447362579307827207.json": "Do you need to care less about your job? Here’s how to gain perspective https://t.co/3jMWrXL6GV",
  "data/tweet-wsj/2021/10/1447355022430412802.json": "Indigenous Peoples’ Day, observed the same day as Columbus Day, is meant to celebrate the contributions of indigenous peoples to society, and honor their place as the first inhabitants of what is now the U.S. https://t.co/htibXKW9wr",
  "data/tweet-wsj/2021/10/1447294633483120649.json": "Southwest Airlines canceled more than 1,000 flights Sunday, or 28% of its schedule, according to FlightAware https://t.co/zNrUBK88wH",
  "data/tweet-wsj/2021/10/1447305972884586498.json": "Rodents the size of dogs are multiplying like sewer rats in an exclusive gated community of Argentina, harassing family pets and leaving XXL-size droppings https://t.co/1PXqVe6Nqw",
  "data/tweet-wsj/2021/10/1447400325992927236.json": "The world's largest rodent is the size of a St. Bernard, with teeth like a beaver and an insatiable appetite. Residents of an exclusive gated community can't stop them. https://t.co/8aVwhZLFvw",
  "data/tweet-wsj/2021/10/1447411660671553544.json": "Rising energy prices could push up inflation, damp consumer spending and ultimately slow the U.S. recovery, economists say https://t.co/lfyOW0cPEG",
  "data/tweet-wsj/2021/10/1447472071819370498.json": "America's largest teachers union asked TikTok, Facebook, Instagram and Twitter to halt the spread of dangerous viral challenges that dare students to slap teachers, vandalize or steal from school bathrooms https://t.co/6jyJCsRxGn",
  "data/tweet-wsj/2021/10/1447479626188607489.json": "Costco, Home Depot and other big retailers have resorted to an extreme, and expensive, tactic to get around supply-chain snarls for the holidays: “Let’s just charter a ship.” https://t.co/wdHeoK9Rlz",
  "data/tweet-wsj/2021/10/1447507800016490497.json": "The Nobel Prize in economics was awarded to David Card for work on labor economics, and Joshua D. Angrist and Guido W. Imbens for the analysis of causal relationships https://t.co/Y94mM8Jaca",
  "data/tweet-wsj/2021/10/1447503360693768194.json": "Merck and its partner asked the FDA to authorize their Covid-19 pill, potentially the first oral antiviral to treat the coronavirus https://t.co/71AoLwuxwg",
  "data/tweet-wsj/2021/10/1447370134885216261.json": "The taste of freedom offered by remote work during the pandemic has given us an appetite for greater liberty in all aspects of our work lives, writes @adammgrant https://t.co/1wIaFEVJoK",
  "data/tweet-wsj/2021/10/1447015301183381505.json": "The romance between Elizabeth Holmes and her top deputy spanned more than a decade, growing and fading alongside the rise and fall of Theranos. Now, the relationship and the pair’s intimate text messages are an important part of her criminal fraud trial. https://t.co/Kj9AOZ2AB6",
  "data/tweet-wsj/2021/10/1447517351734358017.json": "Indigenous Peoples’ Day, observed the same day as Columbus Day, is meant to celebrate the contributions of indigenous peoples to society, and honor their place as the first inhabitants of what is now the U.S. https://t.co/LhvAj1CbAb",
  "data/tweet-wsj/2021/10/1447577809589780487.json": "The tiger population in northeastern China has started to climb after decades of environmental degradation related to runaway growth https://t.co/2RE7qkY9rO",
  "data/tweet-wsj/2021/10/1447528676451655680.json": "Soaring oil and natural-gas prices are fueling concerns about rising inflation and pressuring policy makers ahead of the Glasgow climate summit https://t.co/k3V7WIYQCD",
  "data/tweet-wsj/2021/10/1447570208974114825.json": "From @WSJopinion: We must teach the good and the bad of our leaders, our founders, our heroes and saints. I will be celebrating Columbus Day, and I hope you’ll join me, writes @Kasparov63. https://t.co/gDscxqfSBc",
  "data/tweet-wsj/2021/10/1447565949452881920.json": "Southwest Airlines canceled about 350 more flights Monday morning, following 1,900 cancellations over the weekend due to air-traffic-control issues and severe weather https://t.co/ihX5WQNDvc",
  "data/tweet-wsj/2021/10/1447419215376490498.json": "Take an early look at the front page of The Wall Street Journal https://t.co/xdL8CCIurL https://t.co/nG3lbVEuSv",
  "data/tweet-wsj/2021/10/1447649692117086210.json": "Elon Musk is the world’s richest person—and he doesn’t want Jeff Bezos to forget it. When the Amazon founder tweeted an article about his company's success, Musk replied with this: \"🥈\" https://t.co/QguYxpmSDA",
  "data/tweet-wsj/2021/10/1447614363511177218.json": "China's Xi is launching his most extensive examination of the country's financial institutions, targeting their ties with private firms, people familiar say https://t.co/N1TYFsfJ3X",
  "data/tweet-wsj/2021/10/1447573967527682050.json": "Before he became the first Black Manhattan U.S. attorney, Damian Williams built a career as a financial-crimes prosecutor and took a leading role in high-profile white-collar trials https://t.co/vi8Lkskq10",
  "data/tweet-wsj/2021/10/1447709900277260296.json": "Elon Musk is the world’s richest person—and he doesn’t want Jeff Bezos to forget it. When the Amazon founder tweeted an article about his company's success, Musk replied with this: \"🥈\" https://t.co/lRsJagRbI6",
  "data/tweet-wsj/2021/10/1447730000640286720.json": "Texas Gov. Greg Abbott has issued an executive order banning employers from imposing Covid-19 vaccine mandates on their workers https://t.co/GwmzvCIFoX",
  "data/tweet-wsj/2021/10/1447559324507820033.json": "The interpreter who helped rescue Joe Biden in 2008 from a snowy Afghanistan valley has escaped the country. Here's how he got out. https://t.co/1NEpD3xGMB",
  "data/tweet-wsj/2021/10/1447755172940337153.json": "The tiger population in northeastern China has started to climb after decades of environmental degradation related to runaway growth https://t.co/wOnuzFC0Ll",
  "data/tweet-wsj/2021/10/1447762732514746368.json": "Elon Musk is the world’s richest person—and he doesn’t want Jeff Bezos to forget it. When the Amazon founder tweeted an article about his company's success, Musk replied with this: \"🥈\" https://t.co/zvqNUKOuLl",
  "data/tweet-wsj/2021/10/1447758961269223428.json": "The U.S. Indian Health Service fought to keep secret the names of some agency officials who protected a pedophile pediatrician convicted of sexually abusing Native American boys in his care over two decades. The Journal has identified those officials. https://t.co/ejvyECRghs",
  "data/tweet-wsj/2021/10/1447770262083092483.json": "Amazon will give corporate employees the option to work as many as four weeks a year remotely from anywhere in the country in which they are employed, chief executive Andy Jassy said Monday, as the tech behemoth again changed its return-to-office plans https://t.co/yx8sLcOKzR",
  "data/tweet-wsj/2021/10/1447804274260467712.json": "America's largest teachers union asked TikTok, Facebook, Instagram and Twitter to halt the spread of dangerous viral challenges that dare students to slap teachers, vandalize or steal from school bathrooms https://t.co/irGW0ANGG6",
  "data/tweet-wsj/2021/10/1447842015887171585.json": "The tiger population in northeastern China has started to climb after decades of environmental degradation related to runaway growth https://t.co/d0wmwaIB5z",
  "data/tweet-wsj/2021/10/1447874717579415552.json": "More Adam Smith and less Karl Marx for the Chinese power market: Beijing says market-based pricing will help fix electricity crunch  https://t.co/V9IS0p3IB8",
  "data/tweet-wsj/2021/10/1447336172284436480.json": "Thinking about getting a Covid-19 booster shot? If you had the disease and are fully vaccinated, experts say you probably don’t need one right now https://t.co/72S0qD8hWI",
  "data/tweet-wsj/2021/10/1447896078594965504.json": "Gov. Greg Abbott issued an executive order on Monday banning businesses and other private entities in Texas from requiring Covid-19 vaccinations for employees #WSJWhatsNow https://t.co/iTnrgX0U27",
  "data/tweet-wsj/2021/10/1447926897623580674.json": "Investors who long avoided the lagging energy sector because of poor returns and environmental fears are now playing catch-up, fueling a surge in oil prices, explains @ahirtens #WSJWhatsNow https://t.co/V3s6iA8icO",
  "data/tweet-wsj/2021/10/1447977769892208652.json": "Taking a daily aspirin to prevent a first heart attack or stroke is no longer recommended for older adults, a U.S. panel said https://t.co/BhOywaK2c6",
  "data/tweet-wsj/2021/10/1447981681294680064.json": "Kyrie Irving won’t play or practice for the Brooklyn Nets this season until he gets vaccinated, the team said https://t.co/McVGrbYBre",
  "data/tweet-wsj/2021/10/1447509809666924548.json": "Chinese housing developers ran up trillions in debt. Now the ground is shifting under them. https://t.co/CtEVEpQs2Y",
  "data/tweet-wsj/2021/10/1448008353930678278.json": "Gabby Petito died by strangulation and her body was in the wilderness for three to four weeks before it was found, the coroner for Teton County, Wyo., said Tuesday https://t.co/KOeEVctzez",
  "data/tweet-wsj/2021/10/1448015651222822925.json": "California Gov. Gavin Newsom signed bills to ban the sale of gas-powered leaf blowers and lawn mowers, mandate that stores have gender-neutral toy aisles and require students to take an ethnic-studies class before graduating high school https://t.co/AQfunf1C68",
  "data/tweet-wsj/2021/10/1447974126682058755.json": "From @WSJopinion: Merrick Garland’s got a little list. His \"society offenders\" now include parents who object to critical race theory and Covid-19 restrictions, writes @gerardtbaker. https://t.co/vzqloLEOgb",
  "data/tweet-wsj/2021/10/1448060951828307972.json": "Boeing said it will mandate Covid-19 vaccination for its approximately 125,000 U.S. employees by the Dec. 8 deadline set by a presidential order requiring federal employees and contractors to receive the shots https://t.co/htUUnrUU38",
  "data/tweet-wsj/2021/10/1448019420392169472.json": "From @WSJopinion: To doubt a scientist is not to doubt science, writes Gary Saul Morson. Quite the contrary, personal authority is precisely what science dispenses with, as much as possible. https://t.co/hETwDlPBqO",
  "data/tweet-wsj/2021/10/1448098704423112706.json": "Venice, Italy’s tourist destination par excellence, is rebounding, but there’s still plenty of room at the city’s hotels–on weekdays, occupancy is just 35%. Four-star hotel rooms can be had for half the rate they charged in 2019. https://t.co/i9fiivhORA",
  "data/tweet-wsj/2021/10/1447713711762849793.json": "You’re giving a presentation—without any pants. The plane to your business trip is taxiing away as you run for the gate. And what’s the boss from your first job doing here? Here's why work is haunting your dreams. https://t.co/xo6Pu0PBVx",
  "data/tweet-wsj/2021/10/1448140213788635143.json": "Boeing said it will mandate Covid-19 vaccination for its approximately 125,000 U.S. employees by the Dec. 8 deadline set by a presidential order requiring federal employees and contractors to receive the shots https://t.co/kFV7CAZziu",
  "data/tweet-wsj/2021/10/1448013120744591363.json": "China’s Communist Party is ratcheting up its control over news media and online commentary, warning away private investors and cracking down on what it describes as misinformation https://t.co/tAN99gYimM",
  "data/tweet-wsj/2021/10/1448159092351160320.json": "Taking a daily aspirin to prevent a first heart attack or stroke is no longer recommended for older adults, a U.S. panel said https://t.co/E2n8R0NbCn",
  "data/tweet-wsj/2021/10/1448049611449507842.json": "Disgraced South Carolina lawyer Alex Murdaugh is alleged to have stolen millions of dollars from former partners and clients, including the sons of the family housekeeper who died at his home, according to new legal filings https://t.co/EcyX9Ugonj",
  "data/tweet-wsj/2021/10/1448234596206878722.json": "“Squid Game” depicts a South Korean society where “only money matters,” a North Korean propaganda site says   https://t.co/9ESR9FfnPg",
  "data/tweet-wsj/2021/10/1448253463301959681.json": "France has accused more than 100 companies of colluding not to disclose information to consumers about the presence of a chemical in food packaging that some scientists say could be harmful https://t.co/R89vEjAHFg",
  "data/tweet-wsj/2021/10/1448196853049266179.json": "California Gov. Gavin Newsom signed bills to ban the sale of gas-powered leaf blowers and lawn mowers, mandate that stores have gender-neutral toy aisles and require students to take an ethnic-studies class before graduating high school https://t.co/JsfqLgF52W",
  "data/tweet-wsj/2021/10/1448274056508280839.json": "Breaking: Americans receiving Social Security benefits will see the biggest one-year increase in their payments in nearly four decades, with next year's gain expected to be 5.9% https://t.co/uRm3Kgf388",
  "data/tweet-wsj/2021/10/1448261008984842240.json": "More migrants illegally entering the U.S. to apply for asylum are members of South America’s middle class who fly to the border by plane, according to authorities and aid workers https://t.co/nbdQejq8UM",
  "data/tweet-wsj/2021/10/1448265488853831686.json": "U.S. inflation accelerated slightly in September, rising 5.4% from the year before as supplies and labor continued to drive up prices https://t.co/c2P4bG9360",
  "data/tweet-wsj/2021/10/1448305282040410115.json": "At 90, William Shatner became the oldest person to reach space. The “Star Trek” actor and three others completed a Blue Origin flight. https://t.co/NAXD1KDd7o",
  "data/tweet-wsj/2021/10/1448132646370877451.json": "Ethiopian government forces have launched a renewed assault to recapture the northern region of Tigray, raising fears of a more devastating humanitarian crisis after a nearly yearlong conflict https://t.co/bFWXJ9IpVs",
  "data/tweet-wsj/2021/10/1448344043906347011.json": "A North Korean propaganda website said “Squid Game,” Netflix’s top-watched show in more than 90 countries, “gained popularity because it exposes the reality of South Korean capitalist culture” https://t.co/2v85LZ8qoQ",
  "data/tweet-wsj/2021/10/1448309118624837641.json": "A booster shot of Johnson &amp; Johnson’s Covid-19 vaccine showed signs of significantly bolstering the immune defenses of study subjects, said FDA regulators, who cautioned that their data was limited https://t.co/KdeRz6NcA2",
  "data/tweet-wsj/2021/10/1448359164011499520.json": "The Netherlands was the first country in the world to legalize same-sex marriage in 2001. Now, the government says any king or queen of the country wouldn’t have to forfeit the right to the throne if he or she married someone of the same sex. https://t.co/VMciwemklW",
  "data/tweet-wsj/2021/10/1448215700061970433.json": "The U.S. is convening a summit today of more than 30 countries to discuss how to deal with ransomware  https://t.co/mOOmDoAQde",
  "data/tweet-wsj/2021/10/1448412014536282113.json": "A group of star gymnasts on Wednesday stepped up their attack on the U.S. Olympics &amp; Paralympic Committee by asking Congress to dissolve the organization’s board over its alleged failings in handling the Larry Nassar sex abuse scandal https://t.co/KPut7sOnUo",
  "data/tweet-wsj/2021/10/1448404464717680649.json": "Johnson &amp; Johnson’s Covid-19 booster shot significantly bolsters immune defenses, FDA staff said. An advisory panel will consider authorizing a second dose Friday. https://t.co/liDK93f8Y9",
  "data/tweet-wsj/2021/10/1448400696710160391.json": "From @WSJopinion: As Hong Kong authorities act to blot out all monuments and memorials honoring the martyrs of 1989, it’s up to the West to remember the Communist Party’s victims—past and present, writes @JillianKayM https://t.co/Q9AQA2Q5uU",
  "data/tweet-wsj/2021/10/1448326457650995208.json": "From @WSJopinion: Biden's needless order is hurting workers and feeding polarization. This political vaccine jujitsu is causing real harm to Americans. https://t.co/UU907fH9Dk",
  "data/tweet-wsj/2021/10/1448453541492895752.json": "A North Korean propaganda website said “Squid Game,” Netflix’s top-watched show in more than 90 countries, “gained popularity because it exposes the reality of South Korean capitalist culture” https://t.co/94bBYbDGg7",
  "data/tweet-wsj/2021/10/1448449744024621060.json": "A group for transgender employees at Netflix is encouraging staff to stage a walkout following the company's defense of Dave Chapelle's latest stand-up special https://t.co/QiqqvNWNgm",
  "data/tweet-wsj/2021/10/1448438479042584578.json": "What's worse than another Zoom meeting? A hybrid-office Zoom meeting. https://t.co/sNB90dZzLX",
  "data/tweet-wsj/2021/10/1448491279667679234.json": "Adele was the top-selling artist of the 2010s, but streaming has reshaped the music industry in the six years since her last album. With a new single coming, can she maintain her era-defining commercial clout? https://t.co/yHrPL7DqAm",
  "data/tweet-wsj/2021/10/1448536594399600644.json": "A group for transgender employees at Netflix is encouraging staff to stage a walkout following the company's defense of Dave Chapelle's latest stand-up special https://t.co/FukKdzWzhc",
  "data/tweet-wsj/2021/10/1448574365549875200.json": "A North Korean propaganda website said “Squid Game,” Netflix’s top-watched show in more than 90 countries, “gained popularity because it exposes the reality of South Korean capitalist culture” https://t.co/JgT3B28QYO",
  "data/tweet-wsj/2021/10/1448239410869411843.json": "The MTA is asking riders for feedback on a new subway map, similar to the retired Massimo Vignelli design in use from 1972 to 1979  https://t.co/YM1TXYIIaE",
  "data/tweet-wsj/2021/10/1448651081810993164.json": "Breaking: Microsoft said it would shut down LinkedIn in China, marking the end of the last major U.S. social-media network operating openly there https://t.co/tfkE6SLeQf",
  "data/tweet-wsj/2021/10/1448649868046573585.json": "From @WSJopinion: Is inflation still “transitory,” as the Federal Reserve and White House like to say? Not if you’ve been visiting the grocery store, gas pump, online retailer, or anywhere else across the U.S. economy. https://t.co/f0VEp704Wq",
  "data/tweet-wsj/2021/10/1448654665457934337.json": "John Deere production workers went on strike at midnight after an agreement on a new labor contract couldn’t be reached, the latest example of workers demanding better terms amid a persistent nationwide labor shortage https://t.co/1uu5EIXCeu",
  "data/tweet-wsj/2021/10/1448551680950382593.json": "Alitalia, the airline that for years symbolized Italy’s postwar boom and la dolce vita, is slated to fly its last flight Thursday https://t.co/jYuxxBRRkQ",
  "data/tweet-wsj/2021/10/1448714217184444418.json": "The painting that British street artist Banksy purposely shredded during a 2018 auction sold Thursday for $25.4 million—18 times what the buyer of the pre-shredded piece paid for it https://t.co/tND0goVvDX",
  "data/tweet-wsj/2021/10/1448676243256320000.json": "Pope Francis and President Biden will meet at the Vatican on Oct. 29 amid controversy among U.S. bishops over the second Catholic president’s support for abortion rights https://t.co/acIDLmMofi",
  "data/tweet-wsj/2021/10/1448434647914926083.json": "The criminal trial of former Rudy Giuliani associate Lev Parnas kicked off Wednesday, with prosecutors describing him as a Florida businessman who promoted his political connections to funnel foreign money into U.S. elections in 2018 https://t.co/71iatkoZlB",
  "data/tweet-wsj/2021/10/1448661145770881030.json": "United Airlines said it is planning a major trans-Atlantic expansion next year as it looks to take advantage of what it predicts will be a rapid rebound in international travel https://t.co/dUmVgSiOih",
  "data/tweet-wsj/2021/10/1448736633000448008.json": "From @WSJopinion: At 90 years old, William Shatner became the oldest man in space—and on his return showed a sense of raw wonder that would do Captain James Tiberius Kirk proud https://t.co/AzKnlJZs1B",
  "data/tweet-wsj/2021/10/1448732301731446788.json": "Breaking: A booster shot of Moderna's Covid-19 vaccine was recommended for seniors and certain high-risk people by an FDA advisory panel. A decision by the agency could come within days. https://t.co/O68pYf9po0",
  "data/tweet-wsj/2021/10/1448506376335003655.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5EP8cCj8OH https://t.co/EtP74eObRR",
  "data/tweet-wsj/2021/10/1448430918973247488.json": "Adele was the top-selling artist of the 2010s, but streaming has reshaped the music industry in the six years since her last album. With a new single coming, can she maintain her era-defining commercial clout? https://t.co/YJ5O28Wfdw",
  "data/tweet-wsj/2021/10/1448771337212866565.json": "Johnson &amp; Johnson placed into bankruptcy its liabilities for tens of thousands of claims linking talc-based products to cancer, hoping to drive a settlement of personal-injury claims that are expected to grow for years to come https://t.co/iNLFTjMZeG",
  "data/tweet-wsj/2021/10/1448612046212251660.json": "The Port of Los Angeles, one of the country’s busiest ports, is set to operate 24/7 to ship goods to stores ahead of the holiday season #WSJWhatsNow https://t.co/cv23zsh9yM",
  "data/tweet-wsj/2021/10/1448805861896466432.json": "From @WSJopinion: Vicious cancel culture has swept across our educational system and the country. Children can’t thrive in environments like this, writes @EricaKomisarCSW https://t.co/Hbkzl1yIsA",
  "data/tweet-wsj/2021/10/1448827242587594757.json": "The painting that British street artist Banksy purposely shredded during a 2018 auction sold Thursday for $25.4 million—18 times what the buyer of the pre-shredded piece paid for it https://t.co/FUpAP85W5M",
  "data/tweet-wsj/2021/10/1448803629759189000.json": "Adele’s new album “30” is expected to take on the breakup of her marriage. It’s a theme other musicians have explored before, with poignant results. https://t.co/kHIMZKWBoS",
  "data/tweet-wsj/2021/10/1448785801958117384.json": "With her new single “Easy on Me” out after a six-year break from releasing music, Adele dives into a music industry transformed by streaming https://t.co/STGw0w7rSi",
  "data/tweet-wsj/2021/10/1448842340852977668.json": "With her new single “Easy on Me” out after a six-year break from releasing music, Adele dives into a music industry transformed by streaming https://t.co/OBoIGeBMb6",
  "data/tweet-wsj/2021/10/1448857448887037965.json": "Doctors say former President Bill Clinton, who was hospitalized Tuesday with an infection unrelated to Covid-19, is “is on the mend\" https://t.co/ZSECIedwFL",
  "data/tweet-wsj/2021/10/1448764336881782786.json": "The U.S. is missing more than 4 million workers, a shortage many economists expect to last years. Some industries are struggling to bounce back. https://t.co/ZqqbbIhUno https://t.co/NGeVcVqGDA",
  "data/tweet-wsj/2021/10/1448872546670190596.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/9G0CzeCbnA",
  "data/tweet-wsj/2021/10/1448846160345640969.json": "From @WSJopinion: Although the U.S. is the world’s second-largest emitter of greenhouse gasses right now, America’s reaching net zero would matter little for the global temperature, writes @BjornLomborg https://t.co/LPiOlxc6UE",
  "data/tweet-wsj/2021/10/1448937966399787026.json": "The White House will release a report Friday outlining its strategy for new rules for the financial system, calling climate change a systemic risk https://t.co/jVII3E3iAe",
  "data/tweet-wsj/2021/10/1448977782390808577.json": "More than 10,000 workers walked off the job at farm- and construction-equipment maker John Deere, the latest in a series of labor disputes at major U.S. companies #WSJWhatsNow https://t.co/QlEs9xpkbO",
  "data/tweet-wsj/2021/10/1449011347002376194.json": "Breaking: The U.S. plans to lift restrictions for international travelers on Nov. 8. Travelers will need to show proof of vaccination. https://t.co/SzdrO8uZBp",
  "data/tweet-wsj/2021/10/1448782383742963713.json": "A former Boeing pilot was indicted for allegedly deceiving federal regulators during the development of the 737 MAX before two fatal crashes of the jet https://t.co/LJA60iHb1S",
  "data/tweet-wsj/2021/10/1449023529266171907.json": "Season 3 of “Succession” swings around its most unhinged character, Kendall Roy. Actor Jeremy Strong drew on personal discoveries and great literature to map his character’s damaged psyche. https://t.co/BGzZUUMgco",
  "data/tweet-wsj/2021/10/1448637463203704832.json": "U.S. households are projected to spend more on heating than they have in years due to rising energy prices and the likelihood of a colder winter #WSJWhatsNow https://t.co/c7md9CnU6u",
  "data/tweet-wsj/2021/10/1449050974161604615.json": "Breaking: The FDA has delayed a decision on clearing Moderna's Covid-19 vaccine for 12-to-17-year-olds while it looks into the risk of the rare heart condition myocarditis, people familiar with the matter say https://t.co/fIs0sypYzv",
  "data/tweet-wsj/2021/10/1449034878272557059.json": "Dozens of federal judges, or their relatives or brokers, actively traded stock in companies that were litigants in their courtrooms at the time, a WSJ investigation found https://t.co/lOeaLcktX4",
  "data/tweet-wsj/2021/10/1449065090439860233.json": "U.S. workers handed in nearly 20 million resignations this spring and summer. \"Everybody quitting is saying, 'I became part of the Great Resignation.'\" https://t.co/hJOY4hKZ2o",
  "data/tweet-wsj/2021/10/1449106575549939714.json": "From @WSJopinion: Our revolution may be moving past its Terror and toward its Thermidor, writes @Peggynoonannyc https://t.co/oEbtOR67P5",
  "data/tweet-wsj/2021/10/1449091483529789447.json": "Italians returned to their workplaces Friday needing to show proof that they have received a Covid-19 vaccine, tested negative or recovered from the virus, a policy that could provide a preview of a similar mandate planned by the Biden administration https://t.co/IhhDksKmxO",
  "data/tweet-wsj/2021/10/1449095699585511426.json": "A 25-year veteran of the U.S. Capitol Police force was arrested Friday and accused of urging a man who participated in the Jan. 6 riot to cover his tracks on social media, authorities said https://t.co/cvgkLhei6G",
  "data/tweet-wsj/2021/10/1449071216036401158.json": "Breaking: Johnson &amp; Johnson's Covid-19 booster shot was recommended for adults by an FDA advisory panel. A decision by the agency could come within days. https://t.co/bWlVOP6Xvz",
  "data/tweet-wsj/2021/10/1449144322352373762.json": "Dozens of federal judges, or their relatives or brokers, actively traded stock in companies that were litigants in their courtrooms at the time, a WSJ investigation found https://t.co/MxJbvTUvs4",
  "data/tweet-wsj/2021/10/1449080165796089862.json": "DC Comics said the new Superman will come out as bisexual in an upcoming issue, another example of how comic books have often been at the forefront of cultural shifts. Here's a look at key cultural moments in comic book history in the U.S. https://t.co/7cJbm05wlx",
  "data/tweet-wsj/2021/10/1449004675676651523.json": "To keep growing, YouTube needs individual video makers to stay popular. A small army of in-house talent agents helps creators like the comedian Swoozie stay on target.  https://t.co/JMB0pTwP9g",
  "data/tweet-wsj/2021/10/1448824491375841281.json": "A federal appeals court has ruled that Texas’s restrictive abortion law can remain in effect as litigation continues with the Justice Department https://t.co/dmLU2EVlJV",
  "data/tweet-wsj/2021/10/1449174525996937216.json": "DC Comics said the new Superman will come out as bisexual in an upcoming issue, another example of how comic books have often been at the forefront of cultural shifts. Here's a look at key cultural moments in comic book history in the U.S. https://t.co/gl5ABfhChZ",
  "data/tweet-wsj/2021/10/1449178316901060608.json": "A walrus named Wally wandered far from his Arctic home, taking an epic European tour. He inspired walrus-themed souvenirs. He balanced a starfish on his nose. He relaxed in a speedboat. Then he needed to go home. https://t.co/qPZgRuUgjA",
  "data/tweet-wsj/2021/10/1449170753170051073.json": "U.S. workers handed in nearly 20 million resignations this spring and summer. \"Everybody quitting is saying, 'I became part of the Great Resignation.'\" https://t.co/NuJ8uj4rzq",
  "data/tweet-wsj/2021/10/1449261349058535427.json": "A Capitol Police officer was arrested Friday and accused of urging a man who participated in the Jan. 6 riot to cover his tracks on social media https://t.co/q6iGYf7ygR",
  "data/tweet-wsj/2021/10/1449268924231602180.json": "The popular show depicts a South Korean society where ‘only money matters,’ a North Korean propaganda site says https://t.co/UsnBdvgHKR",
  "data/tweet-wsj/2021/10/1449083939138715654.json": "A walrus named Wally wandered far from his Arctic home, taking an epic European tour. He inspired walrus-themed souvenirs. He balanced a starfish on his nose. He relaxed in a speedboat. Then he needed to go home. https://t.co/ZwbZXiiWRS",
  "data/tweet-wsj/2021/10/1448995108389523458.json": "A suicide bombing at a Shiite mosque in Afghanistan killed at least 30 worshipers, the latest attack since the withdrawal of U.S. troops https://t.co/TY48mgsVvL",
  "data/tweet-wsj/2021/10/1449321746096607235.json": "A mosquito-borne parasite has impoverished nations and stopped armies in their tracks https://t.co/XrByJfsUZN",
  "data/tweet-wsj/2021/10/1449231159993450498.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/QRuWp3lJlH https://t.co/sMno6idoNB",
  "data/tweet-wsj/2021/10/1449374658931924997.json": "Elon Musk is the world’s richest person—and he doesn’t want Jeff Bezos to forget it. When the Amazon founder tweeted an article about his company's success, Musk replied with this: \"🥈\" https://t.co/wEU2kDo5qp",
  "data/tweet-wsj/2021/10/1449355729543081985.json": "Costco, Home Depot and other big retailers have resorted to an extreme, and expensive, tactic to get around supply-chain snarls for the holidays: “Let’s just charter a ship.” https://t.co/G7qw03syQt",
  "data/tweet-wsj/2021/10/1449163267784458243.json": "Big Tobacco tried to hook kids early. Facebook has been accused of doing the same. In a video, @JoannaStern breaks down the often-used comparison of the two. https://t.co/5bl3r5pUhI",
  "data/tweet-wsj/2021/10/1449246260444160000.json": "From @WSJopinion: China is investing $1.4 trillion to overtake the West in critical technologies by 2025, writes Robert H. Bork Jr. But the winner may be clear by the time the next U.S. president is sworn in. https://t.co/ayjtJ3ImZc",
  "data/tweet-wsj/2021/10/1449416110428893191.json": "DC Comics said the new Superman will come out as bisexual in an upcoming issue, another example of how comic books have often been at the forefront of cultural shifts. Here's a look at key cultural moments in comic book history in the U.S. https://t.co/2gc8xZzsvF",
  "data/tweet-wsj/2021/10/1449446308822061065.json": "A North Korean propaganda website said “Squid Game,” Netflix’s top-watched show in more than 90 countries, “gained popularity because it exposes the reality of South Korean capitalist culture” https://t.co/QYQHA2bva5",
  "data/tweet-wsj/2021/10/1449453854056136708.json": "With her new single “Easy on Me” out after a six-year break from releasing music, Adele dives into a music industry transformed by streaming https://t.co/2PLjR7ZZei",
  "data/tweet-wsj/2021/10/1449457659317559297.json": "Taking a daily aspirin to prevent a first heart attack or stroke is no longer recommended for older adults, a U.S. panel said https://t.co/j7EnI61Mqc",
  "data/tweet-wsj/2021/10/1449480434149171200.json": "Microsoft said it would shut down LinkedIn in China, marking the end of the last major U.S. social-media network operating openly there https://t.co/RA53ODHoad",
  "data/tweet-wsj/2021/10/1449491611784724481.json": "South Korea’s dystopian drama “Squid Game” might become Netflix’s biggest hit ever. But for a decade, local studios rejected the fictionalized show’s pitch as too grotesque and too unrealistic. https://t.co/X9YVwdmgmk",
  "data/tweet-wsj/2021/10/1449499150417022982.json": "A mysterious rise in cases of teen girls with sudden severe physical tics, including jerking motions and verbal outbursts—and sometimes blurting out the word “beans”—led doctors to TikTok https://t.co/zEKXBMaZ8Q",
  "data/tweet-wsj/2021/10/1449306654290423812.json": "Take a look at the front page of today's Wall Street Journal https://t.co/N7rid9sBBW https://t.co/w0CjiyrRtC",
  "data/tweet-wsj/2021/10/1449423662604595201.json": "U.S. workers handed in nearly 20 million resignations this spring and summer. \"Everybody quitting is saying, 'I became part of the Great Resignation.'\" https://t.co/ljkdL1fLyR",
  "data/tweet-wsj/2021/10/1449533146031079435.json": "From @WSJopinion: To doubt a scientist is not to doubt science, writes Gary Saul Morson. Quite the contrary, personal authority is precisely what science dispenses with, as much as possible. https://t.co/rOeM9F5E60",
  "data/tweet-wsj/2021/10/1449548248742604803.json": "Chinese housing developers ran up trillions in debt. Now the ground is shifting under them. https://t.co/zwRAr7EfaN",
  "data/tweet-wsj/2021/10/1449540735997562880.json": "Boeing said it will mandate Covid-19 vaccination for its approximately 125,000 U.S. employees by the Dec. 8 deadline set by a presidential order requiring federal employees and contractors to receive the shots https://t.co/NJ9fQtI56B",
  "data/tweet-wsj/2021/10/1449570896226791430.json": "A businessman accused by American prosecutors of creating a global network of companies to help Venezuela’s government evade U.S. sanctions, was extradited to the U.S. https://t.co/id50jm4QSa",
  "data/tweet-wsj/2021/10/1449450137873436676.json": "The painting that British street artist Banksy purposely shredded during a 2018 auction sold Thursday for $25.4 million—18 times what the buyer of the pre-shredded piece paid for it https://t.co/TcmtqqMcPP",
  "data/tweet-wsj/2021/10/1449419945910181894.json": "Nigeria’s criminal gangs, flush with ransom money, are growing ever more brazen, stealing heavy munitions and extorting the government https://t.co/sU2H5rhDPn",
  "data/tweet-wsj/2021/10/1449385912710934534.json": "In debt and desperate to feed her family, a housecleaner in Afghanistan earning 70 cents a day is considering handing over her three-year-old daughter to pay her lender. “If life continues to be this awful, I will kill my children and myself.” https://t.co/XdFFBmXe1k",
  "data/tweet-wsj/2021/10/1449661499681746947.json": "A mysterious rise in cases of teen girls with sudden severe physical tics, including jerking motions and verbal outbursts—and sometimes blurting out the word “beans”—led doctors to TikTok https://t.co/TMZ8lntr7J",
  "data/tweet-wsj/2021/10/1449397244839538700.json": "China's Xi is launching his most extensive examination of the country's financial institutions, targeting their ties with private firms, people familiar said https://t.co/AKsFPKWCQT",
  "data/tweet-wsj/2021/10/1449703007931838471.json": "The U.S. Indian Health Service fought to keep secret the names of some agency officials who protected a pedophile pediatrician convicted of sexually abusing Native American boys in his care over two decades. The Journal has identified those officials. https://t.co/UFhAhFniUa",
  "data/tweet-wsj/2021/10/1449680362452525057.json": "California is racing to secure large amounts of power in the next few years to make up for the impending closure of fossil-fuel power plants and a nuclear facility that provides nearly 10% of the state’s electricity https://t.co/VZHzdLv9tI",
  "data/tweet-wsj/2021/10/1449729323406069763.json": "Facebook was counting on its artificial-intelligence system to make the platform work properly by enforcing its rules against violent or hate-filled speech. But its own documents show the system can't tell the difference between car crashes and cockfights. https://t.co/aDv0yJ0Glp",
  "data/tweet-wsj/2021/10/1449699235755143171.json": "From @WSJopinion: Democrats want to add benefits to a program already going broke. The surprise medical bill will come later in rationed care and higher taxes for the middle class. https://t.co/cm7m50IlO8",
  "data/tweet-wsj/2021/10/1449748325201219585.json": "Amazon will give corporate employees the option to work as many as four weeks a year remotely from anywhere in the country in which they are employed https://t.co/CfepzjgZtd",
  "data/tweet-wsj/2021/10/1449774588376850435.json": "Former President Bill Clinton, 75, was released from a California hospital on Sunday after several days of treatment for an infection https://t.co/7FVwU3vONE",
  "data/tweet-wsj/2021/10/1449740762049097734.json": "From @WSJopinion: Vicious cancel culture has swept across our educational system and the country. Children can’t thrive in environments like this, writes @EricaKomisarCSW. https://t.co/m2wVMYhhNT",
  "data/tweet-wsj/2021/10/1449778512227864580.json": "Has work taken over your life? Here’s how to reclaim control https://t.co/CH6AhBBhyY",
  "data/tweet-wsj/2021/10/1449755857529475082.json": "California is racing to secure large amounts of power to make up for the impending closure of fossil-fuel power plants and a nuclear facility that provides nearly 10% of the electricity generated in the state https://t.co/ZkisGj3cpC",
  "data/tweet-wsj/2021/10/1449721876444495880.json": "“I haven’t seen crazy strikes like this in a long time.” Traders have piled into wagers that U.S. oil prices will top $100, while some are betting Brent crude will hit $200 next year. https://t.co/gkZVRmetZc",
  "data/tweet-wsj/2021/10/1449752094894854147.json": "Economists on average see inflation at 5.25% in December, just slightly less than the rate that has prevailed since June. Assuming a similar level in October and November, that would mark the longest inflation has been above 5% since 1991. https://t.co/l2mgHzXFWb",
  "data/tweet-wsj/2021/10/1449348416316841984.json": "Myanmar’s military junta will be excluded from a regional summit in late October, foiling the regime’s latest bid for international legitimacy https://t.co/kubXBeeTEI",
  "data/tweet-wsj/2021/10/1449842715621986325.json": "Elon Musk is the world’s richest person—and he doesn’t want Jeff Bezos to forget it. When the Amazon founder tweeted an article about his company's success, Musk replied with this: \"🥈\" https://t.co/mzhjs7UXLP",
  "data/tweet-wsj/2021/10/1449823827396026371.json": "Investors and governments are shifting resources away from fossil fuels to cleaner sources, but renewables only fill a quarter of the world's energy needs. That could mean a volatile transition. https://t.co/Yg930JAFqm",
  "data/tweet-wsj/2021/10/1449854005883150339.json": "California is racing to secure large amounts of power in the next few years to make up for the impending closure of fossil-fuel power plants and a nuclear facility that provides nearly 10% of the state’s electricity https://t.co/hVPe3TG93H",
  "data/tweet-wsj/2021/10/1449872919958544386.json": "A mysterious rise in cases of teen girls with sudden severe physical tics, including jerking motions and verbal outbursts—and sometimes blurting out the word “beans”—led doctors to TikTok https://t.co/JN4nOR1Ehu",
  "data/tweet-wsj/2021/10/1449891758834339840.json": "From @WSJopinion: Can the constant assertion of alternative realities from Washington endure? Maybe. But cracks in this facade are starting to appear, writes @DanHenninger. https://t.co/aW91r4ujLZ",
  "data/tweet-wsj/2021/10/1449925755820036101.json": "What's worse than another Zoom meeting? A hybrid-office Zoom meeting https://t.co/fQzDbW8Uxi",
  "data/tweet-wsj/2021/10/1449895539072450564.json": "Adult children moved back in with their parents during the pandemic. It has been a financial learning experience for all of them. https://t.co/oXPGqPobRO",
  "data/tweet-wsj/2021/10/1449937040620101640.json": "When it comes to money, people typically think about what they spend and earn. Instead they should be thinking about real dollars, the purchasing power of that money after inflation. https://t.co/19hPDLR1Mf",
  "data/tweet-wsj/2021/10/1449944589922615297.json": "From @WSJopinion: Biden’s vaccine orders puts employers in a legal quandary. Whatever they do, they will be violating the law. This isn’t fair to businesses. https://t.co/e8oTe3Ibyg",
  "data/tweet-wsj/2021/10/1449957429052125185.json": "Take an early look at the front page of The Wall Street Journal https://t.co/tg4PmWotJ0 https://t.co/IJ6NJ6vDeW",
  "data/tweet-wsj/2021/10/1449684139641393154.json": "Nigeria’s criminal gangs, flush with ransom money, are growing ever more brazen, stealing heavy munitions and extorting the government https://t.co/l6B6icwVnn",
  "data/tweet-wsj/2021/10/1449899304848662530.json": "A surge in demand for fossil fuels shows a shift to cleaner sources is likely to be volatile for years to come https://t.co/heKVhN5mh7",
  "data/tweet-wsj/2021/10/1450080334960287745.json": "Colin Powell, a four-star general and first Black secretary of state, has died at 84 of Covid-19 complications, his family said on Facebook https://t.co/AL1dMlw72E",
  "data/tweet-wsj/2021/10/1450059105230626817.json": "China is preparing to sell U.S. dollar bonds, in a test of investor appetite after data showed the world’s second-largest economy is cooling rapidly https://t.co/qr3LY18EUh",
  "data/tweet-wsj/2021/10/1449978065170403332.json": "The social-media company sees the virtual realm as a key component of its future and a major driver of new technology investment https://t.co/8vYdWkHBlW",
  "data/tweet-wsj/2021/10/1450095607713079297.json": "The World Bank failed to protect two employees who filed sexual-harassment allegations against a high-ranking official who is now a presidential candidate in Costa Rica, an internal tribunal found https://t.co/IoFG473IGq",
  "data/tweet-wsj/2021/10/1450133432810582032.json": "The Texas legislature passed a bill that bans transgender public-school students from competing in interscholastic sports leagues that are designated for a gender other than the one listed on their birth certificates https://t.co/SyyQXalVy8",
  "data/tweet-wsj/2021/10/1450084297197686784.json": "Microsoft executives in 2008 discovered emails between Bill Gates and a female employee that they deemed inappropriate, people familiar said. They told Gates to stop and briefed some board members, who took no further action, the people say. https://t.co/IMLurNz3eJ",
  "data/tweet-wsj/2021/10/1450295677146341383.json": "Washington State fired football coach Nick Rolovich Monday for failing to comply with their state’s vaccination mandate https://t.co/UPgut5P2qD",
  "data/tweet-wsj/2021/10/1450159905604788230.json": "Alphabet CEO Sundar Pichai speaks with WSJ Editor in Chief @murraymatt at #WSJTechLive https://t.co/KBYzyeKnQc",
  "data/tweet-wsj/2021/10/1450310778284822529.json": "The Texas legislature has passed a bill that bans transgender public-school students from competing in interscholastic sports leagues that are designated for a gender other than the one listed on their birth certificates https://t.co/o8sAqIFPgW",
  "data/tweet-wsj/2021/10/1450322086778507265.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/4GIoUSFBbG",
  "data/tweet-wsj/2021/10/1450288111741702145.json": "California recorded its driest year in a century, marked by above-average wildfires, extreme heat and extended droughts https://t.co/WyH0TXOCMD",
  "data/tweet-wsj/2021/10/1450371158445072386.json": "Microsoft executives in 2008 discovered emails between Bill Gates and a female employee that they deemed inappropriate, people familiar said. They told Gates to stop and briefed some board members, who took no further action, the people say. https://t.co/83XOXow12x",
  "data/tweet-wsj/2021/10/1450172351316910084.json": "Google CEO Sundar Pichai said the U.S. government should take a more active role in policing cyberattacks: “If not, you’re going to see more of it because countries would resort to those things.” https://t.co/7cPNHgGF1u",
  "data/tweet-wsj/2021/10/1450421486783770624.json": "Procter &amp; Gamble is raising prices on a host of household staples as costs for freight and raw materials rise faster than it anticipated https://t.co/24DsBwUqdf",
  "data/tweet-wsj/2021/10/1450469337651945473.json": "“Survivors are not the same as the unvaccinated…There should be a third category.” Some workers are asking that immunity from prior infection be recognized alongside vaccination as protection against Covid-19. https://t.co/UinuVKHi4k",
  "data/tweet-wsj/2021/10/1450476887508148224.json": "“It was easier to get aid across the border in the middle of a war than it is to get food into Europe.” Brexit is starting to wear on British trade. https://t.co/sMPZb7HgZn",
  "data/tweet-wsj/2021/10/1450457293242474497.json": "Chinese President Xi Jinping is facing strong resistance over a broad property-tax plan and is now settling for a more limited rollout, people familiar with the matter said https://t.co/AwrorfyvPi",
  "data/tweet-wsj/2021/10/1450514665142988802.json": "Sexual desire is lower than it’s been at any point during the pandemic for people who are feeling stressed, a new study says. To rekindle your relationship, sex therapists advise to just start touching. https://t.co/key8aCKMd4",
  "data/tweet-wsj/2021/10/1450459235733671937.json": "Manhattan median housing prices have moved back to where they were before the pandemic. The housing market in Brooklyn and Queens is also booming. https://t.co/GSBoomyiXh",
  "data/tweet-wsj/2021/10/1450205049125212166.json": "Jury selection began Monday in the trial of three men charged in the killing of Ahmaud Arbery, a 25-year-old Black man who was chased and fatally shot in February 2020 while out jogging in southeast Georgia https://t.co/VusCDEtSKf",
  "data/tweet-wsj/2021/10/1450575006640005127.json": "Netflix added 4.4 million memberships in the third quarter, more than the 3.5 million it had forecast, as viewers flocked to the streaming service with the return of popular series and new hits such as “Squid Game”\nhttps://t.co/DskAIzjNRG",
  "data/tweet-wsj/2021/10/1450607716129558530.json": "When Facebook's services went offline for as much as six hours in early October, engagement with Netflix increased by 14%, the streaming giant said, reflecting the hypercompetitive dynamic it operates in https://t.co/incDw3oweR",
  "data/tweet-wsj/2021/10/1450617775416807427.json": "Netflix says \"Squid Game\" has become its most popular show ever, helping drive the company's 4.4 million new memberships in the third quarter https://t.co/CN7wSy09ft",
  "data/tweet-wsj/2021/10/1450610220166750216.json": "Travis Tritt, the country music singer, is canceling several upcoming shows at venues with Covid-19 restrictions such as face-mask or vaccination requirements https://t.co/BfJ2IgQjkq",
  "data/tweet-wsj/2021/10/1450627937842126857.json": "Sexual desire is lower than it’s been at any point during the pandemic for people who are feeling stressed, a new study says. To rekindle your relationship, sex therapists advise to just start touching. https://t.co/ET1E3iM8gN",
  "data/tweet-wsj/2021/10/1450639175770902528.json": "“Survivors are not the same as the unvaccinated…There should be a third category.” Some workers are asking that immunity from prior infection be recognized alongside vaccination as protection against Covid-19. https://t.co/5d4Z2u56al",
  "data/tweet-wsj/2021/10/1450688260611661827.json": "Sexual desire is lower than it’s been at any point during the pandemic for people who are feeling stressed, a new study says. To rekindle your relationship, sex therapists advise to just start touching. https://t.co/0n8L8dhyZn",
  "data/tweet-wsj/2021/10/1450725996337016833.json": "Jack Ma is in Europe to see friends, taste wines and conduct business meetings, people familiar with the matter say  https://t.co/uArqedSWq5",
  "data/tweet-wsj/2021/10/1450212983255277569.json": "NBA star Carmelo Anthony speaks with WSJ’s @jasongay at #WSJTechLive https://t.co/zYqRroTHRA",
  "data/tweet-wsj/2021/10/1450615271635435523.json": "A House committee has voted to recommend holding Steve Bannon in criminal contempt for defying a subpoena tied to a probe of the Jan. 6 Capitol riot\nhttps://t.co/toVdonYzH6",
  "data/tweet-wsj/2021/10/1450766263425409025.json": "New York City Mayor Bill de Blasio plans to announce an order that would mean some 46,000 city workers need to get their first shot by Oct. 29 or potentially lose their jobs. The city’s roughly 8,000 corrections workers have until Dec. 1 to get shots. https://t.co/NT0InrPsYQ",
  "data/tweet-wsj/2021/10/1450549428545335300.json": "General Electric, Union Pacific and other large U.S. employers are imposing Covid-19 vaccine mandates for their workers to comply with a deadline set by the Biden administration for federal contractors https://t.co/I2wpzOs8Yw",
  "data/tweet-wsj/2021/10/1450805282548994056.json": "Amherst College is abandoning its policy of giving preference to applicants whose parents attended the Massachusetts liberal-arts school, placing it among the first elite private colleges to ditch legacy admissions https://t.co/ou1GrjYQQe",
  "data/tweet-wsj/2021/10/1450847185784954880.json": "Washington, D.C.’s attorney general filed a motion to add Facebook CEO Mark Zuckerberg as a defendant in a  lawsuit accusing Facebook of misleading its users about the security of their personal data  https://t.co/9IVpkqX4zW",
  "data/tweet-wsj/2021/10/1450869452946513920.json": "San Francisco’s health department said it gave a final violation notice and closure notice to an In-N-Out restaurant that wasn’t checking customers’ vaccination status. The company responded: “We refuse to become the vaccination police for any government.” https://t.co/04gqpEtSwB",
  "data/tweet-wsj/2021/10/1450884541707608066.json": "Europeans had crossed the Atlantic to reach the Americas as far back as the year 1021, a new analysis of ancient artifacts shows https://t.co/2bWIUi59B1",
  "data/tweet-wsj/2021/10/1450850550912802821.json": "From @WSJopinion: Biden’s plan would sock it to the ‘working rich,’ whose taxes are already high, not billionaire investors, writes @CliffordAsness https://t.co/327hAXu3kl",
  "data/tweet-wsj/2021/10/1450875341258510337.json": "PayPal is in talks to buy social-media platform Pinterest, people familiar with the matter said, a move that would take the payments giant in a new direction https://t.co/3wVInyICrv",
  "data/tweet-wsj/2021/10/1450877003175976960.json": "Two New York lawyers pleaded guilty in federal court to a charge related to their participation in a Molotov cocktail attack on an empty police car last year https://t.co/mkevsRUCr5",
  "data/tweet-wsj/2021/10/1450829186084573189.json": "Sexual desire is lower than it’s been at any point during the pandemic for people who are feeling stressed, a new study says https://t.co/r2Ax1zPtAJ",
  "data/tweet-wsj/2021/10/1450930501892681732.json": "Breaking: The FDA authorized Moderna and Johnson &amp; Johnson Covid-19 booster shots and said people can receive an extra dose that is different from the vaccine they initially took. The shots could become available in the coming days. https://t.co/ItVYYxth0w",
  "data/tweet-wsj/2021/10/1450901140275617794.json": "Democrats’ planned tax increases on businesses and high-income people are in jeopardy due to Sen. Sinema’s opposition, people familiar with the matter said https://t.co/sq3AoMOkSX",
  "data/tweet-wsj/2021/10/1450926066088955919.json": "From @WSJopinion: “Americans must resist cancel culture at every turn. The freedoms we do not defend today will be the freedoms we do not have tomorrow,” writes Joseph Silverstein, a student at Cornell University. https://t.co/lfGyKC5L87",
  "data/tweet-wsj/2021/10/1450941168427098122.json": "A Republican member of the Securities and Exchange Commission criticized the agency’s approach to regulating the cryptocurrency industry, saying the SEC should be making more of an effort to work with crypto firms to establish rules they can comply with https://t.co/xKIGorxqr0",
  "data/tweet-wsj/2021/10/1450994027889938447.json": "Vikings crossed the Atlantic and lived in North America as early as 1021, scientists found by analyzing artifacts with a new radiocarbon dating technique https://t.co/sr16fnAMi4",
  "data/tweet-wsj/2021/10/1450971382360256512.json": "When Jamie Foxx would get into trouble for performing monologues at school, his adoptive mother negotiated with teachers to let him tell jokes: “Yeah, I know,” she said, “But the boy is special.” https://t.co/D6d57L9AX0",
  "data/tweet-wsj/2021/10/1450997796157497346.json": "Europeans had crossed the Atlantic to reach the Americas as far back as the year 1021, a new analysis of ancient artifacts shows https://t.co/Nds5EshMY9",
  "data/tweet-wsj/2021/10/1451020447076831246.json": "Russian President Vladimir Putin ordered people stay off work for at least a week, beginning Oct. 30 and stretching to Nov. 7, to encourage people to stay home and slow the spread of Covid-19 https://t.co/xIRfdKd21F",
  "data/tweet-wsj/2021/10/1451035545174478850.json": "San Francisco’s health department said it gave a final violation notice and closure notice to an In-N-Out restaurant that wasn’t checking customers’ vaccination status. The company responded: “We refuse to become the vaccination police for any government.” https://t.co/sf9XOukCDo",
  "data/tweet-wsj/2021/10/1451028002947616769.json": "Europeans had crossed the Atlantic to reach the Americas as far back as the year 1021, a new analysis of ancient artifacts shows https://t.co/fCAIQZPuvL",
  "data/tweet-wsj/2021/10/1450978936117149701.json": "Sen. Kyrsten Sinema has emerged as one of the most powerful Democrats in Washington, with her concerns about the size and funding for Democrats’ social policy and climate package dictating what the party will be able to pass https://t.co/yKSnhixKyn",
  "data/tweet-wsj/2021/10/1451050671600508934.json": "A Taliban commander used to run suicide-bombing squads in Kabul. Today he is busy mediating domestic disputes and fielding complaints about stolen cars as a chief of police for the Afghan capital. https://t.co/NdJ7loYbhO",
  "data/tweet-wsj/2021/10/1451073293327470603.json": "Amherst College is abandoning its policy of giving preference to applicants whose parents attended the Massachusetts liberal-arts school, placing it among the first elite private colleges to ditch legacy admissions https://t.co/NAkBDssMWL",
  "data/tweet-wsj/2021/10/1451031768769994752.json": "Two New York lawyers pleaded guilty in federal court to a charge related to their participation in a Molotov cocktail attack on an empty police car last year https://t.co/EAZXls6aTP",
  "data/tweet-wsj/2021/10/1451182888045645825.json": "Pfizer-BioNTech's Covid-19 booster shot was 95.6% effective in a large study that took place while the Delta variant was prevalent, the companies say https://t.co/eHSkUTTVYE",
  "data/tweet-wsj/2021/10/1451178981760409600.json": "South Korea launched its first homegrown rocket into space, harnessing a technology few countries possess and which can be used to expand Seoul’s military satellite surveillance of North Korea https://t.co/imuPiCktWX",
  "data/tweet-wsj/2021/10/1451105738198327299.json": "Russia’s Putin ordered people to stay off work for at least a week as Covid-19 cases surge in the country https://t.co/W2zR1zRRTJ",
  "data/tweet-wsj/2021/10/1451194090641448970.json": "“The Democrats have the majority right now, why don’t they pull the trigger?” Democratic voters are impatient for passage of President Biden's spending package. https://t.co/KJlrKljqGG",
  "data/tweet-wsj/2021/10/1451024219228278785.json": "Democrats’ planned tax increases on businesses and high-income people are in jeopardy due to Sen. Sinema’s opposition, people familiar with the matter said https://t.co/5XKHBfMihw",
  "data/tweet-wsj/2021/10/1451229526445510668.json": "Former President Donald Trump unveiled a new digital-media venture that will create a social network called Truth Social to fight such companies as Facebook and Twitter. He said the venture would go public by merging with a SPAC. https://t.co/jpmnjhF7bE",
  "data/tweet-wsj/2021/10/1451201894576177153.json": "Parents say their kids are begging to watch the bloody Netflix hit “Squid Game.” Some think that trying to shield their children from the show entirely is a losing battle. “If it gets really bad we turn it off or I can throw a blanket over his head.” https://t.co/rg2kW8VoeD",
  "data/tweet-wsj/2021/10/1451315143183409153.json": "Human remains found in a Florida wildlife reserve are those of Brian Laundrie, a person of interest in the death of his fiancée Gabby Petito, the FBI said Thursday https://t.co/rm7fiwccUM",
  "data/tweet-wsj/2021/10/1451282501587116033.json": "Breaking: The House voted to hold Steve Bannon in criminal contempt of Congress for refusing to comply with a subpoena from the panel investigating the Jan. 6 riot https://t.co/2Qoi6XeF6t",
  "data/tweet-wsj/2021/10/1451269594841239555.json": "Shares of Digital World Acquisition, the special-purpose acquisition company taking former President Donald Trump’s new social-media platform public, more than quadrupled to $44 https://t.co/MMhVJQpgbP",
  "data/tweet-wsj/2021/10/1451376521063587842.json": "President Biden said he would consider deploying the National Guard to assist with supply-chain bottlenecks that have led to shortages and higher consumer costs https://t.co/3dsR1cBIFL",
  "data/tweet-wsj/2021/10/1451386588534091777.json": "American Airlines and Southwest plan to allow employees with approved medical or religious reasons for avoiding vaccinations to continue working https://t.co/9VGPYBKfJ1",
  "data/tweet-wsj/2021/10/1451395459021422592.json": "Alec Baldwin discharged a prop gun that killed one person and injured another on the New Mexico film set of “Rust,” according to the Santa Fe County Sheriff’s Office https://t.co/YJ0dAd2pjc",
  "data/tweet-wsj/2021/10/1451394137643786243.json": "The NBA is in hot water in China again after the Boston Celtics’ Enes Kanter advocated for Tibetan independence and called China’s leader a brutal dictator https://t.co/hCdT0sNFCl",
  "data/tweet-wsj/2021/10/1451293494866333708.json": "Houston’s pension fund for firefighters said it bought $25 million worth of bitcoin and ether for its defined-benefit plan’s portfolio https://t.co/opQ12mn8Bw",
  "data/tweet-wsj/2021/10/1451217971301519361.json": "Kiss frontman Gene Simmons is putting his Las Vegas home on the market for $14.95 million, less than a year after buying the roughly 11,000-square-foot property. He said his wife and children are \"not fans of 115-degree weather.” https://t.co/vBAOSKPbLQ",
  "data/tweet-wsj/2021/10/1451435681180495875.json": "Alec Baldwin discharged a prop gun that killed one person and injured another on the New Mexico film set of “Rust,” according to the Santa Fe County Sheriff’s Office https://t.co/Ex70qvdD2J",
  "data/tweet-wsj/2021/10/1451515360272916508.json": "Alec Baldwin discharged a prop gun that killed a crew member and wounded the director on the set of the film “Rust,” according to the Santa Fe County Sheriff’s Office. A Baldwin spokesperson told AP the shooting was accidental. #WSJWhatsNow https://t.co/FtdR5RGSlj",
  "data/tweet-wsj/2021/10/1451526279988191248.json": "K-Pop juggernaut BTS has a new distribution and marketing deal with Universal, the world’s largest music company https://t.co/GT7D1c8bQX",
  "data/tweet-wsj/2021/10/1451534438370795522.json": "A range of people—from nurses to firefighters to students—have filed lawsuits objecting to mandatory Covid-19 vaccinations, claiming the policies infringe on their constitutional rights. Nearly every legal challenge has failed so far. https://t.co/LxepwMMZd5",
  "data/tweet-wsj/2021/10/1451586194068975617.json": "Alec Baldwin expressed his shock and sadness after a woman was killed when he discharged a prop gun on a film set. He said he's cooperating with the police. https://t.co/R9BLzx3nGA",
  "data/tweet-wsj/2021/10/1451545132558344193.json": "Pfizer and BioNTech released new data showing their vaccine was 90.7% effective at preventing symptomatic Covid-19 in a study of children 5 to 11 years old. The companies said the vaccine was found to be safe and tolerable. https://t.co/ImSB6qLi1E",
  "data/tweet-wsj/2021/10/1451582899594174490.json": "Tributes, anguish and disbelief poured in on Friday for Halyna Hutchins, who was shot while working on the western “Rust” https://t.co/3gKevtrCDq",
  "data/tweet-wsj/2021/10/1451575349393825800.json": "Some vaccine holdouts are healthcare workers who would rather lose their jobs than submit to a mandate. “The government shouldn’t be telling us what to do.” https://t.co/uYoMGYpOCU",
  "data/tweet-wsj/2021/10/1451697414654631937.json": "Ukrainian cinematographer Halyna Hutchins, who was shot with a prop gun fired by Alec Baldwin on a New Mexico film set, was rising to the upper ranks of her male-dominated field https://t.co/03UpSiOzcu",
  "data/tweet-wsj/2021/10/1451715047273684994.json": "Philadelphia isn't just a historic heavyweight of a city—it's a booming cultural and culinary destination, too. To help you devise your own first-class field trip, we enlisted expert guidance. https://t.co/GoJegdfBSX",
  "data/tweet-wsj/2021/10/1451687331870789634.json": "Watch an exclusive aerial video illustrating the scope of the problem at California's Port of Los Angeles and the complexities of the process of unloading container ships https://t.co/WOffAryWPC",
  "data/tweet-wsj/2021/10/1451752781451309060.json": "Alec Baldwin was told by an assistant director that a prop was a \"cold gun\" before a fatal shooting on set of the film \"Rust,\" according to a search warrant affidavit prepared by a detective with the Santa Fe County Sheriff’s Office https://t.co/rocgBwjTOn",
  "data/tweet-wsj/2021/10/1451767863577128964.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/WsthuuDqxe https://t.co/m63AXoCsG7",
  "data/tweet-wsj/2021/10/1451805640003887109.json": "One hundred years after the first World Series was broadcast on the radio, listening to baseball may still be the best way to experience the game https://t.co/tXL5gdqREA",
  "data/tweet-wsj/2021/10/1451677282981064713.json": "A range of people—from nurses to firefighters to students—have filed lawsuits objecting to mandatory Covid-19 vaccinations, claiming the policies infringe on their constitutional rights. Nearly every legal challenge has failed so far. https://t.co/i4l3gZh4vt",
  "data/tweet-wsj/2021/10/1451643757623980032.json": "The Border Patrol made about 1.66 million arrests of migrants at the U.S.-Mexico border in the 2021 fiscal year, the highest annual number ever recorded https://t.co/dUfFHftUY3",
  "data/tweet-wsj/2021/10/1451869785613025283.json": "For decades, \"superstar cities\" have been attracting talent and money. But thanks to remote work, their status may change, bringing tech expertise to places that have long tried to attract it. https://t.co/hvPZ1PivLP",
  "data/tweet-wsj/2021/10/1451911407042187266.json": "Vikings crossed the Atlantic and lived in North America as early as 1021, scientists found by analyzing artifacts with a new radiocarbon dating technique https://t.co/6UK3J0IWZy",
  "data/tweet-wsj/2021/10/1451888685054677000.json": "Procter &amp; Gamble is raising prices on a host of household staples, as costs for freight and raw materials rise faster than anticipated https://t.co/ThdRovlxvL",
  "data/tweet-wsj/2021/10/1451933980857667585.json": "A San Francisco In-N-Out Burger wasn’t checking customers’ vaccination status. After the health department issued a final violation notice, the company responded: “We refuse to become the vaccination police.” https://t.co/A7ecRw4GxN",
  "data/tweet-wsj/2021/10/1451930185889107976.json": "A 12-year-old girl’s video challenged Mexico’s coronavirus czar over a policy against vaccinating minors. A week after Zulma Gonzalez’s plea, Mexico agreed to vaccinate up to 1 million at-risk minors. https://t.co/FjsTAbnudc",
  "data/tweet-wsj/2021/10/1451915089141977094.json": "Essay: Despite the stereotypes, Millennials aren’t social justice warriors and Baby Boomers aren’t climate skeptics. If we’re going to work together, it’s time to get past generational myths. https://t.co/NfBqpkiMjk",
  "data/tweet-wsj/2021/10/1451960394650685443.json": "“Survivors are not the same as the unvaccinated…There should be a third category.” Some workers are asking that immunity from prior infection be recognized alongside vaccination as protection against Covid-19. https://t.co/uQMAR8VeFp",
  "data/tweet-wsj/2021/10/1451994382643703810.json": "Facebook's services are used to spread religious hatred in India, internal documents show. Company researchers identified calls to violence that coincided with the 2020 riots in Delhi that left 53 dead. https://t.co/zad9WLPAQB",
  "data/tweet-wsj/2021/10/1451979251624955911.json": "The American bumblebee was once the most commonly observed bumblebee in the U.S., but its population has plummeted. Efforts are under way to save the biologically important species. https://t.co/kShvd3gJbn",
  "data/tweet-wsj/2021/10/1452001932000780297.json": "Pfizer-BioNTech's Covid-19 booster shot was 95.6% effective in a large study that took place while the Delta variant was prevalent, the companies said https://t.co/OPQ6U3kyqm",
  "data/tweet-wsj/2021/10/1452027068414414849.json": "A 12-year-old girl’s video challenged Mexico’s coronavirus czar over a policy against vaccinating minors. “I’ve learned you have to stand up for yourself in this world. Now, I’m standing up for others who want the vaccine.” https://t.co/6IyO2WAfD7",
  "data/tweet-wsj/2021/10/1451967918162518016.json": "Essay: One hundred years after the first World Series was broadcast on the radio, listening to baseball may still be the best way to experience the game https://t.co/PBKx8erO21",
  "data/tweet-wsj/2021/10/1451986893718052866.json": "A Taliban commander used to run suicide-bombing squads in Kabul. Today he is busy mediating domestic disputes and fielding complaints about stolen cars as a chief of police for the Afghan capital. https://t.co/JHBhFHOnRQ",
  "data/tweet-wsj/2021/10/1452009482444316677.json": "From @WSJopinion: The public school system weighs on parents, writes Philip Hamburger. It burdens them not simply with poor teaching and discipline, but with political bias, hostility toward religion, and now even sexual and racial indoctrination. https://t.co/fTuvVNyz0P",
  "data/tweet-wsj/2021/10/1452081179339984902.json": "Preppy style may go dormant for periods, but it always comes roaring back, as evidenced in some of the unlikeliest collections this fall https://t.co/YswOQTEihN",
  "data/tweet-wsj/2021/10/1452103826555785220.json": "The American bumblebee was once the most commonly observed bumblebee in the U.S., but its population has plummeted. Efforts are under way to save the biologically important species. https://t.co/O103IlLYL8",
  "data/tweet-wsj/2021/10/1452137827911835649.json": "Facebook's services are used to spread religious hatred in India, internal documents show. Company researchers identified calls to violence that coincided with the 2020 riots in Delhi that left 53 dead. https://t.co/C37FgAYpUY",
  "data/tweet-wsj/2021/10/1452058510418665472.json": "Watch an exclusive aerial video illustrating the scope of the problem at California's Port of Los Angeles and the complexities of the process of unloading container ships https://t.co/FpYKSpxRIg",
  "data/tweet-wsj/2021/10/1452175549749682176.json": "Donald Trump’s planned digital-media venture could quickly become a serious competitor in a crowded field of right-leaning sites and social networks, thanks to the former president’s prominence and online following https://t.co/6fGFN16Kfb",
  "data/tweet-wsj/2021/10/1452239740061863938.json": "Stanford joined a group of highly selective colleges and universities that are offering digitally taught college courses in an effort to target talented high-school students in disadvantaged communities https://t.co/kiCzgSumCu",
  "data/tweet-wsj/2021/10/1452228397409705999.json": "A 12-year-old girl’s video challenged Mexico’s coronavirus czar over a policy against vaccinating minors. A week after Zulma Gonzalez’s plea, Mexico agreed to vaccinate up to 1 million at-risk minors. https://t.co/WHFqDkIFEW",
  "data/tweet-wsj/2021/10/1452251058823106564.json": "Rhode Island plans to be the first state to establish sites for users to safely inject drugs in the presence of healthcare workers—a move aimed at embracing harm reduction over criminalization  https://t.co/7Wda1wKhBz",
  "data/tweet-wsj/2021/10/1452277460888920072.json": "Facebook's services are used to spread religious hatred in India, internal documents show. Company researchers identified calls to violence that coincided with the 2020 riots in Delhi that left 53 dead. https://t.co/z0aQIChLcX",
  "data/tweet-wsj/2021/10/1452273724397342733.json": "With one of the world’s highest Covid-19 vaccination rates, Portugal is learning to live with the virus and being watched by other countries as a possible way forward https://t.co/4U4C3VYUNT",
  "data/tweet-wsj/2021/10/1452285443563790346.json": "Single Americans are seeking homes, but the pool of available options is shrinking. “I’ll never be able to catch up,” said a 34-year-old software engineer in Austin, Texas. “How much I’m able to save isn’t fast enough for how fast costs are rising.” https://t.co/20oNc9LJNr",
  "data/tweet-wsj/2021/10/1452281243798851599.json": "Working in his Los Angeles studio, former Beatles drummer Ringo Starr has continued to make joyous new music during the pandemic. https://t.co/WQ0ZDK7qw0",
  "data/tweet-wsj/2021/10/1452288871362961440.json": "California recorded its driest year in a century, marked by above-average wildfires, extreme heat and extended droughts https://t.co/2YbNRHQZbH",
  "data/tweet-wsj/2021/10/1452269913402449922.json": "From @WSJopinion: Future View: At best, cancel culture is a kind of chronic petulance. At worst, it is the antithesis of free speech. https://t.co/YVrw5P3utH",
  "data/tweet-wsj/2021/10/1452243491875082244.json": "Britain went all in on renewables and natural gas, leaving it vulnerable when winds died down and global gas supply ran low https://t.co/9ZzDGymKCl",
  "data/tweet-wsj/2021/10/1452300627674025992.json": "The Atlanta Braves advanced to their first World Series in more than 20 years, beating the heavily favored Los Angeles Dodgers in the National League and capping a remarkable recovery from the loss of their best player https://t.co/deXU13H11O",
  "data/tweet-wsj/2021/10/1452311487612133385.json": "A Taliban commander used to run suicide-bombing squads in Kabul. Today he is busy mediating domestic disputes and fielding complaints about stolen cars as a chief of police for the Afghan capital. https://t.co/VRB334o2Ki",
  "data/tweet-wsj/2021/10/1452305885179494401.json": "Companies behind staple foods said consumers can expect higher prices at the grocery store. But as @WSJheard explains, there may be a limit to how much customers will tolerate. https://t.co/HoJK1F64y9  #WSJWhatsNow https://t.co/ehPYoEuQCi",
  "data/tweet-wsj/2021/10/1452298528907304961.json": "The NFL’s investigation into allegations of serial misconduct and sexual harassment at the Washington Football Team ended months ago without a written report. Recent events have prompted a reinvigorated question: Why? https://t.co/oBs0vFK8Hz",
  "data/tweet-wsj/2021/10/1452292582348886016.json": "Since launching Tuesday, the ProShares Bitcoin Strategy ETF has amassed $1.2 billion in investor assets, the quickest billion-dollar fundraising on record. But that success is almost certain to come at fundholders’ expense, analysts say. https://t.co/eOiajerpar",
  "data/tweet-wsj/2021/10/1452307666815102977.json": "Online gambling operators are spending hundreds of millions of dollars on marketing, putting sports wagering in front of the American consumer. Some regulators are expressing concern. https://t.co/oRX9naVuv8",
  "data/tweet-wsj/2021/10/1452073613742444545.json": "In 2018, a former teacher went to Puerto Rico to help victims of Hurricanes Irma and Maria rebuild. She is still there helping. “There’s a lot more work that’s needed to be done.” https://t.co/YLoOTfdXNA",
  "data/tweet-wsj/2021/10/1452322762509389833.json": "Vikings crossed the Atlantic and lived in North America as early as 1021, scientists found by analyzing artifacts with a new radiocarbon dating technique https://t.co/4iTwYRJWB5",
  "data/tweet-wsj/2021/10/1452319086118064133.json": "Kiss frontman Gene Simmons is putting his Las Vegas home on the market for $14.95 million, less than a year after buying the roughly 11,000-square-foot property. He said his wife and children are \"not fans of 115-degree weather.\" https://t.co/lCkb7jpV83",
  "data/tweet-wsj/2021/10/1452332417063301127.json": "A San Francisco In-N-Out Burger wasn’t checking customers’ vaccination status. After the health department issued a final violation notice, the company responded: “We refuse to become the vaccination police.” https://t.co/JtrQWlwRxU",
  "data/tweet-wsj/2021/10/1452337759134392332.json": "Dr. Anthony Fauci said Covid-19 vaccines could be available for children ages 5 to 11 by early November https://t.co/GPYwlvSMy1",
  "data/tweet-wsj/2021/10/1452213324037427207.json": "A Republican member of the Securities and Exchange Commission criticized the agency’s approach to regulating the cryptocurrency industry, saying the SEC should be making more of an effort to work with crypto firms to establish rules they can comply with https://t.co/nBFXvP814T",
  "data/tweet-wsj/2021/10/1452361007305826312.json": "A new annual tax on billionaires’ unrealized capital gains is likely to be included to help pay for the vast social policy and climate package being finalized this weekend, senior Democrats said https://t.co/SifB84Y8RM",
  "data/tweet-wsj/2021/10/1452349330908749830.json": "Facebook employees say content rules aren't always enforced for Breitbart and other right-wing publishers for fear of public blowback, internal documents show https://t.co/IykasbBxwo",
  "data/tweet-wsj/2021/10/1452341662236258305.json": "Brexit is starting to wear on British trade. “Your profitability is knocked out the window straight away.” https://t.co/wTAed0tP3b",
  "data/tweet-wsj/2021/10/1452368059302297603.json": "Procter &amp; Gamble is raising prices on a host of household staples, as costs for freight and raw materials rise faster than anticipated https://t.co/4uxbtVBK9j",
  "data/tweet-wsj/2021/10/1451665938277863430.json": "Federal Reserve Chairman Jerome Powell indicated he is now somewhat more concerned about higher inflation and said that the central bank would watch carefully for signs that households and businesses were expecting sustained price pressures to continue https://t.co/dZS2BQm773",
  "data/tweet-wsj/2021/10/1452390694035673089.json": "Surging cotton prices could make clothing more expensive for consumers #WSJWhatsNow https://t.co/IJiAR0kwNQ",
  "data/tweet-wsj/2021/10/1452436005320077324.json": "Stanford has joined about a dozen highly selective colleges and universities to offer digital college courses in an effort to reach high-school students in economically disadvantaged communities https://t.co/ssDbqxA08u",
  "data/tweet-wsj/2021/10/1452466197887336451.json": "A new annual tax on billionaires’ unrealized capital gains is likely to be included to help pay for the vast social policy and climate package being finalized this weekend, senior Democrats said https://t.co/fWBqQG8PSW",
  "data/tweet-wsj/2021/10/1452451112649375745.json": "Facebook’s oversight board rebuked the company for not being forthcoming about exempting high-profile users from its rules, following a WSJ investigation https://t.co/EX3B3bCKGI",
  "data/tweet-wsj/2021/10/1452458664908963841.json": "Covid-19 has left China’s economy even more reliant on the Western world, worsening economic imbalances that Chinese leaders are struggling to address https://t.co/ADNDI534mA",
  "data/tweet-wsj/2021/10/1452537946276605956.json": "Tesla supplier Panasonic showed off for the first time a larger lithium-ion battery that it plans to supply to the U.S. electric-vehicle maker https://t.co/I6RoeVI4Hd",
  "data/tweet-wsj/2021/10/1452560611070681095.json": "A San Francisco In-N-Out Burger wasn’t checking customers’ vaccination status. After the health department issued a final violation notice, the company responded: “We refuse to become the vaccination police.” https://t.co/y8jeRpJNHG",
  "data/tweet-wsj/2021/10/1452405807404961792.json": "California is trying to eliminate gender bias in the toy aisle with a new law requiring retailers to have gender-neutral sections of children’s items and toys, a move that's gaining traction with parents https://t.co/733GDz43s1",
  "data/tweet-wsj/2021/10/1452575711445889025.json": "Amnesty International said it will pull out of Hong Kong, citing a sweeping national security law that China imposed on the city  https://t.co/ini275Udui",
  "data/tweet-wsj/2021/10/1452473769256095747.json": "“We’re attracted to authenticity.\" How Larry David, the lovable \"Curb Your Enthusiasm\" curmudgeon, became a genuine fashion icon https://t.co/egPAI8hziN",
  "data/tweet-wsj/2021/10/1452303934492663815.json": "Prop weapons are in focus after an accident involving Alec Baldwin killed one filmmaker and injured another on a set in New Mexico. Here's what to know about them. https://t.co/5COutH06qp",
  "data/tweet-wsj/2021/10/1452600073741869058.json": "A bomb cyclone and an intense band of rain, known as an atmospheric river, hit Northern California on Sunday, flooding streets and causing mudslides #WSJWhatsNow https://t.co/IQu1jdI63U",
  "data/tweet-wsj/2021/10/1452639869499592704.json": "Former ESPN reporter Allison Williams is joining conservative news site The Daily Wire after leaving the sports network because of its Covid-19 vaccine mandate https://t.co/19Hgid3ZQj",
  "data/tweet-wsj/2021/10/1452632341755703312.json": "Federal judges would be required to report stock trades over $1,000 within 45 days and post their financial-disclosure forms online under legislation proposed by a bipartisan group of lawmakers in Congress https://t.co/yO3soZJeAq",
  "data/tweet-wsj/2021/10/1452609664454123525.json": "Australia is considering new data-privacy rules that could make it illegal for social-media companies like Facebook to direct children to harmful content https://t.co/3AKvGmKqis",
  "data/tweet-wsj/2021/10/1452623430898049025.json": "Luxury fashion house Fendi will collaborate with Kim Kardashian West’s shapewear company Skims to launch a women’s collection https://t.co/AkX58Hs6yQ",
  "data/tweet-wsj/2021/10/1452662502689583105.json": "Hertz said it ordered 100,000 Tesla vehicles as it looks to include more electric cars in its rental fleet https://t.co/HPQwoJLTWQ",
  "data/tweet-wsj/2021/10/1452659492915646468.json": "Moderna's Covid-19 vaccine induced the desired immune responses in children ages 6 to 11 in a clinical trial and was found to be safe, the company said https://t.co/z8uXurC7Rg",
  "data/tweet-wsj/2021/10/1452704580135948300.json": "Tesla hit a market value of $1 trillion for the first time after a deal to supply Hertz with 100,000 vehicles sent its shares soaring https://t.co/q2Cc0o0Q6k",
  "data/tweet-wsj/2021/10/1452760666297733125.json": "Tesla’s stock closed Monday up more than 12% on the day, giving the company a market value of $1.03 trillion. Apple, Microsoft, Amazon and Google parent Alphabet are the only other U.S. companies worth more $1 trillion.\nhttps://t.co/wfBVilnWbJ",
  "data/tweet-wsj/2021/10/1452779536374960130.json": "Federal judges would be required to report stock trades over $1,000 within 45 days and post their financial-disclosure forms online under legislation proposed by a bipartisan group of lawmakers in the Senate and House of Representatives https://t.co/dRAryllaMF",
  "data/tweet-wsj/2021/10/1452736743619403784.json": "Mastercard and crypto firm Bakkt have partnered to enable cryptocurrency card payments https://t.co/YZSQmfipjP",
  "data/tweet-wsj/2021/10/1452805953833914376.json": "A lawsuit alleges Kellogg’s strawberry Pop-Tarts actually contain more pears and apples, and some fans of the breakfast treat are shocked: “It’s like you just told me there’s no Santa Claus.” https://t.co/Wr9RCOiGKk",
  "data/tweet-wsj/2021/10/1452802183636848646.json": "Comedian Dave Chappelle addressed the controversy over his Netflix special during a standup routine Sunday: “I said what I said, and boy, I heard what you said. My God, how could I not?\" https://t.co/7NZkEGodbD",
  "data/tweet-wsj/2021/10/1452813500863111169.json": "Hertz said it ordered 100,000 Tesla vehicles as it looks to include more electric cars in its rental fleet https://t.co/w9UOhUO8fX",
  "data/tweet-wsj/2021/10/1452821043169611778.json": "From @WSJopinion: The CDC’s policies hinder learning and provide no meaningful reduction in Covid-19 transmission, write Leslie Bienen and Eric Happel https://t.co/qz1ndwIVhB",
  "data/tweet-wsj/2021/10/1452843699591864326.json": "Japan's Princess Mako registered her marriage to her college sweetheart Kei Komuro, who is a commoner, giving up her royal status in accordance with the country's law https://t.co/u7Sqey2OJD",
  "data/tweet-wsj/2021/10/1452793108450709510.json": "Satellite imagery shows how two weather events, a “bomb cyclone” and an “atmospheric river,” coincided to dump severe precipitation onto California and the Pacific Northwest https://t.co/odpR6k7aL7",
  "data/tweet-wsj/2021/10/1452836152956837888.json": "Taiwan's military has big problems. One soldier’s four months of basic training mainly involved sweeping leaves, moving spare tires and pulling weeds. https://t.co/7RkW7Nx7El",
  "data/tweet-wsj/2021/10/1452855036699156480.json": "Take an early look at the front page of The Wall Street Journal https://t.co/MWXX8E5OJY https://t.co/JyO93Gy4o9",
  "data/tweet-wsj/2021/10/1452723889507811337.json": "High natural-gas prices today could cost you at the grocery store and gas station tomorrow, explains @WSJheard https://t.co/Xnw6IM59W2  #WSJWhatsNow https://t.co/8LflEheDEr",
  "data/tweet-wsj/2021/10/1452904110643109889.json": "Japan’s Princess Mako married her college sweetheart, became a commoner and, hours later, denounced the media for what she said were groundless reports that drove her to despair https://t.co/VcJuBlwroJ",
  "data/tweet-wsj/2021/10/1452877690151841792.json": "Comedian Dave Chappelle addressed the controversy over his Netflix special during a standup routine Sunday: “I said what I said, and boy, I heard what you said. My God, how could I not?\" https://t.co/63n06qHh5l",
  "data/tweet-wsj/2021/10/1452915426049073154.json": "Former ESPN reporter Allison Williams is joining conservative news site The Daily Wire after leaving the sports network because of its Covid-19 vaccine mandate https://t.co/1oI3e28ZOH",
  "data/tweet-wsj/2021/10/1452964493152112643.json": "In what might be a first in the world, the owners of Kansas City NWSL team are building a $70 million stadium for a women’s pro soccer team https://t.co/6GGPIHiRKS",
  "data/tweet-wsj/2021/10/1452753096103407618.json": "Jeff Bezos’ space company said it would help to build a new space station, part of a growing bet that many future orbital facilities will be privately owned and operated https://t.co/jlcDaavoXY",
  "data/tweet-wsj/2021/10/1452990913337303050.json": "From @WSJopinion: Why does Tesla still need subsidies to make electric cars? A $1 trillion company doesn’t need government aid https://t.co/SrdZSEaBIO",
  "data/tweet-wsj/2021/10/1452949409721896965.json": "A major home builder is teaming with a Texas startup to create a community of 100 3-D printed homes near Austin, gearing up for what would be by far the biggest development of this type of housing in the U.S. https://t.co/qu60zpwbKF",
  "data/tweet-wsj/2021/10/1452485107907014664.json": "Parents say their kids are begging to watch the bloody Netflix hit “Squid Game.” Some think that trying to shield their children from the show entirely is a losing battle. https://t.co/FrG8MPgsAC",
  "data/tweet-wsj/2021/10/1453011048164900886.json": "The world's climate plans fall far short of Paris accord targets, and the U.S. is among the countries not on track to hit emissions goals, a U.N. report says https://t.co/S676Kv7GwS",
  "data/tweet-wsj/2021/10/1453006022575013889.json": "Mark Zuckerberg says he has long imagined a virtual world where people work, play and interact. Now he’s preparing to spend billions of dollars and years of effort at making that a reality so Facebook can prosper. https://t.co/EHOKPKLWm5",
  "data/tweet-wsj/2021/10/1453002251262439431.json": "From @WSJopinion: Democrats’ last resort to finance their spending bill is taxing unrealized capital gains of “billionaires”—a wealth tax https://t.co/bdowMFJ4Po",
  "data/tweet-wsj/2021/10/1453032460795658248.json": "The science on cannabis as a mental-health treatment for anxiety and depression is in its infancy, psychologists and researchers say—and some evidence suggests that marijuana can make these problems worse https://t.co/DNJckaudfE",
  "data/tweet-wsj/2021/10/1452930544912719879.json": "Take an early look at the front page of The Wall Street Journal https://t.co/I1arwxz0ZM https://t.co/ikt87nLamm",
  "data/tweet-wsj/2021/10/1453085296606785539.json": "Queen Elizabeth won’t attend the United Nations climate change conference in Scotland next week after doctors advised her to rest https://t.co/nKPrIGu6zR",
  "data/tweet-wsj/2021/10/1453078151404392451.json": "The Democrats' planned tax on billionaires faces a problem: It may be unconstitutional https://t.co/N5LH40RZzu",
  "data/tweet-wsj/2021/10/1453017487440818179.json": "The World Series matchup between the Atlanta Braves and Houston Astros will bring a world of pain to the MLB commissioner https://t.co/JrI6YYwomd",
  "data/tweet-wsj/2021/10/1452553039483703302.json": "With one of the world’s highest Covid-19 vaccination rates, Portugal is learning to live with the virus and being watched by other countries as a possible way forward https://t.co/Qbnn4PYiTa",
  "data/tweet-wsj/2021/10/1453126866957709317.json": "A lawsuit alleges Kellogg’s strawberry Pop-Tarts actually contain more pears and apples, and some fans of the breakfast treat are shocked: “It’s like you just told me there’s no Santa Claus.” https://t.co/x1aEaZIAvB",
  "data/tweet-wsj/2021/10/1452790860597317639.json": "New York City’s high rates of vaccination, some prior infection and precautions are keeping the worst outcomes of Covid-19 in check, epidemiologists say. “We’re on our way to an endemic phase.” https://t.co/EgfOgxHTBT",
  "data/tweet-wsj/2021/10/1453149505621270531.json": "The science on cannabis as a mental-health treatment for anxiety and depression is in its infancy, psychologists and researchers say—and some evidence suggests that marijuana can make these problems worse https://t.co/TEs07s6bOu",
  "data/tweet-wsj/2021/10/1453172131739705344.json": "Journey’s keyboardist was ready to quit music. But then he got a pep talk from his dad: “Don’t stop believin’,” he said. The song based on that phrase eventually became a go-to underdog anthem. https://t.co/dgcBYreEsA",
  "data/tweet-wsj/2021/10/1453168348599099397.json": "Mastercard is introducing a new card for people who are blind or have vision impairment https://t.co/2KcxtqI6cE",
  "data/tweet-wsj/2021/10/1453107939649245196.json": "From @WSJopinion: If passed, the Democrats’ real-estate tax proposals will tank property values, write Dan Palmer and David Williams https://t.co/5K2VNiAxGC",
  "data/tweet-wsj/2021/10/1453218930814865415.json": "Take an early look at the front page of The Wall Street Journal https://t.co/LaOBh1hYEA https://t.co/jUByhwVpw8",
  "data/tweet-wsj/2021/10/1452994708645556226.json": "About halfway into Elizabeth Holmes’s trial, prosecutors have shown how her startup Theranos took shortcuts as technology failed but must convince jurors Ms. Holmes intended to deceive https://t.co/53BruC5ZXa",
  "data/tweet-wsj/2021/10/1453281579372093442.json": "Nations across Central and Eastern Europe are deepening ties with Taiwan as relations with China cool, leading to confrontation with Beijing https://t.co/DB2tMjKdAI",
  "data/tweet-wsj/2021/10/1453296692443467778.json": "Americans purchased more cigarettes last year, the first uptick in than two decades https://t.co/6dWBHzC7RT",
  "data/tweet-wsj/2021/10/1453300511868919815.json": "The science on cannabis as a mental-health treatment for anxiety and depression is in its infancy, psychologists and researchers say—and some evidence suggests that marijuana can make these problems worse https://t.co/DUxWrCULCE",
  "data/tweet-wsj/2021/10/1453330672513392647.json": "Motor racing is not a sport kids learn at the playground. But apart from the sheer cost, Lewis Hamilton’s family discovered there were other barriers. https://t.co/uNmjF2yw96",
  "data/tweet-wsj/2021/10/1453104173403279364.json": "A representative for the family office of former Education Secretary Betsy DeVos took the stand Tuesday in the Elizabeth Holmes trial to discuss a roughly $100 million investment made in Theranos in 2014 https://t.co/OfByhIYKbJ",
  "data/tweet-wsj/2021/10/1453070232608776201.json": "Pro-democracy protesters in Sudan vowed to resist a military coup of their transitional government through nationwide civil disobedience, deepening a high-stakes standoff that leaves the country with no clear path out of economic and political crisis https://t.co/aYHEMEzLCG",
  "data/tweet-wsj/2021/10/1453294182630666244.json": "FTC staffers have begun looking into disclosures that Facebook’s internal company research had identified ill effects from its products, according to people familiar with the matter https://t.co/rotj4BeDGV",
  "data/tweet-wsj/2021/10/1453400755914874885.json": "Elon Musk's net worth is approaching $300 billion, putting him tens of billions of dollars ahead of the rest of the world's richest people https://t.co/4UKE4GZHUP",
  "data/tweet-wsj/2021/10/1453428800184848390.json": "The Shiba Inu coin, a meme cryptocurrency, jumped 35% Wednesday and is now the 11th-largest cryptocurrency by market value https://t.co/AIkwy87Xig",
  "data/tweet-wsj/2021/10/1453425035314610176.json": "The State Department issued its first passport with an X gender designation, a significant step for Americans who don’t identify as exclusively male or female https://t.co/8LQVH6mnyr",
  "data/tweet-wsj/2021/10/1453455229123452933.json": "Attorney General Merrick Garland signaled he has no plans to withdraw a memo ordering the FBI to help local leaders address threats against educators https://t.co/lgL0Y9HbbQ",
  "data/tweet-wsj/2021/10/1453349539847487495.json": "Hertz said it is joining with Uber to add up to 50,000 Tesla vehicles to the Uber network by 2023 https://t.co/Uhpjq4SST4",
  "data/tweet-wsj/2021/10/1453240087345602560.json": "The Democrats' planned tax on billionaires faces a problem: It may be unconstitutional https://t.co/oisfmRgFrW",
  "data/tweet-wsj/2021/10/1453494242899288069.json": "Elon Musk's net worth is approaching $300 billion, putting him tens of billions of dollars ahead of the rest of the world's richest people https://t.co/6wsKRVtiYh",
  "data/tweet-wsj/2021/10/1453477876217548807.json": "Americans purchased more cigarettes last year, the first uptick in than two decades https://t.co/uzj7Kub8LF",
  "data/tweet-wsj/2021/10/1453490463202287619.json": "Covid-19 patients who were given the low-cost antidepressant fluvoxamine were significantly less likely to require hospitalization compared with those who weren’t, according to a new study https://t.co/tG2uzqGmxq",
  "data/tweet-wsj/2021/10/1453303233498296326.json": "Merck will license its Covid-19 antiviral pill to a U.N.-backed group to expand the drug's availability to low- and middle-income countries https://t.co/E7RYqWq0iS",
  "data/tweet-wsj/2021/10/1453534521987588100.json": "For Lewis Hamilton, the road to becoming the most dominant champion in F1 history was filled with obstacles others in the nearly all-white sport couldn’t understand. Now he’s focused on the systemic roots of the problem and insisting on change. https://t.co/duIyPFYK5i",
  "data/tweet-wsj/2021/10/1453560918651068420.json": "Researchers have proven that a man who claimed to be the great-grandson of Sitting Bull truly is related to the legendary Lakota Sioux leader, thanks to new innovations in DNA testing https://t.co/5WsxzwioIb",
  "data/tweet-wsj/2021/10/1453542049731514368.json": "McDonald’s is raising menu prices to keep pace with rapidly growing costs, with wages alone up at least 10% so far this year at U.S. restaurants https://t.co/cvFOHagLlR",
  "data/tweet-wsj/2021/10/1453304241272074245.json": "President Biden meets Pope Francis at the Vatican on Friday as both face contentious relationships with U.S. bishops over the issue of abortion https://t.co/rjgO07Ju8P",
  "data/tweet-wsj/2021/10/1453526975927263232.json": "For Lewis Hamilton, the road to becoming the most dominant champion in F1 history was filled with obstacles others in the nearly all-white sport couldn’t understand. Now he’s focused on the systemic roots of the problem and insisting on change. https://t.co/N5slv6Mqq6",
  "data/tweet-wsj/2021/10/1453519444949471237.json": "The science on cannabis as a mental-health treatment for anxiety and depression is in its infancy, psychologists and researchers say—and some evidence suggests that marijuana can make these problems worse https://t.co/EehQ8pYrf4",
  "data/tweet-wsj/2021/10/1453647767818182659.json": "Elon Musk's net worth is approaching $300 billion, putting him tens of billions of dollars ahead of the rest of the world's richest people https://t.co/KcFLGd8YmC",
  "data/tweet-wsj/2021/10/1453689658836127749.json": "The Shiba Inu coin, a meme cryptocurrency which brands itself the “dogecoin killer,” is surging in value, nipping at the heels of dogecoin #WSJWhatsNow https://t.co/coYZKxWI4s",
  "data/tweet-wsj/2021/10/1453728006027894788.json": "Elon Musk’s wealth has soared as Tesla’s market cap surpassed $1 trillion, and investors are betting a rally in the company’s stocks will continue #WSJWhatsNow https://t.co/B8d1Fo8aek",
  "data/tweet-wsj/2021/10/1453726251814842377.json": "From @WSJopinion: Democrats are writing tax policy for a $22 trillion economy on the fly, with little thought to the consequences and no time for public debate https://t.co/0VLZeuUbrg",
  "data/tweet-wsj/2021/10/1453764757983531016.json": "Taiwanese President Tsai Ing-wen acknowledged the presence of U.S. troops on the island, describing the deployment as part of broader defense cooperation with the U.S. https://t.co/LwKrnehzyu",
  "data/tweet-wsj/2021/10/1453790214753853450.json": "Breaking: Facebook is changing the company's name to Meta to reflect opportunities in the metaverse and beyond its namesake social-media platform https://t.co/oOu9zPOpIt",
  "data/tweet-wsj/2021/10/1453799536615464971.json": "The U.S. is in talks to offer immigrant families separated at the border in 2018 about $450,000 a person in compensation, people familiar with the matter say https://t.co/mmY60OIfHy",
  "data/tweet-wsj/2021/10/1453734583388676113.json": "Democrats want the biggest U.S. companies to pay at least 15% of profits in taxes. Amazon, Pfizer and dozens more S&amp;P 500 firms reported tax rates lower than that last year. https://t.co/uQ3tcakUsY",
  "data/tweet-wsj/2021/10/1453818884331556870.json": "From @WSJopinion: Add wildfires to the long list of natural disasters that are overhyped in climate coverage, writes @BjornLomborg. The amount of land burned has declined steadily since 1900, even with rising temperatures. https://t.co/fJWcIMYaDq",
  "data/tweet-wsj/2021/10/1453131298625802245.json": "On the set of “Rust,” the film’s assistant director, firearms expert and actor Alec Baldwin didn’t follow typical standard protocols to ensure a gun’s safety, according to experts who reviewed public details of the fatal shooting https://t.co/yQINazwcf8",
  "data/tweet-wsj/2021/10/1453885563363373057.json": "Getting a conviction against Kyle Rittenhouse, the teen who killed two people and injured a third during the unrest in Kenosha, might be harder than it seems. A Wisconsin law makes it difficult to convict someone who claims self-defense. https://t.co/hfu4hrCOS2",
  "data/tweet-wsj/2021/10/1453889415449825280.json": "Ryan Reynolds blazed a path that allows him to be an actor, entrepreneur, and more. “While I was obscenely privileged to star in movies, a lot of times they weren’t working,” he says. “That’s when I said, ‘I need to have some authorship here.’ ” https://t.co/inqSfI5JaK",
  "data/tweet-wsj/2021/10/1453662846395588609.json": "Americans purchased more cigarettes last year, the first uptick in more than two decades https://t.co/bQ0oTQHCBu",
  "data/tweet-wsj/2021/10/1453866711824936987.json": "Slightly under 40% of workers who are unvaccinated say they would leave their job if getting the Covid-19 vaccine was mandated by their employer or if they were required to get tested for the virus weekly, according to the results of a new survey https://t.co/EmCu35X9vc",
  "data/tweet-wsj/2021/10/1453945949680586752.json": "The Securities and Exchange Commission is asking a federal judge to require Sen. Richard Burr’s brother-in-law to testify in an enforcement probe that examines possible insider trading by both men https://t.co/1uKS7s9aEl",
  "data/tweet-wsj/2021/10/1453949735727865866.json": "The chip shortage is worsening, with wait times lengthening and buyers hoarding products. Delivery dates in 2024 aren't unusual. https://t.co/F0tTWNad2F",
  "data/tweet-wsj/2021/10/1453878028489068548.json": "Watch: Chick-fil-A's unconventional approach to business has helped make it the third biggest fast-food chain in the U.S. We get an inside look at the strategies driving the Atlanta-based company’s success. https://t.co/AhR1GMS74D",
  "data/tweet-wsj/2021/10/1453939685869322249.json": "Take an early look at the front page of The Wall Street Journal https://t.co/IheHEeo6sh https://t.co/LZoTuqGZEW",
  "data/tweet-wsj/2021/10/1454085681660239880.json": "Patagonia is doubling down on its decision to stop all paid advertising on Facebook platforms, urging other companies to join in its boycott of the social-networking company as it faces widespread scrutiny following the release of internal documents https://t.co/dJOxFpxDyg",
  "data/tweet-wsj/2021/10/1454066765609246722.json": "Mark Zuckerberg’s announcement that Facebook is focusing on the metaverse and changing its name to Meta Platforms Inc. is in many ways a personal rebranding as much as a corporate one https://t.co/mI5FYS9P2C",
  "data/tweet-wsj/2021/10/1454093250302824448.json": "From @WSJopinion: The $1.75 trillion cost of the White House’s budget framework is phony, but the social and fiscal damage are real https://t.co/Qj3f7fkdhS",
  "data/tweet-wsj/2021/10/1454108314762088459.json": "A Canadian company’s stock is surging. Investors are apparently confusing it for the rebranded Facebook. https://t.co/ms2sLwjEoq",
  "data/tweet-wsj/2021/10/1453783751356559363.json": "Ryan Reynolds blazed a path that allows him to be an actor, entrepreneur, and more. “While I was obscenely privileged to star in movies, a lot of times they weren’t working,” he says. “That’s when I said, ‘I need to have some authorship here.’ ” https://t.co/7SPpbIABkc",
  "data/tweet-wsj/2021/10/1454013920532914181.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5lEdgjqfpJ https://t.co/6PSrCnK10U",
  "data/tweet-wsj/2021/10/1454166211709837313.json": "Breaking: Pfizer-BioNTech's Covid vaccine was cleared for use in children ages 5 to 11 by the FDA. Kids could get a first dose within days, once the CDC gives its sign-off. https://t.co/7PdTfPMuQA",
  "data/tweet-wsj/2021/10/1454225302033506309.json": "Researchers at a Wuhan lab were probably unaware of the existence of the Covid-19 virus before the pandemic began, and if it leaked from the lab, it was likely the result of an accident, a U.S. intelligence report says https://t.co/2MDaShi7Ew",
  "data/tweet-wsj/2021/10/1454278152679796739.json": "A federal judge on Friday said he was inclined to require Sen. Richard Burr’s brother-in-law to testify in an investigation that examines whether the two men engaged in insider trading https://t.co/ccCSVUmYHO",
  "data/tweet-wsj/2021/10/1454297042105286659.json": "The chip shortage is worsening, with wait times lengthening and buyers hoarding products. Delivery dates in 2024 aren't unusual. https://t.co/rVNl3PvnyF",
  "data/tweet-wsj/2021/10/1454251761422815237.json": "Sesame Street season 52 was undertaken entirely in the context of the pandemic, and the new episodes reflect that. \"We had learned how to make things quickly, with confidence that they were 90 percent right. We’d actually done two Covid town halls.\" https://t.co/76AzEffa9u",
  "data/tweet-wsj/2021/10/1454380082454306818.json": "Take a look at the front page of today's Wall Street Journal https://t.co/h3RrAx3zoD https://t.co/d3wKohm9Da",
  "data/tweet-wsj/2021/10/1454414053372219397.json": "Researchers at a Wuhan laboratory were probably unaware of the existence of the virus that causes Covid-19 before the pandemic began, according to a U.S. intelligence report https://t.co/MDGgoxKEVi",
  "data/tweet-wsj/2021/10/1454154336137789444.json": "Grammy-nominated rapper Fetty Wap was arrested at New York’s Citi Field ballpark Thursday, charged in what prosecutors allege is a drug-trafficking operation involving cocaine, heroin and other opioids https://t.co/RzERza37cX",
  "data/tweet-wsj/2021/10/1454417883380002817.json": "With one of the world’s highest Covid-19 vaccination rates, Portugal is learning to live with the virus and being watched by other countries as a possible way forward https://t.co/Q8A5FWaBfX",
  "data/tweet-wsj/2021/10/1454466900214300672.json": "Many companies have been struggling for months to get products to consumers, as they face shortages in everything from raw materials to labor. Some are questioning whether it makes sense to promote products they can’t adequately stock. https://t.co/zdNEnXE3TE",
  "data/tweet-wsj/2021/10/1454470683036160009.json": "Crowds of Sudanese protesters put on a show of defiance against a military coup that has disrupted the country’s fragile transition to democracy https://t.co/zKY3rVRw3d",
  "data/tweet-wsj/2021/10/1454512191944773635.json": "Covid-19 patients who were given the low-cost antidepressant fluvoxamine were significantly less likely to require hospitalization https://t.co/PEYAqMxZNd",
  "data/tweet-wsj/2021/10/1454531091616997387.json": "McDonald’s is raising menu prices to keep pace with rapidly growing costs, with wages alone up at least 10% so far this year at U.S. restaurants https://t.co/zes6TSzSqz",
  "data/tweet-wsj/2021/10/1454557508165636100.json": "The chip shortage is worsening, with wait times lengthening and buyers hoarding products. Delivery dates in 2024 aren't unusual. https://t.co/h5Q1OPypj7",
  "data/tweet-wsj/2021/10/1454565021447503876.json": "Elon Musk’s wealth has soared as Tesla’s market cap surpassed $1 trillion, and investors are betting a rally in the company’s stocks will continue #WSJWhatsNow https://t.co/G5gzyE2ZSu",
  "data/tweet-wsj/2021/10/1454244200845807626.json": "From @WSJopinion: Net zero emissions by 2050? Don’t plan on it, writes Tom Switzer. By promising an unrealistic transformation, politicians deny poor countries a chance to grow. https://t.co/7ox4AcFT75",
  "data/tweet-wsj/2021/10/1454553776820473862.json": "Americans purchased more cigarettes last year, the first uptick in more than two decades https://t.co/jY2X82EtbK",
  "data/tweet-wsj/2021/10/1454606583405625345.json": "From @WSJopinion: The $1.75 trillion cost of the White House’s budget framework is phony, but the social and fiscal damage are real.  https://t.co/dzMLNpnwp4",
  "data/tweet-wsj/2021/10/1454580136980983811.json": "\"When you really fall in love with a car, it’s true love,\" says the owner of an E Type 4.2. \"That’s how I felt when I first saw this 1971 Jaguar in 1983.\" https://t.co/rjAMPJF48O",
  "data/tweet-wsj/2021/10/1454289486226116612.json": "Getting a conviction against Kyle Rittenhouse, the teen who killed two people and injured a third during the unrest in Kenosha, might be harder than it seems. A Wisconsin law makes it difficult to convict someone who claims self-defense. https://t.co/3U504RgoPx",
  "data/tweet-wsj/2021/10/1454636743714476036.json": "The Shiba Inu coin, a meme cryptocurrency which brands itself the “dogecoin killer,” is surging in value, nipping at the heels of dogecoin #WSJWhatsNow https://t.co/7beWfMfR56",
  "data/tweet-wsj/2021/10/1454651875991621633.json": "Dating in Lululemons? Why some women are going for a more casual first-date look https://t.co/b7IgFEGaIx",
  "data/tweet-wsj/2021/10/1454617896076914693.json": "A lawsuit alleges Kellogg’s strawberry Pop-Tarts actually contain more pears and apples, and some fans of the breakfast treat are shocked: “It’s like you just told me there’s no Santa Claus.” https://t.co/0dE9DQQogt",
  "data/tweet-wsj/2021/10/1454568910733316103.json": "“Halloween” Scream Queen Jamie Lee Curtis has a secret: She loathes horror. ”Even when I was a toddler, I was always looking over my shoulder.” https://t.co/K4D91u77K9",
  "data/tweet-wsj/2021/10/1454758810061578241.json": "Ahead of COP26, a look at previous attempts to galvanize nations’ response to climate change  https://t.co/tFhUMCdEvd",
  "data/tweet-wsj/2021/10/1454772663067549696.json": "From @WSJopinion: More parents are wising up to the damage that union control of public education hath wrought. Republicans ought to embrace the opportunity to explain to voters why the best response is more school choice, writes @jasonrileywsj https://t.co/tJlLbQeW71",
  "data/tweet-wsj/2021/10/1454776443016200194.json": "Covid-19 was more than five times more common among hospitalized people who were unvaccinated and had a previous infection, compared with those who were fully vaccinated and hadn’t had Covid-19 before, a new study found https://t.co/n3RxilU2zP",
  "data/tweet-wsj/2021/10/1454719846483218435.json": "Many companies have been struggling for months to get products to consumers, as they face shortages in everything from raw materials to labor. Some are questioning whether it makes sense to promote products they can’t adequately stock. https://t.co/mTcuq9DrgO",
  "data/tweet-wsj/2021/10/1454059218902949894.json": "The federal government plans to spend $42 billion to expand broadband access to underserved areas. But the wording of the bill could hide from the public documents about how that money would be spent. https://t.co/udk1KZmRG5",
  "data/tweet-wsj/2021/10/1454799789279883267.json": "G-20 leaders agreed to accelerate plans to tackle climate change but failed to set specific goals, pointing to tough talks at the U.N. COP26 summit https://t.co/ihCbuHC1El",
  "data/tweet-wsj/2021/10/1454821743714045964.json": "Researchers have proven that a man who claimed to be the great-grandson of Sitting Bull truly is related to the legendary Lakota Sioux leader, thanks to new innovations in DNA testing https://t.co/xJGUSgGmFu",
  "data/tweet-wsj/2021/10/1454848161160253447.json": "American Airlines has canceled more than 1,600 flights since Friday, mostly due to lack of available crew, particularly flight attendants, according to internal figures https://t.co/RJyMigjdnQ",
  "data/tweet-wsj/2021/10/1454814193895546883.json": "A lawsuit alleges Kellogg’s strawberry Pop-Tarts actually contain more pears and apples, and some fans of the breakfast treat are shocked: “It’s like you just told me there’s no Santa Claus.” https://t.co/ZDANHhPuhY",
  "data/tweet-wsj/2021/10/1454455581683724293.json": "A major home builder is teaming with a Texas startup to create a community of 3-D printed homes https://t.co/ieT0QQFPIb",
  "data/tweet-wsj/2021/10/1454901047315640321.json": "Covid-19 patients who were given the low-cost antidepressant fluvoxamine were significantly less likely to require hospitalization https://t.co/vpd3SlzQBo",
  "data/tweet-wsj/2021/10/1454936343897853952.json": "White House press secretary Jen Psaki has tested positive for Covid-19. She says she hadn’t had contact with President Biden or senior White House staff since Wednesday. https://t.co/1o4MwYoUvw",
  "data/tweet-wsj/2021/10/1454864276070539272.json": "As workers seek exemptions to Covid-19 vaccine mandates, some companies are asking a number of questions, including whether their religious beliefs prevent them from wearing seat belts or taking Tylenol https://t.co/BZ68criRJv",
  "data/tweet-wsj/2021/10/1454859487198732292.json": "McDonald’s is raising menu prices to keep pace with rapidly growing costs, with wages alone up at least 10% so far this year at U.S. restaurants https://t.co/Df542risdO",
  "data/tweet-wsj/2021/10/1454824329368178690.json": "Some former U.S.-trained Afghan soldiers and spies, abandoned after America's withdrawal and hunted by the Taliban, have enlisted in Islamic State https://t.co/YfQ5w5KXVu",
  "data/tweet-wsj/2021/10/1454957628610781186.json": "In the transition to a post-pandemic world, some mental-health specialists worry about people who may have grown dependent on masks to shield themselves from human connection https://t.co/RvohrDu9pO",
  "data/tweet-wsj/2021/10/1454938796714348551.json": "Japan's ruling Liberal Democratic Party won a clear majority in national elections, allowing new Prime Minister Fumio Kishida to build a solid foundation for a government tackling security threats from China and North Korea https://t.co/4rShKUxZUJ",
  "data/tweet-wsj/2021/10/1454889675815063552.json": "In a Michigan city of 9,000, about 200 miles west of Flint, water running through corroding pipes picks up lead and other contaminants. “It makes me feel like we’re third-class citizens,” one resident says. https://t.co/OOlk7rZ3UD",
  "data/tweet-wsj/2021/10/1454817953250217993.json": "In a Michigan city of 9,000, about 200 miles west of Flint, water running through corroding pipes picks up lead and other contaminants. “It makes me feel like we’re third-class citizens,” one resident says. https://t.co/hN0CCEPRXT"
}