{
  "data/tweet-economist/2022/5/1520627634685853697.json": "Rather than fixing the economy, it very much looks as though President Erdogan has decided to step up repression https://t.co/iAJvSPltpY",
  "data/tweet-economist/2022/5/1520574235097415680.json": "The central bank had the tools to stop it but failed to use them in time https://t.co/pbMmHdHb8y",
  "data/tweet-economist/2022/5/1520646829678989312.json": "El Salvador’s president has locked up 19,000 people in a month https://t.co/1tteAX8EV7",
  "data/tweet-economist/2022/5/1520681435652366336.json": "Filtration was used in the aftermath of the second world war and during the Chechen wars of the 1990s. We explain why the camps have reappeared after Vladimir Putin’s invasion of Ukraine https://t.co/cLGzZICgcD",
  "data/tweet-economist/2022/5/1520728276515315712.json": "Friedrich Flick was a magnate who grew rich off Hitler’s regime. He was convicted of war crimes but, after his release from prison, went on to become West Germany’s richest person https://t.co/da93BeUlYP",
  "data/tweet-economist/2022/5/1520698018932170753.json": "To attempt such daunting co-ordination in Ukraine with sullen teenagers, press-ganged into service, fed expired rations and equipped with badly maintained vehicles was the height of optimism \nhttps://t.co/IQrM2xY6OF",
  "data/tweet-economist/2022/5/1520641975455821826.json": "Why Gerhard Schröder won’t unfriend Vladimir Putin https://t.co/afCHx3bp70",
  "data/tweet-economist/2022/5/1520791170301014016.json": "If Elon Musk’s talent for shaking up industries can help cut the Gordian knot of online speech, everyone will benefit  https://t.co/cZfDukY5fd",
  "data/tweet-economist/2022/5/1520816325706321920.json": "Since Vladimir Putin’s war of aggression in Ukraine began, hundreds of thousands of people have been forcibly deported to Russia by occupying forces https://t.co/prZeG9cr9n",
  "data/tweet-economist/2022/5/1520860619045588999.json": "“Many German business dynasties continue to sidestep a complete reckoning with the dark history that stains their fortunes,” writes David de Jong in “Nazi Billionaires” https://t.co/itUAVf2BEA",
  "data/tweet-economist/2022/5/1520845682856411138.json": "Before Russia’s invasion, Elon Musk had intended to provide internet to people living in rural areas unreachable by cables and cell towers. The war has become another testing ground https://t.co/uk6xPqoYlf",
  "data/tweet-economist/2022/5/1520836285321068551.json": "The war shows that if Vladimir Putin’s forces cannot prevail on the battleﬁeld, they will at­tempt to get their way by committing atrocities. A weaker Russian army could become a more brutal one https://t.co/PYbwo5TXoN",
  "data/tweet-economist/2022/5/1520806019940634624.json": "Exactly 25 years after Tony Blair was first elected British prime minister, @campbellclaret offers a dozen positive lessons to learn from New Labour for the present and the future https://t.co/SGXctOlh7r",
  "data/tweet-economist/2022/5/1520607059342942209.json": "Can Brazilian agriculture be sustainable and still ramp up its food production? https://t.co/CIeovym0Sd",
  "data/tweet-economist/2022/5/1520925274606649344.json": "Russia sent thousands of Chechen civilians to filtration camps in an effort to stamp out separatism in the 1990s and 2000s. Disturbing parallels are emerging in Ukraine https://t.co/4YICJ9k8Pu",
  "data/tweet-economist/2022/5/1520827670682025985.json": "Mars was once the most promising site for alien life in the solar system—but some scientists now believe Enceladus is a more likely candidate https://t.co/yqb33Zrogo",
  "data/tweet-economist/2022/5/1520576500017377282.json": "The billionaire promises to make online speech freer. That is harder than it sounds https://t.co/nQ6h7Adic0",
  "data/tweet-economist/2022/5/1520702454295322627.json": "Three hundred of the women and girls on the list, including her, were transferred by mistake to Auschwitz for two weeks. She likened it to Dante’s “Inferno” https://t.co/DZmTgPloSe",
  "data/tweet-economist/2022/5/1521045565982887938.json": "Friedrich Flick was a magnate who grew rich off Hitler’s regime. He was convicted of war crimes but, after his release from prison, went on to become West Germany’s richest person https://t.co/RGaRlDMpkA",
  "data/tweet-economist/2022/5/1520907030978088962.json": "If he really wants to convince users that he will be an impartial guardian of his “digital public square”, Elon Musk could implement his reforms—and then freeze his own account  https://t.co/DkqEKgz7tq",
  "data/tweet-economist/2022/5/1520850559976284165.json": "China may have the biggest parliament in the world. But members' suggestions are rarely debated and often ignored by the government https://t.co/PTwc0LDLCU",
  "data/tweet-economist/2022/5/1521082278780223488.json": "Some Ukrainian escapees have compared conditions in Russia’s “filtration camps” to those of a ghetto or concentration camp https://t.co/vR6NHOLFFJ",
  "data/tweet-economist/2022/5/1521083600011153409.json": "We hope Elon Musk succeeds as he takes on the problem of free speech. But institutions should be bigger than the person running them  https://t.co/4iX9RRmXXD",
  "data/tweet-economist/2022/5/1521177579511816192.json": "Thousands of well-educated Russians have left a country which they now believe offers them no future. Russia may also now have a hard time bringing in migrants from other former Soviet countries https://t.co/BiHcfUEYAK",
  "data/tweet-economist/2022/5/1521236412162576385.json": "Chinese who test positive for covid are sent to isolation centres. That's bad news for their pets https://t.co/0XvjWOQs7C",
  "data/tweet-economist/2022/5/1521381922638905350.json": "Talks between Pakistan and Tehrik-­i­-Taliban Pakistan militants, which the Taliban had brokered, seem to have gone nowhere https://t.co/LvQcTaJCpy",
  "data/tweet-economist/2022/5/1521377820051742720.json": "The fact that Elon Musk is a billionaire should not disqualify him from owning an important media ﬁrm  https://t.co/oD7hyjb4bm",
  "data/tweet-economist/2022/5/1520993340317216768.json": "Kevin McCarthy’s accidental truthfulness https://t.co/4iNjPYChkm",
  "data/tweet-economist/2022/5/1521270459890814979.json": "The sophisticated artillery that Western countries have started to give Ukraine could make all the difference https://t.co/5bbtGJtJLi",
  "data/tweet-economist/2022/5/1521643221918658560.json": "This newspaper shares Elon Musk’s free-speech convictions. But we are also keen on another liberal principle, that institutions should be bigger than the person running them  https://t.co/QsSkDnvrXH",
  "data/tweet-economist/2022/5/1521754380130783235.json": "“Six of our journalists had been killed, but I believed we’d survive.” @mirrorsbreath on the demise of Novaya Gazeta, Russia’s leading independent newspaper \n\nhttps://t.co/k1lc1HVApq",
  "data/tweet-economist/2022/5/1521798014767190025.json": "Russia sent thousands of Chechen civilians to filtration camps in an effort to stamp out separatism in the 1990s and 2000s. Disturbing parallels are emerging in Ukraine https://t.co/dR0EkrRpi7",
  "data/tweet-economist/2022/5/1521620703560318977.json": "“To label us “brave” is to fight your battles from our shoulders,” writes @RanaAyyub in a guest essay for The Economist. On World Press Freedom Day, she asks what the toll is for journalists to be labelled as such https://t.co/kwFtqUqrwz",
  "data/tweet-economist/2022/5/1521749415630938112.json": "The savagery and confusion of Russia’s forces in Ukraine is consistent with their recent conduct in Syria \nhttps://t.co/QcU5A4ZQui",
  "data/tweet-economist/2022/5/1521893441428414471.json": "“Why does a journalist have to be brave to report facts as they are?” asks @RanaAyyub on World Press Freedom Day. “Why does she need to be persecuted for her story to reach the world?” https://t.co/PBRj5w54Up",
  "data/tweet-economist/2022/5/1521922584945872896.json": "“The point of the hate campaigns against me and other journalists who defy the government’s narrative has been to keep these kinds of atrocities and other horrendous war crimes in the dark,” writes Lucy Kassa, an Ethiopian journalist, in a guest essay https://t.co/V3ifJlZC8M",
  "data/tweet-economist/2022/5/1521991540507353094.json": "“Journalists are the new enemy of the state; we are going through one of the toughest phases in the history of the profession,” writes @RanaAyyub, an Indian journalist, in a guest essay for The Economist https://t.co/uQU6A8bhbV",
  "data/tweet-economist/2022/5/1522020905307713536.json": "Vladimir Putin is turning a relatively open country into an autocracy. Russians do not talk openly about the war, but they are navigating a new reality of fear and anxiety \n\nhttps://t.co/caHAOdjSqt",
  "data/tweet-economist/2022/5/1521997212145917955.json": "Some Ukrainian escapees have compared conditions in Russia’s “filtration camps” to those of a ghetto or concentration camp https://t.co/m9C2wSAmZx",
  "data/tweet-economist/2022/5/1522182513480900608.json": "To avoid breaking a precious institution, the nine justices of America’s Supreme Court need to restrain themselves https://t.co/WiAJ8AiP9k https://t.co/3sJIPRSlpl",
  "data/tweet-economist/2022/5/1522069669036937219.json": "Germany has not invested enough in diversifying its gas and oil supplies. The result is a dependence on Russian energy that prevents it from agreeing to swift sanctions on the country https://t.co/vPQJlUUC6Z",
  "data/tweet-economist/2022/5/1522274685546909696.json": "“The horror stories are endless. Yet Ethiopia’s government denies them,” says @berhe_lucy. In a guest essay for The Economist, she describes her struggle to write on Tigray while living in exile  https://t.co/roLKlun06c",
  "data/tweet-economist/2022/5/1522271669787807750.json": "China’s naval base in Djibouti, on the Horn of Africa, remains its only military bastion beyond its borders. Xi Jinping wants to change that https://t.co/qJsYHtvKqb",
  "data/tweet-economist/2022/5/1522113065705213954.json": "“We are trying to do our best to keep the country out of the war. But neutrality doesn’t provide 100% [protection],” President Maia Sandu tells us \nhttps://t.co/BvukfO5kCC",
  "data/tweet-economist/2022/5/1522248786050957312.json": "Wearables and artiﬁcial intel­ligence look set to reshape health care in three big ways. Each promises to lower costs and save lives https://t.co/7rnKlSWPM4 https://t.co/oWCi3OtpX9",
  "data/tweet-economist/2022/5/1522470089513226240.json": "China wants to increase its military presence abroad https://t.co/7Z1KLSs4lU",
  "data/tweet-economist/2022/5/1522397710069948416.json": "Sergei Guriev calls for support for émigrés who have fled Vladimir Putin’s Russia https://t.co/AoG1CpDPcp",
  "data/tweet-economist/2022/5/1522514490796953602.json": "Ukraine and Russia are the world’s two biggest exporters of edible vegetable fats such as sunflower oil https://t.co/K08ekXeO1n",
  "data/tweet-economist/2022/5/1522229400388911104.json": "Congress is debating an ethics code. Rather than wait, the justices should impose a code on themselves. And, while they are at it, they should announce term limits  https://t.co/QvbaC6JBei",
  "data/tweet-economist/2022/5/1522370387627196416.json": "China’s young elite are considering moving abroad https://t.co/QL09OM6Lmj",
  "data/tweet-economist/2022/5/1522629534071275522.json": "Across the Arab world, girls are less likely than boys to be at school. But in the classroom girls vastly outperform their male peers—to a degree unmatched anywhere else in the world https://t.co/LIlswG7Yf6",
  "data/tweet-economist/2022/5/1522586554279112705.json": "The border between Northern Ireland and the Republic is one of the most contentious in the world.\n\nBut what really divides Ireland, and is unification a real possibility?\n\nRead more: https://t.co/S9xuYvKF3N https://t.co/oObMLDuRzW",
  "data/tweet-economist/2022/5/1522271254241230852.json": "RT @stevenmazie: The Supreme Court’s legitimacy crisis is about abortion rights—and much more. My cover story https://t.co/vLZHfRZGVV from…",
  "data/tweet-economist/2022/5/1522702761044938754.json": "In America, polls show that 76% of Jews and a hefty 92% of atheists support abortion rights https://t.co/qnwaye9cU4",
  "data/tweet-economist/2022/5/1522672336444481537.json": "RT @JamesMAstill: Utah looks set to have its first competitive Senate race since 1976. My column on @EvanMcMullin's intriguing  independent…",
  "data/tweet-economist/2022/5/1522546942877786113.json": "The Supreme Court is poised to reopen some of the most contentious questions in American public life. It risks damaging itself and accelerating the division of the country into two mutually hostile blocs  https://t.co/h5SfHz2Iq2",
  "data/tweet-economist/2022/5/1522817560781197312.json": "Russia seemed to have enough ships in the Black Sea to overwhelm Ukraine’s defences. But in late February Turkey prevented Russia from sending new warships https://t.co/ssQSLOl22A",
  "data/tweet-economist/2022/5/1522803926101331968.json": "If the justices take it upon themselves to cut through legislative knots, using their power maximally, they will transform themselves into an all-powerful unelected third chamber  https://t.co/pgfubNGfV5",
  "data/tweet-economist/2022/5/1522808416200179714.json": "To “svejk” has entered the Czech vocabulary, meaning to undermine authority through stupidity https://t.co/nJb26cAKVr",
  "data/tweet-economist/2022/5/1522774485870460930.json": "Jabs for koala chlamydia are being tested in wild populations. Encouraging early results are good news for the beleaguered animals https://t.co/RvQDbctVCc",
  "data/tweet-economist/2022/5/1522831105644187649.json": "Picking fruit by hand is low-paid, seasonal and backbreaking work that few Britons want to do https://t.co/ODzrgUij3f",
  "data/tweet-economist/2022/5/1522730943123009538.json": "Susan Hutson is the first female sheriff in New Orleans’s 304-year history, and the first African-American female sheriff in the state of Louisiana https://t.co/LYUNSmzNPK",
  "data/tweet-economist/2022/5/1522904829500157958.json": "The border between Northern Ireland and the Republic is one of the most contentious in the world.\n\nBut what really divides Ireland, and is unification a real possibility?\n\nRead more: https://t.co/S9xuYw2fVl https://t.co/I28FpFZsVQ",
  "data/tweet-economist/2022/5/1522857076594286592.json": "Where Russia hoped Odessa might be a weak link in Ukraine’s defence, it has proved a bastion, an emblem of a nation that draws its strength from diversity, free enterprise and freedom  https://t.co/u9rcISdfje",
  "data/tweet-economist/2022/5/1522654451483484160.json": "The world this week by KAL, The Economist’s resident cartoonist https://t.co/MZMnOLsZUi https://t.co/q7Bv1yFucS",
  "data/tweet-economist/2022/5/1522932859077632001.json": "“There is, of course, no comparison between the suffering of Ukrainians and Russians,” writes @sguriev. “Yet many Russians, particularly those who fled Vladimir Putin’s regime, deserve support” https://t.co/eVuCdL092L",
  "data/tweet-economist/2022/5/1523029666227171328.json": "“Tackling the dual crises of poverty and climate change can only succeed if all countries play their fair part—and all of humanity is lifted up together,” @ProfOsinbajo writes for The Economist https://t.co/CVFX2vIguY",
  "data/tweet-economist/2022/5/1522993431924310016.json": "The Dardanelles and Bosporus straits, which connect the Black Sea to the Mediterranean, are controlled by Turkey. That makes things difficult for Russia  https://t.co/ikQe5XjcO9",
  "data/tweet-economist/2022/5/1522752459298459650.json": "Yoon Suk-yeol must tackle many problems, including astronomical housing costs and the frustrations of young people who are well-educated but underemployed https://t.co/amjZoXi4U5",
  "data/tweet-economist/2022/5/1523117790919417856.json": "Russia’s ability to mount a naval offensive or to land troops has been curtailed by Ukrainian missiles. We explain why they cannot replenish their naval numbers in the Black Sea https://t.co/VJbL4va655",
  "data/tweet-economist/2022/5/1523045022970437633.json": "Ingrida Simonyte, Lithuania’s prime minister, quotes “The Good Soldier Svejk” in her speeches https://t.co/V0ghIkUoew",
  "data/tweet-economist/2022/5/1523004735904649217.json": "Though Utah’s conservatives are less resistant to Donald Trump than they were, a minority still back Evan McMullin https://t.co/NDPP2uV4bk",
  "data/tweet-economist/2022/5/1522903080186097665.json": "Many foreigners are leaving China—and, according to online search trends, China’s young and educated elite are thinking about doing the same  https://t.co/XOPwEbDCF1",
  "data/tweet-economist/2022/5/1523184678018379776.json": "“Whoever speaks up and acts against [Vladimir] Putin and his war should be welcomed and supported in Europe,” argues Sergei Guriev, an economics professor at Sciences Po, in a guest essay for The Economist https://t.co/2QyRGh00fC",
  "data/tweet-economist/2022/5/1522707297272668161.json": "John Lee’s past illustrates China’s focus on stability; his future may show a changing balance of power between the governments of China and Hong Kong https://t.co/yAOwMJs8L9",
  "data/tweet-economist/2022/5/1523208877608644608.json": "According to the UN, the deportation or transfer of people from an occupied territory constitutes a war crime. We explain why Russia is setting up filtration camps during its invasion of Ukraine https://t.co/9wrFHzV41Q",
  "data/tweet-economist/2022/5/1523254147835101189.json": "Marking Russia’s victory over Nazi Germany is part of Vladimir Putin’s campaign to twist the memory of the war and win legitimacy https://t.co/RVsyiT5EZy",
  "data/tweet-economist/2022/5/1523057586102177793.json": "Taiwan’s sovereignty has been disputed for centuries. Though the island sees itself as independent, China insists it is part of the People’s Republic.\n\nAn attempt to take Taiwan by force could ignite war between America and China.\n\nRead more: https://t.co/9oRkEXbbfX https://t.co/6xtTx9Vajd",
  "data/tweet-economist/2022/5/1523284847409516544.json": "For the first time, a party which does not want Northern Ireland to exist has topped a pro-British, unionist party. The DUP recorded its worst election result since 1998 https://t.co/QfkuaTYX6J",
  "data/tweet-economist/2022/5/1523297439796527104.json": "The Turks are happy to comply with African governments’ demands to hire local subcontractors and workers, which the Chinese have been more reluctant to do https://t.co/wmc0QqPBfD",
  "data/tweet-economist/2022/5/1523303464117600256.json": "Russia’s invasion of Ukraine has shown that, in foreign and security policy, Europe still matters most https://t.co/XTrOszFZTs",
  "data/tweet-economist/2022/5/1523314277687304193.json": "The world is facing a growing waste problem, with 2bn tonnes produced last year alone. \n\nIn Taiwan, one company has an innovative solution: upcycling local plastic waste into entire buildings.\n\nRead our climate coverage: https://t.co/9I3nTzLdhu https://t.co/RBW6ynbvkr",
  "data/tweet-economist/2022/5/1523294390214561792.json": "The constitutional amendments that AMLO claims would give Mexico “an authentic, a true democracy” are unlikely to pass. But the president can still do damage https://t.co/ZUjYw6WEXB",
  "data/tweet-economist/2022/5/1523276282678890496.json": "America and its regional allies have promised fresh diplomatic engagement and threatened unspecified consequences if the agreement between China and the Solomon Islands leads to any substantial Chinese military presence  https://t.co/khGb8YXyhf",
  "data/tweet-economist/2022/5/1523311024207581184.json": "On WeChat, a popular messaging app, searches for “immigration” increased more than fourfold between early and mid-April  https://t.co/hXy4H5TTmZ",
  "data/tweet-economist/2022/5/1523283071780278272.json": "England’s health service handles 10m clinic appointments for eyes every year. Artificial intelligence could help speed up and improve diagnoses for patients. Film supported by @Maersk. \n\nRead more: https://t.co/l89psgWh9X https://t.co/zVt6u89Mip",
  "data/tweet-economist/2022/5/1523342714779013120.json": "The border between Northern Ireland and the Republic is one of the most contentious in the world.\n\nBut what really divides Ireland, and is unification a real possibility?\n\nRead more: https://t.co/S9xuYw2fVl https://t.co/xCJALEqYvU",
  "data/tweet-economist/2022/5/1523307951632809985.json": "“Instead of viewing Africa’s emergence as a threat to be blocked, the continent should be seen as a tremendous opportunity,” writes the vice-president of Nigeria https://t.co/f1MzITZ4q5",
  "data/tweet-economist/2022/5/1523401610348482561.json": "When one of the Black Sea countries is at war, Turkey has the right to prevent warships from gaining access https://t.co/T4AoheYJnK",
  "data/tweet-economist/2022/5/1523427784038621185.json": "The most reliable backers of abortion rights are the 30% of Americans with no religious affiliation https://t.co/n1ad0ayRxC",
  "data/tweet-economist/2022/5/1523458246643634176.json": "Evan McMullin’s politics are a reminder that Democrats and moderate Republicans, a dwindling but extant species, could govern together perfectly well if their fanatical colleagues would only allow it https://t.co/ILnNjOwLd1",
  "data/tweet-economist/2022/5/1523372899645915136.json": "“Ukraine will win this war and defend its independence but Europe will be safe only when Russia becomes a truly free and peaceful country,” writes @sguriev in a guest commentary for The Economist https://t.co/SZW140WOcT",
  "data/tweet-economist/2022/5/1523022626788024321.json": "The carefree promise of working from anywhere is far easier to realise if you don’t have actual cares. Children need to go to school; partners may not be able to work remotely and have careers of their own to manage https://t.co/Th2CkpJf1V",
  "data/tweet-economist/2022/5/1523239786563182592.json": "The construction industry is responsible for 11% of the world’s man-made carbon emissions—mostly due to its reliance on materials like concrete and steel. \n\nCould wood be used to build more sustainably in the future?\n\nRead more: https://t.co/uCjCF4Hj7n https://t.co/tMZhP8KUPX",
  "data/tweet-economist/2022/5/1523644956484718594.json": "The border between Northern Ireland and the Republic is one of the most contentious in the world.\n\nBut what really divides Ireland, and is unification a real possibility?\n\nRead more: https://t.co/S9xuYvKF3N https://t.co/OcY5zekP9m",
  "data/tweet-economist/2022/5/1523675703652327424.json": "While Vladimir Putin presented the invasion of Ukraine as the ideological successor of the Soviet Union’s defeat of Nazism, Volodymyr Zelensky managed to upstage him https://t.co/mMcVrgW4AZ",
  "data/tweet-economist/2022/5/1523707594132623360.json": "London was once an outpost in the West for Russian money. No more \nhttps://t.co/ieRmJVxhkL",
  "data/tweet-economist/2022/5/1523782181159587840.json": "In America, polls show that 76% of Jews and a hefty 92% of atheists support abortion rights https://t.co/AACqIKVXM0",
  "data/tweet-economist/2022/5/1523904698763419650.json": "Press freedom is under attack. It needs defenders https://t.co/wpvUihYwcQ",
  "data/tweet-economist/2022/5/1523994006484520966.json": "Taiwan’s sovereignty has been disputed for centuries. Though the island sees itself as independent, China insists it is part of the People’s Republic.\n\nAn attempt to take Taiwan by force could ignite war between America and China.\n\nRead more: https://t.co/9oRkEXbbfX https://t.co/Hfvlh8BxiE",
  "data/tweet-economist/2022/5/1523670942312013825.json": "China appears to have adjusted its tactics by targeting countries of more strategic importance to America  https://t.co/NRpVdosq7O",
  "data/tweet-economist/2022/5/1524079387519369218.json": "China calls America “imperialist” for keeping foreign bases, while insisting that its own military expansion is peaceful, nothing to worry about and only natural for a rising power https://t.co/3ORq3v2O88",
  "data/tweet-economist/2022/5/1523899743558156288.json": "Austria is rethinking its cosy ties with Russia https://t.co/eQOwbhKOPP",
  "data/tweet-economist/2022/5/1524218489673854976.json": "China unveils its vision of a global security order https://t.co/eBZgmWtxAc",
  "data/tweet-economist/2022/5/1524405546266554369.json": "Journalists in free countries should help those in autocracies. Cross-border collaborations have exposed scandals such as Pegasus and the Panama Papers https://t.co/txqifi5tTf",
  "data/tweet-economist/2022/5/1524709148285362176.json": "Modern medium machineguns firing the same 7.62mm ammunition as the M1910 are much lighter and more portable—but they lack water cooling https://t.co/MM1nwBQSsT",
  "data/tweet-economist/2022/5/1524710275189989377.json": "Fate, inher­itance and pragmatic decisions have created a new opportunity in the next decade for India. It is Narendra Modi’s to squander. Our cover this week https://t.co/614niqPJIH https://t.co/7Rcz04U7kh",
  "data/tweet-economist/2022/5/1524635311451553792.json": "Chernobyl staff had been trained for earthquakes and radiation leaks. There were no procedures in the eventuality of a Russian invasion \nhttps://t.co/UJS5aNK8ze",
  "data/tweet-economist/2022/5/1524896873705783298.json": "Vladimir Putin’s attack on Ukraine, intended to push NATO back from Russia’s borders, has instead brought it closer https://t.co/YC1EouXbMI",
  "data/tweet-economist/2022/5/1524984631111651329.json": "“It is increasingly clear that the German economy could weather the shock of an immediate cut-off of Russian gas,” argues @MSchularick in a guest commentary https://t.co/XqbajHpMk3",
  "data/tweet-economist/2022/5/1524791413925453825.json": "RT @DSORennie: Why Xi's China is reviving Maoist tools of social control, delegating powers to grassroots CCP members with hazy legal manda…",
  "data/tweet-economist/2022/5/1525038711171436544.json": "Astonishingly, roughly 80% of Ukraine’s seasonal crop has gone into the ground, sometimes planted by brave farmers wearing bulletproof vests. But getting it out of the country will be hard  https://t.co/IFViSM03ET",
  "data/tweet-economist/2022/5/1524841867908632601.json": "A combination of forces stands to transform India’s economy over the next decade, improving the lives of 1.4bn people and changing the balance of power in Asia \n\nhttps://t.co/sUDLgLd7LI",
  "data/tweet-economist/2022/5/1525104818087415809.json": "The accounts are concentrated in Asian and African online networks, largely invisible to Western Twitterati https://t.co/aUprs2PJWf",
  "data/tweet-economist/2022/5/1524791398993694721.json": "“Germany has been too cautious on nearly everything about the Russian attack on Ukraine,” argues @MSchularick in a guest commentary. It is time for the country to “step up”, he says https://t.co/0B9WrzF41F",
  "data/tweet-economist/2022/5/1525003530221789184.json": "KAL’s cartoon https://t.co/nnXlD6tLqf",
  "data/tweet-economist/2022/5/1525217330795618304.json": "The Indian children who died at schools far from their families could number in the tens of thousands https://t.co/DipczdRcct",
  "data/tweet-economist/2022/5/1525269451721031682.json": "Hair-raising accounts of the Trump presidency are now so familiar it is easy to become complacent about them https://t.co/pYogGdgw0U",
  "data/tweet-economist/2022/5/1525307225174065154.json": "Big cats and highways do not mix, which is why Los Angeles will soon be home to one of the world’s biggest wildlife corridors https://t.co/qeY2ToEAp9",
  "data/tweet-economist/2022/5/1525339870629138433.json": "We studied 7,756 Twitter accounts to measure the impact of Russia’s online influencers https://t.co/Dpq6LWXtIR",
  "data/tweet-economist/2022/5/1525321034739630080.json": "Narendra Modi wants to restore Indian great­ness. For him, that seems to involve not only building a large, in­tegrated, high­-tech economy, but also bolstering Hindu pride at the expense of minorities https://t.co/nbJM81ezXd",
  "data/tweet-economist/2022/5/1525357871944302592.json": "Even healthy humans cannot survive a wet-bulb temperature of 35°C for more than a few hours. Being outside when it reaches 32°C is exceedingly harmful https://t.co/zX8878oH6M",
  "data/tweet-economist/2022/5/1525439555821789185.json": "Two recent books on China’s authoritarian politics look at how the party encourages citizens to control one another https://t.co/GtWgOdDskv",
  "data/tweet-economist/2022/5/1525446582367358976.json": "To many Indians and in particular to the country’s 200m Muslims, the world’s biggest religious minority, the government’s shrug of indifference to growing distress is deeply ominous https://t.co/qGDhnlkEyb",
  "data/tweet-economist/2022/5/1525297959503818752.json": "Black holes themselves cannot be seen: their gravitational fields are so strong that nothing can escape them—including light. But it is possible to see the gas which surrounds the hole \nhttps://t.co/gGyN2dMXUX",
  "data/tweet-economist/2022/5/1525474023567671296.json": "Forced­-assimilation practices included cutting off the children’s long hair, and stripping them of their traditional clothing, language and culture https://t.co/nGohiuCMsb",
  "data/tweet-economist/2022/5/1525311939135643649.json": "It makes sense for Sweden to move more slowly than Finland. If the country is to set aside a centuries-old policy of neutrality, it will need a broad consensus to do it https://t.co/wWwW4sssgj",
  "data/tweet-economist/2022/5/1525248794245357569.json": "Unlike automated bots, most of the accounts we analysed varied the wording and emphasis of their content https://t.co/uKRMwsRNDL",
  "data/tweet-economist/2022/5/1525541220231028736.json": "The case for understanding empires can be made simply: both Vladimir Putin and Xi Jinping see themselves as heirs to imperial realms of the past https://t.co/8VUUPbQOFW",
  "data/tweet-economist/2022/5/1525583997409148928.json": "Sweden’s reluctance to join NATO was always partly out of concern for its neighbour Finland. Now that the Finns are shifting, Sweden is too https://t.co/UnoVetIgAF",
  "data/tweet-economist/2022/5/1525611171222626304.json": "An analysis of Twitter posts suggests that Russia’s online information operations may already be bearing fruit https://t.co/Pnbtnm9i5n",
  "data/tweet-economist/2022/5/1525539706007691264.json": "The West must supply “NATO-compatible weaponry, training and intelligence-sharing of such quality and quantity that no one will ever invade Ukraine again,” Boris Johnson tells The Economist. His hawkish tone is not shared by other European leaders https://t.co/qICRD9EvN5",
  "data/tweet-economist/2022/5/1525652970691502081.json": "There was rampant physical, sexual and emotional abuse as well as malnourishment, disease and overcrowding https://t.co/tv0wb6mzsC",
  "data/tweet-economist/2022/5/1525617730916954112.json": "“I don’t compare Eurovision to a military mission, but it’s also important”: Ukraine’s Eurovision entry is fighting in its own way \nhttps://t.co/7sOHTadIsC",
  "data/tweet-economist/2022/5/1525665166003675137.json": "How many of these users genuinely back Russia, and how many are bots or paid trolls? To find out, we analysed 3.7m tweets by these users and their followers https://t.co/7I32urjJWv",
  "data/tweet-economist/2022/5/1525578958691094530.json": "The politics of Eurovision: Russia was expelled and Ukraine is favourite to win tonight https://t.co/sMshbjd7PR",
  "data/tweet-economist/2022/5/1525661261605883904.json": "“They didn’t understand where they were.” How Chernobyl’s staff handled the Russian occupiers \nhttps://t.co/CNGvvCeadE",
  "data/tweet-economist/2022/5/1525712873493774337.json": "Researchers have found a bacterium that induces its host’s immune system to release compounds on which it can then feed https://t.co/Hn1yjPuLeJ",
  "data/tweet-economist/2022/5/1525680830567292928.json": "Hindu-nationalist dogma has filtered into mainstream discourse in India by a slow-drip process https://t.co/0xYCS8P9yE",
  "data/tweet-economist/2022/5/1525757388099297281.json": "America and the EU both wish to share more information and harmonise regulations. That may lead to a common list of sensitive technologies to be kept out of the hands of autocratic regimes https://t.co/CbnUy9RB0s",
  "data/tweet-economist/2022/5/1525748096570773505.json": "President Emmanuel Macron of France has suggested that a means must be found to spare Russia “humiliation”. In an interview with The Economist, Boris Johnson discounts this concern https://t.co/txqg3sMWBz"
}