{
  "data/tweet-economist/2021/2/1356889997002031104.json": "Published today, the 13th edition of our Democracy Index addresses questions of life, death and liberty, in a year where the world surrendered freedom to prevent a catastrophic loss of life. Download the free report: https://t.co/ba3SpAw9rb https://t.co/tqOCADqAPB",
  "data/tweet-economist/2021/2/1357395612266885123.json": "In less than 60 days since covid-19 vaccinations began, the world has now administered more doses of vaccine than there have been official cases of covid-19. Humanity is winning the race between infections and injections. A fast thread linking to #covid19 data trackers (1/4) https://t.co/PNcSmo2QMl",
  "data/tweet-economist/2021/2/1358089273845678080.json": "I speak to people in Yangon on their reaction to the coup, how their histories have intertwined with her history of Myanmar, and their concerns for the future for @1843mag\nhttps://t.co/ri9Od8HLnM",
  "data/tweet-economist/2021/2/1359932413984522240.json": "I wrote about Tibet, where authorities have intensified their efforts to crush Tibetan identity. They want Tibetans to credit Xi Jinping and the CCP, not their faith, for their \"happy lives\", and, remarkably, to exclude the Dalai Lama from Tibetan Buddhism https://t.co/jRBROnExAw",
  "data/tweet-economist/2021/2/1360160112917282820.json": "A map of covid-19 vaccine orders, sized by population.\n\n🔵 At least two doses per adult ordered\n🔴 Under two doses per adult ordered\n\nhttps://t.co/lCGUvL4eu8 https://t.co/vgWqAzVJAB",
  "data/tweet-economist/2021/2/1362323753762516994.json": "We're hiring! @TheEconomist is looking for two interactive data journalists to help bring our charts to life. If you know D3 and how to design interactives that tell a story, get in touch\nhttps://t.co/FaOPWZ3vhx https://t.co/0KafsbD13G",
  "data/tweet-economist/2021/2/1362053794956251136.json": "New defamation suits against Trump’s backers could help curb the spread of democracy-corroding disinformation. My latest @TheEconomist, with insight from @kaplanrobbie https://t.co/ZctwsOqcBK",
  "data/tweet-economist/2021/2/1362500596306223111.json": "GREAT JOB KLAXON: We’re hiring a writer to join the Britain team @TheEconomist. No journalism experience necessary, just great ideas. https://t.co/65NXhVsmgz",
  "data/tweet-economist/2021/2/1362836627056455686.json": "16 million people in Britain have so far received their first covid-19 vaccination. 95% of people in England aged 70 and over have had a least one jab. This week, the magic of these inoculations started to reveal itself.  \n\nhttps://t.co/isszS2I6gt https://t.co/MhCLDHcCLl",
  "data/tweet-economist/2021/2/1365002965552144386.json": "A year ago I met a Beninese MP in Cotonou. He looked stressed. Why? I asked. He scrolled through his WhatsApp messages, reading from dozens of requests for money from constituents. \"Being an MP is like being a bank,\" he said, adding: \"This is where the corruption starts.\""
}