{
  "data/tweet-quora/2022/7/1542871539850379266.json": "What progress has been made around climate change? Emma Varvaloucas (@heyemmavarv), host of What Could Go Right? podcast, shares data based insights here: https://t.co/L215VbduPy https://t.co/t4e8XXDkFt",
  "data/tweet-quora/2022/7/1543353957807964160.json": "What is it like to write/direct/produce a movie? @KentMoran, actor, filmmaker, and business owner shares his experience, \"Intense, amazing, fun, stressful, educational, emotional, and more all at once.\" https://t.co/LfMWFJ8i0u https://t.co/o3jgq2nV5h",
  "data/tweet-quora/2022/7/1543716336966463488.json": "How does having access to clean water empower communities? @sarahaware, founder of @WellAwareWorld and @WellBeyondWater, shares how water scarcity is a burden on women and girls and a barrier toward education and economic equality. Read her full piece: https://t.co/BvtVPAYOPk https://t.co/1n101ETELZ",
  "data/tweet-quora/2022/7/1545408206951809031.json": "How can corporations be more socially responsible? Today’s social responsibility work must be embedded and connected to the core of what an organization does. @emilykanemiller, founder + CEO @EthosGiving, shares her expert insights: https://t.co/UuoyIqZPVq https://t.co/8iu6EjisEo",
  "data/tweet-quora/2022/7/1545770187202371584.json": "How do real time locating systems work? Mohammed Smadi, CEO at PenguinIN Inc., breaks it down in his answer here: https://t.co/AvWBS0Nhwt https://t.co/aPzXru2U96",
  "data/tweet-quora/2022/7/1546132514032521217.json": "Is it worth learning new technology as you age? @lawrencekosick, president and co-founder of @GetSetUp_org, says yes! Here are six reasons why: https://t.co/UyHMTzJiIQ https://t.co/EfvPGmXI83",
  "data/tweet-quora/2022/7/1547011103980265472.json": "How does the The James Webb Space Telescope produce color images from infrared cameras, which don't see visible light? Let a science nerd give you the details: https://t.co/WTCvARcc9I #UnfoldTheUniverse",
  "data/tweet-quora/2022/7/1547658058536407045.json": "Who's working on their summer bod? Professor and textbook author Ken Saladin shows what's happening on a microscopic level in your muscles: https://t.co/0biFGr10xT\nDon't miss the comments from exercise physiologists! https://t.co/dYWYmj0iC5",
  "data/tweet-quora/2022/7/1547945011588632576.json": "What do successful HR departments have in common? Kara Govro, Chief HR Legal Expert, shares 4 key elements. See her full piece here: https://t.co/jqCOdryVjs https://t.co/NexUkYbeaL",
  "data/tweet-quora/2022/7/1548306954153390084.json": "What is the first thing you teach in media training? Nathan Miller, founder and CEO at @MillerInkLA, says you have to steer the discussion back to the main points you want to get across. Read his full answer here: https://t.co/OE6MIFsgQT https://t.co/2XGuqrT4Cb",
  "data/tweet-quora/2022/7/1548669274708901888.json": "Do businesses have an obligation to care about the mental health of employees? Kara Govro, HR Legal Expert, shares 3 reasons why they should. https://t.co/3lLJ8z2xU8 https://t.co/Y2pNSs2OME"
}