{
  "data/tweet-quora/2021/11/1455284993287081988.json": "Do you make any of these common cooking mistakes? Number 7 is hard to avoid! https://t.co/zKUtFHFOSl",
  "data/tweet-quora/2021/11/1455678931147755520.json": "Why is luciferase, the \"light-bringing enzyme\" associated with vaccines? Michael Goodson explains: https://t.co/FMLWlXDs3E\nAnyone ever worked with this enzyme in the lab? https://t.co/7hVQVfIY5e",
  "data/tweet-quora/2021/11/1455988336443670528.json": "How have consumer preferences changed since 2020? Business and branding expert @CWaltersPhD weighs in. https://t.co/GxtkLMWD7E https://t.co/EC9qac0oiS",
  "data/tweet-quora/2021/11/1456038498750717952.json": "Do you know what mekiki is? Quora writer @KazMatsune does! https://t.co/QrDuxQaeCI",
  "data/tweet-quora/2021/11/1456622693160300552.json": "What are the first things VCs notice when a team of founders starts pitching to them? Managing Partner @AgyaVentures, @KunalLunawat shares his thoughts. https://t.co/BzmMztPXZd https://t.co/Nk0KeFapdo",
  "data/tweet-quora/2021/11/1457030195140087809.json": "Why can’t Alexa or Siri understand my kids? Education tech expert, @ScanlonPatricia, explains. https://t.co/HjMfYG80bC https://t.co/7pKhjx0PGE",
  "data/tweet-quora/2021/11/1458135225314185220.json": "What are some things that people in your country consider basic that is seen as a luxury in many other countries? Joon Lee loves the personal service in S. Korea. https://t.co/cj95CRVMXZ",
  "data/tweet-quora/2021/11/1458225918804054019.json": "Do you need an \"app-endectomy?\" Alex Packer, author of Slaying Digital Dragons, explains how to self-diagnose the need for a digital detox. https://t.co/pE4Rr4b1uF",
  "data/tweet-quora/2021/11/1458489011220017153.json": "Nice summary in @BBCNews of Quora writers experiences with bad bosses: https://t.co/u9xDNuw7nr Have you had a bad boss?",
  "data/tweet-quora/2021/11/1458538754394628098.json": "Will the collapse of Evergrande China cause a financial crisis in China? Quora writer @marcotrupiano shares some thoughts in an answer containing much more context than fits in 280 characters: https://t.co/Dln7CfbXF4",
  "data/tweet-quora/2021/11/1459274871171530757.json": "Do you know who has the most kissed face of all time? @OnneVegter does! https://t.co/fkbSbVHDQ8",
  "data/tweet-quora/2021/11/1459551827112996871.json": "Thinking of starting a business? Branding expert @CWaltersPhD, recommends asking yourself these five questions first. https://t.co/XobRB4CJ27 https://t.co/TFVLseYAvV",
  "data/tweet-quora/2021/11/1459657406611443717.json": "What has it been like to live on 3 different continents and speak several languages? Contemporary artist and designer Helen Zhong shares her experience. https://t.co/2kBGKpzsOY https://t.co/KAd7EFko7W",
  "data/tweet-quora/2021/11/1459914203863650317.json": "Should we be optimistic about the climate crisis? Simon Mainwaring, author and CEO of @WeFirstBranding weighs in. https://t.co/AekS6VYg2S https://t.co/NktqAvHs5B",
  "data/tweet-quora/2021/11/1460664836287725573.json": "Do you know what animal has three vaginas? Trevor Best does and explains why that's not so weird: https://t.co/0mlAAPzp5M",
  "data/tweet-quora/2021/11/1461115267656814592.json": "What are some strategies that businesses can take to deal with being short-staffed? @CWaltersPhD, MBA has some tips: https://t.co/8kazwA5CF7",
  "data/tweet-quora/2021/11/1461104621519261700.json": "Everyone's an expert on supply chains now, but only Quora has the real experts to explain in detail why the self-proclaimed experts are wrong: https://t.co/0XjIgXyxGG \nActually, Twitter does have @man_integrated. What do we need to do to get you on Quora, Huntsman?",
  "data/tweet-quora/2021/11/1461396604548640770.json": "Scientists have techne, engineers have metis. \nWhat's common knowledge in your field? https://t.co/QMXNfCLo5r",
  "data/tweet-quora/2021/11/1461711142603132945.json": "Are you a leader who's made a mistake? You aren't alone. Here's advice from the bestselling author of \"Make It, Don't Fake It: Leading with Authenticity for Real Business Success\", @sabrinahorn on how to rebound with dignity. https://t.co/p6hh1YrWoA https://t.co/OAO9uciBTI",
  "data/tweet-quora/2021/11/1462481079449829385.json": "What exactly is impostor syndrome, and what can you do about it? Advice from @sabrinahorn, bestselling author of \"Make It, Don't Fake It: Leading with Authenticity for Real Business Success\". https://t.co/kpMsDBX0Pl https://t.co/ink2adRtJy",
  "data/tweet-quora/2021/11/1462860883776868353.json": "Answer to What are some examples of creativity being used to survive? by John Robertson https://t.co/NKfgP8dHW8 https://t.co/QoQ5ELUQxt",
  "data/tweet-quora/2021/11/1462930540193927171.json": "Did pantyhose cause the collapse of the Soviet Union? @RussiaUnlocked has the details on this mind-blowing fact! https://t.co/tGeUeHJZ7A https://t.co/1LCIhWxWsm",
  "data/tweet-quora/2021/11/1463594651567345664.json": "Did you know this fact about Keanu Reeves? Quora writer Samson Woodbridge does! https://t.co/rEBSqL6MCe https://t.co/BJTmnxJSKn",
  "data/tweet-quora/2021/11/1463643693139779595.json": "What do businesses need to know about OSHA's new Emergency temporary Standard (ETS) regarding COVID vaccination and testing? Chief HR Legal Expert, Kara Govro, breaks it down. https://t.co/8feNIemrXO https://t.co/5dyYiNRG2X",
  "data/tweet-quora/2021/11/1464443920230891520.json": "How can AI be best used in education and play? Engineer &amp; Founder @soapboxlabs @ScanlonPatricia explains! https://t.co/49rH9NDb1Z https://t.co/znTOX9fgen",
  "data/tweet-quora/2021/11/1464625236469559305.json": "How has the pandemic fueled impostor syndrome and self-sabotage? Business &amp; branding mentor and corporate trainer, @CWaltersPhD shares five tips for overcoming both. https://t.co/FOGIRLPCgr https://t.co/GKtBEOuUGx",
  "data/tweet-quora/2021/11/1464987630165274635.json": "What are some strategies that businesses can take to deal with being short-staffed? Answer by branding expert, @CWaltersPhD. https://t.co/HE4DHfQevb https://t.co/PoHYEDFSH6"
}