{
  "data/tweet-economist/2022/4/1511803267952619530.json": "In my piece for @TheEconomist, I argue that although the Soviet Union collapsed, its imperialist ideology never did. \n\nTo stop the Kremlin's war machine once and for all, we must act now. \n\nRead the full piece, but here's a short recap how we can do it.\nhttps://t.co/kNmn859vyk",
  "data/tweet-economist/2022/4/1512069010321383429.json": "My piece on mass expulsion of over 400 Russian diplomats from Europe in recent days. It means that roughly half of undeclared Russian intelligence officers in legal rezidenturas (stations) in Europe are being kicked out. A big blow to SVR, GRU &amp; FSB.\nhttps://t.co/habD9GcNkb",
  "data/tweet-economist/2022/4/1512068672642162701.json": "Why the French election matters, and why Emmanuel Macron is still the best option for France. \nOur cover story this week, in ⁦@TheEconomist⁩ https://t.co/QZchC55h0G",
  "data/tweet-economist/2022/4/1513216217074618368.json": "Just in: results of today's first-round 🇫🇷 presidential election:\nMacron  28.6%\nLe Pen   24.4%\nSource: @IfopOpinion \nThey will go through to face each other in the run-off vote on April 24th",
  "data/tweet-economist/2022/4/1513225434388910091.json": "Some remarkable results in tonight's vote:\n- total collapse of the centre-right vote (Pécresse on 5%)\n- total collapse again of Socialists (Hidalgo on 2%)\n- two great political families that dominated 🇫🇷 politics under 5th republic are no longer a national presidential force",
  "data/tweet-economist/2022/4/1513788716816683010.json": "In the absence of moral direction from seniors, Russian soldiers made ethical decisions; they had agency. Some were shocked, and tried to help shield locals from worst of it. Too many of them chose evil. My dispatch from Yahidne, Chernihiv oblast. https://t.co/j58uFLqqkh",
  "data/tweet-economist/2022/4/1514147947126362112.json": "My piece on Aleksandr Dvornikov, the new commander of Russian operations in Ukraine. He's led the Southern Military District—which abuts Donbas—for six years. He “listens to others, contrary to many Russian generals of his rank and generation”, I was told.\nhttps://t.co/nyNMGKwPLp",
  "data/tweet-economist/2022/4/1514219499511296003.json": "Emmanuel Macron did better than it may first appear in the 1st round of France’s election, winning 1m more votes than in 2017. Our updated forecasting model now puts his chances of re-election at 81% \nhttps://t.co/ajFoJQEhZy"
}