{
  "data/tweet-quora/2022/4/1510022748260601860.json": "How did Jules Verne accurately predict the future in an unpublished manuscript? Niklas Göke has the details: https://t.co/X8xQNueZ03 https://t.co/jxxchBltrB",
  "data/tweet-quora/2022/4/1510271116509593608.json": "How should I prepare for the MCAT? Kristen Moon, Founder and CEO of @moon_prep, shares 7 essential tips for preparation. https://t.co/9BFJ2vPsT3 https://t.co/IcosuU1Cwc",
  "data/tweet-quora/2022/4/1510376603871813642.json": "Considering your personal strengths and how it can lead to career growth opportunities? Business mentor and corporate trainer, @CWaltersPhD, offers six questions you should ask yourself when determining your path. https://t.co/mp5dw6kXLP https://t.co/68Ep2vFJtm",
  "data/tweet-quora/2022/4/1510633372254715906.json": "What helps with getting older? @lawrencekosick, President and Co-Founder at @GetSetUp_org, shares 7 tips! https://t.co/yZgkFii177 https://t.co/zGqeBe1QlA",
  "data/tweet-quora/2022/4/1510738978810613765.json": "How do people make connections at work? @stuntmanhunter Co-Founder at @BullfrogAgency, shares three easy tips. https://t.co/EuItcxO9H5 https://t.co/30FRVXFotb",
  "data/tweet-quora/2022/4/1511051311747239940.json": "How do you answer when greeted with Ramadan Mubarak? Muslims on Quora have you covered: https://t.co/ya9ifrHW36",
  "data/tweet-quora/2022/4/1511107675714572288.json": "What's the deal with those arm movements that composers make? Let musician and composer Curtis Lindsay explain: https://t.co/EO1qVPvtLF",
  "data/tweet-quora/2022/4/1511423346780434436.json": "Could Russia be expelled from the UN Security Council? Read the opinions of legal experts and people from around the world: https://t.co/FsNdYopkRO https://t.co/dVzRAAfYzA",
  "data/tweet-quora/2022/4/1511771776853766144.json": "The ancient Greeks believed the river Acheron flowed into the underworld. Was there really such a river? 2nd-generation Greek linguist Nick Nicholas shares the history: https://t.co/l7tbMm1SBw https://t.co/iVmz2bbKc0",
  "data/tweet-quora/2022/4/1512187356341682182.json": "What does the deepest cave on Earth look like?  Silvia Serra, ancient history enthusiast, shows us: https://t.co/U0nKvMLcx6 https://t.co/Nbmkl1MJO2",
  "data/tweet-quora/2022/4/1512173280110600193.json": "Why do so many churches have domes on the top, and how do they work architecturally? Art Historian Bob deWitt explains: https://t.co/nPmUYWttID",
  "data/tweet-quora/2022/4/1512807717764845570.json": "What are your top 5 tips for becoming really vulnerable and honest with yourself? Entrepreneur and former @BacheloretteABC contestant, @Jason_Tartick, answers here: https://t.co/PuSwIvAGh7 https://t.co/AHx3Ewrsxq",
  "data/tweet-quora/2022/4/1513170149418934282.json": "What is the best strategy to be used to stay healthy and strong and live to 100? @lawrencekosick President and Co-Founder at @GetSetUp_org, shares his best advice. https://t.co/1cCjS6gHQ9 https://t.co/GV0PV2CMZG",
  "data/tweet-quora/2022/4/1513275719962476552.json": "What are some causes of demotivation on employees? @stuntmanhunter Co-Founder at @BullfrogAgency, offers advice on identifying and improving employee motivation in your company. https://t.co/cEDzFY9dEW https://t.co/yLZUZMmCXI",
  "data/tweet-quora/2022/4/1513640329668222977.json": "Ramadan questions? Quora has you covered: https://t.co/3Ok0DekqPv",
  "data/tweet-quora/2022/4/1513937902769647616.json": "Which kill more birds, wind turbines or office buildings? Quora contributor Michael Barnard does the math: https://t.co/Hs38BXzBdL",
  "data/tweet-quora/2022/4/1513985324644372480.json": "Viktor Medvedchuk was recently detained in Ukraine. Who is he and why is this important? To answer the question, we can look at what Ukrainians said about him on Quora prior to the invasion: https://t.co/OSk6ojaHmL",
  "data/tweet-quora/2022/4/1514290289325723653.json": "The cleverness of the human species has resulted in such wonderful diversity of architecture. Via the Wonders of the Past Space, we learned about HÓRREOS, a traditional structure on the Iberian peninsula of Spain and Portugal. Can you guess what it's for? https://t.co/dLc4CQsP9n https://t.co/8rZKiVQMhh",
  "data/tweet-quora/2022/4/1514338151690489861.json": "How smart were the peasants in the middle ages? According to historian Frank Melling, they might be smarter than you think! https://t.co/4WnzBgTqDE https://t.co/ckop1E7g3X",
  "data/tweet-quora/2022/4/1514743090350764045.json": "Wondering what Elon Musk's plans are regarding Twitter? Some bright people on Quora read the tea leaves correctly about the takeover. What will their next prediction be? https://t.co/LJDqXSktaN",
  "data/tweet-quora/2022/4/1515080182494740486.json": "It's the weekend! What is everyone doing? We're reading this enlightening answer about how whiskey ages: https://t.co/thVtib8O5k https://t.co/YpFMLAwGTy",
  "data/tweet-quora/2022/4/1515344430387056651.json": "What advice would you give to an aspiring lawyer? President and Chief Executive Officer at @WestCoastTrial, @NeamaRahmani, says you need to enjoy two things. Read about them here: https://t.co/GQb3c907JM https://t.co/07BaAh3CyQ",
  "data/tweet-quora/2022/4/1515450045071564805.json": "What is the easiest way for businesses to reduce their carbon footprint? Hunter Ray Barker (@stuntmanhunter), Co-Founder at @BullfrogAgency, gives three solid strategies. https://t.co/21IZEwEMFH https://t.co/CpI4JMjVLu",
  "data/tweet-quora/2022/4/1515706852922863619.json": "How is personal injury law different from other types of law? President and Chief Executive Officer at @WestCoastTrial @NeamaRahmani explains the one main difference. Read about it here: https://t.co/fblq7ydRVo https://t.co/rNDLJKpdhz",
  "data/tweet-quora/2022/4/1515812414524174342.json": "Why is intersectionality important to social justice? @PauliMurrayCntr, breaks it down. https://t.co/nEthL1Al9Z https://t.co/KCEhNNbNCE",
  "data/tweet-quora/2022/4/1516187484324913155.json": "Where does the speed of light come from? Science writer Brandon Ross offers an intuitive explanation that will leave you with more questions: https://t.co/7HwQ9kKSxy",
  "data/tweet-quora/2022/4/1516542648881799168.json": "Why was Turkey the one country Nazi Germany would not invade? An interesting perspective and well-told story! https://t.co/Cgkr85M0FX https://t.co/DiqTadso7w",
  "data/tweet-quora/2022/4/1517881137296781317.json": "How do I turn a personal passion into a social outlet and have longevity? Answer by @lawrencekosick, president and co-founder of @GetSetUp_org. https://t.co/5nB2nnRRmn https://t.co/M3afJXekLa",
  "data/tweet-quora/2022/4/1518243503192612871.json": "What are the limitations of the duties of directors? Answer by filmmaker and Northwestern film professor, Clayton Brown. https://t.co/R1MnBK2ckk https://t.co/IpoAMd1eCR",
  "data/tweet-quora/2022/4/1518685443943895041.json": "What's your next move, now that Twitter has been bought by Elon Musk?",
  "data/tweet-quora/2022/4/1519444970825916417.json": "What color were the dinosaurs? https://t.co/Fxdu6pHsnO A simple question with a surprisingly complex answer! https://t.co/K0tnKfB2Cd",
  "data/tweet-quora/2022/4/1519724756504776704.json": "Have you ever tried Surströmming? What foods or culinary habits are unusual in your part of the world?  https://t.co/C7C5lc84EQ https://t.co/vFcYtMwAvU",
  "data/tweet-quora/2022/4/1520055517275643904.json": "Will Amber Heard survive her defamation trial? President and Chief Executive Officer at @WestCoastTrial, @NeamaRahmani, shares his insights. https://t.co/PytxcwsJEh https://t.co/o06gnVoo0k",
  "data/tweet-quora/2022/4/1520417817492869120.json": "How can managers build trust with their employees? Answer by Global President at @deputyapp. https://t.co/veXnQbjL0i https://t.co/KOGhFEAgTv",
  "data/tweet-quora/2022/4/1520523467292135427.json": "What are some gap year programs to consider before college? Founder and CEO of @moon_prep, personalized application guidance, Kristen Moon, shares her best advice. https://t.co/K8kiTVVp06 https://t.co/kOX5csjcfQ"
}