{
  "data/tweet-nytimes/2022/1/1477586743683690499.json": "These pancakes are perfectly fluffy because of the leavening agent and a vegan version of buttermilk: nondairy milk mixed with a couple teaspoons of vinegar. It works just as well for vegan waffles, muffins and coffee cake. https://t.co/Mvlh3NwQbO https://t.co/oOxPbUFW8m",
  "data/tweet-nytimes/2022/1/1477687403565535240.json": "Dr. Anthony Fauci said Sunday that the nation should focus less on the skyrocketing number of coronavirus infections and more on the number of hospitalizations and deaths. https://t.co/vloA5vgiXy",
  "data/tweet-nytimes/2022/1/1477799407173185536.json": "While watching a Vancouver Canucks hockey game, Nadia Popovici spotted a troubling mole on the neck of Brian Hamilton, an assistant equipment manager. So she wrote him a message and held it up to the plexiglass. It saved his life.\n\nhttps://t.co/ZPpCzaneua",
  "data/tweet-nytimes/2022/1/1477691161544380416.json": "Stacey Abrams, the Georgia Democrat running for governor, has admirers in both the progressive and moderate wings of her party. With Republicans eager to defeat her, her carefully calibrated positions face an electoral test in 2022.\n\nhttps://t.co/OpQUN3kd27",
  "data/tweet-nytimes/2022/1/1477684883669622784.json": "After selling the Iowa Cubs, the owner gave employees $2,000 for every year they had been with the minor league baseball team, for a total of $600,000. “My jaw dropped,” one worker said.\n\nhttps://t.co/yVoEqBGSNO",
  "data/tweet-nytimes/2022/1/1477465932431831041.json": "Sam Fender has become one of Britain’s biggest rock acts by singing about working-class life in all its complexity. Unusually, he still lives in the area of northern England where he grew up. https://t.co/4pATUOefDO",
  "data/tweet-nytimes/2022/1/1477391683339837442.json": "Desmond Tutu, a powerful opponent of apartheid and Cape Town’s first Black archbishop, was remembered in a modest ceremony scaled down further by pandemic restrictions. https://t.co/L6ISbhuzH7 https://t.co/fpXm97Cr8H",
  "data/tweet-nytimes/2022/1/1477277184532582400.json": "New studies on animals suggest why Omicron is less severe than earlier variants: It seems to cause much less damage to the lungs. https://t.co/BIoVOngQSr",
  "data/tweet-nytimes/2022/1/1478028889922416643.json": "Breaking News: The FDA cleared boosters of the Pfizer-BioNTech vaccine for 12- to 15-year-olds. The CDC is expected to sign off before shots are given out. https://t.co/LZo7bUwn50",
  "data/tweet-nytimes/2022/1/1478008249936977932.json": "Richard Leakey, the Kenyan paleoanthropologist and fossil hunter whose discoveries of ancient human skulls and skeletons helped cement Africa’s place as the cradle of humanity, died on Sunday in Kenya. He was 77. https://t.co/43YYRHxrAe",
  "data/tweet-nytimes/2022/1/1478041817589465089.json": "The New York State attorney general’s office is seeking to question Donald Trump Jr. and Ivanka Trump as part of a civil investigation into the Trump Organization. https://t.co/S17mZYKwvW",
  "data/tweet-nytimes/2022/1/1477975551411470338.json": "As the anniversary of the Jan. 6 Capitol riot approaches, the House committee investigating the day's events is preparing to hold public hearings and has not ruled out subpoenas for members of Congress, Mike Pence or Donald Trump.\n\nhttps://t.co/4rDa81Q79V",
  "data/tweet-nytimes/2022/1/1478074967665348610.json": "Facebook has suspended Rep. Marjorie Taylor Greene's account for 24 hours for spreading misinformation about the coronavirus. This comes a day after Twitter banned her personal account for posting a similar message. https://t.co/UkhQc4ddkv",
  "data/tweet-nytimes/2022/1/1478087531451359237.json": "Mayor Eric Adams of New York City insisted schools would remain open despite surging Omicron cases in the city. He said remote learning has been too damaging, especially to children in low-income neighborhoods and homeless students. https://t.co/LPCoVmXXcX https://t.co/UVEoPio4HM",
  "data/tweet-nytimes/2022/1/1478028411310333956.json": "Donald Trump endorsed Prime Minister Viktor Orban of Hungary on Monday, formally pledging his \"complete support\" to the far-right leader who has touted turning Hungary into an \"illiberal democracy.\" https://t.co/CCTLzKMpGW",
  "data/tweet-nytimes/2022/1/1478071426573869061.json": "Gov. Kathy Hochul will propose a limit of two four-year terms for New York governors in her State of the State address on Wednesday, a move that could allow her to distance herself from former Gov. Andrew M. Cuomo, who held outsize power for over a decade. https://t.co/Z1unBKAFh3",
  "data/tweet-nytimes/2022/1/1478158871726284801.json": "Breaking News: Elizabeth Holmes, the founder of the blood testing start-up Theranos, was found guilty of four counts of fraud in a case that symbolized Silicon Valley's culture of hype. https://t.co/0qsxC5ZUvj",
  "data/tweet-nytimes/2022/1/1478126548041539587.json": "Chronic psychological stress may be as important — and possibly more important — to the health of your heart as the traditional cardiac risk factors, new studies suggest. https://t.co/RNFZJfN6Hj",
  "data/tweet-nytimes/2022/1/1478095094645465095.json": "In August 2018, Apple became the first American company ever to be worth $1 trillion, an achievement that took 42 years. It surged past $2 trillion two years later. Its next trillion took just 16 months and 15 days. https://t.co/Qy8iGAxnJp https://t.co/RCDaeNCJNu",
  "data/tweet-nytimes/2022/1/1478069928766939147.json": "Josh Wardle, a software engineer in Brooklyn, knew his partner loved word games and created a guessing game for the two of them called Wordle. Just over two months after releasing it to the rest of the world, the once-a-day game has over 300,000 players. https://t.co/D1oBCwgpbW",
  "data/tweet-nytimes/2022/1/1477998194760069127.json": "A meteor likely either \"exploded or vaporized\" over Pittsburgh on Saturday, a meteorologist said, setting off a strong vibration that one resident likened to a \"shock wave.\" https://t.co/nItUut2xna",
  "data/tweet-nytimes/2022/1/1477819534870466566.json": "Mayor Eric Adams of New York said on Sunday, his second day in office, that city workers might be required to get Covid vaccine booster shots.\n\nhttps://t.co/OG41wd4lUn",
  "data/tweet-nytimes/2022/1/1477680341590548483.json": "Twitter permanently suspended the personal account of Representative Marjorie Taylor Greene on Sunday. The company said she had repeatedly violated its Covid-19 misinformation policies.\nhttps://t.co/Hdb9gddsiA https://t.co/KEvkaLvjRb",
  "data/tweet-nytimes/2022/1/1477667826047590405.json": "Breaking News: Twitter permanently suspended the personal account of Representative Marjorie Taylor Greene, a Republican of Georgia. The company said she had repeatedly violated its Covid-19 misinformation policies.\n\nhttps://t.co/v8LhiomB7x",
  "data/tweet-nytimes/2022/1/1477556547135979524.json": "In our anger-filled age, people are “devolving into children” when they need to shop or travel or cope with mild disappointment. https://t.co/162DHFCOsD",
  "data/tweet-nytimes/2022/1/1477503679519461376.json": "A Glasgow nightclub is installing technology that will turn dancers' body heat into renewable energy, which will then be used to heat or cool the club. https://t.co/h6A9iqFbSD",
  "data/tweet-nytimes/2022/1/1477413093198213122.json": "Surprise medical bills, issued by a doctor that a patient did not choose and who did not accept the patient's insurance, will be made illegal by a law that goes into effect today. https://t.co/joHEi3Unyo",
  "data/tweet-nytimes/2022/1/1477389192552460294.json": "South Korea is reckoning with a new type of political correctness enforced by angry young men who bristle at any forces they see as undermining opportunity — and feminists, in their minds, are enemy No. 1. https://t.co/FDvoBrhhtq",
  "data/tweet-nytimes/2022/1/1477298109030047752.json": "In our anger-filled age, people are “devolving into children” when they need to shop or travel or cope with mild disappointment. https://t.co/4pGZ0Qh6B7",
  "data/tweet-nytimes/2022/1/1477286007800307714.json": "Many paid tribute to Betty White as a performer who had been ahead of her times, championing equity causes before they became popular. https://t.co/n5VCCLXZZv",
  "data/tweet-nytimes/2022/1/1477263398303932420.json": "This large, fluffy pancake is excellent for New Year's Day breakfast, brunch, lunch and dessert.\n\n It comes together in about five minutes. https://t.co/scuNDQLRKs https://t.co/uvkQr4Ov3f",
  "data/tweet-nytimes/2022/1/1478171839839055874.json": "The conviction of Elizabeth Holmes signals \"the end of an era,\" David Streitfeld writes. \"In Silicon Valley, where the line between talk and achievement is often vague, there is finally a limit to faking it.\"\nhttps://t.co/mYJmxilMTA",
  "data/tweet-nytimes/2022/1/1478169640119508992.json": "Elizabeth Holmes, the founder of the blood testing start-up Theranos, faced 11 counts of fraud for lying to investors, patients and others to raise money and the profile for her company. Here’s what jurors decided:\nhttps://t.co/Ye6fA73Ucj https://t.co/rAaviWrsuV",
  "data/tweet-nytimes/2022/1/1478161795080761346.json": "The end of an era: Blackberry is ending service on its mobile devices on Jan. 4, 2022. https://t.co/jN69zoeera",
  "data/tweet-nytimes/2022/1/1478174360749883406.json": "Elizabeth Holmes, the founder of Theranos, now awaits sentencing after being found guilty of four of 11 charges of fraud on Monday. Each count of wire fraud carries up to 20 years in prison, and Holmes can appeal the conviction, her sentence or both. https://t.co/fudU5LExaW",
  "data/tweet-nytimes/2022/1/1477940312664424451.json": "Betty White died on Friday at 99. Her television career started in 1949 and included star turns on \"The Mary Tyler Moore Show\" in the 1970s and \"Golden Girls\" in the 1980s.\n\nhttps://t.co/LEccojh14O",
  "data/tweet-nytimes/2022/1/1478163568755421184.json": "Elizabeth Holmes, the founder of the failed blood testing start-up Theranos, was found guilty of four charges of fraud on Monday. She was found not guilty on four other counts. https://t.co/6nF4eZvupJ https://t.co/i9Uw8h3xJs",
  "data/tweet-nytimes/2022/1/1477703759144828930.json": "England is putting air purifiers in classrooms and strongly encouraging students to wear masks as schools prepare to reopen amid a record surge of coronavirus cases. France has also made masks mandatory indoors for everyone age 6 and over.\n\nhttps://t.co/dxaDOVsDFC",
  "data/tweet-nytimes/2022/1/1478113980472344584.json": "Viktor Orbán, Hungary’s far-right prime minister, has spent millions on an influence campaign in Washington to court the right, including Donald Trump and his allies. On Monday, Trump formally endorsed Orbán for re-election. https://t.co/jLe9a5cZPw",
  "data/tweet-nytimes/2022/1/1478053563293224963.json": "After selling the Iowa Cubs, the owner gave employees $2,000 for every year they had been with the minor league baseball team, for a total of $600,000. “My jaw dropped,” one worker said.\n\nhttps://t.co/o5nmDcKfdT",
  "data/tweet-nytimes/2022/1/1478305247152021505.json": "The conviction of Elizabeth Holmes signals \"the end of an era,\" David Streitfeld writes. \n\n\"In Silicon Valley, where the line between talk and achievement is often vague, there is finally a limit to faking it.\" https://t.co/73OHLAaRRF https://t.co/HP0SUE3ejX",
  "data/tweet-nytimes/2022/1/1478117730280685568.json": "Nearly two years into the pandemic, the Omicron variant has driven coronavirus cases to new highs, with the daily global case count surpassing a million for the first time at the end of December.\n\nWe're tracking the spread of the virus here. https://t.co/PJitGgrK8H https://t.co/g7cVzcJhwu",
  "data/tweet-nytimes/2022/1/1478135351805988867.json": "About one in 4 U.S. hospitals with intensive care units recently reported that at least 95% of their ICU beds were full. In the week ending Dec. 30, an average of 77% of beds were occupied nationwide, Department of Health and Human Services data shows. https://t.co/DVo8S13BSD",
  "data/tweet-nytimes/2022/1/1478139136938762241.json": "Without a headlining role in some of the most critical decisions facing the White House, Vice President Kamala Harris is caught between criticism that she is falling short and resentment from supporters who feel she is being undercut by the administration. https://t.co/PTaQuAqIMb https://t.co/GA6LRQNxJe",
  "data/tweet-nytimes/2022/1/1478392800957902854.json": "Breaking News: More than 4.5 million people in the U.S. quit their jobs in November, the most in two decades of tracking, as openings remained near a record. https://t.co/ZeAAVPxJiW",
  "data/tweet-nytimes/2022/1/1478454970055856133.json": "A federal judge has dismissed a lawsuit filed by a man who said he had been sexually exploited by Nirvana when the band used a photo of him as a baby, naked and drifting in a pool, for the cover of the group’s seminal album. https://t.co/zxOcDom7UU",
  "data/tweet-nytimes/2022/1/1478413440758788096.json": "Senator Tim Kaine was among the drivers stranded for more than 12 hours after a winter storm shut down parts of Interstate 95, one of the busiest travel corridors in the U.S. \"This has been a miserable experience,\" Kaine told WTOP, a radio station. https://t.co/e1Gh6kgtx5",
  "data/tweet-nytimes/2022/1/1478395833259339783.json": "American Girl has created a Chinese American doll to be its 2022 \"Girl of the Year.\" The company said it created the doll, named Corinne Tan, in response to increasing anti-Asian sentiment and to teach children to stand against racism. https://t.co/fLs1hLTu7U",
  "data/tweet-nytimes/2022/1/1478222171965214724.json": "Never miss a meteor shower, eclipse or rocket launch again. https://t.co/LAdGq5WSwx https://t.co/RGpOL0j7mS",
  "data/tweet-nytimes/2022/1/1478495055384096771.json": "Breaking News: Canada has reached a $31.5 billion settlement to repair its child welfare system and compensate Indigenous families separated by the government. https://t.co/RCGOQbgFEH",
  "data/tweet-nytimes/2022/1/1478350533215801353.json": "Interstate 95, one of the busiest U.S. travel corridors, was closed south of Washington, D.C., after a winter storm that caused at least five deaths and accidents involving several tractor-trailers. https://t.co/fJgQpAtPMw",
  "data/tweet-nytimes/2022/1/1478535477171044353.json": "Women who received Covid vaccines while pregnant were at no greater risk of delivering their babies prematurely or of giving birth to unusually small babies than pregnant women who did not get vaccinated, a new study reports. https://t.co/VY4ewSWIEZ",
  "data/tweet-nytimes/2022/1/1478522943479107585.json": "Breaking News: The House committee investigating the Jan. 6 attack has asked Sean Hannity, the Fox News host, to cooperate by answering questions about his communications with Donald Trump before and after the riot. https://t.co/qM5mA2vmji",
  "data/tweet-nytimes/2022/1/1478603212814966787.json": "Breaking News: Chicago school officials canceled classes for Wednesday amid a clash with the teachers’ union, which wants to pause in-person instruction as the Omicron variant pushes Covid cases in the city to record levels. https://t.co/8d7Itgby6l",
  "data/tweet-nytimes/2022/1/1478458728907214860.json": "April Ashley was one of the first people in Britain to undergo gender confirmation surgery. She modeled for Vogue and partied with John Lennon and Mick Jagger, all while fighting for legal recognition of her gender. She has died at age 86. https://t.co/qd9r34N7Oq",
  "data/tweet-nytimes/2022/1/1478675173977071616.json": "President Emmanuel Macron of France is facing a backlash after arguing that the government should make life miserable for the unvaccinated. His blunt statement comes as Covid infection rates spike ahead of a key presidential election.\nhttps://t.co/jYMn3s0zWI",
  "data/tweet-nytimes/2022/1/1478686483255021571.json": "Canada has reached a $31.5 billion settlement to repair its child welfare system and compensate Indigenous families separated by the government. https://t.co/NHKg8JMYDA https://t.co/kcRQ8tXBo7",
  "data/tweet-nytimes/2022/1/1478527946583420929.json": "President Biden announced on Tuesday that the U.S. government doubled its order for Pfizer's Covid pills, bringing the total order to 20 million treatment courses. https://t.co/8OFzlgi85a https://t.co/Q1hy0Yd0Pc",
  "data/tweet-nytimes/2022/1/1478709127799050241.json": "The news that Novak Djokovic, a prominent vaccination skeptic, received a medical exemption to play in the Australian Open, a procedure that suggested he remained unvaccinated against Covid, prompted outrage from some in Australia.\nhttps://t.co/WrlVw9WPWe",
  "data/tweet-nytimes/2022/1/1478847707640967168.json": "Breaking News: Novak Djokovic was refused entry to Australia and asked to leave the country after a 12-hour airport standoff over the validity of his visa and questions about his vaccine medical exemption for the Australian Open. https://t.co/B2wgwmj8OB",
  "data/tweet-nytimes/2022/1/1478845030710353925.json": "President Emmanuel Macron of France said Wednesday that he wanted to anger millions of his citizens who refuse to get vaccinated by squeezing them out of the country’s public spaces. https://t.co/yFBJ41tozj",
  "data/tweet-nytimes/2022/1/1478868944954044417.json": "Attorney General Merrick Garland vowed on Wednesday that the Justice Department would pursue its inquiry into the Capitol riot “at any level,” saying he would defend democratic institutions from attack and threats of violence. https://t.co/Ki1Jd1fCaK https://t.co/AZZEr1KXm7",
  "data/tweet-nytimes/2022/1/1478901665717760012.json": "Novak Djokovic was told to leave Australia following a 10-hour standoff with government officials at a Melbourne airport, ending his chance to defend his Australian Open title. https://t.co/2VhV1Gr1Wk https://t.co/EP7Xyjywov",
  "data/tweet-nytimes/2022/1/1478866223697960967.json": "Breaking News: A Russian-led military alliance said that it would send peacekeeping forces to Kazakhstan to help put down growing protests. https://t.co/1wHRkaCqQ0",
  "data/tweet-nytimes/2022/1/1478762374928732160.json": "Audie Cornish, a host of NPR’s \"All Things Considered,\" is leaving her job, becoming the latest prominent journalist of color to leave the public broadcaster. https://t.co/1XU1I0DbRT",
  "data/tweet-nytimes/2022/1/1478415933215551490.json": "Green: OK to hug.\nYellow: Let’s do the elbow/fist bump.\nRed: Let’s wave hello.\n\nEmployers who want workers to come back to their desks are trying to accommodate different degrees of Covid risk tolerance. Enter the humble wristband. https://t.co/fbTiMBsov7",
  "data/tweet-nytimes/2022/1/1479124383000113158.json": "Falsehoods about the Jan. 6 attack on the Capitol have persisted following efforts by Donald Trump's allies and influential conservative voices, who spent months denying, deflecting and downplaying the violence and chaos of the day. Here's a fact-check. https://t.co/RV5csyfrNm https://t.co/vIppJbeqww",
  "data/tweet-nytimes/2022/1/1479115618506866699.json": "Rep. Liz Cheney tells The Daily that the Republican Party and the country are at risk if her colleagues remain loyal to Donald Trump and \"the Big Lie\" for political reasons. Listen to our interview with Cheney a year after the Jan. 6 Capitol riot. https://t.co/5mJyvuEm7E https://t.co/rV0DJUaort",
  "data/tweet-nytimes/2022/1/1479110555000393730.json": "President Biden used the setting of his speech about the deadly Jan. 6 attack — the Capitol itself — to denounce the ransacking of the seat of American democracy.\n\nFollow our live updates. https://t.co/GghYP0YcIq https://t.co/x4Yg5SOLXy",
  "data/tweet-nytimes/2022/1/1479077309831393288.json": "People who have pets instead of children, Pope Francis said, were being selfish, exhibiting a “denial of fatherhood or motherhood” that “diminishes us, it takes away our humanity.” https://t.co/LTkrJKskqn",
  "data/tweet-nytimes/2022/1/1479043525199249413.json": "Breaking News: President Biden is expected to give a speech today warning Americans that peaceful democracy is at risk, one year after the Jan. 6 Capitol riot. https://t.co/8BKNyYAp7U",
  "data/tweet-nytimes/2022/1/1479011125995913219.json": "Novak Djokovic was told to leave Australia on Thursday following a 10-hour standoff with government officials at a Melbourne airport, ending his chance to defend his Australian Open title. https://t.co/wKDjfd81i1",
  "data/tweet-nytimes/2022/1/1478876495988805633.json": "For years, someone has been stealing hundreds of unpublished manuscripts by impersonating editors, authors, agents and scouts. Today, the FBI arrested Filippo Bernardini, an Italian citizen who worked at a major publisher.\nhttps://t.co/8y9SzjjCuh",
  "data/tweet-nytimes/2022/1/1478837470712283136.json": "Gov. Kathy Hochul of New York said Wednesday that she would propose spending $10 billion to help rebuild a health care work force exhausted and depleted by the pandemic. https://t.co/HHqtSF6rHk https://t.co/ioWHVjC6Hm",
  "data/tweet-nytimes/2022/1/1478769624737058818.json": "Three minutes of a home movie from 1938, the subject of a new documentary, depict Jewish life in a Polish town just before the Nazi invasion.\n\n\"When you see it, you want to scream to these people run away, go, go, go.\" https://t.co/NpCLhkTnoH",
  "data/tweet-nytimes/2022/1/1478730527167369216.json": "President Emmanuel Macron of France is facing a backlash after arguing that the government should make life miserable for the unvaccinated. His blunt statement comes as Covid infection rates spike ahead of a key presidential election.\nhttps://t.co/BA7Wo85qV2",
  "data/tweet-nytimes/2022/1/1479135255466545152.json": "Breaking News: Six advisers to President Biden’s transition team urged him to change his Covid strategy to address the \"new normal\" of living with the virus indefinitely, not wiping it out. https://t.co/1f4pjMFJ3p",
  "data/tweet-nytimes/2022/1/1479161361901015046.json": "President Biden on Thursday denounced Donald Trump for spreading lies about the 2020 election. \"I’ll allow no one to place a dagger at the throat of democracy,\" Biden said. https://t.co/wu3Cvm3xmL https://t.co/51qicotJp3",
  "data/tweet-nytimes/2022/1/1479176027339374606.json": "Top Republicans were nowhere to be found at the Capitol on Thursday as President Biden and lawmakers marked a year since the Jan. 6 riot, reflecting the party's refusal to accept or address its own role in stoking the violent attack. https://t.co/DJf2ikJMxY",
  "data/tweet-nytimes/2022/1/1479163847672012802.json": "Breaking News: Peter Bogdanovich, who directed films like \"The Last Picture Show\" and \"Paper Moon\" before a public fall from grace, is dead at 82. https://t.co/tkdRkvaQhL",
  "data/tweet-nytimes/2022/1/1479169688424828933.json": "Representatives Matt Gaetz and Marjorie Taylor Greene on Thursday went on Steve Bannon's show to try to redirect blame for the Capitol attack. They offered little evidence for their claims during the appearance. https://t.co/mAPaUHHJnn",
  "data/tweet-nytimes/2022/1/1479167157040824329.json": "President Biden accused Donald Trump of spinning a \"web of lies\" and imperiling democracy in a speech on the anniversary of the Capitol attack, calling the actions of Trump and his supporters \"un-American.\" https://t.co/p6spAT6zO0 https://t.co/UWdN38GqYc",
  "data/tweet-nytimes/2022/1/1479211607439908864.json": "The New York Times reached a $550 million deal to buy The Athletic, an online sports news outlet with 1.2 million subscriptions. https://t.co/gVJ0oygqnD",
  "data/tweet-nytimes/2022/1/1479131406370488326.json": "A Shiloh Shepherd dog in Vermont is being hailed as a \"real-life Lassie\" after getting help for two people injured in a pickup crash. But the science around such incidents remains unsettled. https://t.co/iqyMcQe73p",
  "data/tweet-nytimes/2022/1/1479173471850713088.json": "A Canadian law banning so-called conversion therapy is poised to go into effect on Friday, making it a crime to provide or promote services intended to change or repress a person’s sexual orientation or gender expression. https://t.co/eCNQGZILnQ",
  "data/tweet-nytimes/2022/1/1479233868603531267.json": "Representative Liz Cheney, and her father, Dick Cheney, the former vice president, were greeted warmly by Democrats at a Jan. 6 observance in the House chamber. They were the only Republicans present for a moment of silence. https://t.co/m25nSfvQL4",
  "data/tweet-nytimes/2022/1/1479231328361107457.json": "The Jan. 6 Capitol riot was perhaps the most documented act of political violence in history. Our investigation synchronized and mapped thousands of videos from that day, providing the most complete picture to date of what happened. https://t.co/Py0b84N2wX https://t.co/2MnqOu1grD",
  "data/tweet-nytimes/2022/1/1479274111864082432.json": "The Mayo Clinic said it would dismiss about 1% of its employees after they failed to comply with the clinic’s Monday deadline for its vaccine program. “The needs of the patient come first,” the health system said. https://t.co/ayYlyTYRd2",
  "data/tweet-nytimes/2022/1/1479147044489019392.json": "In Opinion\n\n“The most serious attempt to overthrow the American constitutional system since the Civil War would not have been feasible without the influence of America’s Christian nationalist movement,” writes Katherine Stewart, an author, in a guest essay.https://t.co/vCta7LlTQC",
  "data/tweet-nytimes/2022/1/1479296751458820106.json": "Falsehoods about the Jan. 6 attack on the Capitol have persisted following efforts by Donald Trump's allies and influential conservative voices, who spent months denying, deflecting and downplaying the violence and chaos of the day. Here's a fact-check. https://t.co/0e5QEZkzuY https://t.co/ARQQdusyEz",
  "data/tweet-nytimes/2022/1/1479482024251510792.json": "Breaking News: Sidney Poitier, the first Black performer to win an Oscar for best actor, is dead at 94. He was known for his portrayal of determined, dignified heroes in films like “To Sir With Love” and “Guess Who’s Coming to Dinner.” https://t.co/KJSfkFB4LR https://t.co/fQJhalOxS9",
  "data/tweet-nytimes/2022/1/1479490531101224966.json": "Sidney Poitier was the first Black performer to win the best actor Oscar. Throughout his career, a heavy weight of racial significance bore down on him. “I felt very much as if I were representing 15, 18 million people with every move I made,” he once said.https://t.co/d8qSjGiMm2",
  "data/tweet-nytimes/2022/1/1479438938179878922.json": "Before, during and now after her conservatorship, Britney Spears has used dance to assert her power and connect with her audience, conjuring a world of her own making in which she really is the boss, Madison Mainwaring writes.\nhttps://t.co/srMIxkv3n2",
  "data/tweet-nytimes/2022/1/1479505640875864068.json": "Sidney Poitier, who has died at age 94, was modest about his career, despite his role in changing American perceptions of race and opening the door to a new generation of Black actors. https://t.co/NCYi7kj13i https://t.co/BxCkb6QxwQ",
  "data/tweet-nytimes/2022/1/1479513218288660482.json": "Sidney Poitier, the pioneering actor who died at 94, has been chronicled in The New York Times for decades. Here is a look back at some of the coverage over the years. https://t.co/zNvT8x0VNZ https://t.co/e4GH5YTzZp",
  "data/tweet-nytimes/2022/1/1479498241007886345.json": "An 85-year-old retired postman in India says he has gotten 12 Covid vaccine shots, and still wants more. He believes the doses healed many of his ailments. “My backache has improved, my general weakness improved, and my appetite improved,” he said. https://t.co/lvG57XFGkZ",
  "data/tweet-nytimes/2022/1/1479528280780939269.json": "Barack Obama, who awarded Sidney Poitier with the Presidential Medal of Freedom during his first term, honored the actor on Friday, praising Poitier’s “singular talent” and ability to reveal “the power of movies to bring us closer together.” https://t.co/WbQJkHRBJJ https://t.co/KY4BJ8oBjI",
  "data/tweet-nytimes/2022/1/1479520739116167173.json": "Oprah Winfrey added her condolences to the chorus of praise for Sidney Poitier, calling him a mentor, friend, brother and confidant.\n\n“For me, the greatest of the ‘Great Trees’ has fallen,” she wrote. “He had an enormous soul I will forever cherish.” https://t.co/bt215kOLQH https://t.co/hVOXynhQIG",
  "data/tweet-nytimes/2022/1/1479548549960540170.json": "Breaking News: The three men convicted of killing Ahmaud Arbery were sentenced to life in prison. Only one will be eligible for parole. https://t.co/eIf85XjMkl",
  "data/tweet-nytimes/2022/1/1479545902473875461.json": "Before his death, Sidney Poitier’s family had agreed to work with a group of theater makers on a play about his life. The play is an adaptation of Poitier’s memoir, “The Measure of a Man: A Spiritual Autobiography.” https://t.co/7z7EaARsqS",
  "data/tweet-nytimes/2022/1/1479557234262745090.json": "The three men convicted of killing Ahmaud Arbery were sentenced to life in prison. Only one will be eligible for parole. https://t.co/ncXmXN1D9x https://t.co/c1bTZRuBxE",
  "data/tweet-nytimes/2022/1/1479566028837425153.json": "The prime minister of the Bahamas, Philip Davis, has ordered Bahamian flags in the country and at its embassies around the globe to be lowered to half-staff in tribute to Sidney Poitier. “Our country is in mourning,” he said. https://t.co/RCXdTS9wDa https://t.co/J2kGCD4xT4",
  "data/tweet-nytimes/2022/1/1479598758786707468.json": "Children who have recovered from Covid-19 appear to be at significantly increased risk of developing Type 1 or Type 2 diabetes, CDC researchers reported on Friday. https://t.co/tFTcb80MeR",
  "data/tweet-nytimes/2022/1/1479581156391759873.json": "Sidney Poitier made history in 1964 as the first Black performer to win an Oscar in the best-actor category, for the comedy-drama \"Lilies of the Field.\" Watch his acceptance speech here. https://t.co/DwN3EcS2b4",
  "data/tweet-nytimes/2022/1/1479447511458852876.json": "Breaking News: U.S. employers added only 199,000 jobs in December as hiring slowed and the economy stumbled, even before Omicron threatened the labor market.\nhttps://t.co/Tp0XMQ6FRh",
  "data/tweet-nytimes/2022/1/1479603812373614597.json": "A Georgia judge sentenced the three men convicted of killing Ahmaud Arbery to life in prison. Only one will be eligible for parole. https://t.co/13OJC0lTAA https://t.co/k9q5ML9ot5",
  "data/tweet-nytimes/2022/1/1479543390664597504.json": "At a time when Hollywood often relegated Black actors to roles as servants, Sidney Poitier was rarely a supporting player. These 11 movies, available to stream, span the 1950s to the ‘90s and highlight what made him popular with white and Black audiences. https://t.co/myzHaL4aeJ",
  "data/tweet-nytimes/2022/1/1479422614682677252.json": "Luiza Trajano, who turned a small family store into a Brazilian retail giant, has spoken bluntly about race, inequality and domestic violence.\n\nNow, a company policy limiting its executive training program to Black applicants is drawing praise and outrage. https://t.co/EcF52ebvOZ https://t.co/nco0fcX6vb",
  "data/tweet-nytimes/2022/1/1479362187810553858.json": "Women who received Covid shots had slightly longer menstrual cycles after being vaccinated, a study found, validating anecdotal reports of erratic cycles. But their periods themselves were not prolonged, and bounced back to normal within one or two months. https://t.co/5DR6PofP8U",
  "data/tweet-nytimes/2022/1/1479664182085750784.json": "On Friday, Amy Schneider became the first woman in the history of “Jeopardy!” to surpass $1 million in winnings during regular-season play. https://t.co/l2ZaeDs22O",
  "data/tweet-nytimes/2022/1/1479392401793953792.json": "Pakistan cleared the way for the first woman in its history to become a Supreme Court justice with the nomination of Justice Ayesha Malik to the top court. The move was hailed by lawyers and activists after decades of struggle for greater representation. https://t.co/laBEqD1XTL",
  "data/tweet-nytimes/2022/1/1479567282980405255.json": "Citigroup will dismiss unvaccinated employees by the end of the month as it presses on with a vaccine requirement the company announced in October. More than 90% of its 65,000 U.S. employees have complied with the requirement. https://t.co/Xl94a1Pxgo",
  "data/tweet-nytimes/2022/1/1479623906114019329.json": "\"Were anyone to ask me who’s the greatest American movie star,\" @Wesley_Morris writes, \"my answer would never change. And it will never change because the answer is easy. The greatest American movie star is Sidney Poitier.\" https://t.co/YtERPb4Ijf",
  "data/tweet-nytimes/2022/1/1479584898759471111.json": "In an instant, Sidney Poitier moved America into the age of Black Power, our critic writes. The year, 1967. The movie, “In the Heat of the Night.” It was “the slap heard around the world.” https://t.co/Inv9BzZ8eQ",
  "data/tweet-nytimes/2022/1/1479618895715708928.json": "A group of Canadian social media influencers and others flouted Covid-19 rules on a flight to Cancún, Mexico, resulting in airlines leaving many of them without a way home. https://t.co/LwEjVG33sa",
  "data/tweet-nytimes/2022/1/1479837841391763462.json": "Amy Schneider has become the first woman in the history of “Jeopardy!” to surpass $1 million in winnings during regular-season play. https://t.co/NpiB2l51Cr",
  "data/tweet-nytimes/2022/1/1479827750953394177.json": "“Dear Mom, Received another letter from you today and was happy to hear that everything is okay,” a 22-year-old soldier wrote on Dec. 6, 1945. “As for myself, I’m fine and getting along okay.”\n\nLast month, his letter was finally delivered. https://t.co/h7AzVBjd4H",
  "data/tweet-nytimes/2022/1/1479822722070949899.json": "New York Times readers are honoring Sidney Poitier by sharing tributes and memories.\n\nJoin the conversation: https://t.co/yB5nBP8Dn9 https://t.co/bqpS0DgjGV",
  "data/tweet-nytimes/2022/1/1479879078744412160.json": "In Opinion\n\n\"The Australian Border Force did what sports bodies are failing to do: say no. If athletes don’t like restrictions imposed on the unvaccinated, they could just get a shot like millions of other people,\" Lindsay Crouse writes. https://t.co/Ws8u67yADh",
  "data/tweet-nytimes/2022/1/1479886912785629197.json": "The James Webb Space Telescope has completed a final, crucial step: unfolding the last section of its golden, hexagonal mirrors. That amounts to it becoming fully deployed, according to NASA. https://t.co/rFaacTdYx2",
  "data/tweet-nytimes/2022/1/1479864259270123533.json": "In Opinion\n\n\"It’s disgusting that Republicans could not honor the institution they took an oath to protect, or even show up for the cops and other staffers they see every day who were traumatized by Jan. 6,\" Maureen Dowd writes. https://t.co/8tb6kOT8HP",
  "data/tweet-nytimes/2022/1/1479841986920255489.json": "Virus cases have hit new highs in the U.S.\nHospitalizations topped the height of the Delta wave.\nDeaths are starting to rise.\n\nIf the Omicron variant is less severe overall, it can be hard to understand the trends. Here’s how to think about the data now. https://t.co/GroeWzHhWi",
  "data/tweet-nytimes/2022/1/1479928415432105986.json": "Yao Pan Ma, an immigrant from China who was left in a coma after a brutal assault in April, died last week. The police called the attack a hate crime, and Ma, 61, had been a ventilator and was hospitalized since the assault occurred in East Harlem. https://t.co/xl8iWqsQBW",
  "data/tweet-nytimes/2022/1/1479880601595518984.json": "Russian forces now surround Ukraine on three sides — about 100,000 troops, according to Ukrainian and Western officials. See where, and why Western officials fear a military operation could start as soon as this month. https://t.co/pp9cHGz2cs",
  "data/tweet-nytimes/2022/1/1479885626556174336.json": "Luiza Trajano turned a small family store into a retail giant. Parties across the political spectrum have begged her to run for office — seeing in her a rare blend of pragmatism, charisma and smarts. https://t.co/fLdyzoHKBa https://t.co/bDf9lAp4B0",
  "data/tweet-nytimes/2022/1/1479922627762429955.json": "The number of hospitalized young children infected with the coronavirus rose precipitously last week to the highest levels since the beginning of the pandemic, according to data released on Friday by the CDC. Here's what to know. https://t.co/pLsf0QfqRI https://t.co/ATv7xT3E3K",
  "data/tweet-nytimes/2022/1/1480162512201035781.json": "Cinnamon rolls are always a good idea. This recipe comes together in under an hour. https://t.co/z23ge02pim https://t.co/JOAhBLcSCh",
  "data/tweet-nytimes/2022/1/1480181331908870148.json": "A clip of an exasperated Elmo on “Sesame Street” has captivated people online who see a reflection of their own frustrations. https://t.co/WMzoJzeg8Q",
  "data/tweet-nytimes/2022/1/1480212120595742723.json": "It’s too soon to predict the full impact Omicron could have on deaths and illness across the U.S. \n\nBut data in some of the earliest-hit cities is beginning to show what the future could hold. Here's what it shows. \n\nhttps://t.co/v3mJZ63Gji",
  "data/tweet-nytimes/2022/1/1480302155999457285.json": "A fire in a Bronx apartment building on Sunday killed at least 19 people, including nine children. A total of 63 people were injured.\n\n“This is going to be one of the worst fires that we have witnessed during modern times,” Mayor Eric Adams said. https://t.co/zHSQITGAtK https://t.co/Cl2pFncv1G",
  "data/tweet-nytimes/2022/1/1480177572113702918.json": "\"You’re seeing a broken system breaking down even further.\" A year into President Biden's term, only 41% of his nominees for Senate-confirmed posts have been approved, a new analysis found, the worst rate in decades. https://t.co/1xxJlMwabU",
  "data/tweet-nytimes/2022/1/1480271722918170638.json": "Breaking News: At least 19 people were killed, including 9 children, in a fire at a Bronx apartment building on Sunday. “The numbers are horrific,” Mayor Eric Adams said. Follow live updates here:\nhttps://t.co/U7bqiODZNt",
  "data/tweet-nytimes/2022/1/1480352467204325384.json": "Bob Saget, the actor known as Danny Tanner on “Full House” and the host of “America’s Funniest Home Videos,” has died. He was 65. https://t.co/PxNxEKYDdN https://t.co/k5sYJlZ09n",
  "data/tweet-nytimes/2022/1/1480351406913687558.json": "Breaking News: Bob Saget, the comedian and actor known for his role in “Full House” and as host of “America’s Funniest Home Videos,” has died at 65. https://t.co/d1tf4IM7Zj",
  "data/tweet-nytimes/2022/1/1480376864795512832.json": "\"I will never ever have another friend like him,\" John Stamos, who starred alongside Bob Saget in \"Full House,\" said in a tweet. \"I love you so much Bobby.\" https://t.co/mChbeu83UN https://t.co/ef8A2o3UcS",
  "data/tweet-nytimes/2022/1/1479972451396292608.json": "Jumping rope isn’t just for little kids and boxing montages. It's also a portable workout that builds strength, speed, and protects our bodies as we age. https://t.co/Ctf7WXkEcO",
  "data/tweet-nytimes/2022/1/1480429158329106437.json": "Breaking News: Novak Djokovic won a legal victory in his bid to avoid deportation from Australia and compete for a record 21st Grand Slam tennis title. https://t.co/wMtgtYGDr1",
  "data/tweet-nytimes/2022/1/1480336679894409216.json": "\"I almost got lost because it was so dark.\"\n\nResidents who survived the deadly fire in the Bronx on Sunday described a quiet morning that suddenly was overtaken by terror and tragedy. https://t.co/23F1OsKuUK",
  "data/tweet-nytimes/2022/1/1480333599777951746.json": "Josh Wardle, a software engineer in Brooklyn, knew his partner loved word games and created a guessing game for the two of them called Wordle. Just over two months after releasing it to the rest of the world, the once-a-day game has over 300,000 players. https://t.co/4hXBfIapxX",
  "data/tweet-nytimes/2022/1/1480317646532927495.json": "Mayor Eric Adams said Sunday's deadly fire in the Bronx was likely caused by a space heater. At least 19 people, including nine children, were killed. https://t.co/XA06IZBXO0",
  "data/tweet-nytimes/2022/1/1480524886821031938.json": "\"I will never ever have another friend like him,\" John Stamos, who starred alongside Bob Saget in \"Full House,\" said in a tweet. \"I love you so much Bobby.\" https://t.co/AJ6pUaBAff https://t.co/RZbGFaynCf",
  "data/tweet-nytimes/2022/1/1480108353359646720.json": "Scientists say a microscopic battle between fungus and bacteria on the skin of hedgehogs provides evidence that antibiotic resistance can occur in nature. https://t.co/Kzk1cidC0d",
  "data/tweet-nytimes/2022/1/1479930930995286017.json": "Never miss a meteor shower, eclipse or rocket launch again. https://t.co/J56IdaHRIN https://t.co/kSWu2GobTV",
  "data/tweet-nytimes/2022/1/1480612250452996102.json": "Breaking News: Robert Durst, the real estate tycoon who was long suspected in three killings, and found guilty of one of them, is dead at 78. https://t.co/wRM3cox34D",
  "data/tweet-nytimes/2022/1/1480619228390731781.json": "Clay Aiken, the former “American Idol” contestant, said that he was running for Congress in North Carolina. On his new website, Aiken, 43, referred to himself as a “loud and proud Democrat.” https://t.co/ov8WGN4XNY",
  "data/tweet-nytimes/2022/1/1480646441420873730.json": "Breaking News: A man received a new heart from a genetically modified pig, a medical first that offers hope to hundreds of thousands of patients with failing organs. https://t.co/CMQEPN9IL9 https://t.co/wSYwFwmqV9",
  "data/tweet-nytimes/2022/1/1480600418644336642.json": "Misinformation about Covid-19 tests — including PCR and at-home tests — has spiked across social media in recent weeks. The burst of misinformation threatens to further stymie public efforts to keep the health crisis under control. https://t.co/3gKByPKSzU https://t.co/cF9XYJWbTl",
  "data/tweet-nytimes/2022/1/1480656096519933957.json": "Breaking News: Privately insured Americans can be reimbursed starting Saturday for eight at-home coronavirus tests per person per month under a new plan announced on Monday by the Biden administration.\nhttps://t.co/Ze3y0gEx7h",
  "data/tweet-nytimes/2022/1/1480656968599625738.json": "In a first, a man receives a heart from a genetically altered pig https://t.co/gLavGM2fu2",
  "data/tweet-nytimes/2022/1/1480585287570919426.json": "Rapid at-home Covid tests are inaccessible to blind people as they require complex steps and have no Braille guides. Some apps offer support, but these interactions are difficult, and not everyone who is blind is able to use a smartphone. https://t.co/f9EGgV6vdW",
  "data/tweet-nytimes/2022/1/1480708545104556037.json": "For the first time, surgeons have successfully transplanted a genetically altered pig’s heart into a patient. The procedure may bring new hope to hundreds of thousands of people with organ failure. https://t.co/UFkJnUHTU5",
  "data/tweet-nytimes/2022/1/1480751355006537731.json": "Rachel Balkovec, a groundbreaking baseball coach, will become the manager of a team in the Yankees’ minor league system, making her the first woman to lead an affiliated professional baseball squad.\nhttps://t.co/HmEAMiiTZm",
  "data/tweet-nytimes/2022/1/1480700995885797383.json": "The number of Americans hospitalized with Covid-19 is higher than last winter’s peak as Omicron tears through the U.S. and overwhelms hospitals. https://t.co/viN5ezgEss",
  "data/tweet-nytimes/2022/1/1480675886861008897.json": "Robert Durst, the real estate tycoon who was long suspected in three killings, and found guilty of one of them, has died at age 78. https://t.co/918PkUoR7Z https://t.co/xafBIj2sia",
  "data/tweet-nytimes/2022/1/1480771476152360961.json": "David Sassoli, the president of the European Parliament, has died at 65. No cause of death was immediately available, but he had been hospitalized in Italy because his immune system was not functioning normally. https://t.co/8i5xVU3FWU",
  "data/tweet-nytimes/2022/1/1480851035778387972.json": "Breaking News: In a speech today, President Biden is expected to endorse changing rules around the Senate filibuster to pass new voting rights protections.\nhttps://t.co/BNnYUU54lM",
  "data/tweet-nytimes/2022/1/1480590289114996739.json": "Symone Sanders, the former chief spokeswoman for Vice President Kamala Harris, is joining MSNBC as an anchor and will host a new weekend program on the cable channel, the network said on Monday. https://t.co/TdTklFwMHw"
}