{
  "data/tweet-wsj/2022/7/1542674368920174592.json": "SpaceX has been given permission to operate its satellite-internet service Starlink on everything from airplanes and boats to RVs https://t.co/1Q3QxF4ZPo",
  "data/tweet-wsj/2022/7/1542762441410576384.json": "New Zealand designated far-right group the Proud Boys as a terrorist organization, highlighting the role that the group played in last year’s attack on the U.S. Capitol https://t.co/eRX7xGxTNJ",
  "data/tweet-wsj/2022/7/1542810269545529351.json": "After nine days, Elon Musk is on his longest stretch without posting on Twitter in nearly five years https://t.co/JCgdUbUsCn",
  "data/tweet-wsj/2022/7/1542719353459802112.json": "A former top corporate lawyer for Apple pleaded guilty to insider trading, admitting he used access to the company’s undisclosed earnings results to reap hundreds of thousands of dollars in illicit gains, prosecutors said https://t.co/oNvnb1jVcs",
  "data/tweet-wsj/2022/7/1542855577352683521.json": "WikiLeaks founder Julian Assange has appealed his extradition from the U.K., prolonging legal wrangling over whether he should be sent to the U.S. to face spying charges https://t.co/oqWEIu4fZq",
  "data/tweet-wsj/2022/7/1542883232999415810.json": "From @WSJopinion: Cassidy Hutchinson showed more guts than any of Trump’s men. Her testimony strengthens the case for prosecution, writes @Peggynoonannyc. https://t.co/YReDiztMoq",
  "data/tweet-wsj/2022/7/1542787634774396929.json": "The woman alleged to be at the heart of one of the world’s biggest cryptocurrency frauds is now on the FBI’s 10 Most Wanted Fugitives list, according to the agency https://t.co/eesj7KWjY8",
  "data/tweet-wsj/2022/7/1542780094493622272.json": "Apple released the first-ever iPhone in the U.S. on June 29, 2007. Here’s a look back at every iteration. https://t.co/ApIj80xVLM",
  "data/tweet-wsj/2022/7/1542953710409719814.json": "Ukrainian officers say recently supplied U.S. guided-rocket systems are strengthening their hand against Russian forces https://t.co/qWKeE5BRt8",
  "data/tweet-wsj/2022/7/1542938642175467523.json": "President Biden selected more than a dozen people to receive the Presidential Medal of Freedom, the country’s highest civilian honor, including Simone Biles, Steve Jobs, Denzel Washington and John McCain https://t.co/33LHbF8F08",
  "data/tweet-wsj/2022/7/1542994007365767169.json": "Every July 1, former Major League slugger Bobby Bonilla gets $1.2 million from the New York Mets, a team he hasn’t played for in over 20 years. It's either one of the worst deals in sports history or the most brilliant retirement plan by an athlete ever. https://t.co/RuUywMUSZ8",
  "data/tweet-wsj/2022/7/1543004044083560449.json": "Google said it would begin automatically deleting visits to abortion clinics from its users’ location history, a move that follows last week’s Supreme Court decision https://t.co/GDpBIztY0R",
  "data/tweet-wsj/2022/7/1543078289157259265.json": "New York lawmakers overhauled the state’s gun laws and started the process of amending the state Constitution to cement the right to an abortion. https://t.co/SI3YoXGuCc",
  "data/tweet-wsj/2022/7/1543074531400716289.json": "The woman alleged to be at the heart of one of the world’s biggest cryptocurrency frauds is now on the FBI’s 10 Most Wanted Fugitives list, according to the agency https://t.co/SnarZ8Hzyi",
  "data/tweet-wsj/2022/7/1543097187839709186.json": "Apple released the first-ever iPhone in the U.S. on June 29, 2007. Here’s a look back at every iteration. https://t.co/iIeLE1KuRN",
  "data/tweet-wsj/2022/7/1543039256968445952.json": "Jerry Hall filed for divorce from Rupert Murdoch, citing “irreconcilable differences” and seeking spousal support https://t.co/DDaK5Gj6OZ",
  "data/tweet-wsj/2022/7/1543100922942865409.json": "From @WSJopinion: We didn’t often agree with Supreme Court Justice Stephen Breyer, but tip a cap to his honorable 58-year career that included stints in all three branches of government https://t.co/m5mxWklsIx",
  "data/tweet-wsj/2022/7/1543157605803122688.json": "The woman alleged to be at the heart of one of the world’s biggest cryptocurrency frauds is now on the FBI’s 10 Most Wanted Fugitives list, according to the agency https://t.co/OP2DwR9Vh0",
  "data/tweet-wsj/2022/7/1543119822325776384.json": "An 8-year-old boy, James, was reunited with his family after losing them in the chaos of the Kabul airport last year when the Taliban was taking power in Afghanistan https://t.co/cBWcaWQCl4",
  "data/tweet-wsj/2022/7/1543172669092282368.json": "President Biden selected more than a dozen people to receive the Presidential Medal of Freedom, the country’s highest civilian honor, including Simone Biles, Steve Jobs, Denzel Washington and John McCain https://t.co/fFXbSvAN1x",
  "data/tweet-wsj/2022/7/1543233149915766789.json": "Bill Gates said he thinks cryptocurrencies and NFTs are “100%” based on the greater fool theory https://t.co/9krqISUIFW",
  "data/tweet-wsj/2022/7/1542982918326435840.json": "The U.S. plans to block new offshore oil drilling in the Atlantic and Pacific oceans, but allow limited expansion in the Gulf of Mexico and off Alaska https://t.co/NzPeqNWJSO",
  "data/tweet-wsj/2022/7/1543066960749121539.json": "A 71-year-old Pennsylvania woman was attacked by a bison in Yellowstone National Park, the third goring in the park in recent weeks https://t.co/FepnBKEEWZ",
  "data/tweet-wsj/2022/7/1543301017063792642.json": "From @WSJopinion: Cassidy Hutchinson showed more guts than any of Trump’s men. Her testimony strengthens the case for prosecution, writes @Peggynoonannyc. https://t.co/QLvKJlaZJj",
  "data/tweet-wsj/2022/7/1543255704009691143.json": "Liz Cheney’s criticism of Donald Trump has alienated many Republicans in Wyoming, opening the door for challenger Harriet Hageman https://t.co/hAZYKUhVhu",
  "data/tweet-wsj/2022/7/1543229276836724736.json": "From @WSJopinion: The GOP has a golden opportunity to become the party for parents, but it won’t be able to hold on to that title by simply saying so. It will need to prove it, writes @DeAngelisCorey. https://t.co/SPG3dF9EO1",
  "data/tweet-wsj/2022/7/1543168864762183681.json": "The Vatican sold a London commercial building at the center of one of the biggest scandals of Pope Francis’ reign, at a loss of some $140 million https://t.co/dAjZW43vOb",
  "data/tweet-wsj/2022/7/1543350069289689090.json": "From @WSJopinion: The fury of the left’s reaction isn’t merely about guns and abortion. It reflects their grief at having lost the Court as the vehicle for achieving policy goals they can’t get through legislatures. https://t.co/Cd5bYMbtle",
  "data/tweet-wsj/2022/7/1543123588299063299.json": "Since Beijing imposed a national security law on Hong Kong, jailed pro-democracy leaders have spent months without trial and fear they’ll spend the rest of their lives behind bars https://t.co/mM2UjdM74M",
  "data/tweet-wsj/2022/7/1543433116043411457.json": "Cassidy Hutchinson has faced a wave of online attacks from Trump’s supporters following her testimony before the Jan. 6 committee, and is said to have security for her own protection, people close to her said: “She is waking up to a different life.\" https://t.co/QDDt0GtS0M",
  "data/tweet-wsj/2022/7/1543365167358132228.json": "Companies are going all in on advertising their morning-after pills, diverting marketing budgets to spotlight legal emergency contraception https://t.co/c56jN9EhMT",
  "data/tweet-wsj/2022/7/1543323702112182274.json": "A surprising finding suggests that polar bears, which typically depend on sea ice for hunting seals, may prove resilient in the face of the continuing loss of sea ice as the climate warms https://t.co/4SD62WzKix"
}