{
  "data/tweet-economist/2021/2/1356054842997944321.json": "Donald Trump did not only amplify the rise of right-wing conspiracism; he also transformed it https://t.co/ISZHt8NHcJ",
  "data/tweet-economist/2021/2/1356050971433037833.json": "Loyalty is not enough for China's ethnic minorities. The government wants them to become more Chinese https://t.co/QYE0uKWWGN",
  "data/tweet-economist/2021/2/1356067722854101003.json": "Observers in Ulaanbaatar are comparing the resignation of Mongolia’s government to political manoeuvres in neighbouring Russia and nearby Kazakhstan https://t.co/gw73MinrUG",
  "data/tweet-economist/2021/2/1356108189717192706.json": "Videos on social media showed Russian police beating protesters’ until they bled. They deployed tear gas and tasers https://t.co/WUjCZn20rG",
  "data/tweet-economist/2021/2/1356116237332447232.json": "The Kremlin hopes that its Belarusian-style crackdown will suppress the tide of discontent. But Russia is now in a full-blown political crisis https://t.co/AyPIsX0coK",
  "data/tweet-economist/2021/2/1356089460509843458.json": "One question keeps being asked in Asia’s capitals: will America's various crises leave it self-absorbed for years to come?  https://t.co/Cwd1b6C1YP",
  "data/tweet-economist/2021/2/1356137000932356097.json": "The brutality displayed by the Russian police against protesters was a show of force, but also of the Kremlin’s nervousness https://t.co/0JunvGzVDJ",
  "data/tweet-economist/2021/2/1356141803272073216.json": "More than 5,000 people were reported to have been arrested in protests across Russia, including Alexei Navalny’s wife, prominent journalists and a popular rapper, Oxxxymiron https://t.co/fjReHY7OKk",
  "data/tweet-economist/2021/2/1356145810950524931.json": "Since the fall of the Berlin Wall, Italy has had 19 governments, lasting on average just over 18 months https://t.co/GppcCkbwrn",
  "data/tweet-economist/2021/2/1356124492117012502.json": "The European Court of Justice has found Poland in violation of EU environmental directives—yet the country still struggles to decarbonise https://t.co/0708F3nISr",
  "data/tweet-economist/2021/2/1356158580894949377.json": "Some of corporate Germany's biggest names are a result of family break-ups. A fight between the shoemaking Dassler brothers led in 1948 to the creation of Adidas and Puma https://t.co/Fr79PKNHS1",
  "data/tweet-economist/2021/2/1356240008387194881.json": "Myanmar’s army has toppled Aung San Suu Kyi's government and handed power to its commander in chief, Min Aung Hlaing https://t.co/yIqQkWOyHH",
  "data/tweet-economist/2021/2/1356170093823197185.json": "The brutality of the Russian police closely resemble the response to protests in Belarus https://t.co/Vj8LIzpHHJ",
  "data/tweet-economist/2021/2/1356248714797527044.json": "Jumpy professional investors will now have to keep one eye on the Reddit mob—and the other on more conventional risks  https://t.co/VcPSu6d0VC",
  "data/tweet-economist/2021/2/1356264939678265354.json": "With each artefact the characters uncover, they are forced to ask which parts of their own lives might linger for years and centuries, and which parts will vanish without trace https://t.co/A9nS79Qfjf",
  "data/tweet-economist/2021/2/1356271121696436224.json": "A decade after the generals voluntarily relinquished control of Myanmar, they have clawed it back https://t.co/VjB3swfoMa",
  "data/tweet-economist/2021/2/1356295094647795714.json": "Our Big Mac index compares the purchasing power of different currencies https://t.co/P0H2oMTQ3c",
  "data/tweet-economist/2021/2/1356326232963616772.json": "Many analysts believed a coup unlikely. But it is not the first time the Tatmadaw has seized power from Myanmar's democratically elected government https://t.co/POuuueqU0M",
  "data/tweet-economist/2021/2/1356267361742057480.json": "Joe Biden must calm nerves about North Korea by reaffirming and strengthening America’s nuclear umbrella over Japan and South Korea https://t.co/Bp9wSBjj5N",
  "data/tweet-economist/2021/2/1356351435898826752.json": "The EU has earmarked €2bn to help Poland decarbonise https://t.co/ekQAC59ZVm",
  "data/tweet-economist/2021/2/1356361734253117447.json": "We have ranked 90 business schools on their full-time MBA courses, using responses to questions from thousands of current and former students⁠ https://t.co/HDrr3CndUD https://t.co/lhG1Q64Cmc",
  "data/tweet-economist/2021/2/1356367992272138242.json": "Vaccines developed in China and Russia may have an important role to play in the fight against covid-19. But a lack of transparency over trial data could erode trust in vaccines https://t.co/1OipbJQg0j",
  "data/tweet-economist/2021/2/1356409561272487936.json": "The catalyst for the coup was an election held in November. Aung San Suu Kyi's party won a staggering 83% of seats—but the generals claimed the election was unfair https://t.co/QWegpRhCn6",
  "data/tweet-economist/2021/2/1356414115909132295.json": "Poland is the only country in Europe to use more coal-derived energy for heating today than it did in 1990 https://t.co/jM5wsKi4ih",
  "data/tweet-economist/2021/2/1356433957571743744.json": "Why do some people risk their lives for fun? https://t.co/oMgHo3OxJr",
  "data/tweet-economist/2021/2/1356453795094556672.json": "The world has enough manufacturing capacity to produce 16bn doses of a covid vaccine this year, of which 3.3bn doses are planned to be produced in the EU https://t.co/smH9CMiaIN",
  "data/tweet-economist/2021/2/1356404712854196224.json": "Robinhood's dominance with those looking to have fun with the stockmarket has been waning since 2019. The GameStop saga could speed up that decline https://t.co/MQPkC77SFo",
  "data/tweet-economist/2021/2/1356478175421882368.json": "Mongolia’s government resigns after a small protest https://t.co/rvCJ4kg1gP",
  "data/tweet-economist/2021/2/1356493766534782976.json": "Reports suggested that mobile internet connections and phone services had been disrupted in major cities. Yangon airport is closed and the state broadcaster went off air https://t.co/H1doEKgfpP",
  "data/tweet-economist/2021/2/1356489056994144256.json": "The rich world has snapped up most of the global vaccine supply. But hoarding vaccines will only prolong the deadly effects of the pandemic https://t.co/G0FHunA2sM",
  "data/tweet-economist/2021/2/1356544021984915456.json": "The image of Anastasia Vasilyeva at her piano is an illustration of the intelligentsia turning to art as a means of private resistance against the incursions of the state https://t.co/IFLkrFCxRm",
  "data/tweet-economist/2021/2/1356612270273540103.json": "Home heating causes 80% of Poland's emissions of PM2.5, grains of matter that enter lungs easily https://t.co/gHKMt88ynf",
  "data/tweet-economist/2021/2/1356671017758916614.json": "Russian opposition leader Alexei Navalny has been sentenced to over two years in prison. Last month we argued that world leaders should work together to grapple with the country's corruption https://t.co/6TBjNeITpO",
  "data/tweet-economist/2021/2/1356667978423689217.json": "President Joe Biden condemned what he called “a direct assault on the country’s transition to democracy and the rule of law”. The EU, Britain and other democracies have too voiced outrage https://t.co/slpHe3pK0n",
  "data/tweet-economist/2021/2/1356687355944579087.json": "Today's trial of Alexei Navalny has seen him sentenced to over two years in prison. Last month we argued that the world should do more to support Russia's opposition leader https://t.co/4Nyc04anIs",
  "data/tweet-economist/2021/2/1356599166676459522.json": "It remains to be seen whether the public, devoted supporters of Aung San Suu Kyi, will accept military control https://t.co/xACDUTY6XD",
  "data/tweet-economist/2021/2/1356717805094260740.json": "Jeff Bezos will step down as CEO of Amazon, handing reins to Andy Jassy, who currently runs the company's cloud computing business. In June last year, we outlined why the job of running the online giant hasn't got any easier https://t.co/SY0RkxSZqr",
  "data/tweet-economist/2021/2/1356704125539536902.json": "For the first time, the Search for Extraterrestrial Intelligence (SETI) is cocking its ear towards Earth https://t.co/E8C8TJDE4d",
  "data/tweet-economist/2021/2/1356733148730707968.json": "Is democracy in retreat? The latest ranking from The Economist Intelligence Unit gives little reason to be hopeful https://t.co/2BwIUo20Dc",
  "data/tweet-economist/2021/2/1356260821899366404.json": "Britain and the Netherlands are considering introducing “pre-conception agreements”—proposals to make a baby’s intended parents its legal parents at birth https://t.co/0SQVnjR2q1",
  "data/tweet-economist/2021/2/1356741199432933388.json": "Norway, Iceland and Sweden top the Democracy Index from @TheEIU https://t.co/C9svS0inzo",
  "data/tweet-economist/2021/2/1356760523732373505.json": "Jeff Bezos will step down as CEO of Amazon. In June last year, we outlined why the job of running the online giant hasn't got any easier https://t.co/jyXwGGOkyj",
  "data/tweet-economist/2021/2/1356751308238249984.json": "A Brazilian city thought it had herd immunity. It was wrong https://t.co/soF33M879d",
  "data/tweet-economist/2021/2/1356765090326990849.json": "Humans crave freedom, not just security https://t.co/MuB703kXZG",
  "data/tweet-economist/2021/2/1356780235904188416.json": "A study by the IMF found that by increasing the diversity of skills and ideas, migration has boosted living standards by 30% or so in both Britain and America https://t.co/klJT2PjrBT",
  "data/tweet-economist/2021/2/1356463623950974976.json": "Apple’s quarterly sales exceed $100bn for the first time https://t.co/mnZcB1exsU",
  "data/tweet-economist/2021/2/1356804625979105281.json": "Just 8.4% of the world’s population live in a “full democracy” according to The Economist Intelligence Unit’s latest Democracy Index https://t.co/iqlCF546UX",
  "data/tweet-economist/2021/2/1356694638099386369.json": "Pete Buttigieg has been confirmed by the Senate to lead the Department of Transportation. Last year, he spoke with @AnneMcElvoy on “The Economist Asks” podcast. Listen here https://t.co/fWdRt2d31g https://t.co/syMsThGdsk",
  "data/tweet-economist/2021/2/1356290168702050306.json": "That obesity is on the rise in Africa is a sign that poverty levels have improved, but not enough  https://t.co/moL4QA7RLz",
  "data/tweet-economist/2021/2/1356851038670774273.json": "France and Portugal went from being “full democracies” to “flawed democracies” in the latest #DemoIndex https://t.co/BqKDeuO8jN",
  "data/tweet-economist/2021/2/1356837364073701378.json": "Hundreds of babies born to surrogate mothers in Russia and Ukraine were stranded after their intended parents were unable to collect them due to covid-19 travel restrictions https://t.co/vMo1cAaN1E",
  "data/tweet-economist/2021/2/1356856335682404354.json": "Of the 100 European cities with the most air pollution, 29 are Polish https://t.co/xxhOyCENWN",
  "data/tweet-economist/2021/2/1356871740413140995.json": "Thinking of taking on an MBA? Take a look at our ranking of programmes from across the world https://t.co/kntSqiKzFT https://t.co/BHMVwqVZVo",
  "data/tweet-economist/2021/2/1356886452710309889.json": "America and Russia still have 90% of the world’s nuclear warheads. Any effort to stay global nuclear proliferation begins with them https://t.co/4hGLYfRCq9",
  "data/tweet-economist/2021/2/1356897762185519104.json": "Democracy scores for Hong Kong, Belarus and Mali deteriorated in the latest Democracy Index from @TheEIU https://t.co/4czx8CgD0A",
  "data/tweet-economist/2021/2/1356913553886871553.json": "The global score of 5.37 out of ten is the lowest recorded since @TheEIU's Democracy Index began in 2006 https://t.co/AK9iUM2H17",
  "data/tweet-economist/2021/2/1356931748991557632.json": "Just 8.4% of the world’s population live in a “full democracy” according to The Economist Intelligence Unit’s latest Democracy Index. Explore the data\n\nhttps://t.co/slDUB5CMVg",
  "data/tweet-economist/2021/2/1356936115693961216.json": "Russia's Sputnik V vaccine gives around 92% protection against Covid-19, according to trial results published in The Lancet, a scientific journal. Our film from last week explains why distributing vaccines to the world is a major challenge https://t.co/ThFemvIwBt",
  "data/tweet-economist/2021/2/1356906873140740096.json": "Joe Biden understands that centuries of sucking in foreign talent have made America rich and dynamic https://t.co/AIZSDSfqZ7",
  "data/tweet-economist/2021/2/1356974090746265603.json": "In 2020, @TheEIU's Democracy Index fell to the lowest average since it began in 2006 #DemoIndex https://t.co/SnP78MA7eu https://t.co/XVQ0uSZbES",
  "data/tweet-economist/2021/2/1356980037191368705.json": "In some countries, meaningful vaccination coverage—enough for life to return to normal—may not be possible until 2023, if ever https://t.co/EuaDlqwX5I https://t.co/rP4obssk6t",
  "data/tweet-economist/2021/2/1356960412105850882.json": "Russia's Sputnik V vaccine gives around 92% protection against Covid-19, according to trial results published in The Lancet, a scientific journal. Our article from last week looks at new additions to the world’s arsenal of vaccines against the pandemic https://t.co/oVy6FjliZf",
  "data/tweet-economist/2021/2/1357035834629849088.json": "Just 8.4% of the world’s population live in a full democracy #DemoIndex https://t.co/0JYU5URUmX",
  "data/tweet-economist/2021/2/1357073636600000513.json": "The digital yuan will give China a conduit for moving money across its borders without having to rely on SWIFT, a global payments system that comes under American influence #TheWorldIn2021 https://t.co/l98xikpEvp",
  "data/tweet-economist/2021/2/1357059038480072705.json": "Why do some people risk their lives for fun? https://t.co/YEvuMOVskZ",
  "data/tweet-economist/2021/2/1357120191994470401.json": "Government-imposed lockdowns and other pandemic-control measures led to a huge rollback of democratic freedoms in 2020 https://t.co/ArwlbPS7XL",
  "data/tweet-economist/2021/2/1357116238284148738.json": "The global score of 5.37 out of ten is the lowest recorded since @TheEIU's Democracy Index began in 2006 https://t.co/fofgoURd0W",
  "data/tweet-economist/2021/2/1357132853998473218.json": "In 2020, @TheEIU's Democracy Index fell to the lowest average since it began in 2006 #DemoIndex https://t.co/t5siaBhG1N https://t.co/mjwsYKli79",
  "data/tweet-economist/2021/2/1357148175488925696.json": "Among people in Israel aged over 60, severe hospital cases have fallen by 26% since their peak  https://t.co/W2RrkctG01",
  "data/tweet-economist/2021/2/1357156919425851394.json": "Dementia could be prevented or delayed in 40% of cases by attacking 12 risk factors https://t.co/oe2DgoeBfP",
  "data/tweet-economist/2021/2/1357185511824257024.json": "Israel is the place to watch for the ﬁrst evidence about how mass vaccination may change the course of the covid-19 pandemic https://t.co/lbxAD4uY1a",
  "data/tweet-economist/2021/2/1357198253285064706.json": "Part of the problem with the current spike in loneliness stems from contemporary employment. Globally, two in five office workers feel lonely at work https://t.co/aCzlnMIwtc",
  "data/tweet-economist/2021/2/1356889997002031104.json": "RT @TheEIU: Published today, the 13th edition of our Democracy Index addresses questions of life, death and liberty, in a year where the wo…",
  "data/tweet-economist/2021/2/1357210639240945665.json": "Anastasia Vasilyeva, the head of a medical union linked to Alexei Navalny, had just reached the middle section of “Für Elise” when officials entered her flat https://t.co/XEqALkrV02",
  "data/tweet-economist/2021/2/1357202696701435904.json": "Asia is hungry for reassurance from Joe Biden https://t.co/DvxCdsswaF",
  "data/tweet-economist/2021/2/1357219802369163266.json": "Protests are still possible in Myanmar—and so is their violent suppression https://t.co/j6FdYtruyB",
  "data/tweet-economist/2021/2/1357180857774202880.json": "When pondering alternatives to autocracy, the Cultural Revolution weighs heavily on the minds of some Chinese https://t.co/MjfP8XOC9K",
  "data/tweet-economist/2021/2/1357223716674039813.json": "Democracy scores for Hong Kong, Belarus and Mali deteriorated in the latest Democracy Index from @TheEIU https://t.co/sqRyu3vmJU",
  "data/tweet-economist/2021/2/1357194465379762176.json": "In a day by day comparison in Israel of a group of over-60s who had been vaccinated with a group of unvaccinated individuals, the rate of positive infections in the vaccinated group had fallen by a third on the 14th day https://t.co/NCCOmW1MjA",
  "data/tweet-economist/2021/2/1357235875046899715.json": "Israel has been giving out vaccine doses to nearly 2% of its population every day for the past fortnight https://t.co/cUmYQcS946",
  "data/tweet-economist/2021/2/1357239717117521927.json": "London is the world's 20th most expensive city, according to the EIU's cost of living survey. From November 2020 https://t.co/vQ2F1EmfVj",
  "data/tweet-economist/2021/2/1357268688370548736.json": "Just 23 out of 167 countries attained “full democracy” classification in @TheEIU's latest Democracy Index https://t.co/w5ln15V6x4 https://t.co/yp38WEGjMB",
  "data/tweet-economist/2021/2/1357274714276782082.json": "No Zoom call can replace the “chemistry of the unexpected” that you get in person. Humans need offices https://t.co/pYCpxeGDJc",
  "data/tweet-economist/2021/2/1357276722736070656.json": "Moderna is planning to work on a booster shot that will amp up the body’s immune response to the variant found in South Africa https://t.co/Tv7U1SA8Bc",
  "data/tweet-economist/2021/2/1357206748680122369.json": "Bookmark this page to track what Joe Biden does in his first 100 days in office https://t.co/rKi75CGHtn",
  "data/tweet-economist/2021/2/1357298886143070214.json": "Is democracy in retreat? The latest ranking from The Economist Intelligence Unit gives little reason to be hopeful https://t.co/sDJSexCivj",
  "data/tweet-economist/2021/2/1357298884498911232.json": "France and Portugal went from being “full democracies” to “flawed democracies” in the latest #DemoIndex https://t.co/PGslyH5HwT",
  "data/tweet-economist/2021/2/1357266446947123202.json": "“The damage has been done\", is how one diplomat assessed America’s standing in Asia  https://t.co/B9eIkDBOoQ",
  "data/tweet-economist/2021/2/1357321464156930049.json": "Israel has blazed a trail in its ability to distribute and administer vaccines quickly, and other countries are following suit https://t.co/66hqV62IjN",
  "data/tweet-economist/2021/2/1357105718856470528.json": "Mario Draghi, a former central banker, has accepted the offer from Sergio Mattarella, Italy’s president, to head a new government  https://t.co/AE3fixQd01",
  "data/tweet-economist/2021/2/1357302916089004032.json": "The coup, although crushing to Myanmar’s democrats, is also a defeat for the generals. It turns them into pariahs https://t.co/PKO3uBkMj9",
  "data/tweet-economist/2021/2/1357339877029736453.json": "France moved from \"full democracy\" to “flawed democracy” in the latest Democracy Index due to its strict lockdown https://t.co/qeVeIifkde",
  "data/tweet-economist/2021/2/1357016329514082304.json": "Of the 100 European cities with the most air pollution, 29 are Polish https://t.co/bn4Ld2lsNK",
  "data/tweet-economist/2021/2/1357349107656871936.json": "There appear to be two stories behind recent events on Wall Street. One is of an anti-establishment movement causing chaos in high finance, the other is of a market poised to crash. Both gloss over what is really going on  https://t.co/uRPaYUlERS",
  "data/tweet-economist/2021/2/1357332033257758724.json": "The blame game over Europe's clunky vaccine roll-out has begun. Where does the responsibility lie? https://t.co/anmJwh3IDI",
  "data/tweet-economist/2021/2/1357396047274901506.json": "Anastasia Vasilyeva, the head of a medical union linked to Alexei Navalny, was ready for the officers. Not with her lawyer, or a suitcase packed for a spell in detention, but with a polished performance of “Für Elise” https://t.co/LkAHvEOKoi",
  "data/tweet-economist/2021/2/1357422702416588800.json": "The star performer in this year's Democracy Index was Taiwan, which was upgraded to a “full democracy” after rising 20 places https://t.co/A5dhKiH9DH",
  "data/tweet-economist/2021/2/1357306182201991169.json": "Four hundred years on, Artemisia Gentileschi‘s paintings resonate more than ever https://t.co/ydSpgVQitR From @1843mag",
  "data/tweet-economist/2021/2/1357285545420988416.json": "Glencore, a commodities giant with two mines in Congo, reckons that some 2,000 people sneak into its pits every day https://t.co/6hK7kUfqMp",
  "data/tweet-economist/2021/2/1357406089269149696.json": "\"I mortally offended [Vladimir Putin] by surviving. And then I committed an even more serious offence: I didn’t run and hide,” Alexei Navalny said in a speech https://t.co/OwXIYNFTeg",
  "data/tweet-economist/2021/2/1357395612266885123.json": "RT @JamesFransham: In less than 60 days since covid-19 vaccinations began, the world has now administered more doses of vaccine than there…",
  "data/tweet-economist/2021/2/1357390592502870017.json": "Lockdowns have exacerbated a problem that has been spreading in many developed nations for decades: loneliness https://t.co/K0V0p15uoN",
  "data/tweet-economist/2021/2/1357412378065989645.json": "In 1986, Nikolai Antoshkin was summoned to quench the fire at Chernobyl. What he saw would never leave him https://t.co/Zf9ejGmnOE",
  "data/tweet-economist/2021/2/1357483106928852995.json": "About 2.8bn people live in an authoritarian regime, the bottom tier of the @TheEIU's Democracy Index https://t.co/jjAwnGhdxM https://t.co/ZGvjenRUdK",
  "data/tweet-economist/2021/2/1357435777769230339.json": "Rather than apologising to voters for the fact that European pensioners are less protected than American, British or Israeli ones, the EU reminds them that things could be much worse https://t.co/iXabxgZjRC",
  "data/tweet-economist/2021/2/1357427718112034816.json": "Scientists are still learning about the new SARS-CoV-2 variants and how they behave https://t.co/BTYVU6rChX",
  "data/tweet-economist/2021/2/1357444845992820736.json": "Over one-third of Israel’s population has received a vaccination against covid-19  https://t.co/fuOOiH4poi",
  "data/tweet-economist/2021/2/1357326641878474754.json": "The meeting of technology and high finance is a volatile cocktail. But if managed correctly, the economy and investors can win. Our cover in America, Britain and Asia this week https://t.co/9zm0qrBYTf https://t.co/c5uS4bu076",
  "data/tweet-economist/2021/2/1357525912548478976.json": "The Chinese Communist Party has condemned the new British National Overseas visa scheme https://t.co/7H895nt264",
  "data/tweet-economist/2021/2/1357555382386884608.json": "For Tories, the stereotypical Hong Konger is the ideal migrant—hard-working, entrepreneurial, liberty-loving and loyal to a certain idea of Britain https://t.co/Mmy0UPfyw9",
  "data/tweet-economist/2021/2/1357539940968595457.json": "In “Migrations”, human activity has reduced biodiversity to a handful of creatures at the edges of the globe https://t.co/7wes94cFqT",
  "data/tweet-economist/2021/2/1357577579520266242.json": "Sub-Saharan classrooms have been fully or partly shut for 23 weeks. To make matters worse, many children—mostly girls—will never go back to their books https://t.co/xxronvxn6L",
  "data/tweet-economist/2021/2/1357572858474618881.json": "The excitement reflects a fundamental shift in finance. Trading costs for shares have collapsed, information flows are ubiquitous and business models are passing Wall Street by  https://t.co/xQl5rJHXci",
  "data/tweet-economist/2021/2/1357619304167075841.json": "Alexei Navalny's call for sanctions against Vladimir Putin's friends could bring a new charge of treason that carries a sentence of up to 20 years https://t.co/PcrJCz6QoT",
  "data/tweet-economist/2021/2/1357511097759236099.json": "The Earthling Project’s app stands ready to receive whatever melodies earthlings anywhere choose to contribute https://t.co/bHZ0vcAItq",
  "data/tweet-economist/2021/2/1357591769299496966.json": "Over 12,000 people from 45 countries applied to be the only person to attend Sweden's Göteborg Film Festival https://t.co/f9sglrnBLf",
  "data/tweet-economist/2021/2/1357639366227750914.json": "Child-poverty rates in America greatly exceed those in other countries. The social safety-net is especially inadequate for children https://t.co/eiU5mkmQjl",
  "data/tweet-economist/2021/2/1357644875806744576.json": "In the latest Democracy Index from @TheEIU, the global average has fallen to its lowest ever level. Thread👇 (1/11) https://t.co/PYO02k2h4y https://t.co/daTxrZVzvM",
  "data/tweet-economist/2021/2/1357631875817340928.json": "Scientists are still learning about the new SARS-CoV-2 variants and how they behave https://t.co/d2004vgeax",
  "data/tweet-economist/2021/2/1357670815626633217.json": "This week's cartoon from KAL: https://t.co/jv3m4nyAuG https://t.co/lzZ53LCssW",
  "data/tweet-economist/2021/2/1357650696808579073.json": "Soldiers on horseback wore high heels in tenth-century Persia https://t.co/Z5eJEGDmNY From @1843mag",
  "data/tweet-economist/2021/2/1357680122837532672.json": "One in six children in America was living below the federal poverty line in December https://t.co/NjvfoFLPDv",
  "data/tweet-economist/2021/2/1357614657964568577.json": "“Chernobyl will never let go of you,” Nikolai Antoshkin's doctor had told him. True enough https://t.co/1KUf1hRiGA",
  "data/tweet-economist/2021/2/1357700775431004160.json": "Think you know the potato? The island of Chiloé’s boasts 286 varieties https://t.co/vJyKxuh2Cf From @1843mag",
  "data/tweet-economist/2021/2/1357698506312531977.json": "In October, China's primary and secondary schools were directed to make pupils' graduation conditional on their fitness https://t.co/I9OwRVQT4C",
  "data/tweet-economist/2021/2/1357764234202009613.json": "After years of obscurity, the idea of creating an American child benefit is gaining supporters https://t.co/beOUCWzphp",
  "data/tweet-economist/2021/2/1357695495347593219.json": "\"Why are strongmen and autocrats obsessed with their bathrooms? @1843mag plunged into the question https://t.co/zf41ELsFqa\"",
  "data/tweet-economist/2021/2/1357582309596266499.json": "The pent-up effects of stimulus may cause the economy to overheat, leading to a burst of inflation\nhttps://t.co/4Lr1zubAq0",
  "data/tweet-economist/2021/2/1357776021743939587.json": "Daughters in general have long been linked with divorce. But a new paper gives more specific insight as to how https://t.co/NKskQPbhvd",
  "data/tweet-economist/2021/2/1357743823288492033.json": "In a wide-ranging speech, Joe Biden excoriated the “humanitarian and strategic catastrophe” of the war in Yemen https://t.co/GGyUMEwaGH",
  "data/tweet-economist/2021/2/1357784069065633795.json": "The latest proceeding against Alexei Navalny was a mockery of the law https://t.co/Fbabh5FPM8",
  "data/tweet-economist/2021/2/1357688699023147008.json": "As with the overall Brexit trade deal, Europe expects to extract a price for market access. If the price is that the EU writes the rules, Britain should walk away https://t.co/Sn7awk4RSo",
  "data/tweet-economist/2021/2/1357838442181320706.json": "Just 23 out of 167 countries attained “full democracy” classification in @TheEIU's latest Democracy Index https://t.co/idZa5G6trw https://t.co/qukPXMZBHo",
  "data/tweet-economist/2021/2/1357839701642780674.json": "Mitt Romney’s proposal would provide monthly benefits of $350 for young children and $250 for those of school age https://t.co/BS032bNJPk",
  "data/tweet-economist/2021/2/1357831894080122881.json": "ExxonMobil booked its first-ever annual net loss, of a staggering $22bn. BP also announced an annual loss this week https://t.co/HTkBVxg1DC",
  "data/tweet-economist/2021/2/1357848746277691392.json": "The breathable air, drinkable water and tolerable temperatures that allow humans to do everything they do, tend to be taken for granted by economists https://t.co/ShivMbJwAP",
  "data/tweet-economist/2021/2/1357686424141783042.json": "The pent-up effects of stimulus may cause the economy to overheat, leading to a burst of inflation\nhttps://t.co/Afcnms1cyI",
  "data/tweet-economist/2021/2/1357861349565624320.json": "Money might not guarantee happiness, but it does tend to correlate  https://t.co/U83KGo6Xtu",
  "data/tweet-economist/2021/2/1357834421601259523.json": "Joe Biden said he would end all American support for offensive operations in Yemen, although he would continue selling defensive arms to Saudi Arabia  https://t.co/4n7mUE6A95",
  "data/tweet-economist/2021/2/1357891780629397504.json": "No country in the Middle East and north Africa releases an official count of “honour killings”, which typically involve men murdering female relatives for actions they consider immoral https://t.co/ueNnUmHHxv",
  "data/tweet-economist/2021/2/1357903123893923850.json": "India may be the world's biggest democracy, but its government has gained a taste for curtailing freedom before speech https://t.co/IAWPRjATyX",
  "data/tweet-economist/2021/2/1357898827320197120.json": "What’s life really like in Myanmar right now? https://t.co/OWoDtD12WW From @1843mag",
  "data/tweet-economist/2021/2/1357834421425045510.json": "China's government says it wants to foster a “lifelong habit of exercise” and, through art, “noble sentiments\" https://t.co/4dZBSYfHu5",
  "data/tweet-economist/2021/2/1357910333671800832.json": "Ending American arms sales to Saudi Arabia, the world’s largest arms importer between 2015 and 2019, could hobble its war machine https://t.co/P8nXpcmxin",
  "data/tweet-economist/2021/2/1357904868086861828.json": "South Korea is ageing faster than any other country in the world. This means its armed forces have fewer recruits https://t.co/FCGJ4WlXVC",
  "data/tweet-economist/2021/2/1357915692293586949.json": "Myanmar's army argues, unconvincingly, that its coup was a defence of democracy in the face of a stolen election last November, which Aung San Suu Kyi's party won by a landslide https://t.co/2XdcF42tHS",
  "data/tweet-economist/2021/2/1357921234105880576.json": "The rich world is expecting a rapid, vaccine-fuelled recovery. But in sub-Saharan Africa the damaging effects of the pandemic will drag on https://t.co/jh8YZ3dY1c",
  "data/tweet-economist/2021/2/1357867120034471936.json": "Biologists have long assumed that the anatomical shift from functional fin to proto-leg was the result of several genetic mutations. But this might not be the case https://t.co/qlrYqstrIa",
  "data/tweet-economist/2021/2/1357937342338768897.json": "The pandemic has exposed long-standing fragilities in Latin America https://t.co/hR0vZPeJQi",
  "data/tweet-economist/2021/2/1357934054067298304.json": "Few young Japanese people have an interest in venturing outside Japan. This growing insularity worries business leaders and policymakers https://t.co/2avcbJ0ho2",
  "data/tweet-economist/2021/2/1357932093846749184.json": "All you need to know about Myanmar's journey from dictatorship to democracy, and back again https://t.co/0tqmOPZnei https://t.co/FSJ2UMXAAP",
  "data/tweet-economist/2021/2/1357951923161284613.json": "A recent paper found that happiness continues to increase even as income ascends to plutocratic proportions, with two caveats https://t.co/K6owrZO8Uz",
  "data/tweet-economist/2021/2/1357940096977276929.json": "In January China's education ministry pledged to “pay more attention to cultivating pupils’ masculinity” https://t.co/nRc9Vd6FEA",
  "data/tweet-economist/2021/2/1357962692544364546.json": "Siddique Kappan, a journalist, was on his way to investigate the alleged gang rape of a low-caste woman. He was arrested before he arrived https://t.co/PF8HyIi4jk",
  "data/tweet-economist/2021/2/1357740034124873728.json": "The job of overseeing a project costing €2.7bn to vaccinate 450m people was handed to a department whose main previous concern was food labelling https://t.co/HKsVq9lVGB",
  "data/tweet-economist/2021/2/1357980238945353729.json": "What’s life really like in Myanmar right now? @the_ayeminthant took to the streets of Yangon for @1843mag https://t.co/VWA2VAfxQp",
  "data/tweet-economist/2021/2/1357990921250480130.json": "Nancy Sinatra’s reading of “These Boots Are Made For Walkin’” was tough, proto-feminist and a promise of retribution in kind to men who treated women like doormats https://t.co/vvAL5utlov",
  "data/tweet-economist/2021/2/1357969291111448576.json": "Uniqlo’s clothes have been called basic, bland and boring. Why is it so successful? From @1843mag https://t.co/aCxuZzU5Um",
  "data/tweet-economist/2021/2/1357991443487424514.json": "In 1962, Burma had been one of Asia's richest countries. But 50 years of army rule shredded the country's economy. Aung San Suu Kyi's government did not do much better https://t.co/jX96RKuAT8",
  "data/tweet-economist/2021/2/1358002004925288448.json": "For 99 of his 100 years, Captain Sir Tom Moore was unknown by most of his compatriots. But when he died he received tributes from the prime minister and the queen https://t.co/f4f2dTWj60",
  "data/tweet-economist/2021/2/1358011584770105346.json": "Adam Kinzinger is in his political prime with everything to lose, making his criticism of Donald Trump even more remarkable  https://t.co/HSTtuihyjI",
  "data/tweet-economist/2021/2/1358010558453338112.json": "The Kremlin would like Alexei Navalny's sentencing to display its limitless powers. In fact it enhances Mr Navalny’s moral stature at Vladimir Putin’s expense https://t.co/bIiYrO0J97",
  "data/tweet-economist/2021/2/1358015607061544962.json": "Saudi Arabia has all the tanks and warplanes it needs, but Joe Biden’s ban could cut off the supply of munitions and spare parts https://t.co/HGJiUHStN8",
  "data/tweet-economist/2021/2/1358009555171610631.json": "Only 4% of Japanese university students study overseas. Just a third of young Japanese want to study abroad, according to a survey in 2019 https://t.co/9T3LDxCmfG",
  "data/tweet-economist/2021/2/1357997224236642308.json": "On India's Republic Day a small contingent of agricultural workers stormed Delhi's red fort. Then Rihanna got involved. We explain why they are protesting  https://t.co/LFDxvNtVsD",
  "data/tweet-economist/2021/2/1358032709285793793.json": "Having a female ﬁrst-born increases the risk of that child’s parents divorcing. But new research suggests that “daughter-divorce” risk emerges only in her teenage years https://t.co/FgQktNT6mZ",
  "data/tweet-economist/2021/2/1358031447454531585.json": "As a flight commander, Nikolai Antoshkin knew what he was dealing with. In Chernobyl, he was at war with the invisible https://t.co/Ro9XCCw8bK",
  "data/tweet-economist/2021/2/1358015110233661441.json": "“No homosexuals are allowed in the gang, only men,” says one prisoner, recounting how the gangs murder gay people https://t.co/0sJ0cRSX2d",
  "data/tweet-economist/2021/2/1358042797446729728.json": "An “app-tracking transparency” measure on Apple's latest version of iOS could make life difficult for Facebook and other ad-tech businesses https://t.co/nOte7eX5S1",
  "data/tweet-economist/2021/2/1358042798675664896.json": "The more happiness you want, the more expensive it gets https://t.co/PtLl5Wk0yH",
  "data/tweet-economist/2021/2/1358055851555233795.json": "South Korea finds itself between increasingly hostile neighbours. No wonder it is modernising its armed forces https://t.co/ne1ltJfU10",
  "data/tweet-economist/2021/2/1358072716625129473.json": "Shocking numbers of farmers in India are driven to suicide  https://t.co/RdnkwXWJHU",
  "data/tweet-economist/2021/2/1358059896156127235.json": "The two main approaches to making vaccines—cell-culture and mRNA—have benefits and drawbacks https://t.co/Pwtd2GUWZY",
  "data/tweet-economist/2021/2/1357732741777928193.json": "Africa is \"going to lose a decade\", Ghana's finance minister worries https://t.co/iRjCDweyH1",
  "data/tweet-economist/2021/2/1358089273845678080.json": "RT @the_ayeminthant: I speak to people in Yangon on their reaction to the coup, how their histories have intertwined with her history of My…",
  "data/tweet-economist/2021/2/1358085813230333952.json": "The IMF predicts Africa will be the slowest-growing large region this year. Lenders should offer more cheap loans and support proposals to woo more private capital https://t.co/Ua8t6Zd9xZ",
  "data/tweet-economist/2021/2/1358084565072502786.json": "A report estimates that the 8,927 hours of internet restrictions imposed by India's government last year cost the country $2.8bn in forgone economic activity https://t.co/QyMQT96Kdp",
  "data/tweet-economist/2021/2/1358101409904939010.json": "By unleashing violence against peaceful protesters, the Kremlin is helping Alexei Navalny in his main task: undermining Vladimir Putin’s legitimacy https://t.co/vwoAPhVCpp",
  "data/tweet-economist/2021/2/1358106694111395844.json": "Thomas Jefferson developed a taste for mac 'n' cheese while living in France in the 1780s https://t.co/CmZjpXFH5K From @1843mag",
  "data/tweet-economist/2021/2/1358111477492776960.json": "The proposals Mitt Romney lays out to pay for the added $66bn in annual costs are sensible, and could appeal to Democrats if they are willing to listen https://t.co/fAdAJ1jePL",
  "data/tweet-economist/2021/2/1357798412800978945.json": "Insider-dealing and manipulation rules need to be modernised to deal with new information flows in high finance. The system's plumbing needs a renovation https://t.co/PdRyr3mUUy",
  "data/tweet-economist/2021/2/1358128957871296512.json": "It took just a few hundred years to destroy the dynamic equilibrium of the carbon cycle. It will take hundreds more to restore it https://t.co/DDSxxkiUvm https://t.co/KjsdEBP7l0",
  "data/tweet-economist/2021/2/1358133386011934720.json": "A recent study found that money is not nearly as important to individual happiness as factors such as health, religion and family  https://t.co/743yEsFdXt",
  "data/tweet-economist/2021/2/1358108471443546116.json": "Scientists who travelled to the bottom of the South China Sea discovered plastic bags, bottles and food wrappers, all teeming with life https://t.co/3ky9RxJyaI",
  "data/tweet-economist/2021/2/1358136645552381953.json": "Joe Biden’s move might prod Saudi Arabia’s other partners into action https://t.co/DDA8m9eyAL",
  "data/tweet-economist/2021/2/1358148728713052162.json": "People sense that Latin American democracies cannot carry on like this https://t.co/QLvuIndK6k",
  "data/tweet-economist/2021/2/1358099904397213698.json": "As the generals seize control again, @1843mag finds out what life is like on the streets of Yangon https://t.co/cJvwMRe6n6",
  "data/tweet-economist/2021/2/1358185724198203393.json": "By overlooking the role nature plays in economic activity, economists underestimate the risks from environmental damage to growth and human welfare https://t.co/w17lNZu95O",
  "data/tweet-economist/2021/2/1358161560586305539.json": "Africa is years away from jabbing enough people to achieve general immunity. Leaders and donors must do more to speed up vaccinations  https://t.co/mfBNYa6dE0",
  "data/tweet-economist/2021/2/1358201084045574145.json": "About 2.8bn people live in an authoritarian regime, the bottom tier of the @TheEIU's Democracy Index https://t.co/I3joEe0Zvn https://t.co/rGOsMh4EWZ",
  "data/tweet-economist/2021/2/1358201823237206019.json": "France moved from \"full democracy\" to “flawed democracy” in the latest Democracy Index due to its strict lockdown https://t.co/KWZskZewHF",
  "data/tweet-economist/2021/2/1358211371935166464.json": "While the other nine Republicans who voted to impeach Donald Trump have been lying low, Adam Kinzinger has since expanded his critique  https://t.co/dMhYkhg7eG",
  "data/tweet-economist/2021/2/1358202335814647810.json": "Unlike Joe Biden’s temporary child-benefit scheme, proposed as part of his stimulus, Mitt Romney’s is a permanent welfare reform https://t.co/6owezJ7ICO",
  "data/tweet-economist/2021/2/1358089586354905090.json": "The sole attendee to Sweden's seven-day Göteborg Film Festival is apparently so lonely she has \"started talking to the stove\" https://t.co/a79KiJ5suv",
  "data/tweet-economist/2021/2/1358215619095724032.json": "The reality of life under a military regime is all too familiar to the people of Myanmar. @the_ayeminthant finds fear and defiance on the streets of Yangon https://t.co/S6vqKorxLs",
  "data/tweet-economist/2021/2/1358228387597324289.json": "In the early days, Apple enabled ad tracking on phones. Now privacy is more central than ever to Apple’s brand https://t.co/VEC4Ng1IRA",
  "data/tweet-economist/2021/2/1358223713058099200.json": "Vaccine-makers who rely on live cultures constantly struggle with yields. Using this method to make a lot of vaccine, fast, is difficult  https://t.co/4H6fye07ar",
  "data/tweet-economist/2021/2/1358240941727973376.json": "There is actually no good reason to assume an upper limit to longevity, or that ageing must come with decline https://t.co/91s6ehCzjr",
  "data/tweet-economist/2021/2/1358254705701445634.json": "Surveys conﬁrm that teenage daughters and fathers, in particular, get on each other’s nerves https://t.co/55hudKqKx5",
  "data/tweet-economist/2021/2/1358250515855990786.json": "India's government is trying to silence individual critics. It has appealed to “cyber volunteers” to join police in hunting “anti-national content” on the internet https://t.co/BUraAxSYtY",
  "data/tweet-economist/2021/2/1358267257042968577.json": "In the event of war, command of South Korea's armed forces would be handed to an American. South Korea's government is trying to change this, but cannot build capacity fast enough https://t.co/cBmx18CMXA",
  "data/tweet-economist/2021/2/1358135134613098496.json": "Far from being a passing fad, the disruption of markets will intensify  https://t.co/YNfq56gD43",
  "data/tweet-economist/2021/2/1358273039004299264.json": "The end of the grand fantasy: restaurant dining may never be the same again https://t.co/6TmkSLQ0F4 From @1843mag",
  "data/tweet-economist/2021/2/1358284106317127681.json": "New agricultural laws rushed through parliament by Narendra Modi were thin on detail, and would deregulate the market in several ways. Farmers fear they could be manipulated https://t.co/JflV2TqkH2",
  "data/tweet-economist/2021/2/1358297524088545280.json": "Local authorities sometimes register honour killings as suicides or disappearances https://t.co/T6C2lDK1rV",
  "data/tweet-economist/2021/2/1358293419425222656.json": "Myanmar's top general says his government will focus on battling covid-19 and solving economic problems. His claims about brokering peace with armed insurgents seem less plausible https://t.co/N1X4QoYWnO",
  "data/tweet-economist/2021/2/1358302237748002816.json": "Employees of tech firms complain about what they call China's “996” culture: an expectation that they should be in the office from 9am to 9pm, six days a week https://t.co/JEWEdiX8w2",
  "data/tweet-economist/2021/2/1358320122117709830.json": "Researchers found nearly 1,200 individual organisms representing 49 different species in amongst plastic waste they found at the bottom of the deep ocean https://t.co/mNv0enGFNj",
  "data/tweet-economist/2021/2/1358292265307955201.json": "Because sub-Saharan Africa’s population is growing at 2.7% a year, GDP needs to grow at least as fast. Last year the area’s economy shrank for the first time in 25 years. https://t.co/XLNjWx9MFC",
  "data/tweet-economist/2021/2/1358342415636176899.json": "All you need to know about Myanmar's journey from dictatorship to democracy, and back again https://t.co/xDocngxMkJ https://t.co/If9YiFWVux",
  "data/tweet-economist/2021/2/1358340129962815491.json": "Who owns the Moon? As countries and companies prepare to return, new space laws will be hard to put in place https://t.co/LZC2ihNOP7 https://t.co/ZjrnkrNk2Z",
  "data/tweet-economist/2021/2/1358068944125517825.json": "Some 4,300 companies have begun using the virtual business cards created by Sansan, a Japanese company, since June https://t.co/uMxaD9Cr9v",
  "data/tweet-economist/2021/2/1358353158188240896.json": "Most Russians under 40 now get their news and views from the internet and social media, where Alexei Navalny is far cannier than Vladimir Putin https://t.co/Ilpt8BNXVN",
  "data/tweet-economist/2021/2/1358349217383735296.json": "All you need to know about Myanmar's journey from dictatorship to democracy, and back again https://t.co/atuFJEHfZA https://t.co/Si0dry4s2V",
  "data/tweet-economist/2021/2/1358364402576220160.json": "Sir Tom hit a couple of Britain's soft spots: a love of the underdog and a fascination with the second world war https://t.co/ynrh5udOHb",
  "data/tweet-economist/2021/2/1358310300651511808.json": "In late January, 71% of the Chicago Teachers Union voted to walk off the job rather than be forced to resume teaching inside classrooms https://t.co/kfpdsN56on",
  "data/tweet-economist/2021/2/1358386803443720194.json": "Police in some Indian states threaten that people who protest or publish “anti-national content” will be unable to get a passport or a government job  https://t.co/Uo1cMb40de",
  "data/tweet-economist/2021/2/1358360112742678530.json": "Latin America’s health-care and social-protection schemes are fragmented, its economies are stagnant and its political systems are discredited https://t.co/6861pvW0QX",
  "data/tweet-economist/2021/2/1358393846477029377.json": "2020: the year the future was cancelled https://t.co/kgwJztVnRx From @1843mag",
  "data/tweet-economist/2021/2/1358405913179287554.json": "What’s life really like in Myanmar right now? https://t.co/zfP51mXewd From @1843mag",
  "data/tweet-economist/2021/2/1358413466407731206.json": "An analysis of Mitt Romney’s proposal finds it would slash rates of overall child poverty by one-third and rates of deep child poverty by one-half https://t.co/JdTaVzGTVU",
  "data/tweet-economist/2021/2/1358401892972396552.json": "India won independence through peaceful protest. But its current government does not seem so keen on it https://t.co/zgKCKsrAse",
  "data/tweet-economist/2021/2/1358265499302436865.json": "A virtual business card, summoned via a QR code, is the latest pandemic accessory for business people in Asia https://t.co/xt5cmsNCso",
  "data/tweet-economist/2021/2/1358422455191298050.json": "Adam Kinzinger says he regrets voting for Donald Trump, is glad Joe Biden won and advocates sweeping Republican reform https://t.co/POkKosJONT",
  "data/tweet-economist/2021/2/1358402144064405505.json": "Japan is eager to play a more active role on the world stage. But many of its young people are not https://t.co/QZZKxSLGWW",
  "data/tweet-economist/2021/2/1358435111113523201.json": "With nearly 60% of all Indians depending primarily on agriculture for their income, any disruption to the sector has a colossal impact on the whole country https://t.co/Jyr62gbgBf",
  "data/tweet-economist/2021/2/1358377505175068673.json": "“Unforgivable” opens with four gay inmates who have been banished to a single cell in the isolation wing because the rest of the prison has converted to Pentecostalism, which shuns homosexuality https://t.co/cWalibuZEa",
  "data/tweet-economist/2021/2/1358441151024553986.json": "Biologists may have found the source of the crucial change that enabled the ancestor of mice—and of humans—to scramble ashore and leave the sea behind https://t.co/JTPWYYZ8hS",
  "data/tweet-economist/2021/2/1358454491767529473.json": "Nikolai Antoshkin sprang to the task at Chernobyl: he called in 600 volunteer pilots from all over the Soviet Union and commandeered 100 helicopters https://t.co/ONXjYQGv4s",
  "data/tweet-economist/2021/2/1358447452819496960.json": "Even those who are too young to remember the era of the junta live in its shadow. @the_ayeminthant reports from the streets of Yangon https://t.co/zesJUwBSdy",
  "data/tweet-economist/2021/2/1358490837806686208.json": "Loneliness isn't just a problem for people who are isolated—it also affects those with lots of friends and family https://t.co/TlqTcKZp2S https://t.co/fGVTJT38TX",
  "data/tweet-economist/2021/2/1358407677873946629.json": "“People often ask me: ‘Why are you still here?’” Fran Lebowitz says. “Like, okay, where would you suggest?” https://t.co/fsPs2FWA17",
  "data/tweet-economist/2021/2/1358499787981656069.json": "How a volcanic eruption led to the birth of the bicycle https://t.co/F5MGedoe4u From @1843mag",
  "data/tweet-economist/2021/2/1358511127559360513.json": "Apple is trying to shift the internet’s business model from being ad-supported to paid for, Facebook argues https://t.co/27At2X0aMV",
  "data/tweet-economist/2021/2/1358520937323393033.json": "Scientists are trying to understand the process of ageing in all its extraordinary complexity, and to intervene much earlier https://t.co/I22OEggsEv",
  "data/tweet-economist/2021/2/1358445438815195141.json": "Russians protesting against Alexei Navalny’s imprisonment are raising gold-painted plastic toilet brushes aloft, like torches of liberty. @DrMatthewSweet explores why for @1843mag  https://t.co/fiM3nK0lwF",
  "data/tweet-economist/2021/2/1358533014318436355.json": "A new report makes the hard-headed case that services provided by nature are an indispensable input to economic activity https://t.co/9cTdCjOIpk",
  "data/tweet-economist/2021/2/1358521939195756548.json": "The Chicago Teachers Union wants all teachers vaccinated before they will return to in-person lessons https://t.co/U7sFjnzLqL",
  "data/tweet-economist/2021/2/1358497781292367884.json": "The excitement reflects a fundamental shift in finance. Trading costs for shares have collapsed, information flows are ubiquitous and business models are passing Wall Street by  https://t.co/NzHdSC9lrh",
  "data/tweet-economist/2021/2/1358563729235992576.json": "In 2020, @TheEIU's Democracy Index fell to the lowest average since it began in 2006 #DemoIndex https://t.co/ibrXLvbiS2 https://t.co/4SBfPvcHW9",
  "data/tweet-economist/2021/2/1358588733109514244.json": "If the Republican Party does not turn on Trumpism now, it will struggle to do so credibly later https://t.co/AUxlK3oHCj",
  "data/tweet-economist/2021/2/1358554155854557185.json": "The average cost of a 30-second ad during this year’s Super Bowl is expected to reach $5.6m—a 7% increase from last year  https://t.co/rDtgdRbjbx",
  "data/tweet-economist/2021/2/1358576572245159940.json": "Latin American countries with elections this year are a diverse bunch: Chile is a mature democracy, Ecuador and Peru are rowdier ones  https://t.co/ILTgeOu1eF",
  "data/tweet-economist/2021/2/1358610008947232770.json": "The star performer in this year's Democracy Index was Taiwan, which was upgraded to a “full democracy” after rising 20 places https://t.co/ql37k4LtCu",
  "data/tweet-economist/2021/2/1358605365412311040.json": "Of the 74 current or impending vacancies on the federal bench, 46 were or are occupied by judges appointed by Republicans, according to the Brookings Institution https://t.co/CFC2SCsA7g",
  "data/tweet-economist/2021/2/1358622856675008514.json": "Before protests, the Indian government preemptively pulls the plug on internet service—a tactic they pioneered in Kashmir https://t.co/rmffmdT2Au",
  "data/tweet-economist/2021/2/1358645961703227395.json": "Many young Japanese cite shyness about speaking English as a reason for not wanting to study or work abroad https://t.co/IpMdIZJ8Sk",
  "data/tweet-economist/2021/2/1358642004570370048.json": "South Korea finds itself between increasingly hostile neighbours. No wonder it is modernising its armed forces https://t.co/R01ngIDLKI",
  "data/tweet-economist/2021/2/1358667409360642052.json": "Hundreds of thousands of farmers are demanding that Narendra Modi's government revoke its new agricultural laws https://t.co/DOws8q0U5i",
  "data/tweet-economist/2021/2/1358633849568321539.json": "“There is very little hope, but we must keep working on the side of hope.” @1843mag discovers what life is really like in Myanmar https://t.co/tKf9JpQSah",
  "data/tweet-economist/2021/2/1358737592536227841.json": "Facebook argues that Apple’s privacy changes would hurt small businesses  https://t.co/DKRdnpgUEN",
  "data/tweet-economist/2021/2/1358782513280397315.json": "The Holocaust and the mass murder of Tutsis in Rwanda are generally agreed to be examples of genocide. But what about the Chinese government's horrific treatment of the Uyghurs? https://t.co/m6NJbI2uMX",
  "data/tweet-economist/2021/2/1358801411782377474.json": "British lawyers have found evidence of genocide against Uyghurs in Xinjiang. Last year @1843mag explored the stories of London's Uyghur community https://t.co/7fEFJDSKBU",
  "data/tweet-economist/2021/2/1358791221666283529.json": "Joe Biden's team is hunting for public defenders, scholars and civil-rights lawyers as potential nominees—a sharp contrast with Donald Trump's judicial lineup https://t.co/KfFN4tK2Jg",
  "data/tweet-economist/2021/2/1358835428925853702.json": "In a recent poll, 61% of Israelis said they did not want ultra-Orthodox parties in the next government. That might be a problem for Mr Netanyahu  https://t.co/zpVPkPrBrp",
  "data/tweet-economist/2021/2/1358875253028577280.json": "British lawyers say that Xi Jinping could be held accountable for human rights abuses against Uyghurs. @1843mag spoke to Uyghurs exiled in London From 2020 https://t.co/UBGTnn7jgC",
  "data/tweet-economist/2021/2/1358926364745859074.json": "The Holocaust and the mass murder of Tutsis in Rwanda are generally agreed to be examples of genocide. But what about the Chinese government's horrific treatment of the Uyghurs? https://t.co/KN8VB2Rbck",
  "data/tweet-economist/2021/2/1358954328585883660.json": "The president says his first Supreme Court nominee will be a black woman https://t.co/nREuOFyFMu",
  "data/tweet-economist/2021/2/1358949355663872000.json": "Donald Trump's previous impeachment trial centred on whistleblower testimony. This one hinges on things that happened in plain view https://t.co/QoCoptygMj",
  "data/tweet-economist/2021/2/1358870738023899143.json": "The evidence against Donald Trump is perhaps even more damning this time than for the last impeachment trial, but his hold on the Republican Party is just as strong https://t.co/VbxURJZMwd",
  "data/tweet-economist/2021/2/1358810287751786501.json": "Today 90% of countries have some form of minimum wage. Why does it continue to be such a divisive topic in economics? https://t.co/mZV68NEHag",
  "data/tweet-economist/2021/2/1359001115489107969.json": "How vaccines are made, and why it is hard https://t.co/dqP7u0uWIs",
  "data/tweet-economist/2021/2/1358978242447818753.json": "All you need to know about Myanmar's journey from dictatorship to democracy, and back again https://t.co/571iW6VaQB https://t.co/l2T8FbiRk9",
  "data/tweet-economist/2021/2/1359024209343746048.json": "How Europe dodges responsibility for its vaccine fiasco https://t.co/sDGxTnRxw3",
  "data/tweet-economist/2021/2/1359010027063943169.json": ".@the_ayeminthant spoke to \"May\" who has been teaching people how to use a virtual private network, so that users can visit websites blocked by the government https://t.co/4roXWQZmXo",
  "data/tweet-economist/2021/2/1358672434333949952.json": "Reimposing general sanctions against Myanmar will hurt the poorest people in the country https://t.co/R1BsPpT22a",
  "data/tweet-economist/2021/2/1359065059327098880.json": "The great inflation mystery: why has it remained stubbornly low? https://t.co/ibhMVKEGQ6 https://t.co/CcBkddllup",
  "data/tweet-economist/2021/2/1358702265528446976.json": "The story behind China’s nationwide love affair with the piano https://t.co/Mo0uzXs4JZ https://t.co/Jcean7a5kT",
  "data/tweet-economist/2021/2/1359146563487100941.json": "Bitcoin's wild ride just got wilder. Tesla bought $1.5bn of Bitcoin, sending its price soaring again. But as our article from January argues, the cryptocurrency is unlikely to up-end global finance https://t.co/gPDSxIbDVi",
  "data/tweet-economist/2021/2/1359178021857599490.json": "Carmaker Tesla has announced that it may soon accept Bitcoin as payment. Our leader from January examined the recent Bitcoin mania https://t.co/bBEvDrl4xy",
  "data/tweet-economist/2021/2/1359215672694366210.json": "Models suggest that a global temperature rise of 2ºC could wipe out 56% of the world's existing wine-growing regions https://t.co/nWsl6dwtYt https://t.co/wohUX69DTF",
  "data/tweet-economist/2021/2/1359045022419664897.json": "The minimum wage: does it hurt workers in the long run? https://t.co/6D5UtHd8Tz",
  "data/tweet-economist/2021/2/1359241184686833664.json": "The Ordinary is a case study in the art of \"unselling\" https://t.co/8DKsCVayNn From @1843mag",
  "data/tweet-economist/2021/2/1359150646566526986.json": "China's youth are both patriotic and socially progressive. That mix is already changing their country. Thread 👇 https://t.co/JqvaUyuKfN https://t.co/CGPSWrmOA3",
  "data/tweet-economist/2021/2/1359105326172299264.json": "Donald Trump's second impeachment trial in the Senate begins today. We explain how such trials are conducted https://t.co/lGUzoo8ArY",
  "data/tweet-economist/2021/2/1358768819779612672.json": "Money will be tight in Latin America, but the demand for better benefits and public services will rise https://t.co/UdVszmltL7",
  "data/tweet-economist/2021/2/1359307199223324678.json": "Apple is trying to shift the internet’s business model from being ad-supported to paid for, Facebook argues https://t.co/eL0Y5GRiML",
  "data/tweet-economist/2021/2/1359286713718345728.json": "Dora Maar’s art is finally getting the recognition it deserves https://t.co/5klp1aoEbE From @1843mag",
  "data/tweet-economist/2021/2/1359331017581019146.json": "The growing digitalisation of critical infrastructure, such as water or power plants, has rendered it vulnerable as never before https://t.co/CbjeIq9whn",
  "data/tweet-economist/2021/2/1359371023372673027.json": "How Europe dodges responsibility for its vaccine fiasco https://t.co/41OHpYMzD1",
  "data/tweet-economist/2021/2/1359356369074282497.json": "“In China’s speed-obsessed tech world, the labour law is treated like a tablecloth or toilet paper. It is never respected,” said the narrator of one viral video https://t.co/h0ElmZNAyw",
  "data/tweet-economist/2021/2/1359375786327891971.json": "It now looks as if the pandemic will leave more lasting scars in Africa than elsewhere. Africa’s covid-induced calamity must be mitigated urgently https://t.co/Ulie4tzH1w",
  "data/tweet-economist/2021/2/1359366511048224769.json": "Scientists who travelled to the bottom of the South China Sea discovered plastic bags, bottles and food wrappers, all teeming with life https://t.co/vvXS3UMaHH",
  "data/tweet-economist/2021/2/1359351725061201920.json": "“No homosexuals are allowed in the gang, only men,” says one prisoner, recounting how the gangs murder gay people https://t.co/8dSWqRSCIc",
  "data/tweet-economist/2021/2/1359409304328146948.json": "Of the 100 European cities with the most air pollution, 29 are Polish https://t.co/P5tNf1DbZE",
  "data/tweet-economist/2021/2/1359405503202353153.json": "The more happiness you want, the more expensive it gets https://t.co/xpFcn0KThI",
  "data/tweet-economist/2021/2/1359396440435552257.json": "Some of history’s greatest minds were often the most boring https://t.co/GnIutunjSA From the @1843mag archive",
  "data/tweet-economist/2021/2/1359440230064001027.json": "New research shows that parents of teenage daughters argue more about parenting than do the parents of sons https://t.co/4GJ9MYhew5",
  "data/tweet-economist/2021/2/1359543434386759688.json": "Fake news has been around forever. The internet just made it profitable again. From the archive @1843mag https://t.co/jFqu9xaKEH",
  "data/tweet-economist/2021/2/1359516985147727873.json": "In 1986, Nikolai Antoshkin was summoned to quench the fire at Chernobyl. What he saw would never leave him https://t.co/XQO0BUALcJ",
  "data/tweet-economist/2021/2/1359555683499311112.json": "Apple is trying to shift the internet’s business model from being ad-supported to paid for, Facebook argues https://t.co/sDdJ2s2UGg",
  "data/tweet-economist/2021/2/1359582210005864450.json": "The blurring of lines between work and home doesn’t leave much space for us to actually talk to each other, as @mrkocnnll learns from his son  https://t.co/9RGUHm7PWO",
  "data/tweet-economist/2021/2/1359537814891880449.json": "China's government says it wants to foster a “lifelong habit of exercise” and, through art, “noble sentiments\" https://t.co/Gyta3YddCl",
  "data/tweet-economist/2021/2/1359683613453910018.json": "Analysis by the Peterson Institute for International Economics shows that overall, Donald Trump's approach to trade with China was foolish https://t.co/rJO5EatAsJ",
  "data/tweet-economist/2021/2/1359692480103514114.json": "A cult leader gets 1,000 years in jail for keeping sex slaves https://t.co/Ckipan2rPL",
  "data/tweet-economist/2021/2/1359704345579839494.json": "In poorer countries, meaningful vaccination coverage—enough for life to return to normal—may not be possible until 2023, if ever https://t.co/r8y2jGaMCn",
  "data/tweet-economist/2021/2/1359700151909175297.json": "The more happiness you want, the more expensive it gets https://t.co/6E8jO2v1gy",
  "data/tweet-economist/2021/2/1359708997151035397.json": "In cities across Myanmar police have fired tear gas, water cannons and rubber bullets into crowds of protesters https://t.co/TKdzT1eLCZ",
  "data/tweet-economist/2021/2/1359721046669197314.json": "There is actually no good reason to assume an upper limit to longevity, or that ageing must come with decline https://t.co/pfbgMOkunE",
  "data/tweet-economist/2021/2/1359734236253675520.json": "Humans crave freedom, not just security https://t.co/Kt5TVSa3Zk",
  "data/tweet-economist/2021/2/1359730144563376136.json": "Pickleball—a hybrid of tennis, badminton and ping-pong—is growing in popularity https://t.co/o9bLUfvkm5",
  "data/tweet-economist/2021/2/1359738394792890368.json": "Scientists who travelled to the bottom of the South China Sea discovered plastic bags, bottles and food wrappers, all teeming with life https://t.co/3QjkMXZH8C",
  "data/tweet-economist/2021/2/1359775155300540416.json": "Younger people are more educated, organised and connected than the last time the country was convulsed with protests, in 2007. They are unlikely to back down meekly https://t.co/UL2IO1LEp1",
  "data/tweet-economist/2021/2/1359789938569527300.json": "The malaria parasite is not visible to the naked eye. But it has profoundly shaped the course of human history https://t.co/9C7SE842Cg https://t.co/9RJHXKRaIV",
  "data/tweet-economist/2021/2/1359814543912939520.json": "The more happiness you want, the more expensive it gets https://t.co/Uhh0DoBgyE",
  "data/tweet-economist/2021/2/1359666621216915460.json": "Agents from Myanmar's feared intelligence service are knocking on doors, prompting many activists and journalists to go into hiding https://t.co/fpZ52M7Xic",
  "data/tweet-economist/2021/2/1359810162832375808.json": "Scientists who travelled to the bottom of the South China Sea discovered plastic bags, bottles and food wrappers, all teeming with life https://t.co/bnp1ihcVm1",
  "data/tweet-economist/2021/2/1359868009389711360.json": "Vaccines will not see off covid-19 entirely. Governments must start thinking about how to live with the virus as an endemic disease. Our cover this week https://t.co/PzQKLai9ps https://t.co/gNx2WE9sO9",
  "data/tweet-economist/2021/2/1359725984497491969.json": "We have calculated a geographic centre of the global pandemic. Free to read https://t.co/Dcde5Pn3Ce",
  "data/tweet-economist/2021/2/1359880963136901121.json": "Kim Jong Un brought a portable toilet to a North Korea-US summit, apparently to prevent his faeces being collected and analysed by a rival intelligence service https://t.co/5K5ccKgE5h",
  "data/tweet-economist/2021/2/1359951629773139975.json": "Dealing with Russia is the most pressing foreign-policy problem facing the EU. It is also where the bloc is least coherent https://t.co/E8ZAgqTqKT",
  "data/tweet-economist/2021/2/1359932413984522240.json": "RT @gadyepstein: I wrote about Tibet, where authorities have intensified their efforts to crush Tibetan identity. They want Tibetans to cre…",
  "data/tweet-economist/2021/2/1359885671180230657.json": "A direct command is hardly required to persuade someone to do something https://t.co/Fe8MwQcnnv",
  "data/tweet-economist/2021/2/1360059583063089152.json": "According to astrobiologists there may be as many as 300m potentially habitable worlds arou d sun-like stars in the Milky Way https://t.co/Tke1B7MmvM",
  "data/tweet-economist/2021/2/1359998911331590144.json": "A new study suggests that about half of the sun-like stars in the Milky Way are circled by at least one rocky planet capable of sustaining liquid water on its surface https://t.co/4wSIS7Dp6a",
  "data/tweet-economist/2021/2/1359993894092611587.json": "Outside the rich world, 85% of countries have yet to start their vaccination programmes. Until those billions of people are jabbed, which may not be before 2023, they will remain fuel for the virus https://t.co/1Bh0J4E57Y",
  "data/tweet-economist/2021/2/1360064692874600451.json": "Both the Biden and Romney plans try to avoid politics and punishing low-income people with high effective marginal tax rates if they receive a pay rise https://t.co/Xz11FA8w49",
  "data/tweet-economist/2021/2/1360026263554035712.json": "Telescopes and spacecraft are, or soon will be, looking for signs of life in places in the solar system and further beyond in the Milky Way https://t.co/96h2eF8Ifa",
  "data/tweet-economist/2021/2/1360152130817032193.json": "Cashless societies would be more efficient, but also more vulnerable to technical failures, cyber attacks and invasions of privacy https://t.co/1Wo4wqBOYr https://t.co/CAWQgM8S6d",
  "data/tweet-economist/2021/2/1360160112917282820.json": "RT @_rospearce: A map of covid-19 vaccine orders, sized by population.\n\n🔵 At least two doses per adult ordered\n🔴 Under two doses per adult…",
  "data/tweet-economist/2021/2/1360178088823447553.json": "Depending on where in Europe you are, Russia can be a potential or even necessary ally, a business opportunity or an existential threat https://t.co/whzproGJO0",
  "data/tweet-economist/2021/2/1360163251795988481.json": "In France, last spring's lockdown increased the gap in exam scores between normal schools and ones in hard-up areas by several points https://t.co/vZ9bmc1Do0",
  "data/tweet-economist/2021/2/1360182736934297600.json": "An observatory in Hawaii spotted a celestial object in the sky. It was dubbed ‘Oumuamua, meaning “a messenger from afar”. Did an alien civilisation send it? https://t.co/ZWZaYMeMbT",
  "data/tweet-economist/2021/2/1359934993909354502.json": "One of science's most philosophical questions is, \"Is there life elsewhere in the universe?\" https://t.co/vckJMnjcxu",
  "data/tweet-economist/2021/2/1360209810432655361.json": "This week’s cartoon from KAL: https://t.co/PlD7tY22tR https://t.co/ZwdZksWITT",
  "data/tweet-economist/2021/2/1360217994492858379.json": "Since November the cost of shipping a 40-foot container from Asia to Europe has risen from $2,200 to about $8,000 https://t.co/dHKWYFt577",
  "data/tweet-economist/2021/2/1360132261505617923.json": "The German Kennel Club says dog sales increased by 20% in 2020 https://t.co/tVo9lIiBen",
  "data/tweet-economist/2021/2/1360222626543775746.json": "In Germany, the first lockdown cut studying time from 7.4 hours per day to 3.6 https://t.co/O08K8WO40b",
  "data/tweet-economist/2021/2/1360243047028637696.json": "Many countries are relying on COVAX, a global coalition to distribute covid-19 vaccines https://t.co/XFv2XRT7nY",
  "data/tweet-economist/2021/2/1360261997733031936.json": "Have women been better leaders during the pandemic? “There are so fewer [women]...in charge of those issues, the fact that many of them have been successful is also an indication that they’re pretty damn good,” says @Lagarde on “The Economist Asks” podcast https://t.co/BkMXJ7sXUp https://t.co/8oZaGk42mg",
  "data/tweet-economist/2021/2/1360000704702799886.json": "In the struggle between democracy and dictatorship, it is crucial that democracies tell the truth in plain language. China is committing crimes against humanity in Xinjiang. That is different from genocide https://t.co/CoqJhmrCPB",
  "data/tweet-economist/2021/2/1360176401358422018.json": "Does society need a new social contract? The Economist’s editor-in-chief @zannymb asks @ECB president Christine @Lagarde on “The Economist Asks” podcast https://t.co/3TH1rNpM9Z https://t.co/KjrVjx9Ibd",
  "data/tweet-economist/2021/2/1360284541403938816.json": "In the past year women have been murdered for such offences as wearing make-up and chatting online. Last month a Saudi woman was killed by her brothers for having a Snapchat account https://t.co/fKdXisRrTt",
  "data/tweet-economist/2021/2/1360296944132890627.json": "Salty, stodgy and delicious, pierogi are the ultimate comfort food https://t.co/8GVOOKOpJW From @1843mag",
  "data/tweet-economist/2021/2/1360321277840547847.json": "The Proud Boys, a far-right group, adopted black-and-yellow Fred Perry polo shirts as a uniform. Now the British clothing company has stopped selling them in America https://t.co/r2vaRaVg1X From @1843mag",
  "data/tweet-economist/2021/2/1360344220175892485.json": "Mario Draghi, the former president of the European Central Bank, is due to be sworn in as Italy’s prime minister on February 13th https://t.co/oI1EK8jrxN",
  "data/tweet-economist/2021/2/1360277287288111105.json": "Recep Tayyip Erdogan often depicts protests as part of an existential struggle between conservative and degenerate—and then crushes them https://t.co/g6S2N2fsb0",
  "data/tweet-economist/2021/2/1360363819881680899.json": "At least in theory, vaccine makers should be able to produce 2.1 shots—more than a full regimen—for each of the world’s 5.8bn adults by the end of the year https://t.co/68b8SSy1TN",
  "data/tweet-economist/2021/2/1360391498525782016.json": "Getting caught with a small amount of drugs in Oregon is now like getting a traffic ticket https://t.co/IYktVMu46G",
  "data/tweet-economist/2021/2/1360426942206529537.json": "Are we childish in assuming ourselves to be the centre of the universe? @1843mag meets Avi Loeb, the astronomer searching for extraterrestrial intelligent life https://t.co/mQVooB1fAA",
  "data/tweet-economist/2021/2/1360435118620434434.json": "It has become almost impossible for Tibetans to travel to India to attend religious teachings given by the Dalai Lama https://t.co/owHyJToTZe",
  "data/tweet-economist/2021/2/1360448870103277568.json": "The large intestine contains so many microbes that they probably outnumber the cells in the human body https://t.co/eRMm2jotHf",
  "data/tweet-economist/2021/2/1360363101871362048.json": "Joe Biden denounced the “humanitarian and strategic catastrophe” of the war in Yemen, now in its seventh year\nhttps://t.co/zOHEPnPCMb",
  "data/tweet-economist/2021/2/1360404227135311872.json": "The price of shipping goods from North America to Asia has doubled https://t.co/HX6OOGYw6n",
  "data/tweet-economist/2021/2/1360475211968167936.json": "In the past year women have been murdered for such offences as wearing make-up and chatting online. Last month a Saudi woman was killed by her brothers for having a Snapchat account https://t.co/yUsMaZ2o9B",
  "data/tweet-economist/2021/2/1360479011839725569.json": "People have been pouring into Clubhouse's “rooms” to discuss everything from the gulag in Xinjiang to the Tiananmen Square protests of 1989 https://t.co/VAEJCe5iuO",
  "data/tweet-economist/2021/2/1360444499579797504.json": "NASA’s Perseverance rover is soon to land on Mars. What it finds could change the course of the search for life beyond Earth https://t.co/p5vqiC1EEk",
  "data/tweet-economist/2021/2/1360496030689751041.json": "Some pupils in the Netherlands emerged from their first two months of remote schooling knowing less than when they started https://t.co/8opUwOuH0s",
  "data/tweet-economist/2021/2/1360514142252236800.json": "Indoor \"vertical\" farms could provide fresh food to millions of people https://t.co/BTWQ04kwZp https://t.co/eAfocb7ASK",
  "data/tweet-economist/2021/2/1360416691340144640.json": "In a recent poll, Gallup found that 98% of Democrats and only 11% of Republicans approved of Mr Biden, a gulf of 87 points https://t.co/53aN1nEX7n",
  "data/tweet-economist/2021/2/1360537462175653889.json": "“He was our leader, but he was also my friend”: what happened to an indigenous community when their chief died of covid-19  https://t.co/VbLD1CFOH7 From @1843mag",
  "data/tweet-economist/2021/2/1360507275140599809.json": "Wood is one of the most promising sustainable alternatives to steel and concrete https://t.co/HbHSLcd6bG",
  "data/tweet-economist/2021/2/1360570394844008448.json": "If we saw an alien spaceship would we recognise it? https://t.co/NH7xJwnxiG",
  "data/tweet-economist/2021/2/1360590578342383616.json": "Some vaccine makers have signed contracts to deliver 7.9bn doses this year, and say they have capacity to fulfil orders for 4.3bn more https://t.co/agjU6hCcAA",
  "data/tweet-economist/2021/2/1360526132643323904.json": "All of the vaccines appear very good at preventing severe cases of covid-19. But mild and moderate cases can be worse than they sound https://t.co/iEGHL04pEI",
  "data/tweet-economist/2021/2/1360613719592501249.json": "Are only boring people bored, or is boredom the origin of creativity? https://t.co/zC5U1Qvt1i From @1843mag",
  "data/tweet-economist/2021/2/1360631100125642752.json": "There is an assumption that there is not much the EU can do about Russia. But the bloc forgets its power https://t.co/c4AohRiNQ2",
  "data/tweet-economist/2021/2/1360641902710784003.json": "Research into mouth bacteria suggests that there may be a link between gum disease and Alzheimer's https://t.co/gOAvfjoFcH",
  "data/tweet-economist/2021/2/1360646685001740301.json": "Both Spain and Italy have struggled with remote classrooms, thanks to dodgy internet connections and a lack of computers among poorer pupils https://t.co/g7NQabKYpI",
  "data/tweet-economist/2021/2/1360661790393311237.json": "Why are astronomers so unwilling to imagine the possibility of extraterrestrial life? @1843mag meets Avi Loeb, the alien hunter of Harvard  https://t.co/YMqadfpjjC",
  "data/tweet-economist/2021/2/1360680167530782721.json": "After studying the available evidence, Avi Loeb concluded that the simplest explanation for the exotic strangeness of ‘Oumuamua was that the interstellar object had been created by an intelligent civilisation beyond Earth https://t.co/dS7OLVz3NS",
  "data/tweet-economist/2021/2/1360675373353205762.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/o4eytegmga  From @1843mag",
  "data/tweet-economist/2021/2/1360658526352334849.json": "Governments need to plan for covid-19 as an endemic disease. They will have to work out how to switch from emergency measures to policies that are sustainable indefinitely https://t.co/ya9GT6QSwe",
  "data/tweet-economist/2021/2/1360559609119989763.json": "Uniqlo wants to become the first Asian clothing brand to conquer the world https://t.co/BXQ0crgLYZ From @1843mag",
  "data/tweet-economist/2021/2/1360712618432937985.json": "Now Facebook will remove posts and block groups that claim vaccines make people ill or cause autism. Previously the company had only demoted such claims https://t.co/AkxsIW2hpN",
  "data/tweet-economist/2021/2/1360726452690444290.json": "Poorer countries with relatively old populations face dire shortages https://t.co/aPp7ymL4li",
  "data/tweet-economist/2021/2/1360754708621705216.json": "There are billions of planets like ours in the Milky Way. One Harvard astronomer believes some of them may harbour intelligent life https://t.co/balPgMvBmb",
  "data/tweet-economist/2021/2/1360671346712334339.json": "Clubhouse has been a boon for people belonging to China’s ethnic minorities, and for residents of Hong Kong and Taiwan https://t.co/3KXZUr8JVF",
  "data/tweet-economist/2021/2/1360763359549923330.json": "According to a tally kept by Airfinity, an analytics company, 378 covid-19 vaccines are in various stages of development https://t.co/GGSaezlxIA",
  "data/tweet-economist/2021/2/1360795636220764166.json": "Evidence is accumulating of a connection between the gut microbiome and Parkinson's disease https://t.co/SDmVy4P6e8",
  "data/tweet-economist/2021/2/1360801708088164352.json": "How a volcanic eruption led to the birth of the bicycle https://t.co/Jape99iR46 From @1843mag",
  "data/tweet-economist/2021/2/1360811774841417729.json": "An unambiguous detection of alien life would count as one of the momentous discoveries in the history of science. What happens next would depend on what was found https://t.co/dlrueb58O3",
  "data/tweet-economist/2021/2/1360825613049864198.json": "What are the pros and cons of being a cult CEO? You can mesmerise the masses but it raises the cost of miscalculation too, as Jack Ma discovered https://t.co/CvAazRCGzG",
  "data/tweet-economist/2021/2/1360844744591634442.json": "The Republican Party remains in the grip of Donald Trump, but that grip has begun to weaken https://t.co/ihWdciJ90Q",
  "data/tweet-economist/2021/2/1360840519761485826.json": "The Biden administration is right to decry the abuses against Uyghurs, but it should do so accurately. By accusing China of genocide in the absence of mass murder, America is diminishing the unique stigma of the term https://t.co/tV5sAxukpX",
  "data/tweet-economist/2021/2/1360846998048563208.json": "The Ordinary is a case study in the art of \"unselling\" https://t.co/8LVNtSXoII From @1843mag",
  "data/tweet-economist/2021/2/1360821472709775362.json": "In Tibet, many farmers have been moved in the past decade to more modern housing in or near towns and cities https://t.co/v4vMWbpGwT",
  "data/tweet-economist/2021/2/1360871014612279301.json": "China denounced Britain's new visa scheme open to Hong Kongers as unwanted colonial meddling. Sanctions on British companies could follow https://t.co/jvUDzCA2Pr",
  "data/tweet-economist/2021/2/1360877945817083904.json": "One in six German firms plan to shift their business away from Britain, citing bureaucracy, logistics and legal uncertainty https://t.co/AntmQLabAV",
  "data/tweet-economist/2021/2/1360876618433060865.json": "The post-covid world is likely to be less globalised, more regionalised and more fractious https://t.co/Bn85Guh3XH https://t.co/45ika2cYlf",
  "data/tweet-economist/2021/2/1360877206105391111.json": "Education has become a global battle and tutors are a secret weapon https://t.co/WvpwJAZrIc From @1843mag",
  "data/tweet-economist/2021/2/1360887281331142656.json": "At least 600 student protestors have been detained https://t.co/LCbi5HWBaX",
  "data/tweet-economist/2021/2/1360903636197466112.json": "Many astronomers refuse to believe there is intelligent life out there. Avi Loeb is different https://t.co/hsAWNtpJcu",
  "data/tweet-economist/2021/2/1360914171290935296.json": "The vision of world where Europe has a better relationship with Russia is appealing to leaders. Unfortunately, that Russia does not exist https://t.co/707APUYdxk",
  "data/tweet-economist/2021/2/1360922515703541760.json": "How does it feel when your mother tells you not to come home? The Uyghur community in London speaks to @1843mag https://t.co/InkVeBGvPq",
  "data/tweet-economist/2021/2/1360895824201469953.json": "Afterwards the former president decried “yet another phase of the greatest witch hunt in the history of our Country”. He also vowed further political activity, saying his movement “has only just begun” https://t.co/c0QrFlStYR",
  "data/tweet-economist/2021/2/1360914948235345921.json": "Using \"engineered timber\", a composite of different layers, to make skyscrapers makes a big difference to carbon dioxide emissions https://t.co/IiYicAkcoV",
  "data/tweet-economist/2021/2/1360946915983167488.json": "Cannabis cafés, poker clubs, underground football matches and even outdoor sex are flourishing in Britain despite lockdown restrictions https://t.co/XkO80feK8v",
  "data/tweet-economist/2021/2/1360944418195451908.json": "Vaccines will not see off covid-19 entirely. Governments must start thinking about how to live with the virus as an endemic disease. Our cover this week https://t.co/YWDcRHLq4c https://t.co/YGOL9RgyUn",
  "data/tweet-economist/2021/2/1360932578669326342.json": "Imbalances in our bodies' microbial ecosystems are linked to an astonishing array of neurological and physical disorders including Parkinson’s disease, autism and diabetes. @kncukier talks to @gileadamit about the human microbiome on our \"Babbage\" podcast https://t.co/vmgE4mLA9t",
  "data/tweet-economist/2021/2/1360955967245025281.json": "America is inching towards the example of Portugal, which in 2001 became the first country to decriminalise drug consumption for personal use https://t.co/XbK9E19dbx",
  "data/tweet-economist/2021/2/1360959520177070081.json": "With the economy of Yemen devastated, four out of five Yemenis rely on aid to survive\nhttps://t.co/pZ2hLHFUa3",
  "data/tweet-economist/2021/2/1360580501543804928.json": "The Tibetan religion is undergoing what the Communist Party calls “sinicisation”. Officials want to make ethnic-minority residents feel they belong to China https://t.co/FuBatioo8V",
  "data/tweet-economist/2021/2/1360963283356893185.json": "Higher inflation could provoke the Fed to raise interest rates sooner than markets expect https://t.co/w24zRRs3QK",
  "data/tweet-economist/2021/2/1360928044291149826.json": "Could Zoom and Google hangouts permanently replace some business-class tickets? https://t.co/fcdnEg8FWV",
  "data/tweet-economist/2021/2/1360975100187672580.json": "Tepoxalin, an arthritis medicine for pets, appears to kill cancers in which a gene called ABCB1 is overactive https://t.co/62jJCl3tYB",
  "data/tweet-economist/2021/2/1360866424298885121.json": "More than a quarter of children in Romania are not equipped for online education https://t.co/9Rh1Y7myBR",
  "data/tweet-economist/2021/2/1361024182469951490.json": "An observatory in Hawaii spotted a celestial object in the sky. It was dubbed ‘Oumuamua, meaning “a messenger from afar”. Did an alien civilisation send it? https://t.co/j2s4Q5Sk91",
  "data/tweet-economist/2021/2/1361011087597072388.json": "A new study suggests that about half of the sun-like stars in the Milky Way are circled by at least one rocky planet capable of sustaining liquid water on its surface https://t.co/Q7iYhoTN7O",
  "data/tweet-economist/2021/2/1360999008559366146.json": "It is striking that seven senators turned against a still popular former president from their own party https://t.co/szCJlmYLhU",
  "data/tweet-economist/2021/2/1360988182582591499.json": "Joe Biden has two months to decide what to do about Afghanistan. Will he choose to cut and run or accept that the endless war is not yet over? https://t.co/V5S0aSDJOa",
  "data/tweet-economist/2021/2/1361036530559705089.json": "Did the failure to convict Donald Trump mean it was a mistake to try? Hardly. The trial served various purposes https://t.co/6H2RPhNWTe",
  "data/tweet-economist/2021/2/1361028059164516354.json": "Predicting the impact of climate change on the Earth is key to tackling it. But how do scientists do this? https://t.co/JPmwrAxK1t https://t.co/Mur2WwrZYC",
  "data/tweet-economist/2021/2/1361048833338314755.json": "“My prediction would be that over 50% of business travel…will go away,” says Bill Gates https://t.co/nKVvj2QuaR",
  "data/tweet-economist/2021/2/1361042580276981762.json": "The Kenyan flower industry usually employs more than 500,000 people, including 100,000 directly in farms\nhttps://t.co/K0XP1MOKWM",
  "data/tweet-economist/2021/2/1361072482271322120.json": "Anti-vaxxers have been helped by large online misinformation campaigns run by China and Russia seeking to undermine confidence in Western vaccines https://t.co/aGxfpyhckd",
  "data/tweet-economist/2021/2/1360989443876925447.json": "Certain species of gut bacteria are often present in abnormally large numbers in those with Parkinson’s disease https://t.co/qd6KJlF9OZ",
  "data/tweet-economist/2021/2/1361085568155844611.json": "However, Portugal—the first country to do this—warns that decriminalisation must be paired with other policies or else it will fail https://t.co/eYdYCvyIRG",
  "data/tweet-economist/2021/2/1361101675969265666.json": "According to astrobiologists there may be as many as 300m potentially habitable worlds around sun-like stars in the Milky Way https://t.co/dlBJDtAvR7",
  "data/tweet-economist/2021/2/1361068728847380480.json": "The end of the grand fantasy: restaurant dining may never be the same again https://t.co/GlRe8D5EEo From @1843mag",
  "data/tweet-economist/2021/2/1361129317573533697.json": "KAL’s cartoon https://t.co/OzgjdG2CMX",
  "data/tweet-economist/2021/2/1361142854266064900.json": "Avi Loeb argues that conservatism within science is sustained by the desire of individual scientists to keep risk low and funding high https://t.co/5tON9tPGJW",
  "data/tweet-economist/2021/2/1361124529087672322.json": "When covid-19 vaccines meet the new variants of the virus https://t.co/BU8kY2yJQq",
  "data/tweet-economist/2021/2/1360805931223769090.json": "Around two-thirds of South Koreans live in sound-carrying, high-rise buildings. During the pandemic, this has caused tempers to fray https://t.co/aHbu8u7YDn",
  "data/tweet-economist/2021/2/1361184602434502658.json": "A study which increased the diversity of microbes in the guts of children with autism led to their gastrointestinal symptoms abating and to better behaviour, too https://t.co/yNgpV11T5l",
  "data/tweet-economist/2021/2/1361171300681719808.json": "It is striking that seven senators turned against a still popular former president from their own party https://t.co/sDkY74Mh6B",
  "data/tweet-economist/2021/2/1361192573390499846.json": "Airlines continue to burn cash at a rate of $5bn-6bn a month. Some carriers, including Virgin Australia and FlyBe, have gone under https://t.co/zoAOJgBoKO",
  "data/tweet-economist/2021/2/1361205227051966467.json": "“As a young scientist I was terrified of what people might think about me...Now I don’t give a damn. I just want to find the truth with whatever I look at.” Read @1843mag's profile of Avi Loeb https://t.co/qdVV0AK4My",
  "data/tweet-economist/2021/2/1361157020544602115.json": "Before the \"great ﬁrewall\" began blocking Clubhouse, people in China were paying up to $78 to buy an invitation code for access https://t.co/YGuRtF9Pgx",
  "data/tweet-economist/2021/2/1361213259521658883.json": "In the struggle between democracy and dictatorship, it is crucial that democracies tell the truth in plain language. China is committing crimes against humanity in Xinjiang. That is different from genocide https://t.co/o4vf4jw5cO",
  "data/tweet-economist/2021/2/1361201119343632384.json": "In December a herdsman was sentenced to a year in prison for posting a lunar new-year greeting from the Dalai Lama on WeChat https://t.co/DCwTJf8dOJ",
  "data/tweet-economist/2021/2/1361111788016779266.json": "One of science's most philosophical questions is, \"Is there life elsewhere in the universe?\" https://t.co/Rf9FKtkLeT",
  "data/tweet-economist/2021/2/1361225743624269826.json": "Did the failure to convict Donald Trump mean it was a mistake to try? Hardly. The trial served various purposes https://t.co/G3hYUISqWA",
  "data/tweet-economist/2021/2/1361180737995685890.json": "The socialist regimes of Cuba and Venezuela say they want to \"perfect\" their systems. That means allowing more room for the market https://t.co/7u24as48E8",
  "data/tweet-economist/2021/2/1361196993561952256.json": "Earlier this month Recep Tayyip Erdogan said “there is no such thing as LGBT”  https://t.co/ZTXljUnTme",
  "data/tweet-economist/2021/2/1361246892978487297.json": "Researchers are using CRISPR-CAS-9 technology to discover which genes are essential for a tumour's survival and might therefore make promising targets for new drugs https://t.co/ALlIC4VnCv",
  "data/tweet-economist/2021/2/1361239455265341442.json": "The pandemic has accelerated a shift towards remote working. Will the office survive? https://t.co/0kJivZL6JZ https://t.co/LeC8OSSaiU",
  "data/tweet-economist/2021/2/1361279779832553474.json": "Have women been better leaders during the pandemic? “There are so fewer [women]...in charge of those issues, the fact that many of them have been successful is also an indication that they’re pretty damn good,” says @Lagarde on “The Economist Asks” podcast https://t.co/hRGlVpgTH1 https://t.co/5UyQWBFFtP",
  "data/tweet-economist/2021/2/1361294470625587202.json": "Today Emmanuel Macron and the leaders of G5 Sahel countries will discuss the future of more than 5,000 French troops in the Sahel. Our report from a military base in Mali looked at France’s thankless war against jihadists in the region. From November  https://t.co/koorFtruAx",
  "data/tweet-economist/2021/2/1361322631694278656.json": "Constructing buildings from wood uses less CO2 than steel—and could even be considered as \"carbon negative\" https://t.co/QNyCTgANeq",
  "data/tweet-economist/2021/2/1361341268320800773.json": "The elimination of power stations that burn coal has helped Britain cut its carbon emissions faster than any other rich country since 1990 https://t.co/dAtSAeG5aX",
  "data/tweet-economist/2021/2/1361342769701265411.json": "Vaccines seem to have no particular problem with B.1.1.7, a variant first identified in Britain. B.1.351, which has now been found in more than 30 countries, is of greater concern https://t.co/aDtfDOcTXV",
  "data/tweet-economist/2021/2/1361353610819436550.json": "Kim Jong Un brought a portable toilet to a North Korea-US summit, apparently to prevent his faeces being collected and analysed by a rival intelligence service https://t.co/TquSLUNaMx",
  "data/tweet-economist/2021/2/1361231021115666432.json": "Only 7% of Britons think that Britain's vaccine supplies should be shared with the EU. Most people wanted to give poor countries priority https://t.co/BjKBs8zJA6",
  "data/tweet-economist/2021/2/1361356606575894528.json": "Are we childish in assuming ourselves to be the centre of the universe? @1843mag meets Avi Loeb, the astronomer searching for extraterrestrial intelligent life https://t.co/7RBFtk3Mhu",
  "data/tweet-economist/2021/2/1361405098572869636.json": "Hydrogen has overtaken batteries as the front-runner in the race for cleaner flying. Film supported by @Mishcon_de_Reya https://t.co/4g881LHkNN https://t.co/8jOGq0i5KQ",
  "data/tweet-economist/2021/2/1361401917868564491.json": "Britain's carbon emissions are down by 44% since 1990. Germany's emissions, in contrast, are down by 29% https://t.co/srZzFnsWnM",
  "data/tweet-economist/2021/2/1361399149158162436.json": "An executive order from the Biden administration could mean that female sports teams in schools will have to allow for the inclusion of trans women players. In October, we wrote about how World Rugby has handled the question https://t.co/ZNv6O4LwxI",
  "data/tweet-economist/2021/2/1361412732638040069.json": "If humanity is to win the great race between development and degradation, @BillGates writes in his new book, green innovation must accelerate https://t.co/vD27o2w6aW",
  "data/tweet-economist/2021/2/1361424304005672964.json": "A handful of American cities have already decriminalised drugs that are harder than marijuana. More states could follow Oregon https://t.co/IJcxvZOoqx",
  "data/tweet-economist/2021/2/1361437645998612484.json": "“It might seem ironic that I’m calling for more government intervention,” Mr Gates, who has has long been allergic to top-down regulation, concedes https://t.co/bzuov9AAeu",
  "data/tweet-economist/2021/2/1361459036135251970.json": "Britain's grid is not yet completely decarbonised, but that seems bound to happen as the price of electricity from renewable sources continues to fall https://t.co/q3bF7ymTKO",
  "data/tweet-economist/2021/2/1361469374624903171.json": "How a volcanic eruption led to the birth of the bicycle https://t.co/2WZt04Tw9K From @1843mag",
  "data/tweet-economist/2021/2/1361481810597806081.json": "Oregon decriminalises drugs for personal use https://t.co/a7GXPziPqD",
  "data/tweet-economist/2021/2/1361486710052425732.json": "A valid vaccination “passport” may become a pre-boarding requirement on flights https://t.co/rFYeoNXMVw",
  "data/tweet-economist/2021/2/1361500847851585537.json": "Joe Biden looks to end the war in Yemen https://t.co/4zZvupjbqk",
  "data/tweet-economist/2021/2/1361380034313879558.json": "Andrew Cuomo, the governor of New York, had refused to supply vaccinations to inmates. Our article from August investigates the impact of covid-19 within jails https://t.co/4LfywMXMx1",
  "data/tweet-economist/2021/2/1361505510688702467.json": "Kenya’s floral exports are blooming once more https://t.co/72ipRwmHwM",
  "data/tweet-economist/2021/2/1361524803652505600.json": "There will be enough vaccines for all—if rich countries share https://t.co/2tOBDjJUpL",
  "data/tweet-economist/2021/2/1361263508080451585.json": "For Elon Musk, equity is cheaper, marketing costs are low and he holds political clout. But he is vulnerable to changing social taste https://t.co/2ltVIcrKY3",
  "data/tweet-economist/2021/2/1361529368716185602.json": "China and America talk of co-operating on climate. It will be hard https://t.co/vWlKebtWUj",
  "data/tweet-economist/2021/2/1361408704864788485.json": "The Obama Presidential Centre will host young activists from America and overseas, training them in how to achieve social change https://t.co/g0K3Ktebxi",
  "data/tweet-economist/2021/2/1361601410937282560.json": "British online-grocery company, Ocado, is using air-traffic-control systems and AI technology to co-ordinate 700 factory robots https://t.co/xkZdepMU7S https://t.co/LQWeBc329o",
  "data/tweet-economist/2021/2/1361648476765962242.json": "Data show that 11 eastern European countries recorded more monthly deaths in October-December than any western European country suffered in the first wave https://t.co/V0D9f1T9qn",
  "data/tweet-economist/2021/2/1361637617268371462.json": "Will the vaccines merely prevent people from falling ill or will they also halt the spread of the virus? The Economist explains  https://t.co/q72swh77Mr",
  "data/tweet-economist/2021/2/1361514634285617154.json": "How well will vaccines work? https://t.co/70VYUKsV4Y",
  "data/tweet-economist/2021/2/1361700203078815747.json": "They're rich in protein and more sustainable than meats like beef or pork: insects are now on the menu #TheWorldIn2021 https://t.co/tF6tf94wc3",
  "data/tweet-economist/2021/2/1361725326649393152.json": "Data from 46 countries show that 620,000 excess deaths occurred between October and December. Most deaths occurred in eastern Europe https://t.co/Zxc3rhcX2e",
  "data/tweet-economist/2021/2/1361746942930415616.json": "Have women been better leaders during the pandemic? “There are so fewer [women]...in charge of those issues, the fact that many of them have been successful is also an indication that they’re pretty damn good,” says @Lagarde on “The Economist Asks” podcast https://t.co/cEma1jj016 https://t.co/jV6kRY4Gm8",
  "data/tweet-economist/2021/2/1361580960953819136.json": "Disruption caused by the pandemic has impacted smaller farms more. “The big guys always win,” when competing in the flower industry, says one farmer \nhttps://t.co/sECW0xgK0L",
  "data/tweet-economist/2021/2/1361330182821474304.json": "One astronomer reckons an alien spacecraft might already have visited our solar system. Meet Avi Loeb https://t.co/d2kainGBwW",
  "data/tweet-economist/2021/2/1361812616847503375.json": "Bill Gates’s new book, “How to Avoid a Climate Disaster”, is devoted to reconciling the legitimate aspirations of billions of people for economic advancement with the environmental harm that results https://t.co/bc6pZsdMwk",
  "data/tweet-economist/2021/2/1361856551582072834.json": "The crypto craze is attracting the attention of financial analysts, politicians and celebrities alike  https://t.co/lrk2v7piXc",
  "data/tweet-economist/2021/2/1361881566742470656.json": "Cryptocurrencies such as bitcoin are a threat to central banks, as they potentially chip away at state authority https://t.co/2QtkNCOcqR",
  "data/tweet-economist/2021/2/1361889769530290177.json": "Pickleball—a hybrid of tennis, badminton and ping-pong—is growing in popularity https://t.co/1Xcp92ISfF",
  "data/tweet-economist/2021/2/1361898718295953413.json": "If humanity is to win the great race between development and degradation, Bill Gates writes, green innovation must accelerate https://t.co/WpmpzRwsAs",
  "data/tweet-economist/2021/2/1361885632503705601.json": "According to a tally kept by Airfinity, an analytics company, 378 covid-19 vaccines are in various stages of development https://t.co/uz8XWvAZef",
  "data/tweet-economist/2021/2/1361872840014913538.json": "The gap between each party’s approval ratings for Joe Biden is the largest ever recorded for an incoming president https://t.co/zZ8FQHQZpQ",
  "data/tweet-economist/2021/2/1361902816693022724.json": "A cult leader gets 1,000 years in jail for keeping sex slaves https://t.co/Gwtxrww37K",
  "data/tweet-economist/2021/2/1361915653700128771.json": "“It might seem ironic that I’m calling for more government intervention,” Bill Gates, who has has long been allergic to top-down regulation, concedes https://t.co/jkinFvqWy6",
  "data/tweet-economist/2021/2/1361911428995809282.json": "Avi Loeb argues that scientists studying the vastness of the cosmos should entertain risky ideas more often https://t.co/mt26gX44Bw",
  "data/tweet-economist/2021/2/1361923850292887554.json": "Many astronomers refuse to believe there is intelligent life out there. Avi Loeb is different https://t.co/OMvPVLH1Sv",
  "data/tweet-economist/2021/2/1361919809320083457.json": "Did the failure to convict Donald Trump mean it was a mistake to try? Hardly. The trial served various purposes https://t.co/9hQyKXmPJJ",
  "data/tweet-economist/2021/2/1361715354234404865.json": "Not having a word for something doesn’t mean you can’t coin one—or borrow it https://t.co/yUp5WXgAbo",
  "data/tweet-economist/2021/2/1361683318836760578.json": "Eastern Europe endured the first wave of covid-19 with relatively few fatalities. The region's second wave has been much deadlier https://t.co/CipRXsjYdg",
  "data/tweet-economist/2021/2/1361929153608572928.json": "China is already testing a digital currency, but how long until we see a virtual euro? “I would say in the next four years, we should be there,” says Christine @Lagarde, @ecb president, on “The Economist Asks” podcast https://t.co/tymPrpde0I",
  "data/tweet-economist/2021/2/1361937533664432130.json": "There will be enough vaccines for all—if rich countries share https://t.co/6Q4zDmAXrX",
  "data/tweet-economist/2021/2/1361945814776639488.json": "The more happiness you want, the more expensive it gets https://t.co/jbrbrNmeiy",
  "data/tweet-economist/2021/2/1361958225306931203.json": "After studying the available evidence, Avi Loeb concluded that the simplest explanation for the exotic strangeness of ‘Oumuamua was that the interstellar object had been created by an intelligent civilisation beyond Earth https://t.co/p5Bh9zMCBY",
  "data/tweet-economist/2021/2/1361950148767739905.json": "“My prediction would be that over 50% of business travel…will go away,” says Bill Gates https://t.co/YNrp0YaHLG",
  "data/tweet-economist/2021/2/1361953951051038723.json": "The latest mortality numbers for eastern Europe are sobering https://t.co/AFOSSnlJFc",
  "data/tweet-economist/2021/2/1361986884759658497.json": "The biggest reason why cryptocurrency is on the rise is increased interest from institutional investors https://t.co/JaruXDiPzH",
  "data/tweet-economist/2021/2/1361991278007885825.json": "In poorer countries, meaningful vaccination coverage—enough for life to return to normal—may not be possible until 2023, if ever https://t.co/TmXE4pHo5U",
  "data/tweet-economist/2021/2/1362002657393709057.json": "Cannabis cafés, poker clubs, underground football matches and even outdoor sex are flourishing in Britain despite lockdown restrictions https://t.co/tPkdyOUUQA",
  "data/tweet-economist/2021/2/1362029287906410499.json": "A trial in Hong Kong of the democracy movement’s old guard is a sign that Beijing wants to crush the crusade at its roots, @suelinwong tells “The Intelligence” https://t.co/cUjVgUfc0I",
  "data/tweet-economist/2021/2/1362107826936696836.json": "Have women been better leaders during the pandemic? “There are so fewer [women]...in charge of those issues, the fact that many of them have been successful is also an indication that they’re pretty damn good,” says @Lagarde on “The Economist Asks” podcast https://t.co/3g3rbXs7LK https://t.co/Zl1DUfWVdx",
  "data/tweet-economist/2021/2/1362103412700180481.json": "The large intestine contains so many microbes that they probably outnumber the cells in the human body https://t.co/uDyH0lh25N",
  "data/tweet-economist/2021/2/1362134721925419008.json": "Rich countries have ordered more vaccines than they need. Poorer ones face dire shortages https://t.co/b3qyjErake",
  "data/tweet-economist/2021/2/1362147672392667141.json": "A recent study found that in-person schooling accelerated the spread of the virus only in places where prevailing infection rates were relatively high https://t.co/ca1SDUL195",
  "data/tweet-economist/2021/2/1362176009357975553.json": "What explains the extreme chill in Texas? We take a look at the science  https://t.co/Q22J9UDDRC",
  "data/tweet-economist/2021/2/1362175266517303301.json": "Millions in Texas are without electricity and heat after a winter storm pummelled the Lone Star State https://t.co/virTdXHgSO",
  "data/tweet-economist/2021/2/1362115792918228996.json": "Temperatures rarely drop below 5°C during the winter in much of Texas. This week’s extreme chill has sent thermometers down to -18°C in places https://t.co/glgHMRGVlR",
  "data/tweet-economist/2021/2/1362214402750046214.json": "A cult leader gets 1,000 years in jail for keeping sex slaves https://t.co/DfQ4RZXKjI",
  "data/tweet-economist/2021/2/1362227629928112131.json": "There will be enough vaccines for all—if rich countries share https://t.co/07vxdQMbgX",
  "data/tweet-economist/2021/2/1362236670301601793.json": "Texans’ current chill was caused by rapid heating in the stratosphere, the second-lowest section of the atmosphere, 5-30 miles above the Arctic https://t.co/pM5DaFL50F",
  "data/tweet-economist/2021/2/1362231815839375368.json": "“My prediction would be that over 50% of business travel…will go away,” says Bill Gates https://t.co/hg13vkzQ20",
  "data/tweet-economist/2021/2/1362235920578211840.json": "The more happiness you want, the more expensive it gets https://t.co/TTVZ1ZNIJE",
  "data/tweet-economist/2021/2/1362257264778874882.json": "What were supposed to be “rolling” blackouts across Texas have lasted for days  https://t.co/sbzzyfFofw",
  "data/tweet-economist/2021/2/1362267043031101445.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/UW449hTURz  From @1843mag",
  "data/tweet-economist/2021/2/1362279704301088768.json": "The large intestine contains so many microbes that they probably outnumber the cells in the human body https://t.co/0eWuudIlLs",
  "data/tweet-economist/2021/2/1362121140806832131.json": "Unlike the 2017 boom, analysts reckon Bitcoin’s current upswing is caused by professional investors https://t.co/jIVf40Yz0k",
  "data/tweet-economist/2021/2/1362287830572163073.json": "How did “sudden stratospheric warming” cause snow storms in one of America’s southernmost states? The Economist explains  https://t.co/MfRJxAnCMa",
  "data/tweet-economist/2021/2/1362258050317443073.json": "Queerness has been crucial to rock’n’roll from its earliest American days https://t.co/va3mcay5VC",
  "data/tweet-economist/2021/2/1362300771774169090.json": "British online-grocery company, Ocado, is using air-traffic-control systems and AI technology to co-ordinate 700 factory robots https://t.co/ID8914QzSn https://t.co/wQbDuPdmos",
  "data/tweet-economist/2021/2/1362296702242332679.json": "How a volcanic eruption led to the birth of the bicycle https://t.co/3hCyYpF6qg From @1843mag",
  "data/tweet-economist/2021/2/1362309012197359616.json": "Some pupils in the Netherlands emerged from their first two months of remote schooling knowing less than when they started https://t.co/7Lk1u09P6i",
  "data/tweet-economist/2021/2/1362304868854226944.json": "Wonder where the vanilla in your ice cream comes from? Last year @1843mag went to Madagascar and found the bitter truth https://t.co/RAouEl7Z6A",
  "data/tweet-economist/2021/2/1362275067305070594.json": "The end of the grand fantasy: restaurant dining may never be the same again https://t.co/vuYHKgEQz4 From @1843mag",
  "data/tweet-economist/2021/2/1362323753762516994.json": "RT @AlexSelbyB: We're hiring! @TheEconomist is looking for two interactive data journalists to help bring our charts to life. If you know D…",
  "data/tweet-economist/2021/2/1362324363694006281.json": "Evidence is accumulating of a connection between the gut microbiome and Parkinson's disease https://t.co/GJH7hn2vhW",
  "data/tweet-economist/2021/2/1362326625183031302.json": "Climate change is now recognised as the defining threat facing the planet. So why has so little been done to tackle it? https://t.co/EuyqwVVZVd https://t.co/BQaWbAgazl",
  "data/tweet-economist/2021/2/1362342363289579521.json": "Texas is America’s energy capital. So why are millions of residents without electricity and heat?  https://t.co/UpeAPMqBIA",
  "data/tweet-economist/2021/2/1362263046618558465.json": "Cannabis cafés, poker clubs, underground football matches and even outdoor sex are flourishing in Britain despite lockdown restrictions https://t.co/dSGFf59me3",
  "data/tweet-economist/2021/2/1362377498814775299.json": "The Ordinary is a case study in the art of \"unselling\" https://t.co/SQkJMRilti From @1843mag",
  "data/tweet-economist/2021/2/1362395019093692419.json": "Electric boats are becoming like electric cars. The newest models are fashionable, fast and expensive https://t.co/RcvGXnqAyb",
  "data/tweet-economist/2021/2/1362388673443098626.json": "Millions of Texans have been without power this week. That exposes weaknesses in the state’s energy market—and far more, @AlexandraSuich tells “The Intelligence” https://t.co/e3tDg1nljn",
  "data/tweet-economist/2021/2/1362410324385816582.json": "America needs both a cleaner grid and a more reliable one. This is the moment for the country to launch an ambitious attempt to deal with climate change. Our cover this week https://t.co/TYftuDcisL https://t.co/Nv3g4d9n88",
  "data/tweet-economist/2021/2/1362423265520672768.json": "Anti-vaxxers have been helped by large online misinformation campaigns run by China and Russia seeking to undermine confidence in Western vaccines https://t.co/9jEjXIFoOb",
  "data/tweet-economist/2021/2/1362424152674729986.json": "Scientists have set a new record by recovering DNA from million-year old Siberian mammoths  https://t.co/OPa7DxGtwN",
  "data/tweet-economist/2021/2/1362443284262584322.json": "The winter storm in Texas shows that America needs both a cleaner grid and a more reliable one https://t.co/iZK14dyW6w",
  "data/tweet-economist/2021/2/1362439737638854664.json": "Joe Biden wants America's net greenhouse-gas emissions to reach zero by 2050, and the electricity sector to be emissions-free by 2035. What will it take to get there? https://t.co/OXbWEHM8dL",
  "data/tweet-economist/2021/2/1362053794956251136.json": "RT @stevenmazie: New defamation suits against Trump’s backers could help curb the spread of democracy-corroding disinformation. My latest @…",
  "data/tweet-economist/2021/2/1362271020284018688.json": "Clubhouse has been a boon for people belonging to China’s ethnic minorities, and for residents of Hong Kong and Taiwan https://t.co/xNde7F2SSE",
  "data/tweet-economist/2021/2/1362447299071328259.json": "Many Republican politicians were quick to blame renewable energy sources, such as wind power, for the blackouts in Texas—but that is not fair.  https://t.co/BgYHmo3dtf",
  "data/tweet-economist/2021/2/1362478759350255619.json": "The Kremlin is levelling its most intense propaganda at Alexei Navalny. But its campaign betrays its nervousness about the opposition leader https://t.co/BbVVf4NMvD",
  "data/tweet-economist/2021/2/1362500596306223111.json": "RT @tomjrowley: GREAT JOB KLAXON: We’re hiring a writer to join the Britain team @TheEconomist. No journalism experience necessary, just gr…",
  "data/tweet-economist/2021/2/1362511086495412225.json": "NASA’s Perseverance rover has landed on Mars. What it finds there could change the course of the search for life beyond Earth #CountdownToMars https://t.co/oHus82xAiZ",
  "data/tweet-economist/2021/2/1362509849859420163.json": "Perseverance, NASA's Mars rover, has landed on the red planet. What will its view be like? Explore the footsteps (or tracks) of the Curiosity rover with our travelogue of Mars #CountdownToMars https://t.co/SlEfCU1pbN",
  "data/tweet-economist/2021/2/1362496869184794633.json": "The team’s work represents a new record, for their mammoth DNA is, by some half a million years, the oldest ever sequenced https://t.co/Y6mAWbKPct",
  "data/tweet-economist/2021/2/1362574693933473795.json": "The disaster in Texas is prompting people to question whether the state’s system is as resilient and well-designed as people previously believed https://t.co/vU5iu5S0tk",
  "data/tweet-economist/2021/2/1362578546468790275.json": "There is actually no good reason to assume an upper limit to longevity, or that ageing must come with decline https://t.co/j2xrRdEWot",
  "data/tweet-economist/2021/2/1362586964021678081.json": "A new study may help scientists to understand why humans and animals dream, and how dreams work https://t.co/vPEAKsMoxn",
  "data/tweet-economist/2021/2/1362569783561105409.json": "Failure to act now would make America less competitive in the new clean-energy economy, and deprive it of global influence over the climate agenda https://t.co/JLSEkq3TAu",
  "data/tweet-economist/2021/2/1362582362278817796.json": "A clean-energy economy could see wind and solar farms providing about half of America’s electricity by 2030, up from 9% in 2019 https://t.co/XwoALaWAxp",
  "data/tweet-economist/2021/2/1362529845201223682.json": "DNA breaks down post-mortem. In the permafrost, though, it can last for at least a million years https://t.co/vftrRBE3ue",
  "data/tweet-economist/2021/2/1362609740707160065.json": "New research shows that parents of teenage daughters argue more about parenting than do the parents of sons https://t.co/MFdNntts2q",
  "data/tweet-economist/2021/2/1362619272275648512.json": "The most refreshing aspect of “How to Avoid a Climate Disaster” is its bracing mix of cold-eyed realism and number-crunched optimism https://t.co/UsFXgEVtbA",
  "data/tweet-economist/2021/2/1362600962104426496.json": "The Biden administration is right to decry the abuses against Uyghurs, but it should do so accurately. By accusing China of genocide in the absence of mass murder, America is diminishing the unique stigma of the term https://t.co/SESXpv26Qk",
  "data/tweet-economist/2021/2/1362629351158726656.json": "Touch is the first sense to develop and the only one necessary for survival—our skin is the vehicle through which we navigate the world\nhttps://t.co/cA6DPNT2Ei",
  "data/tweet-economist/2021/2/1362647036147957765.json": "According to Vladimir Putin’s people, Alexei Navalny is part of a Western plot to destabilise Russia and somehow destroy its national identity https://t.co/HBfMLifYzG",
  "data/tweet-economist/2021/2/1362543707640258565.json": "As puberty blockers are not licensed for gender medicine, drug firms have done no trials on their effect on gender-dysphoric children. The few studies that do exist are weak and worrying https://t.co/cRRgXk83nT",
  "data/tweet-economist/2021/2/1362614110945443841.json": "The gap between each party’s approval ratings for Joe Biden is the largest ever recorded for an incoming president https://t.co/paqtGfO9PX",
  "data/tweet-economist/2021/2/1362509214623690752.json": "Italy is big enough to break Europe. With Mario Draghi, the country might get a vital healing shot https://t.co/TU2ZpBDUSD",
  "data/tweet-economist/2021/2/1362688962075181057.json": "Human action took a sledgehammer to the Earth’s carefully balanced carbon cycle. The damage is not irrevocable, but only humans can fix it https://t.co/EydLkSvRhY https://t.co/4oZPBek0H9",
  "data/tweet-economist/2021/2/1362694194003922947.json": "Boris Johnson will pledge to donate some of the Britain's surplus vaccine supplies to poorer countries. If more rich nations share, in theory there could be enough jabs to vaccinate each of the world’s 5.8bn adults by the end of 2021 https://t.co/nuQCamGspr",
  "data/tweet-economist/2021/2/1362722786607837189.json": "Today America rejoins the Paris agreement. What will it take for the country to gain global influence over the climate-change agenda? https://t.co/05uaIO5tjZ",
  "data/tweet-economist/2021/2/1362522296234237955.json": "Gender dysphoria is one of the fastest-rising medical complaints among children. Yet no well-run, large clinical trial has been conducted on puberty blockers https://t.co/iZ1ea57SCD",
  "data/tweet-economist/2021/2/1362738477079662593.json": "This week’s cartoon from KAL: https://t.co/ZzABtTl8Tm https://t.co/v1aRyPJToC",
  "data/tweet-economist/2021/2/1362518259854114825.json": "The number of deaths in England peaked on January 22nd and has since fallen by 57% across the population https://t.co/MDaFSDYGQX",
  "data/tweet-economist/2021/2/1362781004642078720.json": "The scale and intensity of the propaganda assault against Alexei Navalny are reminiscent of campaigns waged by Stalin’s henchmen in the 1930s against “enemies of the people” https://t.co/C3exx33ytU",
  "data/tweet-economist/2021/2/1362784788038483972.json": "Today America rejoins the Paris agreement. What will it take for the country to gain global influence over the climate-change agenda? https://t.co/mkGBlDZajk",
  "data/tweet-economist/2021/2/1362787297121492992.json": "America has rejoined the Paris agreement. But as one of the world's largest emitters of greenhouse gases, it must do much more https://t.co/ToKChzVZF5",
  "data/tweet-economist/2021/2/1362836627056455686.json": "RT @JamesFransham: 16 million people in Britain have so far received their first covid-19 vaccination. 95% of people in England aged 70 and…",
  "data/tweet-economist/2021/2/1362850209303257093.json": "Fixing the World Trade Organisation is not enough for Ngozi Okonjo-Iweala, the first woman and first African to lead it. She wants to help bring the pandemic to an end https://t.co/5ZiB9iI2hl",
  "data/tweet-economist/2021/2/1362832853055242249.json": "Mars is awash with alien technology. America, the UAE and China are among the countries with rovers on or spacecraft above the red planet  https://t.co/Pu9AfUrtru",
  "data/tweet-economist/2021/2/1362882937042141193.json": "DNA breaks down post-mortem. In the permafrost, though, it can last for at least a million years https://t.co/XCTUFdLz69",
  "data/tweet-economist/2021/2/1362895505513189376.json": "A new study may help scientists to understand why humans and animals dream, and how dreams work https://t.co/gYasBSJ0Ap",
  "data/tweet-economist/2021/2/1362954875999563778.json": "John Kerry is the most senior politician to have been dedicated to climate diplomacy by any country, let alone a superpower like America  https://t.co/dhk3M5zeG3",
  "data/tweet-economist/2021/2/1362862782585180160.json": "America has rejoined the Paris agreement. But as one of the world's largest emitters of greenhouse gases, it must do much more https://t.co/6oU1BFmlXM",
  "data/tweet-economist/2021/2/1363013234249318400.json": "A study of 1,500 workers in 46 countries found that 85% said their well-being had declined. People are reporting neck and back pain, too  https://t.co/O4gTSxo8U1",
  "data/tweet-economist/2021/2/1363008743923986436.json": "Thousands of public-sector workers from at least 245 ministries are on strike in Myanmar. Some hospitals are so understaffed they are turning patients away https://t.co/in8GzCEeFZ",
  "data/tweet-economist/2021/2/1363003062886014978.json": "Scott Morrison, Australia’s prime minister, wrote in a post on Facebook that the company’s actions to “unfriend Australia” would only confirm worldwide concerns that big tech companies are above governments and the law  https://t.co/gYyeK3PP5g",
  "data/tweet-economist/2021/2/1362951019643232261.json": "A ban on single-use plastics in Mexico City means residents can no longer buy tampons with plastic applicators https://t.co/LAQVTEa0VH",
  "data/tweet-economist/2021/2/1362893242539327496.json": "For now, states have a monopoly on Mars. But billionaires want in, too https://t.co/mEBz2z2pMj",
  "data/tweet-economist/2021/2/1362972723039895559.json": "Even by the standards of a covid-ravaged world, Mexico is doing poorly https://t.co/g4xRX2Ya0o",
  "data/tweet-economist/2021/2/1362938698728431616.json": "No decision matters more to Xi Jinping than whether to bring Taiwan, the democratic, pro-Western island of 24m people under Communist Party control https://t.co/0c55860geZ",
  "data/tweet-economist/2021/2/1363017214815780867.json": "Kandapara, a Bangladeshi brothel-village, is home to 600 women and under-age girls. It receives 3,000 customers a day. @1843mag meets the madam trying to save it from extinction https://t.co/9F7oai4hBy",
  "data/tweet-economist/2021/2/1363065879517356034.json": "Being deprived of touch has been linked to loneliness, depression, stress and secondary immune disorders\nhttps://t.co/jk0Q2ual93",
  "data/tweet-economist/2021/2/1363071673629618183.json": "America is good at innovation, but new ideas need to be deployed at scale, not languish in the lab https://t.co/NEzXEfVDGI",
  "data/tweet-economist/2021/2/1363104388911407104.json": "Decarbonisation could bring a surge in jobs in America: manufacturing jobs for wind would increase by ﬁve to tenfold to 2030 and for solar by about tenfold https://t.co/6fCmSmztcp",
  "data/tweet-economist/2021/2/1363118746932555777.json": "America needs both a cleaner grid and a more reliable one. This is the moment for the country to launch an ambitious attempt to deal with climate change. Our cover this week https://t.co/YCvGFVVfDm https://t.co/5aBvHqnYnK",
  "data/tweet-economist/2021/2/1363125781690474496.json": "“We spent around $100bn recovering from natural disasters just in 2020.” On “Checks and Balance” America’s @ClimateEnvoy @JohnKerry says domestic policy is crucial to global plans for a zero carbon future https://t.co/6wTRNIIffV https://t.co/jk7jxfMrH7",
  "data/tweet-economist/2021/2/1363080223663742979.json": "Most countries are still a long way from achieving herd immunity. We explain how vaccines can help—and which obstacles need to be overcome https://t.co/72WtvJGmfS",
  "data/tweet-economist/2021/2/1363062363084099588.json": "A survey found that employees expect to return to their desks by June. But even that could be optimistic https://t.co/sItVWSKumU",
  "data/tweet-economist/2021/2/1363026343693320195.json": "Nine of Malaysia’s 12 states have monarchs. Now the country's political turmoil has thrust them into politics https://t.co/sZnwXuOn6T",
  "data/tweet-economist/2021/2/1363154396062875655.json": "Burmese police have fired live rounds into crowds of protesters at a shipyard in Mandalay. Two people have been killed and at least 40 injured https://t.co/yUDkoQFtbv",
  "data/tweet-economist/2021/2/1363150680962330629.json": "If the Indian women who say they would like to work could do so, it could add over 100m women to the workforce https://t.co/WQU5ghbkTB",
  "data/tweet-economist/2021/2/1363147918371393536.json": "A damning report claims Andrew Cuomo’s administration understated the number of covid-19-related deaths in state nursing homes by as much as 50%  https://t.co/iZU62f6oob",
  "data/tweet-economist/2021/2/1363123246728695810.json": "Gender dysphoria is one of the fastest-rising medical complaints among children. Yet no well-run, large clinical trial has been conducted on puberty blockers https://t.co/ialoLA74FK",
  "data/tweet-economist/2021/2/1363164041024274434.json": "Homo sapiens evolved to live in groups to improve survival ; humans rely on touch to form close relationships\nhttps://t.co/DwYzFn2pJn",
  "data/tweet-economist/2021/2/1363149937979101187.json": "Under his wiry control at the keyboards—beaming, wriggling his shoulders with delight—Chick's band adventured in the limitless space where all musical styles flowed round each other https://t.co/oYjR0v84vw",
  "data/tweet-economist/2021/2/1363132316567109635.json": "It would seem Republicans with presidential ambitions who voted to acquit Donald Trump are banking on the future being post-Trump, not anti-Trump https://t.co/5rGDJOjZeC",
  "data/tweet-economist/2021/2/1363177603465682945.json": "“We spent around $100bn recovering from natural disasters just in 2020.” On “Checks and Balance” America’s @ClimateEnvoy @JohnKerry says domestic policy is crucial to global plans for a zero carbon future https://t.co/TFoLRpp50U https://t.co/JZv5hwtCTQ",
  "data/tweet-economist/2021/2/1363207568454262802.json": "Over a century ago, Nikola Tesla tried and failed to make his vision of wireless power transmission a reality. Now, the idea is making a comeback https://t.co/nog7jhKYHv",
  "data/tweet-economist/2021/2/1363212095484022788.json": "During REM sleep, brain activity looks similar to that seen during waking hours. Scientists speculated that communicating with dreamers in this state might be possible https://t.co/XCjqPNOXj0",
  "data/tweet-economist/2021/2/1362925864996986882.json": "Researchers study literary habits of the far-right by monitoring reading lists traded on social media and the manifestos of those who commit atrocities https://t.co/LgNVVqNW1U",
  "data/tweet-economist/2021/2/1363222664110895105.json": "In speaking with John Kerry, it is clear to our Lexington columnist that the 77-year-old has lost none of his career-long zeal for environmental issues  https://t.co/WSDvLew9ba",
  "data/tweet-economist/2021/2/1363232013667434497.json": "The British Empire has been fingered as the culprit for many of Britain’s problems and neuroses, from racism to a sense of exceptionalism that fuelled Brexit https://t.co/X9U3bvCJY0",
  "data/tweet-economist/2021/2/1363128801379680260.json": "What must be done to reduce emissions in Europe has been agreed on. The ﬁght over how to do it is just beginning https://t.co/Cfjsl9YlSI",
  "data/tweet-economist/2021/2/1363242792718397444.json": "A new study may help scientists to understand why humans and animals dream, and how dreams work https://t.co/tKu4Sxg2wa",
  "data/tweet-economist/2021/2/1363194254193876994.json": "The Bank for International Settlements expects that one-fifth of the world’s population will have access to a central-bank digital currency by 2024 https://t.co/QoAyaMrh2r",
  "data/tweet-economist/2021/2/1363254635503509506.json": "Touch depresses levels of cortisol, a stress hormone, and releases hormones that soothe anxiety and make us feel happier https://t.co/xhJc687c9i",
  "data/tweet-economist/2021/2/1363253115609300995.json": "America is not just the world’s second-largest emitter, but also a source of climate-related policy, technology and, potentially, leadership. The time to act is now https://t.co/YNjzlzIx2g",
  "data/tweet-economist/2021/2/1363246057887531008.json": "Electric boats are becoming like electric cars. The newest models are fashionable, fast and expensive https://t.co/BQxraaNtdR",
  "data/tweet-economist/2021/2/1363280114767790083.json": "The backlash against the seven Republicans who voted against Donald Trump during his impeachment trial has been vicious https://t.co/UEw3F2sipJ",
  "data/tweet-economist/2021/2/1363247103493947395.json": "The novelty of working from home has long worn off. The time spent on screen has led to a feeling of fatigue and increased stress https://t.co/Vjng5QikIj",
  "data/tweet-economist/2021/2/1363302447607906305.json": "The Baltimore Wood Project trains formerly unemployed Baltimoreans, many of them ex-prisoners, in deconstruction and salvaging techniques  https://t.co/vSkc3ML069",
  "data/tweet-economist/2021/2/1363180116822663171.json": "Space exploration is a matter of prestige and techno-nationalism. But there is plenty of collaboration, too https://t.co/lSkxtypSJ0",
  "data/tweet-economist/2021/2/1363316680315834371.json": "If the Indian women who say they would like to work could do so, it could add over 100m women to the workforce https://t.co/efaE573D6A",
  "data/tweet-economist/2021/2/1363297957056049155.json": "Chick found it odd to be celebrated as a jazz-fusion pioneer, as if you could say where one sort of jazz ended and another began https://t.co/t0yDyrFjh8",
  "data/tweet-economist/2021/2/1362977837389594624.json": "China has not yet begun to inoculate its elderly, lacking data on whether local vaccines are safe for them https://t.co/mcAKsQ7q0t",
  "data/tweet-economist/2021/2/1363348671371313153.json": "All land is owned by the government and may only be leased for up to 99 years. However, valuable fruit trees can be freely bought and sold\nhttps://t.co/dYdjcxgMPO",
  "data/tweet-economist/2021/2/1363352516642164743.json": "For 71 years Taiwan’s existence as a self-ruled island has relied on deterrence of Chinese aggression by America. Is that changing? https://t.co/5lyncA97x7",
  "data/tweet-economist/2021/2/1363385237103869952.json": "About 80% of the world has yet to set foot on a plane. After the systemic shock of the pandemic, could the future of travel and tourism be more inclusive, greener, safer—and more fun? Listen to “Money Talks” https://t.co/ER5IMJKIRQ",
  "data/tweet-economist/2021/2/1363392286768459780.json": "“We spent around $100bn recovering from natural disasters just in 2020.” On “Checks and Balance” America’s @ClimateEnvoy @JohnKerry says domestic policy is crucial to global plans for a zero carbon future https://t.co/piItCbI7VL https://t.co/bnGZMtlG4D",
  "data/tweet-economist/2021/2/1363379277543206918.json": "AMLO’s economic policies are bullets discharged from an antique gun that is badly aimed and packed with too little fiscal firepower https://t.co/Bj4I1Qehf9",
  "data/tweet-economist/2021/2/1363371127414935554.json": "A dysfunctional finance sector would hurt Myanmar's generals. They may be left with neither the infrastructure nor the money to pay their bills https://t.co/kcAyu3itZA",
  "data/tweet-economist/2021/2/1363398091798372354.json": "Employees who are working even longer hours than before are more likely to leave their current job if they feel their efforts are not adequately  rewarded https://t.co/x24mMFtQjC",
  "data/tweet-economist/2021/2/1363413334431846401.json": "An ancient Greek idea could improve how ordinary citizens engage with politics. Film supported by @Mishcon_de_Reya  https://t.co/Qv15Gihfm3 https://t.co/VzpeOSgW7Y",
  "data/tweet-economist/2021/2/1363445623597498370.json": "Propaganda is a powerful tool for prolonging an autocrat’s power. But it can also act as an irritant, driving calls for action against him https://t.co/8Bjo4DRXX8",
  "data/tweet-economist/2021/2/1363438584007647232.json": "After 30 years of working in a Bangladeshi brothel, Monowara set up an organisation to protect sex workers' rights. Her aim? To end the practice of buying under-age girls https://t.co/5krGlp04CZ",
  "data/tweet-economist/2021/2/1363438474758660096.json": "The Volkswagen Group plans to spend around €73bn ($88bn) over the next five years on battery power and digitisation. A fifth of the millions of cars it sells will be electric by 2025 https://t.co/ggfGZ4n4Zs",
  "data/tweet-economist/2021/2/1363434050900402176.json": "John Kerry aims to address America’s inability to pass serious climate policy, which has long eroded its effort to provide global leadership on the issue https://t.co/fY6GCXg2nB",
  "data/tweet-economist/2021/2/1363449408466137091.json": "Over the coming months a series of trials intended to beam energy across several kilometres will take place https://t.co/yek7BGX19L",
  "data/tweet-economist/2021/2/1363375071826489345.json": "To increase the supply of female workers, the Indian government should increase the demand for labour in general https://t.co/RpJuLUKDEW",
  "data/tweet-economist/2021/2/1363482873605537796.json": "Women in other countries often withdraw from the workforce when burdened with a child. Many women in India drop out when burdened with a husband https://t.co/xwvuX9GIaC",
  "data/tweet-economist/2021/2/1363473571172012034.json": "Speaking to The Economist, Christine Lagarde, president of the European Central Bank, said she planned to seek approval from her colleagues to begin preparing for a digital euro https://t.co/y7RnwwDFUM",
  "data/tweet-economist/2021/2/1363487391118467081.json": "Electric boat manufacturers are vying to become the marine equivalent of Tesla https://t.co/I9AgWvSBgP",
  "data/tweet-economist/2021/2/1363495712470794243.json": "Should Xi Jinping ever order the People’s Liberation Army to take Taiwan, his decision will be shaped by one judgment above all: whether America can stop him https://t.co/E4vYDwz2FB",
  "data/tweet-economist/2021/2/1363312035673571330.json": "In theory, each round of inbreeding should have made monarchs slightly stupider—and thus worse at their jobs https://t.co/DK2qqLWk6q",
  "data/tweet-economist/2021/2/1363470304115359745.json": "“You can't just come back in…without a demonstration of good faith.” On “Checks and Balance” America’s climate envoy @JohnKerry says America’s climate leadership is contingent on domestic action https://t.co/vSuRBCzwUI https://t.co/C3DrlcgJmR",
  "data/tweet-economist/2021/2/1363498480111656960.json": "Prostitution was declared legal in Bangladesh in 2000. Today sex workers are tolerated but their lives are precarious. Meet the madam fighting for their rights https://t.co/FJXgldYPCy",
  "data/tweet-economist/2021/2/1363490674230890506.json": "Even as unemployment has risen in India, corporate profits and stock prices have hit record levels https://t.co/bUf6ObYFfN",
  "data/tweet-economist/2021/2/1363532203356016643.json": "DNA breaks down post-mortem. In the permafrost, though, it can last for at least a million years https://t.co/1aVhoZTtR2",
  "data/tweet-economist/2021/2/1363524910577049611.json": "Neither Joe Biden nor his successors may get a second chance to recast climate policy on such a scale as is possible today https://t.co/nJH64opkl5",
  "data/tweet-economist/2021/2/1363472317746184194.json": "Pharmacies in Mexico City are reportedly selling tampons under the counter after a single-use plastics ban made them unavailable legally https://t.co/ptmJobjFsK",
  "data/tweet-economist/2021/2/1363575737660432389.json": "A new study may help scientists to understand why humans and animals dream, and how dreams work https://t.co/hzr41sWhwg",
  "data/tweet-economist/2021/2/1363528952543916033.json": "Questions that scientists asked people during periods of lucid sleep were incorporated into their dreams. One participant heard a question through a car radio https://t.co/nRUArvxSGl",
  "data/tweet-economist/2021/2/1363592591980310530.json": "Scientists have set a new record by recovering DNA from million-year old Siberian mammoths  https://t.co/eq6Wr9qEQM",
  "data/tweet-economist/2021/2/1363570690801205248.json": "Andrew Cuomo is in his third year of his third term as New York governor. The scandal may well put an end to any fourth-term hopes  https://t.co/ucEHkkAgQs",
  "data/tweet-economist/2021/2/1363564162069200897.json": "Employees have become less loyal as the pandemic has progressed. Workers are spending more time looking for other jobs and updating their LinkedIn profiles https://t.co/h2J5Zg1rjb",
  "data/tweet-economist/2021/2/1363600387333357574.json": "Power beaming—broadcasting powerful microwaves through the air—has never before been developed for commercial use. That may be about to change https://t.co/fGzwnt2bkL",
  "data/tweet-economist/2021/2/1363506519376027648.json": "The size of the likely shift to support climate measures over the coming decades has not sunk in. Hard choices are yet to be made or a political price paid https://t.co/uC7LRLCQOR",
  "data/tweet-economist/2021/2/1363626067873968134.json": "Rich countries have ordered more vaccines than they need. Poorer ones face dire shortages https://t.co/s8zbtdABmP",
  "data/tweet-economist/2021/2/1363593106449399816.json": "Some 16,000 buildings in Baltimore are officially designated empty; the true number may be twice that https://t.co/vMVIPapvOn",
  "data/tweet-economist/2021/2/1363630852236861444.json": "For centuries, European nobles often married close relatives—producing ever more stupid heirs https://t.co/L2Pd21kXza",
  "data/tweet-economist/2021/2/1363630607838765062.json": "Although the Republican Party is against almost all action, American voters are increasingly alarmed by climate change https://t.co/SMqNRmvxOc",
  "data/tweet-economist/2021/2/1363443387207147521.json": "Ngozi Okonjo-Iweala, the WTO's new chief, is keen to beef up its monitoring of trade restrictions https://t.co/X8kV2JmSGk",
  "data/tweet-economist/2021/2/1363664928893190149.json": "Joe Biden's administration has declared America's commitment to Taiwan to be \"rock solid\". In reality its ability to deter an attack on the island is crumbling https://t.co/lpQYnB4KrH",
  "data/tweet-economist/2021/2/1363652995049742338.json": "“We spent around $100bn recovering from natural disasters just in 2020.” On “Checks and Balance” America’s @ClimateEnvoy @JohnKerry says domestic policy is crucial to global plans for a zero carbon future https://t.co/6Z7w9lObFl https://t.co/pEQQrEThzN",
  "data/tweet-economist/2021/2/1363711156515459072.json": "Many countries are relying on COVAX, a global coalition to distribute covid-19 vaccines https://t.co/4LUpRBGtUV",
  "data/tweet-economist/2021/2/1363344203951050753.json": "Compared with other countries, the Philippines is an outlier in keeping children confined to their homes for so long https://t.co/oqOYs0RKKk",
  "data/tweet-economist/2021/2/1363694183962312707.json": "People in Malaysia grumble at the government’s handling of the coronavirus pandemic. But the country's royals seem above the fray https://t.co/dZmYKfSw4P",
  "data/tweet-economist/2021/2/1363707003542069249.json": "Berlin has long been a blank slate and haven for young Europeans, Americans, Antipodeans and other free spirits seeking cheap rent, like-minded souls and perhaps a second adolescence https://t.co/ROzG0l8as3",
  "data/tweet-economist/2021/2/1363669172413222913.json": "Education has become a global battle and tutors are a secret weapon https://t.co/U0Xh3d7osJ From @1843mag",
  "data/tweet-economist/2021/2/1363624603675996160.json": "The island of Zanzibar has more than 4m coconut trees, and each one has an owner. By one estimate, a tree on a desirable patch of land could sell for as much as $2,000\nhttps://t.co/TzpqoJ2Luf",
  "data/tweet-economist/2021/2/1363749412154069000.json": "Electric boat manufacturers are vying to become the marine equivalent of Tesla https://t.co/rzOEnU5efB",
  "data/tweet-economist/2021/2/1363775686251536387.json": "Mangroves are the only trees that thrive in saltwater. But that’s not their only superpower. Film supported by @Blancpain1735  https://t.co/88DmccQFJQ https://t.co/3KxvPIaz74",
  "data/tweet-economist/2021/2/1363685798353260546.json": "The 32m Filipinos under the age of 15 (a third of the population) cannot leave their homes. But it is businesses, rather than parents, that are outraged https://t.co/DoXMqnUjIe",
  "data/tweet-economist/2021/2/1363804235163463681.json": "Scientists have set a new record by recovering DNA from million-year old Siberian mammoths  https://t.co/nyHdfCkFWo",
  "data/tweet-economist/2021/2/1363812144899371011.json": "During REM sleep, brain activity looks similar to that seen during waking hours. Scientists speculated that communicating with dreamers in this state might be possible https://t.co/AKCvVGygms",
  "data/tweet-economist/2021/2/1363817614330462208.json": "The share of women in the workforce in India is lower than in Saudi Arabia, where 22% of women work outside the home https://t.co/vGUR5fLQfp",
  "data/tweet-economist/2021/2/1363808202769506312.json": "Solar farms, once installed, don't bring many jobs. Some in rural England would prefer a nuclear power station  https://t.co/nX9RFzFsxC",
  "data/tweet-economist/2021/2/1363796680672428041.json": "If power beaming takes off commercially, it could have industrial applications both on Earth and further afield https://t.co/3zyfWQaeMU",
  "data/tweet-economist/2021/2/1363698242169548802.json": "Data show that countries tended to endure their darkest periods under their most inbred monarchs https://t.co/6QOOb73mk4",
  "data/tweet-economist/2021/2/1363870674167734288.json": "The Supreme Court has cleared the way to allow a New York prosecutor access to Donald Trump's tax returns. Earlier this year, we explored the legal trouble facing the former president now he is out of office https://t.co/rrccXIdH4Y",
  "data/tweet-economist/2021/2/1363736686677606402.json": "Chick welcomed wrong notes, and didn’t much mind miscues: they could pitch him down a different path https://t.co/giYcq9yA7g",
  "data/tweet-economist/2021/2/1363604425953148932.json": "The Labour Party leader is a lawyer first and foremost—brilliant at tearing down an opponent but mediocre when it comes to creating a compelling narrative https://t.co/JLWtCOKvTl",
  "data/tweet-economist/2021/2/1363998547708887049.json": "After an unusual four months of radio silence, the Supreme Court rejected Donald Trump’s plea to keep his financial records private  https://t.co/6P4bzNZYIN",
  "data/tweet-economist/2021/2/1364005793859837955.json": "After a slow start, America’s programme is gathering speed: 16% of adults have received a first shot and the number of infections is falling by half every 14 days  https://t.co/SZ9rZc2miW",
  "data/tweet-economist/2021/2/1363988459413733381.json": "At least in theory, vaccine makers should be able to produce 2.1 shots—more than a full regimen—for each of the world’s 5.8bn adults by the end of the year https://t.co/rMHqkGIRlj",
  "data/tweet-economist/2021/2/1363971925370880001.json": "“The mix of policy failure and power-grabbing is worrying.” On “The Intelligence” @sarah_birke takes a dim view of the transformation promised by Mexico’s president https://t.co/N7mRrvFp59",
  "data/tweet-economist/2021/2/1364058903072358402.json": "Eight years of Donald Trump’s financial records will now be boxed up and shipped to Cyrus Vance, Manhattan’s district attorney https://t.co/4YtNmJu2jo",
  "data/tweet-economist/2021/2/1364068262951215110.json": "More than 200m doses of covid-19 vaccine have been administered across 92 countries https://t.co/7zmDMjBHL2",
  "data/tweet-economist/2021/2/1364091488590831619.json": "Some vaccine makers have signed contracts to deliver 7.9bn doses this year, and say they have capacity to fulfil orders for 4.3bn more https://t.co/AaAG6JiwND",
  "data/tweet-economist/2021/2/1364100769281171456.json": "How Britain decarbonised faster than any other rich country https://t.co/cQS1GWsE4j",
  "data/tweet-economist/2021/2/1364113808638283778.json": "Lucid dreamers may be able to talk to the outside world https://t.co/lf5oxBydbi",
  "data/tweet-economist/2021/2/1364073020743176196.json": "We're looking for two interactive data journalists to join The Economist's data team. Apply by March 14th https://t.co/1lCNFnhW1U https://t.co/5EHZUImZlG",
  "data/tweet-economist/2021/2/1364138071365738497.json": "Hydrogen technologies may be the best way to fuel greener air travel in the future. Film supported by @Mishcon_de_Reya  https://t.co/DY1WsZo1kz https://t.co/Gla9baToA2",
  "data/tweet-economist/2021/2/1364212433913581577.json": "Britain is the first big country to show similar results to Israel, where a jump start on vaccinations led to falling deaths and hospitalisation rates https://t.co/lEDAhGZq4Z",
  "data/tweet-economist/2021/2/1364096333368426496.json": "Kids in the Philippines have not left their homes for a year https://t.co/BelHaSP1xq",
  "data/tweet-economist/2021/2/1364222339987230721.json": "Chick Corea wanted to play innovative, heart-lifting jazz on a rock-star scale. To the fury of purists, jazz fusion became a great commercial success https://t.co/D99SbfLgJl",
  "data/tweet-economist/2021/2/1364233915091795970.json": "Melting permafrost is causing landslides and avalanches in Longyearbyen, a town on the archipelago of Svalbard in Norway. https://t.co/k56vuaLauj",
  "data/tweet-economist/2021/2/1364225030440185857.json": "People might not heed a doctor’s advice – but might they listen to their hairdresser? One of them is converting vaccine sceptics  https://t.co/XifpPvgM17",
  "data/tweet-economist/2021/2/1364302769566461952.json": "Potential charges against Donald Trump, if evidence is found, could include scheming to defraud, falsification of business records, insurance fraud and criminal tax fraud https://t.co/yL1Yk696JP",
  "data/tweet-economist/2021/2/1364303033623080968.json": "Since Britain began vaccinating in December, 31% of adults have received at least one dose  https://t.co/l0NVUiwKt9",
  "data/tweet-economist/2021/2/1364035133196668928.json": "Mario Draghi gives Italy another chance https://t.co/27ehZcc5D1",
  "data/tweet-economist/2021/2/1364391746344521729.json": "Britain’s experience with inoculations, with the evidence from Israel, offers hope to other countries https://t.co/EgWuzTDIAm",
  "data/tweet-economist/2021/2/1364408088284061699.json": "For centuries, European nobles often married close relatives—producing ever more stupid heirs https://t.co/Th7n5Wpiut",
  "data/tweet-economist/2021/2/1364428785215561729.json": "Joe Biden’s challenge with Saudi Arabia will be to find a path that neither indulges the kingdom's worst impulses nor reinforces its worst fears\nhttps://t.co/YiQvpTZEa0",
  "data/tweet-economist/2021/2/1364468122049261573.json": "On our podcast “The Jab”, Professor Sarah Gilbert, inventor of the Oxford-AstraZeneca vaccine, says adapting it to deal with new coronavirus variants should be straightforward https://t.co/CyIYLbw28P https://t.co/VIaxQ162ur",
  "data/tweet-economist/2021/2/1364618362815467522.json": "Britain is the first big country to show similar results to Israel, where a jump start on vaccinations led to falling deaths and hospitalisation rates https://t.co/stlc5CBZD6",
  "data/tweet-economist/2021/2/1364604513341108227.json": "“We spent around $100bn recovering from natural disasters just in 2020.” On “Checks and Balance” America’s @ClimateEnvoy @JohnKerry says domestic policy is crucial to global plans for a zero carbon future https://t.co/1WgLbkrRNw https://t.co/WwLoBNKOHp",
  "data/tweet-economist/2021/2/1364602990297047045.json": "Lucid dreamers may be able to talk to the outside world https://t.co/EXcdiz6VS4",
  "data/tweet-economist/2021/2/1364627932141023232.json": "Over the coming months a series of trials intended to beam energy across several kilometres will take place https://t.co/fPUpbTU71a",
  "data/tweet-economist/2021/2/1364633452830748676.json": "After studying the available evidence, Avi Loeb concluded that the simplest explanation for the exotic strangeness of ‘Oumuamua was that the interstellar object had been created by an intelligent civilisation beyond Earth https://t.co/UGmyus1IbA",
  "data/tweet-economist/2021/2/1364643023334694913.json": "New research shows that parents of teenage daughters argue more about parenting than do the parents of sons https://t.co/SpbeHQJwvg",
  "data/tweet-economist/2021/2/1364663910108979204.json": "The more happiness you want, the more expensive it gets https://t.co/Rj74L3YlGD",
  "data/tweet-economist/2021/2/1364171757083623431.json": "Preliminary vaccination data from Scotland shows an overall 81% reduction in the numbers of over 80s admitted to hospital. We explain how vaccines can provide different levels of protection against the virus https://t.co/p2y8J0SvlP",
  "data/tweet-economist/2021/2/1364541847775961088.json": "“We spent around $100bn recovering from natural disasters just in 2020.” On “Checks and Balance” America’s @ClimateEnvoy @JohnKerry says domestic policy is crucial to global plans for a zero carbon future https://t.co/XQ3ILzXz7Y https://t.co/mfbPLAjclA",
  "data/tweet-economist/2021/2/1364749580315873282.json": "A study of 1,500 workers in 46 countries found that 85% said their well-being had declined. People are reporting neck and back pain, too  https://t.co/Y1lp52GNc0",
  "data/tweet-economist/2021/2/1364771359344238593.json": "Republicans have introduced the most bills in Pennsylvania, Georgia and Arizona—the battleground states that delivered President Joe Biden his electoral-college victory https://t.co/5AP6zGJQBr",
  "data/tweet-economist/2021/2/1364767529139392517.json": "Lucid dreamers may be able to talk to the outside world https://t.co/olMwFTpQZV",
  "data/tweet-economist/2021/2/1364524239332720642.json": "“It doesn't make sense to run electric cars on electric energy which is produced from fossil fuels or carbon. It just doesn't make sense.” When will electric cars rule the road? We ask @VWGroup CEO @Herbert_Diess on “The Economist Asks” podcast https://t.co/oENm2ypEJM",
  "data/tweet-economist/2021/2/1364791145830768641.json": "Over the coming months a series of trials intended to beam energy across several kilometres will take place https://t.co/TxGpeo7mBd",
  "data/tweet-economist/2021/2/1364783551766548482.json": "After studying the available evidence, Avi Loeb concluded that the simplest explanation for the exotic strangeness of ‘Oumuamua was that the interstellar object had been created by an intelligent civilisation beyond Earth https://t.co/X9igxyG9yl",
  "data/tweet-economist/2021/2/1364795296006475777.json": "Britain is the first big country to show similar results to Israel, where a jump start on vaccinations led to falling deaths and hospitalisation rates https://t.co/XywM49e7SA",
  "data/tweet-economist/2021/2/1364812663126163458.json": "New research shows that parents of teenage daughters argue more about parenting than do the parents of sons https://t.co/DcJO9FA1bD",
  "data/tweet-economist/2021/2/1364800341322170371.json": "The deal between Turkey and Russia in the South Caucasus represents one of the biggest geopolitical shake-ups since the end of the cold war https://t.co/dcogXucLvU",
  "data/tweet-economist/2021/2/1364817293339987970.json": "How Britain decarbonised faster than any other rich country https://t.co/AxwkkN5SlT",
  "data/tweet-economist/2021/2/1364842691507404800.json": "The more happiness you want, the more expensive it gets https://t.co/vaBdzhyCA8",
  "data/tweet-economist/2021/2/1364830494941196289.json": "On our podcast “The Jab”, Professor Sarah Gilbert, inventor of the Oxford-AstraZeneca vaccine, says adapting it to deal with new coronavirus variants should be straightforward https://t.co/t6DKnnuQ9Q https://t.co/YJdEL1CABU",
  "data/tweet-economist/2021/2/1364875002663821312.json": "Women in other countries often withdraw from the workforce when burdened with a child. Many women in India drop out when burdened with a husband https://t.co/gz3thOLzWy",
  "data/tweet-economist/2021/2/1364898632567296003.json": "A study of 1,500 workers in 46 countries found that 85% said their well-being had declined. People are reporting neck and back pain, too  https://t.co/lO4TeaES5c",
  "data/tweet-economist/2021/2/1364702926787252225.json": "Madonna made music history in 2005 by releasing her single “Hung Up” as a ringtone before it was aired on the radio. But what happened to the lucrative ringtone market? @1843mag investigates https://t.co/ViypUrzEh9",
  "data/tweet-economist/2021/2/1364947203865923597.json": "Two long sections of DNA inherited from Neanderthals appear to confer resistance or susceptibility to severe covid-19, depending on which is present https://t.co/nAcgt0NOE0",
  "data/tweet-economist/2021/2/1364955115413725188.json": "Republican lawmakers across 45 states have proposed at least 253 new laws to make voting harder  https://t.co/eGcJmcE6Po",
  "data/tweet-economist/2021/2/1364981249346068483.json": "Frasier is getting a reboot. The hit sitcom will return 17 years after its record-breaking run ended. What made the show so appealing to viewers? From the archive https://t.co/i4TpbPRFEB",
  "data/tweet-economist/2021/2/1364985027013001221.json": "The death toll is enormous, according to a new paper which estimates that in 2018, 8.7m global deaths were associated with breathing air pollution from fossil fuels https://t.co/MByHuaY6mo",
  "data/tweet-economist/2021/2/1365007440996151297.json": "One type of Neanderthal gene doubles the chances of a trip to intensive care, the other brings a lower chance of critical illness https://t.co/rredGbaz0b",
  "data/tweet-economist/2021/2/1365003498576883713.json": "Xi Jinping has claimed victory in ending rural poverty in China. Earlier this year we looked at other challenges the country faces in eradicating inequality https://t.co/SPtwTTRQDX",
  "data/tweet-economist/2021/2/1364929411296989185.json": "A new phase in global tech competition is under way. Big tech's big dust-up could bring big changes to the digital economy. Our cover this week https://t.co/k7yGh8UzUQ https://t.co/5unua9FkDG",
  "data/tweet-economist/2021/2/1365063298169856000.json": "Evolutionary pressure has helped the same SARS-CoV-2 mutations arise at different times in different locations https://t.co/R0jyFjSfCq",
  "data/tweet-economist/2021/2/1365045922556760072.json": "New research finds that China and India suffer the highest mortality rates from fossil-fuel air pollution https://t.co/sm7NwlRPlT",
  "data/tweet-economist/2021/2/1365123660617547780.json": "China looks the likely prize-winner in South-East Asia. But its bid for dominance in the region is far from assured https://t.co/iojoR69l3Z",
  "data/tweet-economist/2021/2/1365173826653421573.json": "New research could shed light on why some countries or populations appear to have been hit harder by covid-19 than others https://t.co/qLa46KFJZX",
  "data/tweet-economist/2021/2/1365180044881068032.json": "How serious a risk does Russia pose to America? Fiona Hill, a Russia specialist at @BrookingsInst, tells @AnneMcElvoy why Russia is “a threat to the cohesion of Western democracies” on “The Economist Asks” podcast https://t.co/OxCzZttJHO",
  "data/tweet-economist/2021/2/1365184525811265537.json": "Of the 110m cases found worldwide, scientists have sequenced and published the genomes of 600,000 https://t.co/ubzf0jhXD1",
  "data/tweet-economist/2021/2/1365197639172714496.json": "Turkey and Russia were historically bitter opponents, often clashing militarily. What changed?  https://t.co/A5R7B6JyS2",
  "data/tweet-economist/2021/2/1365222864664866818.json": "Joe Biden has signed an executive order mandating a review of critical supply chains, including that for semiconductors https://t.co/1WLSnHVbtm",
  "data/tweet-economist/2021/2/1365225540760797186.json": "Economists traditionally believed that minimum wages actually hurt workers—but recent research has led to a rethink https://t.co/kfpNZVOAmj https://t.co/k0Zj6NkM2G",
  "data/tweet-economist/2021/2/1365274927897735168.json": "This week’s cartoon from KAL: https://t.co/BUyDYG9uwt https://t.co/jmh8CqMGIq",
  "data/tweet-economist/2021/2/1365002965552144386.json": "RT @johnpmcdermott: A year ago I met a Beninese MP in Cotonou. He looked stressed. Why? I asked. He scrolled through his WhatsApp messages,…",
  "data/tweet-economist/2021/2/1365304765916315650.json": "Great whites used to be common off the Cape of Good Hope. But in recent years they have been driven out by an equally fearsome species https://t.co/wQCsGuqmBw",
  "data/tweet-economist/2021/2/1365354716620816387.json": "On paper, hydrogen looks like a dream fuel. In practice, things can be tricky. But supplying hydrogen as goop could solve some problems https://t.co/iPM5TdgsmV",
  "data/tweet-economist/2021/2/1365370058529267716.json": "Neanderthals died out around 40,000 years ago. But their surviving genes offer insight into our resistance or susceptibility to covid-19 https://t.co/bWRM5WBIo4",
  "data/tweet-economist/2021/2/1365094655562559493.json": "Ghana has become the first country in the world to receive jabs under the COVAX scheme  https://t.co/QHGfvrZj4v",
  "data/tweet-economist/2021/2/1365361015253323777.json": "If either soldiers or officials have deliberately stopped food from reaching the hungry in Tigray, then that may have been yet another war crime  https://t.co/oXJBRJIC8p",
  "data/tweet-economist/2021/2/1365421419274903558.json": "For years Lava Jato made the powerful tremble. Its demise marks the symbolic end of an unprecedented push to reduce corruption across Latin America https://t.co/X94go8BDSV",
  "data/tweet-economist/2021/2/1365448584393547778.json": "By the time the CIA assessment finally emerged its conclusions were already known: America believes Muhammad bin Salman approved the operation to capture or kill Jamal Khashoggi https://t.co/Q8Igf2f3JW",
  "data/tweet-economist/2021/2/1365444087852195843.json": "Despite a high risk of famine in Tigray, Ethiopia’s government is still slowing the movement of aid workers, perhaps because officials do not want them to expose atrocities  https://t.co/T6pUbjTPAZ",
  "data/tweet-economist/2021/2/1365460405544513541.json": "Researchers at the Fraunhofer Institute think that supplying hydrogen as goop rather than gas oﬀers a way around some of its limita­tions https://t.co/Uan0ADR2QW",
  "data/tweet-economist/2021/2/1365453861503131653.json": "“Whale calls or other mammal calls in the ocean may contain more information than we thought.” Václav Kuna, a seismologist at @OSUCEOAS, tells @kncukier how singing whales could help the study of the sea floor on \"Babbage\"\n https://t.co/51V98dBZeA https://t.co/YBeQBzSang",
  "data/tweet-economist/2021/2/1365496929677938692.json": "Muhammad bin Salman has cemented a reputation as a vicious, impulsive ruler. The CIA report appears to confirm that view https://t.co/0xm73eWUli",
  "data/tweet-economist/2021/2/1365516591589453826.json": "Credible reports of atrocities and war crimes are emerging in Tigray. Many involve troops from neighbouring Eritrea, who are fighting alongside Ethiopian forces  https://t.co/tuHRUmg7xJ",
  "data/tweet-economist/2021/2/1365521065984679938.json": "As far as Vladimir Putin is concerned, using Turkey to undermine NATO is even more important than helping Bashar al-Assad in Syria https://t.co/BlVHh9VnNR",
  "data/tweet-economist/2021/2/1365502576658173952.json": "Our Lexington columnist describes what it's been like in Maryland, where schools struggle to reopen and his two children wait for instruction  https://t.co/Tw4aMwERYE",
  "data/tweet-economist/2021/2/1365545465685700610.json": "Until recently, wolves were seen as a pest in China https://t.co/KZTIGI2Xaf",
  "data/tweet-economist/2021/2/1365550758683435008.json": "America’s latest stimulus bill is one of the most popular pieces of important legislation in three decades https://t.co/uyLSl1Y5Mn",
  "data/tweet-economist/2021/2/1365567741277728770.json": "A rule that female students must wear the hijab to school is widely applied to non-Muslim girls, too. Jeni Hia, a Christian, refused https://t.co/v0Dnn1cXZx",
  "data/tweet-economist/2021/2/1365576245291995136.json": "Evolutionary pressure has helped the same SARS-CoV-2 mutations arise at different times in different locations https://t.co/dL8VGAy51T",
  "data/tweet-economist/2021/2/1365490101153910787.json": "For voters, there is much to like: the stimulus package includes $1,400 cheques for most people and an extra $400 a week in unemployment-insurance payments  https://t.co/HfBmh1pH3V",
  "data/tweet-economist/2021/2/1365587765757415428.json": "People today run on far less sleep than they did a century ago. What is the impact? https://t.co/6zKT5EMKAQ https://t.co/lZkJ7EZ7gZ",
  "data/tweet-economist/2021/2/1365588936769359873.json": "Chinese investment in South-East Asia has grown almost 30-fold in the past decade. But it comes with strings attached https://t.co/iC6I7QIvDZ",
  "data/tweet-economist/2021/2/1365555278758952961.json": "On our podcast “The Jab”, Professor Sarah Gilbert, inventor of the Oxford-AstraZeneca vaccine, says adapting it to deal with new coronavirus variants should be straightforward https://t.co/Z9Cbwv2yUt https://t.co/xRxckMSa6F",
  "data/tweet-economist/2021/2/1365614164165742594.json": "There were no sanctions imposed on Muhammad bin Salman, just the promise of a difficult relationship with President Joe Biden https://t.co/NClJVdVhFB",
  "data/tweet-economist/2021/2/1365627258782834688.json": "Abortion in Poland is now limited to cases of rape or to save a mother’s life. But the EU's freedom of movement means there are ways around the law https://t.co/Yg8ldUQ4xG",
  "data/tweet-economist/2021/2/1365630765640409089.json": "America's House of Representatives has passed the stimulus bill. It enjoys broad support among Americans, including a plurality of Republicans https://t.co/snbUseLBKF",
  "data/tweet-economist/2021/2/1365628767742406670.json": "“There's a real strong streak of sexism and misogyny...one has to just accept, you're just not really all that interesting to them.” Former White House Russia adviser Fiona Hill recalls her meetings with the Kremlin on “The Economist Asks” podcast https://t.co/mrbj2msmAv",
  "data/tweet-economist/2021/2/1365542439323328513.json": "How serious a risk does Russia pose to America? Fiona Hill, a Russia specialist at @BrookingsInst, tells @AnneMcElvoy why Russia is “a threat to the cohesion of Western democracies” on “The Economist Asks” podcast https://t.co/4vcqJHC2nR",
  "data/tweet-economist/2021/2/1365672055350431744.json": "Could you have a lucky gene? https://t.co/gPc06e7xpf",
  "data/tweet-economist/2021/2/1365593158692831235.json": "“The World for Sale” shows how a handful of swashbucklers became billionaires by overcoming ethical qualms https://t.co/F73vKr3gql",
  "data/tweet-economist/2021/2/1365673301297750020.json": "Of the 110m cases found worldwide, scientists have sequenced and published the genomes of 600,000 https://t.co/8oxl8ZbhV6",
  "data/tweet-economist/2021/2/1365716358277849088.json": "In 2015 marine biologists found dead sharks scattered across the ocean floor, gashes down their abdomens, their livers removed. The culprits: killer whales https://t.co/p5h5jbaL1t",
  "data/tweet-economist/2021/2/1365725901523202057.json": "Even as evidence of children’s limited potential to transmit the virus piles up, many American school districts resist reopening  https://t.co/WW2MbZIajn",
  "data/tweet-economist/2021/2/1365747542407995397.json": "Hydrogen goop, dubbed \"Powerpaste\" by researchers at the Fraunhofer Institute, bears a passing resemblance to toothpaste https://t.co/vwinx6xY2a",
  "data/tweet-economist/2021/2/1365799131546009606.json": "Latin America's anti-corruption drive was undone by the politicisation of justice, in two ways https://t.co/Evf5yGx5bi",
  "data/tweet-economist/2021/2/1365632813727375364.json": "Grammarly’s strengths and failings hint at the essence of language and the peculiarity of human intelligence https://t.co/jDrR3XeTIm",
  "data/tweet-economist/2021/2/1365801142924546054.json": "McKinsey’s partners see themselves as missionaries. Yet they are also mercenaries— “guns for hire” https://t.co/X8uVQk2qOO",
  "data/tweet-economist/2021/2/1365832186084098048.json": "Viruses evolve and SARS-CoV-2, which causes covid-19, replicates while infecting its host. Mutations can make it more dangerous in several ways https://t.co/qik3URJmeQ",
  "data/tweet-economist/2021/2/1365816249461186562.json": "“Whale calls or other mammal calls in the ocean may contain more information than we thought.” Václav Kuna, a seismologist at @OSUCEOAS, tells @kncukier how singing whales could help the study of the sea floor on \"Babbage\"\n https://t.co/rt7nbfZtYU https://t.co/E6uGdmcoUB",
  "data/tweet-economist/2021/2/1365846183411916801.json": "Mr Trump is expected to give a speech on February 28th in which he will deride President Joe Biden’s immigration policy https://t.co/XlovckUl4O",
  "data/tweet-economist/2021/2/1365860176096604165.json": "America’s fragmented public school-system is a recipe for risk aversion and inertia https://t.co/hyB6KJXT9Y",
  "data/tweet-economist/2021/2/1365844908049858564.json": "On paper, Indonesia is a pluralist country. Yet many local governments have passed laws inspired by Islamic teaching https://t.co/qt3F8rn7R7",
  "data/tweet-economist/2021/2/1365882142933319681.json": "The arrival of a pair of killer whales named Port and Starboard coincided with several great whites washing up dead on the shores of the Cape of Good Hope https://t.co/yGwcLZzjmM",
  "data/tweet-economist/2021/2/1365868879587778560.json": "It is against China’s complex backdrop of engagement in South-East Asia that it now is gearing up for perhaps its biggest inﬂuence campaign ever: vaccine diplomacy https://t.co/sJnvP8cT5o",
  "data/tweet-economist/2021/2/1365877999778877440.json": "Ms Wood's advocacy of Tesla, and of bitcoin, has endeared her to the WallStreetBets generation of investors \n https://t.co/BRCUWPVWJ3",
  "data/tweet-economist/2021/2/1365759632044683274.json": "China's presence is starkest in Cambodia, Laos and Myanmar https://t.co/tGklET2DYF",
  "data/tweet-economist/2021/2/1365917669157990400.json": "On our podcast “The Jab”, Professor Sarah Gilbert, inventor of the Oxford-AstraZeneca vaccine, says adapting it to deal with new coronavirus variants should be straightforward https://t.co/8hsOivmwTS https://t.co/UzxHM29iOq",
  "data/tweet-economist/2021/2/1365916673375678465.json": "There is growing overlap between America’s five tech behemoths. Alphabet, Amazon, Apple, Facebook and Microsoft are beginning to echo the rivalry between Alibaba and Tencent https://t.co/D5MHyhPmuK",
  "data/tweet-economist/2021/2/1365926203597746176.json": "When China last drew up a protected-species list, a campaign to exterminate wolves was still popular. Now, killers face fines or prison https://t.co/RGauLJqkbX",
  "data/tweet-economist/2021/2/1365913730123464706.json": "Russia and Turkey will look for common ground wherever they can, but they will find it hard to reconcile their regional and long-term interests https://t.co/Opdxg2ThQQ",
  "data/tweet-economist/2021/2/1365947113214005249.json": "Hydrogen goop called \"Powerpaste\" oﬀers several advantages over batteries, petrol and more con­ventional ways of handling the gas https://t.co/8jHMCH0qzl",
  "data/tweet-economist/2021/2/1365934411196293120.json": "The advantage of funding excellent research is that when a crisis hits, the government is more likely to have experts to hand https://t.co/BrTg87SDgs",
  "data/tweet-economist/2021/2/1365950422612140032.json": "Predicting the impact of climate change on the Earth is key to tackling it. But how do scientists do this? https://t.co/D1rOq0FMkC https://t.co/FDDz3UGz2N",
  "data/tweet-economist/2021/2/1365938535149223937.json": "The new variants are all more inclined to mutate than the wild-type virus that was spotted in Wuhan in 2019 https://t.co/8TEOtaz37X",
  "data/tweet-economist/2021/2/1365665997647212544.json": "\"You cannot say that you are patriotic but you do not love the leadership of the Chinese Communist Party,\" said Hong Kong’s oﬃcial in charge of mainland and constitutional aﬀairs https://t.co/i2D9G3jPDJ",
  "data/tweet-economist/2021/2/1365959217023250439.json": "Only 23% of GOP voters expressed a willingness to elect a candidate who had criticised Mr Trump; 45% said they would not https://t.co/cfxMyrKtIE",
  "data/tweet-economist/2021/2/1365988884144943108.json": "Harvard researchers want to test an idea in which ﬁne dust is injected into the upper atmosphere to boost the amount of sunlight reﬂected back into space https://t.co/uD9ry6FWFx",
  "data/tweet-economist/2021/2/1366038223617724417.json": "The Republicans polled by YouGov expressed a deep reluctance to vote for candidates who had criticised Mr Trump https://t.co/a8WQSfUPJo",
  "data/tweet-economist/2021/2/1366047071577518081.json": "Many democrats in Hong Kong feel they are having to choose between keeping quiet about their beliefs, or emigrating https://t.co/nB4Fo3CaFV",
  "data/tweet-economist/2021/2/1365904827000246272.json": "How serious a risk does Russia pose to America? Fiona Hill, a Russia specialist at @BrookingsInst, tells @AnneMcElvoy why Russia is “a threat to the cohesion of Western democracies” on “The Economist Asks” podcast https://t.co/bFdAmb5tF9",
  "data/tweet-economist/2021/2/1366051044590030848.json": "We explain why convergent evolution may make travel restrictions redundant when trying to limit the spread of covid-19 https://t.co/j7petXk1AK",
  "data/tweet-economist/2021/2/1366086292690395136.json": "Lava Jato promised to cleanse Brazilian politics, but there was no follow-up https://t.co/yC9C8qIBBl",
  "data/tweet-economist/2021/2/1365768701635670022.json": "The federal government has dismissed calls for independent investigations into the killings, and seems unwilling to hold anyone besides the Tigrayan People’s Liberation Front to account  https://t.co/EMsWvmegdy",
  "data/tweet-economist/2021/2/1366067929930989577.json": "If the boss addresses the staff as if they are idiots, the firm is unlikely to prosper  https://t.co/FJT8EgxDdz",
  "data/tweet-economist/2021/2/1365580450283061266.json": "Theresa May put life sciences at the forefront of Britain's industrial strategy. This focus has delivered some concrete benefits https://t.co/jrT35bcX0g",
  "data/tweet-economist/2021/2/1366148948168220676.json": "The misuse of science among Democrats and Republicans has fostered the false dichotomy that teacher health and student welfare are irreconcilable https://t.co/Cua1kzpvMw",
  "data/tweet-economist/2021/2/1366025390104465410.json": "Months of restrictions on journalists and NGOs make it hard to know exactly what has been happening in Tigray  https://t.co/xZZABxhjmg",
  "data/tweet-economist/2021/2/1366176132345827328.json": "Automated grammar-checkers show how far artificial “intelligence” is from the human kind https://t.co/lLZzTOO4Uj",
  "data/tweet-economist/2021/2/1366169583917404167.json": "The changes at the top of the food web have rippled through the rest of the ecosystem https://t.co/m4BgjloWdX",
  "data/tweet-economist/2021/2/1366100883642138628.json": "Tigrayans who have fled across the border to Sudan tell of attacks on civilians by Amhara militiamen and government soldiers \n https://t.co/2N87nDtagu"
}