{
  "data/tweet-quora/2022/1/1477414384347590661.json": "Making some goals for the new year? Learn about the most effective goal-setting frameworks in these perspectives from life coaches and OKR consultants: https://t.co/ZPZG68wpa1",
  "data/tweet-quora/2022/1/1478066728508690432.json": "Who remembers this? https://t.co/EjvSTHmotD",
  "data/tweet-quora/2022/1/1478181070566608897.json": "At Quora, we offer lots of support for writers, but haven't offered much for readers. Writing well is hard, but making sense of all the information out there is hard too. Would sensemaking support be valuable to readers?",
  "data/tweet-quora/2022/1/1478081503380721664.json": "Happy New Year everyone? What mountains, real or metaphorical, do you plan to climb this year? Fergus White has some first-hand tips for Everest: https://t.co/1VoOUaQ4ii",
  "data/tweet-quora/2022/1/1478463288253902848.json": "What does a Soviet-style \"khrushchevka\" apartment building look like on the inside? Russian Quora contributor Misha Firer explains in his typical hilarious idiom: https://t.co/1QqZyJpkGe",
  "data/tweet-quora/2022/1/1478501234872963072.json": "Do you enjoy solving math and computer science puzzles? Would you like to try your hand at some user-tested puzzles derived from real-world challenges? Then you'll probably like the Quora Programming Challenge. https://t.co/yZxotfs7pJ\np.s. There are cash prizes.",
  "data/tweet-quora/2022/1/1478794849365094403.json": "Would you believe that Saudi Arabia imports sand? Piotr Marciniak explains: https://t.co/RV4pbZaFM9 https://t.co/vs5lGPSUKE",
  "data/tweet-quora/2022/1/1479532511671697409.json": "What do you remember most about Sidney Poitier? What was his best performance? https://t.co/FHp2AYXRFd https://t.co/twyTA06eDU",
  "data/tweet-quora/2022/1/1480978188058574853.json": "Nano-chameleons, zombie frogs, and shrieking hyrax. Gary Meaney tells us all about the cool new critters that were discovered in 2021. What do you think we'll discover in 2022? https://t.co/ptbmUYiP2Y https://t.co/ilUhKteypn",
  "data/tweet-quora/2022/1/1481033274478641153.json": "Want to get one of those cool new remote jobs? Quora was just named one of the top remote employers by \n@BuiltIn!\n https://t.co/SvMa4b92Ml #remotework",
  "data/tweet-quora/2022/1/1481406480293109760.json": "What's it like to live in a little village in Turkey? Let Gizem Acar, who lives in a picturesque such village, tell you about it: https://t.co/TuJCB2SkcK https://t.co/vGHXrtuWgJ",
  "data/tweet-quora/2022/1/1481706796662157314.json": "Hey @CarCaster, relevant to your interests? https://t.co/OqfgG65eKn",
  "data/tweet-quora/2022/1/1481703767401644036.json": "Fun challenges and cash prizes, what more could you want? https://t.co/G5Y5bIiT0G",
  "data/tweet-quora/2022/1/1482100467433762818.json": "Ever wonder why Windows systems use CR+LF while Linux only uses LF? Michael Lush has the deets: https://t.co/iWURJnecZk https://t.co/rfEBPUoKtV",
  "data/tweet-quora/2022/1/1482382394858643465.json": "What are some tips for getting financial aid? Admissions expert and CEO of @moon_prep, Kristen Moon, shares 5 easy steps. https://t.co/gatkLY6jLK https://t.co/9NhcFm3dvk",
  "data/tweet-quora/2022/1/1482382158291509255.json": "Who loves Beijing snacks? Fei-fei Wang does! https://t.co/YnlAPAhfVa https://t.co/6apb1M6x7N",
  "data/tweet-quora/2022/1/1482744648238047236.json": "Considering moving your business's data to the cloud? Here are four factors to consider. @qumulo's Vice President of Product Management, Ben Gitenstein, explains. https://t.co/U7aZbsHAmJ https://t.co/GlJneXvJFL",
  "data/tweet-quora/2022/1/1483521972117983232.json": "Where are the new hotspots for tech jobs? In the remote work world, they're different! https://t.co/S8ADFKH3qm"
}