{
  "data/tweet-economist/2021/10/1443752682620084225.json": "Adjusting for population, the daily death rate is now about eight times higher in America than in the rest of the rich world https://t.co/zYarp2BMyG",
  "data/tweet-economist/2021/10/1443738840418721796.json": "Xi Jinping’s anti-capitalist campaign is remarkable for its scope and ambition. It has rocked Alibaba, Didi and Evergrande in the past year, destroying perhaps $2trn of wealth https://t.co/PTYxRU3uq4",
  "data/tweet-economist/2021/10/1443760081477177347.json": "It is not hard to see why investors are excited https://t.co/CsKubZqiSN",
  "data/tweet-economist/2021/10/1443792178724102146.json": "Doing without beef from live cattle is hard to imagine, but the same was true of coal 100 years ago https://t.co/MnFAKRfeje",
  "data/tweet-economist/2021/10/1443783527586275337.json": "Among those who voted for Donald Trump in 2020, 31% say they will not get vaccinated, according to our recent poll with YouGov https://t.co/gNVTe3RUzL",
  "data/tweet-economist/2021/10/1443868340980797486.json": "21st-century farms may, eventually, outgrow today’s in productivity, in environmental friendliness—and in height https://t.co/uIrxlKg2De",
  "data/tweet-economist/2021/10/1443892976917286915.json": "This week's cartoon from KAL: https://t.co/WVeFjxyKBE https://t.co/8iGOFdEHx0",
  "data/tweet-economist/2021/10/1443888681178251264.json": "Japan’s new leader needs bold ideas, charisma and grit. Kishida Fumio has done little to suggest he has any of these https://t.co/Fs7KTY02nW",
  "data/tweet-economist/2021/10/1443976270845521925.json": "For the same reasons that women live longer: less booze and bravado, and different biology https://t.co/IN8SNWkzuf",
  "data/tweet-economist/2021/10/1444066104872214538.json": "Animal-based foods account for 57% of agricultural greenhouse gases, versus 29% for food from plants https://t.co/oavsriXL44",
  "data/tweet-economist/2021/10/1443769896094117891.json": "Western consumers should put aside their reservations about eating crickets and give plant-­based burgers, 3D-printed steaks and vat-grown tuna a try https://t.co/TaudgVjYyY",
  "data/tweet-economist/2021/10/1444034900131188737.json": "Rwanda has received about 50% more aid per person than comparable countries in the region, even as evidence of the brutality and ruthless repression of its regime has mounted https://t.co/iOBkZ8T6IQ",
  "data/tweet-economist/2021/10/1444142812212117506.json": "Nearly a quarter of the cars sold in Europe last month were full electric vehicles or plug-in hybrids https://t.co/rHMgXvNVoo",
  "data/tweet-economist/2021/10/1444121040322453506.json": "Inefficiency is a bigger problem in America than the failure of tax rates to be sufficiently progressive https://t.co/7VenrRmxzf",
  "data/tweet-economist/2021/10/1444193205361287168.json": "\"Bodies with vaginas\" and \"birthing people\" are strange ways to refer to half of humanity https://t.co/ENNTCZyVKU",
  "data/tweet-economist/2021/10/1443975068820905985.json": "South Africa is one of the world’s most unequal countries. \n\nTwo new papers look at wealth, the role of policy and what happened to the racial income gap since the end of apartheid in 1994.\n\n⬇️ Click to find out more about their research",
  "data/tweet-economist/2021/10/1444177563300122627.json": "In many parts of China, the high price of coal is to blame https://t.co/cYX4sxNqYE",
  "data/tweet-economist/2021/10/1444182632409993217.json": "Around 9.7m abortions are carried out each year in China, according to official statistics, yielding an abortion rate of roughly 28 per 1,000 women https://t.co/AlbZrsWUXx",
  "data/tweet-economist/2021/10/1444110348152414215.json": "In 1994, shortly before an American intervention, Joe Biden said that America would not notice if Haiti sank into the sea. When his comments resurfaced recently, disgust was voiced on social media https://t.co/z2fZzjYuN6",
  "data/tweet-economist/2021/10/1444199774773813248.json": "An ageing workforce and grim conditions have created shortages of lorry drivers across Europe. Both problems are, though, especially acute in Britain https://t.co/GeXRa0OQGE",
  "data/tweet-economist/2021/10/1444277513174372352.json": "Forgoing steaks may be one of the most efficient ways to reduce your carbon footprint https://t.co/2sRSseXvdX",
  "data/tweet-economist/2021/10/1444042458069880837.json": "To counter the effects of global warming, researchers are trying to assist the upwelling of cooler waters to stimulate algal growth on platforms https://t.co/JcjOiaEahp",
  "data/tweet-economist/2021/10/1444304672999751682.json": "Adjusting for population, the daily death rate is now about eight times higher in America than in the rest of the rich world https://t.co/0aTj6sNp3W",
  "data/tweet-economist/2021/10/1444265435332022275.json": "The monarchy is funded by a mix of government largesse and private assets https://t.co/yTQPsl5pNO",
  "data/tweet-economist/2021/10/1444315000944873474.json": "America’s fossil-fuel lobby is well-organised, ruthless and dug-in on the right  https://t.co/vrLoBgwC3t",
  "data/tweet-economist/2021/10/1443930467321974787.json": "Russia, Israel and Norway belong to a global minority of countries that still require mandatory military service. But this is on the rise https://t.co/N7J7MaUz1j",
  "data/tweet-economist/2021/10/1444323316869783561.json": "Doing without beef from live cattle is hard to imagine, but the same was true of coal 100 years ago https://t.co/Gt8pcPQdKo",
  "data/tweet-economist/2021/10/1444246295166820353.json": "He long ago quashed any semblance of democracy in Rwanda, and is regularly returned to power with over 90% of the vote https://t.co/mc9iW4IFGT",
  "data/tweet-economist/2021/10/1444345203347922946.json": "In Kenya more than 20 pension funds have formed a consortium to invest in infrastructure https://t.co/QrTVlqP6Fo",
  "data/tweet-economist/2021/10/1444297011658956803.json": "RT @AlexSelbyB: We're hiring! Come and join @TheEconomist's data team for a six-month traineeship\nhttps://t.co/6GM7gkj7mB",
  "data/tweet-economist/2021/10/1444428746052841479.json": "By cooking so many cows, humans are cooking themselves, too https://t.co/s2WlQw7UD8",
  "data/tweet-economist/2021/10/1444398295229550598.json": "There is a reason VATs underpin European-style welfare states: there is no desirable alternative https://t.co/BbYAtzgDkp",
  "data/tweet-economist/2021/10/1444459070040203271.json": "Brazil could produce weapons-grade uranium if it so chose https://t.co/Kf8UZ5VesL",
  "data/tweet-economist/2021/10/1444405091415494657.json": "In 2011 diesel accounted for 55% of car sales in Europe; in August only 20% of registrations had a diesel under the bonnet https://t.co/eyuD8uCji7",
  "data/tweet-economist/2021/10/1444471537466331138.json": "A profound geopolitical shift is happening https://t.co/WvssOkwE0D",
  "data/tweet-economist/2021/10/1444489403158736896.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/8Oiv497EDW",
  "data/tweet-economist/2021/10/1444525323903766531.json": "Millions of devotees continue to be in thrall to self-professed saints despite their dodgy track records https://t.co/cSjsZ7etye",
  "data/tweet-economist/2021/10/1444496196605779971.json": "Even where renewables create lots of jobs, they tend to be transient https://t.co/Cc8ba9rI8M",
  "data/tweet-economist/2021/10/1444529199360970753.json": "Standard English is hugely important to those many strivers who didn’t grow up with it—yet hope to master it, so that they can join the wider community around the world that uses it https://t.co/xaq7m4FF2c",
  "data/tweet-economist/2021/10/1444592170317533189.json": "In Namibia the value of retirement fund assets is larger than the country’s annual GDP https://t.co/Qx9VuUjF7X",
  "data/tweet-economist/2021/10/1444638124122984453.json": "There is a growing brigade of digital nomads in Europe who work remotely while satisfying their wanderlust https://t.co/Sh6bFT3d6U",
  "data/tweet-economist/2021/10/1444660261441445898.json": "Forgoing steaks may be one of the most efficient ways to reduce your carbon footprint https://t.co/hJ4VFXFLvW",
  "data/tweet-economist/2021/10/1444229942787678210.json": "China’s economic influence in Germany is growing. For instance, the city of Duisburg is the European terminus for China’s Belt and Road Initiative https://t.co/V0seMScFww",
  "data/tweet-economist/2021/10/1444677378010140678.json": "Fake news has been around forever. The internet just made it profitable again. From the archive @1843mag https://t.co/qmV8Ly7CqA",
  "data/tweet-economist/2021/10/1444625290098089985.json": "Russian conscripts receive a meagre monthly stipend of just $30, for which they suffer not only exhaustion but also endemic hazing https://t.co/YNE84INU49",
  "data/tweet-economist/2021/10/1444687229834702850.json": "There was no evidence to prove that anyone outside northern Europe had heard of America until Columbus’s voyage in 1492. Until now  https://t.co/IyGGb8Q5OW",
  "data/tweet-economist/2021/10/1444707845514072070.json": "The fossil-fuel lobby is not about to give up. By one calculation it outspent its renewables counterpart last year by 13:1 https://t.co/S43b6ZxdJw",
  "data/tweet-economist/2021/10/1444730994313940992.json": "Unwillingness to levy a VAT, which is a tax on consumption, means America relies on taxes that deter work and investment https://t.co/leGtMJ3R3i",
  "data/tweet-economist/2021/10/1444705328780742657.json": "The joy of rex https://t.co/ggQz4Ev02Y",
  "data/tweet-economist/2021/10/1444521318913818626.json": "In capitals across the world, they fly Afghanistan’s old black-red-and-green tricolour. They stamp documents with the old emblem https://t.co/eiCCUOP3zv",
  "data/tweet-economist/2021/10/1444761175363887109.json": "Doing without beef from live cattle is hard to imagine, but the same was true of coal 100 years ago https://t.co/Kg8ycgE4BZ",
  "data/tweet-economist/2021/10/1444723995916521472.json": "Are vertical farms the future of crop growing? https://t.co/ozrZjxrMjv",
  "data/tweet-economist/2021/10/1444791380048597005.json": "Lab-grown meat could play an essential role in staving off a climate catastrophe https://t.co/uokr5jJrgW",
  "data/tweet-economist/2021/10/1444852449261588484.json": "Doing without beef from live cattle is hard to imagine, but the same was true of coal 100 years ago https://t.co/CzeuYV449f",
  "data/tweet-economist/2021/10/1444856802307416068.json": "America's life expectancy dropped the most https://t.co/VJQTWSyQKG",
  "data/tweet-economist/2021/10/1444820869130371072.json": "The origins of the war, Richard Overy says, lay in the zenith of European colonialism in the late 19th century; it became imperialism’s violent nemesis https://t.co/J5aB1lvr7d",
  "data/tweet-economist/2021/10/1444802957762088963.json": "It is mostly only one half of humanity that is being asked to give up a common word https://t.co/303Ja0zu0z",
  "data/tweet-economist/2021/10/1444450386304241664.json": "If this works and can be scaled up, not only could such technology boost seaweed production, it might also help ecosystems that depend on seaweed forests https://t.co/b5qh68LecL",
  "data/tweet-economist/2021/10/1444870679908732935.json": "The world’s third-largest economy cannot afford a government that simply muddles through https://t.co/IP2chfV57g",
  "data/tweet-economist/2021/10/1444906023131631625.json": "For the same reasons that women live longer: less booze and bravado, and different biology https://t.co/eAzPllUasV",
  "data/tweet-economist/2021/10/1444932063191240712.json": "Forgoing steaks may be one of the most efficient ways to reduce your carbon footprint https://t.co/F1h5Fz1kjM",
  "data/tweet-economist/2021/10/1444936100204752896.json": "Xi Jinping’s anti-capitalist campaign is remarkable for its scope and ambition. It has rocked Alibaba, Didi and Evergrande in the past year, destroying perhaps $2trn of wealth https://t.co/jVMV57pc5l",
  "data/tweet-economist/2021/10/1444959742384910342.json": "Senior officials, journalists and even war veterans have had to self-isolate before coming within breathing distance of Vladimir Putin https://t.co/whDeIwcflk",
  "data/tweet-economist/2021/10/1444999606656450568.json": "Two scientists have just won the Nobel Prize in medicine for their discoveries of touch- and temperature-sensing receptors. As we wrote in February, the importance of touch starts early https://t.co/a9gQnJBweL",
  "data/tweet-economist/2021/10/1444992893597458436.json": "Yes, we still think you should eat bugs. Here’s why https://t.co/Ei3xs0PbJg",
  "data/tweet-economist/2021/10/1445029497309384710.json": "\"Bodies with vaginas\" and \"birthing people\" are strange ways to refer to half of humanity https://t.co/q26aQfo0lh",
  "data/tweet-economist/2021/10/1445060126424059912.json": "Vladimir Putin visited Moscow’s main covid-19 hospital in March last year. But since then, perhaps no world leader has been as shielded from the virus https://t.co/6lwdNWaofy",
  "data/tweet-economist/2021/10/1445056323134099475.json": "Why do some rich-world governments tacitly encourage certain types of tax avoidance? We explain https://t.co/2JQvTmlm09",
  "data/tweet-economist/2021/10/1444812342601162760.json": "Professors of theology are imagined to be dull, gentle souls. “God: An Anatomy”, however, is a great rebel shout https://t.co/jaAFLl4Qyp",
  "data/tweet-economist/2021/10/1445071816087703554.json": "Your vegan cheese might contain proteins produced by edited microbes https://t.co/0CmD5Sm8yn",
  "data/tweet-economist/2021/10/1445064173671571458.json": "Sceptics argue that it could damage other parts of ocean ecosystems, and might even create unwanted side-effects that end up accelerating climate change rather than slowing it https://t.co/OgkNYpPJFF",
  "data/tweet-economist/2021/10/1445042675346968577.json": "David Julius and Ardem Patapoutian have just won a Nobel Prize for their discoveries of receptors for touch and temperature. Earlier in the year we wrote about the value of this easily overlooked sense https://t.co/aupzMO9PzL",
  "data/tweet-economist/2021/10/1445082864828178444.json": "Companies that scrap management tiers tend to find that getting rid of a formal pecking order results in informal hierarchies taking hold instead https://t.co/r3jy2CaLwr",
  "data/tweet-economist/2021/10/1445065943231746060.json": "A mix of generosity and fear is making some people nervous about a common word https://t.co/PtksyAMYyC",
  "data/tweet-economist/2021/10/1445096940778180618.json": "Animal-based foods account for 57% of agricultural greenhouse gases, versus 29% for food from plants https://t.co/S33qIHyWv1",
  "data/tweet-economist/2021/10/1445093123609272325.json": "The price of PVC, the plastic used to make LPs, has surged. Meanwhile demand for the stuff has boomed https://t.co/10VeJCeO4c",
  "data/tweet-economist/2021/10/1445088226826493953.json": "In 1992 the officers who attacked Rodney King were tried and, despite George Holliday’s video, acquitted of assault https://t.co/QqJapI2QKo",
  "data/tweet-economist/2021/10/1445086745901600768.json": "Could the covid-19 virus mutate in a way that would make vaccines ineffective? You asked, and our experts @natashaloder and @alokjha answered in this film https://t.co/Dk2Y0f5JXE https://t.co/kYy5ZNvxpW",
  "data/tweet-economist/2021/10/1445075532719214597.json": "The most divisive issue in American politics reached the justices while they were on holiday, when the court declined to stand in the way of a Texas law that bans abortion after six weeks of pregnancy  https://t.co/TvL14gwEIf",
  "data/tweet-economist/2021/10/1445066716178964507.json": "“It looks like the court will shape America more than America will shape the court.” @stevenmazie tells “The Intelligence” about a momentous SCOTUS term https://t.co/rJ6dHAtG7X",
  "data/tweet-economist/2021/10/1445038600496820225.json": "Germany is probably heading for its first three-way coalition since the 1950s and SPD party leader Olaf Scholz is likely to take charge  https://t.co/gCv7Gj68qD",
  "data/tweet-economist/2021/10/1445109606045392897.json": "Growing vegetables in skyscrapers might be environmentally beneficial, but field­-based agriculture remains much cheaper https://t.co/QG38SSTAYs",
  "data/tweet-economist/2021/10/1445105711214641154.json": "When it comes to elections in the EU, the votes may still be national. But the politics are distinctly European https://t.co/ks7EKKwbDW",
  "data/tweet-economist/2021/10/1445100443152093195.json": "Cheap, real-time gene sequencing could boost everything from cancer treatment to environmental modelling to disease surveillance https://t.co/43xFi9eWei",
  "data/tweet-economist/2021/10/1445112266953789452.json": "On “The Intelligence”: @OhHiRalphJones looks at why scriptwriters like hotels as their backdrops. The random mixing of total strangers is great for horror, drama and comedy alike https://t.co/ECtuVy7TcA https://t.co/1xLfSmQLFq",
  "data/tweet-economist/2021/10/1445116590249455627.json": "Movimento Brasil Livre is a group of angry young men who have a knack for using social media and the streets to achieve their political goals  https://t.co/Qzo0uerjIJ",
  "data/tweet-economist/2021/10/1445132388552560648.json": "We explain why the Pandora Papers won’t be the last in the series of leaks about murky tax dealings https://t.co/kwKuimX5Lh",
  "data/tweet-economist/2021/10/1445124127417831441.json": "Evergrande, China’s largest developer, is threatening to default. On “Money Talks” @donweinland explains what this reveals about the broader troubles in the country’s property market https://t.co/3Z3IXuVMed",
  "data/tweet-economist/2021/10/1445140690871148548.json": "New research shows 44 countries that owe the equivalent of at least 10% of their GDP to China https://t.co/fuKgvFb2r9",
  "data/tweet-economist/2021/10/1445134664348340230.json": "The presidential election may give a clearer sense of Chile’s change of course  https://t.co/LqtflJzEqQ",
  "data/tweet-economist/2021/10/1445141965805326342.json": "There is little doubt the court will continue to move the country to the right. The question is how far and how fast https://t.co/GlnFnC4Cd6",
  "data/tweet-economist/2021/10/1445158059790278659.json": "Eating less meat or giving up flying are simple ways people can help mitigate climate change. But how much does personal action matter? Our editors Vijay Vaitheeswaran, @catBrahic and Oliver Morton debate on “To a Lesser Degree” https://t.co/BnllXEqMAp",
  "data/tweet-economist/2021/10/1445160816832126980.json": "The economics of American energy is being transformed; the politics, not so much https://t.co/egHdAvhmzb",
  "data/tweet-economist/2021/10/1445158798168051715.json": "Doing without beef from live cattle is hard to imagine, but the same was true of coal 100 years ago https://t.co/3AGv32dadP",
  "data/tweet-economist/2021/10/1444824734496133123.json": "Whether Xi Jinping can impose his anti-capitalist reality will shape China’s future—and the ideological battle between democracy and dictatorship https://t.co/GPxANeBp7N",
  "data/tweet-economist/2021/10/1444931563943251968.json": "No country yet recognises the Islamic Emirate established by the Taliban. Afghanistan’s embassies still represent the old government, which fell in August https://t.co/cBCHDrZOaS",
  "data/tweet-economist/2021/10/1445178636823408646.json": "Dwindling investment in oil, gas and coal means high prices are here to stay  https://t.co/2lYV43eFG8",
  "data/tweet-economist/2021/10/1445174477038489611.json": "The sense of touch is easily overlooked. But being deprived of it can have a negative effect on your health. From the archive https://t.co/16uutXIQqz",
  "data/tweet-economist/2021/10/1445230741697269760.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/YwbPFFLCme",
  "data/tweet-economist/2021/10/1445269075320508421.json": "Covid-19 has prompted big changes in how people work. Many employers are introducing flexible work policies https://t.co/qSnfn9dB00",
  "data/tweet-economist/2021/10/1445274089933975554.json": "Forgoing steaks may be one of the most efficient ways to reduce your carbon footprint https://t.co/mT2gzpK93a",
  "data/tweet-economist/2021/10/1445264669166510080.json": "It is through the senses, and the senses alone, that human beings are able to perceive the world https://t.co/W6NC4LrQbq",
  "data/tweet-economist/2021/10/1445300318028374017.json": "The second world war was fuelled by imperial fantasies https://t.co/WgVFum6zyH",
  "data/tweet-economist/2021/10/1445295893515800577.json": "Brazil might get nuclear-powered submarines even before Australia https://t.co/L957bjFhlm",
  "data/tweet-economist/2021/10/1444884101304049664.json": "With unemployment low, there is little professional advantage in doing so https://t.co/bfqRlSJMbo",
  "data/tweet-economist/2021/10/1445034257504669708.json": "Eager to draw visitors in economically challenging times, governments have been easing the rules for digital nomads https://t.co/hcdnKlrVyK",
  "data/tweet-economist/2021/10/1445328190600253441.json": "The world’s official covid-19 death count is 4.8m, but our new machine-learning model estimates that between 9.9m and 18.5m people have died https://t.co/23XULVCVna",
  "data/tweet-economist/2021/10/1445364595103784962.json": "The Nobel prize in physics has recognised work in reliably predicting global warming. The extremes of floods and fires are not going away—and urgent action is needed https://t.co/h4GMy9mPzT",
  "data/tweet-economist/2021/10/1445317648494075904.json": "Millions of devotees continue to be in thrall to self-professed saints despite their dodgy track records https://t.co/8jgf2Hf10Y",
  "data/tweet-economist/2021/10/1445376745478234119.json": "Syukuro Manabe’s Nobel prize-winning work explained how increased levels of CO2 led to global warming. We explain the alarming ways in which rising temperatures will transform Earth https://t.co/zbpVZnKVyh",
  "data/tweet-economist/2021/10/1445381504587255816.json": "The exposé lifts the lid on the financial affairs of dozens of world leaders, other public officials and billionaires in 91 countries https://t.co/nIfRymi4HY",
  "data/tweet-economist/2021/10/1445215284101623809.json": "Ever wondered what the difference between tax evasion and tax avoidance is? We explain https://t.co/QZlF8pEPmA",
  "data/tweet-economist/2021/10/1445152269306109955.json": "“Americans have a habit of energising themselves by boosting threats, and a history of re-inventing their country as a consequence,” argues Dmitri Trenin https://t.co/IYoMjEQrmK",
  "data/tweet-economist/2021/10/1445400300827840525.json": "Harmful chemicals commonly found in the home could be to blame https://t.co/VBdDoGXDW4",
  "data/tweet-economist/2021/10/1445333318875156481.json": "“God: An Anatomy” is a learned but rollicking journey through every aspect of his body https://t.co/4bLbTI46DQ",
  "data/tweet-economist/2021/10/1445423604557037570.json": "Syukuro Manabe and Klaus Hasselman have just won a Nobel prize for their climate research. We explain why the world urgently needs to invest in adapting to the changing climate https://t.co/8JaXEmeLCx",
  "data/tweet-economist/2021/10/1445403429677961224.json": "“Blood and Ruins” is a magnificent book that reflects the deep scholarship and humane judgment of a magisterial historian https://t.co/32Lw1Tfk11",
  "data/tweet-economist/2021/10/1445446077809938433.json": "By cooking so many cows, humans are cooking themselves, too https://t.co/vuit0jlRkP",
  "data/tweet-economist/2021/10/1445476554373435399.json": "In one recent survey, 80% of employees considering a new role said the ability to live somewhere else was important to them https://t.co/v5sHtMsfYD",
  "data/tweet-economist/2021/10/1445468730100617222.json": "Officially, 210,000 Russians have died from covid-19—but our excess-mortality tracker suggests the probably number is four times that https://t.co/yKHtU1WOyb",
  "data/tweet-economist/2021/10/1445419566314754048.json": "For many Western European countries, like Belgium and Spain, the drop in life expectancy was the largest in a single year since the second world war\n\n⬇️ Click to read how other countries were affected",
  "data/tweet-economist/2021/10/1445524909254332418.json": "The work of Klaus Hasselmann, one of this year’s Nobel prize winners, looks at how to reliably model the impact of climate change. We explain how models are used to manage and predict climate change, and what this means for Earth https://t.co/mY80cujk1I",
  "data/tweet-economist/2021/10/1445582498302349320.json": "Doing without beef from live cattle is hard to imagine, but the same was true of coal 100 years ago https://t.co/wq0ZMYRyvX",
  "data/tweet-economist/2021/10/1445587434440257553.json": "The poor have been the main beneficiaries of the government’s pandemic support, with far fewer suffering precipitous drops in incomes than would have otherwise been the case https://t.co/VIbYWWS9hr",
  "data/tweet-economist/2021/10/1445255374311985154.json": "Two Fed presidents resign after criticism of their investment activities https://t.co/niQUQHOt82",
  "data/tweet-economist/2021/10/1445608795711754243.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/sNhNUObnXJ",
  "data/tweet-economist/2021/10/1445545503643488260.json": "Political instability and a shortage of funds are pushing scientists abroad https://t.co/NdbhWKBazd",
  "data/tweet-economist/2021/10/1445572152325931020.json": "Many in Pakistan—55% according to a recent Gallup poll—are pleased to have the Taliban ruling next door again. Others see it as an ominous warning https://t.co/xwYi6BIcjr",
  "data/tweet-economist/2021/10/1445631045462683651.json": "Iceland’s experience suggests a better balance between work and life need not reduce output https://t.co/40AGkQ7vzO",
  "data/tweet-economist/2021/10/1445508113524686853.json": "This year’s Nobel prize for physics was awarded to a trio of researchers who have studied complex, chaotic and apparently random systems and developed ways to predict their long-term behaviour https://t.co/UG1tXsr0Nd",
  "data/tweet-economist/2021/10/1445626914572439563.json": "In September 1962 East Berliners found a path to freedom under the earth https://t.co/bsyvSona7t",
  "data/tweet-economist/2021/10/1445635815137177612.json": "Palm oil could, in principle, be created without the need for deforestation https://t.co/7NtmYFhAUT",
  "data/tweet-economist/2021/10/1445666900076236800.json": "New research shows 44 countries that owe the equivalent of at least 10% of their GDP to China https://t.co/dp5s273BAy",
  "data/tweet-economist/2021/10/1445567700218961926.json": "Globally houses are heavily overpriced when compared with rent and incomes https://t.co/OpIWKYcrVI",
  "data/tweet-economist/2021/10/1445613127198904321.json": "Whether this was ritual fighting between males for access to females, or was part of the process by which males and females checked each other out, is impossible to determine https://t.co/P3ZAZTQosV",
  "data/tweet-economist/2021/10/1445748283838582791.json": "This good news should not be exaggerated https://t.co/LLEItZZ1wH",
  "data/tweet-economist/2021/10/1445437250087440388.json": "Greece is buying warplanes and frigates from France. Yet both sides are keen to show that this is more than just an arms contract https://t.co/NqyamHUK5r",
  "data/tweet-economist/2021/10/1445754639106789380.json": "Human dietary desires, and the economies built around them, now rank among the most planet-shaping forces of nature.\n\nClick here to read the first article in our technology quarterly on the future of food 👇",
  "data/tweet-economist/2021/10/1445770596365705230.json": "This year’s physics prize is the first scientific Nobel to be awarded for understanding Earth’s climate https://t.co/u8hN9XFAZn",
  "data/tweet-economist/2021/10/1445798900611395590.json": "Should you give up eating meat? Thread 👇 https://t.co/z1KJkGOVC5",
  "data/tweet-economist/2021/10/1445801864348397574.json": "⚡️By cooking so many cows, humans are cooking themselves, too. Cutting down on meat could play an essential role in staving off a climate catastrophe https://t.co/TGXuXSZ0UW",
  "data/tweet-economist/2021/10/1445810613633048576.json": "At least 216,000 children were sexually abused in France by 2,900-3,200 clergy across 70 years, a church-commissioned inquiry revealed  https://t.co/lvQlaNNxcJ",
  "data/tweet-economist/2021/10/1445791627143008256.json": "The appetite for freer trade is not what it was. Partly that is down to a widespread perception that the ideology of free trade has failed to deliver its promises https://t.co/j53bsTVJE6 https://t.co/hRGbML6ZAZ",
  "data/tweet-economist/2021/10/1445825959450615808.json": "About 90% of the victims of sexual abuse were boys, many between ten and 13 years old https://t.co/6RQptgMXK2",
  "data/tweet-economist/2021/10/1445853121905823744.json": "Forgoing steaks may be one of the most efficient ways to reduce your carbon footprint https://t.co/w8trKYVg0t",
  "data/tweet-economist/2021/10/1445870438228312064.json": "It reduces the number of severe malaria cases by 30%  https://t.co/S5V6lpK2v4",
  "data/tweet-economist/2021/10/1445886471718649856.json": "Some economists worry that the world economy is entering a period of “stagflation”—weak growth and high inflation—reminiscent of the 1970s https://t.co/JRG9ZDlP2z",
  "data/tweet-economist/2021/10/1445856156962885632.json": "It was the efforts of sexual abuse survivors to break the silence that forced the French Catholic church to confront its denials and cover-ups https://t.co/1beT8FQBP9",
  "data/tweet-economist/2021/10/1445834480531517448.json": "Why Facebook's leaks could prove a turning point https://t.co/L2yU36GB1U",
  "data/tweet-economist/2021/10/1445817136979529730.json": "Facebook and other big tech firms, which have been criticised for violating people’s privacy online, can no longer count on any privacy either https://t.co/52WzC0ti8y",
  "data/tweet-economist/2021/10/1445781457465577476.json": "The mosquito, and malaria, shows how history is partly created by non-human forces https://t.co/8R3Hcq6IlZ",
  "data/tweet-economist/2021/10/1445989679770206208.json": "By cooking so many cows, humans are cooking themselves, too https://t.co/b10yuTBhJc",
  "data/tweet-economist/2021/10/1445999063229472772.json": "A two-year, independent inquiry into sexual abuse in the French Catholic church concludes. Its revelations are damning https://t.co/XREUMtIUmu",
  "data/tweet-economist/2021/10/1445676257027391492.json": "A new set of taboos around the word \"woman\" is mostly confined to rarefied circles https://t.co/9JKsZTyFAQ",
  "data/tweet-economist/2021/10/1445976328981856257.json": "In 2019, as the first accusations emerged, 56% of French surveyed said they viewed the Catholic church negatively. This week’s report will entrench these trends https://t.co/11pQy48aKV",
  "data/tweet-economist/2021/10/1446061727632789510.json": "Each year more than 260,000 African children die from malaria before their fifth birthdays\nhttps://t.co/eMEExaB4ds",
  "data/tweet-economist/2021/10/1445839859172655108.json": "\"Bodies with vaginas\" and \"birthing people\" are strange ways to refer to half of humanity https://t.co/QaXjppkAzM",
  "data/tweet-economist/2021/10/1446081607882919936.json": "RT @TheEconomist: Should you give up eating meat? Thread 👇 https://t.co/z1KJkGOVC5",
  "data/tweet-economist/2021/10/1446079485791674373.json": "The blind fury unleashed against Facebook shows that its reputational problems have got out of hand https://t.co/FpLeYzOzZY",
  "data/tweet-economist/2021/10/1446074711847415809.json": "A lack of spending once troubled the world’s economy—now it’s a lack of supply. This new era of scarcity threatens global prosperity. Our cover this week https://t.co/8O6qp1E8tW https://t.co/TlvslP1eQ5",
  "data/tweet-economist/2021/10/1445932121223204870.json": "Standard English is hugely important to those many strivers who didn’t grow up with it—yet hope to master it, so that they can join the wider community around the world that uses it https://t.co/dRppdEg7f6",
  "data/tweet-economist/2021/10/1446091517362380800.json": "By cooking so many cows, humans are cooking themselves, too. Cutting down on meat could play an essential role in staving off a climate catastrophe https://t.co/DC2OOwWo0Z",
  "data/tweet-economist/2021/10/1446107805237145611.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/HaceCzaipa",
  "data/tweet-economist/2021/10/1446106103633350664.json": "It is the first scientific Nobel to be awarded for understanding Earth’s climate. Human beings can no longer say they did not know how or why Earth is heating up https://t.co/k8d58uyxjT",
  "data/tweet-economist/2021/10/1446128211956359168.json": "Hydrogen technologies could eliminate perhaps a tenth of today’s greenhouse-gas emissions by 2050 https://t.co/P4vB9o4cqP",
  "data/tweet-economist/2021/10/1446127974349111302.json": "We’re looking for a data-journalism trainee to join The Economist’s data team. Apply by October 11th https://t.co/h398kxdT9R https://t.co/nObYn0ryKK",
  "data/tweet-economist/2021/10/1446110838624960513.json": "“The country has literally handed over trillions of dollars of its wealth to other countries, with China getting the lion’s share,” argues Robert Lighthizer, who served in the administrations of Donald Trump and Ronald Reagan  https://t.co/pjaQoABS07",
  "data/tweet-economist/2021/10/1446149331187273733.json": "The public has long suspected Facebook of two-faced toxicity. What was lacking was the proof—until now https://t.co/xhpdYOiLUk",
  "data/tweet-economist/2021/10/1446150845205254149.json": "To avert mass-starvation in Tigray, Western governments must pull every lever they have to force Abiy Ahmed's government to lift the blockade of the region https://t.co/Dsffj9TJdY",
  "data/tweet-economist/2021/10/1446158638725410818.json": "This week’s cartoon from KAL: https://t.co/jeC6TPkwKH https://t.co/ac7KgNnSh4",
  "data/tweet-economist/2021/10/1446183572684091392.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/G7HjWckvM2",
  "data/tweet-economist/2021/10/1446215826575663115.json": "When Facebook’s apps were knocked offline for six hours, some wondered whether the world would be a better place if this were permanent https://t.co/CdpyEkPwQm",
  "data/tweet-economist/2021/10/1446203701727739911.json": "More than 5m people in Tigray do not have enough to eat. But Western countries still have considerable leverage to force the Ethiopian government's hand https://t.co/o7sa7Lp0D4",
  "data/tweet-economist/2021/10/1446242837855625216.json": "It took Facebook roughly nine years to hit the billion-user mark, around eight for Instagram and seven for each of YouTube and Whatsapp. Tiktok did it in five https://t.co/VOxk4BNbI7",
  "data/tweet-economist/2021/10/1446122666402848787.json": "Despite agreeing on much, Americans dislike each other more than ever https://t.co/DWfvwioUBu",
  "data/tweet-economist/2021/10/1446086406879776774.json": "RT @MarieSegger: 🚨@TheEconomist's data team is hiring a data journalism trainee! Come join us if you love words and numbers in equal measur…",
  "data/tweet-economist/2021/10/1446333440685658149.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/gJgggPynlB",
  "data/tweet-economist/2021/10/1446315928631791618.json": "Her subtle performance in “Mare of Easttown” illustrates the gulf between superb actors and excellent ones https://t.co/Q3wkCVQTdK",
  "data/tweet-economist/2021/10/1446351986207698949.json": "Hydrogen could be the answer to one of the biggest problems with renewable energy—how to store it https://t.co/OF60RUwl7s",
  "data/tweet-economist/2021/10/1446358463978823682.json": "“Meat is cheap because we have developed a system that makes it cheap, primarily by externalising the environmental costs.” @jonfasman tells “To a Lesser Degree” plant-based meat substitutes are still too expensive to dent carbon emissions https://t.co/lG29bQ0OWB",
  "data/tweet-economist/2021/10/1446385769975853096.json": "TikTok’s rapid rise demonstrates a clear preference among social-media users for video content. That is, until the next blockbuster app comes along https://t.co/RiJx1V1IYc",
  "data/tweet-economist/2021/10/1446404957717028890.json": "Meat-eating habits are undergoing a shift and customers are altering their dining choices to change the world food system https://t.co/FKsPJgMuGD https://t.co/qlG1Kp8LPM",
  "data/tweet-economist/2021/10/1446374817956048932.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/a8hDJ3gyTD",
  "data/tweet-economist/2021/10/1446284703074562055.json": "Australia, Chile and Morocco hope to ship renewable energy to the world by storing it in hydrogen https://t.co/F0WXLIDyCt",
  "data/tweet-economist/2021/10/1446265332461670404.json": "New research shows 44 countries that owe the equivalent of at least 10% of their GDP to China https://t.co/awcID3Idqq",
  "data/tweet-economist/2021/10/1446307323115450384.json": "China’s economic model, with its murky relations between state and private sector, had long strained the legalistic WTO system https://t.co/zGt2TVcHOy",
  "data/tweet-economist/2021/10/1446442655219699744.json": "⚡️By cooking so many cows, humans are cooking themselves, too. Cutting down on meat could play an essential role in staving off a climate catastrophe https://t.co/TLqj23KhR6",
  "data/tweet-economist/2021/10/1446378618876276751.json": "America and the EU have taken steps to press Ethiopia and the Tigrayans to stop the war. But the impact has been negligible https://t.co/9zAQi0cvZ9",
  "data/tweet-economist/2021/10/1446396919379636225.json": "Facebook risks joining the ranks of corporate untouchables like big tobacco. But even if people stick with the company, it has ambitions that could be foiled if public opinion continues to turn https://t.co/xbeF0eOvdq",
  "data/tweet-economist/2021/10/1446499964893470770.json": "Inflation rates around the world have been rising. Should you be worried? \n\nWatch our latest film to find out 👇",
  "data/tweet-economist/2021/10/1446507563361705989.json": "Ethiopia’s government insists it is doing all it can to help the hungry in Tigray. Data from the UN tell a different story https://t.co/pssXK7viXp",
  "data/tweet-economist/2021/10/1446523798082265113.json": "The Nobel peace prize has been awarded to Maria Ressa and Dmitry Muratov, two journalists who criticise the autocratic excesses of their countries’ governments. \n\nThe award is timely, as our piece from February explains\nhttps://t.co/Bi1hYQOznf",
  "data/tweet-economist/2021/10/1446556024408846339.json": "The most damaging claim against Facebook this week gained the least attention—an allegation that it concealed a decline in its young American users https://t.co/m0mCy2e1y0",
  "data/tweet-economist/2021/10/1446521546101727270.json": "Is owning a football team the way to gain acceptance in British society? https://t.co/3Pp7SM7qea",
  "data/tweet-economist/2021/10/1446561810681843712.json": "The search for a vaccine has been going on for dec­ades https://t.co/jN5IC7tx7R",
  "data/tweet-economist/2021/10/1446583688662224897.json": "Why did Sheikh Mansour of Abu Dhabi pay around £150m for Manchester City? And why did Saudi Arabia’s sovereign-wealth fund buy Newcastle United?  https://t.co/CH81ncswXD",
  "data/tweet-economist/2021/10/1446581178992037899.json": "His superhero mission is to “kick Keynesians and collectivists in the ass”  https://t.co/7VMA7Zc8XF",
  "data/tweet-economist/2021/10/1446490356682530839.json": "In recent weeks a shortage of energy and sky-high prices have caught the world’s attention https://t.co/H9RBLuz0WQ",
  "data/tweet-economist/2021/10/1446229825509855234.json": "The mathematician was undoubtedly a genius, and reading “The Man from the Future” gives you an inkling of what that overused word really means https://t.co/eBF1B3eH2D",
  "data/tweet-economist/2021/10/1446577649556545547.json": "Relations between Ethiopia and many Western countries are at their lowest point in decades. They could sink further https://t.co/WBkSih0wJU",
  "data/tweet-economist/2021/10/1446679351387467779.json": "Abdulrazak Gurnah’s books are full of the turmoil of conflict and suffering. Yet, for all that, they are imbued with a deep humanity https://t.co/6cka6caxwa",
  "data/tweet-economist/2021/10/1446700458345701378.json": "Hydrogen can play a vital role in the green energy transition https://t.co/jKeLHGc1ms",
  "data/tweet-economist/2021/10/1446599045934456838.json": "Hydrogen is a means of decarbonising the parts of the economy, such as steel production, that other industrial transformations cannot reach https://t.co/P7jY5lbVfK",
  "data/tweet-economist/2021/10/1446710483764064259.json": "Some may think that 30% efficacy is not much. But in parts of sub-Saharan Africa children contract malaria six times a year on average https://t.co/5E62sJrEBd",
  "data/tweet-economist/2021/10/1446720228474359809.json": "Sea slugs have a unique way of utilising sunlight https://t.co/C3bXD0cnEI",
  "data/tweet-economist/2021/10/1446706035234906113.json": "Australia, Chile and Morocco hope to ship renewable energy to the world by storing it in hydrogen https://t.co/y0DFRTRegP",
  "data/tweet-economist/2021/10/1446592754591612928.json": "Sea slugs are among the most beautiful animals on Earth. In some cases, part of that beauty comes from subcellular structures called chloroplasts https://t.co/NgFNrLJdcD",
  "data/tweet-economist/2021/10/1446758968316026880.json": "Shocked by the Pandora papers? The rich have a long history of stashing their cash https://t.co/YSc97HJ8Br",
  "data/tweet-economist/2021/10/1446772186300260353.json": "Even when Facebook set out plausible responses to whistleblower Frances Haugen, people no longer wanted to hear https://t.co/45xfwE95Et",
  "data/tweet-economist/2021/10/1446733939876446210.json": "A Premier League club can be a lucrative venture. But buying footballing success will become harder  https://t.co/yQ8QvH4lJl",
  "data/tweet-economist/2021/10/1446734941560115204.json": "Governments are trying to spur clean-hydrogen capacity the same way they did for renewable energy https://t.co/L9DtyavQyY",
  "data/tweet-economist/2021/10/1446607614549319680.json": "Tensions have escalated between China and Taiwan. “We see that Taiwan could, in fact, become that flashpoint that...starts a wider war.” Retired US General @StanMcChrystal explains why the world needs to decide where it stands, on “The Economist Asks” https://t.co/cqGxFpqV7u https://t.co/M0TKtUXZSI",
  "data/tweet-economist/2021/10/1446809441777618945.json": "Autocratic governments are now linked to several Premier League clubs, including Newcastle, Chelsea and Manchester City https://t.co/Qo2SdqNCB8",
  "data/tweet-economist/2021/10/1446490588975706117.json": "The longer prices stay high, the more likely it becomes that the transition to clean energy ultimately buries the fossil-fuel industry\nhttps://t.co/gs4QqeOsBi",
  "data/tweet-economist/2021/10/1446822762119639040.json": "Some 400,000 people in Tigray are facing what aid agencies call “catastrophic” hunger—the last step on the path to mass starvation https://t.co/glZKQoMzoR",
  "data/tweet-economist/2021/10/1446635466132918272.json": "In “There is Nothing for You Here”, Fiona Hill reveals how a familiar trifecta of English questions (where are you from, what does your father do, what school do you go to?) kept swatting her down https://t.co/G7G0205BwW",
  "data/tweet-economist/2021/10/1446581177171816450.json": "China's message is that if Taiwan refuses to accept Beijing's claim to sovereignty over the island, it may use force https://t.co/ywGYkA7hQ8",
  "data/tweet-economist/2021/10/1446696992328060931.json": "In Russia at least, many are disappointed with the committee’s choice not to give the prize to somebody higher profile, such as Alexei Navalny or Sviatlana Tsikhanouskaya https://t.co/2XoZYOmP45",
  "data/tweet-economist/2021/10/1446862279543246851.json": "To “make Argentina a great power again”, Javier Milei wants to reduce regulations, lower taxes and eliminate the central bank  https://t.co/Y8BeyIGHl1",
  "data/tweet-economist/2021/10/1446800754107420676.json": "Assessing China’s intentions for Taiwan is extremely difficult https://t.co/CqTxAHYzSV",
  "data/tweet-economist/2021/10/1446647624426266626.json": "Historically, the more prolonged and severe an outbreak, the more pronounced and persistent the negative effects on trend inflation https://t.co/kcbP5x83CK",
  "data/tweet-economist/2021/10/1446836875361198080.json": "Hydrogen could be the answer to one of the biggest problems with renewable energy—how to store it https://t.co/tyZ9dTNeuy",
  "data/tweet-economist/2021/10/1446825798837604356.json": "“Hydrogen is the fuel of the future—and it always will be”—an old industry joke looks set to lose its punchline https://t.co/EcOeV99c8C",
  "data/tweet-economist/2021/10/1446879895548739594.json": "Forgoing steaks may be one of the most efficient ways to reduce your carbon footprint https://t.co/ABiSVLOEt7",
  "data/tweet-economist/2021/10/1446910851601027073.json": "That was long before Christopher Columbus set sail https://t.co/G2JGSIRbiW",
  "data/tweet-economist/2021/10/1446855749024587777.json": "So far this year unlisted Mexican tech firms have raised nearly $3bn—roughly as much as in the previous nine years combined https://t.co/X8tk192qdu",
  "data/tweet-economist/2021/10/1446950604853624841.json": "Life can only begin when we give up perfectionism, explains psychoanalyst Josh Cohen. From @1843mag\nhttps://t.co/8B1ncfdFqK",
  "data/tweet-economist/2021/10/1446947079058829312.json": "Hydrogen technologies could eliminate perhaps a tenth of today’s greenhouse-gas emissions by 2050 https://t.co/vVq88bMJlZ",
  "data/tweet-economist/2021/10/1446953140692131841.json": "He won recognition as an eccentric guest on talk-shows, eventually becoming the country’s most interviewed economist on television and radio  https://t.co/rFgbzz4rej",
  "data/tweet-economist/2021/10/1446844672631001090.json": "Did the Turks really invent baklava? @1843mag has the answer https://t.co/6t6BWGa7P0",
  "data/tweet-economist/2021/10/1446984849877872643.json": "The World Health Organisation says that the vaccine was found to be safe after more than 2.3m doses had been administered https://t.co/VzqvyPE3ql",
  "data/tweet-economist/2021/10/1446948610344722433.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/G6WUmfGIK9",
  "data/tweet-economist/2021/10/1447036024081768454.json": "If China’s planes were to edge closer to airspace over the island itself, it is unclear how Taiwan would respond https://t.co/x7a7PtWJhh",
  "data/tweet-economist/2021/10/1446911096867131397.json": "Tigray in Ethiopia is under siege and starving. Yet locals in the neighbouring region of Amhara, too, describe a war of survival https://t.co/9XY2KBK7SH",
  "data/tweet-economist/2021/10/1446855233624289289.json": "In “There is Nothing for You Here”, a new memoir, Fiona Hill describes her background and the unique insights she believes this gives her into global affairs https://t.co/dOSFnCW6Ps",
  "data/tweet-economist/2021/10/1447057968407711745.json": "At the parties of the super-rich, there is a hidden economy behind every $100,000 bar tab. Its currency is pretty women. From the @1843mag archive https://t.co/avkSPaabZ3",
  "data/tweet-economist/2021/10/1446870461942484994.json": "The University of Sussex has defended the free speech of gender-critical academic Kathleen Stock. We explain why it is important that more universities do the same https://t.co/khVif1AgwV",
  "data/tweet-economist/2021/10/1447054055134711809.json": "Hydrogen has its limitations, but it can clean up niche markets from steel production to commercial transport https://t.co/jZAdCXQtvh",
  "data/tweet-economist/2021/10/1447085036587597826.json": "Ethiopia's Tigray region is getting only a fraction of the food needed to keep its 6m inhabitants alive, hardly any fuel and no medical supplies at all https://t.co/0p5AkZyq6E",
  "data/tweet-economist/2021/10/1447044161673252869.json": "Imelda Marcos left 3,000 pairs of shoes and five shelves of Gucci handbags when she fled the Philippines. From @1843mag https://t.co/Xmp5H2fh0u",
  "data/tweet-economist/2021/10/1447077364270309378.json": "The West wants the civil war with Tigray to end, but Ethiopia’s government perceives the West as having double standards https://t.co/VLNbkYCoME",
  "data/tweet-economist/2021/10/1447103161207033857.json": "Can a welfare state be both generous and efficient? https://t.co/Y9o6mZ1Cyg",
  "data/tweet-economist/2021/10/1447121306147827716.json": "NASA’s probe will follow one of the most complex paths around the solar system yet. Watch its planned journey here https://t.co/Q4o3B2ybQ4",
  "data/tweet-economist/2021/10/1447139965536718850.json": "Satoshi Nakamoto is the mysterious inventor behind bitcoin. Nobody knows if he or she is a real person, or even if they are alive. But if Nakamoto exists, they are thought to own more than 1m bitcoin, worth more than $30bn https://t.co/JKu0F3E86B https://t.co/wTQBK3DfBF",
  "data/tweet-economist/2021/10/1447007912661069825.json": "Some CPTPP members think China is too big a bully to join https://t.co/SdMfAei7nh",
  "data/tweet-economist/2021/10/1447013136415043584.json": "Biryani was supposedly invented during the 17th century, when India was part of the Mughal empire. From @1843mag\n https://t.co/fDBNT8EY8G",
  "data/tweet-economist/2021/10/1447142379799003138.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/wbMqVakTqO",
  "data/tweet-economist/2021/10/1447040083501232129.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/cMBPd6M5TE",
  "data/tweet-economist/2021/10/1447162494120771590.json": "A lack of spending once troubled the world’s economy—now it’s a lack of supply. \n\nRead why this new era of scarcity threatens global prosperity 👇",
  "data/tweet-economist/2021/10/1447137099833135105.json": "Ethiopia’s prime minister won a Nobel peace prize in 2019. Now he rails against alleged foreign interference and expels UN officials https://t.co/ggn4ok2RCI",
  "data/tweet-economist/2021/10/1447198992081854469.json": "Hydrogen could be the answer to one of the biggest problems with renewable energy—how to store it https://t.co/RfMLbaaOhP",
  "data/tweet-economist/2021/10/1447209815785279500.json": "In Argentina, libertarianism is finding fertile ground among young people  https://t.co/aX78tPKzWh",
  "data/tweet-economist/2021/10/1447061925813227522.json": "He played a seminal role in the Manhattan Project that built the atom bomb and devised the architecture for the first programmable computers https://t.co/5EFSJlEF6q",
  "data/tweet-economist/2021/10/1447196986197921792.json": "From dictators and druglords to pharaohs and royals: the wealthy have long found ways to stash their cash https://t.co/97chk32h35",
  "data/tweet-economist/2021/10/1447246823580635144.json": "“Nobody around me understands the global hype, and neither do I,” says In-young from Seoul who stopped watching “Squid Game” after a couple of episodes https://t.co/71KvipjqSI",
  "data/tweet-economist/2021/10/1447157914679095304.json": "Can we escape from information overload? Ask the man who spent a month living in in the dark https://t.co/ofPIN9cvyX From @1843mag",
  "data/tweet-economist/2021/10/1447255122808090626.json": "Australia, Chile and Morocco hope to ship renewable energy to the world by storing it in hydrogen https://t.co/EoCx0CpPnx",
  "data/tweet-economist/2021/10/1447288843409973253.json": "Many South Korean critics found the characters clichéd, the plot unconvincing and the violence gratuitous https://t.co/t5oZ6jSYDN",
  "data/tweet-economist/2021/10/1447290253077794816.json": "The Czech Republic’s Andrej Babis and Austria’s Sebastian Kurz, both accused of manipulating the political system, lost power on the same day. But a bigger showdown lies ahead https://t.co/DSLCqzP8NG",
  "data/tweet-economist/2021/10/1447287833350262790.json": "Shocked by the Pandora papers? The rich have a long history of stashing their cash. From @1843mag   https://t.co/vB38WwoiV5",
  "data/tweet-economist/2021/10/1447117220014919681.json": "“Ultimately, we failed. And there’s no way to put lipstick on the pig on that one.” @stanMcChrystal, a retired four-star US General, talks about America’s withdrawal from Afghanistan, on “The Economist Asks” podcast  https://t.co/kI50BihmoQ https://t.co/uUJcpLYqxI",
  "data/tweet-economist/2021/10/1447339425290141700.json": "A new study estimates that cases of depression rose by 53m globally as a consequence of the pandemic, 28% above pre-pandemic levels https://t.co/H11ob4SHRP",
  "data/tweet-economist/2021/10/1447219898762113027.json": "The ﬁrst important thing would be to separate out the heavy emitters from the rest https://t.co/CP8ZHab60p",
  "data/tweet-economist/2021/10/1447130702185652227.json": "Missing lorry drivers, backed-up ports and soaring energy prices: welcome to the shortage economy. This new era of scarcity threatens global prosperity https://t.co/xq1QD5iQuA",
  "data/tweet-economist/2021/10/1447017336574197765.json": "Until recently, Mexican entrepreneurs struggled to make a name for themselves, partly because of a dearth of money. That began to change when SoftBank launched a Latin America fund https://t.co/L2ORCvryHf",
  "data/tweet-economist/2021/10/1447370878971482113.json": "A truly global carbon tax would cause problems within supply chains, and push up prices, therefore changing consumer behaviour. But the flip side would be more innovation https://t.co/KXffYvd63b",
  "data/tweet-economist/2021/10/1447351816799199235.json": "New research shows 44 countries that owe the equivalent of at least 10% of their GDP to China https://t.co/Sm3Mqm54RP",
  "data/tweet-economist/2021/10/1447071932847955968.json": "Tensions have escalated between China and Taiwan. “We see that Taiwan could, in fact, become that flashpoint that...starts a wider war.” Retired US General @StanMcChrystal explains why the world needs to decide where it stands, on “The Economist Asks” https://t.co/3hkdsfclPT https://t.co/pnTW32Qch6",
  "data/tweet-economist/2021/10/1447407861772980225.json": "Facebook is nearing a reputational point of no return https://t.co/ApIgzCacNX",
  "data/tweet-economist/2021/10/1447506706100019201.json": "\"Squid game\" has entered mainstream cultural consciousness, spawning millions of videos on TikTok, thousands of memes and dozens of earnest articles dissecting the show’s meaning https://t.co/HYPWUWKRBA",
  "data/tweet-economist/2021/10/1447472048285040644.json": "More than 5m people in Tigray do not have enough to eat. But Western countries still have considerable leverage to force the Ethiopian government's hand https://t.co/CuwM3SRHjL",
  "data/tweet-economist/2021/10/1447451487509131265.json": "Shocked by the Pandora papers? The rich have a long history of stashing their cash. From @1843mag   https://t.co/CwYkoHb0cp",
  "data/tweet-economist/2021/10/1447529647613284353.json": "Period products will be provided free in schools across California starting next year https://t.co/NpRzUouMmk",
  "data/tweet-economist/2021/10/1447511044016979969.json": "Hydrogen can play a vital role in the green energy transition https://t.co/QCNDYpJTN9",
  "data/tweet-economist/2021/10/1447530198728122372.json": "On International Day of the Girl Child, take a look back at this thread, which argues that policymakers who fail to consider the interests of half the population cannot hope to understand the world #BrighterFutureForGirls https://t.co/bC4upGNSw0",
  "data/tweet-economist/2021/10/1447564151618998273.json": "The Taliban have shut down the women’s affairs ministry and girls have already been barred from secondary schools. This will have wide-reaching consequences https://t.co/vhHZhLmIjK",
  "data/tweet-economist/2021/10/1447575589746094088.json": "A fifth of the world’s young women were married before the age of 18. Child brides are more likely to drop out of school, less able to stand up to abusive husbands and less likely to raise healthy, well-educated children #BrighterFutureForGirls https://t.co/YNJpJ4HyCw",
  "data/tweet-economist/2021/10/1447607968707616774.json": "Educating girls makes them richer, healthier and more free. And their children inherit these advantages #BrighterFutureForGirls https://t.co/XBexsXJqGG",
  "data/tweet-economist/2021/10/1447611726111907857.json": "A new study estimates that cases of depression rose by 53m globally as a consequence of the pandemic, 28% above pre-pandemic levels\nhttps://t.co/nOWhmzoQvw",
  "data/tweet-economist/2021/10/1447592395760181250.json": "Researchers have found a strong statistical link between pre-modern attitudes to women and violent political instability #BrighterFutureForGirls https://t.co/ogacSwRCWv",
  "data/tweet-economist/2021/10/1447654773193330692.json": "“It seems as if the surest way to curse one’s nation is to subordinate its women,” say the authors of a study that ranks 176 countries for misogyny #BrighterFutureForGirls https://t.co/pVYbNXwy5B",
  "data/tweet-economist/2021/10/1447607967231225856.json": "His superhero mission is to “kick Keynesians and collectivists in the ass”  https://t.co/PMObDgnEO3",
  "data/tweet-economist/2021/10/1447656007212093451.json": "When girls learn how to read, write and do sums, they lead longer, healthier lives. They are less likely to become child brides or teenage mums and are also less likely to suffer domestic violence https://t.co/OFsvI0IKqe",
  "data/tweet-economist/2021/10/1447625061670793229.json": "Mark Zuckerberg, Facebook’s all-powerful founder, increasingly looks like a liability—even when he is speaking sense https://t.co/lFi3Ov1Lx1",
  "data/tweet-economist/2021/10/1447697019708059649.json": "Researchers have found that sexist customs are highly correlated with violent instability in a country. Various lessons can be drawn from this #BrighterFutureForGirls https://t.co/gk3mXEdZia",
  "data/tweet-economist/2021/10/1447707853502959619.json": "To “make Argentina a great power again”, Javier Milei wants to reduce regulations, lower taxes and eliminate the central bank  https://t.co/u4RcEHZGaG",
  "data/tweet-economist/2021/10/1447743889293590533.json": "Societies that oppress women are far more likely to be violent and unstable. Policymakers who fail to consider the interests of half the population cannot hope to understand the world #BrighterFutureForGirls https://t.co/wggcrKeCRL",
  "data/tweet-economist/2021/10/1447736825875943433.json": "The obstacles girls face begin in the womb. Thanks to sex-selective abortion and neglect, at least 130m females are missing from the world’s population #BrighterFutureForGirls https://t.co/O3bBSi6Fzl",
  "data/tweet-economist/2021/10/1447787093024022530.json": "In Paris fights broke out as fans tried to force their way into a pop-up shop where visitors could pose with staff dressed like the pink-suited enforcers from the show https://t.co/KNSVTe0cij",
  "data/tweet-economist/2021/10/1447674435654373378.json": "Vladimir Putin’s United Russia party won decisively. Had the votes been counted fairly, however, the tally would have been quite different\nhttps://t.co/BxfaFJdvMT",
  "data/tweet-economist/2021/10/1447790933882376198.json": "If member countries can ignore European laws or interpret them as they see fit, as Poland is attempting to do, the European project is moot https://t.co/l1NAwOajNI",
  "data/tweet-economist/2021/10/1447838702789668869.json": "A malaria vaccine is approved by the World Health Organisation https://t.co/N4YGn3X3dK",
  "data/tweet-economist/2021/10/1447848935914184707.json": "Ethiopia is deliberately starving its own citizens https://t.co/WjlNHwUq3d",
  "data/tweet-economist/2021/10/1447896779429715968.json": "As many as 330,000 children were sexually abused by clergy and lay members of the Catholic church in France between 1950 and 2020\nhttps://t.co/QRLQOJXuTE",
  "data/tweet-economist/2021/10/1447901072450899972.json": "Cases of anxiety have increased by 76m as a consequence of the pandemic, a 26% rise above pre-pandemic levels\nhttps://t.co/kFIm1PkiiP",
  "data/tweet-economist/2021/10/1447876407477035014.json": "Ethiopia's Tigray region is getting only a fraction of the food needed to keep its 6m inhabitants alive, hardly any fuel and no medical supplies at all https://t.co/czPaoecDUx",
  "data/tweet-economist/2021/10/1447829900283547653.json": "A Chinese vision of free trade https://t.co/R2VR4dqCo8",
  "data/tweet-economist/2021/10/1447924536452829184.json": "He sold a Chinese bomb design to Libya for tens of millions of dollars and offered it to Iraq, too https://t.co/0ifJxoatT7",
  "data/tweet-economist/2021/10/1447925050229858306.json": "Oil prices continue to surge. Dwindling investment in fossil fuels mean high prices are here to stay https://t.co/RuSsnO6P4D",
  "data/tweet-economist/2021/10/1447937616008130583.json": "There are now more job openings in Britain than unemployed people https://t.co/B3f4N7tucn",
  "data/tweet-economist/2021/10/1447932327691177988.json": "When researchers analysed the results of the Russian election, they found tell-tale signs of manipulation\nhttps://t.co/9xmoaejZYW",
  "data/tweet-economist/2021/10/1447990016060411908.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/Tknax5DHzl",
  "data/tweet-economist/2021/10/1447938385130176528.json": "Towns in Tigray have been pillaged, civilians slaughtered and women gang-raped. In adjacent regions the advance of Tigrayan rebels has brought great suffering to civilians https://t.co/Suhnssflt1",
  "data/tweet-economist/2021/10/1448002040395878406.json": "“Squid Game” has shown that, like love and money, complaints about inequality have no language https://t.co/fncAW2RdFy",
  "data/tweet-economist/2021/10/1448006936033742852.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/97cPBx7GUU",
  "data/tweet-economist/2021/10/1448009586829578245.json": "Ethiopia is deliberately starving its own citizens https://t.co/JpNy7qUD9P",
  "data/tweet-economist/2021/10/1447949259970580490.json": "Scaling up the hydrogen economy is set to see around $100bn-150bn in public spending globally in the decade to 2030.\n\n⬇️ Read why governments have launched major hydrogen initiatives, in a bid to clean up the planet",
  "data/tweet-economist/2021/10/1448038597169397774.json": "It now takes about 70 days for ocean freight to travel from its point of origin in China to its final destination in America, compared with 47 days last August\nhttps://t.co/QYw07f771O",
  "data/tweet-economist/2021/10/1448000526738763776.json": "The West wants the civil war with Tigray to end, but Ethiopia’s government perceives the West as having double standards https://t.co/y14UAUUfjU",
  "data/tweet-economist/2021/10/1448169121254936576.json": "Denmark has installed enough wind turbines that, when it blows, no other source of electric power is required—but it needs a Plan B. An undersea cable could be the solution https://t.co/nh4mqFjmSW",
  "data/tweet-economist/2021/10/1448173603942539268.json": "Ethiopia's Tigray region is getting only a fraction of the food needed to keep its 6m inhabitants alive, hardly any fuel and no medical supplies at all https://t.co/G4EmQuOdGR",
  "data/tweet-economist/2021/10/1448213996939657216.json": "“Squid Game” is currently the most-streamed show on Netflix in most of its markets https://t.co/ENSain5etS",
  "data/tweet-economist/2021/10/1448096573125271558.json": "Stolen artworks vanish into a criminal netherworld. Arthur Brand recovers them https://t.co/fI7DjzNZGE",
  "data/tweet-economist/2021/10/1447993500117708805.json": "The innovations developed by this year’s prizewinners have changed the field of economics for the better\nhttps://t.co/8tnBlnxasM",
  "data/tweet-economist/2021/10/1448236936045514754.json": "The prizewinners illuminated questions once shrouded in darkness, forcing economists to push theory in directions that better describe real-world experience\nhttps://t.co/Nk7gf2aNQP",
  "data/tweet-economist/2021/10/1448304430949019656.json": "Ethiopia is deliberately starving its own citizens https://t.co/IKYeio8MI4",
  "data/tweet-economist/2021/10/1448306831101681664.json": "Of the additional 53m cases of depression and 76m cases of anxiety estimated for 2020, roughly two-thirds were in women\nhttps://t.co/TPmZ604xCl",
  "data/tweet-economist/2021/10/1448369724337934338.json": "Like Tesla, SpaceX has taken an unloved technology and made drastic improvements, shaking up a complacent industry https://t.co/dwg978gUwx",
  "data/tweet-economist/2021/10/1448463324484616196.json": "Iceland’s experience suggests a better balance between work and life need not reduce output https://t.co/S1M9Xavr4W",
  "data/tweet-economist/2021/10/1448322067074535441.json": "Relations between Ethiopia and many Western countries are at their lowest point in decades. They could sink further https://t.co/LqA3QE1Ebt",
  "data/tweet-economist/2021/10/1448534527261949952.json": "“Squid Game” has shown that, like love and money, complaints about inequality have no language https://t.co/wFYWfyGUje",
  "data/tweet-economist/2021/10/1448526113739845634.json": "An NFT is a record on a cryptocurrency’s blockchain (an immutable ledger that can record more than just virtual coins) that represents pieces of digital media https://t.co/GEza3eHFOW",
  "data/tweet-economist/2021/10/1448539138295312386.json": "There are now more job openings in Britain than unemployed people https://t.co/pKXoJb2kB9",
  "data/tweet-economist/2021/10/1448616637784072198.json": "Why are people spending tens of millions of dollars on “non-fungible tokens” (NFTs)? https://t.co/zF93rSGl5X",
  "data/tweet-economist/2021/10/1448641700558159876.json": "The first big energy shock of the green era exposes grave problems with the transition to clean energy. Leaders must move beyond pledges and tackle the redesign of energy markets. Our cover this week https://t.co/GwTYft2Pw1 https://t.co/7MmiqzXLCm",
  "data/tweet-economist/2021/10/1448503958704640001.json": "He played a seminal role in the Manhattan Project that built the atom bomb and devised the architecture for the first programmable computers https://t.co/81KlenocJs",
  "data/tweet-economist/2021/10/1448667770544173056.json": "If the trend of falling sperm counts observed in one study continues, it might render half the men of Europe and North America impotent by 2045.\n\n⬇️ Click to find out what studies say about the effect of chemicals",
  "data/tweet-economist/2021/10/1448671258158280705.json": "Cases of depression increased by 37% in North Africa and the Middle East as a result of the pandemic, more than in any other region\nhttps://t.co/3m8UmWxz7q",
  "data/tweet-economist/2021/10/1448715226715676677.json": "LinkedIn has announced it will be closing down in China. Operating in a dictatorship presents awkward choices for a platform designed for the exchange of ideas. From July https://t.co/KmMxOgVmi5",
  "data/tweet-economist/2021/10/1448719538632237060.json": "This week’s cartoon from KAL: https://t.co/b0xv0NJ7fB https://t.co/8wIxe8iFzQ",
  "data/tweet-economist/2021/10/1448652846480588800.json": "Hong Kong residents are flooding into Britain on special visas, and @JoelBudd1 tells “The Intelligence” why they are unlike any immigrant group that came before https://t.co/kFDLe7eknp https://t.co/8onx180Rf4",
  "data/tweet-economist/2021/10/1448733347547598848.json": "Since May the price of a basket of oil, coal and gas has soared by 95% https://t.co/Srzm6Flac2",
  "data/tweet-economist/2021/10/1448762293043466240.json": "Blackouts have engulfed China and India, and Vladimir Putin has just reminded Europe that its supply of fuel relies on Russian goodwill https://t.co/RISC6Rf1oX",
  "data/tweet-economist/2021/10/1448852970817400847.json": "Even fairly proficient speakers of foreign languages have accents. Why? https://t.co/DmOdL0jFQW",
  "data/tweet-economist/2021/10/1448825264830550017.json": "The current panic is a reminder that modern life needs abundant energy. It has also exposed deeper problems as the world shifts to a cleaner energy system https://t.co/hRObxgSpvj",
  "data/tweet-economist/2021/10/1448914817981599765.json": "Without rapid reforms there will be more energy crises and, perhaps, a popular revolt against climate policies https://t.co/ebcdZGVxKg",
  "data/tweet-economist/2021/10/1448888608941871104.json": "In Britain, childlessness seems likely to return to 1920s levels https://t.co/EJUJgiNMst",
  "data/tweet-economist/2021/10/1449086179840827401.json": "Power cuts in China. Coal shortages in India. Spikes in electricity prices across Europe. Symptoms of dysfunction in global energy markets are everywhere https://t.co/b7JM6vja0h",
  "data/tweet-economist/2021/10/1449191639528968193.json": "In China's new 5,000 room foreign-quarantine facility, people will live in isolation for at least two weeks with their food brought to them by robots https://t.co/Q4xqEzpgIX",
  "data/tweet-economist/2021/10/1448952281840472067.json": "Climate change poses a major threat to marine species. Could an ancient crab hold the evolutionary secrets for survival? https://t.co/GL7MryMx24 Film supported by @Blancpain1735 https://t.co/yRGXrlL4xi",
  "data/tweet-economist/2021/10/1449160186447466502.json": "The phenomenon of stand-up comedy must be edgy to be funny https://t.co/VPa4tN51xr",
  "data/tweet-economist/2021/10/1449200943304744968.json": "A whistleblower says Facebook knows its products damage the mental health of some young users. Will politicians take action? Should they? Our correspondents investigate on our “Checks and Balance” podcast https://t.co/TaFlI9MfxX https://t.co/K8c3zO41Ep",
  "data/tweet-economist/2021/10/1449258565886226433.json": "Shutdowns have become more sophisticated in recent years https://t.co/s9tfOfSva6",
  "data/tweet-economist/2021/10/1449301414203826182.json": "Between 1845 and 1855, the island’s population fell by perhaps a third after a million people died of starvation and disease, and perhaps twice as many were forced to emigrate https://t.co/tZTM3h3wRV",
  "data/tweet-economist/2021/10/1449240896545898498.json": "It hadn’t started with bombs, or even with science. His father had been a teacher, a polite peace-loving man who stopped his sons from shooting songbirds https://t.co/i6ZzOoO4mx",
  "data/tweet-economist/2021/10/1449087730424614917.json": "Meetings absorb more time and drain morale more consistently than any other corporate activity https://t.co/b0zZ6ZJLFf",
  "data/tweet-economist/2021/10/1449322023885414403.json": "The global anti-money-laundering system relies on the private sector to weed out dirty money. The study shows this “risk-based” regime to be broken https://t.co/uZm9fyraIF",
  "data/tweet-economist/2021/10/1449347163784364039.json": "Tens of millions still are left out of India's high-tech bureaucracy—because they are poor, illiterate, lack electricity, do not possess a smartphone or cannot connect to a network https://t.co/zW7LbQqBDI",
  "data/tweet-economist/2021/10/1449307141316227073.json": "Countries leaving the EU is a long-term threat, which needs to be solved if the bloc is to thrive. Just as a financial crisis in one country can spread to another, so can a constitutional crisis https://t.co/m8UirO4e2X",
  "data/tweet-economist/2021/10/1449386921084530688.json": "“He does not seem transphobic, in fact,” writes our Lexington columnist. “If his comedy has a moral theme it is that everyone is flawed and everyone should be accepted” https://t.co/fpctT657Ng",
  "data/tweet-economist/2021/10/1449403533279772672.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/8yAAXC3K8a",
  "data/tweet-economist/2021/10/1449424927757672450.json": "The motivations for such interruptions are usually political https://t.co/NxCNdsAgvX",
  "data/tweet-economist/2021/10/1449273663325417476.json": "Dmitry Muratov says Alexei Navalny is one of the reasons he prints Novaya Gazeta on paper: “People in prisons don’t have access to online. For as long as there are political prisoners in Russia, we will continue to print” https://t.co/ImALT6Gl6l",
  "data/tweet-economist/2021/10/1449103345113829382.json": "Climate change will be felt by everyone. So whose responsibility is it to act? The Economist’s experts give their opinions https://t.co/N3HLzMZ6p5 https://t.co/D1BLFe6W1h",
  "data/tweet-economist/2021/10/1449459658213756934.json": "The Pandora Papers are just the latest to shine a light on offshore finance. Although governments have made some reforms in recent years, what has really changed? https://t.co/GCU0Rub3Lm",
  "data/tweet-economist/2021/10/1449333039956365312.json": "Just 100,000 new Democratic voters would turn Alaska reliably blue https://t.co/UPOA7RjEO7",
  "data/tweet-economist/2021/10/1449447814967214085.json": "India stands on the brink of a nationwide power outage https://t.co/dTQNWQX9fS",
  "data/tweet-economist/2021/10/1449444809844961282.json": "That was long before Christopher Columbus set sail https://t.co/TenEIHkPzC",
  "data/tweet-economist/2021/10/1449474745142022147.json": "President Joe Biden has a chance to help create a more prosperous Latin America with his Build Back Better World partnership. He should take it https://t.co/6S3MPAwcts",
  "data/tweet-economist/2021/10/1449474238881189888.json": "Bankers, once kings of capital, may be dethroned by payment platforms https://t.co/pJTbUx275n",
  "data/tweet-economist/2021/10/1449431982157570053.json": "As recent painful episodes of low wind and depleted hydroelectric reserves across parts of Europe have made clear, renewable energy is not yet a reliable substitute for gas https://t.co/yQoIdzmCTv",
  "data/tweet-economist/2021/10/1449545719933718528.json": "In 2016 the United Nations passed a resolution declaring the internet to be a human right https://t.co/MguSFv1574",
  "data/tweet-economist/2021/10/1449549569990217728.json": "His gender-realist views are far more in step with public opinion than his critics’, argues our Lexington columnist https://t.co/MH8GJ7S8hr",
  "data/tweet-economist/2021/10/1449535629738618880.json": "As world leaders pledge their part in the endeavour to reach net-zero at #COP26, the first big energy scare of the green era is unfolding before their eyes https://t.co/1xMj4loE1E",
  "data/tweet-economist/2021/10/1449558081315221509.json": "Latin American countries could be attractive locations for new plants supplying the United States and each other. Leaders should listen to offers https://t.co/Ybf3omUGZI",
  "data/tweet-economist/2021/10/1449574920736940036.json": "“Arracht” is a tough but beautiful watch which takes viewers right to the dark heart of events that defined the history of the British Isles https://t.co/waplTJ7zHe",
  "data/tweet-economist/2021/10/1449603964861829121.json": "A language’s rhythm can be hard to pin down. They differ in how they space the syllables in each sentence https://t.co/FKhHVvwRs3",
  "data/tweet-economist/2021/10/1449590722361843713.json": "After the dinosaurs died off, snakes’ diversification really got going—and they began to develop such hunting tricks as the venoms for which they are notorious https://t.co/iMdP4Clc9l",
  "data/tweet-economist/2021/10/1449512751576059904.json": "James Bond is a kind of consoling mascot, cherished by devotees from childhood into adult life; messing with him is bound to shake and stir. All the same, resistance to a female or non-white star is premised on a mistake https://t.co/agvQcvQh22",
  "data/tweet-economist/2021/10/1449594283464527872.json": "In her new book “Life as We Made It”, Beth Shapiro explains how bison offer an excellent insight into human influence on other species’ evolution https://t.co/608EfEVHsM",
  "data/tweet-economist/2021/10/1449653510237310976.json": "Despite rumours, analysts reckon that Russia is actually exporting more gas to Europe this year than it did before the pandemic https://t.co/ED1OBeEFdS",
  "data/tweet-economist/2021/10/1449717976970694660.json": "Since May the price of a basket of oil, coal and gas has soared by 95% https://t.co/bxBKELmg3g",
  "data/tweet-economist/2021/10/1449704609535217665.json": "As covid-19 fades in the rich world, the disease risks becoming a poor-country killer https://t.co/OH5EMQ3W8F",
  "data/tweet-economist/2021/10/1449596538452316162.json": "Excessive wage growth could be the next factor to drive up prices. We explain what must happen to avoid enduring inflation https://t.co/PpcZ3yq4FW",
  "data/tweet-economist/2021/10/1449729409338904578.json": "Power cuts in China. Coal shortages in India. Spikes in electricity prices across Europe. \n\nThe first big scare of the green era reveals grave problems with the transition to clean energy.\n\nClick to read why a redesign of global energy markets is needed 👇",
  "data/tweet-economist/2021/10/1449714097709268992.json": "A new variant that combined the traits of Delta and Beta would be a disaster. This is why limiting the spread of covid-19 will remain important https://t.co/9Svo8FeYE2",
  "data/tweet-economist/2021/10/1449729411041873924.json": "How have pandemics of the past affected economies? \n\nAn analysis of data going back to the 14th century shows that they typically lead to lower, not higher, inflation 👇",
  "data/tweet-economist/2021/10/1449730958073155584.json": "Denmark has installed enough wind turbines that, when it blows, no other source of electric power is required—but it needs a Plan B. An undersea cable could be the solution https://t.co/emPQu1ig23",
  "data/tweet-economist/2021/10/1449775474578804738.json": "A third of Earth’s dry land is devoted either to growing domesticated plants for human consumption or to the nutrition of domestic animals. A new book looks at how this came about, and where it is leading https://t.co/IOvV2vaVXv",
  "data/tweet-economist/2021/10/1449805748167483395.json": "Blackouts have engulfed China and India, and Vladimir Putin has just reminded Europe that its supply of fuel relies on Russian goodwill https://t.co/xNzr1qAzdb",
  "data/tweet-economist/2021/10/1449832612554584068.json": "Vladimir Putin wrote an essay in July expanding his argument that Russia and Ukraine are a single nation. Ukrainians take his threats seriously https://t.co/YIUuVVSvRS",
  "data/tweet-economist/2021/10/1449840155314036737.json": "After being given a standing ovation at the Hollywood Bowl, the stand-up comedian said: “If this is what being cancelled is like, I love it” https://t.co/m8IqsQjKXF",
  "data/tweet-economist/2021/10/1449788062217682945.json": "The state is too corrupt to prosecute its criminals, and too dysfunctional to protect its citizens  https://t.co/tvgZQ3qhJT",
  "data/tweet-economist/2021/10/1449837138640506885.json": "Those on the front line of the fight against financial crime do a terrible job of spotting red flags https://t.co/fBfChWINpy",
  "data/tweet-economist/2021/10/1449907720581173259.json": "The current panic is a reminder that modern life needs abundant energy. It has also exposed deeper problems as the world shifts to a cleaner energy system https://t.co/PJPS4ZHgWX",
  "data/tweet-economist/2021/10/1449876025370886149.json": "Resistance to a female or black 007 mistakes the kind of character Bond is https://t.co/dr05d0Asfj",
  "data/tweet-economist/2021/10/1449708604580302848.json": "If one government can avoid abiding by unpopular rulings by the EU’s top court with little fear of sanction, it becomes a tempting option for all https://t.co/WmQMIB1jh7",
  "data/tweet-economist/2021/10/1449979477518344195.json": "The Pandora Papers are just the latest to shine a light on offshore finance. Although governments have made some reforms in recent years, what has really changed? https://t.co/BFQz7l6QTu",
  "data/tweet-economist/2021/10/1449782015256109056.json": "Once Sebastian Kurz loses his aura of political invincibility, his party’s regional chiefs will drop him quicker than a hot “Knödel” https://t.co/Ppu2TO98rk",
  "data/tweet-economist/2021/10/1449899089718616071.json": "Unless President Lasso can persuade people of his plan, Ecuador risks a return to political instability  https://t.co/T0Nzd7ozmL",
  "data/tweet-economist/2021/10/1449585994936819727.json": "What advice can this year’s @NobelPrize winners give a new generation of economists? Laureate David Card of @UCBerkeley joins @R_Shanbhogue on our “Money Talks” podcast https://t.co/JsgkeF1sv1 https://t.co/XaVnx0fJ2W",
  "data/tweet-economist/2021/10/1450097603123814404.json": "A new study estimates that cases of depression rose by 53m globally as a consequence of the pandemic, 28% above pre-pandemic levels https://t.co/JqzlG1Gqi5 https://t.co/Tl7yPLcZaO",
  "data/tweet-economist/2021/10/1450134891430137861.json": "🦑 “Squid Game” is Netflix’s most successful debut ever. \n\nForeign films have historically fared poorly on the silver screen. Click to learn why non-English content is booming on the streaming service 👇",
  "data/tweet-economist/2021/10/1449751080959676422.json": "The higher the price of oil and gas, the more incentives there will be for companies to produce them https://t.co/ASTgavlujy",
  "data/tweet-economist/2021/10/1450093081676681220.json": "Without rapid reforms there will be more energy crises and, perhaps, a popular revolt against climate policies https://t.co/KA3YXibgyk",
  "data/tweet-economist/2021/10/1449998272395939840.json": "The divide between vaccinated and unvaccinated is stark: covid is now a leading cause of death among unvaccinated Britons https://t.co/CAN9an8eca",
  "data/tweet-economist/2021/10/1449812736469315594.json": "Languages differ in what linguists call phonotactics—in effect, what is a permissible syllable and what isn’t https://t.co/SDVhDSJcZX",
  "data/tweet-economist/2021/10/1450237263980507136.json": "Colin Powell, who had suffered from blood cancer and Parkinson’s disease, died from covid-related complications at the age of 84 on October 18th https://t.co/baz9vfyFFd",
  "data/tweet-economist/2021/10/1450245065369128962.json": "“He does not seem transphobic, in fact,” writes our Lexington columnist. “If his comedy has a moral theme it is that everyone is flawed and everyone should be accepted” https://t.co/YxtyciKtqO",
  "data/tweet-economist/2021/10/1450299094610612228.json": "His approach to waging war which ensued became the basis of what would become known as the Powell doctrine  https://t.co/Gyn833Wes7",
  "data/tweet-economist/2021/10/1450315690636976130.json": "Unless covid-19 develops a mutation that renders vaccines less effective, booster doses will help to keep the worst at bay https://t.co/mtR4al55Xe",
  "data/tweet-economist/2021/10/1450346593035689985.json": "Did the Turks really invent baklava? @1843mag has the answer https://t.co/FKIPzC2oak",
  "data/tweet-economist/2021/10/1450342404180086786.json": "China’s latest test appears to involve two different technologies: orbital weapons and glide vehicles https://t.co/aUls58jWHx",
  "data/tweet-economist/2021/10/1450368575760437249.json": "A Russian editor says he won the Nobel because his slain colleagues could not https://t.co/zDHJpJdZFI",
  "data/tweet-economist/2021/10/1450327209726590981.json": "Just 100,000 new Democratic voters would turn Alaska reliably blue https://t.co/nLKuJFx2hP",
  "data/tweet-economist/2021/10/1450364566546886658.json": "Even excluding people themselves, the biomass of domesticated mammals exceeds that of the wild sort by a factor of 14 https://t.co/qd7JnJM6AU",
  "data/tweet-economist/2021/10/1450460060270858250.json": "In a sense, Colin Powell’s career reflected the arc of American military history https://t.co/bbu4WvGAkp",
  "data/tweet-economist/2021/10/1450471569885704198.json": "After being given a standing ovation at the Hollywood Bowl, the stand-up comedian said: “If this is what being cancelled is like, I love it” https://t.co/96Dt8GFHWz",
  "data/tweet-economist/2021/10/1450476637078818818.json": "When girls learn how to read, write and do sums, they lead longer, healthier lives. They are less likely to become child brides or teenage mums and are also less likely to suffer domestic violence https://t.co/QybVTLNBXH",
  "data/tweet-economist/2021/10/1450505444724813833.json": "Although the official tally of deaths caused by covid-19 is now 4.9m, our single best estimate is that it is actually 16.4m https://t.co/gmu39ksH58",
  "data/tweet-economist/2021/10/1450522170065567759.json": "More than 5m people in Tigray do not have enough to eat. But Western countries still have considerable leverage to force the Ethiopian government's hand https://t.co/IPczXEXxeE",
  "data/tweet-economist/2021/10/1450552352109469712.json": "Many South Korean critics found the characters clichéd, the plot unconvincing and the violence gratuitous https://t.co/BgMK6NacyT",
  "data/tweet-economist/2021/10/1450507037838696449.json": "In the past year efforts to control speech online escalated in 30 of the 70 countries Freedom House monitors, and it receded only in 18. \n\nRead how governments are finding new ways to squash free expression online 👇",
  "data/tweet-economist/2021/10/1450552356974874636.json": "70% of the world's population aged 12 and over have received at least one dose of a covid-19 vaccine \nhttps://t.co/OdZ4OJlr3N",
  "data/tweet-economist/2021/10/1450567460453851137.json": "In Argentina, libertarianism is finding fertile ground among young people  https://t.co/VrWJiUzKhw",
  "data/tweet-economist/2021/10/1450630366465830914.json": "He was not only the most senior black military officer in American history, but also the most prominent American soldier, of any race, of the late 20th century. https://t.co/enFKtddZzL",
  "data/tweet-economist/2021/10/1450460704285282321.json": "Cases have been rising fastest over the past seven days in the European Union. Officially, nearly 785k have died, but according to our excess-deaths model, the toll could be as high as 890k https://t.co/aI7HUsxGJc",
  "data/tweet-economist/2021/10/1450231235285078022.json": "Part of the reason that covid is spreading so rampantly in Britain is the government has loosened restrictions faster than in other Western countries, and been slower to vaccinate under-18s https://t.co/zxBz9JUi40",
  "data/tweet-economist/2021/10/1450582588901494792.json": "The world’s official covid-19 death count is 4.9m, but our new machine-learning model estimates that between 10.1m and 19.1m people have died https://t.co/nJjD7lNMCG",
  "data/tweet-economist/2021/10/1450688272531869699.json": "The Nobel prize in physics has recognised work in reliably predicting global warming. The extremes of floods and fires are not going away—and urgent action is needed https://t.co/9XBrPp8AKT",
  "data/tweet-economist/2021/10/1450700573163114498.json": "“It seems as if the surest way to curse one’s nation is to subordinate its women,” say the authors of a study that ranks 176 countries for misogyny https://t.co/hINFE3CmNl",
  "data/tweet-economist/2021/10/1450727549735247872.json": "Loss of forests in west and central Africa were connected to outbreaks of Ebola between 2004 and 2014 https://t.co/ToaNS0mg7u",
  "data/tweet-economist/2021/10/1450712290240630793.json": "Since May the price of a basket of oil, coal and gas has soared by 95% https://t.co/d2US86xRsQ",
  "data/tweet-economist/2021/10/1450559653696376848.json": "Perfectionism may appear to spur us on to adult successes. But it is a fundamentally childish attitude \nhttps://t.co/nGtCX9UDEu",
  "data/tweet-economist/2021/10/1450798661445750794.json": "A growing body of evidence connects deforesting land with outbreaks of emerging diseases https://t.co/WpQROaWa7u",
  "data/tweet-economist/2021/10/1450840258640289805.json": "When Facebook’s apps were knocked offline for six hours, some wondered whether the world would be a better place if this were permanent https://t.co/0RVcG7Gcp4",
  "data/tweet-economist/2021/10/1450791186688614401.json": "His approach to waging war which ensued became the basis of what would become known as the Powell doctrine  https://t.co/dKi8kGZAwz",
  "data/tweet-economist/2021/10/1450835725147049985.json": "Adjusting for population, the daily death rate is now about eight times higher in America than in the rest of the rich world https://t.co/YA4CkjfcOS",
  "data/tweet-economist/2021/10/1450867370730430464.json": "Hydrogen can play a vital role in the green energy transition. Is it the fuel of the future? A thread 👇 https://t.co/885dtsd1Mn",
  "data/tweet-economist/2021/10/1450903980037623808.json": "The Bank of England doesn’t know where £50bn of cash is—and doesn’t seem to care. Why? https://t.co/OUaMuCIbh1",
  "data/tweet-economist/2021/10/1450908074001174531.json": "Covid-19 has prompted big changes in how people work. Many employers are introducing flexible work policies https://t.co/i0ugl3vdmF",
  "data/tweet-economist/2021/10/1450950539928289283.json": "Scientists have dreamed of xenotransplantation, in which organs from animals are put into humans, for decades https://t.co/SQqPnBGHsV",
  "data/tweet-economist/2021/10/1450704474415173633.json": "A study published last year described the edges of tropical forests as “a major launch-pad” for new viruses https://t.co/r8wCELySqt",
  "data/tweet-economist/2021/10/1451113480816414722.json": "For every degree that temperatures rise, maize yields will fall by 7.4%, wheat yields will fall by 6% and rice yields will fall by 3.2%. Those crops supply around two-thirds of all the calories humans consume https://t.co/QKfJVDE6Qy",
  "data/tweet-economist/2021/10/1451121251955531776.json": "Scientists have dreamed of xenotransplantation, in which organs from animals are put into humans, for decades https://t.co/ikNuGbWZVy",
  "data/tweet-economist/2021/10/1451131037266976768.json": "A mathematician in Australia recently discovered that a 3,700-year-old clay tablet known as Si.427 was used for measuring the land   https://t.co/dU47RY1RA6",
  "data/tweet-economist/2021/10/1450990651450044416.json": "In China's new 5,000 room foreign-quarantine facility, people will live in isolation for at least two weeks with their food brought to them by robots https://t.co/vK9idpQycf",
  "data/tweet-economist/2021/10/1451153861079621638.json": "Curiouser and curiouser... \n\n0x92F28d427Ed13526769dd60787C57854020752F3",
  "data/tweet-economist/2021/10/1451111019560980480.json": "In the past year efforts to control speech online escalated in 30 of the 70 countries Freedom House monitors, and it receded only in 18. \n\nRead how governments are finding new ways to squash free expression online 👇",
  "data/tweet-economist/2021/10/1451096531570995200.json": "If China’s planes were to edge closer to airspace over the island itself, it is unclear how Taiwan would respond https://t.co/VnNDySnLfB",
  "data/tweet-economist/2021/10/1451183710036889609.json": "It was once hoped that as Americans started to experience global warming’s devastating effects they would become more accepting of climate science. That is not happening https://t.co/gkSnuAW9BX",
  "data/tweet-economist/2021/10/1451179776316780544.json": "The world is on the brink of a real-time revolution in economics. It promises better and timelier decision-making. But one of our two covers this week explains why it also brings dangers https://t.co/0dbbXvbeDp https://t.co/GR3a6RIOrP",
  "data/tweet-economist/2021/10/1451188644417474569.json": "The same actions that threaten ecosystems endanger human health too. The risk is most acute in tropical, biodiverse regions https://t.co/5YnJQjaDP4",
  "data/tweet-economist/2021/10/1451199000909017113.json": "Nigeria is the crime scene at the heart of Africa. Urgent action is needed to stop the downward spiral towards lawlessness. One of our two covers this week https://t.co/KCY0G0gyLR https://t.co/tq0BAeE0gd",
  "data/tweet-economist/2021/10/1451160796361281536.json": "You have fallen down the rabbit hole—but where’s Alice? Follow this thread to find her... 🐇 https://t.co/zR19thndLq",
  "data/tweet-economist/2021/10/1451210749498597378.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/5nS4FmEmDs",
  "data/tweet-economist/2021/10/1451216776537194497.json": "Alice has ventured into DeFi-land. And so have we. \n\nJoin us as we journey down the rabbit hole for The Economist's first ever non-fungible token (NFT) auction https://t.co/VSEIWm65M4 https://t.co/JMTjI6QLvO",
  "data/tweet-economist/2021/10/1451259506701262850.json": "This week's cartoon from KAL: https://t.co/rP4jxuLKoM https://t.co/ftY3FFqb49",
  "data/tweet-economist/2021/10/1451246169229873152.json": "Life can only begin when we give up perfectionism, explains psychoanalyst Josh Cohen. From @1843mag\nhttps://t.co/OjfeXiMeMT",
  "data/tweet-economist/2021/10/1451286674261020672.json": "For years, attempts to take xenotransplantation forward failed, because of problems stemming from immune rejection of the foreign organ https://t.co/43BA2lWOta",
  "data/tweet-economist/2021/10/1451343551888084994.json": "The president is likely to escape legal consequences for the other claims mentioned in the leaked report. Even so, the inquiry will hurt him  https://t.co/3icUcO6hU4",
  "data/tweet-economist/2021/10/1451402511366111233.json": "Most people in a failed state tend to be poor, while elites tend to be predatory https://t.co/7FydCw2Q38",
  "data/tweet-economist/2021/10/1451018105564577792.json": "We live in an age of infinite scrolling and endless interruptions. So what happens when you unplug your life? Tom Lamont met the man who works in total darkness. From @1843mag https://t.co/yBF4zWqG6J",
  "data/tweet-economist/2021/10/1451327503902068738.json": "Obituary: Colin Powell thought America should tread carefully in the world https://t.co/BfTBinYM7r",
  "data/tweet-economist/2021/10/1451414120859848741.json": "The president’s approval rating has fallen from 33% to 22%, according to one polling firm  https://t.co/4x8iIcwbPb",
  "data/tweet-economist/2021/10/1451253475011088385.json": "The violence in Nigeria threatens not only the country's 200m people, but also the stability of the entire region that surrounds them https://t.co/45iquCJXad",
  "data/tweet-economist/2021/10/1451452018774716426.json": "Pigs have been the focus of most research in xenotransplantation because, among other things, their organs are the right size https://t.co/z6B8rkoWxL",
  "data/tweet-economist/2021/10/1451410271789010996.json": "The longer prices stay high, the more likely it becomes that the transition to clean energy ultimately buries the fossil-fuel industry\nhttps://t.co/ztT4Qemhyk",
  "data/tweet-economist/2021/10/1451509478558507011.json": "More than 5m people in Tigray do not have enough to eat. But Western countries still have considerable leverage to force the Ethiopian government's hand https://t.co/MWCrQ3fYdV",
  "data/tweet-economist/2021/10/1451514589590528007.json": "Why should anyone care about having 25 varieties of wheat when a single one can be optimised? For the same reason that fund managers seek to diversify their assets. In an ever-changing world, diversity is an insurance policy https://t.co/XM2dwhExQn",
  "data/tweet-economist/2021/10/1451512662060306444.json": "Cases of covid-19 in Britain are nearly as high as they were in January. However the fatality rate is a fraction of what it was.\n\n⬇️ Click to read how masks and booster vaccinations should help keep the virus at bay in the rich world",
  "data/tweet-economist/2021/10/1451492804379746304.json": "Across wide swathes of Nigeria, a collapse in security and state authority has allowed criminal gangs to run wild https://t.co/PO5ehkY6Gw",
  "data/tweet-economist/2021/10/1451536339313307654.json": "After being given a standing ovation at the Hollywood Bowl, the stand-up comedian said: “If this is what being cancelled is like, I love it” https://t.co/9AMZEuYuSG",
  "data/tweet-economist/2021/10/1451634221756338176.json": "Although the news will bring hope to many on the waiting lists for an organ transplant, animal organs will not be used routinely for years to come https://t.co/KZ7pAE9dhY",
  "data/tweet-economist/2021/10/1451613851515031589.json": "Among the best lessons Colin Powell learnt in his life was was the importance of a cool, sound head https://t.co/K2aq3YNEK4",
  "data/tweet-economist/2021/10/1451640355418431489.json": "RT @gadyepstein: I wrote this week about China’s efforts to decimate and tokenize Uyghur culture, and the music, poetry and fiction that en…",
  "data/tweet-economist/2021/10/1451582787719417858.json": "The war on banditry in Nigeria is not going well. Kidnappers have made life perilous in much of the country. \n\nRead more about why Nigeria is becoming ungovernable 👇",
  "data/tweet-economist/2021/10/1451719044810297344.json": "Mexico is ageing fast. Its old people, unfortunately, are not in good shape. And its public health-care system is fragmented  https://t.co/cMSZpmzpua",
  "data/tweet-economist/2021/10/1451747213873336331.json": "Biologists wondered if rising tusklessness might be an adaptation to make elephants less attractive to human hunters. It was a plausible theory, but no one had actually tested it. Until now  https://t.co/caLAJ0k4vu",
  "data/tweet-economist/2021/10/1451771840347709441.json": "Fake news has been around forever. The internet just made it profitable again. From the archive @1843mag https://t.co/ycGrmtvT1k",
  "data/tweet-economist/2021/10/1451782965709651972.json": "“I wanted to try to understand how information ripples through society.” @MariaRessa, the joint winner of the #nobelpeaceprize2021, explains why she started the news organisation Rappler, on “The Economist Asks” podcast  https://t.co/6pg7FKBmOx https://t.co/AJCs99CBmv",
  "data/tweet-economist/2021/10/1451780464302297091.json": "America is now the world’s top destination for bitcoin mining, accounting for over one-third of the global hash rate (a measure of the processing power being used by the bitcoin network) https://t.co/90Fg3pIo3u",
  "data/tweet-economist/2021/10/1451765027682324480.json": "Today the only Uyghur culture allowed in China is of a token kind, conforming to a stereotype endorsed by the Communist Party  https://t.co/PsRJVjnNR5",
  "data/tweet-economist/2021/10/1451790534415167489.json": "An orbital weapon can go over the South Pole and reach America from a direction where the country doesn't have ground-­based radar or perfect coverage from satellites that can spot rocket engines https://t.co/YgAfrjYPDi",
  "data/tweet-economist/2021/10/1451722804353765386.json": "Many companies are bowing to the reality that they have to offer higher wages to attract and retain workers https://t.co/X6uqkf05jy",
  "data/tweet-economist/2021/10/1451810420851888129.json": "Scientists have dreamed of xenotransplantation, in which organs from animals are put into humans, for decades https://t.co/wcuBejtQM6",
  "data/tweet-economist/2021/10/1451797555818467335.json": "Muhammadu Buhari, Nigeria's president, turned an oil shock into a recession, sent annual food inflation soaring and has failed to curb corruption https://t.co/uPXgH9ic3H",
  "data/tweet-economist/2021/10/1451706418218811395.json": "The president had hoped to shore up his base with poorer Brazilians, who benefited from emergency aid during the pandemic. But fully 14% of Brazilians are unemployed  https://t.co/xJ2cgAdW6d",
  "data/tweet-economist/2021/10/1451697653562085380.json": "The SWIFT transfer network carried a record $140trn of global transactions over the past year. Impressive—but if its pre-eminence is to last, it must be modernised https://t.co/RB4vBwdk1l",
  "data/tweet-economist/2021/10/1451847881615421447.json": "The world is on the brink of a real-time revolution in economics https://t.co/CfSopqWgCc",
  "data/tweet-economist/2021/10/1451866031845150721.json": "Patriarchy and poverty go hand in hand https://t.co/Mc8FWLkuJE",
  "data/tweet-economist/2021/10/1451699412003086337.json": "Rich countries are supposed to be helping poor ones finance green schemes. So far, they are falling short #COP26 https://t.co/wIkFonl5wY",
  "data/tweet-economist/2021/10/1451881153984671746.json": "Ethiopia's Tigray region is getting only a fraction of the food needed to keep its 6m inhabitants alive, hardly any fuel and no medical supplies at all https://t.co/q3SMcqd1AL",
  "data/tweet-economist/2021/10/1451896718526648322.json": "Pigs have been the focus of most research in xenotransplantation because, among other things, their organs are the right size https://t.co/OwupP8DJWN",
  "data/tweet-economist/2021/10/1451881152118149126.json": "“Nobody around me understands the global hype, and neither do I,” says In-young from Seoul who stopped watching “Squid Game” after a couple of episodes https://t.co/k7HRcsWViv",
  "data/tweet-economist/2021/10/1451855267289866243.json": "They are being called upon increasingly often, whether driving ambulances, delivering petrol or running covid-19 testing facilities https://t.co/SsWeQEW8ok",
  "data/tweet-economist/2021/10/1451925645051764740.json": "His gender-realist views are far more in step with public opinion than his critics’, argues our Lexington columnist https://t.co/19ikqnyyFS",
  "data/tweet-economist/2021/10/1451955341709750281.json": "Salty, stodgy and delicious, pierogi are the ultimate comfort food https://t.co/EhGzGqTSTh From @1843mag",
  "data/tweet-economist/2021/10/1451914569471991826.json": "Tusklessness is caused by a mutation in a gene on the elephantine X chromosome. (As with humans, two X chromosomes make a female, while an X and a Y make a male.) https://t.co/OUmxtlwoTo",
  "data/tweet-economist/2021/10/1451655140256194560.json": "For years, attempts to take xenotransplantation forward failed, because of problems stemming from immune rejection of the foreign organ https://t.co/Uj48xSgCjW",
  "data/tweet-economist/2021/10/1451887890494017541.json": "How effective are vaccine mandates? Data show they can make a small but crucial difference https://t.co/vLFEuIne9t",
  "data/tweet-economist/2021/10/1452026571980693509.json": "For years, attempts to take xenotransplantation forward failed, because of problems stemming from immune rejection of the foreign organ https://t.co/XbLth8nW7G",
  "data/tweet-economist/2021/10/1452038896594915338.json": "In the 24 hours after France announced its vaccine mandate, 1m people signed up for jabs https://t.co/4v4qioa1mV",
  "data/tweet-economist/2021/10/1452063337731268612.json": "For a long time economists considered minimum wages to be harmful. Three decades of research have led to a rethink https://t.co/45az137jxi",
  "data/tweet-economist/2021/10/1452051734113697793.json": "As a military man he was a difficult fit in politics. He approached problems not as an academic, but as an infantry officer, sent out to assess a situation first and see if it could be fixed https://t.co/NdqVvyvnes",
  "data/tweet-economist/2021/10/1452083171634319367.json": "“Squid Game” has shown that, like love and money, complaints about inequality have no language https://t.co/gBlY66bKzi",
  "data/tweet-economist/2021/10/1452077902556696582.json": "Although the news will bring hope to many on the waiting lists for an organ transplant, animal organs will not be used routinely for years to come https://t.co/DD2cRoB5aB",
  "data/tweet-economist/2021/10/1452110357745618951.json": "Modern humans get 75% of their calorie intake from just eight foods: rice, wheat, maize, potatoes, barley, palm oil, soya and sugar https://t.co/4i8OmF4SqP",
  "data/tweet-economist/2021/10/1452111882488274944.json": "In Mexico most think the elderly should be cared for at home, surrounded by their loved ones. But this creates a burden that many middle-aged Mexicans find hard to shoulder  https://t.co/RXpf42s41i",
  "data/tweet-economist/2021/10/1452159401679364101.json": "The biggest barrier to restoring security is not a lack of ideas, nor of resources. It is the complacency of Nigeria’s cosseted political elite https://t.co/YKxVgPkuQA",
  "data/tweet-economist/2021/10/1452186768812433409.json": "Pigs have been the focus of most research in xenotransplantation because, among other things, their organs are the right size https://t.co/YxtvMPO50w",
  "data/tweet-economist/2021/10/1452172871187501058.json": "Uyghurs living in exile in the West have been waging a parallel campaign to keep their culture alive https://t.co/mUEsv4coJb",
  "data/tweet-economist/2021/10/1452141068309368832.json": "With the war over, the evolutionary pressure from poaching has eased. Tusks have gone back to being useful tools https://t.co/3CAYkcNAJ3",
  "data/tweet-economist/2021/10/1451946025443336199.json": "Pedro Castillo’s presidency has been defined by his political inexperience and indecision, the extremism and infighting of his allies and his weak mandate  https://t.co/g48QScnPqB",
  "data/tweet-economist/2021/10/1452223350101708815.json": "The Bank of England doesn’t know where £50bn of cash is—and doesn’t seem to care. Why? https://t.co/OsjsKZz7BV",
  "data/tweet-economist/2021/10/1452205838530187275.json": "Ghana is drafting laws to build a financial ecosystem in Accra. It would host everything from pension funds to private-­equity firms https://t.co/rtG9gV3jeo",
  "data/tweet-economist/2021/10/1452243492433014792.json": "Ethiopia’s prime minister won a Nobel peace prize in 2019. Now he rails against alleged foreign interference and expels UN officials https://t.co/DMGUGwqF7w",
  "data/tweet-economist/2021/10/1452270661439827971.json": "After being given a standing ovation at the Hollywood Bowl, the stand-up comedian said: “If this is what being cancelled is like, I love it” https://t.co/z3JdyXSTzS",
  "data/tweet-economist/2021/10/1451915335129501704.json": "Most countries that are grey are also rich, and can afford good public services for the elderly. For Mexico, rapid ageing presents trickier problems  https://t.co/HuRV1GK0Iq",
  "data/tweet-economist/2021/10/1452278226471079943.json": "His rules for going to war, which other people called the Powell Doctrine, were coloured by his experiences in Vietnam https://t.co/ag4jdwCm1K",
  "data/tweet-economist/2021/10/1452273748757917707.json": "More than 5m people in Tigray do not have enough to eat. But Western countries still have considerable leverage to force the Ethiopian government's hand https://t.co/qQoYPawKQJ",
  "data/tweet-economist/2021/10/1452293071476035598.json": "Paul Gardullo’s time-chopping exhibition, which opened this month at the National Museum of African American History &amp; Culture, could not be more apt https://t.co/Mes5L4BUp8",
  "data/tweet-economist/2021/10/1452303912099274766.json": "China and Russia are building ever more exotic nukes to ensure that their missiles can penetrate any current or future American defences https://t.co/LsfexLEPOa",
  "data/tweet-economist/2021/10/1452190662233890818.json": "“I have no choice but to be optimistic, because I believe technology is burned into our future.” @MariaRessa, joint winner of the #nobelpeaceprize2021, explains why she is hopeful tech platforms will improve their impact on society, on “The Economist Asks” https://t.co/wWmCffGoN2 https://t.co/9VVYhlSwu9",
  "data/tweet-economist/2021/10/1452317734826647558.json": "Salty, stodgy and delicious, pierogi are the ultimate comfort food https://t.co/xFuHjZxnPi From @1843mag",
  "data/tweet-economist/2021/10/1452315227656269830.json": "The end of the grand fantasy: restaurant dining may never be the same again https://t.co/jnsTkhwV4E From @1843mag",
  "data/tweet-economist/2021/10/1452322016179142656.json": "Many brands don’t have a history. So now they’re inventing them https://t.co/dBNSpnbzjX",
  "data/tweet-economist/2021/10/1452321759915560967.json": "South Korea’s president is keen to use his country’s increasingly hip reputation for political purposes\nhttps://t.co/siJhNTti1n",
  "data/tweet-economist/2021/10/1452318996632588295.json": "The Conservative government relies on older voters. The old have bigger carbon footprints than the young. The trouble with Boris Johnson is that he cannot bear to deliver bad news to them https://t.co/q2Ef9QsKHz",
  "data/tweet-economist/2021/10/1452316220938727426.json": "Want to be more productive? Think like an economist https://t.co/w0VvWXeC7Z From @1843mag",
  "data/tweet-economist/2021/10/1452322502672371722.json": "The hippie movement was intent on undermining corporate America. So how did it end up at the heart of it? From the archive https://t.co/PCV1eN0TpN",
  "data/tweet-economist/2021/10/1452201457118322691.json": "Saudi Aramco, the state-controlled oil colossus, says it intends to be the world leader in fossil-derived low-carbon hydrogen in the 2030s https://t.co/AfMMlqAhrl",
  "data/tweet-economist/2021/10/1452299617291444236.json": "Over the past half-decade President Shavkat Mirziyoyev has surprised both the 35m-odd Uzbeks and the world by embracing change\nhttps://t.co/d36Cx0UW0z",
  "data/tweet-economist/2021/10/1452338619746856964.json": "Depressing statistics abound in “San Fransicko”, a new book. There are 50% more injection drug-users in San Francisco than there are students enrolled at its public high schools https://t.co/Fu85UQLomj",
  "data/tweet-economist/2021/10/1452334497869991936.json": "Artificially controlling the climate is controversial. But if climate talks fail, it may be the only solution https://t.co/TqmVKiVzeM https://t.co/R1ngQJwRUr",
  "data/tweet-economist/2021/10/1452334096701591569.json": "The Conservative government relies on older voters. The old have bigger carbon footprints than the young. The trouble with Boris Johnson is that he cannot bear to deliver bad news to them https://t.co/Ev7YlUF0nU",
  "data/tweet-economist/2021/10/1452300360429805581.json": "“We won the battle, but we need to win the war,” said Peter Marki-Zay, a conservative Catholic not affiliated with any party https://t.co/ZIpTLindfM",
  "data/tweet-economist/2021/10/1452339369952567299.json": "It is clear that the global centre of bitcoin mining is shifting https://t.co/5n3wbTb6FP",
  "data/tweet-economist/2021/10/1452315226406260750.json": "Islamic State Khorasan Province’s brutality has become notorious in a country already accustomed to horror\nhttps://t.co/5lwRqHZFLt",
  "data/tweet-economist/2021/10/1452332059771424776.json": "SWIFT connects 11,000 banks in over 200 countries. Yet America and Asia are under-represented on its board https://t.co/DkzaBR5A7I",
  "data/tweet-economist/2021/10/1452357230267969543.json": "Even if the latest accusations do not stick, next year Brazil’s president may be fighting both an election and jailtime  https://t.co/7ib2uyI6NW",
  "data/tweet-economist/2021/10/1452228381890785285.json": "In the past year efforts to control speech online escalated in 30 of the 70 countries Freedom House monitors, and it receded only in 18. \n\nRead how governments are finding new ways to squash free expression online 👇",
  "data/tweet-economist/2021/10/1452365056298061824.json": "Just as researchers start to see a path through the quagmire of xenotransplantation, regulations may yet bog them down https://t.co/L1TNcBNNsM",
  "data/tweet-economist/2021/10/1452361522995474442.json": "The Ordinary is a case study in the art of \"unselling\" https://t.co/HzcFG5uigw From @1843mag",
  "data/tweet-economist/2021/10/1452379393825902596.json": "Baklava pops up everywhere, from Morocco to Iran. But who really invented the Middle Eastern pastry? https://t.co/J4C4p6RiAU",
  "data/tweet-economist/2021/10/1452378626993934356.json": "Fake news has been around forever. The internet just made it profitable again. From the archive @1843mag https://t.co/YVhVaZNAtN",
  "data/tweet-economist/2021/10/1452358243720773643.json": "Soldiers regularly have to deal with the four forces dubbed VUCA (volatility, uncertainty, complexity and ambiguity) https://t.co/34KWCZLnLy",
  "data/tweet-economist/2021/10/1452382650858094597.json": "Tusklessness is seen only in females. By itself, the mutation kills an elephant when it is an embryo. Only if a second, unmutated X chromosome is also present can an embryo survive https://t.co/kvDMCejvqT",
  "data/tweet-economist/2021/10/1452263632021200898.json": "The party has seemed unsure how to handle its rising star. But Spaniards are watching to see whether her style has room to grow https://t.co/utmqGpbv5O",
  "data/tweet-economist/2021/10/1452350946252664832.json": "Instagram has been in the spotlight for its role in perpetuating negative thoughts about body image among teenage girls. A similar culture flourishes on TikTok, too https://t.co/bPBWE4vUXy",
  "data/tweet-economist/2021/10/1452319741373259780.json": "The three parties appear to be getting along swimmingly. Yet a paper on their deliberations so far is vague, or silent, on the trickiest issues https://t.co/rBeJVwi7i9",
  "data/tweet-economist/2021/10/1452465713763979266.json": "His gender-realist views are far more in step with public opinion than his critics’, argues our Lexington columnist https://t.co/phkb8cp7hW",
  "data/tweet-economist/2021/10/1452412688932409356.json": "As he was the first black chairman of the joint chiefs and the first black national security adviser, people assumed that racism was another battle he had fought. He did not see it quite that way https://t.co/FT0AIqBBcb",
  "data/tweet-economist/2021/10/1452379393804886020.json": "This year more people were killed by criminal gangs in the north-west than by jihadists in the north-east. Why has Nigeria become so unstable? One reason is poor governance https://t.co/Dk7wqQow9m",
  "data/tweet-economist/2021/10/1452475561742307333.json": "“Nobody around me understands the global hype, and neither do I,” says one viewer in Seoul who stopped watching “Squid Game” after a couple of episodes https://t.co/NwWS8rtUZN",
  "data/tweet-economist/2021/10/1452339129115623425.json": "Mistinguett was a singer and film star who extracted from a Prussian prince, her one-time lover, the location of the final German offensive in 1918 https://t.co/YxXLvarEQL",
  "data/tweet-economist/2021/10/1452489671968182278.json": "Think you know the potato? The island of Chiloé’s boasts 286 varieties https://t.co/0GVv2bltvK From @1843mag",
  "data/tweet-economist/2021/10/1452502794045378566.json": "If rich countries do not redistribute surplus vaccine this year, between 1m and 2.8m lives could be lost, according to new analysis by Airfinity, a life-sciences data firm https://t.co/k5HjG3ERhA",
  "data/tweet-economist/2021/10/1452534854390845443.json": "That Britain's armed forces are still involved in response to covid-19—nearly two years into the crisis—demonstrates they are no longer a back­-up option https://t.co/Bn8uHV5DDe",
  "data/tweet-economist/2021/10/1452565503852126208.json": "In the Ottoman Empire coffee was banned by several sultans: the authorities realised that when people had had enough coffee they dared to challenge the existing order https://t.co/AB7IhdVnSX From @1843mag",
  "data/tweet-economist/2021/10/1452498568401596416.json": "In the firt nine months of 2021 almost 8,000 people were directly killed in various conflicts. Hundreds of thousands more have perished because of hunger and disease caused by fighting. More than 2m have fled their homes https://t.co/AKK0HvYxf7",
  "data/tweet-economist/2021/10/1452580486228975619.json": "New research reveals an Italian monk may have written about seafarers’ accounts of the Americas between around 1339 and 1345  https://t.co/8YYvC1KVM2",
  "data/tweet-economist/2021/10/1452520235693711360.json": "Ghana, Kenya and Rwanda want to become global leaders in finance. But the odds seem stacked against them  https://t.co/XJNWdzRCHx",
  "data/tweet-economist/2021/10/1452588768712695814.json": "Scientists have dreamed of xenotransplantation, in which organs from animals are put into humans, for decades https://t.co/apZrSX9h7Q",
  "data/tweet-economist/2021/10/1452613651790237701.json": "The Facebook papers are the latest leak to threaten the future of the biggest social network. As we argued earlier this month, Mark Zuckerberg increasingly looks like a liability https://t.co/E1xWYOt3Cl",
  "data/tweet-economist/2021/10/1452606159546949635.json": "Although the official tally of deaths caused by covid-19 is now 4.9m, our single best estimate is that it is actually 16.5m https://t.co/ZqLTvzgNYF",
  "data/tweet-economist/2021/10/1452371603262685191.json": "The violence in Nigeria threatens not only the country's 200m people, but also the stability of the entire region that surrounds them https://t.co/bnglz80eQd",
  "data/tweet-economist/2021/10/1452643874317418509.json": "As leaked documents reveal more about the inner workings of Facebook, our recent article considers what the future holds for the world’s biggest social network https://t.co/4fbXCjbdpe",
  "data/tweet-economist/2021/10/1452685161125003268.json": "#COP26 marks the most important climate talks since the Paris agreement was signed in 2015. What is at stake if global warming rises more than 1.5°C above pre-industrial levels? https://t.co/oi6os7amKC",
  "data/tweet-economist/2021/10/1452730715116916742.json": "Cutting emissions is not enough. Countries also urgently need to invest in adapting to the changing climate. Will they commit to this at #COP26 next week? https://t.co/FWiAfazpJi",
  "data/tweet-economist/2021/10/1452767701248643072.json": "A growing movement wants destruction of the environment to be treated like genocide and crimes against humanity https://t.co/z8arcfdVbv",
  "data/tweet-economist/2021/10/1452766436150202370.json": "Modern humans get 75% of their calorie intake from just eight foods: rice, wheat, maize, potatoes, barley, palm oil, soya and sugar https://t.co/1dK251VqpL",
  "data/tweet-economist/2021/10/1452794671869091842.json": "If you thought men hunted and women gathered, think again https://t.co/IeHr6oi2gg",
  "data/tweet-economist/2021/10/1452790354143498243.json": "“In Hong Kong we work like cows. The UK is like a big holiday”  https://t.co/79LB8NKTeL",
  "data/tweet-economist/2021/10/1452839663534755845.json": "“Squid Game” has shown that, like love and money, complaints about inequality have no language https://t.co/s4dIP23TWZ",
  "data/tweet-economist/2021/10/1452811738030780419.json": "The Bank of England doesn’t know where £50bn of cash is—and doesn’t seem to care. Why? https://t.co/LjdAACyQYj",
  "data/tweet-economist/2021/10/1452749076764798978.json": "If this is the world at 1.1-1.3°C of warming, what would a temperature rise of 2°C or even 3°C look like? https://t.co/TJ5zySsnVr",
  "data/tweet-economist/2021/10/1452883411878785024.json": "Why Europe is a great place for digital nomads https://t.co/7g0Se9sPTs",
  "data/tweet-economist/2021/10/1452869874653532160.json": "“I have no choice but to be optimistic, because I believe technology is burned into our future.” @MariaRessa, joint winner of the #nobelpeaceprize2021, explains why she is hopeful tech platforms will improve their impact on society, on “The Economist Asks” https://t.co/VE46wxiq1V https://t.co/Wv55nWHJoY",
  "data/tweet-economist/2021/10/1452856348627062789.json": "Australia has finally committed to carbon neutrality by 2050. But its prime minister is resistant to more urgent cuts because the country's coal industry is thriving https://t.co/4rSdzDxuOJ",
  "data/tweet-economist/2021/10/1452897279094968320.json": "In the 24 hours after France announced its vaccine mandate, 1m people signed up for jabs https://t.co/pjCgv7Ubqv",
  "data/tweet-economist/2021/10/1452940601729634307.json": "Although the official tally of deaths caused by covid-19 is now 4.9m, our single best estimate is that it is actually 16.5m https://t.co/yuzsSXw7AQ",
  "data/tweet-economist/2021/10/1452993775110922247.json": "The overarching theme of “Eating to Extinction”, a new book by Dan Saladino, is the rapid decline in the diversity of human foods over the past century https://t.co/hEnubb6zxb",
  "data/tweet-economist/2021/10/1452975583743389700.json": "If this is the world at 1.1-1.3°C of warming, what would a temperature rise of 2°C or even 3°C look like? https://t.co/Sw6WaciXg1",
  "data/tweet-economist/2021/10/1453008032884002837.json": "Modern humans get 75% of their calorie intake from just eight foods: rice, wheat, maize, potatoes, barley, palm oil, soya and sugar https://t.co/i6RkygAwFE",
  "data/tweet-economist/2021/10/1453001750785445894.json": "The portrayal of inequality in “Squid Game” was so brutal that a North Korean propaganda outlet used it to illustrate the horrors of life in the South\nhttps://t.co/iI8fLxu4ae",
  "data/tweet-economist/2021/10/1452998285640220677.json": "The inoculations are conducted via royal jelly https://t.co/UJSZdgJrsp",
  "data/tweet-economist/2021/10/1453005760208703489.json": "Tesla is now worth more than the next nine most-valuable listed carmakers combined. Do newcomers to the industry stand a chance? https://t.co/m8lXubpEsI",
  "data/tweet-economist/2021/10/1453051006879735813.json": "The closing price for our cover as a “non-fungible token” was 99.9 ETH ($419k) https://t.co/nvhW3jPiLv",
  "data/tweet-economist/2021/10/1453053322747854856.json": "For years, attempts to take xenotransplantation forward failed, because of problems stemming from immune rejection of the foreign organ https://t.co/rMT6TwxeFM",
  "data/tweet-economist/2021/10/1453081265842831369.json": "Tesla is now worth more than the next nine most-valuable listed carmakers combined. Here’s how it came to leave its rivals in the dust. From the archive https://t.co/gkjQzBoC3m",
  "data/tweet-economist/2021/10/1453102145268592647.json": "If this is the world at 1.1-1.3°C of warming, what would a temperature rise of 2°C or even 3°C look like? https://t.co/CPALPSPav1",
  "data/tweet-economist/2021/10/1453129592928092174.json": "If you thought men hunted and women gathered, think again https://t.co/FlX0TA3jdO",
  "data/tweet-economist/2021/10/1453159982560681999.json": "Women fared worse than men https://t.co/aZCWS7kojs",
  "data/tweet-economist/2021/10/1453250203927126026.json": "They don’t need soil or sunlight https://t.co/EnyjeVulMP",
  "data/tweet-economist/2021/10/1453222617381494795.json": "More insects are likely to be on the menu https://t.co/A0pcmLogDQ",
  "data/tweet-economist/2021/10/1452998449289306114.json": "Climate pledges made by the middle of this year give a 50% chance of keeping warming below 2.1°C but only a 5% chance of it staying under 1.5°C—and that’s if they are actually honoured.\n\nRead why any progress made at #COP26 is unlikely to match the scale of the challenge ⬇️",
  "data/tweet-economist/2021/10/1453300957064871946.json": "Human action took a sledgehammer to the Earth’s carefully balanced carbon cycle. The damage is not irrevocable, but only humans can fix it https://t.co/mSorEZxwAV https://t.co/Kk5aU8qKLU",
  "data/tweet-economist/2021/10/1453268089102118918.json": "The Bank of England doesn’t know where £50bn of cash is—and doesn’t seem to care. Why? https://t.co/mxby6Ngo8X",
  "data/tweet-economist/2021/10/1453327099020914691.json": "Data drawn from more than 100 statistical indicators shows that covid-19 has led to the deaths of far more people than official statistics suggest https://t.co/xydCKWRJIJ",
  "data/tweet-economist/2021/10/1453340023525363716.json": "Why should anyone care about having 25 varieties of wheat when a single one can be optimised? For the same reason that fund managers seek to diversify their assets. In an ever-changing world, diversity is an insurance policy https://t.co/QsjnacH6RV",
  "data/tweet-economist/2021/10/1453364301167738882.json": "New research reveals an Italian monk may have written about seafarers’ accounts of the Americas between around 1339 and 1345  https://t.co/TEB2dolvEb",
  "data/tweet-economist/2021/10/1453304236754755600.json": "#COP26 marks the most important climate talks since the Paris agreement was signed in 2015. What is at stake if global warming rises more than 1.5°C above pre-industrial levels? https://t.co/8DoVDXCtVE",
  "data/tweet-economist/2021/10/1453393824324194309.json": "Modern humans get 75% of their calorie intake from just eight foods: rice, wheat, maize, potatoes, barley, palm oil, soya and sugar https://t.co/wR7asSCfxt",
  "data/tweet-economist/2021/10/1453438370038833153.json": "From the Czech Republic to Hungary to Poland, voters are losing patience with their leaders. So is the EU https://t.co/8vkxe9qcy6",
  "data/tweet-economist/2021/10/1453554589584793601.json": "Those who had been double-jabbed with either Pfizer or Moderna vaccines had an average non-covid-related mortality rate of roughly 0.35 per 100 person-years. For the unvaccinated, the mortality rate was more than three times as high https://t.co/vaHWeZVnP6",
  "data/tweet-economist/2021/10/1453611937842049026.json": "It is clear that the global centre of bitcoin mining is shifting https://t.co/XXu6Z21Cmt",
  "data/tweet-economist/2021/10/1453657859372331011.json": "Cutting emissions is not enough. Countries also urgently need to invest in adapting to the changing climate. Will they commit to this at #COP26 next week? https://t.co/pASCRWdLei",
  "data/tweet-economist/2021/10/1453695429955182593.json": "The #COP26 climate summit will be both disappointing—and crucial. \n\nFor all their flaws, such global gatherings remain the best forum to force change. Our cover this week https://t.co/fAHmmt75FA https://t.co/7LmFbmLjFR",
  "data/tweet-economist/2021/10/1453475988793438218.json": "Ghana, Kenya and Rwanda want to become global leaders in finance. But the odds seem stacked against them  https://t.co/S63ZMLXYot",
  "data/tweet-economist/2021/10/1453130091450490888.json": "Our NFT auction raised 99.9 ether, equivalent to nearly $422,000 https://t.co/86DuZsnac2",
  "data/tweet-economist/2021/10/1453471813871325184.json": "The CDC data show that people vaccinated with the Pfizer or Moderna covid-19 jabs are one-third as likely to die of other causes https://t.co/RAYmf3oZr1",
  "data/tweet-economist/2021/10/1453733056213258251.json": "Although the news will bring hope to many on the waiting lists for an organ transplant, animal organs will not be used routinely for years to come https://t.co/peAEHDgyAc",
  "data/tweet-economist/2021/10/1453716588717387780.json": "Women fared worse than men https://t.co/JmjsE14j5k",
  "data/tweet-economist/2021/10/1453603478190923779.json": "Japanese media seized upon Komuro Kei's ponytail as evidence of his unsuitability for the princess https://t.co/N6GFTWfoYI",
  "data/tweet-economist/2021/10/1453806840249262081.json": "Facebook said it will rebrand itself as “Meta”. Earlier this month we wrote a Leader arguing why a name change won’t fix its problems   https://t.co/JlxF4B8dMF",
  "data/tweet-economist/2021/10/1453815846338449410.json": "This week’s cartoon from KAL: https://t.co/OXOzixDpVG https://t.co/AE7tWB6CLv",
  "data/tweet-economist/2021/10/1453872729187393540.json": "This is not the first time scientists have found that vaccines designed to prevent one disease would seem to protect against other causes of death https://t.co/UiPahzfxC4",
  "data/tweet-economist/2021/10/1453902442748338213.json": "Facebook said it will rebrand itself as “Meta”. Earlier this month we wrote a Leader arguing why a name change won’t fix its problems   https://t.co/gGp5gY5XHk",
  "data/tweet-economist/2021/10/1453921199575244808.json": "China has fallen from 69th place to 107th in terms of equality for women since Xi Jinping took power in 2012, according to the World Economic Forum https://t.co/sZfRydqN6T",
  "data/tweet-economist/2021/10/1453944288069386244.json": "The Economist built a machine-learning model to estimate excess deaths. The true death toll of covid-19 is dramatically different from official death tallies https://t.co/JdpLNLLiPj",
  "data/tweet-economist/2021/10/1453974148766593028.json": "Facebook said it will rebrand itself as “Meta”. Earlier this month we wrote a Leader arguing why a name change won’t fix its problems   https://t.co/7KWwLH37Lu",
  "data/tweet-economist/2021/10/1454053867101036550.json": "“The Potato Eaters” was one of the few group scenes Van Gogh painted, and nearly everyone who saw it in his lifetime hated it. The artist told his sister that it was the best thing he’d ever done https://t.co/H46NiuofxO",
  "data/tweet-economist/2021/10/1453521486862508034.json": "Last year a book of previously unpublished texts by Luiz Gama was released and sold out; his complete works, compiled into ten volumes, are now being published. A biographical film was released in August https://t.co/skVEdIaqFV",
  "data/tweet-economist/2021/10/1454113329249652737.json": "China is trying to erase Uyghur culture, discourage births and cow the entire people into submission https://t.co/b5waGyFG1t",
  "data/tweet-economist/2021/10/1454003439692926978.json": "RT @charlie_mccann: The Burmese military is one of the biggest in SE Asia and renowned for its ruthlessness. Yet the thousands of farmers a…",
  "data/tweet-economist/2021/10/1454153570341765130.json": "Next year Duolingo will offer lessons in Zulu and Xhosa. It could help some of the 2.9m migrants living in South Africa https://t.co/GAXD9caSMd",
  "data/tweet-economist/2021/10/1454153570278850574.json": "The whole poisonous set-up of “Succession” violates a cardinal rule of 21st-century storytelling: that at least some of the characters, and ideally the protagonist, should be likeable https://t.co/xvr34HZx3v",
  "data/tweet-economist/2021/10/1454202402568015877.json": "A growing movement wants destruction of the environment to be treated like genocide and crimes against humanity https://t.co/TxLyHjXeHB",
  "data/tweet-economist/2021/10/1454236767331176456.json": "The harsh treatment of Princess Mako is a magnified version of the sexism that many Japanese women face on a daily basis https://t.co/105IIakVay",
  "data/tweet-economist/2021/10/1454264344020230149.json": "Luiz Gama is the Brazilian Frederick Douglass, says Lígia Fonseca Ferreira, a professor who has spent the last 20 years studying his legacy. Despite this, he is not treated as a giant of Brazilian history https://t.co/Ndb7UTJ2S9",
  "data/tweet-economist/2021/10/1454334004648366083.json": "Separating the corporate entity from the product lets firms convey different messages to different audiences https://t.co/GZaNO5GLNn",
  "data/tweet-economist/2021/10/1454169440669605888.json": "The lira has lost over 20% of its dollar value since the start of the year, more than any other major currency https://t.co/q7DislFmyq",
  "data/tweet-economist/2021/10/1454419334378528770.json": "It used to be one of Latin America’s success stories. Now Chile looks in worse shape than at any point since its return of democracy three decades ago  https://t.co/qkMZyiQic4",
  "data/tweet-economist/2021/10/1454408503423012869.json": "The currency is in free fall; basic necessities are scarce; inflation is rising https://t.co/xudcQ1v8o4",
  "data/tweet-economist/2021/10/1454181774385418245.json": "Afghanistan is on the brink of the world’s worst humanitarian crisis, according to the UN, exceeding even the misery in Syria and Yemen https://t.co/6LNw7IVKEk",
  "data/tweet-economist/2021/10/1454337782994948101.json": "A survey of blood samples published this week shows that more than 90% of Delhi’s residents have antibodies against covid-19 coursing through their veins https://t.co/5CXZWywTNv",
  "data/tweet-economist/2021/10/1454454822648823813.json": "No rebrand can fix underlying issues with a product https://t.co/gT268Am7hC",
  "data/tweet-economist/2021/10/1454448781588586498.json": "A welfare state cannot be built on the principle that some rich person will always pay https://t.co/z4HOQ146I7",
  "data/tweet-economist/2021/10/1454229832846479360.json": "Since Chile eased its covid-related curfew in October, hundreds have gone out on the streets to rail against the government  \n https://t.co/fj346ux7Vp",
  "data/tweet-economist/2021/10/1454275640753020928.json": "“I found people were trying to wake up earlier and earlier to respond to my emails, then I learned that’s a terrible message to send to the company.” The former chief executive of PepsiCo, @IndraNooyi, talks effective leadership, on “The Economist Asks” https://t.co/OxBfZb4HBK https://t.co/2okjuzQlOE",
  "data/tweet-economist/2021/10/1454550690529939458.json": "Many people feel like they are just waiting to be found out. We investigate the modern epidemic of impostor syndrome https://t.co/MMvaC1zVpw",
  "data/tweet-economist/2021/10/1454606038360072195.json": "Meta may have just half the letters in Facebook’s name, but it retains all of the company’s problems https://t.co/bkAtUrFpX1",
  "data/tweet-economist/2021/10/1454537094878089220.json": "With “The Potato Eaters” Van Gogh was reaching for a new authenticity, an appreciation of misshapen beauty that refused to romanticise its subjects https://t.co/s3AcoGWgj2",
  "data/tweet-economist/2021/10/1454523525264510995.json": "Baklava pops up everywhere, from Morocco to Iran. But who really invented the Middle Eastern pastry? https://t.co/ZsOtAa2THV",
  "data/tweet-economist/2021/10/1454458351803375616.json": "The eight-party coalition led by Naftali Bennett has proven more solid than expected and changed the tone of Israeli politics https://t.co/rbGpVrDvRo",
  "data/tweet-economist/2021/10/1454650341119627264.json": "The Taliban seem to have no plan to tackle the disaster other than to blame it on foreigners https://t.co/V7bgQj3bbZ",
  "data/tweet-economist/2021/10/1454625688078671879.json": "Adaptation to climate change isn’t getting the attention or funding it deserves, says @BillGates on our “To a Lesser Degree” podcast https://t.co/B9MBhws9Uq https://t.co/MH2010GOnE",
  "data/tweet-economist/2021/10/1454498603871965185.json": "The fact that its movies show Hindus and Muslims—and Indians of all sorts—getting along is too great a threat to Narendra Modi’s narrow vision of a Hindu nation https://t.co/4uPJv5o7SX",
  "data/tweet-economist/2021/10/1454377049439752192.json": "Europe was a nuclear project before it was much else https://t.co/S2VtAFayfh",
  "data/tweet-economist/2021/10/1454682969751400451.json": "Turkish drones, which were used to devastating effect last year by Azerbaijan, may be on Serbia's shopping list https://t.co/w7jQYtNyHR",
  "data/tweet-economist/2021/10/1454758212440317952.json": "Baklava pops up everywhere, from Morocco to Iran. But who really invented the Middle Eastern pastry? https://t.co/Z0ZAIoV5kN",
  "data/tweet-economist/2021/10/1454750365862223872.json": "Human action took a sledgehammer to the Earth’s carefully balanced carbon cycle. The damage is not irrevocable, but as #COP26 begins, watch our film to learn why only humans can fix it https://t.co/mKmn3zBR8V https://t.co/v3ln7zqNFn",
  "data/tweet-economist/2021/10/1454789277552889856.json": "“The Potato Eaters” is marred by errors. Van Gogh acknowledged some were bloopers. Still, he thought his critics missed the point https://t.co/VyoeRmIkZd",
  "data/tweet-economist/2021/10/1454609945224257543.json": "Once again India may be stumbling into the lead—as the rest of the world adjusts itself to endemic covid-19 https://t.co/MsZB14Xf7a",
  "data/tweet-economist/2021/10/1454726450733539329.json": "If coup leaders are tolerated, there will be more such seizures of power. Governments must draw red lines and stick to them https://t.co/TBts2UyaYq",
  "data/tweet-economist/2021/10/1454827266916196353.json": "The events of recent weeks and years suggest that Chile actually resembles one of its dysfunctional neighbours   \n https://t.co/8cDTJgfcCp",
  "data/tweet-economist/2021/10/1454585751404961795.json": "Cuba’s central bank announced that it would recognise and regulate the use of crypto. But details of the new rules remain cryptic \n  https://t.co/clzy6tG530",
  "data/tweet-economist/2021/10/1454871235012222986.json": "Climate change is now recognised as the defining threat facing the planet. As #COP26 kicks off, our film asks: why has so little been done to tackle it? https://t.co/NZZ9eAi78R https://t.co/tx7trfEQrA",
  "data/tweet-economist/2021/10/1454765090461286401.json": "In your day-to-day life, 3°C may not seem like a significant rise in temperature. But it would be catastrophic on a global scale.\n\n@Eaterofsun explains why in our new film. \n\nClick to watch it ⬇️",
  "data/tweet-economist/2021/10/1454888673086955520.json": "Wages, nutrition and schooling levels along a pre-Columbian road are all unusually high https://t.co/gEjb6mFXHC",
  "data/tweet-economist/2021/10/1454952333801054212.json": "The effects of climate change are being exacerbated by a century of bad policy https://t.co/RcJUE4KEuf",
  "data/tweet-economist/2021/10/1454686911403073538.json": "A survey of 88,000 people migrating in west Africa found that 90% planned to stay in Africa. Less than 1% said conflict was their main reason for moving https://t.co/VRParha3Z4",
  "data/tweet-economist/2021/10/1454660166633336839.json": "Many people believe there will be demand for pharmaceutical and biotechnological work in microgravity https://t.co/2xGmFd12rs",
  "data/tweet-economist/2021/10/1454882626200907777.json": "Before the Rosetta Stone was deciphered, scholars believed that the ancient Egyptians wrote in a mystical language of pure ideas, not in anything as boring as an alphabet https://t.co/xY7ISdiBEo",
  "data/tweet-economist/2021/10/1454810418866753536.json": "If governments were to eliminate both explicit and implicit fossil-fuel subsidies by 2025, then global emissions of carbon dioxide would fall by 36% (compared with a scenario with no reform) https://t.co/oOb7heCPZ8",
  "data/tweet-economist/2021/10/1454951587370225664.json": "If ensuring that Indians can imagine themselves only on the BJP’s terms means destroying one of country’s great cultural and commercial successes, that is a price the party and Narendra Modi seem willing to pay https://t.co/YsR8sPTdRY",
  "data/tweet-economist/2021/10/1454917617366487040.json": "How many children should you have? https://t.co/Dz9y5syFj9"
}