{
  "data/tweet-nytimes/2021/11/1455008618089222144.json": "The phrase \"Let’s go Brandon,\" understood to be an insult to President Biden, was uttered over the intercom by a Southwest Airlines pilot. His remarks went viral and the airline issued an apology, saying it was conducting an investigation. https://t.co/KeFlqtqTqo",
  "data/tweet-nytimes/2021/11/1455104837402742798.json": "Greta Thunberg was mobbed when she arrived in Glasgow on Saturday for the #COP26 UN climate conference. “Thank you for the very warm welcome,” the 18-year-old activist wrote on Twitter.\nhttps://t.co/t6Q6mc2hVH https://t.co/0BWnGMBm5P",
  "data/tweet-nytimes/2021/11/1454991616041750533.json": "President Biden capped his G20 summit trip to Rome with a swaggering proclamation of the U.S.’s renewed force on the world stage. He shook off questions about his slumping poll numbers at home and projected new optimism for his domestic policy agenda. https://t.co/mtlIPV4A5g",
  "data/tweet-nytimes/2021/11/1455145119024357379.json": "Police officers in the U.S., trained to presume danger, have reacted with outsize aggression. For hundreds of unarmed drivers, the consequences have been fatal, a New York Times investigation found. https://t.co/e97Dvh8nXQ",
  "data/tweet-nytimes/2021/11/1455191678445309966.json": "The International Handball Federation has updated its rules so that women will no longer be required to play in bikini bottoms, responding to months of pressure from female players and coaches who described the uniform requirements as sexist. https://t.co/IddXE7YyKP",
  "data/tweet-nytimes/2021/11/1455181595896434691.json": "\"If working apart we are force powerful enough to destabilize our planet, surely working together we are powerful enough to save it,\" David Attenborough told world leaders on Monday as the COP26 climate summit got underway. https://t.co/gO9pJOKVCo",
  "data/tweet-nytimes/2021/11/1455179598640164870.json": "Breaking News: At least 5 million people worldwide have died from Covid, according to official counts, though the total number is undoubtedly far higher.\nhttps://t.co/JvYGBfxB0h https://t.co/UDQvSx74h4",
  "data/tweet-nytimes/2021/11/1454976518367678472.json": "Authorities at an airport last year seized a bag of cash that Kermit Warren was carrying to buy a truck. It was his life’s savings but prosecutors contended the money was linked to drugs. https://t.co/aCXTzDTcdv",
  "data/tweet-nytimes/2021/11/1455238288856469507.json": "Breaking News: Dr. Aaron T. Beck, the developer of cognitive therapy, has died at 100. His insights transformed the treatment of depression and anxiety. https://t.co/IAZ0qsAmUj",
  "data/tweet-nytimes/2021/11/1455223140380987392.json": "David Attenborough on Monday implored leaders to use the COP26 summit as a climate turning point, creating a more equitable world in the process. https://t.co/kTSivvV5p6 https://t.co/Q9CfBItIs6",
  "data/tweet-nytimes/2021/11/1455274734799802374.json": "Txai Suruí, a 24-year-old Indigenous activist from Brazil, told heads of state at COP26 that their timetables for reducing carbon emissions and scaling back the use of fossil fuels were not adequate.\n\n\"It’s not 2030 or 2050,\" she said. \"It’s now.\" https://t.co/orCOzgSaJ8 https://t.co/SjFAVmeNaJ",
  "data/tweet-nytimes/2021/11/1455301171934121985.json": "Greta Thunberg, the environmental activist, joined protesters outside the United Nations climate conference in Glasgow and accused political leaders of inaction in the fight against the climate crisis. https://t.co/VRYbuTNehl https://t.co/23ZqHuduLx",
  "data/tweet-nytimes/2021/11/1455074644411699200.json": "And the award for New Zealand's Bird of the Year goes to...\n\n🦇 A bat. 🦇\nhttps://t.co/mNed4gIliy",
  "data/tweet-nytimes/2021/11/1455289821669302277.json": "\"We are digging our own graves.\" António Guterres, the UN secretary general, called on world leaders at a global climate conference on Monday to escalate their climate action.  https://t.co/iTGYA9QPPw https://t.co/y4RaYYluDo",
  "data/tweet-nytimes/2021/11/1455142603347857413.json": "The phrase \"Let’s go Brandon,\" understood to be an insult to President Biden, was uttered over the intercom by a Southwest Airlines pilot. His remarks went viral and the airline issued an apology, saying it was conducting an investigation. https://t.co/hVVmbZDiQG",
  "data/tweet-nytimes/2021/11/1455281012569788427.json": "President Biden told a global climate summit on Monday that \"we only have a brief window\" to reduce emissions from oil, gas and coal. Days earlier, he was urging the world’s largest oil producers to pump more fossil fuels. https://t.co/NkcHa76wSN",
  "data/tweet-nytimes/2021/11/1455356508703797255.json": "About 9,000 municipal employees across all New York City agencies have been placed on unpaid leave as the city's vaccine mandate went into effect on Monday. The workers would be eligible to return to work as soon as they get a first dose. https://t.co/Y960LL42dE",
  "data/tweet-nytimes/2021/11/1455401982471151616.json": "Breaking News: President Biden will announce plans to limit methane at #COP26, indicating to world leaders that the U.S. is serious about fighting climate change. https://t.co/JqaCdcNJDp",
  "data/tweet-nytimes/2021/11/1455331337448132610.json": "Between 2014 and 2020, Frank Herfort visited more than 770 metro stations in 19 cities in Russia and the former Soviet republics, creating a remarkable archive of architectural and artistic splendor. https://t.co/4h7xLFljM5 https://t.co/Bo5BmsodCF",
  "data/tweet-nytimes/2021/11/1455384223892885507.json": "Leaders of more than 100 countries, including Brazil, China and the U.S., vowed at #COP26 to end deforestation by 2030. The move seeks to preserve critical forests that can absorb carbon dioxide and slow the rise in global warming. https://t.co/1bcEIOxLvG",
  "data/tweet-nytimes/2021/11/1455527897914032139.json": "Txai Suruí, a 24-year-old Indigenous activist from Brazil, told heads of state at COP26 that their timetables for reducing carbon emissions and scaling back the use of fossil fuels were not adequate.\n\n\"It’s not 2030 or 2050,\" she said. \"It’s now.\"\nhttps://t.co/qR965DwU9K",
  "data/tweet-nytimes/2021/11/1455463481461944320.json": "Millions of dollars vanished in a matter of minutes when the value of Squid, a cryptocurrency inspired by “Squid Game,” crashed.\n\nThe developers behind the coin remain unknown, and the industry is asking questions.\nhttps://t.co/6u7eQ5mjEm",
  "data/tweet-nytimes/2021/11/1455525114615828482.json": "Jeff Bezos, one of the planet’s richest people, pledged $2 billion to restoring natural habitats and transforming food systems.\n\nThe commitment, made at the #COP26 summit, comes as some climate experts question how Amazon measures its own emissions.\nhttps://t.co/3D9YsVBiPD",
  "data/tweet-nytimes/2021/11/1455268413518098443.json": "In Opinion\n\n“The only trouble with being born in 1961 is that in 2021 you will turn 60,” Margaret Renkl writes. “It’s very strange to persist in feeling 22, even as every mirror — and every storefront window and polished elevator door — reveals the truth.”\nhttps://t.co/73d1PpGN8H",
  "data/tweet-nytimes/2021/11/1455501218986528770.json": "Take a look at the splendor of Soviet-era metros.\n\n“The beauty and grandeur of the stations propelled me ever onward — to visit the next, and the next, and the next,” writes Frank Herfort, who has visited more than 770 stations in 19 cities.\nhttps://t.co/EiK1FAX0h5 https://t.co/pvd9YRguCi",
  "data/tweet-nytimes/2021/11/1455228152947564555.json": "Breaking News: After almost three hours of arguments, the Supreme Court seemed inclined to allow abortion providers to pursue a challenge to the Texas abortion law. https://t.co/vdjV8KWDC4",
  "data/tweet-nytimes/2021/11/1455576722221551628.json": "In Opinion\n\n\"Elon Musk doesn’t think visionaries like him should pay taxes the way little people do,\" @PaulKrugman writes. \"After all, why hand over his money to dull bureaucrats? They’ll just squander it on pedestrian schemes like … bailing out Tesla.\" https://t.co/wn7O24r0WG",
  "data/tweet-nytimes/2021/11/1455540227729154062.json": "Ecuador pledged to expand the marine reserve around the Galápagos Islands.\n\n“This will not only strengthen the area’s biodiversity, but it will also bolster our combat against climate change,” President Guillermo Lasso said at the #COP26 climate talks.\nhttps://t.co/ukUmQe3QiK",
  "data/tweet-nytimes/2021/11/1455580880509050881.json": "Breaking News: Facebook plans to delete face scan data from over 1 billion users, shutting down a facial recognition system that became a privacy headache. https://t.co/AHong4rDc1",
  "data/tweet-nytimes/2021/11/1455572936266588167.json": "A new study of hundreds of deer infected with the coronavirus in Iowa has found that the animals probably are contracting the virus from humans, and then rapidly spreading it among one another. \"We were dumbfounded,\" one of the researchers said. https://t.co/bnG6aRZh7r",
  "data/tweet-nytimes/2021/11/1455591829198577668.json": "Curtis Sliwa, the Republican nominee for New York City mayor, brought one of his 17 cats, Gizmo, with him to vote. But Gizmo was denied entry to the polling site. Sliwa ended up quarreling with election officials on several issues, shouting: \"Arrest me!\" https://t.co/w9VQVrwk8Q",
  "data/tweet-nytimes/2021/11/1455598090455552007.json": "Israel's energy minister, Karine Elharrar, was unable to attend Monday's COP26 events because she couldn't access the venue in a wheelchair. She waited two hours and was later offered a shuttle to the site, she said, but the shuttle was also not accessible.https://t.co/ywj1fJ1WVX",
  "data/tweet-nytimes/2021/11/1455642725236318214.json": "Breaking News: A CDC panel recommended Pfizer’s Covid vaccine for children 5 to 11. Shots for that age group could begin as early as this week. https://t.co/MOsCNkaQsZ https://t.co/6NiQTAgvdy",
  "data/tweet-nytimes/2021/11/1455649688015810561.json": "Curtis Sliwa, the Republican nominee for New York City mayor, brought one of his 17 cats, Gizmo, with him to vote. But Gizmo was denied entry to the polling site. Sliwa ended up quarreling with election officials on several issues, shouting: \"Arrest me!\" https://t.co/g0Ee7Kg7p1 https://t.co/ec6nvLj4n1",
  "data/tweet-nytimes/2021/11/1455692466414399492.json": "Shontel Brown, a Democrat, won a House seat in a special election in Cleveland on Tuesday, defeating her Republican opponent, Laverne Gore.\nhttps://t.co/u5e6i2abAg",
  "data/tweet-nytimes/2021/11/1455705069895274496.json": "Breaking News: Eric Adams was elected as the second Black mayor in New York City's history, with hopes of guiding its recovery from the pandemic. https://t.co/ZQyUaNdlFZ https://t.co/XT5QYRyDYG",
  "data/tweet-nytimes/2021/11/1455713098187292678.json": "Eric Adams, a Democrat and former police captain, has been elected the 110th mayor of New York. He'll be the second Black mayor in the city’s history. https://t.co/jOkd00YbJm https://t.co/y0wNXGeHU2",
  "data/tweet-nytimes/2021/11/1455661256694763520.json": "Breaking News: Ethiopia declared a state of emergency, calling on citizens to pick up arms, as Tigrayan forces captured two towns and advanced toward the capital. https://t.co/ELFyielvbU",
  "data/tweet-nytimes/2021/11/1455725684878417926.json": "Shahana Hanif, a former City Council employee, won her election in a Brooklyn district. A Bangladeshi American, she is the first Muslim woman elected to the Council in its history, despite the fact that the city is home to an estimated 769,000 Muslims. https://t.co/gIfIOPwTBs https://t.co/fCO9lhqwqS",
  "data/tweet-nytimes/2021/11/1455732488697958402.json": "Breaking News: Michelle Wu will be Boston's next mayor, breaking barriers as the first woman and the first person of color elected to the role. https://t.co/r6wVbFHdAC https://t.co/AdUjoMoSos",
  "data/tweet-nytimes/2021/11/1455741202272329733.json": "Breaking News: Atlanta shut out Houston in Game 6 to win its first World Series in 26 years and the fourth title in franchise history. https://t.co/RG7rDw20dy",
  "data/tweet-nytimes/2021/11/1455681150714789890.json": "Jeff Bezos pledged $2 billion to restoring natural habitats and transforming food systems at the climate summit in Glasgow on Tuesday. He also said Amazon aims to power its operations with renewable energies by 2025. https://t.co/vK1hjrGWbj https://t.co/zbEGtuWn4a",
  "data/tweet-nytimes/2021/11/1455595612586528773.json": "The prosecution in Kyle Rittenhouse's trial has repeatedly returned to the fact he was \"the only person who killed anyone\" during several days of unrest in Kenosha, asking the jury to \"keep that in mind\" when considering the reasonableness of his actions. https://t.co/ICb1zyCvxo",
  "data/tweet-nytimes/2021/11/1455710099746562052.json": "Alvin Bragg was elected Manhattan district attorney on Tuesday. The influential office handles tens of thousands of cases a year and is conducting a high-profile investigation into Donald Trump and his family business. https://t.co/01r7gsE7ut https://t.co/YgqrjMbwRj",
  "data/tweet-nytimes/2021/11/1455698767252967424.json": "Eric Adams, the Democratic nominee for mayor, carried a photograph of his mother, who died this year, as he cast his vote at Public School 81 in the Bedford-Stuyvesant neighborhood of Brooklyn. https://t.co/pnfrmG0kYi https://t.co/kGfAePVAcw",
  "data/tweet-nytimes/2021/11/1455852294495514624.json": "Michelle Wu has been elected as Boston's next mayor. She will be the first woman and the first person of color in the role. https://t.co/KDHDsrZGOS",
  "data/tweet-nytimes/2021/11/1455806988596699139.json": "Peng Shuai, the tennis star, publicly accused a former vice premier of China, Zhang Gaoli, of sexual assault. The allegation takes the country’s #MeToo movement to the top echelons of the Communist Party for the first time. https://t.co/Z2EwtHD8DE",
  "data/tweet-nytimes/2021/11/1455869898899566596.json": "Kristy Swanson, an actress who is a vocal vaccine skeptic and critic of Dr. Anthony Fauci, was hospitalized with virus-related pneumonia in New Jersey, she said. https://t.co/MLDyo9cH9v",
  "data/tweet-nytimes/2021/11/1455873667175493639.json": "Eric Adams, a Democrat and former police captain, on Tuesday was elected the 110th mayor of New York. He'll be the second Black mayor in the city’s history. https://t.co/PJdFpKmWWR https://t.co/KIfu2hHeKN",
  "data/tweet-nytimes/2021/11/1455908900616671250.json": "Michelle Wu, who entered public service out of frustration with the obstacles that her immigrant family faced, will be the next mayor of Boston. The city has been led by an unbroken string of Irish American or Italian American men since the 1930s. https://t.co/MVL3bE0F0C https://t.co/thku9JE8Wp",
  "data/tweet-nytimes/2021/11/1455833401689317379.json": "Three of the 10 top shows on Netflix right now are South Korean. Then there's BTS, the pop phenomenon, and groundbreaking films like \"Parasite.\" A global audience is mesmerized by Korean entertainment, and creators say success didn’t happen overnight. https://t.co/29d47pJ9dR",
  "data/tweet-nytimes/2021/11/1455892570597384199.json": "Colorado is so overwhelmed with coronavirus cases that hospitals are now allowed to turn away new patients. https://t.co/sA9vz3gHH9",
  "data/tweet-nytimes/2021/11/1455927796291850248.json": "Shahana Hanif, a former City Council employee, won her election in a Brooklyn district. A Bangladeshi American, she is the first Muslim woman elected to the Council in its history, despite the fact that the city is home to an estimated 769,000 Muslims. https://t.co/EDsJdOKFLS https://t.co/PobHgFKvpe",
  "data/tweet-nytimes/2021/11/1455996995743756295.json": "Vito Perillo, a 97-year-old World War II veteran in New Jersey, won a second term as mayor of the borough of Tinton Falls. He is believed to be the oldest mayor in the U.S. — when he leaves office, he will be 101. https://t.co/JJpRmydhXh https://t.co/kwfpEXNcJ4",
  "data/tweet-nytimes/2021/11/1456029706189426690.json": "Phil Murphy was re-elected governor of New Jersey by a slimmer than expected margin, becoming the first Democrat in more than four decades to win a second term in the state. https://t.co/HSiKS7BlBQ https://t.co/o5RT4rGWHl",
  "data/tweet-nytimes/2021/11/1456027015656742924.json": "Breaking News: Phil Murphy, a Democrat, was re-elected in a surprisingly close race, with voters divided over his coronavirus policies. https://t.co/OaqWO6BCkC",
  "data/tweet-nytimes/2021/11/1456043523464220677.json": "Almost 97% of active-duty members of the U.S. Air Force have received at least one dose of a coronavirus vaccine, officials said Wednesday. It is the first branch of the U.S. military to reach its deadline for vaccinations. https://t.co/G3llc8g2YL",
  "data/tweet-nytimes/2021/11/1456119032361406464.json": "Sunao Tsuboi, a survivor of the atomic bombing in Hiroshima who went on to devote himself to the cause of nuclear disarmament, died on Oct. 24. He was 96. https://t.co/zo5p99tawM",
  "data/tweet-nytimes/2021/11/1455939114109448198.json": "In Opinion\n\n\"A Taiwanese American woman from Chicago is about to become the mayor of Boston, a town that, until Tuesday, had elected only white men to that office,\" Eileen McNamara writes about Michelle Wu.\nhttps://t.co/gxapgOhFtr",
  "data/tweet-nytimes/2021/11/1456229859848564743.json": "Benedict Cumberbatch spent several weeks on Montana ranches to prepare for his role as an alpha-male cowboy in Jane Campion’s new movie, “The Power of the Dog.” He’s earning rave reviews for his portrayal of a vicious, controlling bully.\nhttps://t.co/VbGJOHkoTf https://t.co/sCEwF8TE3F",
  "data/tweet-nytimes/2021/11/1456114056063066114.json": "A jury was selected in the trial of the three white men accused of chasing down and killing Ahmaud Arbery. It includes 11 white people and one Black person. https://t.co/y876znEWUf",
  "data/tweet-nytimes/2021/11/1456258596392472579.json": "Breaking News: The main researcher of the so-called Steele dossier was arrested as part of the Trump-era special counsel inquiry led by John Durham.\nhttps://t.co/jtVExbnyyT",
  "data/tweet-nytimes/2021/11/1456229241129996288.json": "Breaking News: Britain approved Merck’s antiviral drug molnupiravir, making it the first pill to be endorsed for treating Covid patients. https://t.co/Q5P9h45QBB",
  "data/tweet-nytimes/2021/11/1456242261704982533.json": "Breaking News: The Biden administration set a Jan. 4 deadline for large companies to ensure workers are fully vaccinated or get tested weekly under a sweeping new Covid measure that will cover 84 million private sector workers.\nhttps://t.co/wc18M1O5Xo",
  "data/tweet-nytimes/2021/11/1456330494895919112.json": "Greta Thunberg on Thursday said the UN climate conference in Scotland is “sort of turning into a greenwash campaign, a PR campaign” for business leaders and politicians. https://t.co/AXQYjE6210",
  "data/tweet-nytimes/2021/11/1456378807124889605.json": "Breaking News: The Justice Department sued Texas over its new voting law, arguing that the Republican-led measure would disenfranchise vulnerable groups. https://t.co/F8JgVpE4H4 https://t.co/xWpDWCNhmz",
  "data/tweet-nytimes/2021/11/1456421027773390850.json": "This firm, highly spiced version of mac and cheese uses Scotch bonnet pepper and is a perfect dish for your Thanksgiving table. \nhttps://t.co/NFuOlreAEp https://t.co/xQqpQwAHnQ",
  "data/tweet-nytimes/2021/11/1456451231363354624.json": "She was a young moose, not even 2 years old, still getting used to her surroundings, when she took a wrong turn on Thursday and crashed through the window of an elementary school classroom in Saskatoon, in Canada’s central prairie. https://t.co/V7hpU4kjKI",
  "data/tweet-nytimes/2021/11/1456574410618556417.json": "Breaking News: Pfizer said its pill to treat Covid-19 had been found to be highly effective at preventing severe illness among at-risk people. It appears to be more effective than a similar offering from Merck, which is awaiting U.S. authorization. https://t.co/v89RrXaAKq",
  "data/tweet-nytimes/2021/11/1456582090766622728.json": "She was a young moose, not even 2 years old, still getting used to her surroundings, when she took a wrong turn on Thursday and crashed through the window of an elementary school classroom in Saskatoon, in Canada’s central prairie. https://t.co/PcnC3w1U3y",
  "data/tweet-nytimes/2021/11/1456607274550636558.json": "Kristen Stewart gave her all to playing Princess Diana in the new movie “Spencer,” studying Diana’s posture, mannerisms and accent. Her potent and provocative performance is already drawing Oscar talk.\n\nRead our interview with the actress. https://t.co/9IoUrixEpK https://t.co/QcCbXX3j9x",
  "data/tweet-nytimes/2021/11/1456683357862047746.json": "The funeral for Colin Powell on Friday brought out a Washington that barely exists anymore: Republicans and Democrats, including President Biden and two of his predecessors, uniformed military and diplomats. https://t.co/vKV9QCyp2T",
  "data/tweet-nytimes/2021/11/1456628679069536259.json": "The body of a 98-year-old man was dissected in front of a paying audience at an Oregon hotel in October. Organizers said the event was meant to be educational, but the man's widow said she thought she had donated the body for research.\n https://t.co/HnrIdbzxP8",
  "data/tweet-nytimes/2021/11/1456717991958167555.json": "Watch Greta Thunberg's speech at a protest outside the UN climate summit in Glasgow, where she decried #COP26 as a \"PR event.\" https://t.co/3hplQTVPtK https://t.co/WQBLy9XRus",
  "data/tweet-nytimes/2021/11/1456773334390218758.json": "Marília Mendonça, one of the most popular Brazilian pop singers who was iconic in a type of country music called sertanejo, was killed on Friday in a small plane crash. She was 26. https://t.co/z8WI1jNZEl",
  "data/tweet-nytimes/2021/11/1456702881101406212.json": "“I just saw a rat when we were walking down to the park, and it was still daylight,” one New Yorker said. “And I was like, damn, that’s audacious.” https://t.co/mYqhxoSPSZ https://t.co/8X8wz8PGC6",
  "data/tweet-nytimes/2021/11/1456577095761604608.json": "Parents of students New York City can get $100 if their children are vaccinated against Covid, Mayor Bill de Blasio announced. The money will come in the form of a prepaid debit card. https://t.co/KNxudbyuxg",
  "data/tweet-nytimes/2021/11/1456825139610456065.json": "Breaking News: The House passed a $1 trillion infrastructure bill in a win for President Biden, but delayed a social policy vote amid Democratic infighting. https://t.co/mJwTKa0PvP",
  "data/tweet-nytimes/2021/11/1456743151536852996.json": "In his first time speaking publicly since news broke that he wasn't vaccinated against Covid and had tested positive, Aaron Rodgers claimed he was a victim of a \"woke mob,\" insisted he wasn't an \"anti-vax, flat-earther\" and referenced Martin Luther King Jr.https://t.co/l4IziA29If",
  "data/tweet-nytimes/2021/11/1456830408688013313.json": "The infrastructure bill is the largest single investment of federal resources into infrastructure projects in more than a decade. The House put an even larger social safety net and climate change bill back on hold amid Democratic infighting. https://t.co/l2rS7NvOOK https://t.co/vnTbjqS6x4",
  "data/tweet-nytimes/2021/11/1456874009476444162.json": "The body of a 98-year-old man was dissected in front of a paying audience at an Oregon hotel in October. Organizers said the event was meant to be educational, but the man's widow said she thought she had donated the body for research.\n https://t.co/jL037qb57L",
  "data/tweet-nytimes/2021/11/1456952861774987264.json": "At least eight people died at the Astroworld music festival in Houston after a large crowd pressed toward the stage, causing panic and dozens of injuries. https://t.co/r2yOLYxwMQ",
  "data/tweet-nytimes/2021/11/1457030059890548744.json": "Watch: President Biden celebrated the House passage of a $1 trillion bill to repair and modernize the nation’s aging infrastructure, a key legislative goal. https://t.co/Nec9guI5yd https://t.co/N7eHtdzFPW",
  "data/tweet-nytimes/2021/11/1457014944365436935.json": "A seatbelt ticket. A cracked taillight. A broken headlight.\n\nThese minor offenses resulted in police officers killing unarmed motorists. In case after case, their justification for shooting people at traffic stops who held no weapon: They were driving one. https://t.co/dpf1JLJp5A",
  "data/tweet-nytimes/2021/11/1456964602584047621.json": "The U.S. House of Representatives on Friday passed a $1 trillion infrastructure bill in a win for President Biden, but delayed a social policy vote amid Democratic infighting. https://t.co/nt8fK1pBUQ",
  "data/tweet-nytimes/2021/11/1457050209834393602.json": "It may be the first star system of its kind ever found 💫 https://t.co/8cWhk04hc0",
  "data/tweet-nytimes/2021/11/1457060259147784202.json": "A combination of two potato dishes in one, this recipe has been engineered to give you both creamy potato and singed edge in each bite.\nhttps://t.co/uEif26SWyQ https://t.co/wlRPHZHLJX",
  "data/tweet-nytimes/2021/11/1457098005706854405.json": "Watch: Protesters took to the streets of Glasgow near the COP26 conference to urge world leaders to take immediate action to combat the climate crisis. More than 100,000 marched in the city, organizers said. https://t.co/KUptnIFwCK https://t.co/qmKXdY0xvY",
  "data/tweet-nytimes/2021/11/1456753224078307337.json": "This firm, highly spiced version of mac and cheese uses Scotch bonnet pepper and is a perfect dish for your Thanksgiving table. \nhttps://t.co/ZxFmk0PYeL https://t.co/JxkoXrsjog",
  "data/tweet-nytimes/2021/11/1457035071345549318.json": "Watch: House Democrats in the U.S. passed a $1 trillion bill to address the nation’s aging infrastructure, improve climate resilience and expand high-speed internet access, but put a larger social policy and climate bill on hold. https://t.co/cIBfrEIPW2 https://t.co/GOC4uhHI1x",
  "data/tweet-nytimes/2021/11/1457095477195837446.json": "In Opinion\n\n\"Many who were sick of Trump chaos and ineptitude are now sick of Biden chaos and ineptitude. Scranton Joe was supposed to be the sensible, steady one,\" @MaureenDowd writes. https://t.co/wnSKHOkaiB",
  "data/tweet-nytimes/2021/11/1457226334384672775.json": "This Turkish yogurt cake is similar to a lemon-scented cheesecake, but it’s lighter and has a fresher, tangier flavor. https://t.co/6ErhiVjo0q",
  "data/tweet-nytimes/2021/11/1457055211709771781.json": "As the House committee investigating the Jan. 6 Capitol riot fights to extract testimony and documents from Donald Trump’s White House, an Atlanta district attorney is moving forward in her criminal investigation of Trump for election interference. https://t.co/Z5CLppGrUs",
  "data/tweet-nytimes/2021/11/1457075343156826117.json": "The $1 trillion infrastructure bill now headed to President Biden’s desk includes the largest amount of money ever spent by the United States to prepare the nation to withstand the devastating impacts of climate change. https://t.co/Lwj88F0sRS",
  "data/tweet-nytimes/2021/11/1457271683941810181.json": "A new study of hundreds of deer infected with the coronavirus in Iowa has found that the animals probably are contracting the virus from humans, and then rapidly spreading it among one another. \"We were dumbfounded,\" one of the researchers said. https://t.co/CoNKr3UYBR",
  "data/tweet-nytimes/2021/11/1457080360009875456.json": "Transportation, water, internet, energy and public safety: Here’s how the $1 trillion in President Biden’s infrastructure bill will be spent. https://t.co/myc1KQCmMm",
  "data/tweet-nytimes/2021/11/1457012416194220032.json": "Watch: Several people died and dozens were injured at the Travis Scott concert in Houston, after a large crowd began pushing toward the front of the stage. Video showed crowds amassing earlier in the day, as about 50,000 people attended the festival. https://t.co/R4Y3ZDdEgW https://t.co/Uirq2sxQEZ",
  "data/tweet-nytimes/2021/11/1457001096690421763.json": "\"I honestly blame the crowd for not taking care of each other.\"\n\nAttendees of Travis Scott's Astroworld music festival, which turned deadly on Friday after a large crowd began pushing toward the stage, give firsthand accounts of the chaos. https://t.co/PfLmnudC42",
  "data/tweet-nytimes/2021/11/1457076206109605894.json": "Breaking News: A federal appeals court in Louisiana temporarily blocked the Biden administration’s vaccine mandate for large companies. https://t.co/xgEOKkoA23",
  "data/tweet-nytimes/2021/11/1457286725701615617.json": "Three of the 10 top shows on Netflix right now are South Korean. Then there's BTS, the pop phenomenon, and groundbreaking films like \"Parasite.\" A global audience is mesmerized by Korean entertainment, and creators say success didn’t happen overnight. https://t.co/m7g4TNDizX",
  "data/tweet-nytimes/2021/11/1457371023200882702.json": "We rode every inch of New York's new 750-mile bicycle route, from Manhattan to Buffalo to the Canadian border. See for yourself what it was like. https://t.co/MczyNrvfjL https://t.co/f3SreaGZjK",
  "data/tweet-nytimes/2021/11/1457365111115599873.json": "This was the scene as the first wave of New York City Marathon runners crossed the Verazzano-Narrows Bridge that connects Staten Island and Brooklyn. \n\nFollow our live coverage. https://t.co/1warMOrDxq https://t.co/amjJNDFxGI",
  "data/tweet-nytimes/2021/11/1457403752214839307.json": "Amanda Chang, 27, just finished her first New York City Marathon and her second marathon ever. She said she loved New York’s energy. “The crowd is unbelievable. I feel like this is what Kim Kardashian feels like — red carpet, everyone cheering!” https://t.co/CULpOMeI5R https://t.co/24FJYP3MAH",
  "data/tweet-nytimes/2021/11/1457407526463475716.json": "Shalane Flanagan has completed her quest, running six marathons in six weeks. And she saved the best for last, completing the New York race in 2 hours 33 minutes 32 seconds, her best time out of all six. https://t.co/WeDtnDDw5a https://t.co/QUKJcpxQQr",
  "data/tweet-nytimes/2021/11/1457359535446839299.json": "He ran the first New York City Marathon in 1970. On Sunday, Larry Trachtenberg is running it again.\n\n\"I wouldn’t go through all of this for Boston or London or whatever,\" he said. \"It’s just that it’s New York.\" https://t.co/hLMexXMED1",
  "data/tweet-nytimes/2021/11/1457411314033250313.json": "Some 30,000 competitors are making the 26.2-mile journey across the city’s five boroughs for the New York City Marathon today, the 50th running of the race.\n\nFollow live updates here. https://t.co/0O3e5UWW7M https://t.co/tBwa9LgYQg",
  "data/tweet-nytimes/2021/11/1457390671157940232.json": "Crossing the Verrazzano-Narrows Bridge, seen here, is the first challenge of the New York City Marathon. The good news for runners is that it actually represents the longest climb of the race. https://t.co/12zPLgYmoP https://t.co/G34s3xTRUL",
  "data/tweet-nytimes/2021/11/1457469181675376640.json": "Chelsea Clinton, Abby Wambach and Tiki Barber were among the bold names who completed the New York City Marathon on Sunday. Here are the finish times for some of the notable runners.  https://t.co/x45hFtuesQ",
  "data/tweet-nytimes/2021/11/1457389081378312194.json": "Madison de Rozario of Australia won her first New York City Marathon women’s wheelchair title on Sunday, finishing in 1 hour 51 minutes 1 second. https://t.co/lBF5G7ojnT https://t.co/RAY50A4qMa",
  "data/tweet-nytimes/2021/11/1457343365515784195.json": "Dierdre Wolownick, whose son, Alex Honnold, is one of the world’s top rock climbers, ascended Yosemite’s El Capitan to celebrate her 70th birthday. https://t.co/PStkEQov4I",
  "data/tweet-nytimes/2021/11/1457590057678909446.json": "Heidi Ferrer died by suicide after suffering for months with long Covid. Her husband feared her organs might be damaged or infected, but the hospital recovered them anyway. \n\nThe case points to gaps in protocols for organ donation during the pandemic. https://t.co/fgdmqGCn8x",
  "data/tweet-nytimes/2021/11/1457714546647478277.json": "Tommy Rivers Puzey nearly died after he was diagnosed with a rare and aggressive form of cancer in July 2020.\n\nHe had to relearn how to swallow, how to use his hands, how to sit up and to walk. Then, on Sunday, he completed the New York City Marathon.\nhttps://t.co/RV7orIaxIs",
  "data/tweet-nytimes/2021/11/1457683108170502146.json": "“The gap in Covid’s death toll between red and blue America has grown faster over the past month than at any previous point,” writes @DLeonhardt in The Morning newsletter.\nhttps://t.co/6tWm95pPJz",
  "data/tweet-nytimes/2021/11/1457009919622881280.json": "The entire student body of a Pennsylvania junior-senior high school has been barred from attending classmates’ hockey games after some students chanted sexually explicit vulgarities at a visiting team’s goalie — the team’s only female player. https://t.co/T1yAwyVMem",
  "data/tweet-nytimes/2021/11/1457671772489322502.json": "Chelsea Clinton, Abby Wambach and Tiki Barber were among the bold names who completed the New York City Marathon on Sunday. Here are the finish times for some of the notable runners.  https://t.co/Xz1zGiC9Ya",
  "data/tweet-nytimes/2021/11/1457813200565641229.json": "A 16-year-old girl reported missing from Asheville, North Carolina, was rescued after she flashed a hand signal from a car on a Kentucky interstate, authorities said. A motorist recognized the distress signal from TikTok. https://t.co/oU5Cd37sjV",
  "data/tweet-nytimes/2021/11/1457823655384207366.json": "Two former Oklahoma police officers were convicted of second-degree murder for using their Tasers more than 50 times on Jared Lakey, an unarmed man who later died, according to court records. https://t.co/aD8MpTrALt",
  "data/tweet-nytimes/2021/11/1457847178622377992.json": "\"Vote like your life depends on it, because it does,\" said former President Barack Obama in an address to young people at the COP26 climate summit in Glasgow, urging them to engage in activism to push world leaders into action on the climate crisis. https://t.co/Rio9AMjvxN https://t.co/wvQhceNjv4",
  "data/tweet-nytimes/2021/11/1457835357127561219.json": "Tommy Rivers Puzey nearly died after he was diagnosed with a rare and aggressive form of cancer in July 2020. He had to relearn how to swallow, how to use his hands, how to sit up and to walk. Then, on Sunday, he completed the New York City Marathon. https://t.co/jurSllcH8v https://t.co/bWoiDmhG6X",
  "data/tweet-nytimes/2021/11/1457883207601360898.json": "A 16-year-old girl reported missing from Asheville, North Carolina, was rescued after she flashed a hand signal from a car on a Kentucky interstate, authorities said. A motorist recognized the distress signal from TikTok. https://t.co/rqCxr7HDFS https://t.co/DwxOjUMbnB",
  "data/tweet-nytimes/2021/11/1457751037486542854.json": "As part of an effort to get children vaccinated against the coronavirus, the first lady and the surgeon general will visit a Virginia elementary school on Monday that made history when its students were the first to receive the trial polio vaccine in 1954. https://t.co/J4RmVoKQtJ",
  "data/tweet-nytimes/2021/11/1457876876819681283.json": "\"Aaron Rodgers is a smart guy,\" said David O'Connor, a virologist at the University of Wisconsin-Madison and a Packers fan. But, he added, \"He's still vulnerable to the blind side blitz of misinformation.\" https://t.co/8BXVplfp8f",
  "data/tweet-nytimes/2021/11/1458027859197431812.json": "Singapore will no longer cover the medical costs of Covid patients who choose not to get vaccinated, officials said.\n\nMore than 80% of the country’s population is inoculated, but sustained numbers of severe cases have strained the health care system.\nhttps://t.co/kv2FwA56k8",
  "data/tweet-nytimes/2021/11/1457898268642488320.json": "Gaige Grosskreutz, the only person who survived being shot by Kyle Rittenhouse in Kenosha, Wisconsin, testified for several hours on Monday. His account underscored the challenge prosecutors face in disproving Rittenhouse's self-defense claim. https://t.co/GbXkrBLg11",
  "data/tweet-nytimes/2021/11/1458029123998294018.json": "M.J. Eberhart became the oldest known person to complete the Appalachian Trail.\n\nThe 83-year-old retired eye doctor, known by his trail name “Nimblewill Nomad,” mostly slept in the wild during the roughly 2,190-mile hike from Georgia to Maine.\nhttps://t.co/G7UuccLPzz https://t.co/41TYloIpfC",
  "data/tweet-nytimes/2021/11/1458069381934686210.json": "A 16-year-old girl reported missing from Asheville, North Carolina, was rescued after she flashed a hand signal from a car on a Kentucky interstate, authorities said. A motorist recognized the distress signal from TikTok. https://t.co/lZcc59Gnnh",
  "data/tweet-nytimes/2021/11/1458064355199754243.json": "M.J. Eberhart became the oldest known person to complete the Appalachian Trail.\n\nThe 83-year-old retired eye doctor, known by his trail name “Nimblewill Nomad,” mostly slept in the wild during the roughly 2,190-mile hike from Georgia to Maine.\nhttps://t.co/9GqsPN5eC3",
  "data/tweet-nytimes/2021/11/1458079455499390987.json": "Truck drivers in the U.S. are quitting over long hours and uncomfortable working conditions, exacerbating the supply chain crisis.\n\n“I had no personal life outside of driving a truck,” one driver said. “I finally had enough.”\nhttps://t.co/bkM73pOOQ3",
  "data/tweet-nytimes/2021/11/1458152681940439045.json": "A girl reported missing from Asheville, North Carolina, in the passenger seat of a car traveling through Kentucky appeared to be waving through the window. But one person in a nearby car recognized the signal from TikTok, and knew she was in distress. https://t.co/3IzA733xPM https://t.co/jUqWn1z1H0",
  "data/tweet-nytimes/2021/11/1458098470565421073.json": "Breaking News: Pfizer is expected to ask the FDA to expand authorization of its coronavirus booster shot to include all adults, a request the agency is likely to grant. https://t.co/ZoFOfnxQOU",
  "data/tweet-nytimes/2021/11/1458061832665567232.json": "New York officials announced plans to close six prisons early next year. The facilities are well below capacity as the state’s prisoner population continues to decline.\nhttps://t.co/BcLG4j5KV3",
  "data/tweet-nytimes/2021/11/1458074415040716805.json": "Rep. Alexandria Ocasio-Cortez arrived in Glasgow for the #COP26 climate talks with Speaker Nancy Pelosi and other lawmakers. The New York Democrat said she was there to push the U.S. and other developed nations to greater action on global warming.\nhttps://t.co/vsbgAtUEpB",
  "data/tweet-nytimes/2021/11/1458172500215533569.json": "Breaking News: Thirteen of Donald Trump's top aides — including his son-in-law and his chief of staff — campaigned illegally for his reelection and violated the Hatch Act, a watchdog said. https://t.co/15jTNll9G3 https://t.co/IDPoBWHlgR",
  "data/tweet-nytimes/2021/11/1458170059730391051.json": "\"Stay in the streets and keep pushing.\"\n\nAlexandria Ocasio-Cortez said Tuesday at the U.N. climate summit in Glasgow that activists can press governments to change their priorities, and that the U.S. should be a global leader in driving down emissions. https://t.co/cdvZBICIGN https://t.co/NHW23wcDXw",
  "data/tweet-nytimes/2021/11/1458097090488373258.json": "Max Cleland, who lost both legs and an arm during the Vietnam War and who became a senator from Georgia, only to lose his seat after Republicans impugned his patriotism, died on Tuesday. He was 79. https://t.co/V9Vmzp7TkW",
  "data/tweet-nytimes/2021/11/1458250574550417409.json": "Malala Yousafzai, who at 17 became the youngest-ever Nobel Peace Prize laureate, married her partner on Tuesday at a small nikkah ceremony in England.\n\n\"Today marks a precious day in my life,\" she wrote on Twitter. \"Please send us your prayers.\" https://t.co/7R4VLN8tXZ",
  "data/tweet-nytimes/2021/11/1458241771230711814.json": "Meghan Markle has been calling members of Congress to garner support for paid family leave in the U.S. \"It takes strong men, modern men, to really understand they benefit from it as well,\" she told Andrew Ross Sorkin at the DealBook Online Summit. https://t.co/CAxTyFf4yI",
  "data/tweet-nytimes/2021/11/1458270882946748418.json": "Breaking News: A federal judge rejected a bid by former President Trump to keep secret papers about his actions leading up to and during the Jan. 6 attack. https://t.co/ZTyaUO79W9",
  "data/tweet-nytimes/2021/11/1458120985010376713.json": "Ikea said that its U.S. division would raise its starting wage to $16 per hour starting on Jan. 1, and raise the average hourly pay to $20 per hour. https://t.co/ddvfJuMoXG",
  "data/tweet-nytimes/2021/11/1458290865923887112.json": "The NFL has fined the Green Bay Packers $300,000 and two of its players, Aaron Rodgers and Allen Lazard, $14,650 each for not following Covid protocols agreed on by the league and players’ union. https://t.co/eNTPTnoImS",
  "data/tweet-nytimes/2021/11/1458283295217790976.json": "The U.S. Holocaust Memorial Museum said in a report that China had escalated its crimes against Uyghurs in Xinjiang and that it was “gravely concerned” that the government “may be committing genocide.” https://t.co/FGZgSRxkf7",
  "data/tweet-nytimes/2021/11/1458298388315844611.json": "Matthew McConaughey is vaccinated, as are his wife, mother and older child, he said, adding that he wouldn't mandate vaccines for young children himself because he wants more information. He said he trusts scientists are trying “to do the right thing.” https://t.co/MRkaK8Lexb",
  "data/tweet-nytimes/2021/11/1458370119848112130.json": "Malala Yousafzai, who at 17 became the youngest-ever Nobel Peace Prize laureate, married her partner on Tuesday at a small nikkah ceremony in England.\n\n\"Today marks a precious day in my life,\" she wrote on Twitter. \"Please send us your prayers.\" https://t.co/gOWiUmRmCR",
  "data/tweet-nytimes/2021/11/1458412886942965764.json": "Joshua Halsey, a Black laborer, was deaf and hadn’t heard the white mob advancing through the streets of Wilmington, North Carolina, in 1898. He was killed and buried in an unmarked grave.\n\nOn Saturday, nearly 123 years later, the city gave him a funeral.\nhttps://t.co/cjtHwcqB5s",
  "data/tweet-nytimes/2021/11/1458351236269363201.json": "Meghan, the Duchess of Sussex, has been calling members of Congress to garner support for paid family leave in the U.S. \"It takes strong men, modern men, to really understand they benefit from it as well,\" she told Andrew Ross Sorkin. https://t.co/r7WKChD1AJ",
  "data/tweet-nytimes/2021/11/1458411635501064192.json": "The U.S. surgeon general pushed back against comments by Matthew McConaughey about Covid vaccine mandates for children.\n\n“I couldn’t mandate having to vaccinate the younger kids,” the actor said. “I still want to find out more information.”\nhttps://t.co/YOvvKP5HbR",
  "data/tweet-nytimes/2021/11/1458524436513046534.json": "Malala Yousafzai, who at 17 became the youngest-ever Nobel Peace Prize laureate, married Asser Malik, a manager for the Pakistan Cricket Board, on Tuesday at a small nikkah ceremony in England.\n\n\"Today marks a precious day in my life,\" she wrote.\nhttps://t.co/PHq19wV7vQ https://t.co/9pjAwouIk0",
  "data/tweet-nytimes/2021/11/1458519867028561922.json": "Meghan Markle, the Duchess of Sussex, has been calling members of Congress to garner support for paid family leave in the U.S. \"It takes strong men, modern men, to really understand they benefit from it as well,\" she said. https://t.co/dQqzDVxvcc https://t.co/LXZuGG3N0J",
  "data/tweet-nytimes/2021/11/1458516246937444353.json": "In an unusual request, Kyle Rittenhouse’s lawyers are asking for a mistrial with prejudice to be called because prosecutors discussed his right to remain silent in front of the jury. If the judge approves, Rittenhouse could not be retried for the crimes. https://t.co/5JVVcL98Sf",
  "data/tweet-nytimes/2021/11/1458547576974757891.json": "In July, a puppet embodying a refugee girl began walking from Turkey to Britain in search of her mother. It is one of the year’s most ambitious pieces of theater — and certainly the piece of theater with the biggest stage. https://t.co/5oeaZTq5U3 https://t.co/KcWJclweRt",
  "data/tweet-nytimes/2021/11/1458588039698075655.json": "\"Everybody that you shot at that night, you intended to kill, correct?\"\n\"I didn’t intend to kill them. I intended to stop the people who were attacking me.\"\n\nThis is how the prosecution's cross-examination of Kyle Rittenhouse began: https://t.co/G0R5FizQUE https://t.co/VCbws5FQgG",
  "data/tweet-nytimes/2021/11/1458627543272239108.json": "Breaking News: A federal judge overruled Gov. Greg Abbott’s ban on mask mandates in Texas schools, clearing the path for districts to issue their own rules. https://t.co/1upbtXQTG5",
  "data/tweet-nytimes/2021/11/1458573977316691981.json": "As soon as 2026, automakers would be required to equip cars with technology that could detect if a driver had consumed too much alcohol under a key provision of the infrastructure bill President Biden is expected to sign soon. https://t.co/ZF8bb6BaCn",
  "data/tweet-nytimes/2021/11/1458640661863972869.json": "A crew of timber poachers started a fire in the Olympic National Forest in Washington State, prosecutors said. Now tree DNA has been used to convict a ringleader, who was sentenced this week. https://t.co/D3SGClIAtO",
  "data/tweet-nytimes/2021/11/1458645687659384838.json": "In Opinion\n\n\"90 percent of the human beings subjected to the appalling conditions at Rikers are there pretrial, many because they cannot afford bail. Almost 1,600 have been waiting for a trial for over a year,\" writes a former New York chief judge. https://t.co/T17qyXgF0d",
  "data/tweet-nytimes/2021/11/1458761447824146443.json": "Peter Jackson was given access to nearly 60 hours of unseen footage of The Beatles.\n\nThe result, a seven-hour-plus documentary series, offers astonishing glimpses into the band’s working life and the grueling conflicts that led to its breakup. https://t.co/VLG5N7mqRD",
  "data/tweet-nytimes/2021/11/1458755332684009474.json": "Breaking News: F.W. de Klerk, the former South African president who ended the apartheid system he had defended and freed Nelson Mandela, has died at 85. https://t.co/eea12kqwLA",
  "data/tweet-nytimes/2021/11/1458469521514184708.json": "Kyle Rittenhouse, who has idolized law enforcement since he was young, arrived in Kenosha on Aug. 25, 2020, with at least one mission: to play the role of police officer and medic. The night would end with him fatally shooting two men and wounding another. https://t.co/UuM8VJQGXR",
  "data/tweet-nytimes/2021/11/1458472028105756680.json": "A top Communist Party leader from Vietnam visited Karl Marx's grave in London. While there, the official also ate steak covered in gold flakes at a restaurant run by Salt Bae, according to a TikTok video the chef posted. The video swiftly vanished. https://t.co/XgzWWclQC9",
  "data/tweet-nytimes/2021/11/1458842049940185090.json": "Peter Jackson was given access to nearly 60 hours of unseen footage of The Beatles.\n\nThe result, a seven-hour-plus documentary series, offers astonishing glimpses into the band’s working life and the grueling conflicts that led to its breakup. https://t.co/tWujzG4Ez7",
  "data/tweet-nytimes/2021/11/1458878459149787137.json": "U.S. veterans have become powerful lobbyists in the push to legalize psychedelic drugs, which some say have therapeutic benefits. \"We’ve put our lives on the line for our country,\" one said, adding: \"We need help healing because nothing has worked so far.\" https://t.co/hh92qhGuh9",
  "data/tweet-nytimes/2021/11/1458877201600978954.json": "These puffs — rich, with the bite of black pepper and Parmesan — provide added comfort to your Thanksgiving table. \nhttps://t.co/yc4eUDAFtY https://t.co/ngxea2aQs4",
  "data/tweet-nytimes/2021/11/1458889791660036096.json": "President Biden called veterans the \"soul of America\" as he marked the first Veterans Day in two decades without American troops engaged in an active war overseas. https://t.co/XjQ9gM6xtY",
  "data/tweet-nytimes/2021/11/1458777545680494592.json": "China’s Communist Party raised Xi Jinping to the official stature of Mao Zedong, paving the way for him to claim a third five-year term as the country’s leader. An intense propaganda campaign is sure to follow. https://t.co/014sVcJyEr https://t.co/2zE64AbqRx",
  "data/tweet-nytimes/2021/11/1458955216196415489.json": "President Biden, having ended the 20-year conflict in Afghanistan this summer, marked his first Veterans Day in office at Arlington National Cemetery.\nhttps://t.co/HPTagb4h87 https://t.co/i1fHe5bhlW",
  "data/tweet-nytimes/2021/11/1458970310489874433.json": "A Black police officer whose chief left a sheet of paper with the words “Ku Klux Klan” on his raincoat this summer filed a discrimination complaint on Thursday with the Ohio Civil Rights Commission. https://t.co/LzIzZjCJij",
  "data/tweet-nytimes/2021/11/1458950194796634115.json": "Vanessa Nakate, an activist, told the UN climate summit that she and her peers didn't believe the pledges that officials made this week to move aggressively on climate change. But they want to.\n\n\"I’m actually here to beg you to prove us wrong,\" she said. https://t.co/JNLMwZyOTs https://t.co/a8SpdEfMkl",
  "data/tweet-nytimes/2021/11/1458980377712865289.json": "Jack Le Vine is a 96-year-old World War II veteran in Brooklyn who usually spends Veterans Day doing “nothing.”\n\nThis year, his neighbors had other plans. https://t.co/FVpkRUf9Fa",
  "data/tweet-nytimes/2021/11/1459137944661508105.json": "Johnson &amp; Johnson will break itself up into two publicly traded companies, spinning off its consumer-products division from its pharma and medical device business.\nhttps://t.co/90TPjsuGFW",
  "data/tweet-nytimes/2021/11/1459128883924639748.json": "A U.S. journalist, Danny Fenster, was sentenced to 11 years in prison, six months after being arrested by Myanmar’s military government, his employer said. https://t.co/nJqw87j774",
  "data/tweet-nytimes/2021/11/1459196813366468609.json": "John Kerry, the U.S. special envoy for climate change, on Friday described fossil fuel subsidies as the \"definition of insanity,\" saying they allow governments to \"feed the problem we're here to cure.\" https://t.co/mDN5mnxTYF",
  "data/tweet-nytimes/2021/11/1459200599518556160.json": "The lives of Black farmworkers in Mississippi are being upended as they lose their jobs to white South Africans being brought in on guest visas. \"It’s like being robbed of your heritage,\" said one worker who comes from generations of Mississippi farmers. https://t.co/2lCJxqdM86",
  "data/tweet-nytimes/2021/11/1459121315919638531.json": "The world’s richest nations are disproportionately responsible for historical planet-warming greenhouse gases. Poorer nations, often the most vulnerable to climate change, are asking them to pay for the damages caused by rising temperatures.\nhttps://t.co/Y0K6V4ZwZu",
  "data/tweet-nytimes/2021/11/1459174200866967576.json": "The future of Britney Spears’s conservatorship is in the hands of a Los Angeles probate judge. A hearing on Friday could mark the final chapter of the 13-year saga.\n\nHere’s what is at stake.\nhttps://t.co/gqOlo6Yf2P",
  "data/tweet-nytimes/2021/11/1459266388170784768.json": "Breaking News: Steve Bannon was indicted by a grand jury on Friday on two counts of criminal contempt after he refused to comply with subpoenas related to the House investigation into the Jan. 6 Capitol riot. https://t.co/VIfpZZqBKi",
  "data/tweet-nytimes/2021/11/1459285410715250698.json": "The conservatorship that has long overseen Britney Spears's life and finances should be terminated immediately, a Los Angeles judge ruled on Friday.\nhttps://t.co/FOzbarCmyg https://t.co/PjClLtWYtz",
  "data/tweet-nytimes/2021/11/1459283777226690562.json": "Breaking News: A judge ended Britney Spears's conservatorship, which has overseen the pop star's life and fortune since 2008. \nhttps://t.co/2OmsPbI1HF",
  "data/tweet-nytimes/2021/11/1459264789214109698.json": "Britney Spears's 13-year conservatorship saga may soon be over — a Los Angeles judge is expected to rule this afternoon on the arrangement that has controlled Spears and her finances since 2008. Follow live updates: https://t.co/qvV3hsXpon",
  "data/tweet-nytimes/2021/11/1459170391906258959.json": "The carbon footprint of the COP26 climate summit is expected to be double that of the previous conference in 2019, a report for the British government found.\n\nAbout 60% of emissions are estimated to come from international flights, it said.\nhttps://t.co/00WJxLE6lv",
  "data/tweet-nytimes/2021/11/1459306296436572161.json": "Now that a judge has ended the conservatorship that Britney Spears called \"abusive,\" watch our documentary, which revealed details of her life under the arrangement that monitored her every move. It's available for New York Times subscribers in the U.S. https://t.co/eb5LhOHsi7",
  "data/tweet-nytimes/2021/11/1459166663245545472.json": "In Opinion\n\n\"There's no entitlement like celebrity entitlement,\" Frank Bruni writes. \"It can make a man who throws a football very far and very accurately believe that he knows better than deeply learned scientists about viruses and vaccines.\" https://t.co/EUE0xq3Hcw",
  "data/tweet-nytimes/2021/11/1459347809547730958.json": "“The conservatorship of the person and estate of Britney Jean Spears is no longer required,” Judge Brenda Penny said, making her ruling less than half an hour into a brief hearing. “The conservatorship is hereby terminated.” https://t.co/6ojlgJoH6C",
  "data/tweet-nytimes/2021/11/1459362917514719235.json": "Gov. Roy Cooper of North Carolina on Friday granted a pardon to Montoyae Dontae Sharpe, who spent more than 24 years in prison for murder before a judge vacated his conviction in 2019, finding that a key witness had “entirely made up” her testimony. https://t.co/dDA4UbGwDz",
  "data/tweet-nytimes/2021/11/1459385538943856644.json": "Six times more coronavirus booster shots are being administered around the world daily than primary doses in low-income countries, the director general of the WHO said on Friday, calling the disparity \"a scandal that must stop now.\" https://t.co/PsixSdKbA2",
  "data/tweet-nytimes/2021/11/1459575060063215623.json": "Under a new law effective this weekend, employers in Portugal are barred from contacting workers outside of contractual hours. The law also requires employers to pay part of off-site workers' electricity and internet bills. https://t.co/95uM5109ep",
  "data/tweet-nytimes/2021/11/1459586164386582532.json": "A U.S. airstrike in 2019 that killed dozens of civilians in Syria was buried by the military. An investigation by The New York Times pieced together what happened. https://t.co/8sbq3ajmc6",
  "data/tweet-nytimes/2021/11/1459518920474435587.json": "Steve Bannon was indicted by a grand jury on Friday on two counts of criminal contempt after he refused to comply with subpoenas related to the House investigation into the Jan. 6 Capitol riot. https://t.co/WgccUlXwJq",
  "data/tweet-nytimes/2021/11/1459630913374015492.json": "Curtis Means, who was born 132 days early, had less than a 1 percent chance of survival. Now 16 months old, he has been certified as the most premature infant to live to a first birthday. https://t.co/q7QGsQMSv1",
  "data/tweet-nytimes/2021/11/1459150516517285892.json": "Chinese officials tried to shut down an exhibition in Italy by Badiucao, a Chinese artist likened to Banksy.\n\nWhile direct requests to cancel shows are relatively rare, China’s censorship apparatus is increasingly being felt internationally. https://t.co/018p19NkwO",
  "data/tweet-nytimes/2021/11/1459637198580502529.json": "White supremacists shot Joshua Halsey near his house in Wilmington, N.C., during a bloody coup on Nov. 10, 1898 when untold numbers of Black people were killed. More than 120 years later, the city gave him a funeral.  https://t.co/tDHIyv4iHB",
  "data/tweet-nytimes/2021/11/1459612096950411268.json": "Peter Jackson was given access to nearly 60 hours of unseen footage of The Beatles.\n\nThe result, a seven-hour-plus documentary series, offers astonishing glimpses into the band’s working life and the grueling conflicts that led to its breakup. https://t.co/gTlhvIKf18",
  "data/tweet-nytimes/2021/11/1459778140729974785.json": "David Philipps, a reporter for The Times, details in his new book that behavior by the Navy SEALs chief Eddie Gallagher was so worrisome that his teammates say they altered their mission to ensure that he wouldn’t harm civilians. https://t.co/khJoCMennz",
  "data/tweet-nytimes/2021/11/1459876310923329547.json": "Of Taylor Swift’s 10-minute performance of “All Too Well” on “SNL,” Colin Jost perhaps said it best: “I think the lesson we all learned this week is, never break up with Taylor Swift.” https://t.co/1aGk8FhKsj",
  "data/tweet-nytimes/2021/11/1459857432377708549.json": "Make these tangy and sweet two-toned lemon bars ahead of Thanksgiving — they’ll keep in the refrigerator for up to five days. https://t.co/VllDvQba42 https://t.co/yEPjtoTqRE",
  "data/tweet-nytimes/2021/11/1459602529386389505.json": "https://t.co/3QCZBsyDjh",
  "data/tweet-nytimes/2021/11/1459930407315689479.json": "Austria has announced a targeted lockdown for unvaccinated adults and minors over age 11 amid a surge of Covid-19 infections in the country. It is believed to be one of the first national lockdowns directed at the unvaccinated. https://t.co/ANB8yO73Kn",
  "data/tweet-nytimes/2021/11/1459944256152481804.json": "Austria will begin a targeted lockdown for unvaccinated adults and minors over age 11 on Monday, amid a surge of Covid-19 infections in the country. Less than 65% of Austria is fully vaccinated, one of the lowest rates in the EU. https://t.co/iOsiAhmQZU https://t.co/yHmBxIqg4V",
  "data/tweet-nytimes/2021/11/1459961842449760256.json": "Curtis Means, who was born 132 days early, had less than a 1% chance of survival. Now 16 months old, he has been certified as the most premature infant to live to a first birthday. https://t.co/hBAZHoWpIv",
  "data/tweet-nytimes/2021/11/1459966911614177287.json": "Petra Mayer, a books editor for NPR who delighted readers with her musings about science fiction, comics and cats, died on Saturday in Silver Spring, Maryland. She was 46. https://t.co/gtsuOb8mND",
  "data/tweet-nytimes/2021/11/1459956822908018688.json": "In Kurt Streeter’s latest column, a Wisconsin doctor said it was \"tragic\" that Aaron Rodgers is sowing doubt about Covid-19 vaccines with misinformation. It \"undercuts what we’re trying to do as a health care system,\" Dr. Kyle Martin said. https://t.co/2SMGc3JoUm",
  "data/tweet-nytimes/2021/11/1460014717586624519.json": "The U.S. surgeon general said it would be \"a setback for public health\" if courts continue to block the Biden administration’s efforts to compel large companies to require Covid-19 vaccinations or face weekly testing. https://t.co/AT0lQUcv2p",
  "data/tweet-nytimes/2021/11/1460083665556357123.json": "President Biden named Mitch Landrieu, a former mayor of New Orleans, to oversee the distribution of $1 trillion in infrastructure funds to states. https://t.co/eQdXQzAhzo",
  "data/tweet-nytimes/2021/11/1460110366692855813.json": "Dozens of New York City workers have been suspended without pay as a part of an investigation into the use of fake vaccine cards at the Department of Sanitation, a city official said. https://t.co/clVEP9Tame",
  "data/tweet-nytimes/2021/11/1460065030888734726.json": "In Opinion\n\nIn Denmark, \"high trust and a sense of community have made Covid policy easier,\" write three Danish researchers in a guest essay. \"When vaccines were approved, Danes quickly got vaccinated.\" https://t.co/lqUmdOo1ti",
  "data/tweet-nytimes/2021/11/1459340273893400576.json": "Twenty-three wealthy countries are responsible for 50% of historical carbon dioxide emissions. At the UN climate summit, one of the biggest fights is whether these countries should compensate poorer nations for the damages caused by rising temperatures. https://t.co/CNn0H3kQtY",
  "data/tweet-nytimes/2021/11/1460061258728853507.json": "In Opinion\n\n\"Survival after giving birth should not be a luxury afforded to wealthy white women,\" writes Bess Kalb, an author and comedy writer, in a guest essay. https://t.co/qfaShYzhTn",
  "data/tweet-nytimes/2021/11/1460195417052876800.json": "Breaking News: The U.S. journalist Danny Fenster was freed from prison in Myanmar, days after he received an 11-year sentence, and will be allowed to leave the country.\nhttps://t.co/7DtFfqmmb8",
  "data/tweet-nytimes/2021/11/1460233095207174146.json": "Breaking News: President Biden plans to bar new federal oil and gas leasing around New Mexico’s Chaco Canyon, one of the nation’s oldest Native American sites. It comes after years of tribal requests.\nhttps://t.co/pou0MhiiDf",
  "data/tweet-nytimes/2021/11/1460223596488441857.json": "Three snow leopards died of Covid complications at a zoo in Nebraska, about a month after they tested positive for the virus.\n\nThe loss of Ranney, Everest and Makalu “is truly heartbreaking,” the zoo said in a statement.\nhttps://t.co/NdKrnuLrrP",
  "data/tweet-nytimes/2021/11/1460252073702957056.json": "Breaking News: Beto O’Rourke will run for Texas governor, setting the stage for a political showdown that will test Democrats’ strength in the state.\nhttps://t.co/Rp9pEvQax0",
  "data/tweet-nytimes/2021/11/1460250602500464642.json": "A Maori tribe called for anti-vaccine protesters in New Zealand to stop performing its ceremonial dance, known as the Ka Mate haka. “We do not support their position,” a senior member of the Ngati Toa tribe said.\nhttps://t.co/yxLdyOjUjr",
  "data/tweet-nytimes/2021/11/1460286422859067392.json": "Breaking News: A Connecticut judge ruled Alex Jones was guilty by default, granting a sweeping victory for the parents suing the far-right broadcaster for defamation over the Sandy Hook shooting. https://t.co/VQxGp1qojO",
  "data/tweet-nytimes/2021/11/1460268886801227778.json": "Unvaccinated people in Austria can only leave their homes for essential activities as one of the strictest Covid lockdowns in Europe goes into effect. About 65% of its population is vaccinated, one of the lowest rates in western Europe.\nhttps://t.co/siWPcoIGD2",
  "data/tweet-nytimes/2021/11/1460294791439208452.json": "A Connecticut judge’s ruling against Alex Jones combines with decisions in Texas to grant a sweep for families of victims against the Infowars host for spreading conspiracy theories about the Sandy Hook shooting that killed 20 children and six educators. https://t.co/CDBrFMOnlX https://t.co/Uop1rNKdMW",
  "data/tweet-nytimes/2021/11/1459878797231239177.json": "This vegetarian Thanksgiving stuffing is inspired by French onion soup. https://t.co/Zsxmj037KN https://t.co/VPQHUAFytc",
  "data/tweet-nytimes/2021/11/1460314699334098944.json": "A Connecticut judge ruled Alex Jones was liable by default, granting a sweeping victory for the parents suing the far-right broadcaster for defamation over the Sandy Hook shooting. https://t.co/cfQuVhCL5a https://t.co/iXUfyBu3ci",
  "data/tweet-nytimes/2021/11/1460302853323558916.json": "Steve Bannon, a former senior aide to Donald Trump, turned himself in days after he was indicted for contempt of Congress for refusing to provide information to the House committee investigating the Jan. 6 attack on the Capitol. https://t.co/8IGTwm2TPy https://t.co/XsOUIHMTgU",
  "data/tweet-nytimes/2021/11/1460227608151531520.json": "A 2019 U.S. airstrike on a group of women and children in Syria was one of the largest civilian casualty events in the war against the Islamic State.\n\nHow was the attack kept hidden by the military? Listen to today’s episode of The Daily.\nhttps://t.co/HyFa28SYqR",
  "data/tweet-nytimes/2021/11/1460310642720661504.json": "Britney Spears’s lawyer has been making demands that the former business manager of her estate reveal how much money the firm was paid during the conservatorship. Lawyers for the firm have largely refused and new court documents reveal a heated exchange. https://t.co/EMAeWA3ja2",
  "data/tweet-nytimes/2021/11/1460299076390592518.json": "Unvaccinated Austrians ages 12 and older awoke on Monday confined to their homes for all but essential activities, as one of the strictest coronavirus lockdowns in Europe went into effect. https://t.co/AOTZJEUIUl https://t.co/uyTvliEkQA",
  "data/tweet-nytimes/2021/11/1460358274046382084.json": "President Biden signed the sweeping $1 trillion infrastructure bill on Monday, the most important step in a generation toward upgrading the nation’s roads, ports, rails, pipes, power lines, broadband cables and more. https://t.co/w2NJk4DZMS https://t.co/rsjj6et00q",
  "data/tweet-nytimes/2021/11/1460340598465081349.json": "\"All Too Well\" parallels the emotional work many women have been privately undertaking: Looking back on relationships; wondering what was exploitation or abuse; wishing they could extend wisdom to their vulnerable younger selves, writes @lindsayzoladz. https://t.co/tu8E0ex89k",
  "data/tweet-nytimes/2021/11/1460367034756304896.json": "\"Sesame Street\" is welcoming its first Asian American muppet to the neighborhood. Ji-Young, a Korean American 7-year-old who loves electric guitar and skateboarding, debuts next week. https://t.co/mpYvnt9doj https://t.co/jK7BWLggjj",
  "data/tweet-nytimes/2021/11/1460363130735927300.json": "Breaking News: President Biden signed the bipartisan infrastructure bill, the largest investment in a generation in roads, rails, pipes, power lines and more. https://t.co/iNOfoFA6cE",
  "data/tweet-nytimes/2021/11/1460049949316591617.json": "The dressing for this snappy, fresh Thanksgiving side dish is nothing more than lemon juice, olive oil, garlic and salt. Its simplicity makes it perfect. https://t.co/EHYHr69vaZ https://t.co/5xweiczgcP",
  "data/tweet-nytimes/2021/11/1460412319637426177.json": "Thomas Binger, the prosecutor hoping to convict Kyle Rittenhouse, said in closing arguments that Rittenhouse lost the right to claim self-defense by bringing \"a gun to a fistfight.\"\n\n\"You cannot claim self-defense against a danger you create,\" Binger said. https://t.co/RrbTkhgAdu https://t.co/KAJuKj75eN",
  "data/tweet-nytimes/2021/11/1460393463250366465.json": "The infrastructure bill that President Biden signed on Monday has the potential to transform New York City. Some of the projects planned include an extension of Manhattan's Second Avenue subway and a new rail tunnel linking New York and New Jersey. https://t.co/vD5ncDIP6I",
  "data/tweet-nytimes/2021/11/1460432520084869121.json": "The varsity football team at the California School for the Deaf, Riverside, is undefeated this season.\n\nTrevin Adams, the team's quarterback, said playing with fellow deaf teammates is liberating: \"We can express ourselves completely. We can be leaders.\" https://t.co/jmCwrNg0U1 https://t.co/LRqJyDFWas",
  "data/tweet-nytimes/2021/11/1460397226564460549.json": "President Biden, surrounded by lawmakers from both parties, signed the $1 trillion infrastructure bill into law. The legislation marked a bipartisan victory, but fell short of Biden's initial $2.3 trillion proposal. https://t.co/HTRZAv4SRw https://t.co/nZHvvf8T1Z",
  "data/tweet-nytimes/2021/11/1460457608775667714.json": "President Biden signed a $1 trillion infrastructure bill into law on Monday afternoon, a bipartisan victory that will pour billions into the nation's roads, ports and power lines. https://t.co/Npgb6Uu0qP https://t.co/y9CNz663Bz",
  "data/tweet-nytimes/2021/11/1460465148511113221.json": "Meet Ji-Young, the first Asian American muppet on \"Sesame Street.\" \n\nShe's a seven-year-old Korean-American who loves skateboarding and playing guitar — and she'll be starting some important conversations. https://t.co/lzZunlwoIN https://t.co/XsNcSvCe1n",
  "data/tweet-nytimes/2021/11/1460427465025806339.json": "In a part of California that suffered greatly during the pandemic, a deaf football team's winning streak is lifting its community. https://t.co/vaTYy8kiYx",
  "data/tweet-nytimes/2021/11/1460576029794357251.json": "Breaking News: Pfizer will allow its Covid treatment pill to be made and sold inexpensively in 95 poorer nations. The deal could help significantly expand access to the pill, but it excludes a number of countries hit hard by the pandemic.\nhttps://t.co/9DAZTVUUcl",
  "data/tweet-nytimes/2021/11/1460563341638787074.json": "President Biden signed a $1 trillion infrastructure bill into law on Monday afternoon, a bipartisan victory that will pour billions into the nation's roads, ports and power lines. https://t.co/VWMxXxmBbG https://t.co/W0gQK8YtLN",
  "data/tweet-nytimes/2021/11/1460559535886807044.json": "Indonesia wants to join the space race and lure the SpaceX founder Elon Musk by building a spaceport on a remote coral island. The island’s Indigenous inhabitants are pushing back.\nhttps://t.co/ITVOYxy7PV https://t.co/tzKLOFYrXl",
  "data/tweet-nytimes/2021/11/1460601071617941504.json": "Pfizer will allow its Covid treatment to be made and sold in 95 poorer nations that are home to more than half of the world’s population. It follows a similar deal by Merck announced last month.\nhttps://t.co/erbszjjrWB https://t.co/xvkQ8rwAz5",
  "data/tweet-nytimes/2021/11/1460637752693858308.json": "Fully vaccinated people will be allowed in Times Square for New Year’s Eve, the mayor said. Anyone unable to prove they're vaccinated because of a disability will have to show a negative virus test. Children under 5 must be with someone who is vaccinated. https://t.co/wd8UFWpLup",
  "data/tweet-nytimes/2021/11/1460676574886436864.json": "New York City will welcome crowds back to Times Square this New Year’s Eve, Mayor Bill de Blasio said Tuesday, as long as they provide proof that they are fully vaccinated against the coronavirus. https://t.co/3XZxT8rXGK https://t.co/7eRUU475yn",
  "data/tweet-nytimes/2021/11/1460710547972894725.json": "Just because you can, doesn't mean you should. https://t.co/PeM2AUXuee https://t.co/gNYtQz8g0q",
  "data/tweet-nytimes/2021/11/1460734221383835651.json": "Breaking News: The FDA is said to be planning to authorize booster shots of the Pfizer Covid vaccine for all adults in the U.S. as early as Thursday. https://t.co/d7DLUCjtKO https://t.co/hklxzn7WEu",
  "data/tweet-nytimes/2021/11/1460653960533057545.json": "\"All Too Well\" parallels the emotional work many women have been privately undertaking: Looking back on relationships; wondering what was exploitation or abuse; wishing they could extend wisdom to their vulnerable younger selves, writes @lindsayzoladz. https://t.co/Fj1gWKyxJh",
  "data/tweet-nytimes/2021/11/1460759636743802881.json": "“Sesame Street” is welcoming its first Asian American Muppet to the neighborhood. Ji-Young, a Korean American 7-year-old who loves playing her electric guitar and skateboarding, will make her debut next week.\nhttps://t.co/z1kP2AJ3Kp https://t.co/fGztaQcIIM",
  "data/tweet-nytimes/2021/11/1460785005077180421.json": "Breaking News: A Frida Kahlo painting sold for $34.9 million, setting a benchmark for the most valuable work of Latin American art ever sold at auction. https://t.co/l6zZmQhesq",
  "data/tweet-nytimes/2021/11/1460567094576267268.json": "Several dozen New York City workers were suspended without pay as a part of an investigation into the use of fake Covid vaccine cards at the Department of Sanitation, an official said. https://t.co/puI1BYpSVt",
  "data/tweet-nytimes/2021/11/1460797356153225218.json": "House Democrats plan to move on Wednesday to formally rebuke Representative Paul Gosar and strip him of committee assignments for posting an animated video depicting him killing Representative Alexandria Ocasio-Cortez and attacking President Biden. https://t.co/brMPKxpm7O",
  "data/tweet-nytimes/2021/11/1460850195470721024.json": "This painting by Frida Kahlo, \"Diego and I,\" is the most valuable work of Latin American art ever sold at auction.\n\nIt is a window into Kahlo's turbulent marriage to Diego Rivera, who is depicted above her tearful eyes. The piece sold for $34.9 million. https://t.co/9yl0oRQErj https://t.co/8tCCwVD11J",
  "data/tweet-nytimes/2021/11/1460944742028619776.json": "Breaking News: The White House plans to spend billions expanding Covid vaccine manufacturing in the U.S. and boosting supplies in the developing world.\nhttps://t.co/tjDh13I91x",
  "data/tweet-nytimes/2021/11/1460948398828314630.json": "They play softball barefoot, wearing traditional Mayan dresses. They dash around bases in the sweltering Yucatán Peninsula heat. And they're causing a sensation in Mexico, breaking barriers with every game. https://t.co/iy3ro79x5N https://t.co/Eq12ezD6PJ",
  "data/tweet-nytimes/2021/11/1460952138041933829.json": "“It means that my house is a safe place for migrants to ask for help.”\n\nSome residents in a Polish town near the Belarus border, where migrants have been stuck in dire conditions, are using green lights to signal their willingness to offer aid.\nhttps://t.co/P8FGgfcd49 https://t.co/pgEwuOJWDT",
  "data/tweet-nytimes/2021/11/1460991399315320842.json": "Breaking News: President Biden asked the Federal Trade Commission to investigate if oil companies are illegally driving up gas prices, his latest effort to lower prices at the pump.\nhttps://t.co/GT7E1IMgth",
  "data/tweet-nytimes/2021/11/1460986935707590665.json": "Breaking News: Over 100,000 people in the U.S. died of drug overdoses as the pandemic spread, surpassing the toll of gun violence and car crashes combined. The nearly 30% rise in deaths last year was fueled by the use of fentanyl. https://t.co/6SFgqhZcmo",
  "data/tweet-nytimes/2021/11/1460748291864465415.json": "Hundreds of migrants, marooned in freezing weather on the Belarus side of the Poland-Belarus border, tried to rush into Poland. Polish border forces used water cannons and tear gas to drive them back. https://t.co/LjgwVUuAMv https://t.co/phExTyxW69",
  "data/tweet-nytimes/2021/11/1461018294429884426.json": "Breaking News: Two of the men found guilty of the assassination of Malcolm X are expected to have their convictions thrown out, validating long-held doubts about who killed the civil rights leader. https://t.co/SwkXOS5rlE",
  "data/tweet-nytimes/2021/11/1461025848950235141.json": "Breaking News: Jacob Chansley, known as the QAnon Shaman, was sentenced to 41 months in prison for his role in the Capitol riot. https://t.co/40Jh8FSlE2",
  "data/tweet-nytimes/2021/11/1460963472016031756.json": "Adele breaks nearly every unwritten rule for modern pop stars, producing headline-grabbing hits after years of near silence.\n\nHer new album, “30,” lands on Friday, and is all but assured to be another blockbuster.\nhttps://t.co/eVcJArCorE",
  "data/tweet-nytimes/2021/11/1461056627453345792.json": "As jurors deliberated in the homicide trial of Kyle Rittenhouse, the police asked one of his supporters carrying a rifle outside the courthouse to put it away over concerns that it could make the crowd anxious. https://t.co/xMVeFx0khY",
  "data/tweet-nytimes/2021/11/1461009168190554119.json": "House Democrats will move to censure Rep. Paul Gosar for posting an animated video depicting him killing Rep. Alexandria Ocasio-Cortez and assaulting President Biden. It's the most severe punishment the House can mete out short of expulsion. https://t.co/ogrRZwpuHX",
  "data/tweet-nytimes/2021/11/1460929488372568070.json": "Inflation in Britain rose to 4.2% in October from a year earlier, its highest level in nearly a decade after soaring energy prices hit household bills.\nhttps://t.co/0gFV7ZfJSQ",
  "data/tweet-nytimes/2021/11/1461095206669930497.json": "The House censured Rep. Paul Gosar for posting an animated video depicting him killing Rep. Alexandria Ocasio-Cortez. The Arizona Republican is the first member of the House to be formally rebuked in more than a decade. https://t.co/XqFt5DeoUd",
  "data/tweet-nytimes/2021/11/1460997433668911109.json": "This miso-ginger sauce is so good on so many things. For a vegetarian Thanksgiving side, spoon it over steamed sweet potatoes that have been pan-grilled until their natural sugars caramelize and turn golden. https://t.co/uhqGmO4aCm https://t.co/XQVwjSnpQk",
  "data/tweet-nytimes/2021/11/1461099389796167687.json": "Disney Cruise Line updated its immunization policy for guests on Wednesday, requiring all children over the age of 5 to be fully vaccinated against the coronavirus. The vaccine mandate will go into effect on Jan. 13. https://t.co/9QxUhvJ78h",
  "data/tweet-nytimes/2021/11/1461129554492370950.json": "In a 223-to-207 vote, the House removed Rep. Paul Gosar, Republican of Arizona, from two committees for posting an animated video that depicted him killing Rep. Alexandria Ocasio-Cortez and assaulting President Biden. https://t.co/NHgd9HmOgX https://t.co/JVucjdhI3o",
  "data/tweet-nytimes/2021/11/1461070396816564224.json": "Priscilla Giddings, an Idaho lawmaker who shared the personal information of a 19-year-old student intern online after the teenager accused another lawmaker of rape, was formally censured by the Idaho House of Representatives. https://t.co/2BadG6F4Xw",
  "data/tweet-nytimes/2021/11/1461115441313636356.json": "Hundreds of students walked out of schools and activists demonstrated at the State Capitol in Oklahoma, urging Gov. Kevin Stitt to commute the sentence of Julius Jones, who is scheduled for execution on Thursday. https://t.co/BsnzNptxwA",
  "data/tweet-nytimes/2021/11/1461169808263757825.json": "Apple says it will soon provide parts, tools and manuals to anyone who wants to fix an iPhone or a Mac. https://t.co/25fVuU1oa9",
  "data/tweet-nytimes/2021/11/1461096036223569925.json": "Breaking News: Young Dolph, a Memphis rapper who emerged as one of hip-hop’s most promising new stars, was killed Wednesday in a shooting in his hometown. He was 36. https://t.co/4VGfvbz9Zd https://t.co/LjJT90XRRH",
  "data/tweet-nytimes/2021/11/1460979818078613507.json": "At least 87 children died at a government-run boarding school for Native Americans in Nebraska that closed in 1934, researchers confirmed using records and newspaper clippings. The true toll is probably much higher, they say.\nhttps://t.co/55hDkj0ydU",
  "data/tweet-nytimes/2021/11/1461314515895783430.json": "Peng Shuai, a Chinese tennis star, said she was sexually assaulted by a former vice premier. Then she disappeared from public view. China's authorities had hoped the repressive state could make the whole thing go away — but the tennis world is outraged. https://t.co/mjTwU9I4NG",
  "data/tweet-nytimes/2021/11/1461272989635383301.json": "An unofficial network of Polish people are banding together to help migrants who survived the crossing from Belarus. Some are putting green lights in their windows to signal that their homes are safe places and leaving aid packages in the freezing forest. https://t.co/5Gyo5IfzCq https://t.co/opy5laX8P6",
  "data/tweet-nytimes/2021/11/1461182397404389384.json": "When Clarence Gailyard did not lie on the ground quickly, because he has metal rods and pins in his leg and hip, a police officer stomped on the back of his head. Gailyard will now receive $650,000 from Orangeburg, South Carolina, the city announced. https://t.co/aTlmkOYPr0",
  "data/tweet-nytimes/2021/11/1461340940724051973.json": "Christopher Belter pleaded guilty to sexual attacks on four teenage girls. The attacks occurred at his family’s New York home when he was a student at an elite private school.\n\nHe faced up to eight years in prison. He received eight years’ probation.\nhttps://t.co/RGrZi2rr5U",
  "data/tweet-nytimes/2021/11/1461352253306982404.json": "Dave Frishberg, a gifted jazz musician who wrote the song “I’m Just a Bill” for “Schoolhouse Rock!,” died on Wednesday. He was 88.\nhttps://t.co/Nz9ZjBqhRS",
  "data/tweet-nytimes/2021/11/1461402641578274819.json": "Breaking News: Hours before his scheduled execution, the death-row inmate Julius Jones had his sentence commuted by Oklahoma’s governor. https://t.co/6dUZKRXGpv",
  "data/tweet-nytimes/2021/11/1461142132673163268.json": "These mashed potatoes may be the simplest Thanksgiving side there is. \nhttps://t.co/eSZkaXqEnI https://t.co/zS9N21dlXg",
  "data/tweet-nytimes/2021/11/1461365343520112652.json": "\"I can’t believe this is even happening in the 21st century.\"\n\"Shocking.\"\n\"Censorship is never OK at any cost.\"\n\nSome of the world’s best-known tennis players are drawing public attention to Peng Shuai's disappearance. https://t.co/xilnTLFpX9",
  "data/tweet-nytimes/2021/11/1461410183087898632.json": "Breaking News: The first known Covid patient was a vendor at a Wuhan market, a new report claims. The finding may revive debate over how the pandemic began.\nhttps://t.co/T9RKSO5vp1",
  "data/tweet-nytimes/2021/11/1461406373640642564.json": "The judge in the Kyle Rittenhouse trial banned MSNBC from the courthouse after saying a producer followed a bus carrying jurors home from the courthouse on Wednesday. NBC News said he was a freelancer and \"never contacted or intended to contact\" jurors. https://t.co/VDcHQqkCdF",
  "data/tweet-nytimes/2021/11/1461442884960403464.json": "Muhammad Aziz, one of two men wrongfully convicted of the murder of Malcolm X, said the decision to throw out the verdict against him 56 years after the assassination could not eliminate the decades he had lost. https://t.co/37Xdi6eqcM https://t.co/8qob6Ao2Qw",
  "data/tweet-nytimes/2021/11/1461464269262888965.json": "Muhammad Aziz, one of two men wrongfully convicted of the murder of Malcolm X, said the decision to throw out the verdict against him 56 years after the assassination could not eliminate the decades he had lost. https://t.co/7FkmmQ6r74 https://t.co/Ejc5JEwibL",
  "data/tweet-nytimes/2021/11/1461212603502505985.json": "\"I told myself: I cannot solve the bigger problem,\" said one man near the Poland-Belarus border who was moved to help after hearing migrants had died in the cold. \"I leave it to the United Nations, NATO and the government. But no one will die in my forest.\"https://t.co/r7OYBo6s7p",
  "data/tweet-nytimes/2021/11/1461459324459536386.json": "Two men wrongfully convicted of assassinating Malcolm X were exonerated on Thursday. Prosecutors said that J. Edgar Hoover, the FBI's longtime director, gave orders that led \"multiple witnesses\" to conceal their roles as informants. https://t.co/W4lZnj3vVP https://t.co/UTBep5Ey0x",
  "data/tweet-nytimes/2021/11/1461534716562128904.json": "The secretary of the Army issued a memo warning the hundreds of thousands of soldiers in its National Guard that if they decline to get vaccinated against the coronavirus, they may not be renewed in the guard.\nhttps://t.co/pmehbv1jYs",
  "data/tweet-nytimes/2021/11/1461386258685607940.json": "Friday's lunar eclipse could give you a chance to witness a celestial phenomenon not seen since the 1440s.\n\nThe moon is set to crawl into Earth’s shadow for just over six hours, the longest lasting partial lunar eclipse in 580 years. Here's how to watch. https://t.co/78W3ixZpJU",
  "data/tweet-nytimes/2021/11/1461625313125875715.json": "The items that have been used to protect people from Covid are winding up in waterways and on streets around the world. Governments, businesses and environmentalists are now struggling to clean it all up. https://t.co/gWT6c7ZOJp https://t.co/g1OaSr2O7P",
  "data/tweet-nytimes/2021/11/1461636139996041225.json": "Breaking News: Austria will go into a nationwide lockdown on Monday. It also plans to impose a national Covid vaccine mandate, Europe’s first.\nhttps://t.co/jAhNYMOpf9",
  "data/tweet-nytimes/2021/11/1461469287349211147.json": "Crowds of supporters cheered Gov. Kevin Stitt's decision to call off the execution of Julius Jones, a death-row inmate, just hours before he was to be put to death. Jones was convicted of first-degree murder and sentenced to death in 2002. https://t.co/tVFkVlRkYC https://t.co/HAURunI1Ul",
  "data/tweet-nytimes/2021/11/1461684446013411332.json": "Republicans in Wisconsin are engaged in an all-out assault on the state’s election system, pressing to give themselves full control over voting in the state. GOP officials want to eliminate a bipartisan elections agency — and maybe send its members to jail.https://t.co/6lwuIS7tYT",
  "data/tweet-nytimes/2021/11/1461574990860591108.json": "Friday's lunar eclipse could give you a chance to witness a celestial phenomenon not seen since the 1440s.\n\nThe moon is set to crawl into Earth’s shadow for just over six hours, the longest lasting partial lunar eclipse in 580 years. Here's how to watch. https://t.co/4Yia8q0eTJ",
  "data/tweet-nytimes/2021/11/1461690761846702080.json": "Breaking News: The FDA authorized Moderna and Pfizer boosters for all adults. If the CDC agrees, it would open up eligibility to tens of millions more fully vaccinated Americans as soon as this weekend.\nhttps://t.co/yapWJ7t1Df",
  "data/tweet-nytimes/2021/11/1461710440472453122.json": "Breaking News: The House narrowly passed President Biden’s $1.85 trillion social safety net and climate bill. It faces a long road in the 50-50 Senate.\nhttps://t.co/VpIvfDriy7",
  "data/tweet-nytimes/2021/11/1461761536406560778.json": "Breaking News: Kyle Rittenhouse was found not guilty of homicide and other charges. He shot three people, two fatally, on a night of protests in Kenosha, Wisconsin, and his case ignited a debate over gun rights and self-defense. https://t.co/dtXvuN6Yay",
  "data/tweet-nytimes/2021/11/1461363597511053329.json": "Christopher Belter pleaded guilty in the sexual assaults of four teens. He faced eight years in prison but was sentenced to probation. \"It seems to me that a sentence that involves incarceration or partial incarceration isn’t appropriate,\" the judge said. https://t.co/i248BADlHt",
  "data/tweet-nytimes/2021/11/1461766011590426632.json": "Kyle Rittenhouse, who fatally shot two men and wounded another, was found not guilty of intentional homicide and four other felony charges in a deeply divisive case that fed a national debate over vigilantism, gun rights and the definition of self-defense. https://t.co/5MDh8OyguO https://t.co/8kz9duMhyQ",
  "data/tweet-nytimes/2021/11/1461702068394237969.json": "The FDA authorized Moderna and Pfizer boosters for all adults. If the CDC agrees, it would open up eligibility to tens of millions more fully vaccinated Americans.\n\nhttps://t.co/rrPD744Jth https://t.co/bnqywKcwWx",
  "data/tweet-nytimes/2021/11/1461776622789533702.json": "Kyle Rittenhouse, who fatally shot two men and wounded another in Kenosha, Wisconsin last year, was found not guilty of homicide and four other charges on Friday. https://t.co/u3ESHXMlHB https://t.co/YtcQTG2fJU",
  "data/tweet-nytimes/2021/11/1461786801455128593.json": "Joseph Rosenbaum's fiancee, Anthony Huber's great-aunt and Anthony Huber's girlfriend — the family members of the men Kyle Rittenhouse killed – listened as the not-guilty verdicts were announced. https://t.co/rdbC6CZVLy https://t.co/3ze4eXk6yi",
  "data/tweet-nytimes/2021/11/1461797714107187205.json": "The parents of Anthony Huber, one of the people killed by Kyle Rittenhouse, released a statement on Friday after Rittenhouse was found not guilty on five counts. https://t.co/a7RCRk4w8z https://t.co/3JqbcAEn4I",
  "data/tweet-nytimes/2021/11/1461827901985284099.json": "An investigation by the New York State Assembly Judiciary Committee found that former Gov. Andrew Cuomo's administration \"materially misrepresented\" the extent of deaths that occurred in nursing homes in the early months of the pandemic.\nhttps://t.co/PUS8hmSQnq",
  "data/tweet-nytimes/2021/11/1461856841646944259.json": "President Biden on Friday nominated two new members to the U.S. Postal Service’s board of governors, a move that could jeopardize Louis DeJoy’s position as postmaster general. https://t.co/qK9MdHsuDm",
  "data/tweet-nytimes/2021/11/1461742581474381831.json": "“Even as she sings about desperation and uncertainty, on ‘30’ Adele’s voice is more supple and purposeful than ever,” our critic @JonPareles writes of the star's new album. “It’s awash in regrets, but decisive; it’s high drama and a musical tour de force.” https://t.co/rvVbuAdepX",
  "data/tweet-nytimes/2021/11/1461907196543963136.json": "The Australian Open will require players to be fully vaccinated against the coronavirus. It is the first Grand Slam tennis tournament to do so. https://t.co/HrHtyOxLOF",
  "data/tweet-nytimes/2021/11/1461820357183254528.json": "President Biden's social safety net and climate bill — which the House passed on Friday — includes the largest expenditures ever made by the federal government to slow global warming. Here are some of the key programs. https://t.co/iPa2o3ZkXc https://t.co/6qD0rjtsSK",
  "data/tweet-nytimes/2021/11/1461892089235611650.json": "For legal scholars, the acquittal of Kyle Rittenhouse was not a surprise. Many state laws make it difficult to prosecute those who say they acted in self defense. https://t.co/858yZNtScO",
  "data/tweet-nytimes/2021/11/1462055640315187201.json": "The Australian Open will require players to be fully vaccinated against the coronavirus. It is the first Grand Slam tennis tournament to do so. https://t.co/DIdmb0dtiK",
  "data/tweet-nytimes/2021/11/1462060681746866184.json": "This miso-ginger sauce is so good on so many things. For a vegetarian Thanksgiving side, spoon it over steamed sweet potatoes that have been pan-grilled until their natural sugars caramelize and turn golden. https://t.co/P7gbdyXGXx https://t.co/vR2NYAz0D1",
  "data/tweet-nytimes/2021/11/1462079548808433666.json": "About 3 percent of cancer cases in the U.S. each year could be prevented by walking for about 45 minutes a day, according to a new study of inactivity, exercise and malignancies.\nhttps://t.co/AC8rZsNZf9",
  "data/tweet-nytimes/2021/11/1461938377712881664.json": "A former university professor has been indicted on charges that he set four wildfires in national forests while on an \"arson spree\" in California this summer, prosecutors said. https://t.co/csFekcPopP",
  "data/tweet-nytimes/2021/11/1462101053500018689.json": "Roundabouts are safer. They're greener. They save hours idling at stoplights. And few U.S. cities know this better than Carmel, Indiana — which has 140 of them. https://t.co/yQ78GyIfA5 https://t.co/J03XdfwZMf",
  "data/tweet-nytimes/2021/11/1462153800635060230.json": "The items that have been used to protect people from Covid are winding up in waterways and on streets around the world. Governments, businesses and environmentalists are now struggling to clean it all up. https://t.co/aaJb0RRcUF https://t.co/3IU7l4kK9v",
  "data/tweet-nytimes/2021/11/1462152528095817743.json": "President Biden on Friday nominated two new members to the U.S. Postal Service’s board of governors, a move that could jeopardize Louis DeJoy’s position as postmaster general. https://t.co/laQiaXDQzn",
  "data/tweet-nytimes/2021/11/1462105972483182596.json": "A combination of two potato dishes in one, this Thanksgiving side dish has been engineered to give you both creamy potato and singed edge in each bite. https://t.co/pY6m9EXSfn https://t.co/VEEBKLlZG7",
  "data/tweet-nytimes/2021/11/1462178465508167684.json": "A Missouri police detective has been found guilty in the death of a Black man who was fatally shot in 2019 as he sat in a pickup truck outside his home. \nhttps://t.co/qFRbe2YJfl",
  "data/tweet-nytimes/2021/11/1462129882977157120.json": "Analysis: The Rittenhouse trial involved issues of race and self-defense, but it also highlighted the growing presence of guns on America’s streets and the failure of efforts to come up with even modest new gun restrictions.\nhttps://t.co/T8yQmdfKPz",
  "data/tweet-nytimes/2021/11/1462209991688007682.json": "Breaking News: China’s state media shared what it claimed to be recent video of Peng Shuai, a tennis star who vanished after accusing a top leader of sexual assault. But the videos are unverified and they raised questions about her safety.\n\nhttps://t.co/RSR7WpLc52",
  "data/tweet-nytimes/2021/11/1462067182532243461.json": "The quest for the Democratic Republic of Congo's cobalt, which is essential to making electric car batteries, shows how the clean energy revolution is caught up in gamesmanship, greed and exploitation, a Times investigation found. https://t.co/Ws9Bi3dtGb",
  "data/tweet-nytimes/2021/11/1462124848243695616.json": "Speaker Nancy Pelosi’s pivotal role in the House passage of the social policy bill reached far beyond the House and into the Senate where she engaged in quiet talks with Senators Joe Manchin and Kyrsten Sinema. https://t.co/jqltGe5LyS",
  "data/tweet-nytimes/2021/11/1462333230523326467.json": "Among childless adults in the United States surveyed by Morning Consult last year, one in four cited climate change as a factor in why they do not currently have children.\nhttps://t.co/mvDnoE3EtA",
  "data/tweet-nytimes/2021/11/1462448237751771149.json": "A blackout within China on discussion of the tennis star Peng Shuai’s #MeToo allegations has not been able to silence a global chorus of concern for her safety. https://t.co/IgeYEJVFYO",
  "data/tweet-nytimes/2021/11/1462075782021488649.json": "Yes, the Velveeta is necessary here. https://t.co/lmZ566BHgN https://t.co/Dmbh86oYjq",
  "data/tweet-nytimes/2021/11/1462418025525784582.json": "\"There’s nothing that can return to me what I lost,\" said Sheneen McClain, the mother of Elijah McClain, after the family agreed to a $15 million settlement in the 2019 death of her son after the police officers restrained him using a chokehold. https://t.co/PMoIQ8qm7F",
  "data/tweet-nytimes/2021/11/1462458316127416324.json": "Senators Kyrsten Sinema and Joe Manchin, both Democrats who have been major impediments to the passage of the White House’s social and climate policy bills, are winning financial support from Republican donors and business executives. https://t.co/WraPCs378d",
  "data/tweet-nytimes/2021/11/1462555929833095173.json": "Two Fox News contributors who were both stars of the pre-Trump conservative movement, Jonah Goldberg and Stephen Hayes, resigned from the network in protest of Tucker Carlson's Jan. 6 special. https://t.co/OcmLEU6PuI",
  "data/tweet-nytimes/2021/11/1462511207777198080.json": "A Times investigation examined the global demand for the raw materials that power electric cars. Our reporting drew on interviews with more than 100 people on three continents and thousands of documents. Here are some of the key findings. https://t.co/Uy2FVqDq86",
  "data/tweet-nytimes/2021/11/1462423065493708806.json": "Make these tangy and sweet two-toned lemon bars ahead of Thanksgiving — they’ll keep in the refrigerator for up to five days. https://t.co/za7OXKQ5n5 https://t.co/zjt3itPDwV",
  "data/tweet-nytimes/2021/11/1462523731302129676.json": "The House on Friday passed a sprawling, roughly $2 trillion social policy, climate and tax measure that is the central pillar of President Biden’s domestic agenda. Here's a look at what's inside: https://t.co/jGzxnfnphT https://t.co/oF7Uhk8wWI",
  "data/tweet-nytimes/2021/11/1462608123160580099.json": "Breaking News: Multiple people were killed when the driver of an SUV plowed into more than 20 people at a holiday parade in Waukesha, Wisconsin, officials said. https://t.co/vJPf4RSRol",
  "data/tweet-nytimes/2021/11/1462443212145147915.json": "To minimize kitchen time when making this Thanksgiving dessert, make it in stages: Prepare the crust and curd a day or two in advance. The finished tart keeps well for a couple of days too. https://t.co/d9Xr2eKFN7 https://t.co/P7uuJbOLT2",
  "data/tweet-nytimes/2021/11/1462453326830841861.json": "\"The worst and most vulnerable position we could be in is to over-promise and under-deliver,\" Rep. Alexandria Ocasio-Cortez said about where the Democratic party stands. \"We are up against political nihilism.\"\n\nRead her interview with @AsteadWesley. https://t.co/SfA1qhPnUq",
  "data/tweet-nytimes/2021/11/1462053128510001160.json": "What’s your secret to the best mashed potatoes? Readers shared their tried-and-true methods in the comments. Join the conversation.",
  "data/tweet-nytimes/2021/11/1462533813540642817.json": "\"In the last six months, B.C. has both burned and drowned,\" the executive director of a climate program at Simon Fraser University in Vancouver said. \"So there’s really no greater evidence of climate change right now than here in British Columbia.\" https://t.co/CtLE4H0z8Y",
  "data/tweet-nytimes/2021/11/1462575340468019210.json": "Kyle Rittenhouse's acquittal has reinvigorated support on the right for armed responses to racial justice protests. https://t.co/vySV65CitA",
  "data/tweet-nytimes/2021/11/1462811881886961665.json": "Target stores will close for Thanksgiving Day this year and every year moving forward, the retailer announced on Monday.\n\n\"What started as a temporary measure driven by the pandemic is now our new standard,\" ​said Target’s chief executive in a statement. https://t.co/Q0B0ZFIwxN",
  "data/tweet-nytimes/2021/11/1462803649709621251.json": "Breaking News: An investigation of former Gov. Andrew Cuomo by the New York State Assembly found “overwhelming evidence” that he engaged in sexual harassment. It also found that he used state workers and public resources to write and promote his memoir.\nhttps://t.co/kV6N9ZSHoo",
  "data/tweet-nytimes/2021/11/1462830737644736513.json": "Jeff Bezos is donating $100 million to Barack Obama’s private foundation — its largest gift yet. In return for the donation, Bezos asked that a plaza at the Obama Presidential Center be named for the late civil rights leader John Lewis. https://t.co/WcnMQJ8787",
  "data/tweet-nytimes/2021/11/1462835804741513222.json": "Target stores will close for Thanksgiving Day this year and every year moving forward, the retailer announced on Monday.\n\nHow do you feel about the announcement? Share your thoughts in the comments of the article. https://t.co/57MPaX41ZK https://t.co/8D0Zp5v8G5",
  "data/tweet-nytimes/2021/11/1462850912951713796.json": "A minimum wage of $15 per hour for federal contractors will take effect on Jan. 30, 2022, the Labor Department announced on Monday. The rule will provide a likely wage increase for over 300,000 workers, according to administration estimates. https://t.co/NdgBgfmhI4",
  "data/tweet-nytimes/2021/11/1462884950001258503.json": "The prosecutor in the Ahmaud Arbery trial argued in her closing arguments that the three white men accused of murdering him cannot claim self-defense because they were \"the initial unjustified aggressors.\"\n\nFollow our coverage of the trial. https://t.co/P8ZRxl13JU https://t.co/aDpU3zZZhP",
  "data/tweet-nytimes/2021/11/1462883592762269698.json": "Roundabouts are safer. They're greener. They save hours idling at stoplights. And few U.S. cities know this better than Carmel, Indiana — which has 140 of them. https://t.co/anEBWdAU4y https://t.co/RRm7InZxaf",
  "data/tweet-nytimes/2021/11/1462896216312844292.json": "Four Black men, known as the Groveland Four, who were wrongly charged with raping a white woman more than 70 years ago in Florida were exonerated on Monday, bringing an end to a saga that has shadowed their families for decades. https://t.co/buNyVKU8tw",
  "data/tweet-nytimes/2021/11/1462860949770182663.json": "A prosecutor in the Ahmaud Arbery trial argued to the jury — for the first time — that Mr. Arbery was attacked because he was Black. Watch live. https://t.co/Ag7WOEri4Q https://t.co/qtUIL4uQFU",
  "data/tweet-nytimes/2021/11/1462891087731859467.json": "Sean Parnell, a GOP candidate for Senate from Pennsylvania who Donald Trump endorsed, suspended his campaign after a judge ruled his estranged wife should get custody of their three children in a case in which she accused him of spousal and child abuse. https://t.co/qaAYqhKRBb",
  "data/tweet-nytimes/2021/11/1462951040504979460.json": "Breaking News: The Justice Department will pay about $130 million to Parkland shooting victims over the FBI’s failure to act on tips involving the gunman. https://t.co/caIM0tjn9i",
  "data/tweet-nytimes/2021/11/1462928914955833346.json": "The lead prosecutor in Ahmaud Arbery's murder trial said in closing arguments that the defendants had no right to pursue Arbery. \"They made their decision to attack Ahmaud Arbery,\" she said, \"because he was a Black man running down the street.\" https://t.co/RzVPliwFSp",
  "data/tweet-nytimes/2021/11/1462863470509105160.json": "A minimum wage of $15 per hour for federal contractors will take effect on Jan. 30, 2022, the Labor Department announced on Monday. The rule will provide a likely wage increase for over 300,000 workers, according to administration estimates. https://t.co/AkCjIeP4Im https://t.co/GfinzZz9IZ",
  "data/tweet-nytimes/2021/11/1462888662291648513.json": "Hundreds of British customers waited in line for hours for their first taste of Popeyes at an East London food court on Saturday. \"It looks like a scone,” one customer said after trying a biscuit, \"but it doesn’t taste like one.\" https://t.co/3o8UAXxW62",
  "data/tweet-nytimes/2021/11/1462974193239302145.json": "Breaking News: Chun Doo-hwan, South Korea’s most vilified former military dictator, has died. He was 90.\nhttps://t.co/JpG65ZPNgq",
  "data/tweet-nytimes/2021/11/1463047190583156736.json": "\"The Chinese government has become extremely effective in controlling what the country’s 1.4 billion people think and talk about,\" Li Yuan writes.\n\n\"But influencing the rest of the world is a different matter, as Peng Shuai has aptly demonstrated.\" https://t.co/0WS8GpIymQ",
  "data/tweet-nytimes/2021/11/1462913812911341568.json": "Aging makes us all weak in the knees. But it doesn’t have to be that way.\n\nHere's how you can keep your knees healthy for running, skiing or just going up the stairs. https://t.co/LZ9rLhofZG",
  "data/tweet-nytimes/2021/11/1463073601893064712.json": "Hundreds of British customers waited in line for hours for their first taste of Popeyes at an East London food court on Saturday. \"It looks like a scone,\" one customer said after trying a biscuit, \"but it doesn’t taste like one.\" https://t.co/l3T4Efs4nL",
  "data/tweet-nytimes/2021/11/1463173169330761747.json": "\"You can’t start something and claim self-defense.\"\n\nIn their final arguments on Tuesday, prosecutors sought to portray the three men on trial in the killing of Ahmaud Arbery as aggressors who chased and cornered Arbery. https://t.co/q7WjQ24c5i",
  "data/tweet-nytimes/2021/11/1463178665735434243.json": "All three men accused of murdering Ahmaud Arbery will face hate-crime charges in federal court in February, regardless of the jury's verdict in the state of Georgia's prosecution. https://t.co/ddEPFphKR2",
  "data/tweet-nytimes/2021/11/1463207005385019402.json": "Jay-Z has become the most nominated artist in Grammy history. He had been tied with Quincy Jones for 80 nods, but with this year's ballot, he has a total of 83 nominations. Jay-Z has won 23 Grammys in his career so far. https://t.co/NEBzOFZFaO https://t.co/zmbePC5EzA",
  "data/tweet-nytimes/2021/11/1463126466921644038.json": "Covid cases in children in the U.S. have risen by 32% from about two weeks ago, according to the American Academy of Pediatrics and the Children’s Hospital Association. The spike comes as the country rushes to inoculate children ahead of the holidays.\nhttps://t.co/kZhOxRFqel",
  "data/tweet-nytimes/2021/11/1463225880176742411.json": "Breaking News: CVS Health, Walmart and Walgreens helped perpetuate the opioid crisis, a jury found, the first time retailers were held accountable. https://t.co/NXc5OazCll",
  "data/tweet-nytimes/2021/11/1463238346122186755.json": "Breaking News: Jurors found planners of the far-right rally in Charlottesville, Virginia, in 2017 liable for $25 million in damages, but deadlocked on federal charges. https://t.co/57Qf1ZlGEm",
  "data/tweet-nytimes/2021/11/1463183364484214790.json": "Exclusive: Newly obtained jail records do not support the conspiracy theory that Jeffrey Epstein’s death was not a suicide.\n\nThey provide the most detailed look yet at his final days — and show mistake after mistake made by jail officials. https://t.co/8xyaUnnEQQ https://t.co/HNi0z3ABiZ",
  "data/tweet-nytimes/2021/11/1463307654516854787.json": "A man was held in a psychiatric hospital for more than two years after a police officer mistook him for someone else. Now, more than a year after his release, he's suing the state of Hawaii. https://t.co/fzTY24p8gn",
  "data/tweet-nytimes/2021/11/1462996848814301189.json": "Lemon bars with a Thanksgiving stripe of cranberry jam can be tangy and sweet single-serving alternatives for a whole pie. https://t.co/25DtLMCKpK https://t.co/xtmAIvPsip",
  "data/tweet-nytimes/2021/11/1463330326529417220.json": "More people in the U.S. have died from Covid this year than last, according to the CDC. The higher death toll is attributed to lower-than-needed vaccination rates, the relaxation of everyday precautions and the rise of the highly contagious Delta variant. https://t.co/QCeVh8mSNa",
  "data/tweet-nytimes/2021/11/1463245325926346764.json": "Many U.S. retail giants have decided to close on Thanksgiving, citing safety concerns and gratitude for their employees.\n\nHere’s what some stores are planning for Thursday. https://t.co/wYLIY53MRY https://t.co/kAzc3LN1DP",
  "data/tweet-nytimes/2021/11/1463318987526348802.json": "New York City paid a nonprofit homeless shelter in the Bronx more than $10 million to house and feed families.\n\nThe shelter's executive director has now admitted that the money went to her gym membership, car payments and luxury retail shopping sprees. https://t.co/nOEnlCLhcf",
  "data/tweet-nytimes/2021/11/1463356734089617408.json": "After spending more than 43 years in prison, Kevin Strickland, 62, was exonerated for a 1978 triple murder in Kansas City after a judge ruled that there was no physical evidence tying him to the crimes. https://t.co/JhlqzSEWEQ",
  "data/tweet-nytimes/2021/11/1463204838314024962.json": "Breaking News: Jon Batiste leads all nominees for the 64th Grammy Awards with 11 nods, including best album and record of the year. Other nominees include Lil Nas X, Justin Bieber, Olivia Rodrigo, Doja Cat, Billie Eilish, Taylor Swift and Kanye West. https://t.co/oMa85NETN8",
  "data/tweet-nytimes/2021/11/1463277453447770118.json": "NASA is about to launch a spacecraft with one simple mission: Smash into an asteroid at 15,000 miles per hour. The test come in handy if space agencies ever need to deflect an astroid on a collision course with Earth.\n\nHere's how to watch live. https://t.co/OicBp1oUjX",
  "data/tweet-nytimes/2021/11/1463447336412229635.json": "No artist has explored the contradictions of humanity as sympathetically and critically as Hayao Miyazaki, the Japanese animation legend who co-founded Studio Ghibli. Now, at 80, he’s coming out of retirement with another movie. https://t.co/WcUKFFoIbK",
  "data/tweet-nytimes/2021/11/1463463815924916227.json": "Breaking News: Germany will have a center-left government led by Olaf Scholz, a Social Democrat, who will replace longtime Chancellor Angela Merkel. https://t.co/Egvpq2gUc5",
  "data/tweet-nytimes/2021/11/1463498901542121474.json": "Lisa, a global megastar who is part of the K-pop group Blackpink, tested positive for Covid-19, her production company said. The other members were not listed as close contacts but were awaiting results of a PCR test.\nhttps://t.co/A5jgERxdEd",
  "data/tweet-nytimes/2021/11/1463374430621650945.json": "President Biden plans to nominate Shalanda Young, the acting director of the Office of Management and Budget, to permanently lead the agency.\n\nShe would be the first Black woman to hold the post on a permanent basis. https://t.co/yIBu5ZWAAx",
  "data/tweet-nytimes/2021/11/1463122701057409024.json": "Only about 10 vaquitas are left on Earth. Whether the shy species of porpoise is wiped out by illegal fishing depends largely on the Mexican government.\nhttps://t.co/cGYrB8tDhp",
  "data/tweet-nytimes/2021/11/1463371840131321861.json": "Ian Fishback, an Army whistle-blower whose allegations that fellow members of the 82nd Airborne Division in Iraq routinely beat and abused prisoners prompted the Senate to approve anti-torture legislation in 2005, has died at 42. https://t.co/wDtSBkQeJZ",
  "data/tweet-nytimes/2021/11/1463296327295590402.json": "President Biden on Tuesday announced the release of 50 million barrels of crude oil from the Strategic Petroleum Reserve in an attempt to drive down rising gas prices that have angered consumers.\nhttps://t.co/EN1LKoXiGx https://t.co/NHJ4UiY0qz",
  "data/tweet-nytimes/2021/11/1463481309465137159.json": "The actors Steve Burton and Ingo Rademacher left the popular U.S. soap opera “General Hospital” after declining to comply with an on-set Covid vaccination mandate, which took effect on Nov. 1. https://t.co/hCdy3bWaB3",
  "data/tweet-nytimes/2021/11/1463580209169551365.json": "Breaking News: Jurors found three white men — Travis McMichael, his father Gregory McMichael and their neighbor William Bryan — guilty of murdering Ahmaud Arbery, a Black man who was out jogging. The three also face federal hate-crime charges. https://t.co/YvAs315lLy",
  "data/tweet-nytimes/2021/11/1463303883346911244.json": "In her closing arguments, the lead prosecutor in the Ahmaud Arbery trial urged jurors to find the three men accused of murdering him guilty and hold them responsible for their actions. https://t.co/XXpRF43CTf https://t.co/QViVpBBO7F",
  "data/tweet-nytimes/2021/11/1463591483366330371.json": "\"I never thought this day would come, but God is good,\" Ahmaud Arbery's mother, Wanda Cooper-Jones, said after the verdict. \"Thank you — thank you for those who marched, those who prayed.\" https://t.co/lQPUegl3fw https://t.co/5ApFjtCzpG",
  "data/tweet-nytimes/2021/11/1463412870671212545.json": "Breaking News: NASA launched a spacecraft that will crash into an asteroid, the biggest test yet of the agency’s role as planetary defender. https://t.co/vxGzRnbuVY",
  "data/tweet-nytimes/2021/11/1463510241308467201.json": "Angela Merkel will leave office just days short of the record for Germany’s longest-serving chancellor. After 16 years in the country’s top job, she has left many wondering what she might do next. https://t.co/JDC1vSy9T5",
  "data/tweet-nytimes/2021/11/1463598338004168707.json": "Stella Creasy, a Labour member of Britain’s Parliament, was reprimanded for attending a debate with her infant son in tow, evidently in violation of House of Commons rules. \"Still no rule on wearing masks btw,\" she responded on Twitter. https://t.co/Pyc244rib3 https://t.co/lmPY822ZMw",
  "data/tweet-nytimes/2021/11/1463617191136436224.json": "The new German government has agreed on an issue Chancellor Angela Merkel’s party blocked for years: Legalizing marijuana. https://t.co/iSIPGLBBX3",
  "data/tweet-nytimes/2021/11/1463613414849527808.json": "All three defendants were found guilty of murder and other charges on Wednesday for the pursuit and fatal shooting of Ahmaud Arbery. They face up to life in prison. https://t.co/TNHbIu0mfz https://t.co/VKD4J0PzWo",
  "data/tweet-nytimes/2021/11/1463571892804145164.json": "Uri Bassan traveled all over New Mexico bringing vaccinations to people. Now with booster shots and vaccines for children, he and his team are setting out again to meet demand for vaccines that is overwhelming the state's distribution infrastructure. https://t.co/AvadxadxgG https://t.co/LntObqigq7",
  "data/tweet-nytimes/2021/11/1463638587539402760.json": "Ahmaud Arbery's parents, joined by the Rev. Al Sharpton and the civil rights lawyer Ben Crump, expressed their gratitude after Wednesday's verdicts.\n\n\"I never thought this day would come, but God is good,\" Arbery's mother, Wanda Cooper-Jones, said. https://t.co/nLIpseedNV https://t.co/veyBjzEDKY",
  "data/tweet-nytimes/2021/11/1463643656632647691.json": "Three white men were found guilty of murder and other charges on Wednesday for the pursuit and fatal shooting of Ahmaud Arbery, a 25-year-old Black man. The case, along with the killing of George Floyd, helped inspire last year's racial justice protests. https://t.co/zYTM04IItU https://t.co/Kxh5Psa78Q",
  "data/tweet-nytimes/2021/11/1463734231411085312.json": "“I don’t jump anymore,” one player said.\n\n“None of us jump,” another replied. https://t.co/tHpV2dSOlv https://t.co/UjO3LSDwQ7",
  "data/tweet-nytimes/2021/11/1463731700555567107.json": "The pandemic has made women feel more vulnerable to abuse, sexual harassment and violence, which is in turn harming their mental and emotional well-being, according to a new report by a UN organization dedicated to gender equality. https://t.co/mmWvOYRxpa https://t.co/kbxSq0HyKl",
  "data/tweet-nytimes/2021/11/1463832355098009601.json": "Republicans have fought mask requirements and vaccine mandates for months, but as coronavirus infections again rise, they are blaming President Biden for failing to end the health crisis. https://t.co/BMEQhVHmot",
  "data/tweet-nytimes/2021/11/1463846202567495681.json": "An off-duty Newark police officer has been charged with reckless vehicular homicide after prosecutors said he hit a pedestrian with his personal car and took the body to his home to discuss what to do with it with his mother. https://t.co/liAJaaNtyb",
  "data/tweet-nytimes/2021/11/1463851228643958787.json": "As travel in the U.S. nears prepandemic levels, the government has ramped up prosecution of crimes on flights, especially by passengers refusing to follow Covid rules. https://t.co/cv303BgRt8",
  "data/tweet-nytimes/2021/11/1463678840220307456.json": "An Army whistle-blower died waiting for a bed at the VA. His lonely death underscores the costs of war beyond the battlefield. https://t.co/Bb7IwCbqzY",
  "data/tweet-nytimes/2021/11/1463704035974914058.json": "Spectators lined up to watch workers prepare balloons before the annual Macy’s Thanksgiving Day Parade, which was reduced to just one block in 2020 because of the pandemic.\nhttps://t.co/GrGF4ObzFC https://t.co/tMMgH20BGt",
  "data/tweet-nytimes/2021/11/1463934285736468487.json": "Double garlic 🧄. https://t.co/G4UfSfjxU8 https://t.co/wK976MPHHR",
  "data/tweet-nytimes/2021/11/1464002066595127299.json": "Breaking News: A new variant of the coronavirus, whose mutations display a “jump in evolution,” is driving a spike in Covid infections in South Africa. \n\nhttps://t.co/QMy6DIYkoE",
  "data/tweet-nytimes/2021/11/1463645056741560324.json": "Coronavirus cases are once again rising in most of the U.S. after a steady decline since mid-September.\n\nNew cases have increased by 25% nationally in the past two weeks. Here's a look at where they've risen the most. https://t.co/t33UygVBYg",
  "data/tweet-nytimes/2021/11/1463880169173753861.json": "Book lovers, vote for the best book of the past 125 years. https://t.co/oW1bekihWF https://t.co/ruTCa4ftFk",
  "data/tweet-nytimes/2021/11/1463873884533493771.json": "The story of the first Thanksgiving, as most Americans have been taught it, is not exactly accurate. https://t.co/fPDUmiPlQN",
  "data/tweet-nytimes/2021/11/1464134380163588101.json": "Book lovers, vote for the best book of the past 125 years. https://t.co/WsA9D9a0xN https://t.co/y4ALma1ISx",
  "data/tweet-nytimes/2021/11/1464121989774430208.json": "The Hong Kong government detected two cases of a new coronavirus variant identified in South Africa, which scientists have warned shows a “big jump in evolution” and could limit the effectiveness of vaccines. https://t.co/5k10iiIf56",
  "data/tweet-nytimes/2021/11/1464066453246775301.json": "The prosecutor in the Arbery case took on a high-stakes trial with a largely white jury. Here’s how she won a conviction. https://t.co/KRWd1C5RWT",
  "data/tweet-nytimes/2021/11/1464247616426758150.json": "Sharbat Gula, an Afghan woman whose portrait was featured on the cover of National Geographic in 1985, was evacuated to Rome after the Taliban takeover of Afghanistan, the Italian government said.\nhttps://t.co/9pnSXoNv4P",
  "data/tweet-nytimes/2021/11/1464073954679828500.json": "Britain will temporarily ban flights from six African countries starting on Friday, as the country's health ministry investigates a new coronavirus variant identified in South Africa. https://t.co/j1frs6YsEg",
  "data/tweet-nytimes/2021/11/1464255184952045572.json": "The new coronavirus variant that emerged in South Africa “is of huge international concern” and could pose “a substantial risk to public health,” Britain’s health secretary said, explaining the country’s decision to institute new travel restrictions. https://t.co/2UrM17UpBT",
  "data/tweet-nytimes/2021/11/1463904089482346502.json": "Magdalena Andersson became Sweden’s first female prime minister on Wednesday. She resigned a day later, after her budget was rejected in favor of one proposed by the opposition, which included a far-right party, and her coalition partners quit.\nhttps://t.co/Tvy86PblVP",
  "data/tweet-nytimes/2021/11/1464258921854603269.json": "Ruth Esther Reyes de Severino “begged” the managers of her building to change her locks after she got a restraining order against her estrange husband, according to a lawsuit. He later killed her and their two children, using a key to enter the apartment.\nhttps://t.co/aN5xrNh9go",
  "data/tweet-nytimes/2021/11/1464356137390809112.json": "Breaking News: Stephen Sondheim is dead at 91. One of Broadway’s most revered songwriters, he set the standard for the American musical. https://t.co/U6f5QeP5H9",
  "data/tweet-nytimes/2021/11/1464360840669409288.json": "At 49, Martha Izquierdo may not fit your idea of a TikTok influencer. But having survived brushes with death, conquering social media and delighting viewers was a cinch. \"Today's outfit,\" she says in one video, sauntering up to the camera, \"is confidence.\"\nhttps://t.co/aR9BhHt20j https://t.co/mHjFHY8SGw",
  "data/tweet-nytimes/2021/11/1464400567468544005.json": "In an interview days before his death, the revered composer and lyricist Stephen Sondheim discussed his shows running on Broadway and off, as well as a new movie about to be released. https://t.co/9t8eQkYFvs",
  "data/tweet-nytimes/2021/11/1464428781062471684.json": "Sharbat Gula, an Afghan woman whose portrait was featured on the cover of National Geographic in 1985, was evacuated to Rome after the Taliban takeover of Afghanistan, the Italian government said.\nhttps://t.co/DFSRJ2V88Z",
  "data/tweet-nytimes/2021/11/1464314290064744449.json": "The coronavirus variant in southern Africa, named Omicron by the WHO, is “of concern,” the organization said. Countries around the world have moved to restrict travel from the region.\n\nFollow updates.\nhttps://t.co/TMsv2vvmAG https://t.co/jTJYKmJ735",
  "data/tweet-nytimes/2021/11/1464372422224879617.json": "With 6,000 residents, a McDonald’s drive-through, bars and ball fields, the Guantánamo Bay Navy base is more than one big prison. It has the trappings of small-town America and the amenities of a college campus.\nhttps://t.co/ChJ2sLs4XA",
  "data/tweet-nytimes/2021/11/1463983416282603525.json": "Republicans are locking in newly gerrymandered maps for the legislatures in four battleground states — Texas, North Carolina, Ohio and Georgia — to cement the party’s control.\n\n“This is something more intense and durable and permanent,” one expert said. https://t.co/mfNvdXw4F3",
  "data/tweet-nytimes/2021/11/1464524426175827969.json": "On \"30,\" Adele’s voice — cooing, declaiming, arguing, teasing, imploring, quivering, breaking, shouting — is rightfully at the center. Her fourth album is a Critic’s Pick. https://t.co/FrxDZx2zMc",
  "data/tweet-nytimes/2021/11/1464312786805493761.json": "Breaking News: The U.S. will restrict travel from South Africa and seven other African countries to contain the new variant of the coronavirus, officials said.\n\nFollow updates.\nhttps://t.co/BqjcqTlbWI",
  "data/tweet-nytimes/2021/11/1464599928475377669.json": "A new treatment using stem cells that produce insulin has surprised experts and given them hope for the 1.5 million Americans living with the disease. https://t.co/aKDWfpY9II",
  "data/tweet-nytimes/2021/11/1464628848750907396.json": "Kevin Strickland left a Missouri prison on Tuesday after serving 43 years for a triple murder that he did not commit. He departed with empty pockets. Thanks to the generosity of more than 20,000 strangers, he now has over $1 million. https://t.co/c5dM2PRt3u",
  "data/tweet-nytimes/2021/11/1464698052535623690.json": "Jakucho Setouchi, a Buddhist priest in Japan, wrote openly about sex and love. When some critics labeled her work pornographic, she fired back: \"The critics who say such things all must be impotent and their wives frigid.\" She has died at 99. https://t.co/63YyzSXPVt",
  "data/tweet-nytimes/2021/11/1464652771534282763.json": "Disney’s new film, about a gifted family in Colombia with spellbinding songs by Lin-Manuel Miranda, supplies the kind of magic that will get passed on for generations. It’s a Critic’s Pick. https://t.co/RPjSdKRA0e",
  "data/tweet-nytimes/2021/11/1464645217563381763.json": "African officials lashed out at travel bans linked to the Omicron variant, saying the West’s vaccine hoarding helped pave the way to this crisis. https://t.co/BcUB2hIByv",
  "data/tweet-nytimes/2021/11/1464621708187422720.json": "Breaking News: The U.K. has reported two confirmed cases of the Omicron variant, and are said to be linked to travel in southern Africa. https://t.co/MFqv1VGY95",
  "data/tweet-nytimes/2021/11/1464311792105144329.json": "Millions of artifacts at the Smithsonian in D.C. are at risk as climate change threatens to flood the museums’ basement storerooms.\nhttps://t.co/ghnc4YvI0U",
  "data/tweet-nytimes/2021/11/1464786136619008003.json": "Sharbat Gula, an Afghan woman whose portrait was featured on the cover of National Geographic in 1985, was evacuated to Rome after the Taliban takeover of Afghanistan, the Italian government said.\nhttps://t.co/b2LzDew0f5",
  "data/tweet-nytimes/2021/11/1464796203560886278.json": "A new treatment using stem cells that produce insulin has surprised experts and given them hope for the 1.5 million Americans living with the disease. https://t.co/cQ72J6fcrW",
  "data/tweet-nytimes/2021/11/1464984966715088896.json": "He may be the first person cured of Type 1 diabetes. A new treatment using stem cells that produce insulin has surprised experts and given them hope. https://t.co/BjoW2gH67f",
  "data/tweet-nytimes/2021/11/1465027727250108424.json": "No artist has explored the contradictions of humanity as sympathetically and critically as Hayao Miyazaki, the Japanese animation legend who co-founded Studio Ghibli. Now, at 80, he’s coming out of retirement with another movie. https://t.co/j4BTemeOTJ",
  "data/tweet-nytimes/2021/11/1465041624396935168.json": "Breaking News: Virgil Abloh, the barrier-breaking Black designer whose ascent to the heights of the traditional luxury industry changed what was possible in fashion, died on Sunday in Chicago. He was 41. https://t.co/6h8dJ7fffL https://t.co/Ksbu63cU5y",
  "data/tweet-nytimes/2021/11/1465064237546545154.json": "Virgil Abloh, who died on Sunday at age 41, referred to himself not as a designer but as a \"maker,\" in acknowledgment of his omnivorous creative mind. He was a workaholic who maintained a punishing schedule and moonlighted as a DJ and a furniture designer. https://t.co/iFniIrOnsi https://t.co/R7wbFBfdhX",
  "data/tweet-nytimes/2021/11/1465000054008299528.json": "Bon Appétit called her \"the Leonardo da Vinci of wedding cakes.\" Sylvia Weinstock took the art of baking to new heights with her 10-foot-tall cakes. She has died at age 91. https://t.co/mifWJ8FCrp",
  "data/tweet-nytimes/2021/11/1465098207776710657.json": "Jay-Z is the most nominated artist in Grammy history. He had been tied with Quincy Jones for 80 nods, but with this year's ballot, he has a total of 83 nominations. Jay-Z has won 23 Grammys in his career so far. https://t.co/iqH6CgsugT https://t.co/7uqKxFfnVX",
  "data/tweet-nytimes/2021/11/1465020171710566403.json": "In Opinion\n\n\"I’d pedal until my sad, chattering brain went quiet and the pain in my body overwhelmed the hurt in my heart.\" Jennifer Weiner writes about how cycling helped her grieve her mother's death.\nhttps://t.co/78GsKUhHhg",
  "data/tweet-nytimes/2021/11/1465186523586912256.json": "They gathered in a pub in Yorkshire, England, on Friday to listen to an Oasis tribute band. Then the snow came.\n\nAs of Sunday night, they were still stuck there. https://t.co/Lwf1BTLC7R",
  "data/tweet-nytimes/2021/11/1464826401723490306.json": "Having missed one \"Nutcracker\" because of the pandemic, New York City Ballet was determined \"to bring it back to the stage, whatever we had to do,\" the company’s artistic director said.\nhttps://t.co/A1uuYWalnE",
  "data/tweet-nytimes/2021/11/1465274388652175366.json": "Virgil Abloh, the barrier-breaking Black designer whose ascent to the heights of the traditional luxury industry changed what was possible in fashion, died on Sunday. He was 41. https://t.co/GwiIPhsP8R https://t.co/QoOyIKuIGQ",
  "data/tweet-nytimes/2021/11/1465010123420667918.json": "The French language is intensely gender-specific and fiercely protected by august authorities. Still, the furor provoked by a prominent dictionary’s inclusion of the gender-neutral pronoun \"iel\" has been remarkably virulent. https://t.co/SQfPOE50W0",
  "data/tweet-nytimes/2021/11/1465163403090137093.json": "Matthew McConaughey announced that he would not run for governor of Texas for now. The actor said running for governor is a \"humbling and inspiring path to ponder.\"\n\n\"It is also a path that I’m choosing not to take at this moment.\" https://t.co/bch8dgLllH",
  "data/tweet-nytimes/2021/11/1465322177276878852.json": "He may be the first person cured of Type 1 diabetes. A new treatment using stem cells that produce insulin has surprised experts and given them hope. https://t.co/bgi9jK2miN",
  "data/tweet-nytimes/2021/11/1465340819926405123.json": "Breaking News: Jack Dorsey, Twitter’s co-founder, is expected to step down as CEO. His leadership had been questioned by employees and investors.\nhttps://t.co/AWJiGAXh64",
  "data/tweet-nytimes/2021/11/1465330990356774917.json": "They gathered in a pub in Yorkshire, England, on Friday to listen to an Oasis tribute band. Then the snow came.\n\nAfter a weekend stuck at the remote inn, most customers finally headed home on Monday, but not before discussing a reunion next year.\nhttps://t.co/fGaYdIQnWD",
  "data/tweet-nytimes/2021/11/1465391380742782986.json": "Ghislaine Maxwell, whose federal trial begins today, is accused of facilitating the sexual exploitation of girls for her longtime companion, Jeffrey Epstein. The charges against her include sex trafficking of a minor. https://t.co/wAiu4vaESq",
  "data/tweet-nytimes/2021/11/1465385569853353986.json": "Breaking News: President Biden sought to reassure the U.S. about the Omicron variant, saying it was \"a cause for concern, not a cause for panic.\" It will likely be a week, possibly two, before experts know more about its transmissibility and severity. https://t.co/I21GuPaVZ7",
  "data/tweet-nytimes/2021/11/1465002587904790529.json": "In Opinion\n\n\"Fast, honest work by South Africa has allowed the world to get on top of this variant even while clinical and epidemiological data is scarce,\" Zeynep Tufekci writes about the Omicron coronavirus variant.\nhttps://t.co/ZBL452ONHI",
  "data/tweet-nytimes/2021/11/1465415290074943491.json": "Breaking News: The Pentagon will conduct a high-level investigation of a 2019 U.S. airstrike in Syria that killed dozens of women and children. https://t.co/m4GktL689F",
  "data/tweet-nytimes/2021/11/1465439194575253514.json": "Israel's domestic intelligence agency has been granted temporary permission to access the phone data of people in the country with confirmed cases of the Omicron variant for contact tracing. https://t.co/78ndtWqKvN",
  "data/tweet-nytimes/2021/11/1465435506418888711.json": "Breaking News: The CNN anchor Chris Cuomo played a key role in helping Andrew Cuomo respond to sexual assault claims, newly released documents show. https://t.co/dhy8qeVZbm",
  "data/tweet-nytimes/2021/11/1465466901077897224.json": "In 1787, Catherine the Great told a governor-general that among his most important duties \"should be the introduction of inoculation against smallpox, which, as we know, causes great harm, especially among the ordinary people.\" https://t.co/w1I4BLxd4q",
  "data/tweet-nytimes/2021/11/1465482212837629960.json": "Breaking News: Pfizer and BioNTech are expected to apply for approval of their coronavirus booster shot for 16- and 17-year-olds. If approved, the booster would be the first for anyone under 18 in the U.S. https://t.co/QZEBzWlrnQ",
  "data/tweet-nytimes/2021/11/1465632964956594177.json": "Barbados became a republic on Tuesday, cutting ties with Queen Elizabeth II and ending nearly 400 years of British rule. The island swore in its first president, Sandra Mason, at a ceremony attended by Prince Charles and Rihanna.\nhttps://t.co/7df327EP8u https://t.co/MkRlA2URLF",
  "data/tweet-nytimes/2021/11/1465437928218374161.json": "President Biden sought to reassure the U.S. about the Omicron variant of the coronavirus on Monday. It will likely be a week, possibly two, before experts know more about its transmissibility and severity. https://t.co/dB61ZtoqdP https://t.co/m8taZuByNP",
  "data/tweet-nytimes/2021/11/1465829278168371210.json": "A federal appeals court on Tuesday restored California's prohibition on high-capacity magazines, a decision with national implications that could also lead to the reinstatement of a state ban on semiautomatic weapons. https://t.co/wsL7L7QCdL",
  "data/tweet-nytimes/2021/11/1465824736894758923.json": "Breaking News: Chris Cuomo was indefinitely suspended by CNN on Tuesday after new details emerged about his efforts to assist his brother, former Gov. Andrew Cuomo, against a cascade of sexual harassment accusations. https://t.co/HCTCdaOa6k",
  "data/tweet-nytimes/2021/11/1465821802928779264.json": "Breaking News: A federal judge blocked President Biden's nationwide vaccine mandate for health workers. The new rule was set to begin next week. https://t.co/XlRQyhgwoU",
  "data/tweet-nytimes/2021/11/1465814178464256004.json": "Your reading list just got a longer — here are the 10 Best Books of 2021, selected by editors at The New York Times Book Review. https://t.co/wVWGzGDHm8 https://t.co/Rksggclq57",
  "data/tweet-nytimes/2021/11/1465800335767662595.json": "Barbados became a republic and swore in its first president, Sandra Mason, during a ceremony on Tuesday that formally ended nearly 400 years of British rule. Attendees included the pop star Rihanna, who was declared a national hero. https://t.co/iAZemaafAd https://t.co/Kke38TDWN7",
  "data/tweet-nytimes/2021/11/1465797805444935687.json": "A 15-year-old student surrendered to the police after firing a semiautomatic handgun 15 to 20 times at Oxford High School in Oakland County, Michigan, the authorities said. At least three people — all believed to be students — are dead, officials said. https://t.co/zmtg8z6JzY",
  "data/tweet-nytimes/2021/11/1465784503759163392.json": "Breaking News: Three people were killed in a shooting at Oxford High School in Michigan, north of Detroit, the authorities said. The dead were all believed to be students, officials said, and a 15-year-old student has been taken into custody. https://t.co/Xe3t4JTJWr",
  "data/tweet-nytimes/2021/11/1465782718512443402.json": "How do you pronounce \"Omicron\" anyway? There is no single, agreed-on English pronunciation, experts say. https://t.co/5asGScAGtO https://t.co/5bUDgNznRt",
  "data/tweet-nytimes/2021/11/1465757585991163915.json": "\"I am required by the state of Mississippi to tell you that having an abortion will increase your risk of breast cancer,\" a doctor told patients on a typical morning at the last abortion clinic in the state. She added without hesitation: \"It doesn't.\" https://t.co/yoJmkNIZK3",
  "data/tweet-nytimes/2021/11/1465753253493321734.json": "Breaking News: Mark Meadows, Donald Trump’s former chief of staff, agreed to cooperate with the House panel investigating the Jan. 6 Capitol riot, a stunning reversal for a crucial witness in the inquiry. https://t.co/w5ijOZqD0e",
  "data/tweet-nytimes/2021/11/1465712308139831296.json": "Barbados became a republic on Tuesday, cutting ties with Queen Elizabeth II and ending nearly 400 years of British rule. The island swore in its first president, Sandra Mason, at a ceremony attended by Prince Charles and Rihanna. https://t.co/7CbTbiVvTD",
  "data/tweet-nytimes/2021/11/1465705958944825344.json": "In an attempt to curb overdose deaths, New York City will open the nation’s first authorized supervised injection sites for drug users. They will provide clean needles, administer naloxone to reverse overdoses and provide options for addiction treatment.\nhttps://t.co/JqkecqyNle",
  "data/tweet-nytimes/2021/11/1465699661465853961.json": "Greece will make Covid vaccines mandatory for people ages 60 or older, and those who fail to book a first shot by Jan. 16 will face fines.\n\nThe policy is “an act of justice for the vaccinated,” Prime Minister Kyriakos Mitsotakis said.\nhttps://t.co/P30U1VEWbb",
  "data/tweet-nytimes/2021/11/1465674529380966403.json": "They struggled to get regular access to bathing. So the \"shower bus\" came to them. \n\nThe bus, based in New York, runs on free tokens and is about \"giving people back some dignity,\" one organizer said. Swipe through to see how the program works. https://t.co/fAEXZMCFiU",
  "data/tweet-nytimes/2021/11/1465663173462265860.json": "Two cases of the Omicron variant were detected in the Netherlands more than a week ago, Dutch officials said. The announcement suggests that the variant had already reached Europe before countries rushed to impose travel limits.\nhttps://t.co/hUWAg02Yeu"
}