{
  "data/tweet-crypto/2022/7/1542660589939736576.json": "#bitcoin June closing price $19,925\nBelow 200WMA, below Realized price, Lowest RSI ever https://t.co/DsFzEVLFks",
  "data/tweet-crypto/2022/7/1543281470927683584.json": "All indicators at extreme levels (S2F, 200WMA, RSI, Realized price etc).\n- generational buying opportunity?\n- or \"this time it's different\": structural break with last 13 years? https://t.co/ZqONFs34fE",
  "data/tweet-crypto/2022/7/1543699617006632961.json": "People ask me what exchange I use. I mainly trade on Bybit because no KYC (10sec signup with only email/password).\nI trade only 10% of my portfolio, 90% is in cold storage. Trading focus is passive income with futures &amp; options. Writing an article on this.\nhttps://t.co/8OI2agrLDD",
  "data/tweet-crypto/2022/7/1543895451027603459.json": "My on-chain indicator (purple) flipped from bearish to bullish in June. Not saying this is it, and it would be nice if RSI would confirm, but I watch it like a hawk. Be ready. https://t.co/O57BdN7J1y",
  "data/tweet-crypto/2022/7/1543935968268402689.json": "If central banks and govts are right, then they will unwind their balance sheets (QT) and prices will normalize again.\nHowever if CBs and govts are lying through their teeth (again), then balance sheets will keep rising (QE) and prices (incl. asset prices) will stay high forever. https://t.co/vEnftp8xBV",
  "data/tweet-crypto/2022/7/1543943938012323842.json": "#bitcoin podcasts shill their sponsors. Bitcoiners shill their companies (exchange, fund, dca service, software). Even the most devout bitcoiners shill their book, course, magazine, newsletter. Great, good for them! As an investor I shill my fav exchange:\nhttps://t.co/8OI2agrLDD",
  "data/tweet-crypto/2022/7/1543956113292410882.json": "RT @100trillionUSD: My on-chain indicator (purple) flipped from bearish to bullish in June. Not saying this is it, and it would be nice if…",
  "data/tweet-crypto/2022/7/1544249224388382721.json": "60% of BTC in profit (average buy price $7.5K)\n40% of BTC in loss (average buy price $43.5K) https://t.co/hqcVrhY5S1"
}