{
  "data/tweet-wsj/2021/9/1432859514022383623.json": "“Mr. President...Don’t forget me here.” An Afghan interpreter who 13 years ago helped rescue Joe Biden was left behind Monday when the U.S. ended its military campaign in Afghanistan. https://t.co/tyL5Tn7aG0",
  "data/tweet-wsj/2021/9/1432863313168322566.json": "Holders of Israel’s vaccine passports must get a third dose of the Pfizer-BioNTech vaccine within six months of their second dose, or lose the so-called green pass that allows them more freedom https://t.co/dXILuGR0iY",
  "data/tweet-wsj/2021/9/1432889714810527747.json": "From @WSJopinion: As the Biden geniuses pick through the wreckage of what they have achieved, they—and all of us—should remember with trepidation this lesson from history: It’s not only the gods who punish arrogance and vanity, writes @gerardtbaker https://t.co/J97gMatP3I",
  "data/tweet-wsj/2021/9/1432901078333394945.json": "China’s move to crack down on online games signals that the country’s Communist Party intends to insert itself into the private lives of citizens to an extent not seen in decades https://t.co/6Zks6D2sje",
  "data/tweet-wsj/2021/9/1432923706578378754.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/hVpv4IpM1I",
  "data/tweet-wsj/2021/9/1432904806734180353.json": "Review: \"Future of Work,\" a three-part series on PBS, looks at the way technology is shaping our jobs and how it’s replacing humans https://t.co/YY8GkZcix6",
  "data/tweet-wsj/2021/9/1432953907995631620.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/flGpmp8wQM",
  "data/tweet-wsj/2021/9/1433002976948412417.json": "Americans are back to buying up toilet paper and paper towels. The maker of Charmin and Bounty is ramping up production, running factories 24 hours a day, seven days a week. https://t.co/TTgODyVLoK",
  "data/tweet-wsj/2021/9/1433034433754537986.json": "North Korea turned down roughly three million doses of China’s Sinovac Covid-19 vaccine, saying they should be sent to harder-hit countries https://t.co/cIAChW2zbn",
  "data/tweet-wsj/2021/9/1433052038892556289.json": "From @WSJopinion: President Biden’s accusatory, dishonest defense of his Afghanistan withdrawal was unworthy of the sacrifices Americans have made in that conflict, writes The Editorial Board https://t.co/TIq5hGoAdB",
  "data/tweet-wsj/2021/9/1433059617840435200.json": "The Taliban inherited thousands of U.S.-supplied assault weapons and military ground vehicles along with other technology and equipment including artillery pieces and night-vision goggles, another toll of the U.S. troop withdrawal https://t.co/4sFZsyPy98",
  "data/tweet-wsj/2021/9/1433042426202136580.json": "Firms estimate the damage from Hurricane Ida could total more than $15 billion in insured losses, while nearly one million people remain without power in Louisiana #WSJWhatsNow https://t.co/0fuyWcdPZY",
  "data/tweet-wsj/2021/9/1433108672473931790.json": "The U.S. left behind the majority of Afghan allies who had applied for visas to escape reprisal from the Taliban, a senior State Department official said https://t.co/9biZ1HF56g",
  "data/tweet-wsj/2021/9/1433082244881604611.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/ERmEuw60xB",
  "data/tweet-wsj/2021/9/1433029947497517059.json": "China's ruling party says it fears youth are being inundated with a toxic culture that poisons their minds, isolates them from society and saps young boys of their masculinity https://t.co/Ax5QJfwsuO",
  "data/tweet-wsj/2021/9/1433127626667876359.json": "Apple said iPhone and Apple Watch users in several states will be able to store and show their driver’s license or ID on their digital wallet https://t.co/PII0H6UCim",
  "data/tweet-wsj/2021/9/1432995434734174210.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/vQNzJ4iNbS",
  "data/tweet-wsj/2021/9/1433120288926052355.json": "Breaking: A Colorado grand jury indicted five current and former officers and paramedics in the 2019 death of Elijah McClain, a Black man who died in police custody https://t.co/VkIzjcZfBx",
  "data/tweet-wsj/2021/9/1433176616692244482.json": "Senate Minority Leader Mitch McConnell said Republican calls to remove President Biden from office over the Afghanistan withdrawal were impractical, and urged GOP voters to focus instead on next year’s midterm elections https://t.co/VgiG2CdkG9",
  "data/tweet-wsj/2021/9/1433131321224740871.json": "With calls to poison-control centers surging in recent weeks, health authorities and doctors are warning that use of the antiparasitic drug ivermectin against Covid-19 is dangerous https://t.co/ZDYatLFnXz",
  "data/tweet-wsj/2021/9/1433191719294603268.json": "A criminal probe into former President Donald Trump’s business affairs continues as two Trump Organization staff are set to testify to a grand jury https://t.co/bLHWQuGqSL",
  "data/tweet-wsj/2021/9/1433174485176311824.json": "OxyContin maker Purdue Pharma won court approval of a roughly $4.5 billion bankruptcy settlement that shields its Sackler family owners from lawsuits https://t.co/klmy0VhnQe",
  "data/tweet-wsj/2021/9/1433150176328306691.json": "“I’m beginning to wonder if this McDonald’s even has an ice cream machine.” The device that makes McFlurry goes on the blink so frequently it has attracted a lawsuit. The FTC is also snooping around. https://t.co/8qtadM6i3L",
  "data/tweet-wsj/2021/9/1433206461413404675.json": "Joe Rogan, the popular podcast host, announced Wednesday that he tested positive for Covid-19. Rogan said he took several medications, including ivermectin, which health regulators have warned against. https://t.co/qIDn0yuVDn",
  "data/tweet-wsj/2021/9/1433061133146066945.json": "Apple is planning new watch features to track blood pressure, as well as temperature to help with fertility planning, people familiar with the matter say https://t.co/7NvvG2bR8E",
  "data/tweet-wsj/2021/9/1433204163215757314.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/jtkTrYlTve",
  "data/tweet-wsj/2021/9/1433229465103052801.json": "From @WSJopinion: Biden and his advisers have decided that the only way out of this debacle is to lie about it, blame everyone else, and claim that defeat is really a victory https://t.co/frTWXAlCTs",
  "data/tweet-wsj/2021/9/1433210586536550400.json": "McDonald's ice cream machines fail so often the reaction has gone beyond late-night talk-show jokes to a lawsuit. The Federal Trade Commission has questions, too. https://t.co/q74LPQOZDi",
  "data/tweet-wsj/2021/9/1433199251161501697.json": "States that cut off enhanced unemployment benefits early didn’t see a significant boost in job growth, a WSJ analysis found https://t.co/KvswiqZIqe",
  "data/tweet-wsj/2021/9/1433104899961761794.json": "States that cut off enhanced unemployment benefits early didn’t see a significant boost in job growth, a WSJ analysis found https://t.co/8uhMd7i9jV",
  "data/tweet-wsj/2021/9/1433044720444493828.json": "A Texas law banning abortion after six weeks of pregnancy took effect, the most restrictive measure in the U.S. The Supreme Court could still weigh in. https://t.co/CS9LNEG7sQ",
  "data/tweet-wsj/2021/9/1433116214130262030.json": "A major nonprofit arts center barred the pro-democracy Hong Kong pop star Denise Ho from performing just days before a scheduled series of concerts https://t.co/WXHEqjpl1R",
  "data/tweet-wsj/2021/9/1433259653467627520.json": "States that cut off enhanced unemployment benefits early didn’t see a significant boost in job growth, a WSJ analysis found https://t.co/2v4SYIfhYd",
  "data/tweet-wsj/2021/9/1433252107017232387.json": "Joe Rogan, the popular podcast host, said he tested positive for Covid-19. His earlier comments on vaccines stirred controversy. https://t.co/Kg4whabEZc",
  "data/tweet-wsj/2021/9/1433274760679542784.json": "Power came back for 11,000 customers in eastern New Orleans, but was still out for nearly one million others in the wake of Hurricane Ida, leaving the region without air conditioning as the heat index climbed over 100 degrees https://t.co/iGzMTmjJLi",
  "data/tweet-wsj/2021/9/1433218189639528454.json": "The Taliban inherited thousands of U.S.-supplied assault weapons and military ground vehicles, another toll of the Afghanistan withdrawal https://t.co/UcfptMWl5d",
  "data/tweet-wsj/2021/9/1433286087472869379.json": "McDonald's ice cream machines fail so often the reaction has gone beyond late-night talk-show jokes to a lawsuit. The Federal Trade Commission has questions, too. https://t.co/MNQZfBvvDo",
  "data/tweet-wsj/2021/9/1433308726002425856.json": "The Taliban's takeover has brought to power an Afghan government more closely aligned with Pakistan, stirring security concerns in neighboring India and potentially raising tensions between the two rivals https://t.co/DnSZY4r8qt",
  "data/tweet-wsj/2021/9/1433284513312821249.json": "The Supreme Court allowed the U.S.'s toughest abortion restrictions to take effect, declining to block a Texas law that bans the procedure after six weeks https://t.co/feo4GX5cl1",
  "data/tweet-wsj/2021/9/1433237007644377092.json": "Apple will allow music, video and other media apps to create in-app links to sign up pages on those companies’ web sites, effectively allowing them to bypass Apple's cut of subscriptions after years of restrictions https://t.co/FoeQSVt9DX",
  "data/tweet-wsj/2021/9/1433361589302874114.json": "The U.S. left behind the majority of Afghan allies who had applied for visas to escape reprisal from the Taliban, a senior State Department official said https://t.co/hPcpPQz8H9",
  "data/tweet-wsj/2021/9/1433373614930284545.json": "European regulators fined Facebook’s chat service WhatsApp for failing to disclose enough about what it does with users’ data, ramping up privacy enforcement against tech giants https://t.co/Lio75vs2ml",
  "data/tweet-wsj/2021/9/1433366895881867265.json": "At least eight people have been killed in New York City and New Jersey as Ida caused flash floods and power outages. States of emergency are in place. https://t.co/jaDZ1EnZo5",
  "data/tweet-wsj/2021/9/1433388017767563270.json": "States that cut off enhanced unemployment benefits early didn’t see a significant boost in job growth, a WSJ analysis found https://t.co/b6WIZ5Ssyz",
  "data/tweet-wsj/2021/9/1433378584488468485.json": "Renewed for a fourth season, Netflix's “Drive to Survive” has brought a new audience to Formula One—and they’re not there for the cars  https://t.co/BpH3Tm5xU4",
  "data/tweet-wsj/2021/9/1433331374614847489.json": "Columbia and other wealthy universities steer master's students to federal loans that can exceed $250,000. After graduation, many learn the debt is well beyond their means. https://t.co/ncaRlncftH",
  "data/tweet-wsj/2021/9/1433195505841057795.json": "The 2018 arrests of two Canadians in China, and subsequent charges that the two violated China’s state-secrets laws, are widely believed to have been retaliation for the arrest of a top Huawei Technologies executive in Canada https://t.co/Sn2sd7H8Pd",
  "data/tweet-wsj/2021/9/1433414058422714380.json": "Remnants of Hurricane Ida barreled through the Northeast, flooding New York City’s subway system and disrupting train routes. At least eight people died due to the storm, which also caused power outages in parts of the region. #WSJWhatsNow https://t.co/AwgH5toGZa",
  "data/tweet-wsj/2021/9/1433354065031929861.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/4IvVKjbChB",
  "data/tweet-wsj/2021/9/1433429546951344138.json": "The Supreme Court of Virginia ruled Thursday that the state can take down an enormous statue of Confederate Gen. Robert E. Lee that became a symbol of racial injustice as it towered over Monument Avenue in the state’s capital for more than a century https://t.co/LtInCHzdB8",
  "data/tweet-wsj/2021/9/1433456348889497601.json": "The foreign substance detected in some vials of Moderna’s Covid-19 vaccine in Japan was stainless steel and it isn’t believed to affect the vaccine’s safety or efficacy https://t.co/6lyQ1VVklY",
  "data/tweet-wsj/2021/9/1433221918191243265.json": "After years of still-unfinished construction following the attacks of 9/11, lower Manhattan has become more residential and host to a wider range of industries. See how the area has changed. https://t.co/4HVBEPGgj9",
  "data/tweet-wsj/2021/9/1433255881458728960.json": "Ben Dugan sat in an unmarked car, tracking an organized-crime footsoldier who would lead him to “Daniel the Medicine Man.” His employer: CVS. https://t.co/OtimSsaYdi",
  "data/tweet-wsj/2021/9/1433486145200037898.json": "Stir-crazy Australians, back under Covid-19 lockdowns, are trying to fashion wildlife patisserie at home. Frog bagels are harder to pull off than sourdough. https://t.co/6Gcs8znrSZ",
  "data/tweet-wsj/2021/9/1433464748763406336.json": "At least 17 people died in NYC, New Jersey and Pennsylvania as the remnants of Ida pummeled the Northeast, causing flooding, tornadoes and power outages https://t.co/NhdugkWBXi",
  "data/tweet-wsj/2021/9/1433531463522193411.json": "Speaker Nancy Pelosi said the House would vote later this month on legislation to protect abortion rights https://t.co/gAAXEHxe7s",
  "data/tweet-wsj/2021/9/1433557916393492487.json": "From @WSJopinion: Biden’s shaky and listless performance has demolished the idea that he’ll be a credible contender in 2024, writes @KarlRove https://t.co/imVrLT77lG",
  "data/tweet-wsj/2021/9/1433554109978882050.json": "As many as 25,000 utility workers from 38 states are headed to Louisiana as part of a massive effort to restore power after Hurricane Ida https://t.co/sOea0gZ6Cq",
  "data/tweet-wsj/2021/9/1433540795882262531.json": "In what may be one of the largest tax settlements in history, executives at the hedge fund Renaissance Technologies will pay the IRS about $7 billion https://t.co/1UCNX7jPaK",
  "data/tweet-wsj/2021/9/1433576735140892673.json": "Leaders at two of the most popular dating apps in the U.S. are creating funds to aid Texas workers and their families affected by the state’s new abortion law https://t.co/o7qBqYyAGH",
  "data/tweet-wsj/2021/9/1433564155487924224.json": "Stir-crazy Australians, back under Covid-19 lockdowns, are trying to fashion wildlife patisserie at home. Frog bagels are harder to pull off than sourdough. https://t.co/2mWH2DAqdW",
  "data/tweet-wsj/2021/9/1433618290543312897.json": "On TikTok, Charli and Dixie D’Amelio have danced their way to 180 million combined followers. On a new TV series, “The D’Amelio Show,” viewers see a darker side of internet fame. https://t.co/puDG9hnn4s",
  "data/tweet-wsj/2021/9/1433633390373318657.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/bZUWcbYswj",
  "data/tweet-wsj/2021/9/1433639804290355200.json": "Japanese Prime Minister Yoshihide Suga plans to step down after a year in office, bringing political instability back to the U.S. ally https://t.co/e38q3fBuYd",
  "data/tweet-wsj/2021/9/1433652247733448706.json": "Take an early look at the front page of The Wall Street Journal https://t.co/TkTzzk9Sbs https://t.co/5ltx8gC9HD",
  "data/tweet-wsj/2021/9/1433671119329013789.json": "Walmart will increase its minimum wage to $12 an hour and raise pay for hundreds of thousands of its U.S. store workers https://t.co/UZ0QcQ3djy",
  "data/tweet-wsj/2021/9/1433656055020544001.json": "Renewed for a fourth season, Netflix's “Drive to Survive” has brought a new audience to Formula One—and they’re not there for the cars  https://t.co/qP1uLHzPAc",
  "data/tweet-wsj/2021/9/1433591846576472064.json": "A father and son survived a devastating flood caused by the remnants of Hurricane Ida—and saved a man who couldn’t swim—using sailing gear. https://t.co/y0BT8kmiTi",
  "data/tweet-wsj/2021/9/1433678677125083137.json": "The real problem with artificial intelligence, writes tech columnist @mims: It's not actually intelligent https://t.co/0PxfjKtlE0",
  "data/tweet-wsj/2021/9/1433712638102548490.json": "New Zealand police shot and killed a suspected Islamist terrorist who stabbed several people in a supermarket in Auckland https://t.co/D25aHHL8Lt",
  "data/tweet-wsj/2021/9/1433606955394813953.json": "Review: “Shang-Chi and the Legend of the Ten Rings” is a breath of fresh air because it is—almost—a self-contained and original story. Research not required. Marvel cult membership optional. https://t.co/6pzOOjqyo6",
  "data/tweet-wsj/2021/9/1433610721556840450.json": "In what may be one of the largest tax settlements in history, executives at the hedge fund Renaissance Technologies will pay the IRS about $7 billion https://t.co/HYzOXFLlTD",
  "data/tweet-wsj/2021/9/1433569199931203586.json": "Centrist Democratic Sen. Joe Manchin of West Virginia stepped up his campaign to cut the price tag of Democrats’ $3.5 trillion healthcare, education and climate legislation, calling for a “strategic pause” in the effort https://t.co/BsVStG8MZn",
  "data/tweet-wsj/2021/9/1433818338061340863.json": "From @WSJopinion: The Afghan fiasco hit at Biden's reputational core. He no longer comes across as empathetic, much less serious, writes @Peggynoonannyc https://t.co/xolAG4p2oF",
  "data/tweet-wsj/2021/9/1433535223464140803.json": "From @WSJopinion: I won’t support a $3.5 trillion bill or anywhere near that level of additional spending, writes @Sen_JoeManchin https://t.co/yN9REudYp0",
  "data/tweet-wsj/2021/9/1433832176601210900.json": "Former sitcom star Fran Drescher defeated actor Matthew Modine to become president of a powerful union that represents performers in contract negotiations with movie and television production companies https://t.co/RVsfqfUzzH",
  "data/tweet-wsj/2021/9/1433886567014322176.json": "The fitness industry needed some muscle in Washington. It turned to a candy lobbyist. “I’ve had a lifelong commitment to fitness—and to candy.” https://t.co/WZobExRoSt",
  "data/tweet-wsj/2021/9/1433905169301790726.json": "Lyft and Uber said they would cover the legal costs of drivers in Texas who might be sued for ferrying women to abortion clinics https://t.co/N8VLsZWjOo",
  "data/tweet-wsj/2021/9/1433916488721866757.json": "President Biden orders the DOJ to consider declassifying more government documents related to the probe into the 2001 attacks, something families of 9/11 victims have pressed him to do https://t.co/AHbjdQUBke",
  "data/tweet-wsj/2021/9/1433931596604772354.json": "From @WSJopinion: Maybe paying people not to work and punishing employers isn’t so great for the job market, writes Eugene Scalia https://t.co/xA41Ibq2oY",
  "data/tweet-wsj/2021/9/1433939148755415040.json": "Some schools are creating new degree programs that let students take the bulk of their classes in the major they want—such as liberal arts or engineering—but blend in business courses to give them a grounding in running their own company https://t.co/2PudNXKaOb",
  "data/tweet-wsj/2021/9/1433984438816448513.json": "The government of the Democratic Republic of Congo says a toxic-waste leak at a mine in neighboring Angola that is part-owned by the world’s biggest diamond miner has killed 12 people and sickened thousands in the central African country https://t.co/rdBOEOTtCP",
  "data/tweet-wsj/2021/9/1433844765473349641.json": "Scarlett Johansson's lawsuit against Disney is a summer blockbuster. The plot: Industry battles over pay in the digital streaming era. No one knows how it ends. https://t.co/E6QUJQDZKH",
  "data/tweet-wsj/2021/9/1434012199765348355.json": "Tennis champion Naomi Osaka signaled that she would be taking a break from the sport after losing in the third round of the U.S. Open https://t.co/8xCpNWFOsP",
  "data/tweet-wsj/2021/9/1434075032699944962.json": "Friday's knife attack has prompted New Zealand to accelerate an overhaul of counterterrorism laws, including by criminalizing the planning of an attack for the first time https://t.co/V95ds6oM7T",
  "data/tweet-wsj/2021/9/1434071256232497158.json": "China’s largest chip maker is teaming up with the Shanghai government to build an $8.87 billion chip production line in the city https://t.co/SDa1L9BOkS",
  "data/tweet-wsj/2021/9/1433969345428918277.json": "From @WSJopinion: The Democrats push for a hike in corporate taxes that would be a gift to the Chinese, writes @KimStrassel https://t.co/cUY0DvdJzy",
  "data/tweet-wsj/2021/9/1434120322320637952.json": "“It’s like our dads wanted us to be together.” A couple who first met at a camp for teenagers who had lost parents to terrorism plans to be married in an October ceremony that will include tributes to their fathers. https://t.co/HL9AmBnzxt",
  "data/tweet-wsj/2021/9/1434131662183485443.json": "“Mr. President...Don’t forget me here.” An Afghan interpreter who 13 years ago helped rescue Joe Biden was left behind Monday when the U.S. ended its military campaign in Afghanistan. https://t.co/DRC6VvpeL9",
  "data/tweet-wsj/2021/9/1434127865684037632.json": "Naomi Osaka will step away from tennis temporarily after losing to 18-year-old Canadian Leylah Fernandez at the U.S. Open https://t.co/DTLc6F4K3e",
  "data/tweet-wsj/2021/9/1434161852494319616.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/h7JTdm1ly7",
  "data/tweet-wsj/2021/9/1434165623718821890.json": "School districts across the country are grappling with a shortage of school bus drivers after some drivers resigned over worries about being exposed to young unvaccinated children and others quit over requirements that they get a Covid-19 vaccine https://t.co/ibhyzhdALn",
  "data/tweet-wsj/2021/9/1434169467085410309.json": "McDonald's ice cream machines fail so often the reaction has gone beyond late-night talk-show jokes to a lawsuit. The Federal Trade Commission has questions, too. https://t.co/L2iGJ2MRtL",
  "data/tweet-wsj/2021/9/1434059919377014787.json": "Before you return to the office, here’s what to ask bosses about what they’ve done to improve indoor air quality https://t.co/cepbIEUtfx",
  "data/tweet-wsj/2021/9/1433742839998042113.json": "Surprise! The IRS says you owe more in taxes, and you have limited time to deal with it. Welcome to the “math error” nightmare facing millions. https://t.co/iAmrknhfUB",
  "data/tweet-wsj/2021/9/1434086362735652864.json": "Take a look at the front page of today's Wall Street Journal https://t.co/fUeLfoYh1f https://t.co/A8JIsuCrOO",
  "data/tweet-wsj/2021/9/1434214738431447048.json": "Holders of Israel’s vaccine passports must get a third dose of the Pfizer-BioNTech vaccine within six months of their second dose, or lose the so-called green pass that allows them more freedom https://t.co/GuGeStdGiz",
  "data/tweet-wsj/2021/9/1434207154072866823.json": "Many young professionals, burned out from remote work and equipped with some savings, are quitting their jobs with no firm Plan B https://t.co/d8jwsDaNRJ",
  "data/tweet-wsj/2021/9/1434260042606419976.json": "An airline passenger did laundry, made waffles, washed dishes, took a nap and streamed \"Love After Lockup\"—all while on hold with customer service https://t.co/CGcdBjeCXG",
  "data/tweet-wsj/2021/9/1434199659258519552.json": "Americans are back to buying up toilet paper and paper towels. Charmin and Bounty are ramping up production, running factories 24/7. https://t.co/Bf0N4heIQS",
  "data/tweet-wsj/2021/9/1434281303063597058.json": "Willard Scott, the beloved weatherman who charmed viewers of NBC’s “Today” show with his self-deprecating humor and cheerful personality, has died. He was 87 years old. https://t.co/rLTi87W0uP",
  "data/tweet-wsj/2021/9/1434286424229036040.json": "“It’s like our dads wanted us to be together.” A couple who first met at a camp for teenagers who had lost parents to terrorism plans to be married in an October ceremony that will include tributes to their fathers. https://t.co/Q29FO0Zhtu",
  "data/tweet-wsj/2021/9/1434312858121113601.json": "“The situation in Afghanistan, it reminded Vietnamese refugees that many people helped them come here,” says a former refugee who evacuated Saigon in 1975 https://t.co/tnD3n1rfoR",
  "data/tweet-wsj/2021/9/1434195813220093953.json": "More than three weeks after Canada began letting fully vaccinated Americans to cross the border, only a fraction of the usual visitors have showed up, disappointing business owners and weighing on the economy https://t.co/wWmNB1x2cy",
  "data/tweet-wsj/2021/9/1434139207434489857.json": "Now young adults or in their 30s, some of the nearly 3,000 people who lost a mother or father in 9/11 describe grief, resilience and wondering what their absent parents would think of them now https://t.co/9Naat1eQOz",
  "data/tweet-wsj/2021/9/1434320452902658048.json": "Stir-crazy Australians, back under Covid-19 lockdowns, are trying to fashion wildlife patisserie at home. Frog bagels are harder to pull off than sourdough. https://t.co/uzgqXdGJbo",
  "data/tweet-wsj/2021/9/1434176956606689285.json": "The Taliban claimed to have entered the only remaining area of armed resistance to their rule in Afghanistan https://t.co/Mfti3jMTiD",
  "data/tweet-wsj/2021/9/1434293958289641472.json": "China has banned kids from playing online videogames during the school week. You don’t have to go quite so far to balance gaming and homework. Columnist @juliejargon offers parents a better plan. https://t.co/T9tx2slOBH",
  "data/tweet-wsj/2021/9/1434373254060388354.json": "“It’s like our dads wanted us to be together.” A couple who first met at a camp for teenagers who had lost parents to terrorism plans to be married in an October ceremony that will include tributes to their fathers. https://t.co/347ncglWBL",
  "data/tweet-wsj/2021/9/1433856095945113601.json": "From @WSJopinion: Instead of rushing to spend trillions on new government programs and additional stimulus funding, Congress should hit a strategic pause on the budget-reconciliation legislation, writes @Sen_JoeManchin https://t.co/ovoShAcG30",
  "data/tweet-wsj/2021/9/1434335495174098948.json": "Review: “Shang-Chi and the Legend of the Ten Rings” is a breath of fresh air because it is—almost—a self-contained and original story. Research not required. Marvel cult membership optional. https://t.co/iFbzNbnbS2",
  "data/tweet-wsj/2021/9/1433757918487220228.json": "Many Americans whose properties were damaged by Hurricane Ida and its remnants won’t have their losses covered by insurance. President Biden asked insurance companies to not deny assistance to those who were forced to evacuate. #WSJWhatsNow https://t.co/jKrDhIL9Uq",
  "data/tweet-wsj/2021/9/1434399664627982337.json": "Following Japan Prime Minister Yoshihide Suga’s decision to quit, lawmakers prepared to pick a leader likely to double down on a hawkish approach to China https://t.co/XJ35tYO6eD",
  "data/tweet-wsj/2021/9/1434324158289227780.json": "Apple will allow music, video and other media apps to create in-app links to sign up pages on those companies’ web sites, effectively allowing them to bypass Apple's cut of subscriptions after years of restrictions https://t.co/dYsSGJjKkz",
  "data/tweet-wsj/2021/9/1434441186467618819.json": "Friday's knife attack has prompted New Zealand to accelerate an overhaul of counterterrorism laws, including by criminalizing the planning of an attack for the first time https://t.co/J5nEg4iTwo",
  "data/tweet-wsj/2021/9/1434478963561271302.json": "From @WSJopinion: The Afghan fiasco hit at Biden's reputational core. He no longer comes across as empathetic, much less serious, writes @Peggynoonannyc https://t.co/WjnXKQyv7s",
  "data/tweet-wsj/2021/9/1434426119869149184.json": "School districts across the country are grappling with a shortage of school bus drivers after some drivers resigned over worries about being exposed to young unvaccinated children and others quit over requirements that they get a Covid-19 vaccine https://t.co/5IB9tQQVnP",
  "data/tweet-wsj/2021/9/1434452513466425350.json": "Cannabis contains dozens of rare and intriguing compounds, but they haven’t been easy or cheap to produce. That is changing as scientists are working on a technique that could fundamentally alter the way cannabis products are sourced and consumed. https://t.co/YBBfZ3HCmO",
  "data/tweet-wsj/2021/9/1434414754685198340.json": "Heard on the Street: A new Covid-19 surge is shutting down Vietnam’s factories. That might make it harder to find the clothes and shoes you want this holiday season. https://t.co/9iC8WkWcPe",
  "data/tweet-wsj/2021/9/1434497809252823042.json": "After 9/11, the U.S. set a new security goal: fighting terrorism at any cost. That shift has increased surveillance, empowered private contractors and changed Americans’ relationship with their government. https://t.co/4AkuLjoHqR",
  "data/tweet-wsj/2021/9/1434486554949562372.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/dD4GLHGAWd",
  "data/tweet-wsj/2021/9/1434471395946291201.json": "Now young adults or in their 30s, some of the nearly 3,000 people who lost a mother or father in 9/11 describe grief, resilience and wondering what their absent parents would think of them now https://t.co/eWhLbCwMy4",
  "data/tweet-wsj/2021/9/1434520465742176257.json": "Former sitcom star Fran Drescher defeated actor Matthew Modine to become president of a powerful union that represents performers in contract negotiations with movie and television production companies https://t.co/gpSk7at4WN",
  "data/tweet-wsj/2021/9/1434531845799043076.json": "An airline passenger did laundry, made waffles, washed dishes, took a nap and streamed \"Love After Lockup\"—all while on hold with customer service https://t.co/9kKuOgpXvU",
  "data/tweet-wsj/2021/9/1434305326359195648.json": "From @WSJopinion: Instead of rushing to spend trillions on new government programs and additional stimulus funding, Congress should hit a strategic pause on the budget-reconciliation legislation, writes @Sen_JoeManchin https://t.co/UL2WWyAwP1",
  "data/tweet-wsj/2021/9/1434539372913770501.json": "A speedy—and highly scenic—new way to travel from New York City to Boston is also one of the oldest: the storied seaplane https://t.co/UqN5tnes6s",
  "data/tweet-wsj/2021/9/1434565764393152516.json": "Covid-19 cases in school-age children are rising more rapidly in states where school has been in session for weeks—like Mississippi, where nearly 14,000 students have tested positive since the school year began https://t.co/Ip7S3Gq8nn",
  "data/tweet-wsj/2021/9/1434569568429789184.json": "“Mr. President...Don’t forget me here.” An Afghan interpreter who 13 years ago helped rescue Joe Biden was left behind Monday when the U.S. ended its military campaign in Afghanistan. https://t.co/n4lMjQWfio",
  "data/tweet-wsj/2021/9/1434244956420513798.json": "States that cut off enhanced unemployment benefits early didn’t see a significant boost in job growth, a WSJ analysis found https://t.co/0FWHq6cDP7",
  "data/tweet-wsj/2021/9/1434343034909564929.json": "Self-reproducing machines will soon blur the boundaries between life and non-life, writes physicist Frank Wilczek https://t.co/GuzCheZfNI",
  "data/tweet-wsj/2021/9/1434297762548420612.json": "With calls to poison-control centers surging, health authorities are warning that use of the antiparasitic drug ivermectin against Covid-19 is dangerous. Veterinarians are being urged to help stop misuse of versions of the drug given to animals. https://t.co/oi9ILjasIp",
  "data/tweet-wsj/2021/9/1434552446701948930.json": "The U.S. Navy declared dead five crew members of a military helicopter that crashed off San Diego, after a 3-day search-and-rescue mission proved unsuccessful https://t.co/igZnYOBuZH",
  "data/tweet-wsj/2021/9/1434603530950676484.json": "Columbia and other wealthy universities steer master's students to federal loans that can exceed $250,000. After graduation, many learn the debt is well beyond their means. https://t.co/ixl1M08IQN",
  "data/tweet-wsj/2021/9/1434512917119086596.json": "Islamic State militants killed at least 12 Iraqi policemen and wounded several more in an overnight attack, amid concerns the group is expanding its attacks in Iraq and Syria https://t.co/2gB7j9shv9",
  "data/tweet-wsj/2021/9/1434626157018853378.json": "The pandemic ate your wallet. Now, even work IDs and driver’s licenses are headed to your smartphone, writes columnist @JoannaStern https://t.co/pAMsm4Rzbj",
  "data/tweet-wsj/2021/9/1434629966327595009.json": "Americans are back to buying up toilet paper and paper towels. Charmin and Bounty are ramping up production, running factories 24/7. https://t.co/1bBXGxuxb0",
  "data/tweet-wsj/2021/9/1434645068250554370.json": "A $369 cellphone arriving this fall can make calls and send texts, but can't access social media, take photos or send email https://t.co/RF5Z6mTWAW",
  "data/tweet-wsj/2021/9/1434577145028829191.json": "Renewed for a fourth season, Netflix's “Drive to Survive” has brought a new audience to Formula One—and they’re not there for the cars  https://t.co/edMInvqDwj",
  "data/tweet-wsj/2021/9/1434675242077724673.json": "From @WSJopinion: The Taliban promises a different kind of rule than when it was last in power, but its history means those who care about the country’s cultural heritage should be concerned, writes James Cuno https://t.co/LeaMVrQhR2",
  "data/tweet-wsj/2021/9/1434648801155944463.json": "“Everything was blinking red”: Inside the Biden administration’s push to exit Afghanistan despite warnings https://t.co/Jd4H34cN9P",
  "data/tweet-wsj/2021/9/1434543127126282242.json": "“Everything was blinking red”: Inside the Biden administration’s push to exit Afghanistan despite warnings https://t.co/IzX44PRzIv",
  "data/tweet-wsj/2021/9/1434694101635588097.json": "“Most families underestimate the time it will take a student to land a job, and they overestimate how much the student will make as a starting salary” https://t.co/wclcvgLxkl",
  "data/tweet-wsj/2021/9/1434682783155298306.json": "Rising temperatures threaten \"catastrophic harm to health that will be impossible to reverse,\" according to editors of 220 medical, nursing and public-health journals https://t.co/kaEWR1bfGs",
  "data/tweet-wsj/2021/9/1434701662795534336.json": "The Federal Trade Commission is looking into the broken ice cream machine problem at McDonald's https://t.co/Tc5PJct3fa",
  "data/tweet-wsj/2021/9/1434713014234722311.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/0qQkGoRHxJ",
  "data/tweet-wsj/2021/9/1434743178679160832.json": "“It’s like our dads wanted us to be together.” A couple who first met at a camp for teenagers who had lost parents to terrorism plans to be married in an October ceremony that will include tributes to their fathers. https://t.co/bnUZbwKP31",
  "data/tweet-wsj/2021/9/1434750748215189505.json": "“Everything was blinking red”: Inside the Biden administration’s push to exit Afghanistan despite warnings https://t.co/6CcY84w7kx",
  "data/tweet-wsj/2021/9/1434562028245504011.json": "McDonald's ice cream machines fail so often the reaction has gone beyond late-night talk-show jokes to a lawsuit. The Federal Trade Commission has questions, too. https://t.co/3wqqpGD8gL",
  "data/tweet-wsj/2021/9/1434773395959341056.json": "Biden ordered the review and possible release of previously withheld government documents that could shed new light on the role of accomplices https://t.co/LZ7B6k6g0W",
  "data/tweet-wsj/2021/9/1434494057921843200.json": "In a world where office workers are rarely in the office, some are taking a second full-time job on the sly. \"I’m just trying to do the job I need to not get fired.\" https://t.co/8I4tgMux6P",
  "data/tweet-wsj/2021/9/1434845101637914628.json": "Marie Kondo's Monday routine: eating miso soup she makes from scratch and opening all her windows \"to purify the inside of the house.\" https://t.co/d4pDypYfjT",
  "data/tweet-wsj/2021/9/1434863971069267970.json": "President Biden plans to spend September pushing for passage of his agenda, as he faces falling poll numbers and continued criticism over Afghanistan https://t.co/NeZ0dKrIX6",
  "data/tweet-wsj/2021/9/1434875293978746884.json": "The NFL’s second pandemic season begins this week, and the teams with a higher percentage of vaccinated players aren’t just better protected against the virus. They have a competitive advantage on the field. https://t.co/0gfy978gzL",
  "data/tweet-wsj/2021/9/1434931919641325572.json": "The number of men enrolled in college this year trails women by record highs, part of a nationwide education gap. Nobody wants to talk about it. https://t.co/VOyrfdvnoU",
  "data/tweet-wsj/2021/9/1434905505114247177.json": "With calls to poison-control centers surging, health authorities are warning that use of the antiparasitic drug ivermectin against Covid-19 is dangerous. Veterinarians are being urged to help stop misuse of versions of the drug given to animals. https://t.co/EVekjp1Mzw",
  "data/tweet-wsj/2021/9/1434950808911687683.json": "Many parents are finding that their children have emerged from a year and half of lockdowns without the much-needed benefits that come from having close friends https://t.co/GxsqQyc5t4",
  "data/tweet-wsj/2021/9/1434973446958723081.json": "“Shang-Chi and the Legend of the Ten Rings” broke records for the highest-grossing film for the four-day Labor Day weekend, making $90 million in the U.S. and Canada https://t.co/ctNXpZmDiT",
  "data/tweet-wsj/2021/9/1434999213318938624.json": "Michael K. Williams, a ubiquitous character actor best known for playing Omar Little on “The Wire,” has died. He was 54. https://t.co/EBJS5qmbvi",
  "data/tweet-wsj/2021/9/1435007428291072004.json": "The number of men enrolled in college this year trails women by record highs, part of a nationwide education gap. Nobody wants to talk about it. https://t.co/VYYnrhwnCQ",
  "data/tweet-wsj/2021/9/1434980987738357760.json": "Most of Belarus’s opposition leaders have fled to neighboring countries after Alexander Lukashenko launched a brutal crackdown following last year’s disputed presidential vote https://t.co/RrdiNf4Mo7",
  "data/tweet-wsj/2021/9/1435003648417935360.json": "CVS, Home Depot, Ulta and Target all have something in common. They’re struggling to keep up with organized crime rings stealing from their stores in bulk and selling the goods online, often on Amazon. https://t.co/uUY0QomWnI",
  "data/tweet-wsj/2021/9/1435022543254130688.json": "An airline passenger did laundry, made waffles, washed dishes, took a nap and streamed \"Love After Lockup\"—all while on hold with customer service https://t.co/ySQrO29uzt",
  "data/tweet-wsj/2021/9/1435026299911905281.json": "The videogame ban in China has parents wondering: Should we do the same? https://t.co/Tjxu2cHK22",
  "data/tweet-wsj/2021/9/1434954615276060677.json": "A $369 cellphone arriving this fall can make calls and send texts, but can't access social media, take photos or send email https://t.co/mXwNnZvdoQ",
  "data/tweet-wsj/2021/9/1435052729190305793.json": "Many young professionals, burned out from remote work and equipped with some savings, are quitting their jobs with no firm Plan B https://t.co/QAGqjoGAd5",
  "data/tweet-wsj/2021/9/1435015025643728898.json": "Some movie fans decided to return to the familiar format of VHS tapes. It isn't the easiest hobby. “The one big question I get is, who still has VCRs these days?” https://t.co/MuO9UfsYL6",
  "data/tweet-wsj/2021/9/1435011197728919565.json": "Two young sisters were trapped in Afghanistan as their mother waiting anxiously in California. Here's a look inside the girls' harrowing escape from the country. https://t.co/ZIRjQrvah4",
  "data/tweet-wsj/2021/9/1435065328246136833.json": "Canada’s Leylah Fernandez toppled two Grand Slam winners, including Naomi Osaka, on her way to the second week of the U.S. Open. Then, on Monday, she turned 19. https://t.co/wPXm8Ku3E1",
  "data/tweet-wsj/2021/9/1435070342922481668.json": "The pandemic ate your wallet. Now, even work IDs and driver’s licenses are headed to your smartphone, columnist \n@JoannaStern writes https://t.co/XyRE9orNZY",
  "data/tweet-wsj/2021/9/1435082929974173698.json": "Covid-related shutdowns are hitting classrooms especially hard in the Deep South, where most schools were among the first to open https://t.co/QnG7e2EmBF",
  "data/tweet-wsj/2021/9/1435101799141322755.json": "Biden’s tax increases on companies and wealthy households look likely to get pared back as they move through Congress, frustrating progressives https://t.co/M1wYTnI7Qv",
  "data/tweet-wsj/2021/9/1435098032736030721.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/Q3Q4CsoTrD",
  "data/tweet-wsj/2021/9/1434984776134443024.json": "The Justice Department won’t tolerate violence or threats against people seeking abortions in Texas, U.S. Attorney General Merrick Garland said, as the Biden administration considers ways to challenge a new state law banning most abortions https://t.co/9ruMjGNcOj",
  "data/tweet-wsj/2021/9/1435207484164263940.json": "Taliban fighters violently dispersed the first sizable protest in Kabul since last month’s insurgent victory, showing that Afghanistan’s new rulers won’t tolerate public opposition https://t.co/BznlVjVNIF",
  "data/tweet-wsj/2021/9/1435188635394002948.json": "El Salvador became the first country in the world to adopt bitcoin as legal tender, rolling out bitcoin ATMs, an e-wallet and stylish kiosks https://t.co/JpPG94vZHu",
  "data/tweet-wsj/2021/9/1435169734580969473.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/z5Pl5yr5Ek",
  "data/tweet-wsj/2021/9/1435232221712076803.json": "El Salvador adopts bitcoin as its national currency today, defying warnings against using a volatile crypto asset that risks wrecking the impoverished nation’s $26 billion economy #WSJWhatsNow https://t.co/3ySu0XcnWR",
  "data/tweet-wsj/2021/9/1435239430193926157.json": "Aluminum prices hit a decade high after a military coup in the West African country of Guinea threatened to snarl the metal’s supply chain, explains @ahirtens #WSJWhatsNow https://t.co/9YwRBE5BHZ",
  "data/tweet-wsj/2021/9/1434958357882974220.json": "Nearly one in four women ages 32 to 38 with at least a bachelor’s degree were unmarried when they had their first baby, new research shows https://t.co/sx7RtAvwjY",
  "data/tweet-wsj/2021/9/1434463843950944257.json": "Italian astronaut Samantha Cristoforetti, whose memoir “Diary of an Apprentice Astronaut” was published in the U.S. this week, will return to the International Space Station in 2022 as its commander, flying there on a SpaceX Crew Dragon https://t.co/uSlOrsjvks",
  "data/tweet-wsj/2021/9/1435258705952530434.json": "Breaking: The Taliban announced a new Afghan government, naming Mullah Hassan Akhund as prime minister and keeping all key positions in Taliban hands https://t.co/BgwwI9dj6Y",
  "data/tweet-wsj/2021/9/1435090472993804295.json": "In a joint editorial, editors of 220 leading medical, nursing and public-health journals from around the world called for urgent action on climate change https://t.co/XZHGG68QJL",
  "data/tweet-wsj/2021/9/1435279277675610115.json": "From @WSJopinion: The Taliban, the sponsors of Osama bin Laden and killers of Americans for 20 years, have overnight turned into a courted U.S. partner https://t.co/KZUglnbGZF",
  "data/tweet-wsj/2021/9/1435305651266334720.json": "From @WSJopinion: Both shots are effective, but if Moderna ends up being the better one, it will be a tribute to American engineering and biotechnology, writes Marc Siegel https://t.co/quclYJNUw7",
  "data/tweet-wsj/2021/9/1435290542112313346.json": "Bitcoin’s price tumbled on the day that El Salvador took the unprecedented step of making the asset its national currency https://t.co/QN1iZruPvk",
  "data/tweet-wsj/2021/9/1435369832741019650.json": "Mexico’s Supreme Court unanimously ruled that making abortion a crime was unconstitutional, paving the way for far greater access to legal abortions in the world’s second-most-populous Roman Catholic country https://t.co/kAtdH6o0Zl",
  "data/tweet-wsj/2021/9/1435358497202491401.json": "Brazilians took to the streets in mass nationwide rallies Tuesday in support of President Jair Bolsonaro, a show of force for the right-wing leader ahead of elections next year in which he will face a surging leftist challenger https://t.co/mg9i1s1Kmk",
  "data/tweet-wsj/2021/9/1435388697369792512.json": "The machine that makes McFlurry goes on the blink so frequently a federal agency is now looking into it https://t.co/acrAv9pQOL",
  "data/tweet-wsj/2021/9/1435411346800226309.json": "Kim Kardashian's Instagram post asking followers to join “the Ethereum Max Community” might have been \"the financial promotion with the single biggest audience reach in history,” one regulator said https://t.co/NmMbdTWmPN",
  "data/tweet-wsj/2021/9/1435433986071961601.json": "From @WSJopinion: Leadership hasn’t been a hallmark of Biden’s long political career. His real talent is following the herd, writes @gerardtbaker https://t.co/hQfhrJBC8z",
  "data/tweet-wsj/2021/9/1435440561889202179.json": "Tiny and impoverished El Salvador became the first country in the world to adopt bitcoin as legal tender, allowing Salvadorans to use the cryptocurrency to buy a cup of coffee, get a haircut or even pay taxes and home loans https://t.co/W714J7FvAL",
  "data/tweet-wsj/2021/9/1435455304980893696.json": "A powerful 7.1 magnitude earthquake struck near Mexico’s resort city of Acapulco, killing at least one person, a state official said https://t.co/7KFqAGH5ca",
  "data/tweet-wsj/2021/9/1435449079107137537.json": "The number of men enrolled in college this year trails women by record highs, part of a nationwide education gap. Nobody wants to talk about it. https://t.co/RzPzSDIDPd",
  "data/tweet-wsj/2021/9/1435422699887730698.json": "A look at efforts to test Covid-19 vaccines in children as young as six months—and why the trials are taking so long. ‘We’ve never had to do something with this many steps.’ https://t.co/arEp8bBwzH",
  "data/tweet-wsj/2021/9/1435460417564942336.json": "Take an early look at the front page of The Wall Street Journal https://t.co/OOQBWIy7sB https://t.co/Zllt4M2qzc",
  "data/tweet-wsj/2021/9/1435547235274665989.json": "Virginia plans to take down a prominent statue of Confederate Gen. Robert E. Lee in Richmond on Wednesday after a yearlong legal battle https://t.co/nxxvjqwn0g",
  "data/tweet-wsj/2021/9/1435535925409456130.json": "Take an early look at the front page of The Wall Street Journal https://t.co/75nsLG4y3u https://t.co/dQgg9xEuzH",
  "data/tweet-wsj/2021/9/1435396248211795972.json": "Iran is blocking United Nations atomic agency inspectors’ access to nuclear-related sites and continues to expand its nuclear activities, the International Atomic Energy Agency said in two confidential reports Tuesday  https://t.co/1xO65IDE9Q",
  "data/tweet-wsj/2021/9/1435249031769374729.json": "From @WSJopinion: Pouring billions into China now is a bad investment and imperils U.S. national security, writes @georgesoros https://t.co/f7HCgR8BgU",
  "data/tweet-wsj/2021/9/1435431418021228551.json": "Britney Spears's father has filed a petition to end a 13-year court conservatorship that gave him control of the pop singer's $60 million estate https://t.co/6zIJs4fuVF",
  "data/tweet-wsj/2021/9/1435490635235090432.json": "“It’s like our dads wanted us to be together.” A couple who first met at a camp for teenagers who had lost parents to terrorism plans to be married in an October ceremony that will include tributes to their fathers. https://t.co/G7xyh47ogO",
  "data/tweet-wsj/2021/9/1435597398164844545.json": "A prominent statue of Robert E. Lee was removed Wednesday in Richmond, Va., the city that served as the capital of the Confederacy during the Civil War https://t.co/sZkQSTetlh",
  "data/tweet-wsj/2021/9/1435629061200560131.json": "The U.S. could get nearly half of its electricity from solar power by 2050 if it pursued an ambitious agenda to cut reliance on fossil fuels, the Energy Department said https://t.co/ceU1TenQb2",
  "data/tweet-wsj/2021/9/1435664279995310092.json": "Fake social-media accounts linked to the Chinese government tried to draw Americans out to real-world protests against racism and anti-Chinese Covid-19 rhetoric, according to U.S. security firms. \"They’re copying the Kremlin’s playbook.\" https://t.co/CGdJNh8wdU",
  "data/tweet-wsj/2021/9/1435596337077161986.json": "Afghan women took to the streets of Kabul to protest for a second consecutive day, outraged by the formation of a hard-line Taliban government and posing an unfamiliar challenge to a movement that has never tackled peaceful demonstrations https://t.co/4UwuSlNnc5",
  "data/tweet-wsj/2021/9/1435694510923829249.json": "From @WSJopinion: The Taliban’s appointment of Sirajuddin Haqqani—days before the 20th anniversary of 9/11—is nothing less than a slap in the face of the U.S. and its Western allies, writes @SethGJones https://t.co/HjdlbZx7Cn",
  "data/tweet-wsj/2021/9/1435683121408749575.json": "Afghan women took to the streets of Kabul to protest for a second consecutive day, outraged by the formation of a hard-line Taliban government and posing an unfamiliar challenge to an Islamist movement that has never tackled peaceful demonstrations https://t.co/w0GKZt1R8K",
  "data/tweet-wsj/2021/9/1435675580171755520.json": "Hong Kong authorities arrested four members of the group that for decades organized an annual vigil commemorating the victims of the 1989 Tiananmen Square massacre https://t.co/LV1GneFK8m",
  "data/tweet-wsj/2021/9/1435192400977223683.json": "Northrop Grumman and Lockheed Martin have invested in startup Orbit Fab, which plans to launch two refueling shuttles as early as next year. https://t.co/1MXREBvUSR",
  "data/tweet-wsj/2021/9/1435702007202029571.json": "NASA’s Perseverance rover has successfully collected a sample of Martian rock and sealed it in an airtight titanium tube for eventual return to Earth in an \"historic moment\" for space science https://t.co/TWL1VnG009",
  "data/tweet-wsj/2021/9/1435724694586642432.json": "From @WSJopinion: Beijing is adding warheads, missiles and subs at a rapid rate. The goal is global dominance, writes William Schneider Jr. https://t.co/pa5yZqVg62",
  "data/tweet-wsj/2021/9/1435739785042219009.json": "The U.S. could get 37% of its electricity from solar power by 2035—and 44% by 2050—if the U.S. pursues an ambitious agenda to cut reliance on fossil fuels, the Energy Department said Wednesday https://t.co/0xpc9eC7Fl",
  "data/tweet-wsj/2021/9/1435754870456336384.json": "We created 31 TikTok accounts registered as teenagers to understand what the app shows young users. Among the results: an unending reel of videos about sex, drugs and eating disorders. https://t.co/rj2D6GtHha",
  "data/tweet-wsj/2021/9/1435781530371207173.json": "The Biden administration is preparing to sue Texas over its new law banning most abortions, according to people familiar with the matter https://t.co/xiMwm26mbI",
  "data/tweet-wsj/2021/9/1435803920304152576.json": "From @WSJopinion: Biden likes to talk about “equity,” but that’s not what his policies are producing. Growing the welfare state is unlikely to help, writes @jasonrileywsj https://t.co/hu1KfX7GML",
  "data/tweet-wsj/2021/9/1435819040707072000.json": "The Biden administration is preparing to sue Texas over its new law banning most abortions, according to people familiar with the matter https://t.co/yH52gmmVEU",
  "data/tweet-wsj/2021/9/1435873556764704769.json": "The Taliban will allow about 200 Americans and other foreign citizens to leave Afghanistan on a flight to Qatar today, U.S. officials say https://t.co/XguUTzoq20",
  "data/tweet-wsj/2021/9/1435822813181526024.json": "Take an early look at the front page of The Wall Street Journal https://t.co/51pUVvA2XA https://t.co/PQLxsRO9bE",
  "data/tweet-wsj/2021/9/1435913405299298305.json": "The Biden administration is preparing to sue Texas over its new law banning most abortions, according to people familiar with the matter https://t.co/viaIS4rGIb",
  "data/tweet-wsj/2021/9/1435883189847924738.json": "We created 31 TikTok accounts registered as teenagers to understand what the app shows young users. Among the results: an unending reel of videos about sex, drugs and eating disorders. https://t.co/wXFy8ITJxJ",
  "data/tweet-wsj/2021/9/1435909616647512065.json": "U.S. Defense Secretary Lloyd Austin said he sees no evidence of a more representative Taliban government after the group appointed old-guard leaders to top positions https://t.co/32mpfpRc7i",
  "data/tweet-wsj/2021/9/1435286254250307584.json": "Texas Gov. Abbott signed a GOP voting bill that Democrats had tried to block through a walkout. Opponents already have filed suits challenging the law. https://t.co/bjEAtQbKSe",
  "data/tweet-wsj/2021/9/1435963772221468674.json": "Breaking: President Biden will require that all federal workers and millions of government contractors be vaccinated against Covid-19, a person familiar with the plans said https://t.co/FsnseXm6dK",
  "data/tweet-wsj/2021/9/1435977568553996290.json": "Amazon, the free-shipping pioneer, is offering free college for its workers, as the competition for U.S. workers moves beyond $15 an hour  https://t.co/9dIovaNyB1",
  "data/tweet-wsj/2021/9/1436000208211648526.json": "Ray-Ban and Facebook teamed up on a pair of super stylish sunglasses with...two cameras and three microphones. @joannastern wore them for a week. Few people knew she was recording them. https://t.co/y4RbZRRBMm",
  "data/tweet-wsj/2021/9/1436007764019630086.json": "From @WSJopinion: On this 9/11 the country should face the fact that Biden’s Afghan surrender didn’t end the war on terror—it emboldened our enemies, writes @KarlRove https://t.co/KEvFaUCPQ3",
  "data/tweet-wsj/2021/9/1436045895137693696.json": "The U.S. sued Texas over its new law banning most abortions, arguing the ban was enacted \"in open defiance of the Constitution\" https://t.co/QPFnb4eTbo",
  "data/tweet-wsj/2021/9/1436055630662574083.json": "The U.S. will require companies with more than 100 employees to mandate vaccines or weekly Covid-19 tests for their staff, senior officials said. The requirement covers 80 million private-sector workers. https://t.co/mliuNOGUEL",
  "data/tweet-wsj/2021/9/1436093326759976972.json": "All employers with 100 or more employees would have to require that their workers be vaccinated or undergo at least weekly Covid-19 testing under a new plan announced by President Biden to curb the spread of the pandemic https://t.co/qiwMBkMksw",
  "data/tweet-wsj/2021/9/1436132360295170055.json": "Gov. Greg Abbott signed a bill Thursday aiming to allow Texans to sue social-media companies if their content or accounts are banned https://t.co/mKsGfHXHn9",
  "data/tweet-wsj/2021/9/1436113538326609922.json": "Los Angeles public schools will mandate Covid-19 shots for students 12 and older to attend classes in person, the first large school district to do so https://t.co/OdCFQbYVFg",
  "data/tweet-wsj/2021/9/1436136109021581314.json": "First offenders who refuse to mask up on flights, in airports, and on public transportation could now face TSA fines between $500 and $1,000, while repeated violations will cost between $1,000 and $3,000, President Biden announced https://t.co/9nN0zsV1so",
  "data/tweet-wsj/2021/9/1436181395110514697.json": "A private island in Palm Beach will hit the market for $120 million, just months after selling for $85 million https://t.co/6VlqiRElGY",
  "data/tweet-wsj/2021/9/1436173855052247042.json": "The U.S. had its hottest summer on record this year, narrowly beating out highs set during the Dust Bowl in 1936 https://t.co/a1JV30ZDZ8",
  "data/tweet-wsj/2021/9/1436166301244960769.json": "The only daughter of Walmart founder Sam Walton brought priceless artworks to Bentonville, Arkansas. Now, she's taking on the establishment with ambitious expansion plans to make the museum—and the town—a world-class destination. https://t.co/wfaeZ4yCMz",
  "data/tweet-wsj/2021/9/1436215378317910016.json": "President Biden initiated a call with China's president as recent high-level US-China meetings have been unproductive, U.S. officials say https://t.co/z3F62VlyFp",
  "data/tweet-wsj/2021/9/1436245582524395520.json": "Ray-Ban and Facebook teamed up on a pair of super stylish sunglasses with...two cameras and three microphones. @joannastern wore them for a week. Few people knew she was recording them. https://t.co/vNaJWm4PBg",
  "data/tweet-wsj/2021/9/1436309760647835652.json": "Switzerland cleared the way for more trading of bitcoin and other digital assets by authorizing a new digital stock exchange https://t.co/6SOeJRGGd3",
  "data/tweet-wsj/2021/9/1436305993231708194.json": "The Delta variant is likely to outcompete Mu, Lambda and other variants because it is so infectious, scientists say. “Nothing so far has appeared competitive to Delta.” https://t.co/j1vMJTxjZp",
  "data/tweet-wsj/2021/9/1436324857688563712.json": "Thousands of photos captured the horror and heroism of 9/11. Twenty years later, survivors and witnesses who appeared in some of the most compelling images told us their stories and what has happened to them since. “They don’t realize what I saw.” https://t.co/XCPGg61DgE",
  "data/tweet-wsj/2021/9/1436321125789806600.json": "Cryptocurrency fans are borrowing against their bitcoin and Ethereum to buy homes, cars—and more crypto. “It wasn’t a Lamborghini, just a normal Tesla.” https://t.co/7pr3BGo57t",
  "data/tweet-wsj/2021/9/1436372888328736773.json": "Nearly 3,000 children lost parents in the Sept. 11 attacks. Now young adults or in their 30s, some talk of the pain of missing fathers they never met, and the burden of constantly being seen as victims. https://t.co/IG6iv7OVNG",
  "data/tweet-wsj/2021/9/1436361339723829253.json": "Harvard University’s endowment doesn’t plan to invest in companies that explore for fossil fuels and is investing in funds that support moving to a green economy https://t.co/phkgL24kUd",
  "data/tweet-wsj/2021/9/1436336235363065875.json": "Many journalism students leave even the most prestigious private master’s programs with earnings too low to let them make progress paying off their debt, according to a WSJ analysis https://t.co/PRXHYsPNr4",
  "data/tweet-wsj/2021/9/1436299918000459782.json": "Large companies will have to require their workers get a Covid-19 vaccine or undergo weekly testing, under new rules announced by President Biden #WSJWhatsNow https://t.co/sBGVhyIsQH",
  "data/tweet-wsj/2021/9/1436346549865439253.json": "More remote workers are questioning companies for cutting pay in their new locales, given that they are putting in more hours, producing the same quality of work and could find another job if needed https://t.co/X9Sz5rfv3l",
  "data/tweet-wsj/2021/9/1436407934272090113.json": "From @WSJopinion: It is exalting to think of what Todd Beamer and his fellow passengers did on that short flight on 9/11, and the people they saved on the ground, writes Mene Ukueberuwa https://t.co/z269IL3jmF",
  "data/tweet-wsj/2021/9/1436430566166077441.json": "French prosecutors brought preliminary charges against a former health minister over her actions during the first months of the coronavirus pandemic, part of a probe that is examining how the government of President Emmanuel Macron responded to the crisis https://t.co/fKjiogkkLe",
  "data/tweet-wsj/2021/9/1436450676284997636.json": "Unvaccinated people were 11 times as likely to die from Covid-19 than vaccinated peers during this summer’s Delta-driven surge, according to a trio of studies released Friday https://t.co/SYcXJU22uc",
  "data/tweet-wsj/2021/9/1436456983767486465.json": "Measles shots last for life. Chickenpox immunizations protect for decades. But the current crop of Covid-19 vaccinations weaken in just months. Here’s why. https://t.co/pHeRRqGrV2",
  "data/tweet-wsj/2021/9/1436475853395963907.json": "Thousands of photos captured the horror and heroism of 9/11. Twenty years later, survivors and witnesses who appeared in some of the most compelling images told us their stories and what has happened to them since. “They don’t realize what I saw.” https://t.co/vX1IE36GLA",
  "data/tweet-wsj/2021/9/1436332408480075781.json": "From @WSJopinion: 9/11 will always be a part of who we are, and those who forget are doomed to be reminded by another tragedy sometime in the future, writes @CondoleezzaRice https://t.co/CP5tlYJ0Ck",
  "data/tweet-wsj/2021/9/1435924696206176257.json": "Theranos founder Elizabeth Holmes was surrounded by photographers and news crews as she arrived at court, where prosecutors said she lied to investors and to patients who relied on the company’s blood tests #WSJWhatsNow https://t.co/gQXO7DpH4V",
  "data/tweet-wsj/2021/9/1436524966825107456.json": "Thousands of photos captured the horror and heroism of 9/11. Twenty years later, survivors and witnesses who appeared in some of the most compelling images told us their stories and what has happened to them since. “They don’t realize what I saw.” https://t.co/anf6aBNaBv",
  "data/tweet-wsj/2021/9/1436532484674625537.json": "Measles shots last for life. Chickenpox immunizations protect for decades. But the current crop of Covid-19 vaccinations weaken in just months. Here’s why. https://t.co/sUi3Zp4vF3",
  "data/tweet-wsj/2021/9/1436509857973166081.json": "The Delta variant is likely to outcompete Mu, Lambda and other variants because it is so infectious, scientists say. “Nothing so far has appeared competitive to Delta.” https://t.co/UOj3rfI7qZ",
  "data/tweet-wsj/2021/9/1436448156347248643.json": "The Biden administration has suspended flights of Afghans to the U.S. after four previous arrivals tested positive for measles, officials said Friday https://t.co/dZqUtbOZ96",
  "data/tweet-wsj/2021/9/1436543803360522243.json": "We created 31 TikTok accounts registered as teenagers to understand what the app shows young users. Among the results: an unending reel of videos about sex, drugs and eating disorders. https://t.co/hLdRgG5Omd",
  "data/tweet-wsj/2021/9/1436547577357520896.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/lJyn2bFXq9 https://t.co/0cY118ojyZ",
  "data/tweet-wsj/2021/9/1436562669734092803.json": "A private island in Palm Beach will hit the market for $120 million, just months after selling for $85 million https://t.co/Nk6zH3jUUp",
  "data/tweet-wsj/2021/9/1436570251509051393.json": "Ray-Ban and Facebook teamed up on a pair of super stylish sunglasses with...two cameras and three microphones. @joannastern wore them for a week. Few people knew she was recording them. https://t.co/h4JbhEaFlu",
  "data/tweet-wsj/2021/9/1436585348738519041.json": "Nearly 3,000 children lost parents in the Sept. 11 attacks. Now young adults or in their 30s, some talk of the pain of missing fathers they never met, and the burden of constantly being seen as victims. https://t.co/CTMrn1R5bW",
  "data/tweet-wsj/2021/9/1436623091925405699.json": "Take a look at the front page of today's Wall Street Journal https://t.co/Qaz4hEqWMZ https://t.co/yFYO3GwViI",
  "data/tweet-wsj/2021/9/1436687219817910279.json": "20 years after the 9/11 attacks, lower Manhattan has become more residential and home to a broad range of industries https://t.co/s93Nylg2oK #WSJWhatsNow https://t.co/xcs3OEdvcJ",
  "data/tweet-wsj/2021/9/1436528686296178693.json": "Call Taiwan a country? No way, say Chinese bureaucrats at the U.N. No group is too obscure to get a note setting it straight about terminology. https://t.co/c46rLkpz34",
  "data/tweet-wsj/2021/9/1436702368448536576.json": "Former President Donald Trump in a video released Saturday said the anniversary of the Sept. 11 attacks “represents great sorrow for our country.” He also criticized President Biden’s handling of the U.S. withdrawal from Afghanistan. https://t.co/3DukOWLkeE",
  "data/tweet-wsj/2021/9/1436577783287881732.json": "The way Amazon uses tech to squeeze the most possible work out of each and every employee is its own new brand of management: Bezosism https://t.co/dk9hMQvcwD",
  "data/tweet-wsj/2021/9/1436555153398697985.json": "Cryptocurrency fans are borrowing against their bitcoin and Ethereum to buy homes, cars—and more crypto. “It wasn’t a Lamborghini, just a normal Tesla.” https://t.co/FqWZMbLPsV",
  "data/tweet-wsj/2021/9/1436713676606693379.json": "Thousands of photos captured the horror and heroism of 9/11. Twenty years later, survivors and witnesses who appeared in some of the most compelling images told us their stories and what has happened to them since. “They don’t realize what I saw.” https://t.co/zTdLMKal7y",
  "data/tweet-wsj/2021/9/1436721300874145794.json": "On the morning of Sept. 11, 2001, thousands of people working in the World Trade Center were confronted with decisions: Vacate an office or remain? Take a stairwell up or head down? Those choices would affect the rest of their lives. https://t.co/gtTUlNkgwC",
  "data/tweet-wsj/2021/9/1436506059263336455.json": "Review: The Amazon Prime series \"LuLaRich\" looks at LuLaRoe, a clothing company accused of running a pyramid scheme https://t.co/MlVczsYBFf",
  "data/tweet-wsj/2021/9/1436732560265129985.json": "In a taped video message, President Biden hailed the “unity and resilience” of the American people and paid tribute to the victims of the terrorist attack ahead of visiting the three sites where hijacked planes struck https://t.co/HspAyvuFgF",
  "data/tweet-wsj/2021/9/1436766564376776705.json": "“It’s like our dads wanted us to be together.” A couple who first met at a camp for teenagers who lost parents to terrorism plans to be married in a ceremony that will include tributes to their fathers. https://t.co/pcUtMVJMpA",
  "data/tweet-wsj/2021/9/1436758987286921218.json": "From @WSJopinion: It’s a life—and death—that merit celebration. Amid the observances on this 20th anniversary of 9/11, take a moment to remember Todd Beamer, writes Mene Ukueberuwa https://t.co/zQWC40i59j",
  "data/tweet-wsj/2021/9/1436817195934302208.json": "18-year-old Briton Emma Raducanu defeated Leylah Fernandez of Canada in straight sets to win the first U.S. Open final between two teenagers since 1999 https://t.co/P7dEME0GnX",
  "data/tweet-wsj/2021/9/1436838222919766021.json": "Thousands of photos captured the horror and heroism of 9/11. Twenty years later, survivors and witnesses who appeared in some of the most compelling images told us their stories and what has happened to them since. “They don’t realize what I saw.” https://t.co/riaSANrbgQ",
  "data/tweet-wsj/2021/9/1436815595404726284.json": "Nearly 40 years after this man last saw the 1918 Ford Model T his grandfather assembled by hand, he tracked it down in rural North Dakota. \"I can understand why this little model is the one that put the world on wheels.\" https://t.co/6UJoLxtYmI",
  "data/tweet-wsj/2021/9/1436804275359911936.json": "People working in the World Trade Center on Sept. 11 had mere moments to decide: Vacate an office or remain? Take a stairwell up or head down? The decisions made by employees at ICAP would affect the rest of their lives. https://t.co/Z5XmLviVQO",
  "data/tweet-wsj/2021/9/1436864677875695616.json": "Now young adults or in their 30s, some of the nearly 3,000 people who lost a mother or father in 9/11 describe grief, resilience and wondering what their absent parents would think of them now https://t.co/JfFkqnCHia",
  "data/tweet-wsj/2021/9/1436834460360663051.json": "After years of still-unfinished construction following the attacks of 9/11, lower Manhattan has become more residential and host to a wider range of industries. See how the area has changed. https://t.co/3mGnvnAfzJ",
  "data/tweet-wsj/2021/9/1436884090976878597.json": "The FBI made public a long-secret memo detailing evidence agents compiled in 2016 as they examined allegations of official Saudi involvement in the Sept. 11 terrorist attacks https://t.co/d3YMT3K7qt",
  "data/tweet-wsj/2021/9/1436902447767859201.json": "Measles shots last for life. Chickenpox immunizations protect for decades. But the current crop of Covid-19 vaccinations weaken in just months. Here’s why. https://t.co/yfEMx8F9wd",
  "data/tweet-wsj/2021/9/1436727315057229828.json": "A group of Afghan Air Force pilots who fled to Uzbekistan will be transferred out under a deal between the U.S. and Uzbekistan, people familiar say https://t.co/D1lM5FjKE2",
  "data/tweet-wsj/2021/9/1436909966485598211.json": "For people who find the runner’s high elusive, a new book offers this suggestion: Run high https://t.co/R95HOsFf54",
  "data/tweet-wsj/2021/9/1436940168448126977.json": "The Biden administration’s order that most U.S. companies mandate Covid-19 vaccines for their workers or test weekly has divided the business community  https://t.co/wVoEirp8hy",
  "data/tweet-wsj/2021/9/1436955252578832387.json": "Harvard University’s endowment doesn’t plan to invest in companies that explore for fossil fuels and is investing in funds that support moving to a green economy https://t.co/Rxnex1LoO1",
  "data/tweet-wsj/2021/9/1436857175851347975.json": "The Pentagon marked its first anniversary of Sept. 11 without U.S. troops in Afghanistan. \"I would very much like for us as a nation to have a healthy, if emotional, conversation about how to fight such conflicts in the future.\" https://t.co/ybikJK7VXe",
  "data/tweet-wsj/2021/9/1437008121377984513.json": "Unvaccinated people were 11 times as likely to die from Covid-19 than vaccinated peers during this summer’s Delta-driven surge, according to a trio of studies released Friday https://t.co/nYGGcjZyUc",
  "data/tweet-wsj/2021/9/1436917550147846145.json": "Heard on the Street: Storage levels of natural gas look rather thin globally, while prices have surged. A cold winter in parts of the world could send prices even higher. https://t.co/wHCRFfvkaA",
  "data/tweet-wsj/2021/9/1437019426101018624.json": "The number of men enrolled in college this year trails women by record highs, part of a nationwide education gap. Nobody wants to talk about it. https://t.co/ys8bpfQxgS",
  "data/tweet-wsj/2021/9/1437000592782774275.json": "If the Taliban were to adopt cryptocurrency as part of a national economic policy, it could aid efforts to circumvent sanctions https://t.co/5yWUKq1mkh",
  "data/tweet-wsj/2021/9/1437030735664218115.json": "Large companies will have to require their workers get a Covid-19 vaccine or undergo weekly testing, under new rules announced by President Biden #WSJWhatsNow https://t.co/fxS4rf25qU",
  "data/tweet-wsj/2021/9/1437062193133010946.json": "Covid-19 may become a routine illness like a common cold or the flu one day, virologists and epidemiologists say. But it will take a lot to get there, as the ferocious spread of the Delta variant shows. https://t.co/eJqqzavCoo",
  "data/tweet-wsj/2021/9/1436694789462896647.json": "Brazil, a major buyer of China’s CoronaVac shot, is making a retreat from the Covid-19 vaccine as concerns grow over its efficacy against the Delta variant  https://t.co/sARfGfM8Ua",
  "data/tweet-wsj/2021/9/1436743872286187523.json": "The morning of 9/11 marked the beginning of Deborah Borza's 20-year effort to make sure that her daughter Deora Bodley, who was killed on Flight 93, would never be forgotten https://t.co/UoOrkYW3Oq",
  "data/tweet-wsj/2021/9/1437094924630085637.json": "Fake social-media accounts linked to the Chinese government tried to draw Americans out to real-world protests against racism and anti-Chinese Covid-19 rhetoric, according to U.S. security firms. \"They’re copying the Kremlin’s playbook.\" https://t.co/ZxfGIroSWY",
  "data/tweet-wsj/2021/9/1437079811567099907.json": "Cryptocurrency fans are borrowing against their bitcoin and Ethereum to buy homes, cars—and more crypto. “It wasn’t a Lamborghini, just a normal Tesla.” https://t.co/s6wiGDogmS",
  "data/tweet-wsj/2021/9/1437125133135720460.json": "Ray-Ban and Facebook teamed up on a pair of stylish sunglasses with...two cameras and three microphones. Here's our review. https://t.co/UAtiiPcYdy",
  "data/tweet-wsj/2021/9/1437177522823774208.json": "House Democrats consider calling for raising the corporate tax rate to 26.5% from 21% and imposing a surtax on people making over $5 million https://t.co/Jun0FlrEKb",
  "data/tweet-wsj/2021/9/1437183685183381505.json": "Daniil Medvedev of Russia defeated Novak Djokovic in the U.S. Open final, denying Djokovic his 21st major title and a Grand Slam\nhttps://t.co/gplC9jm2NU",
  "data/tweet-wsj/2021/9/1437147778266849283.json": "U.S. Capitol Police launched disciplinary proceedings against six of its officers, who are accused of conduct unbecoming an officer, failure to comply with directives, improper remarks and improper dissemination of information, the department said https://t.co/A6lKgG2Nyq",
  "data/tweet-wsj/2021/9/1437189515354025984.json": "We created 31 TikTok accounts registered as teenagers to understand what the app shows young users. Among the results: an unending reel of videos about sex, drugs and eating disorders. https://t.co/yUxlSrr2Ms",
  "data/tweet-wsj/2021/9/1437234598849794050.json": "House Democrats are considering calling for raising the corporate tax rate to 26.5% from 21% and imposing a surtax on people making over $5 million https://t.co/WclVRVCw1K",
  "data/tweet-wsj/2021/9/1437227048464957442.json": "The stage was set for Novak Djokovic to achieve history as the first man since 1969 to win a tennis calendar \"Grand Slam.\" Standing in the way was Daniil Medvedev, who went and did precisely what Djokovic would do, writes @JasonGay: https://t.co/EellJd1gcq",
  "data/tweet-wsj/2021/9/1437272342183432194.json": "Ray-Ban and Facebook teamed up on a pair of stylish sunglasses with...two cameras and three microphones. Here's our review. https://t.co/AyqziENW3w",
  "data/tweet-wsj/2021/9/1437276116490797057.json": "Take an early look at the front page of The Wall Street Journal https://t.co/T1YqQDyzL9 https://t.co/6GtTuB5I21",
  "data/tweet-wsj/2021/9/1437064735145537545.json": "Many New Yorkers feared that the neighborhoods around the Twin Towers would become ghost towns after Sept. 11, 2001. The opposite happened. https://t.co/KtlrdgPIwS",
  "data/tweet-wsj/2021/9/1437200637574492174.json": "Some movie fans decided to return to the familiar format of VHS tapes. It isn't the easiest hobby. https://t.co/3Hm3nFd8tS",
  "data/tweet-wsj/2021/9/1437404476311314433.json": "Natural gas and electricity markets were already surging in Europe when a fresh catalyst emerged: The wind in the stormy North Sea stopped blowing. https://t.co/XbKaMMDUfs",
  "data/tweet-wsj/2021/9/1437410765229678601.json": "House Democrats detailed their proposed tax increases, calling for raising the corporate tax rate to 26.5% from 21%, a 3-percentage-point surtax on top earners and a capital-gains tax increase https://t.co/l0TG0XYaPP",
  "data/tweet-wsj/2021/9/1437423781673324547.json": "Mark Zuckerberg has publicly said that Facebook allows its more than three billion users to speak on equal footing with the elites of politics, culture and journalism, and that its standards of behavior apply to everyone, no matter their status or fame https://t.co/Ni9eMdnesb",
  "data/tweet-wsj/2021/9/1437185515284049929.json": "Amazon, the free-shipping pioneer, is offering free college for its workers, as the competition for U.S. workers moves beyond $15 an hour  https://t.co/NTD1sI6OVb",
  "data/tweet-wsj/2021/9/1437355421191348227.json": "Covid-19 may become a routine illness like a common cold or the flu one day, scientists say. But it will take a lot to get there, as the ferocious spread of the Delta variant shows. https://t.co/wlrc211Uyq",
  "data/tweet-wsj/2021/9/1437502995810422792.json": "Simone Biles, McKayla Maroney, Maggie Nichols and Aly Raisman will testify at a Senate hearing about the FBI’s handling of an investigation into former USA Gymnastics physician Larry Nassar https://t.co/GBSo5wASr2",
  "data/tweet-wsj/2021/9/1437340291279753218.json": "The economic damage from Covid-19 travel restrictions is piling up, with more companies holding back on large investments or postponing decisions https://t.co/2AWELqhkE6",
  "data/tweet-wsj/2021/9/1437511746852462592.json": "Fox said it has acquired celebrity news platform TMZ, as the company looks to expand in digital media and unscripted content https://t.co/37FQm2uGvW",
  "data/tweet-wsj/2021/9/1437570570120572932.json": "Brazilian soccer star Neymar posted nude photos of a woman on Facebook. For most users, there would have been consequences. Internal Facebook documents reveal how he—and millions like him—get special treatment. https://t.co/kQnKMGYHle",
  "data/tweet-wsj/2021/9/1436887329260679171.json": "After losing her daughter on 9/11, Deborah Borza has spent the past 20 years involved in nearly every effort to memorialize the passengers and crew of Flight 93. She is viewing this anniversary differently. https://t.co/MAKfnlw3u1",
  "data/tweet-wsj/2021/9/1437419575910543364.json": "From @WSJopinion: The White House needs to tell—not ask—the Taliban that whoever wants to leave can do so at America’s invitation. The U.S. isn’t doing nearly enough to free those who are trapped. https://t.co/kge2BK8och",
  "data/tweet-wsj/2021/9/1437559265879805957.json": "Massachusetts Gov. Charlie Baker is enlisting the National Guard to help transport students to school as the state manages a bus driver shortage at the start of the 2021-22 school year https://t.co/WVrmK541Nc",
  "data/tweet-wsj/2021/9/1437604542166753280.json": "A Facebook program known as XCheck has given millions of celebrities, politicians and other high-profile users special treatment, a privilege many abuse, according to an extensive array of internal company documents reviewed by the Journal https://t.co/M2yU2UazBb",
  "data/tweet-wsj/2021/9/1437523686014210051.json": "Apple issued a critical security update Monday fixing a flaw that allowed silent iPhone hacks through iMessage. The vulnerability had been used in attacks by an Israeli cybersecurity firm. https://t.co/6CW2Xfr190",
  "data/tweet-wsj/2021/9/1437623403406630912.json": "Bill Gates warned six years ago that the biggest potential killer the world faced was a pandemic. Now, he says not enough is being done to prepare for the next one. https://t.co/lWG3OqQVPi",
  "data/tweet-wsj/2021/9/1437649833385463816.json": "Apple issued a critical security update fixing a flaw that allowed silent iPhone hacks through iMessage. The vulnerability had been used in attacks by an Israeli cybersecurity firm. https://t.co/GrSnqLLgDT",
  "data/tweet-wsj/2021/9/1437517725358768128.json": "The United Nations said it obtained $1 billion in pledges of fresh funds to stave off a humanitarian crisis in Afghanistan https://t.co/ZGUKP3bx5D",
  "data/tweet-wsj/2021/9/1437597008383168512.json": "Theranos launched in 2003, and by 2014 was valued at over $9 billion. Five years later, the company had dissolved, and founder Elizabeth Holmes was criminally charged with fraud. How did it all unravel? https://t.co/Tpr3xAAJX2",
  "data/tweet-wsj/2021/9/1437687590354829314.json": "Simone Biles, McKayla Maroney, Maggie Nichols and Aly Raisman will testify at a Senate hearing about the FBI’s handling of an investigation into former USA Gymnastics physician Larry Nassar https://t.co/wMgFUgVQRF",
  "data/tweet-wsj/2021/9/1437400759507750914.json": "Covid-19 deaths have climbed after the Delta surge, hitting younger unvaccinated people particularly hard https://t.co/80btHFdAvq",
  "data/tweet-wsj/2021/9/1437766866743726094.json": "“Every time I feel good about myself, I go over to Instagram, and then it all goes away.” Facebook knows Instagram is harmful to many young users—especially teen girls, its own research shows. Publicly, the tech giant plays down the app’s impact. https://t.co/UnnpCDTe29",
  "data/tweet-wsj/2021/9/1437804794035453952.json": "When researchers inside Instagram began studying young users’ experiences on the photo-sharing app, they found that nearly a third of teenage girls said the platform made negative feelings they had about their bodies worse, internal documents show https://t.co/JAvzKFc61q",
  "data/tweet-wsj/2021/9/1437827271465881605.json": "From @WSJopinion: California Gov. Gavin Newsom paints a black Republican as a white supremacist instead of debating his ideas, writes @wjmcgurn https://t.co/f444y6QU3x",
  "data/tweet-wsj/2021/9/1437634748747239424.json": "Take an early look at the front page of The Wall Street Journal https://t.co/QWw3bwFt95 https://t.co/ABkqroBvjY",
  "data/tweet-wsj/2021/9/1437823482964893700.json": "“I’m making more money...But I don’t see it because I’m paying more money for stuff now.” Low-wage workers are getting sharp raises. Inflation is eating them up. https://t.co/NmtvCoY1EO",
  "data/tweet-wsj/2021/9/1437876353769132039.json": "Dogecoin vaulted into crypto stardom this year thanks to a push from Elon Musk. Now there's a battle over who owns the trademark to the dogecoin name. https://t.co/qLEETPSOYi",
  "data/tweet-wsj/2021/9/1437883941806084096.json": "“I’m making more money...But I don’t see it because I’m paying more money for stuff now.” Low-wage workers are getting sharp raises. Inflation is eating them up. https://t.co/UZNS3sQd6p",
  "data/tweet-wsj/2021/9/1437916589920292871.json": "From @WSJopinion: The CDC has failed in its primary task of preparing the country for a pandemic and telling us how to reduce harm from the novel Covid pathogen, writes @MartyMakary https://t.co/Nhh1ywqc5o",
  "data/tweet-wsj/2021/9/1437911550556319744.json": "The Republican attorney general of Arizona filed a lawsuit Tuesday to stop the Biden administration from imposing Covid-19 vaccine requirements for tens of millions of workers, marking the first legal salvo against the president’s mandate policy https://t.co/6P0OHP8i9V",
  "data/tweet-wsj/2021/9/1437951848716058624.json": "\"We make body image issues worse for one in three teen girls.\" Facebook knows Instagram is toxic for young users. In public, it tells a different story. https://t.co/S62ieAxA9r",
  "data/tweet-wsj/2021/9/1437936727738421251.json": "Apple’s iPhone 13 launch means there are now eight models to choose from. Columnist @JoannaStern is here to help you sort them all out. https://t.co/8HU7CYLidm",
  "data/tweet-wsj/2021/9/1437869041495035907.json": "Comedian Norm Macdonald, who anchored “Weekend Update” for “Saturday Night Live” in the mid-1990s, has died from cancer at age 61 https://t.co/EOCOLes7WF",
  "data/tweet-wsj/2021/9/1437963155888553987.json": "From @WSJopinion: The more the world has learned, the more plausible the lab-leak theory of Covid’s origin has become. The latest evidence is more than 900 pages of NIH documents. https://t.co/YjJJFSd35B",
  "data/tweet-wsj/2021/9/1437940498057007111.json": "Lawmakers said they would launch a probe into Facebook’s internal research on how Instagram affects young users, prompted by a Wall Street Journal investigation that showed the company knew the app was harmful to some in that group https://t.co/WEHgXGCPOx",
  "data/tweet-wsj/2021/9/1437991247008997379.json": "California Gov. Gavin Newsom has easily defeated a recall effort led by Republicans and fueled by frustrations over his handling of the Covid-19 pandemic, according to a vote projection by the Associated Press https://t.co/a91Cqj9jA6",
  "data/tweet-wsj/2021/9/1437985796611522564.json": "Fleetwood Mac’s Lindsey Buckingham wrote “Go Your Own Way” in 1975, when he was desolate over his breakup with Stevie Nicks. “The lyrics were an honest representation of what I was feeling.” https://t.co/2c99AfNo4H",
  "data/tweet-wsj/2021/9/1438004685076582404.json": "Take an early look at the front page of The Wall Street Journal https://t.co/iIvJvCwzcg https://t.co/4as3UsZjME",
  "data/tweet-wsj/2021/9/1437955587933970432.json": "Big trucking companies say a federal vaccination and testing mandate aimed at curbing the spread of the Covid-19 virus could push more workers away from their operations and deepen upheaval in U.S. supply chains https://t.co/HUVJbk3990",
  "data/tweet-wsj/2021/9/1438018235014778883.json": "North Korea launched two ballistic missiles off its east coast, South Korean and Japanese officials said, in Pyongyang’s second weapons test in recent days https://t.co/JwGFMJofNV",
  "data/tweet-wsj/2021/9/1438012232017850375.json": "Lawmakers said they would launch a probe into Facebook’s internal research on how Instagram affects young users, prompted by a Wall Street Journal investigation that showed the company knew the app was harmful to some in that group https://t.co/6aQsZlcm1R",
  "data/tweet-wsj/2021/9/1438065105481183236.json": "\"We make body image issues worse for one in three teen girls.\" Facebook knows Instagram is toxic for young users. In public, it tells a different story. https://t.co/B16Qm2ra9M",
  "data/tweet-wsj/2021/9/1438072640338632709.json": "Take an early look at the front page of The Wall Street Journal https://t.co/7b0e8I5mMc https://t.co/OBzBrEoNO0",
  "data/tweet-wsj/2021/9/1438087727417810946.json": "President Biden is expected to meet with executives from companies including Disney, Microsoft and Walgreens to advance his vaccination requirements for the private sector https://t.co/tCQLP3XOHW",
  "data/tweet-wsj/2021/9/1437997129868496897.json": "Households making at least $1 million in income would be hit the hardest by the House Democrats' tax plan, a new analysis shows https://t.co/qiwgh47k2e",
  "data/tweet-wsj/2021/9/1438136798253826054.json": "Mark Zuckerberg said a heralded change to Facebook's algorithm would improve users' well-being. Company documents show it backfired and made the platform angrier. The CEO resisted proposals to fix it. https://t.co/2I4hCw8mUW",
  "data/tweet-wsj/2021/9/1438126434451660806.json": "ViacomCBS is investing more than $300 million in BET Studios, a new venture taking an unusual approach to landing bankable producers and screenwriters https://t.co/uPoXja2Ub3",
  "data/tweet-wsj/2021/9/1438193420300914692.json": "Simone Biles, McKayla Maroney, Aly Raisman and Maggie Nichols gave senators an emotional and unsparing account of the FBI's failures in the Larry Nassar investigation https://t.co/Irlu620X4r",
  "data/tweet-wsj/2021/9/1438212289920962570.json": "Zhao Wei spent the past two decades as China’s biggest actress-turned-mogul. Today, she’s nowhere to be found on the Chinese internet—and the mystery is why. https://t.co/SOGkoFgEXp",
  "data/tweet-wsj/2021/9/1438257980873584644.json": "Theranos told investors that its proprietary machines could run over 200 tests with tiny amounts of blood. But a former lab worker told jurors that Theranos could never handle more than 12 types of blood tests on its proprietary Edison machine. https://t.co/xewlskMiaF",
  "data/tweet-wsj/2021/9/1438263632849166337.json": "In a challenge to China, the U.S. and U.K. will help Australia build a nuclear-powered submarine as part of a new security alliance https://t.co/n6xrYM0Wt7",
  "data/tweet-wsj/2021/9/1438268945958592512.json": "Follow a timeline of SpaceX launches as the rocket company prepares to fly four civilians—a CEO, a geoscientist, a physician assistant and an aerospace employee—to orbit tonight https://t.co/TcMObjMZWt",
  "data/tweet-wsj/2021/9/1438272705460162568.json": "The Aurora police department used force against and arrested people of color, particularly Black people, at disproportionately higher rates than white people, according to the findings of a yearlong investigation by the Colorado attorney general’s office https://t.co/VsmKsXpsiS",
  "data/tweet-wsj/2021/9/1438293926310461442.json": "Elon Musk’s SpaceX just launched four civilians toward the deepest orbit Americans have traveled to in more than a decade https://t.co/PywIDg8kiR",
  "data/tweet-wsj/2021/9/1438280230494474240.json": "Pre-Covid, office workers used commutes to decompress after a stressful day. Now we’re immersing ourselves in TV drama to detach from job dramas. https://t.co/e9IZsmAsJJ",
  "data/tweet-wsj/2021/9/1438178305803497480.json": "Elon Musk founded SpaceX nearly 20 years ago in the hope of one day taking people to Mars. Follow a timeline of the rocket company's launches as it prepares to fly four civilians to orbit tonight. https://t.co/sKhSjh1LcQ",
  "data/tweet-wsj/2021/9/1438295336418742272.json": "China’s biggest actress-turned-mogul has been erased from the country's internet amid a broader clampdown on the entertainment industry, raising questions about how far the Communist Party is willing to go against celebrities—and why it targeted her https://t.co/iBvWQF53w5",
  "data/tweet-wsj/2021/9/1438317990521495554.json": "A 24-year-old cryptocurrency hedge-fund manager who lied about returns on his $90 million fund and siphoned money from its accounts to cover a lavish lifestyle was sentenced to 7½ years in prison https://t.co/56dh5CI60g",
  "data/tweet-wsj/2021/9/1438340625481535488.json": "Facebook tried to become a healthier place, and it got angrier instead. Internal documents show Mark Zuckerberg resisted proposed fixes. https://t.co/P6JohMdhQE",
  "data/tweet-wsj/2021/9/1438027319868858369.json": "From @WSJopinion: In a probably futile bid to return English words to their actual meaning, I should make clear that what makes Joe Biden an incredible president is that you can’t believe a word he says, writes @gerardtbaker https://t.co/SvRo9iuMb0",
  "data/tweet-wsj/2021/9/1438374604075061249.json": "Zhao Wei spent the past two decades as China’s biggest actress-turned-mogul. Today, she’s nowhere to be found on the Chinese internet—and the mystery is why. https://t.co/wrfgvXPDcC",
  "data/tweet-wsj/2021/9/1438344420097658881.json": "The SEC on Wednesday issued $114 million to two whistleblowers, part of the more than $1 billion the agency has now paid to individuals since its cash-for-tip program began https://t.co/Ct1EIgmLr2",
  "data/tweet-wsj/2021/9/1438302889148133376.json": "The pandemic shutdown was initially the worst hit to the U.S. economy since the Great Depression, but the fiscal response has succeeded in many respects, writes @greg_ip https://t.co/tXcIISfWZB",
  "data/tweet-wsj/2021/9/1438457655413166086.json": "Taiwan plans to use $8.7 billion to fund missiles, naval ships and other systems to deter an attack from China https://t.co/QiZUS5pZjC",
  "data/tweet-wsj/2021/9/1438465211837648900.json": "Sen. Elizabeth Warren called on regional Federal Reserve banks to ban ownership of individual stocks among their top officials https://t.co/hChK9r3WOy",
  "data/tweet-wsj/2021/9/1438476538828177411.json": "France said it had killed Adnan Abu Walid al-Sahrawi, the Islamic State leader responsible for killing four U.S. servicemen in Niger in 2017 https://t.co/hGsdCu0yVH",
  "data/tweet-wsj/2021/9/1438427515618533379.json": "On Aug. 26, the biggest movie star in China disappeared from the internet. Why it happened is a mystery. https://t.co/r8kYuGtTtI",
  "data/tweet-wsj/2021/9/1438503019528740866.json": "“Two to the body, one to the head.\" Groups are forming to teach women how to handle firearms, as a study found more women than ever are buying guns. https://t.co/NKcazcoIyY",
  "data/tweet-wsj/2021/9/1438514297798201344.json": "From @WSJopinion: If Americans are to trust their democratic institutions, and the world’s other powers are to trust America’s defense commitments, it needs to be clear that the military is under the elected President’s control https://t.co/iF4f76aAME",
  "data/tweet-wsj/2021/9/1438519647154761729.json": "France's foreign minister called the U.S.’s move a “stab in the back” after France was pushed out of a multibillion-dollar deal to supply submarines to Australia https://t.co/o8Q4Dg1rzD",
  "data/tweet-wsj/2021/9/1438266399655350276.json": "From @WSJopinion: Democrats have discovered that divvying up voters by race might not be such a good idea in the redistricting battles leading up to next year’s midterm elections, writes @jasonrileywsj\nhttps://t.co/6CX0JWKwx0",
  "data/tweet-wsj/2021/9/1438506746104860678.json": "Athletic departments reeling from pandemic losses are turning to alcohol sales, gambling partnerships and even cannabis sponsorships to raise money https://t.co/69hJrnxVja",
  "data/tweet-wsj/2021/9/1438540748190781442.json": "France said it had killed Adnan Abu Walid al-Sahrawi, the Islamic State leader responsible for the killing of four U.S. servicemen in Niger in 2017 https://t.co/5D04PhSDwz",
  "data/tweet-wsj/2021/9/1438558372236824581.json": "Internal documents describe Facebook employees’ embarrassment and frustration after decisions it made allowed users to post videos of murders, incitements to violence and advertisements for human trafficking https://t.co/dyvj5iwzA8",
  "data/tweet-wsj/2021/9/1438555351675248649.json": "The World Bank canceled a flagship economic report after an investigation concluded that senior bank management pressured staff to alter data affecting the ranking of China and other nations https://t.co/gYBJEGbMF7",
  "data/tweet-wsj/2021/9/1438276519655264257.json": "“Our approach has had unhealthy side effects.” Facebook made a heralded change to its algorithm, designed to make the platform a better place for users. It had the opposite impact, internal company documents show. https://t.co/vdaRSMGoql",
  "data/tweet-wsj/2021/9/1438628808668631048.json": "From @WSJopinion: I’m no theologian, but believe God grants us pets to see loyalty personified and to remind us that we must balance joy and delight with loss and grief in this transitory life, writes @KarlRove https://t.co/wZRU5W2ILi",
  "data/tweet-wsj/2021/9/1438610315172794374.json": "Breaking: A lawyer was indicted in connection with special counsel John Durham’s investigation into the Russia probe's origins, on charges he lied to the FBI in 2016 https://t.co/N7uG5uwLZ1",
  "data/tweet-wsj/2021/9/1438435013201178625.json": "Take an early look at the front page of The Wall Street Journal https://t.co/Lt66nVar05 https://t.co/EZ8ibLxIPh",
  "data/tweet-wsj/2021/9/1438631328250007560.json": "France said it had been betrayed by the U.S. after being pushed out of a multibillion-dollar deal to supply submarines to Australia, in what is shaping up to be among the most bitter trans-Atlantic disputes of the Biden administration’s first year https://t.co/YWfOkai9IY",
  "data/tweet-wsj/2021/9/1438669045948207104.json": "SpaceX's Inspiration4 crew, the first all-civilian mission to orbit the Earth, has traveled nearly six times around the planet https://t.co/rszIZcMUcj",
  "data/tweet-wsj/2021/9/1438703022868152325.json": "Facebook employees raised alarms about human traffickers, armed groups and a drug cartel abusing its platforms. Internal documents also show the company’s response, which in many instances was inadequate or nothing at all. https://t.co/FxKve8TZtC",
  "data/tweet-wsj/2021/9/1438695484420509698.json": "President Biden is taking a more public role to advance the roughly $3.5 trillion spending bill, touting proposed tax increases to finance the plan: \"Big corporations and the super wealthy have to start paying their fair share of taxes.” https://t.co/xcgt3VjVQO",
  "data/tweet-wsj/2021/9/1438672821861879810.json": "A Minnesota Supreme Court ruling will allow voters to decide whether to replace the Minneapolis Police Department with a new public safety agency, a proposal stemming from the killing of George Floyd https://t.co/N8VlxF7qIJ",
  "data/tweet-wsj/2021/9/1438680369939763205.json": "President Biden is taking a more public role in the negotiations around Democrats’ roughly $3.5 trillion social welfare and climate bill https://t.co/aTHOoSmFaS",
  "data/tweet-wsj/2021/9/1438623824010952712.json": "Internal documents describe Facebook employees’ embarrassment and frustration after decisions it made allowed users to post videos of murders, incitements to violence and advertisements for human trafficking https://t.co/eEISac4LXS",
  "data/tweet-wsj/2021/9/1438721916089556995.json": "Take an early look at the front page of The Wall Street Journal https://t.co/xvL9FQlNml https://t.co/b6VkQutlED",
  "data/tweet-wsj/2021/9/1438536945160933383.json": "If it seems like more people have a short fuse lately, you aren’t wrong. Just ask restaurant servers, airline workers and customer-service trackers who say they have seen a wave of meltdowns. https://t.co/kLUzYS4nJr",
  "data/tweet-wsj/2021/9/1438684160386813954.json": "If it seems like more people have a short fuse lately, you aren’t wrong. Just ask restaurant servers, airline workers and customer-service trackers who say they have seen a wave of meltdowns. https://t.co/5uuXoI4KI6",
  "data/tweet-wsj/2021/9/1438689976754085891.json": "A former Boeing pilot is expected to be charged for his alleged role in misleading regulators about 737 MAX safety, people familiar with the matter say https://t.co/mOeWXuFcUl",
  "data/tweet-wsj/2021/9/1438846466945175557.json": "The Pentagon’s top military officer said he would mount a vigorous defense of two calls he placed to his Chinese counterpart in the last days of the Trump administration, describing an effort to calm Beijing’s nerves and avert a military conflict https://t.co/Y8zmhWCWUQ",
  "data/tweet-wsj/2021/9/1438472912374276102.json": "SpaceX launched four civilians into orbit Wednesday, as Elon Musk looks to cement the company’s position as a leading space enterprise #WSJWhatsNow https://t.co/nYjIdh8gg8",
  "data/tweet-wsj/2021/9/1438884215295287300.json": "From @WSJopinion: Vaccine mandates will prolong political conflicts over Covid-19. They are an increasingly unsustainable strategy designed to achieve an unattainable goal, writes Joseph A. Ladapo https://t.co/JqAL3wTp8a",
  "data/tweet-wsj/2021/9/1438835328362614788.json": "President Biden said increasing taxes on corporations and the wealthy could help finance a $3.5 trillion social welfare and climate bill, and shape a more equitable economy #WSJWhatsNow https://t.co/g2t42XPEuU",
  "data/tweet-wsj/2021/9/1438921967445364738.json": "Rudy Giuliani asked a federal judge to return some material seized by the FBI or have it destroyed. The judge said no, allowing a review of the evidence to proceed. https://t.co/TeY1rIWWPW",
  "data/tweet-wsj/2021/9/1438943672226263045.json": "Breaking: In a major reversal, the U.S. military said that it mistakenly killed 10 Afghan civilians, including seven children, when it launched a drone strike on a car in Kabul last month, and missed its target https://t.co/RIoR8h2k4b",
  "data/tweet-wsj/2021/9/1438940854413053960.json": "The Covid-19 vaccine made by Moderna is more effective at keeping people out of the hospital than those from Pfizer and partner BioNTech or Johnson &amp; Johnson, new research suggests https://t.co/eHDNIJvlvM",
  "data/tweet-wsj/2021/9/1438955897196367876.json": "France recalled its ambassadors to the U.S. and Australia, escalating a fight over a deal to provide Australia with nuclear-powered submarine technology https://t.co/Im3jcy19zk",
  "data/tweet-wsj/2021/9/1438963499728834561.json": "A rare, first-edition copy of the U.S. Constitution, one of 11 surviving copies that were first printed for delegates at the Constitutional Convention, will go to auction in November https://t.co/x8GNAq1kNr",
  "data/tweet-wsj/2021/9/1439008825298886658.json": "Italy is making Covid-19 health passes mandatory for all workers in the private and public sectors, in one of the toughest vaccine-promoting measures adopted by any major Western country https://t.co/CFPkOL1nKL",
  "data/tweet-wsj/2021/9/1438988656811954181.json": "Judges in North Carolina blocked a state voter-identification law Friday, calling the measure unconstitutional and discriminatory toward Black voters https://t.co/hjdHS41eDR",
  "data/tweet-wsj/2021/9/1438665257182969856.json": "From @WSJopinion:  By acting swiftly, the U.S. and Taiwan can dissuade Xi Jinping from making what could be the most disastrous geopolitical calculation since 1939, write Robert C. O’Brien and Alexander B. Gray https://t.co/r2ouAccY2L",
  "data/tweet-wsj/2021/9/1439042753040629761.json": "Essay: Arguing about vaccine mandates has been an American tradition since George Washington inoculated his soldiers against smallpox, writes historian David Oshinsky https://t.co/Be074mCfue",
  "data/tweet-wsj/2021/9/1438706818721722370.json": "A new California law intended to increase housing supply will allow duplexes to be built on properties where one home exists https://t.co/Xc4RrRWgl1",
  "data/tweet-wsj/2021/9/1438983760800800770.json": "Thousands of mostly Haitian migrants are being held under a bridge in a Texas border town, creating a fresh humanitarian crisis https://t.co/W40neA0nQ3",
  "data/tweet-wsj/2021/9/1439080497200521218.json": "The Covid-19 vaccine made by Moderna is more effective at keeping people out of the hospital than those from Pfizer and partner BioNTech or Johnson &amp; Johnson, new research suggests https://t.co/uhIpamdwXG",
  "data/tweet-wsj/2021/9/1439057861074735109.json": "Mark Zuckerberg wanted Facebook to promote Covid-19 vaccines. Internal documents show the site struggled to manage a wave of antivaccine rhetoric. https://t.co/iib4yBtQS0",
  "data/tweet-wsj/2021/9/1439099390032064514.json": "On Aug. 26, the biggest movie star in China disappeared from the internet. Why it happened is a mystery. https://t.co/JADVEFJb6s",
  "data/tweet-wsj/2021/9/1438964741624541191.json": "An FDA panel endorsed booster shots for people aged 65 and older, and those at high risk of severe Covid. It earlier rejected boosters for people 16 and older. https://t.co/ajIkDLnkrW",
  "data/tweet-wsj/2021/9/1439150240486023170.json": "Teenage Afghan girls weren’t allowed to return to school as classrooms reopened for the first time since the Taliban reclaimed power  https://t.co/53w0tBvrAA",
  "data/tweet-wsj/2021/9/1439122081547964418.json": "“Two to the body, one to the head.\" Groups are forming to teach women how to handle firearms, as a study found more women than ever are buying guns. https://t.co/ZJ5eayb95Z",
  "data/tweet-wsj/2021/9/1439205093727948802.json": "“Every time I feel good about myself, I go over to Instagram, and then it all goes away.” Facebook knows Instagram is harmful to many young users—especially teen girls, its own research shows. Publicly, the tech giant plays down the app’s impact. https://t.co/fYoT29h5z3",
  "data/tweet-wsj/2021/9/1439227823890255873.json": "Bill Gates warned six years ago that the biggest potential killer the world faced was a pandemic. Now, he says not enough is being done to prepare for the next one. https://t.co/3Q334aihbI",
  "data/tweet-wsj/2021/9/1439144695842676738.json": "SpaceX’s crew of private astronauts has spent its first two days in space chatting with children and Tom Cruise, conducting research and taking in views of the planet hundreds of miles away https://t.co/NaCjeohFHb",
  "data/tweet-wsj/2021/9/1439084302055182336.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/Pa75JU7SEA https://t.co/P4GrkDqMBT",
  "data/tweet-wsj/2021/9/1438993687661449216.json": "Mark Zuckerberg set out to make Facebook an authoritative voice to get Americans vaccinated. Instead, the site hosted \"cesspools of anti-vaccine comments,\" according to company documents. https://t.co/86umut6803",
  "data/tweet-wsj/2021/9/1439273122021232649.json": "At Tampa General Hospital, about 90% of recent Covid-19 patients were unvaccinated, and those in intensive care were 46 years old on average. “These are working people, they’re people with families and children they’re still raising.” https://t.co/BunekkyuQc",
  "data/tweet-wsj/2021/9/1439280598204420097.json": "Measles shots last for life. Chickenpox immunizations protect for decades. But the current crop of Covid-19 vaccinations weaken in just months. Here’s why. https://t.co/7c6VXVKm9p",
  "data/tweet-wsj/2021/9/1439257997809790980.json": "A 24-year-old cryptocurrency hedge-fund manager who lied about returns on his $90 million fund and siphoned money from its accounts to cover a lavish lifestyle was sentenced to 7½ years in prison https://t.co/pIFMYxH4WK",
  "data/tweet-wsj/2021/9/1439303231847510025.json": "A rally by Trump supporters protesting the prosecutions of hundreds of people charged in the Jan. 6 riot at the U.S. Capitol ended without the violence on Saturday https://t.co/LC5Bwp95gg",
  "data/tweet-wsj/2021/9/1439177118131359746.json": "Russia’s deepening integration with Belarus is presenting a fresh military threat to Western-backed Ukraine, which Moscow is trying to draw back into its orbit https://t.co/UtbbwBVtZJ",
  "data/tweet-wsj/2021/9/1439299456025903109.json": "The Biden administration said it is sending additional border agents to a South Texas town where thousands of Haitian migrants are being held under a bridge, as officials prepared to begin flying them back to their home country https://t.co/zcyUeuZ7Y5",
  "data/tweet-wsj/2021/9/1439307006062518275.json": "A Facebook program known as XCheck has given millions of celebrities, politicians and other high-profile users special treatment, a privilege many abuse, according to an extensive array of internal company documents reviewed by the Journal https://t.co/TUj7c7GMmg",
  "data/tweet-wsj/2021/9/1439333477304967168.json": "Mark Zuckerberg said a heralded change to Facebook's algorithm would improve users' well-being. Company documents show it backfired and made the platform angrier. The CEO resisted proposals to fix it. https://t.co/MmyzBzmb3w",
  "data/tweet-wsj/2021/9/1439329650379984896.json": "“Two to the body, one to the head.\" Groups are forming to teach women how to handle firearms, as a study found more women than ever are buying guns. https://t.co/oMQ4bBnhQ6",
  "data/tweet-wsj/2021/9/1439359840237858816.json": "Arguing about vaccine mandates has been an American tradition since George Washington inoculated his soldiers against smallpox, writes historian David Oshinsky. https://t.co/Qv2jByHalI",
  "data/tweet-wsj/2021/9/1439368691515379715.json": "Four private astronauts launched by SpaceX have returned to Earth, completing the first trip to orbit by non-government astronauts on a company's spaceship https://t.co/4bdYb2pDaf",
  "data/tweet-wsj/2021/9/1439386296070418436.json": "From @WSJopinion: American public health agencies should be producing data on breakthrough infections, boosters and natural immunity, writes @MartyMakary. But the CDC has failed to provide the information needed to inform a sound Covid strategy. https://t.co/okfofrtRlW",
  "data/tweet-wsj/2021/9/1439378771459592192.json": "Fleetwood Mac’s Lindsey Buckingham wrote “Go Your Own Way” in 1975, when he was desolate over his breakup with Stevie Nicks. “The lyrics were an honest representation of what I was feeling.” https://t.co/Zi2qVhyXWJ",
  "data/tweet-wsj/2021/9/1438801177618026501.json": "A trio of Chinese astronauts landed back on Earth after three months in space, setting a record for China's longest stay in orbit https://t.co/CXPiqqcqE3",
  "data/tweet-wsj/2021/9/1439322109138898952.json": "The National Institutes of Health is reviewing its policies after gene data holding potential clues to the Covid-19 pandemic was removed from an agency-run archive, sparking concerns among scientists and U.S. senators https://t.co/qeFGSZ596f",
  "data/tweet-wsj/2021/9/1439476890511843329.json": "Biden has said all lead pipes in the country’s drinking-water system would be eliminated as part of his broader efforts to improve U.S. infrastructure https://t.co/4i1yeQ6AHZ",
  "data/tweet-wsj/2021/9/1439417072371515392.json": "NFL trainer Sonia Ruef’s maintenance program for knees is is suited for anyone https://t.co/w6IrUqWATF",
  "data/tweet-wsj/2021/9/1439499543842787330.json": "Essay: Arguing about vaccine mandates has been an American tradition since George Washington inoculated his soldiers against smallpox, writes historian David Oshinsky https://t.co/ISrTn4ObWY",
  "data/tweet-wsj/2021/9/1439284357173334020.json": "Boeing is investigating the discovery of two empty miniature liquor bottles found this month on one of the plane maker's new Air Force One jets under development in San Antonio https://t.co/wRSeeEYIxN",
  "data/tweet-wsj/2021/9/1439552378924109827.json": "From @WSJopinion: I’m no theologian, but believe God grants us pets to see loyalty personified and to remind us that we must balance joy and delight with loss and grief in this transitory life, writes @KarlRove https://t.co/JSJUMn0cgj",
  "data/tweet-wsj/2021/9/1439288187889889281.json": "Facebook knows, in acute detail, that its platforms are riddled with flaws but hasn’t fixed them. That’s one of the main findings of a Journal series, based heavily on an array of internal company documents. Catch up on the articles we’ve published so far. https://t.co/XFJRnqqOko",
  "data/tweet-wsj/2021/9/1439571235067908096.json": "At Tampa General Hospital, about 90% of recent Covid-19 patients were unvaccinated, and those in intensive care were 46 years old on average. “These are working people, they’re people with families and children they’re still raising.” https://t.co/8g056Lzn6v",
  "data/tweet-wsj/2021/9/1439578788082368513.json": "Mark Zuckerberg said a heralded change to Facebook's algorithm would improve users' well-being. Company documents show it backfired and made the platform angrier. The CEO resisted proposals to fix it. https://t.co/HZGtYs9Ags",
  "data/tweet-wsj/2021/9/1439522180161749001.json": "Fully vaccinated Americans have been allowed to enter Canada for leisure and tourism since early August, but some are so flummoxed by the rules that they are canceling or postponing their travel plans https://t.co/ISCWFC66xy",
  "data/tweet-wsj/2021/9/1439601442621435908.json": "Former President Donald Trump has spoken recently with senators and allies about trying to depose Mitch McConnell as Senate GOP leader and whether any Republicans are interested in mounting a challenge, people familiar with the conversations said https://t.co/4aHTLwJEmh",
  "data/tweet-wsj/2021/9/1438850296415916032.json": "“We created the machine and we can’t control the machine.\" How Facebook turned into a tool for Covid-19 vaccine opponents, dashing Mark Zuckerberg's ambition to support the rollout. https://t.co/DrCrgQ9nr9",
  "data/tweet-wsj/2021/9/1439642990826360838.json": "Facebook knows Instagram is harmful to many young users—especially teen girls, its own research shows. Publicly, the tech giant plays down the app’s impact. https://t.co/WKevWiltpg",
  "data/tweet-wsj/2021/9/1439673182336782341.json": "Bill Gates warned six years ago that the biggest potential killer the world faced was a pandemic. Now, he says not enough is being done to prepare for the next one. https://t.co/7jShZHHn1J",
  "data/tweet-wsj/2021/9/1439677035673276422.json": "Teenage Afghan girls weren't allowed to return to school on Saturday as classrooms across the country reopened for the first time since the Taliban took power, raising fears that the new government will permanently ban secondary education for girls https://t.co/dfiS14E14v",
  "data/tweet-wsj/2021/9/1439514626778181634.json": "Why Shiv Roy’s high-waisted power pants on ‘Succession’ have earned a cult following https://t.co/Rf4RfKiMCl",
  "data/tweet-wsj/2021/9/1439680712781836297.json": "Measles shots last for life. Chickenpox immunizations protect for decades. But the current crop of Covid-19 vaccinations weaken in just months. Here’s why. https://t.co/dutzXiBsoe",
  "data/tweet-wsj/2021/9/1439710935225098247.json": "One of the best places to watch airplanes land just happens to be a strip of trampled grass by an In-N-Out Burger in Los Angeles: “This is one of my favorite places on Earth.” https://t.co/zRnva9uKBc",
  "data/tweet-wsj/2021/9/1439718499069448199.json": "The diplomatic rupture with France over a new security pact among the U.S., Australia and the U.K. shows the Biden administration is struggling to maintain unity even among its closest friends https://t.co/uipOea5xMt",
  "data/tweet-wsj/2021/9/1439751991308267522.json": "\"The Crown\" wins for outstanding directing for a drama series and outstanding writing for a drama series at the #Emmys https://t.co/PG6tZikgef",
  "data/tweet-wsj/2021/9/1439774026373664768.json": "\"The Queens Gambit\" wins for outstanding directing for a limited or anthology series or movie at the #Emmys https://t.co/qQ21IsYSni",
  "data/tweet-wsj/2021/9/1439765933132759048.json": "Jean Smart wins for lead actress in a comedy series at the #Emmys for her role as Deborah, a Las Vegas comic who needs to revitalize her act, in \"Hacks\" https://t.co/pmJePzWr8d",
  "data/tweet-wsj/2021/9/1439743984914640897.json": "Taking home the first #Emmy of the night, Hannah Waddingham wins supporting actress in a comedy series for \"Ted Lasso\" https://t.co/rJfS54wDXC",
  "data/tweet-wsj/2021/9/1439776062511194114.json": "Michaela Coel wins for outstanding writing for a limited or anthology series or movie at the #Emmys for \"I May Destroy You\" https://t.co/PkbVl2NjxD",
  "data/tweet-wsj/2021/9/1439747969943748609.json": "Julianne Nicholson wins for supporting actress in a limited series or movie at the #Emmys for her role in \"Mare of Easttown\" https://t.co/6B6LyNCBwt",
  "data/tweet-wsj/2021/9/1439729788202196992.json": "Dr. Anthony Fauci and NIH Director Francis Collins have said they expect broader approval for Covid-19 booster shots in the coming weeks, and urged patience from the public https://t.co/MfVQWFSXrR",
  "data/tweet-wsj/2021/9/1439789747740811267.json": "\"The Queens Gambit\" wins for best-limited series at the #Emmys https://t.co/DXIdp5pjF9",
  "data/tweet-wsj/2021/9/1439700938172870662.json": "An estimated 13,000 migrants, many from Haiti, are now in Del Rio, Texas, traveling back and forth to Mexico for supplies as they wait in a makeshift camp  https://t.co/4OQ0AVl17A",
  "data/tweet-wsj/2021/9/1439751401106776065.json": "Democrats can’t include a pathway to citizenship for millions of immigrants in their $3.5 trillion budget proposal, the Senate parliamentarian has ruled https://t.co/jQkKYw3kRE",
  "data/tweet-wsj/2021/9/1439824164987097091.json": "Facebook employees raised alarms about human traffickers, armed groups and a drug cartel abusing its platforms. Internal documents also show the company’s response, which in many instances was inadequate or nothing at all. https://t.co/BsN6BEEMM5",
  "data/tweet-wsj/2021/9/1439737346803568651.json": "An Afghan family left behind everything but hope for a new life in America. \"In Kandahar, when we sent the children to school, we weren't sure if they would come back alive.\" https://t.co/gSemh5lIaS",
  "data/tweet-wsj/2021/9/1439812850827018241.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/PqT59bTalR",
  "data/tweet-wsj/2021/9/1439904756814782465.json": "Pfizer and BioNTech said their Covid-19 vaccine was found to be safe and generated a strong immune response in children aged 5 to 11 years in a late-stage study https://t.co/20P6ipdQ19",
  "data/tweet-wsj/2021/9/1439908387370766337.json": "CVS, the largest U.S. pharmacy chain by stores, said it plans to add 25,000 employees this week in a single-day hiring spree to prepare for a potential surge in demand for Covid-19 booster shots https://t.co/RrFANdGfQX",
  "data/tweet-wsj/2021/9/1439958701310283782.json": "The U.S. will replace travel bans on Europe, China and other countries by requiring foreign nationals to show proof of Covid vaccination, people familiar with the matter said https://t.co/DBnjD4DaEI",
  "data/tweet-wsj/2021/9/1439982753974530061.json": "What’s behind China’s moves against Alibaba, Tencent and Didi, as well as the Evergrande turmoil? Xi Jinping is trying to roll back a decadeslong evolution toward Western-style capitalism. https://t.co/44NMc4yRzd",
  "data/tweet-wsj/2021/9/1440020491998318595.json": "AstraZeneca said its breast cancer drug Enhertu significantly reduced the risk of dying or disease progression in women with advanced disease in a large clinical trial https://t.co/7x3WW1qiAe",
  "data/tweet-wsj/2021/9/1440036325684441093.json": "President Biden is raising the U.S. refugee admissions cap to 125,000 from 62,500, a person familiar with the matter said, in line with his goal from the 2020 campaign https://t.co/MHSMQX7hXA",
  "data/tweet-wsj/2021/9/1440029264116654080.json": "iOS 15 is here, with helpful new tools such as Focus mode and Live Text. But before you download it, read through columnist @JoannaStern’s list of the biggest changes coming your way. https://t.co/AL88cWGB1d",
  "data/tweet-wsj/2021/9/1440031489274482702.json": "The SEC is investigating Activision over its handling of employee claims of sexual misconduct and discrimination, people familiar with the matter say https://t.co/wHNnMZJJfq",
  "data/tweet-wsj/2021/9/1440007911061786626.json": "Stocks suffered their steepest losses in weeks, with the Dow falling more than 750 points, or 2.2%. The S&amp;P 500 and Nasdaq also fell more than 2%. https://t.co/Yywe3PjpMi",
  "data/tweet-wsj/2021/9/1440080852931600387.json": "The U.S. death toll from Covid-19 has topped 675,000, more people than the flu pandemic of 1918-19 killed nationwide, during a health crisis for which no vaccines were then available https://t.co/Je0mTUDxIS",
  "data/tweet-wsj/2021/9/1440046871683108870.json": "From @WSJopinion: We are finally emerging from the pandemic crisis. Let’s not plunge ourselves into a financial one, writes @SecYellen. https://t.co/DHP3pizhqf",
  "data/tweet-wsj/2021/9/1440152578252161028.json": "The U.S. death toll from Covid-19 has topped 675,000, more people than the flu pandemic of 1918-19 killed nationwide, during a health crisis for which no vaccines were then available https://t.co/ImrW2GwzQs",
  "data/tweet-wsj/2021/9/1440073381806698503.json": "China’s most market-friendly official had to offer a Mao-style self-criticism for not having stopped rideshare giant Didi from launching an IPO. This is what it looks like as Xi unravels decades of pro-Western economic policy. https://t.co/KrAKlKFqYg",
  "data/tweet-wsj/2021/9/1440058237299036163.json": "Twitter said it agreed to pay more than $800 million to settle a consolidated class-action securities lawsuit alleging the social-media company deliberately misled investors about user engagement in 2015 https://t.co/icrdWnJvPC",
  "data/tweet-wsj/2021/9/1440163962767642628.json": "What’s behind China’s moves against Alibaba, Tencent and Didi, as well as the Evergrande turmoil? Xi Jinping is trying to roll back a decadeslong evolution toward Western-style capitalism https://t.co/FrH3CjLLbq",
  "data/tweet-wsj/2021/9/1440156372142735360.json": "An Afghan family left behind everything but hope for a new life in America. “Life in America is very good. There is security. My children can have an education without fear.” https://t.co/Z5DvlLHbxO",
  "data/tweet-wsj/2021/9/1440171486858252294.json": "Take an early look at the front page of The Wall Street Journal https://t.co/TZELK7rCWw https://t.co/10k12BvuLU",
  "data/tweet-wsj/2021/9/1440146412046467074.json": "Canada's Justin Trudeau appeared headed toward a third-straight electoral victory, although how big a win was unclear as vote count continues https://t.co/20CUt8hSKp",
  "data/tweet-wsj/2021/9/1440160138543845382.json": "U.S. futures edged higher Tuesday, suggesting American markets could regain some after concerns about the Chinese property sector helped fuel a global selloff Monday https://t.co/5JuRpShvGd",
  "data/tweet-wsj/2021/9/1440267563628331011.json": "Johnson &amp; Johnson says a booster dose of its Covid-19 vaccine administered two months after the first shot can increase protection against symptomatic illness https://t.co/ujc9YafYe9",
  "data/tweet-wsj/2021/9/1440129923260223488.json": "The FBI executed a search warrant Monday at the home of Brian Laundrie, the fiancé of Gabby Petito, a 22-year-old Florida woman who was believed to be found dead in Wyoming https://t.co/77UwK5QS7K",
  "data/tweet-wsj/2021/9/1440288460372267022.json": "Dozens of companies signed a statement saying Texas's abortion law “threatens the health, independence, and economic stability of our workers and customers.” Starbucks and Microsoft were among the companies that declined to participate. https://t.co/kgjujuZ9K5",
  "data/tweet-wsj/2021/9/1440298312251285507.json": "Google said it is buying a Manhattan building for $2.1 billion, the most expensive sale of a single U.S. office building since the start of the pandemic https://t.co/iiLWZe6vKT",
  "data/tweet-wsj/2021/9/1440254524208287749.json": "Apple is working on iPhone features to help diagnose depression and cognitive decline that would expand its health portfolio, people familiar and documents say https://t.co/RPXpJ8na15",
  "data/tweet-wsj/2021/9/1440301316232732683.json": "With all the upgrade pressure from Apple and the carriers, you need an iPhone 13 review that gets beyond the hype to what matters most for you. Read @JoannaStern’s review. https://t.co/XQemQ4UFsd",
  "data/tweet-wsj/2021/9/1440311125338329102.json": "Mental-health problems can spread between companies when new hires come from environments high in depression, anxiety and stress, a study finds  https://t.co/mLgJBsQ5Ys",
  "data/tweet-wsj/2021/9/1440296024375918599.json": "The boss of beleaguered China Evergrande said he expects the developer to emerge soon from what he called its \"darkest moment\" https://t.co/3R4isx0VyA",
  "data/tweet-wsj/2021/9/1440316178178588684.json": "President Biden is addressing the U.N. General Assembly, trying to make a case for global cooperation as U.S. relations with some allies are strained. Watch live. https://t.co/92j2zP6sEQ",
  "data/tweet-wsj/2021/9/1440303549531963392.json": "It’s been 20 years in the making: Universal Studios has now opened its first theme park in Beijing, a multibillion-dollar bet on Chinese consumers’ demand for Hollywood experiences #WSJWhatsNow https://t.co/dlIKAOp5Gl",
  "data/tweet-wsj/2021/9/1440330067612094475.json": "Two advocacy groups said two senior Federal Reserve officials who traded stocks and other investments while setting monetary policy should lose their jobs https://t.co/AwJYpQXooC",
  "data/tweet-wsj/2021/9/1440333762223509506.json": "Container ships keep joining the Southern California ports backup. Here’s why they can’t sail around the bottleneck. https://t.co/Mxb3A44MP1",
  "data/tweet-wsj/2021/9/1440317905153888258.json": "The Justice Department is set to challenge American Airlines’ partnership with JetBlue on antitrust grounds, people familiar with the matter say https://t.co/Xp2ho5PxYP",
  "data/tweet-wsj/2021/9/1440352699002720258.json": "“I am very excited and relieved.” With a children’s Covid-19 vaccine one step closer, some parents can’t wait. https://t.co/t1FpG9XdhP",
  "data/tweet-wsj/2021/9/1440137467177299975.json": "From @WSJopinion: Men adrift—not keeping up in school, struggling to form families and succeed—will eventually have profound consequences, write Richard Vedder and Braden Colegrove https://t.co/6dXpjSRY1f",
  "data/tweet-wsj/2021/9/1440371519029317633.json": "Evergrande is a wake-up call, with serious implications for investors around the world https://t.co/zrFfNrzmnK",
  "data/tweet-wsj/2021/9/1440290836302876673.json": "Bitcoin fell sharply on Monday as jitters over China’s indebted property sector hit the crypto markets #WSJWhatsNow https://t.co/ACxUKQUuAL",
  "data/tweet-wsj/2021/9/1440375378736939009.json": "The Taliban named several outsiders and members of ethnic minorities to government positions following criticism that their administration was composed entirely of the Islamist movement’s clerics, but none were women or for key roles https://t.co/vB1vlMRLDv",
  "data/tweet-wsj/2021/9/1440360209071755269.json": "The U.S. is opening its borders to foreign air travelers just as Europe is starting to fly again, promising a fresh boost for an industry among the hardest hit by Covid-19 https://t.co/oD1pNR3knf",
  "data/tweet-wsj/2021/9/1440408001458827268.json": "What did Earth, Wind &amp; Fire's song about the 21st of September really mean? The group's founder has the backstory on this 1978 hit. https://t.co/BcAKnkVo5Z",
  "data/tweet-wsj/2021/9/1440428130611515395.json": "Securities and Exchange Commission Chair Gary Gensler said Tuesday he doesn’t see much long-term viability for cryptocurrencies, and that the history of \"wildcat banking\" in the U.S. shows limited viability for private forms of money https://t.co/bQz8LiqKp1",
  "data/tweet-wsj/2021/9/1440465925078020100.json": "What did Earth, Wind &amp; Fire's song about the 21st of September really mean? The group's founder has the backstory on this 1978 hit. https://t.co/bSSgrcKj9W",
  "data/tweet-wsj/2021/9/1440437354645229571.json": "A coroner confirmed that a body found in a remote part of the Bridger-Teton National Forest in Wyoming is Gabby Petito and said her death was likely a homicide https://t.co/ejuZ7ScMZx",
  "data/tweet-wsj/2021/9/1440458347358998529.json": "Chinese President Xi Jinping pledged Beijing will stop building coal-fired power plants abroad, in a public commitment to redirect the country’s huge engineering industry away from adding to a source of global pollution https://t.co/N2CbjBArkl",
  "data/tweet-wsj/2021/9/1440382771562618885.json": "The U.S. is reviewing Zoom’s deal to buy American software company Five9, citing potential national-security risks posed by the videoconferencing giant’s ties to China https://t.co/RGDSXV38mj",
  "data/tweet-wsj/2021/9/1440548956426031106.json": "Evergrande is a wake-up call, with serious implications for investors around the world https://t.co/KOiLHZoz37",
  "data/tweet-wsj/2021/9/1440628208815144973.json": "Former President George W. Bush’s first campaign event of the 2022 midterms will be a fundraiser to support Rep. Liz Cheney https://t.co/36lOCS8M00",
  "data/tweet-wsj/2021/9/1440246961492299782.json": "Take an early look at the front page of The Wall Street Journal https://t.co/igWveofGrS https://t.co/OV6CzSLzON",
  "data/tweet-wsj/2021/9/1440639540327157782.json": "The U.S. will donate 500 million additional doses of the Pfizer Covid-19 vaccine to developing countries, President Biden is expected to announce https://t.co/1h8rWZ8HRm",
  "data/tweet-wsj/2021/9/1440601794732703748.json": "Chinese President Xi Jinping said Beijing would stop building coal-fired power plants abroad, in a public commitment to redirect the country’s huge engineering industry away from adding to a source of global pollution https://t.co/dfiAFQ6gz8",
  "data/tweet-wsj/2021/9/1440654650747678722.json": "Invesco, one of the biggest operators of exchange-traded funds in the U.S., is making plans to roll out a lineup of funds backed by bitcoin and other cryptocurrencies https://t.co/t5HiIzyI3K",
  "data/tweet-wsj/2021/9/1440647149734166537.json": "A day after the fall of Kabul the Taliban contacted the capital’s mayor to tell him they guaranteed his security. Now, he’s back at his desk. https://t.co/lU7cx4js1U",
  "data/tweet-wsj/2021/9/1440666078502289413.json": "Pfizer wanted to study its Covid-19 vaccine in pregnant women, but then the shots became widely available; “It’s hard to enthusiastically recommend the study when you’ve got a vaccine out there,” says one doctor https://t.co/1wKxQBbMiL",
  "data/tweet-wsj/2021/9/1440669711889436681.json": "Lava erupting from a volcano in La Palma, Spain, has destroyed homes, crops and warehouses #WSJWhatsNow https://t.co/knxzBbxkQT",
  "data/tweet-wsj/2021/9/1440658400304459785.json": "Natural-gas supply shortfalls have led to record prices for the fuel and electricity, stoking fears of a shortage and spotlighting European efforts to cut greenhouse-gas emissions https://t.co/HCxjj0kkWg",
  "data/tweet-wsj/2021/9/1440635764287565832.json": "Embattled China Evergrande Group’s flagship property business said it would make an interest payment on an onshore bond https://t.co/WS351ocdlU",
  "data/tweet-wsj/2021/9/1440681076549062658.json": "From @WSJopinion: Democrats started with a bad voting bill that was gigantic, and they’ve whittled it into a bad voting bill that’s merely enormous. It still deserves to die. https://t.co/uQf6x26swt",
  "data/tweet-wsj/2021/9/1440687025271705607.json": "The hot U.S. housing market is showing signs of cooling off. Prices in August eased from near-record highs, and home sales dropped. https://t.co/bwe4Dvnibt",
  "data/tweet-wsj/2021/9/1440684815120961544.json": "Google said it is buying a New York City office building for $2.1 billion, even as the tech giant embraces remote work. @davidhodari explains. #WSJWhatsNow https://t.co/4w2S3B9K6j",
  "data/tweet-wsj/2021/9/1440677287855149069.json": "Women’s health clinics in Louisiana, Oklahoma and beyond are reporting an influx of out-of-state patients from Texas looking for abortions and other services, weeks after the U.S. Supreme Court allowed Texas’s restrictive abortion law to take effect https://t.co/tam523YbMi",
  "data/tweet-wsj/2021/9/1440692407192805376.json": "The U.S. began flying some migrants back to Haiti, a country where many haven’t lived for years and that is reeling from a recent earthquake, a presidential assassination and gang violence. “I can’t go home,” one woman said. “There is no law or safety.” https://t.co/cjrOG7g66e",
  "data/tweet-wsj/2021/9/1440719519673040908.json": "Burger King this year plans to test serving burgers in reusable sandwich boxes and pouring drinks in reusable cups https://t.co/SB88NJ5L5t",
  "data/tweet-wsj/2021/9/1440673503749951500.json": "Ida is poised to join Katrina, Sandy, Harvey and Irma on the list of the top five costliest hurricanes as measured by insured losses https://t.co/5GjgqkhdcG",
  "data/tweet-wsj/2021/9/1440707550102491136.json": "This 1960 Karmann Ghia is somewhere between a Porsche and a VW Beetle, and is a pretty rare sight in Alaska https://t.co/UkaQTfMGAw #WSJWhatsNow https://t.co/F79PKd879I",
  "data/tweet-wsj/2021/9/1440613116723675138.json": "The deal allows the streaming giant to develop new content using the popular children’s author’s stories and characters  https://t.co/pHdZYhKMe3",
  "data/tweet-wsj/2021/9/1440757816185081856.json": "The U.S. will donate 500 million additional doses of the Pfizer Covid-19 vaccine to developing countries, President Biden said Wednesday https://t.co/zccj104yn0",
  "data/tweet-wsj/2021/9/1440292291260739584.json": "A cottage industry has sprung up of startups that help home buyers make cash offers, especially move-up buyers who need to buy a home before they sell their current one  https://t.co/j3kpugs4iZ",
  "data/tweet-wsj/2021/9/1440514961017507843.json": "Progressives have signaled they won’t back the roughly $1 trillion bipartisan infrastructure bill until their separate $3.5 trillion climate and social-welfare package also advances https://t.co/4MaZvBwhok",
  "data/tweet-wsj/2021/9/1440700098044850179.json": "The gathering of thousands of Haitians at the Texas-Mexico border this past week reflects a stark change in migration patterns to the U.S. https://t.co/Mw3AVNl9PT",
  "data/tweet-wsj/2021/9/1440854722458570752.json": "Unvaccinated Brazilian President Jair Bolsonaro was self-isolating after a member of his delegation tested positive for the virus that causes Covid-19 during Bolsonaro's trip to the UN's General Assembly in New York https://t.co/lYrG5MiAVi",
  "data/tweet-wsj/2021/9/1440738486852603904.json": "The Fed signaled it could start reversing its pandemic stimulus programs in November and could raise interest rates next year https://t.co/XBXEZRnXfb",
  "data/tweet-wsj/2021/9/1440903779675787264.json": "President Biden plans to nominate a law professor who has criticized Wall Street banks to oversee some of the largest U.S. lenders, according to people familiar with the matter https://t.co/eACxrZnXd5",
  "data/tweet-wsj/2021/9/1440984884210774021.json": "China is telling authorities to prepare for Evergrande's potential collapse, officials say, signaling a reluctance to bail out the debt-saddled developer https://t.co/OtDQ8ViJsX",
  "data/tweet-wsj/2021/9/1440733901253595137.json": "The troubles engulfing Chinese property developer Evergrande have prompted comparisons to the failure of Lehman Brothers in 2008, writes @greg_ip https://t.co/Y0pEmfvrSx",
  "data/tweet-wsj/2021/9/1440896247225782277.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/2hm0zF5lUw",
  "data/tweet-wsj/2021/9/1440975496230096898.json": "The Biden administration is seeking more information from companies struggling with the global chip shortage, an effort designed to increase transparency in supply chains and ease bottlenecks https://t.co/kB0d8KQKY5",
  "data/tweet-wsj/2021/9/1440960389039206400.json": "Emblematic of the cooling U.S.-German relationship: Angela Merkel declined the offer of being Joe Biden’s first call as president. She would be at her cottage, gardening. https://t.co/lyTr4bJeCK",
  "data/tweet-wsj/2021/9/1440949103152750592.json": "Ghee is pure butterfat and culinary gold. Its nutty flavor and high smoke point make it super versatile as well as delicious. https://t.co/4ryhScee81",
  "data/tweet-wsj/2021/9/1440624430066012165.json": "Just 20 Medicare insurers collected more than half of $9.2 billion in U.S. government payments generated by controversial billing practices, federal health investigators said https://t.co/cPraOSgY7t",
  "data/tweet-wsj/2021/9/1440971736472817665.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/4r60FHWVG2",
  "data/tweet-wsj/2021/9/1440816941803859971.json": "What Is China Evergrande, and why is its crisis worrying markets? Here are some answers https://t.co/tKcr8H3gb2",
  "data/tweet-wsj/2021/9/1441107950785810432.json": "A new discovery reveals humans were living in the American Southwest alongside dire wolves and mammoths, far earlier than scientists thought https://t.co/RUsPXRDaG7",
  "data/tweet-wsj/2021/9/1440526321818345479.json": "A coroner confirmed that a body found in a remote part of the Bridger-Teton National Forest in Wyoming is Gabby Petito and said her death was likely a homicide https://t.co/QIgMcR6qrL",
  "data/tweet-wsj/2021/9/1441190079012106243.json": "A House committee has subpoenaed four former Trump officials, including Mark Meadows and Steve Bannon, as part of a probe into the Jan. 6  assault on the U.S. Capitol https://t.co/aUT9wCa1Tj",
  "data/tweet-wsj/2021/9/1441085001269846026.json": "Fat Bear Week in Alaska is expanding. This year, cubs are competing in their own bracket. “It’s time they get the recognition they deserve.” https://t.co/2m4KmPvVE9",
  "data/tweet-wsj/2021/9/1441209532324089865.json": "A new discovery reveals humans were living in the American Southwest alongside dire wolves and mammoths, far earlier than scientists thought https://t.co/s1CfT0VVC0",
  "data/tweet-wsj/2021/9/1441077471516848129.json": "From @WSJopinion: Biden has said, \"I am a capitalist\" and \"I am not a socialist.\" Both statements are false, writes @DanHenninger https://t.co/29MvsXofML",
  "data/tweet-wsj/2021/9/1441003962635857920.json": "The FDA authorized a third dose of Pfizer’s Covid-19 vaccine for people aged 65 or older and those at high-risk of severe disease, including from their jobs #WSJWhatsNow https://t.co/JlSiArXhgB",
  "data/tweet-wsj/2021/9/1441232198854713346.json": "From @WSJopinion: Even with climate change, the world isn’t doomed, writes @BjornLomborg. Humanity has overcome far greater problems before and can do so again. https://t.co/0jnwSh2Oy8",
  "data/tweet-wsj/2021/9/1441213319235477504.json": "\"I have become a complete plant nerd.\" Buildings that incorporate plants, outdoor space and natural ventilation are growing in popularity, especially in places where these features are hard to come by. https://t.co/YoUvcOAgg8",
  "data/tweet-wsj/2021/9/1441137862225711104.json": "Five deaths. A missing rifle. Alleged embezzlement. A powerful family. The inside story of Alex Murdaugh, the lawyer who tried to stage his own murder. “The shoes drop on this caterpillar every single day.” https://t.co/gI2l07UITX",
  "data/tweet-wsj/2021/9/1441273717288407048.json": "The Biden administration is seeking more information from companies struggling with the global chip shortage, an effort designed to increase transparency in supply chains and ease bottlenecks https://t.co/jqczqz2hsR",
  "data/tweet-wsj/2021/9/1441350621857202178.json": "China’s central bank said all cryptocurrency-related transactions are illegal. The price of bitcoin fell. https://t.co/kSiaT3gy7e",
  "data/tweet-wsj/2021/9/1441357337130778624.json": "“They’ve promised to kill me”: Some 200 female Afghan lawyers and judges, unemployed and vulnerable to Taliban retribution, remain stuck in Kabul https://t.co/I5qP3Rbc4a",
  "data/tweet-wsj/2021/9/1441381348124418055.json": "President Biden often talks about profitable companies that pay no U.S. taxes. Democratic tax increases wouldn’t necessarily stop that, https://t.co/cZ80SPHhft",
  "data/tweet-wsj/2021/9/1441373574309167106.json": "President Biden on Friday will host the leaders of Australia, India and Japan in an attempt to strengthen an alliance that shares concerns about China https://t.co/cumDbUOEde",
  "data/tweet-wsj/2021/9/1441400563602579461.json": "A veteran TV journalist said that CNN anchor Chris Cuomo groped her in 2005 while they were both employees of ABC News https://t.co/tOA4ZUcgWu",
  "data/tweet-wsj/2021/9/1441411707004407810.json": "The Justice Department reached a deal that will allow Huawei finance chief Meng Wanzhou to return to China from detention in Canada, a person familiar with the matter said https://t.co/iSv6PPqT5f",
  "data/tweet-wsj/2021/9/1441454947053232128.json": "In aging Japan, millions of people are learning they no longer are elderly, but merely “pre-old” https://t.co/A21Ms852qL",
  "data/tweet-wsj/2021/9/1441047229956083715.json": "This Rhode Island house, made famous by \"The Conjuring\" movie franchise, is for sale. The sellers have allowed paranormal investigators to stay at the property and now they hope someone else will \"take over the business.\" https://t.co/rE0SjXnSE5",
  "data/tweet-wsj/2021/9/1441466242477535232.json": "From @WSJopinion: The White House is using a single episode on the border to scapegoat law enforcement and deflect criticism from its immigration failure https://t.co/ThfNxw20qn",
  "data/tweet-wsj/2021/9/1441458682848501761.json": "A New York state judge ordered the Trump Organization to turn over documents subpoenaed by the state attorney general’s office, indicating that a 2½-year civil-fraud investigation into the former president’s business affairs is still active https://t.co/2jOfxHr0BO",
  "data/tweet-wsj/2021/9/1441520333299802112.json": "Face-mask requirements in schools drastically reduce the spread of Covid-19 among children, two studies published by the Centers for Disease Control and Prevention suggest https://t.co/jgRELsMWmB",
  "data/tweet-wsj/2021/9/1441449868543905794.json": "President Biden said Border Patrol agents who swung reins or ropes close to Haitian migrants and charged at them on horseback would face consequences https://t.co/PpFAa84aVE",
  "data/tweet-wsj/2021/9/1441541744840040448.json": "Japan's response to its ballooning elderly population: Reclassify those under 75 as \"pre-old\" https://t.co/DBnIDSh8Et",
  "data/tweet-wsj/2021/9/1441530436673576960.json": "“They’ve promised to kill me.” Some 200 female Afghan lawyers and judges, unemployed and vulnerable to Taliban retribution, remain stuck in Kabul. https://t.co/l1B2ME6yim",
  "data/tweet-wsj/2021/9/1441549275939344385.json": "U.S. police departments are striving to convince more officers to get vaccinated against Covid-19, which has become the leading cause of death among police https://t.co/s9GOw2IFUR",
  "data/tweet-wsj/2021/9/1441590834671939586.json": "Newly discovered fossil footprints show humans were living alongside mammoths in the American Southwest some 23,000 years ago—thousands of years earlier than many scientists believed https://t.co/Y2cq9pBNmG",
  "data/tweet-wsj/2021/9/1441584516158664704.json": "Prime Minister Justin Trudeau said China released Canadians Michael Kovrig and Michael Spavor — hours after the U.S. agreed to free a Huawei executive https://t.co/NJaEoGSJLX",
  "data/tweet-wsj/2021/9/1441436049029226499.json": "Previously unreported auction documents show Chinese courts selling off millions of dollars in assets seized from jailed Uyghur business leaders https://t.co/GHS3UAjLzt",
  "data/tweet-wsj/2021/9/1441422183113244674.json": "From @WSJopinion: Even if the bill shrinks to $2 trillion or less, the real costs will be far greater. Behold one of the greatest fiscal cons in history. https://t.co/itY6XNx2Zc",
  "data/tweet-wsj/2021/9/1441605920308482050.json": "Ghee is pure butterfat and culinary gold. Its nutty flavor and high smoke point make it super versatile as well as delicious. https://t.co/ysRiamv4jY",
  "data/tweet-wsj/2021/9/1441488895321980928.json": "White-collar employees at General Motors who don’t comply with a corporate mandate to report their vaccination status will receive reduced performance bonuses, the company said in a memo https://t.co/IlABBmtXoa",
  "data/tweet-wsj/2021/9/1441613466784178177.json": "In aging Japan, millions of people are learning they no longer are elderly, but merely “pre-old” https://t.co/zSK3vXj5gS",
  "data/tweet-wsj/2021/9/1441583334996398082.json": "Taylor Heinicke was taking the highest-level math classes at Old Dominion when the Washington Football Team called. His professors watched as their student became an unlikely NFL star: “He brought a little bit of fame to the math department.” https://t.co/rtVcI1aT4z",
  "data/tweet-wsj/2021/9/1441643671342956544.json": "Essay: Shouting doesn’t persuade people, yet we do it more when we’re uncertain of being listened to. That leads to a downward spiral of dwindling influence. https://t.co/XYmxyZmUtv",
  "data/tweet-wsj/2021/9/1441247301197082624.json": "Taylor Heinicke was taking the highest-level math classes at Old Dominion when the Washington Football Team called. This is what his professors said. https://t.co/lBzfKt9CCk",
  "data/tweet-wsj/2021/9/1441688946354831362.json": "Since leaving behind their royal duties, Prince Harry and Meghan have netted lucrative deals—many of which rely on spilling details about their royal past https://t.co/KymjzPacw6",
  "data/tweet-wsj/2021/9/1441741793981186068.json": "Newly discovered fossil footprints show humans were living alongside mammoths in the American Southwest some 23,000 years ago—thousands of years earlier than many scientists believed https://t.co/uzwNFpALFq",
  "data/tweet-wsj/2021/9/1441724171772334082.json": "The lesson of China Evergrande isn’t that Chinese stocks have suddenly gotten risky. It’s that they always have been—and might get even riskier, says @jasonzweigwsj https://t.co/auYMAk0A2r",
  "data/tweet-wsj/2021/9/1441768232403230722.json": "Mexican prosecutors have asked a federal judge to jail 31 renowned scientists on charges of organized crime and money laundering https://t.co/Un3vHUqEaN",
  "data/tweet-wsj/2021/9/1441787124311896064.json": "Emblematic of the cooling U.S.-German relationship: Angela Merkel declined the offer of being Joe Biden’s first call as president. She would be at her cottage, gardening. https://t.co/D1OFoYSPFp",
  "data/tweet-wsj/2021/9/1441873915438006274.json": "“They’ve promised to kill me.” Some 200 female Afghan lawyers and judges, unemployed and vulnerable to Taliban retribution, remain stuck in Kabul. https://t.co/dD1xwElmmw",
  "data/tweet-wsj/2021/9/1441836175988305923.json": "Since leaving behind their royal duties, Prince Harry and Meghan have netted lucrative deals—many of which rely on spilling details about their royal past https://t.co/bMKlFi7Afm",
  "data/tweet-wsj/2021/9/1441923020113727489.json": "From @WSJopinion: Even if the bill shrinks to $2 trillion or less, the real costs will be far greater. Behold one of the greatest fiscal cons in history.  https://t.co/FqKCxMvNO7",
  "data/tweet-wsj/2021/9/1441904119577415684.json": "The 1959 Cadillac is almost 19 feet long, and that’s not even the most noticeable thing about it  https://t.co/D3GEQmzoMu",
  "data/tweet-wsj/2021/9/1441949399790149634.json": "In aging Japan, millions of people are learning they no longer are elderly, but merely “pre-old” https://t.co/H9NOMpJ8wO",
  "data/tweet-wsj/2021/9/1441911657035296771.json": "This rich corn soup is so creamy, it’s hard to believe it contains no dairy at all. Ready in 20 minutes, it’s a delicious way to mark the end of sweet-corn season https://t.co/FDM1RxkPRo",
  "data/tweet-wsj/2021/9/1441968287735160834.json": "At least three people were killed when an Amtrak train that runs between Seattle and Chicago derailed in north-central Montana. The train had about 147 passengers and 13 crew members onboard. https://t.co/yRvAJ7vKDj",
  "data/tweet-wsj/2021/9/1442021145050374146.json": "Mexican prosecutors have asked a federal judge to jail 31 renowned scientists on charges of organized crime and money laundering https://t.co/BrppMlA16p",
  "data/tweet-wsj/2021/9/1442028689970057219.json": "\"Getting older doesn’t mean we have to stop living. We just have to train harder.\" Learn mountaineering expert Bill Burke’s workout secrets to keep prospering physically in your 70s. https://t.co/OGPejqtaYW",
  "data/tweet-wsj/2021/9/1442058897603194886.json": "During Angela Merkel’s long tenure as German chancellor, the aspirations and prospects of a united Europe have shrunk, thanks in part to her own caution and indecision. https://t.co/UEyxguLIgD",
  "data/tweet-wsj/2021/9/1442089115734867976.json": "From @WSJopinion: Democrats’ disarray in Congress is a sign nobody is in charge at the White House, writes @KimStrassel https://t.co/1ld1HajfMf",
  "data/tweet-wsj/2021/9/1442111823495385099.json": "U.S. shipping operations remain clogged as ports, truckers and warehouses can’t find enough workers or agree on 24/7 operations https://t.co/yCBgGIYPbA",
  "data/tweet-wsj/2021/9/1442160798852423680.json": "Birds across North America flocked to cities that had locked down in response to Covid-19. Some species were as much as 14 times more numerous than before pandemic restrictions were imposed. https://t.co/vY0kzzX6r0",
  "data/tweet-wsj/2021/9/1442149493311348745.json": "Political divisions in town of Cortez got so bitter the Colorado mayor needed a mediator https://t.co/lNqdBFFJVf",
  "data/tweet-wsj/2021/9/1442172534158290945.json": "An estimated 1.1 million children have lost a primary caregiver to Covid-19. “The velocity at which this is happening is staggering.” https://t.co/90NyhZrhtp",
  "data/tweet-wsj/2021/9/1442212393140961282.json": "AstraZeneca said its breast cancer drug Enhertu significantly reduced the risk of dying or disease progression in women with advanced disease in a large clinical trial https://t.co/gtj2ggLv29",
  "data/tweet-wsj/2021/9/1442209924344332288.json": "Newly discovered fossil footprints show humans were living alongside mammoths in the American Southwest some 23,000 years ago—thousands of years earlier than many scientists believed https://t.co/IVLmM6bodq",
  "data/tweet-wsj/2021/9/1442138144166400000.json": "Fat Bear Week in Alaska is expanding. This year, cubs are competing in their own bracket. “It’s time they get the recognition they deserve.” https://t.co/IL7g1XAD0x",
  "data/tweet-wsj/2021/9/1442222484019982337.json": "Despite mounting shipping delays and cargo backlogs, the busiest U.S. port complex shuts its gates for hours on most days and remains closed on Sundays https://t.co/P2MJaDsGFm",
  "data/tweet-wsj/2021/9/1442240121751937026.json": "Burger King this year plans to test serving burgers in reusable sandwich boxes and pouring drinks in reusable cups, as part of efforts to reduce the amount of waste restaurants produce https://t.co/qjpjHDliwL",
  "data/tweet-wsj/2021/9/1442145702159831050.json": "Pfizer wanted to study its Covid-19 vaccine in pregnant women, but then the shots became widely available. “It’s hard to enthusiastically recommend the study when you’ve got a vaccine out there,” one doctor said. https://t.co/rTT0t6EmZI",
  "data/tweet-wsj/2021/9/1442232535040286723.json": "Bitcoin miners, under fire for their environmental footprint, are teaming up with owners of struggling power nuclear plants with carbon-free power to spare  https://t.co/ltXlkt13bv",
  "data/tweet-wsj/2021/9/1442258962448007171.json": "The U.S. had the better players. They finally played like the better players. And now they’re Ryder Cup winners once again. https://t.co/rg3LQCEVmi",
  "data/tweet-wsj/2021/9/1442120179471814657.json": "The World Health Organization is reviving its stalled investigation into the origins of Covid-19, as officials warn that time is running out to determine how the pandemic began https://t.co/OginSuOUrD",
  "data/tweet-wsj/2021/9/1442296687108792322.json": "Covid-19 has been killing parents in their prime, leaving their children in the care of others. “I’ve had to become their mom.” https://t.co/uQLptbuqph",
  "data/tweet-wsj/2021/9/1442326906301517829.json": "An estimated 1.1 million children have lost a primary caregiver to Covid-19. “The velocity at which this is happening is staggering.” https://t.co/cOSkPH8N70",
  "data/tweet-wsj/2021/9/1442300497864581129.json": "Theranos launched in 2003, and by 2014 was valued at over $9 billion. Five years later, the company had dissolved, and founder Elizabeth Holmes was criminally charged with fraud. How did it all unravel? https://t.co/v8G4shxEu6",
  "data/tweet-wsj/2021/9/1442323133562716162.json": "Emblematic of the cooling U.S.-German relationship: Angela Merkel declined the offer of being Joe Biden’s first call as president. She would be at her cottage, gardening. https://t.co/10QBsn5gwe",
  "data/tweet-wsj/2021/9/1442289145779343363.json": "Jay Shetty—whose videos have amassed over eight billion views and attracted fans from Arianna Huffington to Oprah—seeks to bring wisdom to the world https://t.co/UkSCb2V78V",
  "data/tweet-wsj/2021/9/1442353330555179009.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/D0g2TDGlom",
  "data/tweet-wsj/2021/9/1442375983340871680.json": "Burger King this year plans to test serving burgers in reusable sandwich boxes and pouring drinks in reusable cups, as part of efforts to reduce the amount of waste restaurants produce https://t.co/34T0wZqjJH",
  "data/tweet-wsj/2021/9/1442383527761350656.json": "AstraZeneca said its breast cancer drug Enhertu significantly reduced the risk of dying or disease progression in women with advanced disease in a large clinical trial https://t.co/dkHZwmUb4c",
  "data/tweet-wsj/2021/9/1442360878993711105.json": "The World Health Organization is reviving its stalled investigation into the origins of Covid-19, as officials warn that time is running out to determine how the pandemic began https://t.co/chlBr5Kiue",
  "data/tweet-wsj/2021/9/1442440150731067397.json": "How France overcame Covid-19 vaccine doubts to become one of the most-protected larger countries  https://t.co/5lFj5UDoC8",
  "data/tweet-wsj/2021/9/1442432608785219586.json": "The U.S. spent $145 billion over two decades to build a self-sustaining economy in Afghanistan—an economy that is now on the verge of collapse https://t.co/3sKJXBRw4C",
  "data/tweet-wsj/2021/9/1442417504886800384.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDOUKJQ https://t.co/sGTvCaKXaX",
  "data/tweet-wsj/2021/9/1442465795175432197.json": "Instagram is pausing work on a version of the app for children, its chief said. It follows WSJ reporting on Instagram’s impact on teens. https://t.co/yrU4Yevnn8",
  "data/tweet-wsj/2021/9/1442500554362548231.json": "From @WSJopinion: Trump claims Arizona’s ballot audit found “massive fraud,” yet the new recount says he actually lost the state by 360 more votes than originally reported. When are Republicans going to quit playing this game?\nhttps://t.co/DfrzDJzD5X",
  "data/tweet-wsj/2021/9/1442496795116924935.json": "The average value of company shares held by male employees in 2018 was $104,902. For women, it was $26,361. https://t.co/JLMPhZyb1Y",
  "data/tweet-wsj/2021/9/1442523242313441283.json": "President Biden will receive a booster shot of the Covid-19 vaccine on Monday, the White House said https://t.co/rtPMGfthJc",
  "data/tweet-wsj/2021/9/1442409937997602817.json": "Taliban fighters who recently spent their days in bloody battle are now frolicking in parks and the zoo, drawing admonishments from the leadership https://t.co/MYC9Z2Mxq2",
  "data/tweet-wsj/2021/9/1442074005511487490.json": "Germans began voting in a landmark election that will produce a successor to longtime Chancellor Angela Merkel  https://t.co/KgoRdrjbAQ",
  "data/tweet-wsj/2021/9/1442572628041080833.json": "R&amp;B singer R. Kelly was found guilty of leading a decadeslong racketeering enterprise to recruit women and underage girls for sex https://t.co/9xjKIPSFr7",
  "data/tweet-wsj/2021/9/1442558962965045248.json": "The U.S. asked Russia about an apparent offer from Putin to use his military bases in Central Asia to respond to threats in Afghanistan, U.S. officials said https://t.co/8lZ4z7zIEM",
  "data/tweet-wsj/2021/9/1442474330475089921.json": "Boston Fed chief Eric Rosengren will retire Sept. 30, the bank said, citing a health condition. It follows reports he traded investments during the pandemic. https://t.co/ISfqobsDvD",
  "data/tweet-wsj/2021/9/1442622114608164865.json": "Senate Republicans blocked a Democratic bill that would prevent a partial government shutdown and suspend the debt limit, days before funding runs out https://t.co/xoIzkAtfPu",
  "data/tweet-wsj/2021/9/1442641461758078978.json": "Ford plans to spend $7 billion to build its first U.S. assembly plant in decades as well as three battery factories, set for Tennessee and Kentucky https://t.co/GLwy20XRv8",
  "data/tweet-wsj/2021/9/1442591147877191681.json": "A jury found that a helicopter maker backed by financier Lynn Tilton defrauded the U.S. military, awarding $36 million in damages, an amount that could be tripled under a federal law https://t.co/mUVZynfULa",
  "data/tweet-wsj/2021/9/1442443946597052417.json": "The American Dental Association is fighting a proposal to include dental coverage for all Medicare recipients, opposition that could prove pivotal as Democrats look to make cuts in their $3.5 trillion domestic policy agenda https://t.co/YV6DdkDOOX",
  "data/tweet-wsj/2021/9/1442674191661256705.json": "The number of homicides in the U.S. rose nearly 30% in 2020 from the year before, the largest single-year increase ever recorded by the FBI https://t.co/LURQtEDsSy",
  "data/tweet-wsj/2021/9/1442696845415833607.json": "Ferrari has hired former Apple chief design officer Jony Ive as it readies its debut of full electric vehicles https://t.co/FvfWKv3yZJ",
  "data/tweet-wsj/2021/9/1442681736295600133.json": "With many women’s lives reduced to work and home life, “‘What do I really want?’ has become a real question” https://t.co/Tv2otifrM5",
  "data/tweet-wsj/2021/9/1442708180728000512.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/w2HkwL1JpD",
  "data/tweet-wsj/2021/9/1442602469364731906.json": "Chinese factories are finding it harder to operate as they contend with coal shortages and efforts to control energy consumption  https://t.co/SoUjQUYerK",
  "data/tweet-wsj/2021/9/1442655371764568067.json": "Job seekers are considering a new addition to their résumés: Covid-19 vaccination status https://t.co/Qn2EtHiQt7",
  "data/tweet-wsj/2021/9/1442568496173441028.json": "France had one of the highest rates of hesitancy in the world. Today, it has one of the highest vaccination rates among larger Western countries. https://t.co/NvfBxtOL0h",
  "data/tweet-wsj/2021/9/1442553396498628625.json": "President Biden received a booster shot of the Covid-19 vaccine and appealed to unvaccinated Americans to protect themselves against the virus. He told reporters that first lady Jill Biden also plans to get a booster shot. https://t.co/afTMDeZsKV",
  "data/tweet-wsj/2021/9/1442806352867430406.json": "A surge in toxic customers and poor behavior has prompted many restaurants to rethink the adage that the customer is always right https://t.co/sOXv2BhC6R",
  "data/tweet-wsj/2021/9/1442819376332300292.json": "Ford says it will invest $7 billion in a new assembly plant and three EV battery factories, aiming to create 11,000 jobs in the South. It’s the car maker’s largest ever manufacturing investment. #WSJWhatsNow https://t.co/7z78kuPhpV",
  "data/tweet-wsj/2021/9/1442844357791465477.json": "More than 130 federal judges have violated U.S. law and judicial ethics by overseeing court cases involving companies in which they or their family owned stock, a WSJ investigation found. Judges failed to recuse themselves from 685 cases since 2010. https://t.co/eNa5PWdsui",
  "data/tweet-wsj/2021/9/1442859232685088768.json": "The biggest U.S. companies are sitting on record piles of cash. They are getting paid next to nothing for holding it, and they are running out of ways to spend it. So they are buying a lot of commercial real estate. https://t.co/myeQgp0JqG",
  "data/tweet-wsj/2021/9/1442796749500952582.json": "Jony Ive, Apple’s former chief design officer, is to work with Ferrari and its largest shareholder on a series of creative projects https://t.co/qHxyBnsS6d",
  "data/tweet-wsj/2021/9/1442802536331812864.json": "Publicly traded U.S. companies own land and buildings valued at $1.64 trillion, up 38% from 10 years ago https://t.co/SBFIlYfogP",
  "data/tweet-wsj/2021/9/1442632677186805761.json": "Mets owner Steven Cohen wants to raise the team’s profile to a young, diverse audience. Still in development, the effort could feature live comedy, new design and special events. https://t.co/FEdJtUg96e",
  "data/tweet-wsj/2021/9/1442896941365415937.json": "The CIA evacuated an intelligence officer from Serbia in what officials say is part of ongoing Havana Syndrome neurological attacks  https://t.co/DBYbimdp6Y",
  "data/tweet-wsj/2021/9/1442900687843590147.json": "The gunman who killed five employees at the Capital Gazette newspaper in Maryland was sentenced to more than five consecutive life terms in prison without parole https://t.co/N1kIhTxyp9",
  "data/tweet-wsj/2021/9/1442910940131823616.json": "Beyond Facebook’s just-paused version of an Instagram for kids, the tech giant has been working on how to attract children to its products. “Kids are getting on the internet as young as six years old,” says one internal document. “We can’t ignore this.” https://t.co/s3GS408psb",
  "data/tweet-wsj/2021/9/1442909508229951490.json": "From @WSJopinion: The Biden bill is paid for by the largest tax increase in history. You are entitled to argue that is a cost worth paying, but you can’t argue it costs nothing, writes @gerardtbaker https://t.co/nYqPCGgpYd",
  "data/tweet-wsj/2021/9/1442915802378690561.json": "For decades, one of the most effective tools to prevent wildfires was to thin forests by removing dead trees and brush, or by using controlled burns. Forest thinning may no longer be enough to keep up today's rising wildfire risk. https://t.co/wpqJt2z5ur",
  "data/tweet-wsj/2021/9/1442920569276547074.json": "More than 130 federal judges have violated U.S. law and judicial ethics by overseeing court cases involving companies in which they or their family owned stock, a WSJ investigation found. Judges failed to recuse themselves from 685 such cases since 2010. https://t.co/g5Eu9P6QLx",
  "data/tweet-wsj/2021/9/1442923333800972289.json": "Gov. Kathy Hochul signed an emergency executive order to allow medical personnel from other states and countries as well as retired personnel to work in New York https://t.co/dDlYE9MXZB",
  "data/tweet-wsj/2021/9/1442913277353234438.json": "A high-level trade and technology meeting to be held in Pittsburgh on Wednesday is aimed at smoothing over squabbles between the U.S. and EU https://t.co/L3TfJGBN0e",
  "data/tweet-wsj/2021/9/1442927369283457026.json": "Sen. Elizabeth Warren said she would oppose a second term for Federal Reserve Chairman Jerome Powell if President Biden renominates the central bank leader https://t.co/Y8YtMLOYa1",
  "data/tweet-wsj/2021/9/1442937201013059588.json": "Harvard Business School has moved most of its M.B.A. classes online following a spate of breakthrough Covid-19 infections among its students https://t.co/vtJyv4DQZe",
  "data/tweet-wsj/2021/9/1442934817855705089.json": "Regulatory clearance of the Pfizer-BioNTech Covid-19 vaccine for young children may not come until November, according to a person familiar with the matter https://t.co/Hej3bNrMjn",
  "data/tweet-wsj/2021/9/1442945976579211268.json": "From @WSJopinion: Biden makes his $3.5 trillion tax and spend plan sound like a safety net program for the poor rather than what it really is: a government subsidy engine for everyone including the affluent https://t.co/9WKBRU3u9A",
  "data/tweet-wsj/2021/9/1442953551475404800.json": "The Pentagon’s top military officer said the evacuation of Americans, Afghans and allies out of Kabul in the final weeks of the nation’s longest war was a logistical success but a strategic failure. “Strategically, the war was lost.” https://t.co/1XFoO6L3VE",
  "data/tweet-wsj/2021/9/1442957316790255618.json": "Pent-up demand for in-person bingo has been so strong in some spots that security guards and good Samaritans struggle to keep peace at the door. “We’re not going in here if we’re going to fight.” https://t.co/1OgjE8cgXo",
  "data/tweet-wsj/2021/9/1442961072529440769.json": "In the race to build a cheaper and longer-range electric car, auto companies are pouring more money into solid-state battery technology. It has the potential to deliver faster charging times and make packs safer than lithium-ion batteries. https://t.co/x2lRp93TGf",
  "data/tweet-wsj/2021/9/1442964851978948614.json": "Lego, which responded to the pandemic by shifting marketing budgets to its online channels but didn’t make any significant strategic changes, strengthened its position as the world’s largest toy maker https://t.co/u8DPo9J1Pq",
  "data/tweet-wsj/2021/9/1442988764620414991.json": "United Airlines Holdings Inc. is moving ahead with plans to terminate close to 600 employees who didn’t meet its Covid-19 vaccination deadline, company officials said Tuesday https://t.co/lYlulc5jMa",
  "data/tweet-wsj/2021/9/1442976208669396999.json": "Thousands of healthcare workers in New York lost their jobs Tuesday when a new vaccine mandate went into effect, forcing some nursing homes to stop admitting new patients and hospitals to warn of longer wait times https://t.co/8lxGM70KOF",
  "data/tweet-wsj/2021/9/1442983733540188163.json": "CNN said it has restricted access to its Facebook pages in Australia following a ruling from that country’s high court that makes news organizations legally liable for comments on their Facebook posts https://t.co/7wIWXFetjl",
  "data/tweet-wsj/2021/9/1443002663549947905.json": "Dozens of federal judges broke the law by hearing cases involving companies in which they or their family owned stock. Use our interactive tool to search for the judges involved and find out whether their rulings favored their financial interests. https://t.co/ZaPmo7iAGN",
  "data/tweet-wsj/2021/9/1443040369587982340.json": "More than 130 federal judges have violated U.S. law and judicial ethics by overseeing court cases involving companies in which they or their family owned stock, a WSJ investigation found. Judges failed to recuse themselves from 685 such cases since 2010. https://t.co/mYY0FNuqPJ",
  "data/tweet-wsj/2021/9/1443047897898098696.json": "Research on Chinese projects launched under President Xi Jinping’s international infrastructure-development program points to hidden debt, corruption scandals, labor violations and environmental risks https://t.co/tYRHjagrkE",
  "data/tweet-wsj/2021/9/1443097212351926274.json": "Japan’s next prime minister will be Fumio Kishida, who favors a strong alliance with the U.S. and is concerned about China’s military expansion https://t.co/Nj2uhVuJeA",
  "data/tweet-wsj/2021/9/1443078137823338497.json": "From @WSJopinion: The rush to renewables causes severe energy price spikes and shortages. Biden’s policies would do the same in the U.S, writes @AllysiaFinley. https://t.co/fKFR0cEaVz",
  "data/tweet-wsj/2021/9/1443115870117629954.json": "More than 130 federal judges have violated U.S. law and judicial ethics by overseeing court cases involving companies in which they or their family owned stock, a WSJ investigation found. Judges failed to recuse themselves from 685 such cases since 2010. https://t.co/Zd2Jb24ylv",
  "data/tweet-wsj/2021/9/1443089426469564418.json": "Thousands of healthcare workers in New York lost their jobs Tuesday when a new vaccine mandate went into effect, forcing some nursing homes to stop admitting new patients and hospitals to warn of longer wait times https://t.co/JNTD60OebI",
  "data/tweet-wsj/2021/9/1443154866327724036.json": "A surge in toxic customers and poor behavior has prompted many restaurants to rethink the adage that the customer is always right https://t.co/Dt2hRufQQ0",
  "data/tweet-wsj/2021/9/1443074336303235079.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5CUpXEOxNU https://t.co/B0xZnknnHb",
  "data/tweet-wsj/2021/9/1443025288183652358.json": "Watch: How did Cardano’s Ada become one of the largest cryptocurrencies by market capitalization and how does it differ from Bitcoin? We explain https://t.co/wEkkabXv9v",
  "data/tweet-wsj/2021/9/1443146069639057408.json": "Take an early look at the front page of The Wall Street Journal https://t.co/kgpIYlyWE3 https://t.co/t9boA9mD02",
  "data/tweet-wsj/2021/9/1443210218171686912.json": "Dollar Tree plans to sell products at $1.25 and $1.50 or other prices slightly above $1 in some of its stores, as supply-chain snarls, a tight labor market and inflation push costs higher https://t.co/lm24aVpAZU",
  "data/tweet-wsj/2021/9/1443189947033427969.json": "India is preparing to produce its own mRNA-based Covid-19 vaccine by the end of the year, in what would be a scientific breakthrough for the country https://t.co/H7JruqEpEm",
  "data/tweet-wsj/2021/9/1442787433586860034.json": "Job seekers are considering a new addition to their résumés: Covid-19 vaccination status https://t.co/jzUs82eS7m",
  "data/tweet-wsj/2021/9/1443233214898782208.json": "YouTube said it will remove content that falsely alleges approved vaccines are dangerous, expanding the video platform’s efforts in curbing misinformation on Covid-19 to other vaccines https://t.co/Tt4nXKvnYy",
  "data/tweet-wsj/2021/9/1443204413414277121.json": "Satellite images show the scale of the backlog at ports in California. The ongoing supply chain issues are now threatening holiday shopping plans. #WSJWhatsNow https://t.co/cASNSHr3OK",
  "data/tweet-wsj/2021/9/1443062999774863366.json": "Harvard Business School has moved most of its M.B.A. classes online following a spate of breakthrough Covid-19 infections among its students https://t.co/STre4qZ9Y2",
  "data/tweet-wsj/2021/9/1443254634232131594.json": "Dozens of federal judges have heard cases involving companies in which they or their family owned stock. But none more so than Rodney Gilstrap, a judge in East Texas who didn’t recuse himself 138 times in such cases since 2011. https://t.co/HXbeUDhqW7",
  "data/tweet-wsj/2021/9/1443260067290173453.json": "The U.S. Fish and Wildlife Service said the ivory-billed woodpecker and 22 other endangered species are extinct https://t.co/EaNvtVOUEb",
  "data/tweet-wsj/2021/9/1442968633609646092.json": "Billionaire Ken Griffin’s electronic trading firm, Citadel Securities, is under fire again over its role in the January trading frenzy in shares of GameStop after new information surfaced in a lawsuit https://t.co/qRHrSETjfy",
  "data/tweet-wsj/2021/9/1443343355841241090.json": "Breaking: Britney Spears’s father has been suspended as conservator of her $60 million estate after a 13-year arrangement that the singer called abusive https://t.co/cuNMR5zSJI",
  "data/tweet-wsj/2021/9/1443221834221117444.json": "From @WSJopinion: Biden hopes the political fallout from his botched Afghanistan withdrawal will fade quickly, but Tuesday’s Senate hearing with the secretary of Defense and two top generals doesn’t cast his decisions in a better light https://t.co/S1apogKp79",
  "data/tweet-wsj/2021/9/1443181281509052417.json": "Bishops in the U.S. and Germany are poised to challenge Pope Francis on abortion and gay rights, in tests that could determine the 84-year-old’s legacy https://t.co/BFQeS7FGJp",
  "data/tweet-wsj/2021/9/1443338575932702722.json": "Dollar Tree plans to sell products at $1.25 and $1.50 or other prices slightly above $1 in some of its stores, as supply-chain snarls, a tight labor market and inflation push costs higher https://t.co/VwURzSBpiF",
  "data/tweet-wsj/2021/9/1443355651594461187.json": "In the biggest batch announced yet, the U.S. Fish and Wildlife Service has classified 23 endangered species as extinct, and is proposing removing them from the Endangered Species Act https://t.co/vCKGsKwaSp",
  "data/tweet-wsj/2021/9/1443387642771558400.json": "The Biden administration is moving to restore criminal penalties for accidental killings of migratory birds, saying the measures are needed to protect declining bird populations https://t.co/kIBThfn7t3",
  "data/tweet-wsj/2021/9/1443406519802925058.json": "From @WSJopinion: OSHA’s job is to promote safe workplaces, not to dictate medical decisions to employees, write @DavidRivkin and Robert Alt https://t.co/zHVqKkeJiu",
  "data/tweet-wsj/2021/9/1443096983229681671.json": "The biggest U.S. companies are sitting on record piles of cash. They are getting paid next to nothing for holding it, and they are running out of ways to spend it. So they are buying a lot of commercial real estate. https://t.co/5rOvO7ZgzL",
  "data/tweet-wsj/2021/9/1443383869143719936.json": "Dozens of federal judges have heard cases involving companies in which they or their family owned stock. But none more so than Rodney Gilstrap, a judge in East Texas who didn’t recuse himself 138 times in such cases since 2011. https://t.co/9nfeJQKeC6",
  "data/tweet-wsj/2021/9/1443402751116038144.json": "A couple's property in Iceland has views of an extinct volcano, the top of the country’s second-largest glacier and something less common: lush, green surroundings. “This place is like walking into a green haven.” https://t.co/33y7M1rHyc",
  "data/tweet-wsj/2021/9/1443249798581297156.json": "Najla Bouden Romdhane, a professor at a Tunisian university, became the country’s first woman prime minister, with the task of forming a stable government after weeks of turmoil https://t.co/tvhYuB76qY",
  "data/tweet-wsj/2021/9/1443543317988483072.json": "A Los Angeles Superior Court judge granted Britney Spears’s request to remove her father as conservator of her $60 million estate, putting the pop star a step closer to reclaiming control over her finances #WSJWhatsNow https://t.co/mMie6X1M7i",
  "data/tweet-wsj/2021/9/1443508450613411844.json": "Take an early look at the front page of The Wall Street Journal https://t.co/2S0jE4Pqw3 https://t.co/FhXtu9Svqv",
  "data/tweet-wsj/2021/9/1443504661118476295.json": "Dozens of federal judges have heard cases involving companies in which they or their family owned stock. But none more so than Rodney Gilstrap, a judge in East Texas who didn’t recuse himself 138 times in such cases since 2011. https://t.co/e4R26kvzua",
  "data/tweet-wsj/2021/9/1443595266859352066.json": "The Kīlauea volcano in Hawaii started erupting, creating lava flows within the 4,000-foot summit, with the U.S. Geological Survey’s Hawaiian Volcano Observatory saying high levels of volcanic gas are the primary hazard of concern https://t.co/LCr5gpNn6B",
  "data/tweet-wsj/2021/9/1443600436087373825.json": "Sen. Blumenthal wanted to see what life was like on Instagram for teens, so his office set up an account that identified as a 13-year-old girl. Within a day, Instagram had served up content that promoted eating disorders and self injury, he said. https://t.co/CqUy5Huolh",
  "data/tweet-wsj/2021/9/1443576381984546829.json": "A pregnant woman didn't know the hospital where she was about to give birth was fighting a ransomware attack. Her baby was in distress, and later died. Are the hackers or the hospital to blame? https://t.co/VAjiqffTvT",
  "data/tweet-wsj/2021/9/1443625455525978113.json": "Gun maker Smith &amp; Wesson is moving its corporate headquarters from Massachusetts to Tennessee, joining other firearms manufacturers that have moved to Southern states with less restrictive gun laws https://t.co/Vb6YehKbg0",
  "data/tweet-wsj/2021/9/1443638437463183369.json": "The U.S. government is set to let as many as 80,000 employment-based green cards expire Friday, leaving foreign workers waiting for a permanent resolution to their immigration limbo https://t.co/qiwbMfvkAw",
  "data/tweet-wsj/2021/9/1443565064150192131.json": "A Covid-19 surge in Maine has filled hospitals and put dozens of mostly unvaccinated people on ventilators, setting records for the state https://t.co/lz0KaDwxer",
  "data/tweet-wsj/2021/9/1443708519086182400.json": "Drug-enforcement agents seized 1.8 million fake pills laced with the synthetic opioid fentanyl and arrested more than 800 people across the U.S. in a crackdown on online sales of the potentially deadly drugs https://t.co/uNbYqPK5Ig",
  "data/tweet-wsj/2021/9/1443713539760349185.json": "A lawsuit involving a baby in Alabama, if proven in court, will mark the first alleged death from a ransomware attack. “This was preventable.” https://t.co/Fqvq4iMfra",
  "data/tweet-wsj/2021/9/1443655662286909445.json": "From @WSJopinion: Much of the media makes it sound as if renewables are on the verge of taking over. But that’s far from reality, writes @BjornLomborg https://t.co/13XiE1pX9Y",
  "data/tweet-wsj/2021/9/1443164931373903876.json": "A North Korean weapons launch detected Tuesday was a new hypersonic missile, with a fuel system that makes deployment faster and more mobile https://t.co/MsWR8O3mg2",
  "data/tweet-wsj/2021/9/1443512203735412745.json": "Jon Stewart left TV six years ago. Streaming services have often struggled with the talk-show format. Will his new show for Apple TV+, \"The Problem With Jon Stewart,\" be different? https://t.co/RIC2qKAeyh",
  "data/tweet-wsj/2021/9/1443591532137881600.json": "The Taliban have displaced hundreds of families belonging to Afghanistan’s Shiite Hazara community in central Afghanistan, reinforcing fears of renewed persecution against a minority that suffered under Taliban rule in the past https://t.co/z5gtWxhrev",
  "data/tweet-wsj/2021/9/1443620651835723777.json": "Federal authorities are scrutinizing U.S. financial firms and advisers that handled funds traced to a suspected money laundering scheme, people familiar with the matter said https://t.co/NifgMST1Gw"
}