{
  "data/tweet-quora/2022/1/1477414384347590661.json": "Making some goals for the new year? Learn about the most effective goal-setting frameworks in these perspectives from life coaches and OKR consultants: https://t.co/ZPZG68wpa1",
  "data/tweet-quora/2022/1/1478066728508690432.json": "Who remembers this? https://t.co/EjvSTHmotD",
  "data/tweet-quora/2022/1/1478181070566608897.json": "At Quora, we offer lots of support for writers, but haven't offered much for readers. Writing well is hard, but making sense of all the information out there is hard too. Would sensemaking support be valuable to readers?",
  "data/tweet-quora/2022/1/1478081503380721664.json": "Happy New Year everyone? What mountains, real or metaphorical, do you plan to climb this year? Fergus White has some first-hand tips for Everest: https://t.co/1VoOUaQ4ii",
  "data/tweet-quora/2022/1/1478463288253902848.json": "What does a Soviet-style \"khrushchevka\" apartment building look like on the inside? Russian Quora contributor Misha Firer explains in his typical hilarious idiom: https://t.co/1QqZyJpkGe",
  "data/tweet-quora/2022/1/1478501234872963072.json": "Do you enjoy solving math and computer science puzzles? Would you like to try your hand at some user-tested puzzles derived from real-world challenges? Then you'll probably like the Quora Programming Challenge. https://t.co/yZxotfs7pJ\np.s. There are cash prizes.",
  "data/tweet-quora/2022/1/1478794849365094403.json": "Would you believe that Saudi Arabia imports sand? Piotr Marciniak explains: https://t.co/RV4pbZaFM9 https://t.co/vs5lGPSUKE",
  "data/tweet-quora/2022/1/1479532511671697409.json": "What do you remember most about Sidney Poitier? What was his best performance? https://t.co/FHp2AYXRFd https://t.co/twyTA06eDU",
  "data/tweet-quora/2022/1/1480978188058574853.json": "Nano-chameleons, zombie frogs, and shrieking hyrax. Gary Meaney tells us all about the cool new critters that were discovered in 2021. What do you think we'll discover in 2022? https://t.co/ptbmUYiP2Y https://t.co/ilUhKteypn",
  "data/tweet-quora/2022/1/1481033274478641153.json": "Want to get one of those cool new remote jobs? Quora was just named one of the top remote employers by \n@BuiltIn!\n https://t.co/SvMa4b92Ml #remotework",
  "data/tweet-quora/2022/1/1481406480293109760.json": "What's it like to live in a little village in Turkey? Let Gizem Acar, who lives in a picturesque such village, tell you about it: https://t.co/TuJCB2SkcK https://t.co/vGHXrtuWgJ",
  "data/tweet-quora/2022/1/1481706796662157314.json": "Hey @CarCaster, relevant to your interests? https://t.co/OqfgG65eKn",
  "data/tweet-quora/2022/1/1481703767401644036.json": "Fun challenges and cash prizes, what more could you want? https://t.co/G5Y5bIiT0G",
  "data/tweet-quora/2022/1/1482100467433762818.json": "Ever wonder why Windows systems use CR+LF while Linux only uses LF? Michael Lush has the deets: https://t.co/iWURJnecZk https://t.co/rfEBPUoKtV",
  "data/tweet-quora/2022/1/1482382394858643465.json": "What are some tips for getting financial aid? Admissions expert and CEO of @moon_prep, Kristen Moon, shares 5 easy steps. https://t.co/gatkLY6jLK https://t.co/9NhcFm3dvk",
  "data/tweet-quora/2022/1/1482382158291509255.json": "Who loves Beijing snacks? Fei-fei Wang does! https://t.co/YnlAPAhfVa https://t.co/6apb1M6x7N",
  "data/tweet-quora/2022/1/1482744648238047236.json": "Considering moving your business's data to the cloud? Here are four factors to consider. @qumulo's Vice President of Product Management, Ben Gitenstein, explains. https://t.co/U7aZbsHAmJ https://t.co/GlJneXvJFL",
  "data/tweet-quora/2022/1/1483521972117983232.json": "Where are the new hotspots for tech jobs? In the remote work world, they're different! https://t.co/S8ADFKH3qm",
  "data/tweet-quora/2022/1/1483533654278160394.json": "Who remembers Kodak in their glory days? Paul Tomblin was there for the fall and tells us the story: https://t.co/7w9Urgtqd6 https://t.co/17UNfZtxjP",
  "data/tweet-quora/2022/1/1483590096133804034.json": "Ever heard of Ataloia fever? Dr. Jo tells the story of all the unknown viruses that haven't yet made the headlines: https://t.co/xZk5Hs9yB5 https://t.co/Ys4T5uUJvx",
  "data/tweet-quora/2022/1/1484638578248273923.json": "What are some other countries where home cooking is considered best or where restaurant/street food is best, and what are some other characteristics of that culture that might correlate? Communal vs individualistic, maybe? https://t.co/UL66C3PU9t",
  "data/tweet-quora/2022/1/1484713228693168129.json": "So you're reading an answer on Quora and you don't know if it's any good. How do you tell? Upvotes are available, but they say more about popularity than the degree to which acting on the answer will achieve your goals. Comments have the same problem as the answer.  THREAD!",
  "data/tweet-quora/2022/1/1484918999745970181.json": "What are some big shifts we’ll see with the Gig economy in 2022? @JordanPeace, CEO of Fringe, predicts the trends. https://t.co/AUf1vRf4an https://t.co/WEbwRnUjYv",
  "data/tweet-quora/2022/1/1485024528484995074.json": "Dealing with co-parenting issues? Doctor Marsha Kline Pruett, Professor, Psychologist, Researcher, and Advisor to @OurFamilyWizard, shares 5 techniques for handling contentious situations. https://t.co/aOHElGlYJH https://t.co/BKQBHdOQ2z",
  "data/tweet-quora/2022/1/1485281352127766531.json": "How has the coronavirus affected the life of startups and entrepreneurs? @YehongZhu, founder of @ZetteMedia, details how COVID affected her business plans in 2020. https://t.co/cMXuWYf1Mv https://t.co/xflI1IaDHf",
  "data/tweet-quora/2022/1/1485386922209984518.json": "What is the best way to remember things? Corey Fradin, founder of QuickBooost, shares his best tips. https://t.co/E1ubTYueej https://t.co/MaQBCx2VGu",
  "data/tweet-quora/2022/1/1486456644993097732.json": "Here on Twitter, due to @elonmusk's larger-than-life influence, it's hard to find level-headed discussion of #Tesla's pros and cons. Not so on Quora, as in this excellent discussion from long-term Tesla owner Christian Bull: https://t.co/7LRYF7aiFQ What are your pros &amp; cons? https://t.co/SqCDKbqIzf",
  "data/tweet-quora/2022/1/1487146484256542723.json": "Ever wonder what a Congressional Representative does? Ask Congressman @ericswalwell! He represents the 15th district in California. https://t.co/T6mrZrqSDo",
  "data/tweet-quora/2022/1/1487818152247504897.json": "How can technology help co-parents navigate their separate lives? Dr. Marsha Kline Pruett, professor, psychologist, researcher, and advisor to @OurFamilyWizard, explains how to use the tools you have for parenting success. https://t.co/ZS80I1ZVTY https://t.co/MhaaFVTTZI"
}