{
  "data/tweet-economist/2021/6/1399559420707753984.json": "Every year since the 1960s, the 10% of voters with the most years of schooling gravitated towards left-wing parties, while the remaining 90% slid the other way https://t.co/PynHVjVdrb",
  "data/tweet-economist/2021/6/1399549432669118466.json": "Nicolás Maduro wants to reduce some of the pressure on his regime—and pare back sanctions—by holding slightly less rigged regional elections and negotiating with the opposition https://t.co/mFLV1NQltk",
  "data/tweet-economist/2021/6/1399545260926251011.json": "America, Britain, Germany and Japan are among the countries aiming to imitate the Defence Advanced Research Projects Agency https://t.co/C8x7a02gH1",
  "data/tweet-economist/2021/6/1399526678121041926.json": "Rarely has a Mexican president attracted such adulation—and loathing. On June 6th voters can either boost Andrés Manuel López Obrador's party or clip its wings https://t.co/psHOHt5Dop",
  "data/tweet-economist/2021/6/1399603858712809476.json": "President López Obrador's ad hoc, lawless approach has not made Mexico less corrupt, but he has highlighted the need for a clean-up https://t.co/vsuSzSsdtB",
  "data/tweet-economist/2021/6/1399637097737293824.json": "A fifth of all rice grown globally now comes from hybrids that were developed by Yuan Longping https://t.co/ZsMtcxhxd6",
  "data/tweet-economist/2021/6/1399599869573095426.json": "“They are worried who will do the work if the staff test positive.” @1843mag looks at the truth about rich Indians’ relationship with their domestic workers https://t.co/CGbXrs8LJA",
  "data/tweet-economist/2021/6/1399682406353981441.json": "In a world plagued by authoritarian populists, Mexico’s president has somehow escaped the limelight. But he is a danger to Mexican democracy https://t.co/ZlI07CQRX1",
  "data/tweet-economist/2021/6/1399686434362171393.json": "As long as President López Obrador is in charge, there will be two Mexicos. One, a dynamic and integrated part of North America; the other, remote, backward and resentful https://t.co/F1DTUnVDU9",
  "data/tweet-economist/2021/6/1399737004661874690.json": "Biryani was supposedly invented during the 17th century, when India was part of the Mughal empire. From @1843mag\n https://t.co/zzv0hKZTKw",
  "data/tweet-economist/2021/6/1399776792882434052.json": "The populist president's gravest flaw is a disregard for the rule of law. Critics fear he is trying to extend his first term in office https://t.co/orplHMGCEQ",
  "data/tweet-economist/2021/6/1399798416310472707.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/7QZwB8pudk  From @1843mag",
  "data/tweet-economist/2021/6/1399791878506176518.json": "New research suggests that watermelons were domesticated from a subspecies called the Sudanese Kordofan melon, which grows in Darfur, Sudan https://t.co/6dVsukCyvj",
  "data/tweet-economist/2021/6/1399836943869952002.json": "The populist president's gravest flaw is a disregard for the rule of law. Critics fear he is trying to extend his first term in office https://t.co/3IEpEjcPCj",
  "data/tweet-economist/2021/6/1399863561510338561.json": "Archaeological evidence from Libya and Egypt suggests watermelons were cultivated there thousands of years ago https://t.co/Ybly76zbPp",
  "data/tweet-economist/2021/6/1399832390344847362.json": "Since Joe Biden took office, hunger rates in America have dropped 43%. But both Donald Trump and Mr Biden can take credit https://t.co/GaRXTMnrAO",
  "data/tweet-economist/2021/6/1399576560626241537.json": "In cracking the puzzle of superspreading, researchers have had to re-evaluate their understanding of SARS-CoV-2’s transmission https://t.co/Tx7X94nsRM",
  "data/tweet-economist/2021/6/1399907219425136640.json": "A study in 2018 concluded that around 40% of multinationals’ overseas profits are artificially shifted to low-tax countries  https://t.co/IBBfTnFH70",
  "data/tweet-economist/2021/6/1399852761756340224.json": "The paper finds that income and education began diverging as predictors of ideology as early as the 1960s https://t.co/Jtut8ioRXV",
  "data/tweet-economist/2021/6/1399942975371845632.json": "Until recently, the origins of watermelons were lost in the mists of time https://t.co/cPKm1HWsha",
  "data/tweet-economist/2021/6/1399790859755864065.json": "Firms across the world are spending big. We analyse their capital-expenditure plans https://t.co/WmZbMgu9OS https://t.co/3A1MCfsZxN",
  "data/tweet-economist/2021/6/1400009806853836803.json": "Education has become a global battle and tutors are a secret weapon https://t.co/mihUONsMyB From @1843mag",
  "data/tweet-economist/2021/6/1399974498477215751.json": "National indoor-air-quality standards would help. One way to enforce them could be through ventilation certificates for buildings, similar to food-hygiene assessments https://t.co/AeF7H0vlPg",
  "data/tweet-economist/2021/6/1400068512979341312.json": "Two IMF economists reckon the developing world could inoculate almost 40% of its population by the end of 2021, if rich countries donated half of their surplus vaccines  https://t.co/DxAi9qZXDm",
  "data/tweet-economist/2021/6/1400104426191327236.json": "Food and sex have always been closely linked in Jewish thinking. From @1843mag https://t.co/aHretpqPOw",
  "data/tweet-economist/2021/6/1400129203744477191.json": "Over 25% of the world's adults have now received one dose of a covid-19 vaccine https://t.co/G4mjtdY4pm",
  "data/tweet-economist/2021/6/1400169877474848772.json": "On paper, it is straightforward. Take enormous, reckless gambles on things so beneficial that only a handful need work to make the whole venture a success. But, inevitably, it is not so simple https://t.co/cMCQ250dtT",
  "data/tweet-economist/2021/6/1399911981373603843.json": "The paper implies that the votes for Donald Trump and Brexit were not an abrupt departure from precedent, but the consequence of a 60-year-old international trend https://t.co/shlf2L1Ek8",
  "data/tweet-economist/2021/6/1400291475792015362.json": "What makes it truly historic is the inclusion of Ra’am. It would become the first Arab party to join a government since Israel’s founding in 1948. https://t.co/zzDPDilYI9",
  "data/tweet-economist/2021/6/1400265430867005440.json": "A new poll from The Economist and YouGov found that 56% of adults in America approved of an independent commission to investigate the storming of the US Capitol on January 6th      https://t.co/Gf0KO8sbSi",
  "data/tweet-economist/2021/6/1400234577768206338.json": "Matt Gaetz and Marjorie Taylor Greene have followed the former president’s recipe for political success. They are light on substantive policy proposals, heavy on theatrics and outrage https://t.co/4nOs6jqaTp",
  "data/tweet-economist/2021/6/1400330111451340800.json": "America, Britain, Germany and Japan are among the countries aiming to imitate the Defence Advanced Research Projects Agency https://t.co/TD71TxQraN",
  "data/tweet-economist/2021/6/1400311562917797892.json": "If other EU countries will not accept Syrian refugees, the remaining options are to return to Syria voluntarily or to be housed in a prison-like deportation centre in Denmark https://t.co/MgfQANd2Rj",
  "data/tweet-economist/2021/6/1400127570516054026.json": "Partial data suggests Wuhan’s initial covid-19 outbreak may have been two or three times worse than reported by Chinese officials.\n\nSwipe to see how the city’s first wave compares to that of London and New York",
  "data/tweet-economist/2021/6/1400376715965349890.json": "Partial data suggests Wuhan’s initial covid-19 outbreak may have been two or three times worse than reported by Chinese officials.\n\nSwipe to see how the city’s first wave compares to that of London and New York",
  "data/tweet-economist/2021/6/1400423053151068164.json": "China and America dominate global business like never before. That should be a wake-up call for other countries. Our cover this week https://t.co/iTHrSL0Vra https://t.co/eUr6pxgKDn",
  "data/tweet-economist/2021/6/1400478918436659209.json": "Brazil has had a dismal decade, marked by economic decline, deforestation and now covid calamity. Jair Bolsonaro is only part of the problem https://t.co/9RShDNqXRX",
  "data/tweet-economist/2021/6/1400470142342008834.json": "Few countries have fallen as fast as Brazil. Our cover in Latin America this week argues that if Brazil is to recover, it must recognise what went wrong https://t.co/P82jsZn9nS https://t.co/uUssk5VvYM",
  "data/tweet-economist/2021/6/1400440389765636097.json": "Can we escape from information overload? Ask the man who spent a month living in in the dark https://t.co/aTZuKqsEHf From @1843mag",
  "data/tweet-economist/2021/6/1400301807642071041.json": "No covid-19 deaths have been included in official statistics since they were updated for the Chinese city on April 17th 2020 https://t.co/ZmtHzBZvni",
  "data/tweet-economist/2021/6/1400507635552636932.json": "RT @sarahmaslin: Here it is. \n\nhttps://t.co/CXwdMjc9or https://t.co/jAvMdDJuUd https://t.co/0ZgOhv21Ef",
  "data/tweet-economist/2021/6/1400520429391994880.json": "The actions required to mend Brazil are daunting. Above all, the government needs to serve the public rather than itself https://t.co/iCTRtE3Z2I",
  "data/tweet-economist/2021/6/1400485958382927876.json": "Of the 19 firms created in the past 25 years now worth over $100bn, nine are in America and eight are in China. Europe has none. Can it last? https://t.co/fbFf9W7oiC",
  "data/tweet-economist/2021/6/1400550379818000392.json": "Brazil's democracy is more fragile than at any time since the end of the dictatorship. Its economy is smaller now than it was in 2011. To recover, it must recognise what went wrong https://t.co/xlMKcFCvnX",
  "data/tweet-economist/2021/6/1400547100023214083.json": "Muto Takashi, who runs Dentsu Japanimation Studio, says “anime is no longer a subculture; it is a major culture”  https://t.co/SH0T4QYhob",
  "data/tweet-economist/2021/6/1400538301371650051.json": "On June 2nd, precisely 176 days after the world began mass vaccination programmes for covid-19, the two-billionth shot was administered https://t.co/jSnvutouIp",
  "data/tweet-economist/2021/6/1400520194771013636.json": "Some female academics who have objected to “gender ideology”—the primacy of gender identity over biological sex—have been removed from professional posts. They are fighting back https://t.co/AwiiAdZse9",
  "data/tweet-economist/2021/6/1400501863364050949.json": "At the start of the 21st century, 41 of the world's 100 most valuable companies were based in Europe. Today only 15 are https://t.co/8LzgJEVEca",
  "data/tweet-economist/2021/6/1400361757760163841.json": "One of the world’s most beautiful cities is also one of the most violent https://t.co/63kVdkp6OU https://t.co/A1UIaGuWWC",
  "data/tweet-economist/2021/6/1400572518759550977.json": "Brazil's next government must fight corruption without bias, boost competitiveness and provide economic alternatives to deforestation in the Amazon https://t.co/TeCydXiG10",
  "data/tweet-economist/2021/6/1400565475923443721.json": "This week’s cartoon from KAL: https://t.co/bPexCCcMhn https://t.co/jprfBlxzVf",
  "data/tweet-economist/2021/6/1400565468931493891.json": "One reason why meritocracy is under threat today is that inherited wealth matters more. Assets used to be worth three times annual British GDP—but in a generation they have increased to seven times GDP https://t.co/NR3GzMglc1",
  "data/tweet-economist/2021/6/1400452486452768790.json": "The dependence of commercial property on debt financing means a downturn could have nasty reverberations across the financial system https://t.co/phzuZOmFO5",
  "data/tweet-economist/2021/6/1400638158589542406.json": "“This is new territory for us,” admits Matthew Ashton, who designed the LGBTQIA+ figurines as a “display” or “statement” for those aged 18 or more https://t.co/TWMla8xezD",
  "data/tweet-economist/2021/6/1400625993057030149.json": "Approximately one-quarter of the world's adults have now received at least one dose of a covid-19 vaccine https://t.co/heF43dqCKn",
  "data/tweet-economist/2021/6/1400532788416294916.json": "KAL’s cartoon https://t.co/p2Ld5JRde9",
  "data/tweet-economist/2021/6/1400664861563146242.json": "Netflix says that over 100m households around the world streamed at least one of its anime titles in 2020, 50% more than the year before https://t.co/SrwgssjLDR",
  "data/tweet-economist/2021/6/1400652040234209284.json": "A decade ago Brazil was flush with money. But consecutive governments failed to seize the opportunity https://t.co/XE9rcP431U",
  "data/tweet-economist/2021/6/1400642821925834753.json": "David Graeber argued in a book in 2018 that society has been deliberately creating more and more “bullshit jobs” in professions such as financial services to fill the time of educated workers  https://t.co/IV7m8BOUI6",
  "data/tweet-economist/2021/6/1400681322570452992.json": "China's decision to allow couples to have three children is a big change from the draconian measures of 1979-2016  https://t.co/GTRNIp0GRw",
  "data/tweet-economist/2021/6/1400663601082376201.json": "Partial data suggests Wuhan’s initial covid-19 outbreak may have been two or three times worse than reported by Chinese officials.\n\nSwipe to see how the city’s first wave compares to that of London and New York",
  "data/tweet-economist/2021/6/1400804805119983617.json": "Christian evangelical leaders and pundits at Fox News are up in arms about the launch on June 1st, the first day of Pride month, of LEGO’s LGBTQIA+ set https://t.co/fx04saV9qo",
  "data/tweet-economist/2021/6/1400788939292790796.json": "For most of its history anime was little-known outside Japan. Now it is no longer just for otaku (geeks)  https://t.co/MmtAkjdtNm",
  "data/tweet-economist/2021/6/1400739396891119617.json": "Our excess-deaths model gives a 95% probability that the pandemic's death toll is between 7.1m and 12.7m, with a central estimate of 10.2m, as of May 10th this year https://t.co/FaV8cC7RtG",
  "data/tweet-economist/2021/6/1400732136601227264.json": "At just 17, Josep Almudéver enlisted in the fight to save the Second Republic from Francisco Franco’s fascists https://t.co/cdN9qRJ70K",
  "data/tweet-economist/2021/6/1400887622633992194.json": "Hong Kong has been the only place on Chinese soil where officials have permitted a public commemoration of the Tiananmen Square tragedy. Not any more https://t.co/rqrBk8B0LM",
  "data/tweet-economist/2021/6/1400875101910937608.json": "In April, Brazil suffered the highest rate of covid-related deaths of any nation on Earth.\n\nMany blame President Jair Bolsonaro for letting things get this bad. Why is he still so popular among his supporters? https://t.co/i3oeCYolVE",
  "data/tweet-economist/2021/6/1400867201381511171.json": "The student protests that engulfed Tiananmen Square in 1989—and the Chinese government’s violent response to them—have become a byword for communist repression  https://t.co/CvHzRywoF5",
  "data/tweet-economist/2021/6/1400843804513648640.json": "It is usually bad news when multiple religions claim the same place of worship. It can lead to conflict. Berlin's House of One is bucking the trend\nhttps://t.co/asaeANz3Sa",
  "data/tweet-economist/2021/6/1400724018299277314.json": "A new report marks a challenge to the transgender ideology that has become the norm on American campuses and in universities around the English-speaking world https://t.co/Oa6Zo4ciih",
  "data/tweet-economist/2021/6/1400853620044804098.json": "Some female academics who have objected to “gender ideology”—the primacy of gender identity over biological sex—have been removed from professional posts. They are fighting back https://t.co/MGJBUwD5oi",
  "data/tweet-economist/2021/6/1400966865590132740.json": "Any mention of the Tiananmen Square events of June 4th 1989 is strictly censored within China  https://t.co/YzdL8suI4V",
  "data/tweet-economist/2021/6/1400950523071766532.json": "Ten years ago, Jair Bolsonaro’s election would have been unthinkable. What changed?      https://t.co/DdVOkOUXHe",
  "data/tweet-economist/2021/6/1400976928899731458.json": "Koreans are as barely more inclined towards China as they are towards North Korea. Young people take a particularly dim view of China https://t.co/S1oigREPeb",
  "data/tweet-economist/2021/6/1401060298396688387.json": "Emmanuel Macron is the first French president to recognise his country’s responsibility in the slaughter of hundreds of thousands of Rwandans in 1994 https://t.co/WR8g55S13o",
  "data/tweet-economist/2021/6/1401055982613041156.json": "It is likely that thousands of people in Beijing lost their lives on June 4th while protesting for greater freedom and democracy  https://t.co/902qk3Ugle",
  "data/tweet-economist/2021/6/1401042288030240770.json": "The far-off islands are alluring and largely untouched. That could soon change, if the Indian governments gets its way https://t.co/8cQUBFH0b4",
  "data/tweet-economist/2021/6/1401025880785358850.json": "Anime is booming. But Japan's dwindling talent pool of animators could have trouble meeting rising demand https://t.co/feo01TB4tR",
  "data/tweet-economist/2021/6/1400912512443375623.json": "Brazil’s fate will probably be decided by voters next year. Jair Bolsonaro's rivals should offer solutions rather than peddle nostalgia https://t.co/Rxij6Mb3QJ",
  "data/tweet-economist/2021/6/1400818643596947464.json": "The US Innovation and Competition Act lays out ten focus areas, such as artificial intelligence, biotechnology and advanced materials science, to which new research funding will be directed  https://t.co/2etoGHZkms",
  "data/tweet-economist/2021/6/1401078318754156548.json": "Binyamin Netanyahu has been a uniquely talented demagogue, eloquent and ruthless in equal measure https://t.co/Xw1zaXk9oQ",
  "data/tweet-economist/2021/6/1400896146868944905.json": "The wealth of a country remains the best determinant of the number of vaccines it has administered relative to its population https://t.co/OpNaTrNETw",
  "data/tweet-economist/2021/6/1400836016018235395.json": "Some political activists talk of independence of the province of Mendoza from Argentina—they call it “MendoExit” https://t.co/YlInjuqCmB",
  "data/tweet-economist/2021/6/1401174480211386372.json": "\"We are building the House to make a statement,\" said Rabbi Andreas Nachama, one of the project's leaders. Berlin’s House of One intentionally puts a church, mosque and synagogue under a single roof\nhttps://t.co/ElCUXpBeog",
  "data/tweet-economist/2021/6/1401169206343766016.json": "A decade ago Brazil was flush with money. But consecutive governments failed to seize the opportunity https://t.co/EiQsyrHE47",
  "data/tweet-economist/2021/6/1401095832200417282.json": "There are almost 2,000 mosques in Britain. A new book takes readers inside many of them https://t.co/fUMSjONZjK",
  "data/tweet-economist/2021/6/1401184581508907026.json": "The conduct of Brazil's president probably qualifies as impeachable, including \"crimes of responsibility\": urging people to defy lockdowns, ignoring vaccine offers and firing officials to shield his sons https://t.co/D5eJdJCdD9",
  "data/tweet-economist/2021/6/1401150961872257026.json": "A decade ago Brazil, Mexico and India were poised to create a large cohort of global firms. What happened? https://t.co/Nvr3rvzWd5",
  "data/tweet-economist/2021/6/1401216576158846979.json": "Jair Bolsonaro borrowed heavily from Donald Trump’s tactics to win Brazil’s election: populism, nationalism, chauvinism and fake news  https://t.co/FdTKgT6ywF",
  "data/tweet-economist/2021/6/1401207228049276932.json": "Few countries have fallen as fast as Brazil. Our cover in Latin America this week argues that if Brazil is to recover, it must recognise what went wrong https://t.co/kvIGUZo4OO https://t.co/bzyrDfh4Uz",
  "data/tweet-economist/2021/6/1401196389841911809.json": "As governments across the rich world begin to spend more on research and development, the idea of an agency to invent the future is alluring https://t.co/oBxNgl1yk0",
  "data/tweet-economist/2021/6/1401065507218919425.json": "Under Jacob Zuma, state-owned enterprises in South Africa were looted on a vast scale. Since Cyril Ramaphosa took over as president in 2018 he has tried to clamp down on graft https://t.co/B0dVyB0C3j",
  "data/tweet-economist/2021/6/1400860160562806789.json": "Globally, more than 103m square feet of office space has already been vacated since the pandemic began. That is 18% more lost floor space than during the financial crisis of 2007-09 https://t.co/CKLQzZ7non",
  "data/tweet-economist/2021/6/1401229859934846979.json": "The actions required to mend Brazil are daunting. Above all, the government needs to serve the public rather than itself https://t.co/BHLE8azDAF",
  "data/tweet-economist/2021/6/1401189080701022217.json": "China’s policy on family size inflicted huge suffering on the millions punished for failing to observe it. And it achieved nothing useful  https://t.co/E68Xlp9msJ",
  "data/tweet-economist/2021/6/1401248224673947648.json": "The Hong Kong government has banned the annual Tiananmen Square vigil, citing worries about the spread of the coronavirus. Many believe this is an excuse to clamp down further on their civil liberties https://t.co/9CCd215MzA",
  "data/tweet-economist/2021/6/1401267610633781253.json": "Brazil's currency has fallen by 25% against the dollar since covid-19 broke out     https://t.co/Ms4Vsgu47d",
  "data/tweet-economist/2021/6/1401267612038860806.json": "In 1970, only 5% of Brazilians were evangelical. Now a third are due, in part, to rapid urbanisation    https://t.co/6oqHSxiK15",
  "data/tweet-economist/2021/6/1401318128534048768.json": "Tensions between China's Communist Party and protestors had been building up for weeks before the bloody day of June 4th 1989  https://t.co/LnEhphEl7d",
  "data/tweet-economist/2021/6/1400990038297567235.json": "On June 4th Chow Hang Tung, a barrister and human-rights activist, was arrested in Hong Kong, accused of using social media to promote the banned Tiananmen Square vigil https://t.co/LTFIvpdOzP",
  "data/tweet-economist/2021/6/1401313585557643268.json": "A pastrami sandwich is testament to the Jewish fear that someone, somewhere might at some point go hungry. From @1843mag https://t.co/fcVAf7arNq",
  "data/tweet-economist/2021/6/1401365946539909129.json": "In modern times the Dutch have played down the country’s history of slavery. But that has become harder as the Netherlands has grown more multicultural https://t.co/3wJ043nTXk",
  "data/tweet-economist/2021/6/1401360727592607748.json": "For real change to happen in Brazil, the most urgent priority is to vote Jair Bolsonaro out   https://t.co/iDQfgYXHJc",
  "data/tweet-economist/2021/6/1401342880212525061.json": "An unintended consequence of banning the Tiananmen Square vigil has been uniting Hong Kong’s democracy movement and strengthening its ties to mainland activists https://t.co/5p5S7a4VaF",
  "data/tweet-economist/2021/6/1401304345728143364.json": "Social mobility in America has stalled and critics on both left and right see a country in thrall to a self-serving elite. Can American meritocracy be mended? Listen to “Checks and Balance” https://t.co/2IykJ1mjsq",
  "data/tweet-economist/2021/6/1400909743280041989.json": "In 2019 anime-related revenues hit ¥2.5trn ($24bn). Just under half came from abroad https://t.co/60YuCH9WJ3",
  "data/tweet-economist/2021/6/1401382089765888000.json": "The problem of bias in decisions is well known. But noise is different precisely because it is less apparent https://t.co/RdshxhZBDI",
  "data/tweet-economist/2021/6/1401394879310319618.json": "Every other country grants its people the basic freedom over whether or not to have children. Why not China?  https://t.co/pBL9lgsU6v",
  "data/tweet-economist/2021/6/1401420382213742594.json": "Emmanuel Macron's effort to reset French policy in Africa is based on a geostrategic calculation. Yet there is tension in his plan https://t.co/SOWyajZZd4",
  "data/tweet-economist/2021/6/1401386748735860738.json": "Just as the English language loosely knits the world together with common cultural touchstones, so did Persian and Sanskrit create transregional cultural spheres. India was where the two met https://t.co/MeHZ8hSfNC",
  "data/tweet-economist/2021/6/1401438163265101828.json": "Brazil has had a dismal decade, marked by economic decline, deforestation and now covid calamity. Jair Bolsonaro is only part of the problem https://t.co/e4AX6pCCLJ",
  "data/tweet-economist/2021/6/1401428232377929729.json": "How did Jair Bolsonaro become president and how has it impacted Brazil’s democratic institutions and economy? https://t.co/iB8UnbYUxB",
  "data/tweet-economist/2021/6/1401158890729971712.json": "Officials call the line a gift for the Communist Party’s 100th birthday. But it is only part of what China calls the \"project of the century\" https://t.co/HFrwDPbFZv",
  "data/tweet-economist/2021/6/1401416184176779272.json": ".@adwooldridge traces the idea from Plato’s “Republic”, through Napoleon’s “career open to talent” to the attack on Victorian nepotism led by Britain’s intellectual aristocracy https://t.co/PLh5LXJAFN",
  "data/tweet-economist/2021/6/1401499246113796099.json": "In a world plagued by authoritarian populists, Mexico’s president has somehow escaped the limelight. But he is a danger to Mexican democracy https://t.co/cpDlDfjpdR",
  "data/tweet-economist/2021/6/1401472814885052418.json": "Millions of Indians share their homes with domestic workers. Covid-19 is puncturing some myths about that relationship. From @1843mag  https://t.co/IMUMYT5Ql4",
  "data/tweet-economist/2021/6/1401356342867247116.json": "Around 97% of the islands' inhabitants are Muslim. Still, Lakshadweep's new administrator, a BJP man, wants to ban the sale of beef and expand liquor permits https://t.co/zHkLKNLVkc",
  "data/tweet-economist/2021/6/1401506164056203264.json": "When completed in 2030, the railway will connect Lhasa with Chengdu in just 12 hours https://t.co/JOIFt0Jxkx",
  "data/tweet-economist/2021/6/1401518183320797188.json": "In the 2022 elections, opponents of Jair Bolsonaro will have to work together in order to loosen his grip     https://t.co/DT7jW5DuHF",
  "data/tweet-economist/2021/6/1401351864336019458.json": "In 2020 Google’s internal style guide was updated, encouraging developers to eschew “unnecessarily gendered language” in their documentation. Now the tech company is going further https://t.co/UmrMFumBC6",
  "data/tweet-economist/2021/6/1401343342768754691.json": "Poor countries' biggest complaint is that richer countries may get the bulk of taxable profits being grabbed back from tax havens, while they are left with the scraps https://t.co/XneLPC6BIo",
  "data/tweet-economist/2021/6/1401554674952593446.json": "As well as replacing Jair Bolsonaro, Brazil must deal with the disillusion that got him elected, by tackling chronic low growth and inequality https://t.co/WFqgG67QKJ",
  "data/tweet-economist/2021/6/1401562684726906885.json": "The logo of the West India Company, a nostalgic sight on old canal houses in Dutch cities, takes on a different aura once you have seen it on a branding iron https://t.co/bdt0gakvA7",
  "data/tweet-economist/2021/6/1401577146632617986.json": "The conduct of Brazil's president probably qualifies as impeachable, including \"crimes of responsibility\": urging people to defy lockdowns, ignoring vaccine offers and firing officials to shield his sons https://t.co/s7CerVBVWE",
  "data/tweet-economist/2021/6/1401530502679609344.json": "In a country where politics has long been dominated by oligarchs, the victory of a man whose only asset was his popularity seemed almost a miracle https://t.co/kOfZ3P5KaI",
  "data/tweet-economist/2021/6/1401612628179525640.json": "An idea in the works for a decade, Berlin’s House of One intentionally puts a church, mosque and synagogue under a single roof\nhttps://t.co/1w4wPv6H4k",
  "data/tweet-economist/2021/6/1401607083800289280.json": "A decade ago Brazil was flush with money. But consecutive governments failed to seize the opportunity https://t.co/O3Ctn1eyIh",
  "data/tweet-economist/2021/6/1401599777511444481.json": "Brazil is facing its biggest crisis since the return to democracy in 1985   https://t.co/OA4wchdMuz",
  "data/tweet-economist/2021/6/1401599281438539776.json": "As long as President López Obrador is in charge, there will be two Mexicos. One, a dynamic and integrated part of North America; the other, remote, backward and resentful https://t.co/MOcXToHCz4",
  "data/tweet-economist/2021/6/1401322065744076800.json": "Poor black evangelical women are often derided by Jair Bolsonaro. Yet two-­thirds of evangelicals voted for him—many on advice from their pastors   https://t.co/pgPJVZTgA3",
  "data/tweet-economist/2021/6/1401622276903145474.json": "Google Docs, Google’s popular free word-­processing software, will offer gender­-neutral suggestions—such as “chairperson” rather than “chairman” https://t.co/FQ3mZcXWeK",
  "data/tweet-economist/2021/6/1401604929534533638.json": "At the start of the 21st century, 41 of the world's 100 most valuable companies were based in Europe. Today only 15 are https://t.co/MwP8tRsgvM",
  "data/tweet-economist/2021/6/1401656663682191367.json": "\"Psychologists have studied for years the process of extinguishing fears. They know exactly how to do it,\" writes @susancain, author of \"Quiet,\" in The Economist  https://t.co/tIp0whlJAL",
  "data/tweet-economist/2021/6/1401675698817863690.json": "“Merit is contaminated by money. The rich and successful are buying meritocratic success.” @ADWooldridge examines the new American aristocracy on “Checks and Balance” https://t.co/32nugCimt9",
  "data/tweet-economist/2021/6/1401806269661523972.json": "The English government’s latest commitment takes spending to £310 for every schoolchild. By contrast, American lawmakers have provided £1,600 per pupil and the Netherlands has provided £2,500 https://t.co/lVvXYcM5Tq",
  "data/tweet-economist/2021/6/1401770710809382914.json": "Some female academics who have objected to “gender ideology”—the primacy of gender identity over biological sex—have been removed from professional posts. They are fighting back https://t.co/PV5JzvL3ru",
  "data/tweet-economist/2021/6/1401764108731551746.json": "In a recent speech in Rwanda, Emmanuel Macron said he hoped survivors of the genocide there might \"perhaps forgive\" France https://t.co/f8xVYfFHNL",
  "data/tweet-economist/2021/6/1401759631349796867.json": "The era of small-state privilege in Europe is coming to an end https://t.co/eSyDmna16K",
  "data/tweet-economist/2021/6/1401457460477636608.json": "Not everyone is a fan of artificial grasses—they contain microplastics that ruin soil, impede drainage and risk flooding https://t.co/1CXIbmAQwr",
  "data/tweet-economist/2021/6/1401831348806033409.json": "Brazil's public-sector workers should have fewer privileges. This is even more true of its politicians https://t.co/0SQF9Hahgd",
  "data/tweet-economist/2021/6/1401867491450757123.json": "Some of Brazil’s most daunting challenges? Economic stagnation, political polarisation and environmental ruin    https://t.co/My2Fz036qS",
  "data/tweet-economist/2021/6/1401862953071218688.json": "As well as replacing Jair Bolsonaro, Brazil must deal with the disillusion that got him elected, by tackling chronic low growth and inequality https://t.co/dB48Uj0W1s",
  "data/tweet-economist/2021/6/1401895069058224130.json": "Jair Bolsonaro's campaign railed against corruption—but he wants to wreck the institutions tackling graft, not reform them      https://t.co/AzvvvGUW8N",
  "data/tweet-economist/2021/6/1401871591995289605.json": "Mexico’s largest-ever election is a referendum on the increasingly undemocratic rule of Andrés Manuel López Obrador, @sarah_birke tells “The Intelligence” https://t.co/91dxW8JH6e",
  "data/tweet-economist/2021/6/1401840040741851141.json": "A radicalised version of Islam being preached by clerics not only promotes intolerance but also fosters extremism https://t.co/9sGFeVZAOU",
  "data/tweet-economist/2021/6/1401986595696357382.json": "Many workers like working from home because they can save time and money by not having to commute https://t.co/F0an0AyVD0",
  "data/tweet-economist/2021/6/1401876373812269063.json": "A new exhibition illuminates the history of Dutch slavery https://t.co/XUI6kbJNeJ",
  "data/tweet-economist/2021/6/1401614906340880391.json": "Not only do individuals differ with their peers, they often fail to agree with themselves https://t.co/KH0Ts1udBJ",
  "data/tweet-economist/2021/6/1402007481845489669.json": "Four more years of Jair Bolsonaro in charge could devastate the Amazon, where much of the rainforest could turn into dry savannah        https://t.co/SPAay4DGY9",
  "data/tweet-economist/2021/6/1402007481803497481.json": "Brazil is backsliding. What caused the decade-long disaster?      https://t.co/QzdSHKUY1W",
  "data/tweet-economist/2021/6/1401330634283487233.json": "China’s population would have stopped growing anyway as a result of per­sonal choice, as it has elsewhere in the world  https://t.co/CLZUA0F2ub",
  "data/tweet-economist/2021/6/1402063998661632001.json": "Ever since the rubber boom in the late 1800s, wealth and employment in the Amazon have come from extraction: logging, mining, farming     https://t.co/vRLY1WjJOM",
  "data/tweet-economist/2021/6/1402076773769228289.json": "Alzheimer’s accounts for 60-80% of cases of a debilitating condition that affects an estimated 50m people around the world, and it’s spreading fast  https://t.co/9D0KU9ZLS9",
  "data/tweet-economist/2021/6/1402072023413805056.json": "In “Slavery”, an exhibition @rijksmuseum, the attention to enslaved Africans and Asians in Holland is path-breaking https://t.co/oemBSMhc35",
  "data/tweet-economist/2021/6/1402086973377032192.json": "The authors of “Noise” welcome artificial intelligence to make many decisions in society, but acknowledge that people are predisposed to resisting their answers https://t.co/g0OYyeornj",
  "data/tweet-economist/2021/6/1402111256094560256.json": "In many countries, particularly authoritarian regimes, people say they want fewer controls  https://t.co/4wGunoq2o0",
  "data/tweet-economist/2021/6/1402068002649120774.json": "The kimchi wars between South Korea and China are heating up https://t.co/CIDxZ9B3dC",
  "data/tweet-economist/2021/6/1402115153638866944.json": "All big companies are under increasing pressure not just to sell their widgets but to take a stance on the hot­-button issues of the day https://t.co/UszWlFUwDs",
  "data/tweet-economist/2021/6/1402173643489255426.json": "The ocean is humanity's responsibility to look after, says Sir David Attenborough. How can countries be galvanised to save it? https://t.co/Owwm1pyltB https://t.co/I8t2w9HsIW",
  "data/tweet-economist/2021/6/1402205440000339971.json": "Saving democracy in Brazil will take more than manifestos      https://t.co/KC7Rsm8vJI",
  "data/tweet-economist/2021/6/1402239918752022528.json": "At the start of the 21st century, 41 of the world’s 100 most valuable companies were based in Europe. Today only 15 are. How did this happen? https://t.co/Yjl5SodOk8 https://t.co/RrRjBgEXfZ",
  "data/tweet-economist/2021/6/1402123847302852610.json": "Some organisations are now using software to comb video for potential evidence of war crimes https://t.co/pVN0l2cKyp",
  "data/tweet-economist/2021/6/1402024842614951940.json": "Westerners tend to regard freedom of speech as a universal good. But a forthcoming report from a Danish think-tank shows that public support for freedom of expression varies widely among countries  https://t.co/cK2vPzivaD",
  "data/tweet-economist/2021/6/1402220972111974403.json": "If Pedro Castillo wins, the country will take a lurch to the left of unknown magnitude https://t.co/UsB69EQ1H9",
  "data/tweet-economist/2021/6/1402107112701009931.json": "A new law would allow locals on the Arabian Sea islands to be jailed without a hearing for up to a year https://t.co/MYPjmyckyz",
  "data/tweet-economist/2021/6/1402325112674652164.json": "Meet the man trying to bring marine life back to one of the most damaged parts of the ocean https://t.co/Im0puwFeH8 https://t.co/0r5nv3uvt6",
  "data/tweet-economist/2021/6/1402308493948952578.json": "RT @sarahmaslin: (Thread) A decade ago, Brazil seemed destined to flourish. In 2009, the cover of @TheEconomist showed Rio de Janeiro's Chr…",
  "data/tweet-economist/2021/6/1402472169762967552.json": "In cracking the puzzle of superspreading, researchers have had to re-evaluate their understanding of SARS-CoV-2’s transmission https://t.co/W7dcssQY7A",
  "data/tweet-economist/2021/6/1402420192798511107.json": "The best performers on EIU’s new survey of “liveability” in 140 cities combined generous freedoms with few severe cases of covid-19  https://t.co/BBSgGatcUN",
  "data/tweet-economist/2021/6/1402519399509147650.json": "Most cities in Europe plunged in the rankings this year as the EIU’s liveability index incorporated new indicators related to covid-19  https://t.co/cbkArzPHRi",
  "data/tweet-economist/2021/6/1402548081091022849.json": "Police eavesdropped on murder plots, weapons trading, money laundering and drug trafficking using Anom, an encrypted communication system owned and run by the FBI  https://t.co/bQEH2Odzc5",
  "data/tweet-economist/2021/6/1402439356623765509.json": "In parts of Beijing, Sinovac jabs come with two cartons of eggs. One Thai town is offering cows to spur vaccinations. We explain whether vaccine incentives work https://t.co/15G6EdHtWF",
  "data/tweet-economist/2021/6/1402636675600244739.json": "According to data from nine mostly rich-world countries, a majority of workers have consistently claimed that remote work either has no effect on, or even boosts, their productivity.\n\nBut what do employers think about about their workers’ productivity at home? Swipe to see ➡️",
  "data/tweet-economist/2021/6/1402636362851958789.json": "Today Alexei Navalny’s organisation goes on trial behind closed doors in Russia as the Kremlin tries to suppress the country’s political opposition. \n\nIn May, @1843mag argued that although Navalny may be in prison, his standing has never been greater https://t.co/QrcJH57CoV",
  "data/tweet-economist/2021/6/1402688964558000128.json": "Jeff Bezos looks likely to trump Elon Musk by visiting space himself first—albeit that the definition of “outer space” involved is quite a technical one https://t.co/8FSJoqZW66",
  "data/tweet-economist/2021/6/1402683926326530049.json": "Where does your city rank on the Economist Intelligence Unit’s Global Liveability Index for 2021? https://t.co/NjHbk1rbrL https://t.co/JDIhUPjWlJ",
  "data/tweet-economist/2021/6/1402651476174966793.json": "How the Vietnamese transformed a pale colonial soup into a vibrant national dish. From @1843mag https://t.co/jmBfpKp5MK",
  "data/tweet-economist/2021/6/1402584987468193793.json": "For the first time, Auckland leads the EIU’s ranking, thanks largely to the city’s early containment of the pandemic and its subsequent ability to lift restrictions on mobility. \n\nSwipe to see more ➡️",
  "data/tweet-economist/2021/6/1402822443601956867.json": "The G7's failure to act fast enough to inoculate the world against covid-19 is not just economically foolish, it is a moral failure and a diplomatic disaster, too  https://t.co/LQUcLX1ubN",
  "data/tweet-economist/2021/6/1402840065764728834.json": "Elon Musk, an electric-car tycoon whose tweets seem to make the weather in crypto markets, says he now favours younger rivals. Could one of them steal bitcoin’s crown?  https://t.co/zyB1arEKdB",
  "data/tweet-economist/2021/6/1402863938027524099.json": "Bitcoin accounts for 40% of the total value of all cryptocurrencies today, compared with 70% in January  https://t.co/Cu94z5BCyc",
  "data/tweet-economist/2021/6/1402879741766557697.json": "To get roughly 70% of the planet’s population inoculated by April, the IMF calculates, would cost just $50bn. The cumulative economic benefit by 2025 would be $9trn  https://t.co/1bi3VVIwEg",
  "data/tweet-economist/2021/6/1402897091861565443.json": "The Ordinary is a case study in the art of \"unselling\" https://t.co/2qLVzySh78 From @1843mag",
  "data/tweet-economist/2021/6/1402921997424791552.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/Mm46XKkFVk  From @1843mag",
  "data/tweet-economist/2021/6/1403068854625083392.json": "RT @michaelreid52: Pedro Castillo is on the verge of becoming Peru’s president. Our report on a bitterly divisive election https://t.co/4LM…",
  "data/tweet-economist/2021/6/1403064190387032068.json": "In the 1980s Muhammadu Buhari arrested journalists for publishing items that brought the government “ridicule or disrepute”. Last week he was at it again, suspending Twitter  https://t.co/a1OEVH1EYK",
  "data/tweet-economist/2021/6/1403049362733862918.json": "This week’s cartoon from KAL: https://t.co/SqxK6mrMbJ https://t.co/Y5FruXFIyj",
  "data/tweet-economist/2021/6/1403089612139028485.json": "Vladimir Putin has tried (and so far failed) to get a Russia without Alexei Navalny—and many of his supporters \n https://t.co/BQuFzLYwFY",
  "data/tweet-economist/2021/6/1403115775322431492.json": "By forcing sports teams to play games without fans, the covid-19 pandemic created a compelling natural experiment that has unleashed a flurry of academic research  https://t.co/KrJWmRkrMi",
  "data/tweet-economist/2021/6/1403170520560963586.json": "Alexei Navalny is the first opposition politician since the collapse of the Soviet Union to mobilise a powerful opposition movement that draws together many strands of society  https://t.co/CUmKSZ7Nzg",
  "data/tweet-economist/2021/6/1403179437101834247.json": "Lawyers for two Uyghur groups allege that nearly 3,000 Uyghurs have been compelled to return from Tajikistan to China, where they are likely to end up in detention camps https://t.co/nTJp58CASx",
  "data/tweet-economist/2021/6/1402736530469310471.json": "Two factors distinguished Mexico’s recent midterm elections: the unusually high level of violence and the increase of women in politics  https://t.co/UtuNp2uYL3",
  "data/tweet-economist/2021/6/1403157808120467459.json": "Peru now faces several perils. The first is a fight over the election result, which may not be declared for several days https://t.co/G5B7gub583",
  "data/tweet-economist/2021/6/1403265258219843585.json": "Though Alexei Navalny has never been allowed to run for president—the Kremlin has barred him from standing and has banned his party—his activism and fight against corruption have attracted millions of supporters  https://t.co/UFY4ox5plM",
  "data/tweet-economist/2021/6/1403306040209379331.json": "History “is not the past”, Hilary Mantel once said. “It’s what’s left in the sieve when the centuries have run through it” https://t.co/vR5KHcPJJo",
  "data/tweet-economist/2021/6/1403344517533741059.json": "Peru has a taste for electing outsiders. But none had as little political experience or knowledge of the world, or stood on such a radical leftist platform, as Pedro Castillo https://t.co/Lm83KrgyBJ",
  "data/tweet-economist/2021/6/1403381535198359563.json": "Pedro Castillo’s victory, assuming it is confirmed, poses big risks. The most likely is of a weak, incompetent government https://t.co/HSsVGv2VRE",
  "data/tweet-economist/2021/6/1403491754515566596.json": "Pedro Castillo campaigned on a populist­-leftist platform, promising a more statist economy and a constituent assembly to write a new constitution https://t.co/N5aFPCV2PL",
  "data/tweet-economist/2021/6/1403515163727339522.json": "The rise of political YouTubers and other influencers has resulted in the globalisation of political ideas, many from America https://t.co/dGu09ILd7h",
  "data/tweet-economist/2021/6/1403569520690728961.json": "China is building museums at a frenetic pace. In 2000 it had fewer than 1,200 of them. By the end of last year there were nearly five times as many https://t.co/aXHOf1Adzn",
  "data/tweet-economist/2021/6/1403583421700530178.json": "Vladimir Putin’s sole preoccupation is his own survival. The Kremlin’s fear of Alexei Navalny spearheading a mass protest movement has driven the Kremlin to more extreme action  https://t.co/JN6xalyZ5T",
  "data/tweet-economist/2021/6/1403341007899463686.json": "Uyghur activists will see benefit if the complaint simply serves to discomfit China and draw international attention to its abuses in Xinjiang. But they are hoping for more https://t.co/NGHU6n79Br",
  "data/tweet-economist/2021/6/1403603808748552193.json": "On average, white players scored slightly worse without fans than they did in packed stadiums. In contrast, non-white footballers’ performances improved to a statistically significant degree when fans were absent  https://t.co/jrfEDBt5eM",
  "data/tweet-economist/2021/6/1403668162562899969.json": "Nigerians are outraged that Muhammadu Buhari is focused on banning Twitter while failing to solve more pressing problems, such as soaring kidnappings or killings by jihadists https://t.co/Pz91Lsg7Rg",
  "data/tweet-economist/2021/6/1403714987168776198.json": "Chinese officials involved in repressing Uyghurs will not be losing any sleep over the complaint, but the government will be displeased https://t.co/D5qTNZiryo",
  "data/tweet-economist/2021/6/1403720495632109568.json": "Nearly all adults in a Brazilian town were inoculated as part of a study. Preliminary results showed that symptomatic cases of covid-19 and deaths fell by 80% and 95%, respectively https://t.co/zoCLzf9BVI",
  "data/tweet-economist/2021/6/1403715973052502022.json": "“As a young scientist I was terrified of what people might think about me...Now I don’t give a damn. I just want to find the truth with whatever I look at.” Read @1843mag's profile of Avi Loeb https://t.co/MS4gzsjpbJ",
  "data/tweet-economist/2021/6/1403546610232180739.json": "New surveys corroborate earlier analysis that the government’s numbers represent a disturbingly small fraction of the real figure https://t.co/YoU7lhuM8N",
  "data/tweet-economist/2021/6/1403722264424689667.json": "Two years ago Bath was among the first British cities to declare a “climate emergency”, when it also vowed to go carbon neutral by 2030 https://t.co/6QMqfu5b0U",
  "data/tweet-economist/2021/6/1403733595609604097.json": "Banning Alexei Navalny’s organisation is unlikely to stop a historic shift that he has helped bring about  https://t.co/00o3syrXTs",
  "data/tweet-economist/2021/6/1403713751019315209.json": "How Peru got here is a lesson in how to squander progress https://t.co/2MOh87GBpX",
  "data/tweet-economist/2021/6/1403757239064743945.json": "Last month the Spanish parliament voted against a bill that would allow people to determine their own gender. A day later Germany's voted down two similar bills https://t.co/PxbYY63Kmw",
  "data/tweet-economist/2021/6/1403785449802510337.json": "Elon Musk and Jeff Bezos have long been trying to do something similar in outer space. The battle of the space cadets is hotting up https://t.co/bRfXmGqySN",
  "data/tweet-economist/2021/6/1403751472039448578.json": "Bitcoin has disrupted the global financial system, but can it ever live up to its hype?       https://t.co/8Pms4ivkWW",
  "data/tweet-economist/2021/6/1403833504044040193.json": "Far from the recent political posturing oﬀ Jersey, the French and British navies are busy with the unfashionable business of working together\nhttps://t.co/RVxdljykyf",
  "data/tweet-economist/2021/6/1403843318694481927.json": "Two-thirds of humankind now lives in countries where renewable power offers the cheapest new electrical-generating capacity. Still, this is not enough https://t.co/eAQiAWLj6B",
  "data/tweet-economist/2021/6/1403849371721084931.json": "There are almost no first-­person testimonies from Greek or Roman women. Such silences speak volumes. They do not, alas, fill them https://t.co/FlDR1GTedA",
  "data/tweet-economist/2021/6/1403833758499868673.json": "One pollster suggests that India has seen “data suppression at every level, no matter who is in charge” https://t.co/f5zh252CiF",
  "data/tweet-economist/2021/6/1403894925364764674.json": "Joe Biden believes that America and its rich allies must offer poor countries an attractive alternative to Chinese loans and investment https://t.co/5V9PkrMmVj",
  "data/tweet-economist/2021/6/1403704408647639049.json": "Andrés Manuel López Obrador will now have to negotiate with other politicians to pass laws—but the opposition’s lack of focus will complicate matters https://t.co/lSfK7pM86p",
  "data/tweet-economist/2021/6/1403887861888393216.json": "Pedro Castillo’s biggest political headache is likely to be the new Congress, which has a broadly conservative majority https://t.co/KCFXUcz2Nr",
  "data/tweet-economist/2021/6/1403755986305884162.json": "During the pandemic, drug consumption simply moved from club to living room\nhttps://t.co/k0AL0JIyvK",
  "data/tweet-economist/2021/6/1403921834295410688.json": "Uyghur activists will see benefit if the complaint simply serves to discomfit China and draw international attention to its abuses in Xinjiang. But they are hoping for more https://t.co/ms9pUFAUix",
  "data/tweet-economist/2021/6/1403940230760108033.json": "A study has found the real source of inefficiency was time spent in meetings. The answer is simple: don't call as many meetings, and keep them short       https://t.co/1drnC83lCS",
  "data/tweet-economist/2021/6/1403939211242258436.json": "The discrepancy does not just mean that the true level of suffering has been glossed over. It has made the crisis worse, for instance by causing underestimates in demand for oxygen and drugs https://t.co/XYrlyIllzb",
  "data/tweet-economist/2021/6/1403985825969459203.json": "Why do languages die? https://t.co/iAhlEvDgBs",
  "data/tweet-economist/2021/6/1403997388558196736.json": "The attorney-general has threatened to prosecute Nigerians who tweet. Yet the government has refused to specify what, if any, law is being broken by people who do so https://t.co/MPAY4GVyOP",
  "data/tweet-economist/2021/6/1403893170321170432.json": "Dead turtles and dolphins have started washing ashore, fishing is disrupted and nurdles have swamped the coastline. But many people are focusing more on the aftermath of a birthday party https://t.co/MFrR0yLumj",
  "data/tweet-economist/2021/6/1404034338191200262.json": "All adults in the town of Serrana were offered jabs as part of a study. More than 95% had them, despite President Jair Bolsonaro claiming vaccines were unsafe https://t.co/9MGXXv3sH5",
  "data/tweet-economist/2021/6/1403685531041636361.json": "Education has become a global battle and tutors are a secret weapon https://t.co/xBx6G5noJU From @1843mag",
  "data/tweet-economist/2021/6/1404024256225230854.json": "Bath wants—and is legally required—to preserve its heritage. That makes its goal of going carbon neutral by 2030 difficult https://t.co/u2BH5haVVI",
  "data/tweet-economist/2021/6/1404073830503653378.json": "If Italy is to meet its 2030 target it will need by then to have around 70 gigawatts of renewable power-generating capacity. At it's current rate, the country will be nowhere near that amount https://t.co/bbwvWKSZF1",
  "data/tweet-economist/2021/6/1404083156622454789.json": "All adults in the town of Serrana were offered jabs as part of a study. More than 95% had them, despite President Jair Bolsonaro claiming vaccines were unsafe https://t.co/AIhTX1Vgls",
  "data/tweet-economist/2021/6/1403723516525039617.json": "Pedro Castillo faces an almost impossible balancing act of trying to govern pragmatically for the majority while keeping his radical base happy https://t.co/8IaShnDBU2",
  "data/tweet-economist/2021/6/1404121402530316290.json": "Polarisation, fragmentation and populism also afflict Latin America’s giants, Brazil and Mexico. But Peru’s case is especially severe https://t.co/CO3fs9UdWA",
  "data/tweet-economist/2021/6/1404136665233473543.json": "Mangroves are the only trees that thrive in saltwater. But that’s not their only superpower. Film supported by @Blancpain1735 https://t.co/fOrQbdx2nW https://t.co/0I2Kf71FHh",
  "data/tweet-economist/2021/6/1403872266040090624.json": "“Picking up where Concorde left off” is how Blake Scholl, chief executive of Boom Supersonic, describes Overture 1, the jet which the American startup is developing     https://t.co/2bmVaJ8VeZ",
  "data/tweet-economist/2021/6/1404134245535264773.json": "The rise of political YouTubers and other influencers has resulted in the globalisation of political ideas, many from America https://t.co/XxpBHF4nA2",
  "data/tweet-economist/2021/6/1404169465554780172.json": "Knowledge of another language can open up a whole new world of art, history, literature and food. But which is the best to learn? https://t.co/V3vsr1hXkV From the @1843mag archive",
  "data/tweet-economist/2021/6/1404193869353394179.json": "On average, cocaine in Europe was 57% purer in 2019 than ten years earlier. An ecstasy pill contained almost 2.5 times as much MDMA, and cannabis had 56% more THC\nhttps://t.co/YhlCM4GEwA",
  "data/tweet-economist/2021/6/1404254831028621314.json": "The G7 countries have agreed to form a multilateral rival to China’s Belt and Road Initiative that would in theory offer poor countries an alternative source of finance    https://t.co/rcSGDJAsyt",
  "data/tweet-economist/2021/6/1404259558156115971.json": "The British government is turning children’s prisons into schools https://t.co/c8jZyxB5H0",
  "data/tweet-economist/2021/6/1404239389472006146.json": "Some studies suggest that when policemen spend more time collecting fines and fees—and therefore less time investigating murders—clearance rates may suffer  https://t.co/KHNvD9a3XL",
  "data/tweet-economist/2021/6/1404170227424899072.json": "If the ICC’s prosecutor agrees that there is enough evidence of abuses happening in Tajikistan, rather than China, she may then apply to the court’s judges to open an investigation https://t.co/Tf8Sd9IX73",
  "data/tweet-economist/2021/6/1404268625205342208.json": "A town in Brazil has vaccinated nearly everyone against covid-19 https://t.co/Ta2rWuJ7iA",
  "data/tweet-economist/2021/6/1404296250279800835.json": "Chinese officials involved in repressing Uyghurs will not be losing any sleep over the complaint, but the government will be displeased https://t.co/WX4xQQcCS2",
  "data/tweet-economist/2021/6/1404277830725345281.json": "A recent decision by officials to close a tiny museum in Hong Kong dedicated to Tiananmen Square suggests the Communist Party's leadership of museums may be spreading into new territory https://t.co/GUirUvdclX",
  "data/tweet-economist/2021/6/1404309275258900481.json": "To stay on track for net zero, the 2020s must be the decade of ramping up established clean technologies with massive capital spending https://t.co/I4hfNxwIl7",
  "data/tweet-economist/2021/6/1404304992400461826.json": "UBS, a bank, thinks supersonic travel has a future. It puts the cumulative size of the market at between $80bn and $280bn by 2040    https://t.co/92bZX6OVEC",
  "data/tweet-economist/2021/6/1404325883255705605.json": "The growth of tech ﬁrms and intangible assets has fuelled a rise in tax avoidance, to the point where 40% of multinationals’ overseas proﬁts are shifted to havens https://t.co/ETA0Yvec3s",
  "data/tweet-economist/2021/6/1404300289197412356.json": "China is challenging the relatively open way in which the Asia-Pacific region has long operated. Leaders in Beijing accuse America, Australia, India and Japan of forming an anti-China bloc https://t.co/y4KHvojZLC",
  "data/tweet-economist/2021/6/1404291990808899585.json": "It is memes, not McDonald’s, that are the main vehicle for America’s cultural influence https://t.co/cfY3l0CYXz",
  "data/tweet-economist/2021/6/1404037090711642114.json": "Any deal emerging from the global talks would be far from perfect—but it promises to reveal a route to a more rational, equitable tax system https://t.co/T99uLDP6tt",
  "data/tweet-economist/2021/6/1403978972921274372.json": "\"We don’t want to get into debt when there are no customers,\" says a potter in Safi. The government offers cheap loans, but a lack of tourists is the main problem  https://t.co/1v52xwB9j5",
  "data/tweet-economist/2021/6/1404263449987891200.json": "A firm founded by Bill Gates bets on a novel nuclear reactor https://t.co/XAQJEQDs4g",
  "data/tweet-economist/2021/6/1404378807231041545.json": "The total hours worked during the pandemic were 30% higher than before covid-19. \n\nThe real source of inefficiency was time spent in meetings. The answer to this problem is simple; don't call as many meetings, and keep them short. \n\nRead more ⬇️",
  "data/tweet-economist/2021/6/1404382312188592133.json": "Nearly all adults in a Brazilian town were inoculated as part of a study. Preliminary results showed that symptomatic cases of covid-19 and deaths fell by 80% and 95%, respectively https://t.co/Gx6O7AF6kZ",
  "data/tweet-economist/2021/6/1404287112837484544.json": "Most Iranians have lost faith in the electoral system https://t.co/98q7TQwSBV",
  "data/tweet-economist/2021/6/1404544208778764290.json": "Research throughout the pandemic has found the total hours worked were 30% higher than before the pandemic, including an 18% increase in working outside normal hours       https://t.co/Cdzkgvzjah",
  "data/tweet-economist/2021/6/1404538431976443912.json": "Today the risk of transmitting HIV through the blood supply is negligible, because knowledge of HIV prevention, testing and management has deepened  https://t.co/d3pLM7riJU",
  "data/tweet-economist/2021/6/1404499186167521282.json": "More Americans die from drug overdoses than in car crashes or from guns. Supported by @Mishcon_de_Reya         https://t.co/MlaR2oN41k https://t.co/4BuDf9tla8",
  "data/tweet-economist/2021/6/1404635330221838339.json": "One pollster suggests that India has seen “data suppression at every level, no matter who is in charge” https://t.co/gGUkRqKipn",
  "data/tweet-economist/2021/6/1404614136189837312.json": "Reducing or ending deferral periods may help combat the stigma still associated with HIV and AIDS. It will also increase the amount of blood available for patients in need  https://t.co/xotiLIuFXX",
  "data/tweet-economist/2021/6/1404734804017487876.json": "China’s coal consumption has risen significantly since it joined the Paris climate agreement in 2015  https://t.co/jTy7gh5vUN",
  "data/tweet-economist/2021/6/1404710937328865283.json": "Are some reforestation schemes doing more harm than good?    https://t.co/6l2Df348hZ https://t.co/WvZj8xaxWf",
  "data/tweet-economist/2021/6/1404801131906322435.json": "More than 50% of the European Union's population aged 12 and over has received at least one dose of a covid-19 vaccinehttps://econ.st/35oqTpC",
  "data/tweet-economist/2021/6/1404906561504526347.json": "The total hours worked during the pandemic were 30% higher than before covid-19. \n\nThe real source of inefficiency was time spent in meetings. The answer to this problem is simple; don't call as many meetings, and keep them short. \n\nRead more ⬇️",
  "data/tweet-economist/2021/6/1404861534220820482.json": "India's confirmed death toll stands at 377,000. But evidence continues to accumulate that the government’s numbers represent a disturbingly small fraction of the real figure https://t.co/2RuhfzyMs2",
  "data/tweet-economist/2021/6/1404559292712329217.json": "One out of six Americans in a new poll from The Economist and YouGov said they will not get vaccinated for covid-19. Explore our interactive poll that tracks public opinion       https://t.co/utfkBTky6q https://t.co/hjE39jIW5C",
  "data/tweet-economist/2021/6/1404904323168014338.json": "The rise of political YouTubers and other influencers has resulted in the globalisation of political ideas, many from America https://t.co/tRZOBmdp13",
  "data/tweet-economist/2021/6/1404891493190537219.json": "Joe Biden believes that America and its rich allies must offer poor countries an attractive alternative to Chinese loans and investment https://t.co/KnffWiotd1",
  "data/tweet-economist/2021/6/1404993254509195267.json": "The kimchi wars between South Korea and China are heating up https://t.co/J3Z0MamZEH",
  "data/tweet-economist/2021/6/1405024482587185158.json": "America remains on track to eliminate remaining pandemic unemployment within two years. And in the meantime, the churning of workers into new, different jobs could leave the economy more productive than before https://t.co/FvEBbDqcnx",
  "data/tweet-economist/2021/6/1405042737343340545.json": "The United Arab Emirates are well on their way to herd immunity, having given first doses to 97% of its over 12 population. Find out how our data team is tracking the vaccine roll-out in the Middle East  https://t.co/jDNIPzHlst",
  "data/tweet-economist/2021/6/1404950096534552578.json": "NATO has said that melting ice in the Arctic “could lead to new geopolitical tensions”  https://t.co/NN2WOEFsqf",
  "data/tweet-economist/2021/6/1405117969265577985.json": "To get roughly 70% of the planet’s population inoculated by April, the IMF calculates, would cost just $50bn. The cumulative economic benefit by 2025 would be $9trn  https://t.co/gTIf5tfonY",
  "data/tweet-economist/2021/6/1405299148589502468.json": "The total hours worked during the pandemic were 30% higher than before covid-19. \n\nThe real source of inefficiency was time spent in meetings. The answer to this problem is simple; don't call as many meetings, and keep them short. \n\nRead more ⬇️",
  "data/tweet-economist/2021/6/1405263431016591379.json": "The overall result of Ethiopia's election is not in doubt. For Abiy Ahmed, who has said his mother prophesied that he would one day be king, it is less an election than a coronation  https://t.co/ukACG9ca8z",
  "data/tweet-economist/2021/6/1405313089185189893.json": "The only concrete agreements between Joe Biden and Vladimir Putin were to start a new round of nuclear talks and to return ambassadors to their posts. These are both small but solid wins  https://t.co/0yyTVhgD4O",
  "data/tweet-economist/2021/6/1405364105599389699.json": "Many workers like working from home because they can save time and money by not having to commute https://t.co/iaAMr8Mqpg",
  "data/tweet-economist/2021/6/1405337747204739075.json": "Ecosystems around the world are in crisis. Can technology help restore them? https://t.co/4xJ7y9OTmW",
  "data/tweet-economist/2021/6/1405354234443407366.json": "Where does your city rank on the Economist Intelligence Unit’s Global Liveability Index for 2021? https://t.co/zfen5ngNch https://t.co/u6haPGQtiG",
  "data/tweet-economist/2021/6/1405393048041889797.json": "The delta variant seems to be the most prevalent SARS-CoV-2 strain in places including Canada, Indonesia, Pakistan, Portugal and Russia  https://t.co/91m5aOYTAN",
  "data/tweet-economist/2021/6/1405019673234640897.json": "According to official figures from the Bureau of Labour Statistics, the prices of used cars and trucks have risen 30% over the past year. Many in the automotive industry think that is an underestimate  https://t.co/c6b0ICfL4L",
  "data/tweet-economist/2021/6/1405435199123513353.json": "Cape Town is one of the most beautiful cities in the world. It’s also one of the most dangerous https://t.co/TJSGkVFoOH https://t.co/FCph5guqvh",
  "data/tweet-economist/2021/6/1405269967784742912.json": "In 1975 the G7 countries produced 70% of global GDP; their share has since shrunk to some 40% https://t.co/EtUWOemzxG",
  "data/tweet-economist/2021/6/1405458340692611076.json": "Today the risk of transmitting HIV through the blood supply is negligible, because knowledge of HIV prevention, testing and management has deepened  https://t.co/wt3r7AHUkv",
  "data/tweet-economist/2021/6/1405378859718135809.json": "History shows that the richer people get, the more meat they crave https://t.co/mh5I8cyGhD",
  "data/tweet-economist/2021/6/1405548001314185219.json": "Cyber-attacks threaten the health of an increasingly digital global economy. To stop the ransomware pandemic, start with the basics. Our cover this week https://t.co/GXLc9y1ZB1 https://t.co/XHCqtcHDcW",
  "data/tweet-economist/2021/6/1405280542291947521.json": "For a short while, under Prime Minister Abiy Ahmed, it looked as if Ethiopia might become one of the most democratic countries in Africa. Not anymore https://t.co/PzbX79whI1",
  "data/tweet-economist/2021/6/1405635980502179841.json": "This week’s cartoon from KAL:  https://t.co/QdFWx51s1G https://t.co/kdowyZxDzB",
  "data/tweet-economist/2021/6/1405705607324311556.json": "The delta variant seems to be more transmissible and lead to more severe disease  https://t.co/FmNsw6ABuE",
  "data/tweet-economist/2021/6/1405743395746697219.json": "The only concrete agreements between Joe Biden and Vladimir Putin were to start a new round of nuclear talks and to return ambassadors to their posts. These are both small but solid wins https://t.co/42yxd9u0hH",
  "data/tweet-economist/2021/6/1405729489116663808.json": "Crypto-miners are probably to blame for the graphics-chip shortage https://t.co/IVLHFlO49i",
  "data/tweet-economist/2021/6/1405765813018103810.json": "Why some people are moving from the United States to Mexico https://t.co/6lXAzxEmF3",
  "data/tweet-economist/2021/6/1405876303652327426.json": "Britain's battle to defeat the covid-19 Delta variant has been lost. The aim now is to stop cases spiralling https://t.co/BZ9lAhhUKR",
  "data/tweet-economist/2021/6/1406003293088845828.json": "The clichéd view of Mexico is that it is poor and crime-ridden. The reality has long been more nuanced, as increasing numbers of Americans are realising\nhttps://t.co/jNqeEpI47z",
  "data/tweet-economist/2021/6/1406052314004209665.json": "The rediscovery of Coelacanths was hailed as the most important zoological discovery of the century. They are elusive fish belonging to group that has lived for more than 400m years     https://t.co/O0Ayx014TO",
  "data/tweet-economist/2021/6/1406032307002253314.json": "South Korean women suffer misogyny and harassment. But many young men think they are the ones who face discrimination https://t.co/8DimZKb2fp",
  "data/tweet-economist/2021/6/1406069236292800517.json": "Around 2m people have died from covid-19 in India so far, making this the worst calamity to hit the country since the Bengal famine of 1943 https://t.co/E4MWz0aMso",
  "data/tweet-economist/2021/6/1406104735694921728.json": "Biryani was supposedly invented during the 17th century, when India was part of the Mughal empire. From @1843mag\nhttps://t.co/aKnqs1KXoA",
  "data/tweet-economist/2021/6/1405875954308821002.json": "The meeting between Joe Biden and Vladimir Putin was not a summit between two superpowers holding the fate of the world in their hands, or an attempt to reset the relationship. It was something murkier https://t.co/jTaOSzhawZ",
  "data/tweet-economist/2021/6/1405933392613498886.json": "Our ecosystems are reaching crisis point. Technology has a growing role to play in monitoring, modelling and protecting them. Read our latest Technology Quarterly by our environment editor, Catherine Brahic, on protecting biodiversity https://t.co/clsU4m7Kuk https://t.co/4pWJBuPkBD",
  "data/tweet-economist/2021/6/1406177701426307079.json": "At least 20 African countries now have space programmes https://t.co/rrMN53gy7U",
  "data/tweet-economist/2021/6/1406114785633128449.json": "The effects of climate change, potential or actual, on Germany’s waterways, forests and farms have become harder to ignore. Germany’s political parties are reacting accordingly https://t.co/jpTdhoCKjf",
  "data/tweet-economist/2021/6/1405987687086051331.json": "Techniques are being developed that might, theoretically, make it possible to create a live newborn rhino long after the last members of its species have died\nhttps://t.co/UEpKg0Ex9l",
  "data/tweet-economist/2021/6/1406176932807516160.json": "“I feel like I am trapped in a cage”, says one migrant worker in Singapore. He needs special permission to leave his dormitory for any reason other than work https://t.co/0WM7NN7sEX",
  "data/tweet-economist/2021/6/1406208645352890368.json": "Hybrid working is soon to become the norm for societies across the world. Here are some suggestions for the best days to come into the office https://t.co/3jr88Xldso",
  "data/tweet-economist/2021/6/1406242623052996617.json": "Women suffer ACL injuries as much as eight times more than men. Research suggests this is connected to the menstrual cycle https://t.co/QubcF8itcM",
  "data/tweet-economist/2021/6/1406259501859225603.json": "Latin America’s schools have stayed shut for longer than those in any other global region. The effects will be felt long after the pandemic is over and economies have recovered\nhttps://t.co/EZSMSBsFCD",
  "data/tweet-economist/2021/6/1406272832972148736.json": "A four-year survey of 113 female England footballers found a clear correlation between women in the pre-ovulatory stage of menstruation and ACL tears  https://t.co/uyC34hpDZY",
  "data/tweet-economist/2021/6/1406235315082129414.json": "There’s mounting suspicion that covid-19 could have leaked from a Chinese lab. \n\nIs there any evidence?\n\nClick to watch our experts @natashaloder and @Eaterofsun explain ⬇️",
  "data/tweet-economist/2021/6/1406127365885997058.json": "Prices for all types of chips have risen of late, for myriad reasons https://t.co/CkNNHvjLxv",
  "data/tweet-economist/2021/6/1406303030765625349.json": "Single-sport specialisation in schools may explain why more young people than ever before are sustaining ACL injuries https://t.co/iDBuip6CAp",
  "data/tweet-economist/2021/6/1406349337521799170.json": "The United States has warned that any arms delivery from Iran to Venezuela would be a “provocative act and a threat to our partners in this hemisphere”, meriting “appropriate measures”\nhttps://t.co/vVnw0KjfL4",
  "data/tweet-economist/2021/6/1406348362199224323.json": "Studies suggest three-quarters of those who suffer an ACL tear go on to develop arthritis of the knee 15-20 years later https://t.co/MnTGK7WgDH",
  "data/tweet-economist/2021/6/1406402640456699908.json": "The fact that the summit between Joe Biden and Vladimir Putin produced a sigh of relief was a measure of how difficult relations have become since 2014 https://t.co/7hIE4LxaRA",
  "data/tweet-economist/2021/6/1406380536428384256.json": "Cryopreservation could one day restore commercially valuable populations, such as threatened fisheries—but only if cells are banked now for an unknown future\nhttps://t.co/puTN5c1xJB",
  "data/tweet-economist/2021/6/1406113243358281733.json": "In a survey conducted in 2019, more than two-thirds of young South Korean men said that unfairness towards men, not women, was the big problem https://t.co/vvO1CkSQkf",
  "data/tweet-economist/2021/6/1406429202098892800.json": "California’s budget, dubbed the “California Comeback Plan”, will devote billions to public education, housing, transport, health care for undocumented immigrants, fighting homelessness and climate change, and more  https://t.co/eisTyHkUoh",
  "data/tweet-economist/2021/6/1406433053904412676.json": "Journalists in Hong Kong wonder how long it will remain possible to publish anything that is highly critical of the Communist Party https://t.co/9IuboGQZCH",
  "data/tweet-economist/2021/6/1406382043324469250.json": "“The health of ecosystems on which we and all other species depend is deteriorating more rapidly than ever,” says Sir Robert Watson of @IPBES\nhttps://t.co/YrEpUVWEwj",
  "data/tweet-economist/2021/6/1406363416713912333.json": "Among adults in America who think racism is a problem, 57% believe it is a sign of broader problems that exist in the country’s organisational, societal and legal structures, according to new data from The Economist and YouGov  https://t.co/cPlM8jOVph",
  "data/tweet-economist/2021/6/1406455118447398913.json": "India's economy has stalled instead of restarting. But its richest people are getting ostentatiously richer https://t.co/AuXY0N94qi",
  "data/tweet-economist/2021/6/1406441953185697794.json": "America and members of the G7 have announced plans to help ﬁnance infrastructure in poor countries. Dubbed Build Back Better World, the scheme is an explicit counter to China’s Belt and Road Initiative https://t.co/X6lCJc10SO",
  "data/tweet-economist/2021/6/1406498424283975682.json": "One study of Mumbai between June and July last year found 54% of the people living in slums had covid-19 antibodies, compared with 16% of those in formal settlements https://t.co/GW5DmX9MMJ",
  "data/tweet-economist/2021/6/1406466317348130817.json": "Exuberance over the Keystone XL victory may prove fleeting. Alberta’s government, which has ploughed over $1bn into the pipeline, has indicated that it will try to invoke the North American free-trade agreement to revive it  https://t.co/d2GybgpXSJ",
  "data/tweet-economist/2021/6/1406522575824510980.json": "How could quantum computing change the world? https://t.co/zHEZQDuq6p https://t.co/dhhh1xiE2X",
  "data/tweet-economist/2021/6/1406447076809060356.json": "Donald Trump’s leadership did not merely undercut America’s strengths. It also exacerbated its weaknesses, according to a new book https://t.co/YxMu4HVSuN",
  "data/tweet-economist/2021/6/1406403565082529792.json": "RT @stevenmazie: My weekend profile of the person most likely to become America’s 116th justice https://t.co/KapOfLdLMM",
  "data/tweet-economist/2021/6/1406541595747495941.json": "At least 2m people tear their anterior cruciate ligament every year and re-tear rates are as high as 20% https://t.co/L35sna89iG",
  "data/tweet-economist/2021/6/1406514691871064065.json": "Research points to a link between the stages of a woman’s menstrual cycle and ACL tears. Using apps that monitor cycles is one way to reduce risk of injury https://t.co/8kwslamHf5",
  "data/tweet-economist/2021/6/1406617851117584392.json": "The official death toll from covid-19 in Brazil passed 500,000, the highest total in the world after America’s. In May, we wrote that the virus exploits Brazil’s weaknesses https://t.co/5hpajnldHQ",
  "data/tweet-economist/2021/6/1406585885219565569.json": "Whereas Joe Biden sees Russia as a distraction, Vladimir Putin sees America and its values as an existential threat https://t.co/YYRgdQf7jC",
  "data/tweet-economist/2021/6/1406600753549021184.json": "African governments say their investments in space programmes help to build local skills that can attract investment and spill over into other areas of the economy https://t.co/vxG95Y3opv",
  "data/tweet-economist/2021/6/1406365956109225990.json": "The US State Department reckons 1.5m Americans live south of the border, making them the largest group of immigrants in Mexico and the largest group of Americans outside the US\nhttps://t.co/3j9DAJNFgS",
  "data/tweet-economist/2021/6/1406658611837816834.json": "That inoculation still works so well against the delta variant highlights the urgency of administering jabs, particularly in poor countries  https://t.co/FtsugxmLkl",
  "data/tweet-economist/2021/6/1406634318638862346.json": "One pollster suggests that India has seen “data suppression at every level, no matter who is in charge” https://t.co/wYgPimOdyn",
  "data/tweet-economist/2021/6/1406668936092045319.json": "Mexico has a history of accepting immigrants. During the Spanish civil war in the 1930s many refugees fled across the Atlantic. Its laws are welcoming\nhttps://t.co/lTWXQIBlfE",
  "data/tweet-economist/2021/6/1406674725187768325.json": "Studies suggest three-quarters of those who suffer an ACL tear go on to develop arthritis of the knee 15-20 years later https://t.co/kkvmYcNkJB",
  "data/tweet-economist/2021/6/1406643026596962304.json": "Many workers like working from home because they can save time and money by not having to commute https://t.co/FI39knCvGC",
  "data/tweet-economist/2021/6/1406689077316001799.json": "The delta variant seems to be more transmissible and lead to more severe disease  https://t.co/WpQM5k94DQ",
  "data/tweet-economist/2021/6/1406694104642301952.json": "Nearly all adults in a Brazilian town were inoculated as part of a study. Preliminary results showed that symptomatic cases of covid-19 and deaths fell by 80% and 95%, respectively https://t.co/cSW55KVuJf",
  "data/tweet-economist/2021/6/1406708453511512080.json": "Many Brazilians took to the streets on Saturday to protest against Jair Bolsonaro’s handling of the pandemic. The official death toll there has passed 500,000. What went wrong? From May https://t.co/H4dy179QfS",
  "data/tweet-economist/2021/6/1406705175604117504.json": "Women suffer ACL injuries as much as eight times more than men. Research suggests this is connected to the menstrual cycle https://t.co/QNE6io7IrS",
  "data/tweet-economist/2021/6/1406712728979488768.json": "With schools closed for 13 months, the World Bank reckons that some 77% of students would be below the minimum performance for their age, up from 55% in 2018\nhttps://t.co/WvuSpAOfgJ",
  "data/tweet-economist/2021/6/1406673736821096451.json": "Britain's battle to defeat the covid-19 Delta variant has been lost. The aim now is to stop cases spiralling https://t.co/Nl49UXnyc6",
  "data/tweet-economist/2021/6/1406679504056160256.json": "Iran’s new hardliner president is hostile to Western influence and thinks personal freedoms should extend only as far as Islamic law allows https://t.co/z2J9IZQK5t",
  "data/tweet-economist/2021/6/1406727083045404679.json": "Since the expiration of a UN arms embargo in October, Iran has been free to sell weapons to anyone it fancies. Venezuela is a happy customer\nhttps://t.co/Js12sMf3ef",
  "data/tweet-economist/2021/6/1406760844185288706.json": "The Senate plays a role in undermining effective governance by taking its time. It is yet to confirm Joe Biden's candidates for assistant secretary of state https://t.co/fuBPI5Vb3P",
  "data/tweet-economist/2021/6/1406777978441416705.json": "China’s central government is reportedly preparing to set up a department in Hong Kong to run “propaganda” https://t.co/m52363vOGd",
  "data/tweet-economist/2021/6/1406811804823605250.json": "Single-sport specialisation in schools may explain why more young people than ever before are sustaining ACL injuries https://t.co/R2HHdBEBDk",
  "data/tweet-economist/2021/6/1406844784573091841.json": "Women suffer ACL injuries as much as eight times more than men. Research suggests this is connected to the menstrual cycle https://t.co/TqErhEaA6H",
  "data/tweet-economist/2021/6/1406764757739257856.json": "The only concrete agreements between Joe Biden and Vladimir Putin were to start a new round of nuclear talks and to return ambassadors to their posts. These are both small but solid wins https://t.co/RXvgVGp01Y",
  "data/tweet-economist/2021/6/1406613068935843843.json": "No one has quite known what to do with the “Frankenstien” pyramid in Tirana. Until now https://t.co/FEDUwZBqBE",
  "data/tweet-economist/2021/6/1407032918585843718.json": "Workers in America are quitting jobs at rates not seen this century https://t.co/935KeUFT00",
  "data/tweet-economist/2021/6/1407020488560300034.json": "The past decade has seen a big surge of foreign interest in Africa—involving China, India and Russia. If the continent handles this new \"scramble\" wisely, the main winners will be Africans themselves https://t.co/zYIrKOkPot",
  "data/tweet-economist/2021/6/1406930658795134980.json": "The delta variant seems to be more transmissible and lead to more severe disease  https://t.co/1Md00Pd2Rp",
  "data/tweet-economist/2021/6/1406917475640434689.json": "Classes in balance and agility have been found to reduce ACL tears by 50%. Strengthening the muscles around the knee helps too https://t.co/ffXKQB9p8C",
  "data/tweet-economist/2021/6/1406885361784139776.json": "Britain's battle to defeat the covid-19 Delta variant has been lost. The aim now is to stop cases spiralling https://t.co/5nwAlLQxCz",
  "data/tweet-economist/2021/6/1406874541561888770.json": "Having failed his country in the 27 years he ruled it, Kenneth Kaunda at last served Zambia well, by leaving office gracefully https://t.co/YNXWWz50dS",
  "data/tweet-economist/2021/6/1406862201760198657.json": "By the end of this year 150m more people will be living in extreme poverty, many of them in cities  https://t.co/1CjLWDbB3w",
  "data/tweet-economist/2021/6/1406970428795625481.json": "Poor countries may now face a dilemma of being forced to choose between America and the G7’s Build Back Better World plan, and China’s Belt and Road Initiative https://t.co/P7IRGYmUoS",
  "data/tweet-economist/2021/6/1406797212550639626.json": "Foreign workers living in cramped dormitories account for nearly 90% of all the people who have tested positive for covid-19 in Singapore https://t.co/k9fxLAoK9V",
  "data/tweet-economist/2021/6/1407145866247524353.json": "Almost 100,000 of the Jagger library’s roughly 130,000 books were destroyed (the count is ongoing) https://t.co/6ERz53vEcM",
  "data/tweet-economist/2021/6/1407350638871302152.json": "Africa is blasting its way into the space race https://t.co/8uSs3vA5sP",
  "data/tweet-economist/2021/6/1407255981587841024.json": "Populations of mammals, birds, amphibians, reptiles and fish shrank by 68% on average between 1970 and 2016. And research shows the decline is accelerating \nhttps://t.co/SpLxtvQd2x",
  "data/tweet-economist/2021/6/1407233297793654784.json": "A panel finds that London’s police are “institutionally corrupt” https://t.co/sDEmMwIMSc",
  "data/tweet-economist/2021/6/1407106077070659588.json": "“It's probably the most pressing humanitarian crisis in the world.” And yet, @TomGardner18 tells “The Intelligence”, Ethiopians are being asked to vote https://t.co/8gNmVa350U",
  "data/tweet-economist/2021/6/1407468235662970881.json": "Many workers like working from home because they can save time and money by not having to commute https://t.co/Boz8SBJsaT",
  "data/tweet-economist/2021/6/1407179200663015425.json": "Young men in South Korea feel victimised by feminism https://t.co/kP38c6EhiP",
  "data/tweet-economist/2021/6/1407526874767581188.json": "Laurel Hubbard, a weightlifter and trans woman, was selected for New Zealand’s Olympic team. Last year, we looked at what the IOC could learn from World Rugby’s approach to trans women and women’s sports  https://t.co/5frU2ZfI82",
  "data/tweet-economist/2021/6/1407553110290178050.json": "“You must collect things for reasons you don’t yet understand,” said Kurt Benirschke, who founded the San Diego Wildlife Biodiversity Bank\nhttps://t.co/hVUUApCXD3",
  "data/tweet-economist/2021/6/1407534154384826369.json": "They are ravaging crops, infesting houses and even biting people in their beds. We explain why Australia is overrun with mice https://t.co/uqcBA7I4MT",
  "data/tweet-economist/2021/6/1407543696183238657.json": "“Working too many hours at home is easily solved: don't call as many meetings and make them shorter.” A pandemic-era productivity puzzle, on “The Intelligence” https://t.co/QBaN0MJ75h",
  "data/tweet-economist/2021/6/1407558003814027264.json": "Young men in South Korea feel victimised by feminism https://t.co/GuB7pD3des",
  "data/tweet-economist/2021/6/1407136784199323652.json": "Resignation rates were especially high in retail and hospitality. Now competition for workers has grown fierce, prompting some restaurant chains to raise wages https://t.co/3DdTGeKlor",
  "data/tweet-economist/2021/6/1407572496350580737.json": "Cryopreservation can hold species in suspended animation while new technologies are invented or existing ones improved\nhttps://t.co/2Ln5uusOL4",
  "data/tweet-economist/2021/6/1407463345330982914.json": "At about 54, the average age of retirement in China is among the lowest in the world. That is a problem  https://t.co/GM7CX2hZ0X",
  "data/tweet-economist/2021/6/1407658039755300864.json": "Anthony Fauci has warned that the delta variant is now responsible for 20% of America's new covid-19 cases. The main reason people worry about the mutation is transmissibility https://t.co/WUIkoH8aNL",
  "data/tweet-economist/2021/6/1407663205468438528.json": "Apple Daily, Hong Kong’s last pro-democracy tabloid, confirmed it is to publish its last issue tomorrow. The newspaper, owned by Jimmy Lai, has had its assets frozen and executives arrested under China's swingeing national-security law \nhttps://t.co/4Zy85tiPKa",
  "data/tweet-economist/2021/6/1407677317099311106.json": "Anthony Fauci has warned that the delta variant is now responsible for 20% of America’s new covid-19 cases. \n\nThe main reason people worry about the mutation is transmissibility. See how it compares to other variants ⬇️",
  "data/tweet-economist/2021/6/1407692598811238405.json": "Satoshi Nakamoto is the mysterious inventor behind bitcoin. Nobody knows if he or she is a real person, or even if they are alive. But if Nakamoto exists, they are thought to own more than 1m bitcoin, worth more than $30bn https://t.co/lENBVIvnF3 https://t.co/LneJo3oUm1",
  "data/tweet-economist/2021/6/1407723234183811074.json": "Confucian ideas fell out of favour in China during the 20th century. But they are enjoying a resurgence under Xi Jinping  https://t.co/Pd3Gv4ZM51",
  "data/tweet-economist/2021/6/1407713394644377604.json": "Whatever the size of a film’s budget, a smartphone may sometimes be the smart choice https://t.co/DqDP4gqwd7",
  "data/tweet-economist/2021/6/1407754081993699332.json": "Journalists in Hong Kong wonder how long it will remain possible to publish anything that is highly critical of the party. Apple Daily, Hong Kong’s last pro-democracy tabloid, confirmed it is to publish its last issue tomorrow\nhttps://t.co/6sKmAVEdYz",
  "data/tweet-economist/2021/6/1407778743456763911.json": "The delta variant could become America's dominant covid-19 strain by mid-July. As well as being more transmissible, the delta variant seems to lead to more severe disease https://t.co/Kk57GmoadY",
  "data/tweet-economist/2021/6/1407771234595639300.json": "Some have raised concerns about how effective Sinovac is against the delta variant. In April we wrote about how China's vaccine compares to its competitors https://t.co/jsr5iXMnft",
  "data/tweet-economist/2021/6/1407661989309124610.json": "The #FreeBritney movement centres on Britney Spears’s conservatorship, which the singer will speak about in court today. In March we explained the legal arrangement that affects some 1.3m Americans  https://t.co/PgeOJtwrGg",
  "data/tweet-economist/2021/6/1407826484501307392.json": "A second jab appears to be particularly protective against the delta variant, a study using Pfizer-BioNTech or AstraZeneca vaccines suggests https://t.co/7mjKQMPWCE",
  "data/tweet-economist/2021/6/1407830856509661188.json": "The last time Russia fired on a British warship was in 1917, when a Bolshevik submarine torpedoed a destroyer in the Gulf of Finland  https://t.co/egwt5TMDFO",
  "data/tweet-economist/2021/6/1407841659178696706.json": "After Mao Zedong’s death in 1976 the Communist Party began to make slow peace with Confucius partly to move on from the doctrinal era   https://t.co/zlb1dMhpom",
  "data/tweet-economist/2021/6/1407901837324439560.json": "Britain vaccinated 10% of its population with a first dose by January 25th. America reached that milestone by February 10th. The EU took until March 24th  https://t.co/jxXvxipbst",
  "data/tweet-economist/2021/6/1407829346157465600.json": "Hong Kong's first trial heard under China's national-security law has begun, without a jury. Tong Ying-kit pleaded not guilty to inciting secession. He is accused of flying a protest banner and riding his motorbike into police at a protest on July 1st 2020\nhttps://t.co/KSN965ol4y",
  "data/tweet-economist/2021/6/1407916542726131712.json": "The precise sequence of events is contested  https://t.co/5sgdHyYpwQ",
  "data/tweet-economist/2021/6/1407922781162033152.json": "In April we wrote that phase-three trials of Sinovac yielded an efficacy rate barely above the 50% threshold set by the WHO for covid-19 vaccines, but were good protection against severe disease and death https://t.co/DkNr6mlNKU",
  "data/tweet-economist/2021/6/1407963201128501248.json": "The last time Russia fired on a British warship was in 1919, not 1917 as an earlier tweet suggested, when a Bolshevik submarine torpedoed a destroyer in the Gulf of Finland\nhttps://t.co/LwrqBzggDF",
  "data/tweet-economist/2021/6/1408004738789036041.json": "Britney Spears spoke out in court against her conservatorship, which means she has little say over her finances, visitors and even medical decisions. In March, we explained the peculiar legal arrangement https://t.co/CFRgXTx0Yu",
  "data/tweet-economist/2021/6/1408014766572986372.json": "Russia said it “halted the violation” with warning fire and, 11 minutes later, with 250kg bombs dropped from Su-24 bombers  https://t.co/dlCtt67KYp",
  "data/tweet-economist/2021/6/1407979593735278593.json": "The Chinese Communist Party is about to turn 100. The world's most powerful political party is projecting ever greater confidence, while fortifying itself against collapse https://t.co/j7QChirC4D",
  "data/tweet-economist/2021/6/1408009702831710211.json": "Unlike Marxism, Confucianism is a homegrown philosophy. The two-millennia-old tradition confers legitimacy upon the party’s ideology  https://t.co/Tgyepc6MKK",
  "data/tweet-economist/2021/6/1407990187209146369.json": "Knowledge of another language can open up a whole new world of art, history, literature and food. But which is the best to learn? https://t.co/oXSr4imS73 From the @1843mag archive",
  "data/tweet-economist/2021/6/1408027460168527880.json": "The EU is making up for lost time. Its vaccination programme has accelerated and it is now jabbing people at roughly double the rate of America  https://t.co/034zxDId8V",
  "data/tweet-economist/2021/6/1408034301602566146.json": "Ruthlessness, ideological agility and shared economic growth have kept China’s Communist Party in power. But can the world’s most successful autocracy last? Our cover this week https://t.co/1He7iSewlZ https://t.co/z2ZqJsigfP",
  "data/tweet-economist/2021/6/1408059348081774606.json": "The #FreeBritney movement centres on Britney Spears’s conservatorship, which the singer described yesterday in court as “abusive”. Similar legal arrangements affect some 1.3m Americans. From March https://t.co/pFgyXzAIIs",
  "data/tweet-economist/2021/6/1408070706940682251.json": "Coca-Cola was invented by a former Confederate colonel to soothe the pain of defeat in the American civil war. Now it finds itself caught up in a new conflict about race and democracy https://t.co/O1TgzG1h08",
  "data/tweet-economist/2021/6/1408017335592554500.json": "In July 1921, the Chinese Communist Party was formally launched. A century later, it, not Russia, is the world’s pre­-eminent flagbearer for communism https://t.co/RvrDjdjydn",
  "data/tweet-economist/2021/6/1408101136691699712.json": "The African continent is where humanity grew up—and where the bulk of human genetic diversity is found to this day https://t.co/n66KidTemA",
  "data/tweet-economist/2021/6/1407911468859863045.json": "The Confucian virtues of a harmonious society and respect for authority suit today’s Communist Party very well  https://t.co/eXBKctezWT",
  "data/tweet-economist/2021/6/1407999930833289218.json": "In April we wrote that phase-three trials of Sinovac yielded an efficacy rate barely above the 50% threshold set by the WHO for covid-19 vaccines, but very good protection against severe disease and death https://t.co/k1plWxugtT",
  "data/tweet-economist/2021/6/1407708714451312642.json": "Britney Spears has little say over her finances, visitors and even medical decisions. Today, the singer will give testimony about her conservatorship in a court hearing in Los Angeles https://t.co/iZ52uzXbTe",
  "data/tweet-economist/2021/6/1408146430632644611.json": "Everyone’s ancestors lived in Africa, where Homo sapiens originated. Only now is a serious effort being made to explore the continent's genetic richness  https://t.co/Nx6Pq8LQq5",
  "data/tweet-economist/2021/6/1408197016816132101.json": "There are often clear signs that a country is sliding into conflict or crisis  https://t.co/HIQvAGGmsU",
  "data/tweet-economist/2021/6/1408208990983569412.json": "In all countries, school closures will widen the gap between better-off pupils and worse-off ones https://t.co/f5JCzBwgMv",
  "data/tweet-economist/2021/6/1408136859084075011.json": "Too few governments are doing even a bare minimum to help. Only 2% of the money ploughed into covid-19 relief packages last year went to education https://t.co/cBkn4OmXRl",
  "data/tweet-economist/2021/6/1408259094738345989.json": "Closing the world’s schools caused children great harm https://t.co/WSs81fXu7v",
  "data/tweet-economist/2021/6/1408254216171294720.json": "A new report that assesses the stability of 163 countries finds that six of the nine global regions became more troubled in the past year  https://t.co/9sv2yKwIyn",
  "data/tweet-economist/2021/6/1408135366423494662.json": "Wherever he travelled Kenneth Kaunda took with him a very large white handkerchief. Sometimes he used it to wipe away the sweat of exhorting his people but, more often, it dabbed away tears \nhttps://t.co/XLrPutvs3Q",
  "data/tweet-economist/2021/6/1408309037284970499.json": "Xi Jinping calls Confucianism “the cultural soil that nourishes the Chinese people”  https://t.co/iWPNcb9Bvz",
  "data/tweet-economist/2021/6/1408228729722114050.json": "America once showed little concern about China’s power. Now it is openly worried. Not only is China an authoritarian state, but it is also a communist one wedded to an anti­-Western ideology https://t.co/obPXpdZkN0",
  "data/tweet-economist/2021/6/1408083423961436162.json": "The Chinese Communist Party has been able to maintain its grip on power for three reasons https://t.co/vxEGRMkANR",
  "data/tweet-economist/2021/6/1408334709986312192.json": "The increase in atmospheric carbon is the biggest contributor to climate change          https://t.co/mxqoCDxW5A https://t.co/CDGKJ2wiHi",
  "data/tweet-economist/2021/6/1408079556083392512.json": "The Chinese Communist Party is one of the world’s hardest ruling parties to join. And to keep out closet liberals and other undesirables, Xi Jinping is making it even more so\nhttps://t.co/VplxqIYDW6",
  "data/tweet-economist/2021/6/1408391030177665028.json": "The habits of the economics profession today can only be understood by examining the field’s own history https://t.co/6B1JVDxIlR",
  "data/tweet-economist/2021/6/1408324644818587649.json": "Xi Jinping has extended a system of control called “grid management” across China so that neighbourhood party com­mittees can keep watch on other residents https://t.co/QOJlkOigp5",
  "data/tweet-economist/2021/6/1408491204485001219.json": "Two new research papers add further pieces to the jigsaw puzzle that is human evolution  https://t.co/AV29POstPC",
  "data/tweet-economist/2021/6/1408503784595206145.json": "France carried out 17 nuclear tests in Algeria in the 1960s. Activists want France to clean up contaminated sites and compensate those affected by the tests https://t.co/FYOdZpbwd6",
  "data/tweet-economist/2021/6/1408329399330557952.json": "Whatever happened between Russia and Britain in the Black Sea, it was out of the ordinary  https://t.co/fN8q57oEl6",
  "data/tweet-economist/2021/6/1408542541671276546.json": "Combining her story with a feminist history of illness, Elinor Cleghorn shows how centuries of ignorance and condescension led to enduring failings\nhttps://t.co/71otGXO42B",
  "data/tweet-economist/2021/6/1408580812275060739.json": "Homo longi—“Dragon man” as translated into English from Chinese, via Latin—is not a novel find, but rather a reinterpretation of an existing one \n https://t.co/frzvmDze1W",
  "data/tweet-economist/2021/6/1408519627957747716.json": "The year is 2029. A group of biohacktivists are causing controversy by using mRNA to tinker with their own biology. A health scenario for a post-covid world https://t.co/RB8TIXvtO7",
  "data/tweet-economist/2021/6/1408624578490998785.json": "Joe Biden is only the second Catholic president, after John Kennedy  https://t.co/jEPnbFCaah",
  "data/tweet-economist/2021/6/1408613766128828424.json": "It is June 2041. People are dying from heat exposure in the streets of Chennai; its hospitals are full. In a dystopian scenario, we depict what happens if policymakers ignore the threat posed by extreme heat https://t.co/QVhMN6Khof",
  "data/tweet-economist/2021/6/1408640268434280451.json": "Research has shown that seaweed restores underwater habitats, filters contaminants and helps to counteract ocean acidification, making it an appealing way to help mitigate the effects of climate change  https://t.co/qG5nvChA8t",
  "data/tweet-economist/2021/6/1408644193619222528.json": "Apple Daily printed 1m copies of its final edition, nearly 13 times more than usual https://t.co/hVto0oN0S9",
  "data/tweet-economist/2021/6/1408500499633090561.json": "“And the award goes to artificial intelligence.” We look at a scenario where a machine beats the humans to win the Nobel prize https://t.co/k8Bdj2K07t",
  "data/tweet-economist/2021/6/1408618289098543104.json": "China’s Communist Party is particularly watchful of universities. Xi Jinping has institutionalised a network of informants who monitor fellow students in their dormi­tories https://t.co/m98oZunlub",
  "data/tweet-economist/2021/6/1408674410442133510.json": "A four-year survey of 113 female England footballers found a clear correlation between women in the pre-ovulatory stage of menstruation and ACL tears  https://t.co/gqNBV5CFiz",
  "data/tweet-economist/2021/6/1408649982215925762.json": "Prosecutors have asked the International Criminal Court for permission to investigate President Rodrigo Duterte for committing crimes against humanity https://t.co/AumP7TyBAb",
  "data/tweet-economist/2021/6/1408603682850193413.json": "Almost all requests to marry Indonesian girls in religious courts are granted, often without the knowledge or approval of the child involved https://t.co/68cJqEByHr",
  "data/tweet-economist/2021/6/1408686975553617920.json": "Xi Jinping shows no sign of picking a successor. That risks throwing Chinese politics into turmoil https://t.co/xKKzfThmZ7",
  "data/tweet-economist/2021/6/1408700821806649345.json": "Less than 2% of all sequenced genomes are African. This bias leads to under-diagnosis of diseases in people of African descent https://t.co/KHpit5m6If",
  "data/tweet-economist/2021/6/1408666865459675136.json": "What Japanese conservatives view as a history of expansion and modernisation, the Ainu view as colonialism https://t.co/FQ1EJ9qQ7O",
  "data/tweet-economist/2021/6/1408720452437090310.json": "The Three Million African Genomes project will cast light on how Homo sapiens evolved, as well as being medically useful https://t.co/AjP9bgodi5",
  "data/tweet-economist/2021/6/1408770021720039424.json": "The Indonesian government wants to cut the rate of child marriage by 40% within a decade. Changing people’s attitudes will be the hardest task https://t.co/8s4VJT1lQL",
  "data/tweet-economist/2021/6/1408802264580608006.json": "For decades the tide has strongly favoured owners of capital. But labour shortages have left workers with something they have long lacked: bargaining power   https://t.co/tomVorkXMW",
  "data/tweet-economist/2021/6/1408883776965468163.json": "This year the Bob Marley museum in Kingston will become one of several “herb houses” in the capital where people can buy its brand of ganja for therapeutic use\nhttps://t.co/Z6M4L0WtH5",
  "data/tweet-economist/2021/6/1408905182562373641.json": "Sexism has underpinned medical practice since the time of Hippocrates\nhttps://t.co/UDl2Oia71o",
  "data/tweet-economist/2021/6/1408892092563312640.json": "A new research paper speaks to the question of interspecific interbreeding among species  https://t.co/HzgEI4gYuE",
  "data/tweet-economist/2021/6/1408905665767161857.json": "Kenneth Kaunda resolved to take back his country without bloodshed. The new Zambia, no longer Northern Rhodesia, was to be a land of respect for people of all races, colours and religions\nhttps://t.co/xy459Ekpl2",
  "data/tweet-economist/2021/6/1408927303212666880.json": "Of the 50 cases the Supreme Court justices had settled by June 23rd, there were just four 6-3 decisions along ideological lines and 24 unanimous rulings  https://t.co/jv4zDyRAE7",
  "data/tweet-economist/2021/6/1408952339927535619.json": "Two-thirds of American Catholics think Joe Biden should be allowed to receive communion, according to a poll. The vote shows the gap between church hierarchy and its flock  https://t.co/EV0C9SbprS",
  "data/tweet-economist/2021/6/1408651257225547777.json": "Witnesses say the police murdered Jhondie, a 16-year-old Filipino boy, after he witnessed another extra-judicial killing. An investigation is underway https://t.co/G5DgVzArdS",
  "data/tweet-economist/2021/6/1408970350382170112.json": "A government sociologist in Xinjiang insisted that rural women from ethnic groups had “spontaneously” agreed to be sterilised https://t.co/Ok49pEO3Hb",
  "data/tweet-economist/2021/6/1408953496481697793.json": "Imagine if a non-human won the greatest prize in medical research https://t.co/zlumggChb8",
  "data/tweet-economist/2021/6/1409025827841449989.json": "The ancestry of Homo sapiens, it seems, is less a family tree than a worldwide web  https://t.co/jpUjvKNZFS",
  "data/tweet-economist/2021/6/1409033412552409089.json": "Single-sport specialisation in schools may explain why more young people than ever before are sustaining ACL injuries https://t.co/MzLrH7FxEH",
  "data/tweet-economist/2021/6/1409077811864817666.json": "After France's nuclear tests in the Sahara, locals would go to recover scrap metal from the blasts for use in their home https://t.co/XYMuGtkxy1",
  "data/tweet-economist/2021/6/1409017929576951811.json": "What would happen if the medical revolution that paved the way out of the pandemic developed into something unexpected? Our imagined scenario from 2029 https://t.co/PK48ppqSLg",
  "data/tweet-economist/2021/6/1409097206959939591.json": "Climate models predict that deadly heat waves will become more common. Failing to prepare for extreme heat will have devastating consequences, as we explore in a fictional scenario set in India in 2041 https://t.co/TJILgK3RGy",
  "data/tweet-economist/2021/6/1408666597020082176.json": "Our imagined scenario looks at the controversial ceremony of 2036, and the unprecedented victory of artificial intelligence https://t.co/kOIbH4brMt",
  "data/tweet-economist/2021/6/1409049736259248128.json": "What Japanese conservatives view as a history of expansion and modernisation, the Ainu view as colonialism https://t.co/bSpPqKwqxT",
  "data/tweet-economist/2021/6/1409149783227383817.json": "Could an artificial intelligence really win the Nobel prize for medicine? AI is already used in medical research https://t.co/NJ25rMYiTi",
  "data/tweet-economist/2021/6/1408975061441257475.json": "The price of the party’s success, in brutal repression, has been horrendous https://t.co/XXc7v2SWiw",
  "data/tweet-economist/2021/6/1409163635805634565.json": "The official tally of killings in the drug war in the Philippines stands at 6,117. Human rights monitors think the campaign has killed thousands more https://t.co/uXvhjwFuei",
  "data/tweet-economist/2021/6/1409089407345475585.json": "Understanding Belgian policymaking requires a metaphysical outlook. Belgium is an experiment in quantum governance, with the state simultaneously everywhere and nowhere https://t.co/qSCVTM5bV5",
  "data/tweet-economist/2021/6/1409088387508752386.json": "In all countries, school closures will widen the gap between better-off pupils and worse-off ones https://t.co/u5vWrUzFLw",
  "data/tweet-economist/2021/6/1408878248960958465.json": "Arthur Brand reckons 30% of all items on the market are fake\nhttps://t.co/y1p0B9MDN7",
  "data/tweet-economist/2021/6/1409210201094463499.json": "Officially, covid-19 has killed 3m people around the world. But statistical modelling from The Economist suggests the number could be as much as four times higher: https://t.co/HGoLVmQEux",
  "data/tweet-economist/2021/6/1409233589615595522.json": "Everyone’s ancestors lived in Africa, where Homo sapiens originated. Only now is a serious effort being made to explore the continent's genetic richness  https://t.co/VNni6Zwyp9",
  "data/tweet-economist/2021/6/1409209428386189315.json": "The disruption caused to education by covid-19 creates a chance to make schools better than they were before https://t.co/4CCovTqNeq",
  "data/tweet-economist/2021/6/1409179986536415237.json": "In Belgium responsibility is shared between so many layers that ultimately no one is in charge https://t.co/PV4XV0TZNq",
  "data/tweet-economist/2021/6/1409191813546745863.json": "Since 2000 most immigrants to Britain have been workers or students, who often turn into workers after finishing their courses https://t.co/wne3SPwVKd",
  "data/tweet-economist/2021/6/1409261266640818184.json": "A thriving Jamaican cannabis industry might become more than just a pipe-dream\nhttps://t.co/vgn1gZgRe7",
  "data/tweet-economist/2021/6/1409257507697086484.json": "“We’re losing species at unprecedented scale and an unprecedented rate...we don’t have the basic data of what we’re losing and how fast.” Tanya Berger-Wolf of @WildMeORG explains how machine learning can be used to monitor biodiversity, on “Babbage” https://t.co/f0iPfeMFyd https://t.co/32X25EQV37",
  "data/tweet-economist/2021/6/1409278635828203523.json": "Under proposed legislation new immigrants to Quebec will have six months to learn the language; after that, all the government’s letters to them will be in French \nhttps://t.co/WrO24oujpB",
  "data/tweet-economist/2021/6/1409225282544865285.json": "The statutes of the Nobel Foundation have historically been interpreted as implying that only a human can win the award. But imagine if an artificial intelligence made a breakthrough discovery https://t.co/VHykXASzT7",
  "data/tweet-economist/2021/6/1409240401408675843.json": "“In the past 20 years, this is the third outbreak or pandemic we’ve had. This isn’t going to be the last one. There’ll be a SARS-CoV-3 and a SARS-CoV-4.” Pamela Bjorkman of @Caltech tells @alokjha why she’s working on a universal coronavirus vaccine https://t.co/aJEAsdJQxy https://t.co/hpnLdd5yP0",
  "data/tweet-economist/2021/6/1409355900717051908.json": "The Japanese government is happy to talk about preserving Ainu culture, but prefers not to discuss why Ainu culture was threatened at all https://t.co/xVSnGbYRgH",
  "data/tweet-economist/2021/6/1409351120598802433.json": "Almost all requests to marry Indonesian girls in religious courts are granted, often without the knowledge or approval of the child involved https://t.co/IpqkcxSmG5",
  "data/tweet-economist/2021/6/1409067557810851841.json": "Only about 5% of all marriages involving children in Indonesia go through legal channels, according to a government estimate https://t.co/Txz5Ec4TL0",
  "data/tweet-economist/2021/6/1409370121685061639.json": "The party line is that Uyghurs and Han Chinese follow the same rules, promoting “fewer and better” births. Official documents tell a different story https://t.co/ds0uMpD2YI",
  "data/tweet-economist/2021/6/1409365692684636160.json": "Decades after France tested nuclear weapons in the desert, many residents of the Sahara feel they are still being treated like guinea pigs https://t.co/LB4caMlGmo",
  "data/tweet-economist/2021/6/1409380207753039874.json": "The African continent is where humanity grew up—and where the bulk of human genetic diversity is found to this day https://t.co/kNUC2kasg5",
  "data/tweet-economist/2021/6/1409336031904677892.json": "The existence of the Ainu people, an ethnic minority, complicates some conservatives’ idea of Japan as an ethnically homogeneous nation https://t.co/l080hXZh4s",
  "data/tweet-economist/2021/6/1409441153875955715.json": "Elinor Cleghorn describes how “hysteria”—from hystera, the Greek word for uterus—was long used as a blanket diagnosis for women\nhttps://t.co/H9dNMJXTrb",
  "data/tweet-economist/2021/6/1409453983672897538.json": "Modern medicine still has much to learn about women’s bodies https://t.co/HMqBERuLKQ",
  "data/tweet-economist/2021/6/1409489319446859776.json": "Meanwhile, politicians who favour the death penalty (which Pope Francis wants abolished) face no such sanction from the church  https://t.co/becjldA4nU",
  "data/tweet-economist/2021/6/1409557207969005572.json": "The Big Mac index was created in 1986 as a lighthearted way to see whether a currency is trading at its “correct” level https://t.co/yqZcy1P646",
  "data/tweet-economist/2021/6/1409536899828625415.json": "Imagine an app that could analyse restaurant menus and recommend which dishes to order according to your health data. Would you download it? https://t.co/sdhNv5pmA3",
  "data/tweet-economist/2021/6/1409642788942082049.json": "The disaster in Florida may turn out to be the deadliest building collapse in America for 20 years  https://t.co/9MGEoBu00T",
  "data/tweet-economist/2021/6/1409704495009853443.json": "It is too soon to know what caused the building collapse in Surfside, Florida. But one theory is that over the years the ground shifted beneath the building  https://t.co/zq0GGCTbiL",
  "data/tweet-economist/2021/6/1409743398916038657.json": "Xi Jinping has rebuilt the party at the grassroots, creating a network of neighbourhood spies and injecting cadres into private firms https://t.co/vFX4v7d13w",
  "data/tweet-economist/2021/6/1409722781563031552.json": "Xi Jinping has terrorised Communist Party bureaucracy, sucking the initiative out of local government. But after Mr Xi may come another like him https://t.co/T30a6RiAyr",
  "data/tweet-economist/2021/6/1409796190791667713.json": "Spain pardons Catalan separatists https://t.co/j5jYeQDI5O",
  "data/tweet-economist/2021/6/1409652874624135172.json": "The government is encouraging Han Chinese to have more children, while limiting ethnic minority births https://t.co/HpasKa0l2O",
  "data/tweet-economist/2021/6/1409848911905366017.json": "Changing climatic conditions mean that ever more buildings will be exposed to stresses they were not designed to withstand  https://t.co/Bhhj5jEIf4",
  "data/tweet-economist/2021/6/1409751597022842881.json": "“Sea snot” clogs up the Marmara Sea https://t.co/OE3h4llnr7",
  "data/tweet-economist/2021/6/1409978994544480263.json": "At the peak of the opioid prescribing blitz, in 2012, physicians wrote 81 opioid prescriptions per 100 Americans\nhttps://t.co/5rRp8oYH2F",
  "data/tweet-economist/2021/6/1409999888818098184.json": "To contain the rapid spread of the variant, European countries and Hong Kong have tightened controls on travellers from Britain  https://t.co/rJOc6NaCDv",
  "data/tweet-economist/2021/6/1409898275617050624.json": "We think of virtual tourism as a phenomenon of the pandemic. But for a nun in the Middle Ages, conditions weren’t so different. \n\nPilgrims’ diaries were one of the hottest literary trends in 15th-century Europe. \n\nClick to find out why 👇",
  "data/tweet-economist/2021/6/1410050801628758016.json": "When Kenneth Kaunda was voted out of power he went graciously. That was the best example for Africa as a whole. He was only the second African president to step down after an election\nhttps://t.co/v916xSFGQ7",
  "data/tweet-economist/2021/6/1409880620432564231.json": "Even if the world reaches net-zero emissions by mid-century, the effects of past carbon emissions will continue to manifest themselves for decades. Writing in the future, we imagine how extreme heat might affect India https://t.co/zo4os8cRQA",
  "data/tweet-economist/2021/6/1409662147441795073.json": "Daniel Ortega tears up all pretence of democracy in Nicaragua https://t.co/5OMfPWuc0i",
  "data/tweet-economist/2021/6/1410076214795120640.json": "According to GISAID, a data-sharing initiative for corona- and influenza-virus sequences, the delta variant has been identified in 78 countries  https://t.co/9XRvMbwJcp",
  "data/tweet-economist/2021/6/1410090764948971523.json": "The pandemic has demonstrated what medicine can achieve with the right resources and incentives; it is an apt time to shine a light on the gaps in understanding of women’s bodies\nhttps://t.co/OeWOrgzyQ8",
  "data/tweet-economist/2021/6/1410104552909574156.json": "In a recent poll of more than 10,000 European office workers, 79% said they would back legislation prohibiting bosses from forcing people to work from the office  https://t.co/lbNflraEr1",
  "data/tweet-economist/2021/6/1410120675751247877.json": "It is June 2041. Extreme heat is beating down on India. Of the 52,348 heat-related deaths reported nationally, one third have occurred in Chennai. Meanwhile, Hyderabad has suffered just 26 deaths. Why? https://t.co/S1nQe0aDbW",
  "data/tweet-economist/2021/6/1410019491736702981.json": "A report issued in 2019 warned that the world’s infrastructure is poorly prepared for rising sea levels  https://t.co/PnyGvkpca5",
  "data/tweet-economist/2021/6/1410149122859061250.json": "In 2019 one area of Xinjiang reported a birth rate of 4.15 per thousand people. That is one of the lowest birth rates anywhere in the world—and a decline rarely seen even in wartime https://t.co/64nntzpPHV",
  "data/tweet-economist/2021/6/1410010208714231811.json": "According to one poll of 2,000 American adults, 42% of remote workers said they would search for a new job if they were asked to return to the office full time  https://t.co/RoNSFWbVsy",
  "data/tweet-economist/2021/6/1410231296039821322.json": "The delta variant is thought to be perhaps two or three times more transmissible than the original virus first spotted in Wuhan in China in 2019  https://t.co/EugP60gxWZ",
  "data/tweet-economist/2021/6/1410066385938567168.json": "Every corner of a Chinese city must be watched; any problem dealt with immediately. Street cameras ensure there are no “blind spots”, as officials put it https://t.co/Qfd3p1Btd9",
  "data/tweet-economist/2021/6/1410124930847588353.json": "Imagine this. The year is 2029 and mRNA is being used to treat cancer, heart disease and neurological disorders. But biohacktivists want to take the technology even further https://t.co/ZyisgzMW34",
  "data/tweet-economist/2021/6/1410272953409880073.json": "In Namibia, Uganda and Zambia, among other places, oxygen is running out and hospital beds are full https://t.co/DAnr2ruyf2",
  "data/tweet-economist/2021/6/1410362307637649412.json": "The delta variant may soon be the most prevalent strain in America, France, Germany, Italy, Mexico, South Africa, Spain and Sweden  https://t.co/2bIm71GCjZ",
  "data/tweet-economist/2021/6/1410201516582096906.json": "One theory that has arisen as the cause of the condominium building collapse in Florida: a failure to adapt to climate change  https://t.co/ABLksOD5XU",
  "data/tweet-economist/2021/6/1409872631835279363.json": "💊 In December 2036, what if an AI wins the Nobel prize for medicine?\n\n🐒 In February 2055, imagine if marmosets lived on the Moon. \n\n👩‍🍳 In January 2035, could everyone’s nutrition be personalised?\n\nWe look at the future of health in our annual \"What If?\" Click to read more  👇"
}