{
  "data/tweet-economist/2022/4/1509687479506509828.json": "Hungary is still a democracy, but a damaged one. Its election on April 3rd will be seen as a global struggle between liberal democracy and populist autocracy  https://t.co/f1Fbys9zYP",
  "data/tweet-economist/2022/4/1509719965800316931.json": "“We believe in victory. It’s impossible to believe in anything else.” Ukraine’s president, Volodymyr Zelensky, speaks to The Economist’s editor-in-chief @zannymb and Russia editor @arkadyostrovsky, on a special episode of “The Economist Asks” podcast  https://t.co/glOHf65qrU",
  "data/tweet-economist/2022/4/1509715111065313283.json": "It seems that Russia is keen to use humanitarian gestures in Ukraine to the same effect as in Syria https://t.co/rpvYjM5pDB",
  "data/tweet-economist/2022/4/1509729670534729730.json": "EU leaders hope to send a message to China’s leader, Xi Jinping, that the Ukraine war is a defining moment for\nrelations, and for China’s image if it refuses to use its influence to end the bloodshed https://t.co/0ZiEtkKR2K",
  "data/tweet-economist/2022/4/1509760473801142311.json": "Ukraine has won the first phase of the war simply by surviving. Now it needs to advance, and so Volodymyr Zelensky needs redoubled Western help https://t.co/ZeyamMgvpV",
  "data/tweet-economist/2022/4/1509781503814873091.json": "KAL’s cartoon https://t.co/rd5oSKf73M",
  "data/tweet-economist/2022/4/1509710297854009351.json": "Macaroni cheese is now an American staple. But it probably arrived there via France – and Thomas Jefferson https://t.co/5i056D1xvd",
  "data/tweet-economist/2022/4/1509871159038418944.json": "The Economist’s editor-in-chief, Zanny Minton Beddoes, travelled to the heart of the Ukrainian war effort to interview Volodymyr Zelensky.\n\nIn a wide-ranging interview, the Ukrainian president discussed the state of the war and why Putin must be defeated https://t.co/T3dD5jhAMp",
  "data/tweet-economist/2022/4/1509814420742062108.json": "Vladimir Putin’s invasion of Ukraine has shown Europe that it needs a new China policy https://t.co/Sm5oXMrYaj",
  "data/tweet-economist/2022/4/1509857860242460673.json": "On March 25th @zannymb, editor-in-chief of The Economist, travelled to Kyiv to interview Volodymyr Zelensky. \n\nHere is the inside story of how she and @ArkadyOstrovsky, The Economist’s Russia editor, made it into the Ukrainian president’s war room https://t.co/QmH2g4kZac",
  "data/tweet-economist/2022/4/1509864876054913031.json": "“We believe in victory,” Volodymyr Zelensky told The Economist in a face-to-face interview in Kyiv last week https://t.co/oU8NdlxBNj",
  "data/tweet-economist/2022/4/1509887071049166884.json": "Russia claimed its attack on Kyiv was designed to distract Ukrainian forces from the real action in Donbas. Yet evidence shows that Russia intended to take Kyiv and expected to do so quickly https://t.co/EtY3iFF5DT"
}