{
  "data/tweet-economist/2022/8/1553899291546046464.json": "Ukraine is gathering strength for an assault on Kherson https://t.co/Eh0JlVAtCF",
  "data/tweet-economist/2022/8/1553932336143687682.json": "This week 191 countries gather in New York to review the Nuclear Non-Proliferation Treaty, a cornerstone of global security https://t.co/6D8h0djASc",
  "data/tweet-economist/2022/8/1553910445463027712.json": "The sun is both our creator and destroyer https://t.co/8BSUqAWFgH",
  "data/tweet-economist/2022/8/1554023593956220928.json": "Russia’s hostility has three targets: the liberal West, Ukraine and trai­tors at home. All of them need to take stock of what Russian fascism means \nhttps://t.co/zPM4JGKmnu",
  "data/tweet-economist/2022/8/1554152798417260546.json": "Vladimir Putin has summoned the demons of history by branding Volodymyr Zelensky, who is Jewish, as “a Nazi”. Israel is worried that Russia’s president may be falling back on bad old tsarist ways https://t.co/QnJn07Ru65",
  "data/tweet-economist/2022/8/1554142895040495616.json": "The national-security dimensions of microchips made the CHIPS Act a rare instance of broad political agreement in America https://t.co/sult1CT1Mb",
  "data/tweet-economist/2022/8/1554177503719301121.json": "The engine of fascism does not have a reverse gear. Vladimir Putin cannot turn back to a reality­-based brand of authoritarianism. It will seek to ex­pand both geographically and into people’s private lives \nhttps://t.co/pEOL8ICHZw",
  "data/tweet-economist/2022/8/1554415057844453377.json": "♦️ Nancy Pelosi is expected to arrive in Taiwan today.\n\n♦️ Ayman al-Zawahiri, leader of al-Qaeda, was killed by American drone strike, Joe Biden confirms.\n\n♦️ BP’s profits soar as the energy giant benefits from rising commodity prices.\n\nCatch up on today’s news ⬇️",
  "data/tweet-economist/2022/8/1554463929157443584.json": "A trip designed to convey strength risks instead showing up the Biden administration’s confusion and lack of purpose https://t.co/ftHXdjqCLV",
  "data/tweet-economist/2022/8/1554451133258661891.json": "“This terrorist leader is no more. People around the world no longer need to fear the vicious and determined killer,” declared Joe Biden https://t.co/ow1umC8OI9",
  "data/tweet-economist/2022/8/1554496028564389890.json": "Nancy Pelosi, the speaker of America’s House of Representatives, has landed in Taiwan. She is expected to meet Taiwan’s president Tsai Ing-wen on Wednesday. Follow her visit and catch up on the latest news ⬇️",
  "data/tweet-economist/2022/8/1554557946507526152.json": "Clinical practice is already changing to emphasise dealing with environmental triggers of depression rather than deploying drugs https://t.co/nqKNUmQKVJ https://t.co/qhxJNxYNbH",
  "data/tweet-economist/2022/8/1554714417903943681.json": "America’s Congress may be a separate branch from the executive, but Taiwan policy is too important for turf wars. The trip has made Joe Biden look irresolute and lacking in authority https://t.co/Vih3V5ugvE",
  "data/tweet-economist/2022/8/1554766008694480896.json": "♦️ Nancy Pelosi meets Taiwan’s president and reaffirms “American solidarity”.\n\n♦️ The first grain shipment to leave Ukraine since the war began reaches Turkey.\n\n♦️ Kansas chooses to keep the right to abortion in the state’s constitution after referendum.\n\nCatch up on today’s news",
  "data/tweet-economist/2022/8/1554581807143784450.json": "One view is that the trip is a symptom of America’s incoherent approach to China—the country’s single most important opponent in the long run https://t.co/7khiuiC0Z1",
  "data/tweet-economist/2022/8/1554737785097043968.json": "Germans have been living in a dream https://t.co/aLL8QPBBzo",
  "data/tweet-economist/2022/8/1554864436489355266.json": "Kansans vote to keep their state’s constitutional right to abortion https://t.co/Qo8yaEZm1j",
  "data/tweet-economist/2022/8/1554883859585589251.json": "Vladimir Putin has embraced fascist methods and fascist thinking. This holds an alarming message for the rest of the world \nhttps://t.co/p1bZFphIYS",
  "data/tweet-economist/2022/8/1554892246201376768.json": "Investigators appear to be building a criminal case against the former president https://t.co/knrdkPiFI6",
  "data/tweet-economist/2022/8/1554298866962399232.json": "Many voters mention their anger at how many Navajo households still must transport water to their homes by truck, despite previous administrations’ promises to solve the issue https://t.co/FGnkY0BVUU",
  "data/tweet-economist/2022/8/1554946509719965698.json": "The margin, 62% to 38%, suggests broad opposition to the demise of Roe v Wade https://t.co/UciEcIrG3k",
  "data/tweet-economist/2022/8/1555014032804937736.json": "Kansas has become a refuge for women from neighbouring Oklahoma and Missouri, where near-total bans on abortion are now in place. https://t.co/abAJtlaFpm"
}