{
  "data/tweet-nytimes/2021/8/1421659064543633417.json": "Breaking News: Emma McKeon of Australia became only the second woman to win seven medals at a single #Olympics, tying a record set in 1952. \n#Tokyo2020 https://t.co/QAnQazjJis",
  "data/tweet-nytimes/2021/8/1421769674015002625.json": "Rebeca Andrade of 🇧🇷 wins gold in the women’s vault final. MyKayla Skinner of 🇺🇸 came in second with the silver medal. Yeo Seo-jeong won bronze for 🇰🇷. #Tokyo2020 https://t.co/eQMfqWMD4Q",
  "data/tweet-nytimes/2021/8/1421692675904970752.json": "Astronomers have found moons in the making in a ring of rock and gas orbiting an exoplanet nearly 400 light-years from Earth. https://t.co/L9luHpCius",
  "data/tweet-nytimes/2021/8/1421666346996228096.json": "The U.S. upset Britain in the men’s 4x100 medley, giving Caeleb Dressel his fifth gold in the #Tokyo2020 Olympics and extending an unbeaten streak in the event. https://t.co/IVVT3WRzbf https://t.co/Q3QbMMX0wo",
  "data/tweet-nytimes/2021/8/1421818906512080898.json": "Breaking News: Marcell Jacobs of 🇮🇹 won the men’s 100-meter dash final at the #Tokyo2020 #Olympics. Fred Kerley of 🇺🇸 came in second, followed by Andre de Grasse 🇨🇦 https://t.co/od6kYWkACb",
  "data/tweet-nytimes/2021/8/1421838155838337025.json": "Yulimar Rojas of 🇻🇪  leapt 15.67 meters in the women's triple jump at the #Tokyo2020 #Olympics https://t.co/MXrxWcbmLL https://t.co/6SfIFGfwIu",
  "data/tweet-nytimes/2021/8/1421732457242583042.json": "“Our lungs are burning, our future is burning.\" \n\nFirefighters in Turkey struggled to contain dozens of wildfires raging for a fourth day on Saturday, as fast-spreading blazes forced popular holiday resorts and rural areas along the coast to be evacuated. https://t.co/uNhVIIqkid",
  "data/tweet-nytimes/2021/8/1421870895396753411.json": "Politics weighed heavily in the men’s doubles badminton finals 🏸 as Taiwan, which competes as ‘Chinese Taipei’ at the Olympics, beat China to win 🥇 https://t.co/yf6OXxKHmV",
  "data/tweet-nytimes/2021/8/1421885981389635590.json": "From Opinion: \"It’s enraging to listen to people complain that wearing a mask or getting a simple shot is akin to an assault on their freedom while children who have no choice bear the brunt of their nonsense,\" Jessica Valenti writes. https://t.co/cn3rWyENE6",
  "data/tweet-nytimes/2021/8/1421851977223446533.json": "The Delta variant is spreading rapidly worldwide and fueling new coronavirus outbreaks in the U.S., mainly among the unvaccinated. Here’s what scientists know (and what you should, too). https://t.co/VwbLNWQcLm",
  "data/tweet-nytimes/2021/8/1421918663586861060.json": "A Belarusian sprinter said Sunday that she was under the protection of the Japanese police after her country’s Olympic Committee tried and failed to deport her after she criticized her coaches for registering her for the wrong event. #Tokyo2020 #Olympics https://t.co/iqU2X1tSOt",
  "data/tweet-nytimes/2021/8/1421979069801979906.json": "“He’s one of my best friends. We’re always together.”\n\nIn the men’s high jump, Gianmarco Tamberi of Italy and @mutazbarshim of Qatar were hopelessly locked in a tie for the gold. In a heartwarming act of sportsmanship, they decided to share it. #Tokyo2020 https://t.co/PSzibbQe8M",
  "data/tweet-nytimes/2021/8/1421969049744027648.json": "Before Sunday, an Italian man had never won an Olympic medal in the 100-meter dash in the Games’ 125-year history. Now, Lamont Marcell Jacobs is the first from Italy to hold the title of world’s fastest man. https://t.co/mVdHL5STIo",
  "data/tweet-nytimes/2021/8/1421994167794814976.json": "Rebeca Andrade of Brazil has accomplished more than she had ever imagined at these Olympics, or in her career, medaling twice with a knee that has undergone three operations in the past six years. https://t.co/hqiQ7bn9iT",
  "data/tweet-nytimes/2021/8/1421911128356098058.json": "DaBaby’s scheduled performance at the Lollapalooza music festival in Chicago was canceled on Sunday after the rapper made homophobic comments that other music artists condemned. https://t.co/GgdqUKVJAg",
  "data/tweet-nytimes/2021/8/1422059593434386436.json": "Cats don't need us, but we need them. Researchers who work on the genomes of domestic and wild cats say their DNA holds clues to human as well as feline health. https://t.co/l8F31eP4kC",
  "data/tweet-nytimes/2021/8/1422103630342205440.json": "“He’s one of my best friends. We’re always together.”\n\nIn the men’s high jump, Gianmarco Tamberi of Italy and Mutaz Essa Barshim of Qatar were locked in a tie for the gold. In a heartwarming act of sportsmanship, they decided to share it. #Tokyo2020\nhttps://t.co/2QzEjqTisX",
  "data/tweet-nytimes/2021/8/1422132750329552899.json": "Breaking News: Jade Carey of the U.S. 🇺🇸 won gold on the floor exercise. Vanessa Ferrari of Italy 🇮🇹 won silver, and Mai Murakami of Japan 🇯🇵 won bronze.\nhttps://t.co/oSgn8WnZu7",
  "data/tweet-nytimes/2021/8/1422104920136769540.json": "Politics weighed heavily in the men’s doubles badminton finals 🏸 as Taiwan, which competes as ‘Chinese Taipei’ at the Olympics, beat China to win 🥇 https://t.co/x1tuMb0bXk",
  "data/tweet-nytimes/2021/8/1422146430781771777.json": "Indonesia took gold in the badminton women’s doubles event at #Tokyo2020. Greysia Polii and Apriyani Rahayu overwhelmed the former world champions from China in straight sets.\nhttps://t.co/OCssydp3un",
  "data/tweet-nytimes/2021/8/1421974036364644355.json": "Influencers can convince their followers to buy products, but can they persuade them to get vaccinated against the coronavirus? The White House is betting on it. https://t.co/uklDUKBuIo",
  "data/tweet-nytimes/2021/8/1422094828989566976.json": "A Belarusian sprinter said Sunday that she was under the protection of the Japanese police after her country’s Olympic Committee tried and failed to deport her after she criticized her coaches for registering her for the wrong event. #Tokyo2020 #Olympics https://t.co/tq89jw57I8",
  "data/tweet-nytimes/2021/8/1422185455152508928.json": "Jade Carey of the U.S. flipped, twisted and danced her way to the top of the podium, performing what she called “the best floor routine I’ve ever done in my life\" to win gold in #Tokyo2020. https://t.co/vM6amVx4PD https://t.co/TE8B2XYN43",
  "data/tweet-nytimes/2021/8/1422143909690548229.json": "Breaking News: Kristina Timanovskaya, an Olympic sprinter from Belarus, was offered asylum in Poland. She said she had feared for her safety after criticizing her coaches.\nhttps://t.co/tpeo0zggqN",
  "data/tweet-nytimes/2021/8/1422160276464574464.json": "It’s Day 10 of #Tokyo2020. Here’s where the medal count stands.\n\nFollow updates. https://t.co/shGt6WQyqP https://t.co/6x5eL7an4H",
  "data/tweet-nytimes/2021/8/1422249598559662087.json": "The Belarusian sprinter whose country tried to forcibly send her home from #Tokyo2020 has been offered asylum in Poland. Kristina Timanovskaya, 24, feared for her safety after she criticized her coaches and her country’s Olympic committee. https://t.co/VOu8PQxy6U https://t.co/Ny2DxSCEZb",
  "data/tweet-nytimes/2021/8/1422114361217269761.json": "Alexis Nikole Nelson represents part of an increasingly visible community: Black foragers. https://t.co/w4J2xtfFFu https://t.co/Xi3ScqlSr1",
  "data/tweet-nytimes/2021/8/1422150234398990338.json": "Simone Biles plans to compete on the balance beam on Tuesday, her last possible event at #Tokyo2020. Her decision comes after she withdrew from the all-around and three other event finals because of mental health issues.\nhttps://t.co/GkSSEncFTH https://t.co/WSL0IRQNNM",
  "data/tweet-nytimes/2021/8/1422294674191101965.json": "There's no single answer to who's unvaccinated in the U.S. Those who adamantly refuse tend to be disproportionately white, rural, evangelical Christian and conservative. Those who are open but want to \"wait and see\" tend to be a more diverse, urban group. https://t.co/BsFZOZjsqH https://t.co/wZ5npEhVYz",
  "data/tweet-nytimes/2021/8/1422155241215209475.json": "YouTube suspended Sky News Australia’s channel for breaching the platform’s Covid misinformation policy.\n\nThe broadcaster, which is owned by Rupert Murdoch’s News Corporation, is not allowed to upload new videos for one week.\nhttps://t.co/iFsrw7n7rl",
  "data/tweet-nytimes/2021/8/1422389280161378315.json": "Raven Saunders 🇺🇸, who delivered the first political demonstration on the podium at #Tokyo2020, said on Monday that American athletes have been planning their protest for weeks and decided on X as a symbol to represent unity with oppressed people. https://t.co/Xa5BLQ0ctZ https://t.co/kY5fGShKYm",
  "data/tweet-nytimes/2021/8/1422377953703473161.json": "Jade Carey of the U.S. 🇺🇸 won gold on the floor exercise.\n\nVanessa Ferrari of Italy 🇮🇹 won silver, and two gymnasts tied for bronze: Mai Murakami of Japan 🇯🇵 and Angelina Melnikova of Russia. 🇷🇺 https://t.co/gv2obN8aSX https://t.co/bTgUwoFY48",
  "data/tweet-nytimes/2021/8/1422369162819670016.json": "Florida is seeing its highest number of cases and hospitalizations since the start of the pandemic. But the state is still about one month away from its peak, according to an epidemiologist who had been tracking the virus there. https://t.co/tgocYYzNOQ",
  "data/tweet-nytimes/2021/8/1422331408593326086.json": "He’s broken records set by Usain Bolt — and he’s only 17.\n\nMeet Erriyon Knighton, the U.S.’s youngest male track athlete in the Olympics in decades. https://t.co/bPLgmuZrM3",
  "data/tweet-nytimes/2021/8/1422784415286153220.json": "New York City will become the first U.S. city to require proof of vaccination for a variety of activities for workers and customers — indoor dining, gyms and movie theaters — a move intended to put pressure on people to get vaccinated. https://t.co/JbaA9W2d4L",
  "data/tweet-nytimes/2021/8/1422779358675095555.json": "President Biden signaled a new level of frustration on Tuesday with Republican leaders in states where the highly contagious Delta variant is surging, telling governors in Texas and Florida to help fight the pandemic or “get out of the way.” https://t.co/2OJTYcB7Hi",
  "data/tweet-nytimes/2021/8/1422774318753329153.json": "Physicians working in Covid-19 hot spots across the U.S. say that the patients in their hospitals are not like the patients they saw last year. Almost always unvaccinated, the new arrivals tend to be younger. And they seem sicker. https://t.co/GXEmr8d0sI",
  "data/tweet-nytimes/2021/8/1422756796696043524.json": "Sydney McLaughlin broke her own world record to win her first Olympic gold in the 400-meter hurdles. The 21-year-old finished in 51.46 seconds and beat her teammate, Dalilah Muhammad, who ran the fastest time of her life to take the silver medal. https://t.co/gRuYRtapOF https://t.co/84uKFcNttN",
  "data/tweet-nytimes/2021/8/1422748225929453578.json": "Breaking News: The American Sydney McLaughlin won the 400-meter hurdles, defeating Dalilah Muhammad, her teammate and the 2016 Olympic champion. She set a new world record, finishing in 51.46 seconds. https://t.co/xxrUJ2sip0",
  "data/tweet-nytimes/2021/8/1422741607418302464.json": "Simone Biles 🇺🇲made a dramatic return to #Tokyo2020 on Tuesday in her last opportunity, the balance beam, after dropping out of several events to protect her mental health.\n\nShe finished third behind Guan Chenchen and Tang Xijing of China 🇨🇳. https://t.co/qHXDv4PlVG https://t.co/84vQKl3gxb",
  "data/tweet-nytimes/2021/8/1422739465752256513.json": "Simone Biles was already the most accomplished gymnast of our time. \n\nWith her bronze medal in the balance beam final at #Tokyo2020 on Tuesday, she now has a total of 32 Olympic and world medals, matching Larisa Latynina of the Soviet Union. https://t.co/JtcHkOwHDv https://t.co/YhL8tV0cdx",
  "data/tweet-nytimes/2021/8/1422735598595493889.json": "After Simone Biles nailed her beam routine in Tuesday’s final at #Tokyo2020, she hugged her teammate Sunisa Lee, who won the gold medal in the all-around competition this week. https://t.co/eKSZAfbJrp https://t.co/kyETIH5dCQ",
  "data/tweet-nytimes/2021/8/1422724732105936896.json": "Athing Mu 🇺🇸 won the women’s 800 meters at #Tokyo2020. She became the first American to take Olympic gold in the event since 1968.\nhttps://t.co/56plqTIEw1",
  "data/tweet-nytimes/2021/8/1422721462281162762.json": "A Frontier Airlines passenger assaulted three flight attendants, punching one and groping the breasts of two others, on a flight from Philadelphia to Miami, prompting one crew member to tape him to his seat until the plane landed, the authorities said. https://t.co/6sq3pARbP4",
  "data/tweet-nytimes/2021/8/1422718975864082433.json": "Cuneiform tablets and thousands of other looted archaeological artifacts were returned to Iraq this week after being held for years by Cornell University and the Museum of the Bible, which was founded by the family that owns the Hobby Lobby chain. https://t.co/tCMvLBtbvf",
  "data/tweet-nytimes/2021/8/1422704813092085765.json": "Breaking News: The FDA is now aiming to fully approve Pfizer-BioNTech’s coronavirus vaccine by the start of next month as a new surge of infections grows. https://t.co/u3PuUFISCh",
  "data/tweet-nytimes/2021/8/1422687491061166081.json": "Tamyra Mensah-Stock, 28, a Texas native whose father came to the U.S. from Ghana, became the first Black woman to win a gold medal in wrestling since the women's competition was added to the Summer Olympics in 2004. https://t.co/5ATmG5Xs6X https://t.co/dun0w2aUaL",
  "data/tweet-nytimes/2021/8/1422678727696306185.json": "President Biden on Tuesday called for Gov. Andrew Cuomo of New York to resign after the state's attorney general found that Cuomo had sexually harassed 11 women. https://t.co/RnG2VtwGyy https://t.co/h4DBYiI61U",
  "data/tweet-nytimes/2021/8/1422668628038766600.json": "New York City will become the first U.S. city to require proof of at least one dose of a coronavirus vaccine for a variety of activities including indoor dining, gyms and performances, Mayor Bill de Blasio announced on Tuesday. https://t.co/10EL0ChU6a https://t.co/wntosysUYy",
  "data/tweet-nytimes/2021/8/1422662557953892352.json": "Breaking News: President Biden called on Gov. Andrew Cuomo of New York to resign after the state’s attorney general found that Cuomo had sexually harassed women. https://t.co/HRWLpZXKd3",
  "data/tweet-nytimes/2021/8/1422643452320354306.json": "Reese Witherspoon will sell her entertainment studio, Hello Sunshine, for nearly $1 billion in a deal that will move her into the ranks of Hollywood’s power brokers. https://t.co/FFbKkGRn4F",
  "data/tweet-nytimes/2021/8/1422599427462778882.json": "Letitia James, the New York State attorney general, said a monthslong investigation found that Gov. Andrew M. Cuomo sexually harassed multiple women and retaliated against at least one for making her complaints public. https://t.co/3n7ql1FWpN",
  "data/tweet-nytimes/2021/8/1422577037907267584.json": "Breaking News: Gov. Andrew Cuomo sexually harassed multiple women, and retaliated against one for going public, the New York attorney general’s investigation found.\n\nFollow for live updates. \n\nhttps://t.co/BFmMElaT95",
  "data/tweet-nytimes/2021/8/1422567948267446276.json": "New York City will require proof of vaccination for people participating in indoor activities, including:\n— Dining at restaurants\n— Working out at gyms\n— Attending performances\nThe mandate also applies to workers at those places. https://t.co/gYoNDeBfaL",
  "data/tweet-nytimes/2021/8/1422555523644264453.json": "Breaking News: New York will require proof of vaccination for indoor dining and gyms, Mayor Bill de Blasio plans to announce. It’s believed to be the first U.S. city to do so.\nhttps://t.co/W6FGP9ZIo5",
  "data/tweet-nytimes/2021/8/1422549562300977154.json": "Tyson Foods said it would require U.S. workers to be vaccinated, half of whom are not, according to the company. It is the first big frontline employer to adopt such a mandate. https://t.co/Cz8NaqAcyQ",
  "data/tweet-nytimes/2021/8/1422535249544851459.json": "Simone Biles won bronze in the balance beam at #Tokyo2020.\n\nShe now has seven Olympic medals, tying Shannon Miller as the most successful American gymnast in the Games. Biles, though, has four golds to Miller’s two.\nhttps://t.co/zu1dhKOMG1",
  "data/tweet-nytimes/2021/8/1422517628099252228.json": "A city in India has fully vaccinated its entire adult population of 900,000 people, officials said. It was a big milestone for Bhubaneswar, the largest city in the state of Odisha, which was overwhelmed by the coronavirus earlier this year. https://t.co/jZsyTq8IFM",
  "data/tweet-nytimes/2021/8/1422506299133153280.json": "Simone Biles made her much-anticipated return to #Tokyo2020 in the balance beam final. She won bronze for the U.S. after taking time away from the competition because of a mental health issue.\nhttps://t.co/Uwqisxq1SN https://t.co/ycTQ3seIzP",
  "data/tweet-nytimes/2021/8/1422639005389180937.json": "We asked public health experts how vaccinated people should adjust their lives and behaviors in response to the Delta variant of the coronavirus.\n \nHere’s some of their advice. https://t.co/1Bxa1Z66R4",
  "data/tweet-nytimes/2021/8/1422799508967198724.json": "Climate change is threatening emperor penguins with extinction in much of their range, federal wildlife officials said on Tuesday as they announced a proposal to protect them under the Endangered Species Act.\nhttps://t.co/fV2TXEsxVA",
  "data/tweet-nytimes/2021/8/1422890094290157569.json": "Barack Obama \"decided to significantly scale back\" a huge 60th birthday party at Martha’s Vineyard over the spread of the Delta variant.\n\nHundreds of former Obama administration officials, celebrities and Democratic donors had been set to attend.\nhttps://t.co/6i64Zql7OY",
  "data/tweet-nytimes/2021/8/1422940419793510403.json": "Democrats in Congress have drafted a plan to tax major oil and gas companies billions of dollars. They say the biggest climate polluters should pay for the floods, wildfires and other disasters that scientists have linked to the burning of fossil fuels. https://t.co/yfaqYmtYI6",
  "data/tweet-nytimes/2021/8/1422909743367168008.json": "Here’s how Andre De Grasse of Canada won the men’s 200-meter final in 19.62 seconds, setting a national record and claiming his second medal at #Tokyo2020.\nhttps://t.co/FgP6fiOfW5 https://t.co/lWofnX4Cg9",
  "data/tweet-nytimes/2021/8/1422938502652731401.json": "Breaking News: The World Health Organization called for a moratorium on Covid booster shots until the end of September to help each country vaccinate at least 10% of its population, an attempt to address dramatic disparities in global vaccination rates. https://t.co/YdHWVSRWJJ",
  "data/tweet-nytimes/2021/8/1422974411028697096.json": "The Mexican government on Wednesday filed a lawsuit in the U.S. against 11 gun manufacturers and suppliers, accusing them of negligently facilitating the flow of weapons to powerful drug cartels and enabling tremendous bloodshed in Mexico. https://t.co/5YrcBTBaYn",
  "data/tweet-nytimes/2021/8/1422960675266170883.json": "A 28-year-old patient died of Covid in Missouri.\nA college student was admitted to intensive care.\nYoung adults are showing up in Louisiana ERs, desperately ill.\n \nIs the Delta variant making young adults “sicker, quicker?” https://t.co/Sm2k0RZeNI https://t.co/3fXhB1xvIu",
  "data/tweet-nytimes/2021/8/1422957017703096328.json": "“In hindsight, I wish that it had not become law.” As coronavirus cases surge in Arkansas, Gov. Asa Hutchinson is reconsidering a measure he signed into law that bans mask mandates. The state has the 11th-lowest vaccination rate in the U.S. https://t.co/QS65dLxZlZ",
  "data/tweet-nytimes/2021/8/1422897643685036033.json": "The New York Times has eight million subscribers and expects to add half a million by the end of the year. In its results for the second quarter, the company reported holding nearly $1 billion in cash. https://t.co/BKJnESyJe1",
  "data/tweet-nytimes/2021/8/1422983194907926537.json": "The State Department is investigating the whereabouts of a $5,800 bottle of whiskey the Japanese government gave to Secretary of State Mike Pompeo in 2019, though it's unclear whether Pompeo ever received the gift. https://t.co/sP3841IbRb",
  "data/tweet-nytimes/2021/8/1423004725704904705.json": "A lawyer for Lindsey Boylan, one of the women who accused Gov. Andrew Cuomo of unwanted sexual advances, said on Wednesday that she planned to sue Cuomo and his close advisers for the retaliatory actions they took to discredit her after she went public. https://t.co/CbXuCWEIfk",
  "data/tweet-nytimes/2021/8/1422945465537077254.json": "Lawyers for Donald Trump have asked a judge to block the Treasury Department from giving six years of his tax returns to Congress. https://t.co/Wc7ew5jXQw",
  "data/tweet-nytimes/2021/8/1423036032996552713.json": "After winning bronze, the American sprinting star Noah Lyles opened up about depression and the past year's challenges: “I want you to know that it’s OK to not feel good, and you can go out and talk to somebody professionally, or even get on medication.\" https://t.co/U4bMTLW3NP",
  "data/tweet-nytimes/2021/8/1423052605585035272.json": "The Biden administration is developing plans to require all foreign travelers to the U.S. to be vaccinated against Covid, with limited exceptions. White House officials have recently said that there is no plan to lift current restrictions anytime soon. https://t.co/nBuxqEPUXc",
  "data/tweet-nytimes/2021/8/1423132128338907136.json": "Gov. Phil Murphy of New Jersey had a blunt rebuke for anti-vaccination demonstrators. “You’ve lost your minds,” Murphy said. “You are the ultimate knuckleheads. And because of what you are saying and standing for, people are losing their life.”https://t.co/I7nJwSBsZ6",
  "data/tweet-nytimes/2021/8/1423103981975396355.json": "“In hindsight, I wish that it had not become law.” As coronavirus cases surge in Arkansas, Gov. Asa Hutchinson is reconsidering a measure he signed into law that bans mask mandates. The state has the 11th-lowest vaccination rate in the U.S. https://t.co/WwmlUgeVle",
  "data/tweet-nytimes/2021/8/1423176971014574082.json": "Some of us might have full-on burnout after a year-plus of loss, grief and pandemic challenges. Here are some ways to get your motivation back. https://t.co/QNZjNgS6Ov https://t.co/HZkHLYRkMp",
  "data/tweet-nytimes/2021/8/1423102944426221571.json": "Taking the torch from their countryman David Rudisha, Kenyans 🇰🇪finished one-two in the men’s 800 meters at #Tokyo2020. Emmanuel Korir won the gold and Ferguson Rotich took silver. https://t.co/JeGlpNPqrV https://t.co/nihYpBYP0Y",
  "data/tweet-nytimes/2021/8/1423139227643125761.json": "The Biden administration is developing plans to require all foreign travelers to the U.S. to be vaccinated against the coronavirus, with limited exceptions, according to an administration official.\nhttps://t.co/znUfa0XfrQ",
  "data/tweet-nytimes/2021/8/1423238623579750400.json": "The U.S. women’s soccer team beat Australia, 4-3, to take bronze at #Tokyo2020.\n\nMegan Rapinoe and Carli Lloyd both scored two goals to clinch a medal for the Americans.\nhttps://t.co/YXGFPeQgdS https://t.co/cLusafMo7D",
  "data/tweet-nytimes/2021/8/1423214957303304194.json": "Bill Gates acknowledged that his relationship with Jeffrey Epstein was “a huge mistake” in an interview on CNN. The Microsoft founder also said that his divorce, which became final this week, was “a very sad milestone.”\nhttps://t.co/Pbg5hRh92A",
  "data/tweet-nytimes/2021/8/1423277625510924290.json": "Brian Houston, the co-founder and senior pastor of the global megachurch Hillsong, was charged by the Australian police with concealing child sexual abuse carried out by his father in the 1970s. https://t.co/pedNDqSDD8",
  "data/tweet-nytimes/2021/8/1423257509960298496.json": "President Biden is expected to sign an executive order that sets a target of 50% of new cars to be electric powered by 2030. He also plans to tighten emissions regulations that Donald Trump rolled back.\nhttps://t.co/JfxAWXChTd",
  "data/tweet-nytimes/2021/8/1423202137388032013.json": "The world reached 200 million known coronavirus cases in half the time it took to reach 100 million cases. https://t.co/fnpFzh6I7P https://t.co/9CRICIc6l2",
  "data/tweet-nytimes/2021/8/1423262553669578758.json": "Sharks get a bad rap. So researchers and officials are rethinking the phrase \"shark attacks\" to describe the moments when sharks and humans meet — instead adopting terms like \"incidents\" and \"encounters\" to help change public perception of the animals. https://t.co/HFmQQdJG53",
  "data/tweet-nytimes/2021/8/1423260047719772166.json": "The protection offered by Moderna’s Covid vaccine does not wane in the first six months after the second dose, the company said in a statement.\n\nThe data came from a new analysis of its clinical trial, which started last year. https://t.co/DDw1xowrlJ",
  "data/tweet-nytimes/2021/8/1423311107029094406.json": "Demand for Covid shots has nearly quadrupled in recent weeks in Louisiana, driven by an explosion in coronavirus cases. \"The public is finally hearing how bad it has gotten,\" one doctor said. https://t.co/XdAfWUhjBR",
  "data/tweet-nytimes/2021/8/1423258763612598274.json": "Here’s how Steven Gardiner of the Bahamas emerged from a crowded pack to win gold in the men’s 400 meters at #Tokyo2020.\n\nAnthony Jose Zambrano of Colombia took silver and Kirani James of Grenada won bronze.\nhttps://t.co/WMrpGFZJIu https://t.co/lxt6xSEdzD",
  "data/tweet-nytimes/2021/8/1423210925805408259.json": "President Recep Tayyip Erdogan of Turkey is under ferocious attack for his handling of wildfires that have forced thousands of people to evacuate their homes.\n\nThe blazes come as the country is battered by an economic crisis and the pandemic.\nhttps://t.co/6taMlkibui",
  "data/tweet-nytimes/2021/8/1423346273869041665.json": "Lionel Messi will not return to FC Barcelona, the club announced on Thursday. The 34-year-old superstar has been with the club since he was 13. https://t.co/L46H75JOyT",
  "data/tweet-nytimes/2021/8/1423319508303888392.json": "A Black high school principal in Texas said he was asked in 2019 to remove 10-year-old photos on Facebook of himself and his wife, who is white, embracing on a beach. The incident has now resurfaced in a controversy over racism. https://t.co/Z9YPXuMQw4",
  "data/tweet-nytimes/2021/8/1423333001635766278.json": "The Dixie Fire ravaged Greenville, a small Northern California town, on Wednesday, leaving its main street in rubble and stretches of the community unrecognizable. https://t.co/fw0OrcqM8r https://t.co/f6p65C3aGT",
  "data/tweet-nytimes/2021/8/1423275156013715456.json": "Firefighters are trying to keep flames from reaching ancient Olympia — the birthplace of the Olympic Games — as dozens of blazes continue to burn across Greece, fueled by a record-breaking heat wave that has battered the region. https://t.co/0boA7BCvt9",
  "data/tweet-nytimes/2021/8/1423372013549273088.json": "From the Greek islands to southern Turkey, extreme heat and dry conditions are driving devastating wildfires that have killed people and threatened homes, ancient heritage sites and tourist havens. Here's what it looks like. https://t.co/Obj7VNlx7Z https://t.co/BuWuQZn6bM",
  "data/tweet-nytimes/2021/8/1423350640319807488.json": "Forest fires in Turkey have continued for more than a week and forced thousands to evacuate their homes. President Recep Tayyip Erdogan has come under attack by his opponents over his handling of the disaster. https://t.co/DuEE0b1c1O https://t.co/QuFO2uL3gh",
  "data/tweet-nytimes/2021/8/1423384086291259392.json": "CNN fired three employees who violated its Covid safety protocols by going to the office unvaccinated, the company said Thursday. It's one of the first known examples of a major U.S. corporation terminating workers for ignoring a workplace vaccine mandate. https://t.co/wgkh1Pwy9i",
  "data/tweet-nytimes/2021/8/1423418569942081540.json": "Four Florida school systems say they'll keep or impose mask mandates, despite an executive order by Gov. Ron DeSantis, a Republican, that would take away funding from districts that did so. It's part of a trend of officials defying efforts to bar mandates. https://t.co/BZsmdN6ySW",
  "data/tweet-nytimes/2021/8/1423368226369679366.json": "A lawyer for Britney Spears has asked a court to accelerate the hearing on her request to remove her father, or to immediately suspend him, from the conservatorship that has controlled her life and finances for the last 13 years. https://t.co/p0fPYGRpi9",
  "data/tweet-nytimes/2021/8/1423400966557212682.json": "President Biden on Thursday signed a bill awarding the Congressional Gold Medal, the body’s highest expression of national appreciation, to a group of law enforcement officers who responded to the Jan. 6 attack on the Capitol. https://t.co/JaQld4BPhH",
  "data/tweet-nytimes/2021/8/1423453800002686976.json": "Gov. Phil Murphy of New Jersey is expected to announce on Friday that public school students, from kindergartners to seniors in high school, will have to wear masks when school resumes because of a recent surge of new cases of the coronavirus. https://t.co/IrbFAzVnih",
  "data/tweet-nytimes/2021/8/1423483192858841092.json": "April Ross and Alix Klineman of the U.S.🇺🇸 won gold in women's beach volleyball at #Tokyo2020. They beat Mariafe Artacho del Solar and Taliqua Clancy of Australia 🇦🇺.  https://t.co/4CMmPORXPP",
  "data/tweet-nytimes/2021/8/1423463877925380098.json": "A 9-year-old girl in Delhi was raped and killed by four men, who then cremated the body to hide evidence, her family said. The case has sparked fresh protests against the treatment of women and girls in India, especially those of lower castes.\nhttps://t.co/2xImrPNVhg",
  "data/tweet-nytimes/2021/8/1423287696705736704.json": "Nevin Harrison was the only American canoe or kayak sprinter to qualify for #Tokyo2020. She won a gold medal in the women’s canoe single 200 meters.\n\n“I didn’t have anyone to follow,” she said. “I hope to be that person for the next generation.”\nhttps://t.co/56SeSbujoJ",
  "data/tweet-nytimes/2021/8/1423328009642299399.json": "The J. Lo effect is hard to define but easy to identify. Generally speaking, it refers to the ways in which Jennifer Lopez defies human standards for beauty, success, age, flexibility, relevance, you name it.\nhttps://t.co/AqKo7gHiH4",
  "data/tweet-nytimes/2021/8/1423554496471441408.json": "From the Greek islands to southern Turkey, extreme heat and dry conditions are driving devastating wildfires that have killed people and threatened homes, ancient heritage sites and tourist havens. Here's what it looks like. https://t.co/uxxY8c1J9g https://t.co/ppuOP30Cti",
  "data/tweet-nytimes/2021/8/1423445063271604226.json": "Twenty years after Aaliyah, one of the most celebrated stars of '90s R&amp;B, died in a plane crash, her songs will be widely available on streaming platforms — starting with her second album, \"One in a Million,\" on August 20.\nhttps://t.co/CDKy2Lgj48",
  "data/tweet-nytimes/2021/8/1423489027144134657.json": "President Biden on Thursday signed a bill awarding the Congressional Gold Medal, the body’s highest expression of national appreciation, to a group of law enforcement officers who responded to the Jan. 6 attack on the Capitol. https://t.co/KErXpXlvNl",
  "data/tweet-nytimes/2021/8/1423478986626174977.json": "Allyson Felix's nine Olympic medals (six gold and three silver) have her tied with the Jamaican sprinter Merlene Ottey as the most decorated female Olympian in track and field. Felix runs in the 400-meter final on Friday. https://t.co/u6iF7zV43h https://t.co/0ZRRuULqlX",
  "data/tweet-nytimes/2021/8/1423293982390378502.json": "Bill Gates acknowledged that his relationship with Jeffrey Epstein was “a huge mistake” in an interview on CNN. The Microsoft founder also said that his divorce, which became final this week, was “a very sad milestone.”\nhttps://t.co/UUAN6o7sXz",
  "data/tweet-nytimes/2021/8/1423617380836646915.json": "United Airlines will require all U.S. employees to be vaccinated against the coronavirus starting this fall, the company said. It’s the first major airline to establish such a mandate.\n\nEmployees who do not comply will be fired. https://t.co/dq7nwAvS0X",
  "data/tweet-nytimes/2021/8/1423466863888044033.json": "Two coaches from Belarus have been stripped of their #Tokyo2020 credentials and expelled from the Games, the IOC said on Friday. They were involved in the attempt to force the Olympic sprinter Kristina Timanovskaya to return to Belarus against her will. https://t.co/D2uJXtKY4q",
  "data/tweet-nytimes/2021/8/1423619893094719492.json": "Italy introduced a nationwide health passport that will become a necessary part of life for residents seeking to socialize, work and travel.\n\nIt is one of Europe's most far-reaching measures and is supported by a majority of Italians, polls show.\nhttps://t.co/oJObWnRtnc",
  "data/tweet-nytimes/2021/8/1423609822566567936.json": "Four Florida school systems say they'll keep or impose mask mandates, despite an executive order by Gov. Ron DeSantis, a Republican, that would take away funding from districts that did so. It's part of a trend of officials defying efforts to bar mandates. https://t.co/WgNDGvB265",
  "data/tweet-nytimes/2021/8/1423607324413997063.json": "CNN fired three employees who violated its Covid safety protocols by going to the office unvaccinated, the company said Thursday. It's one of the first known examples of a major U.S. corporation terminating workers for ignoring a workplace vaccine mandate. https://t.co/lXU5gPQ7ci",
  "data/tweet-nytimes/2021/8/1423270076690702336.json": "Louisiana’s hospitals are overflowing, and the “darkest days” of its pandemic are driving more people to get vaccinated for Covid-19. But the state could still be weeks away from relief. https://t.co/63T5DmyxbW",
  "data/tweet-nytimes/2021/8/1423494087055978498.json": "Virginia will soon require state employees to be vaccinated against the coronavirus or be tested every week, joining a few other states that have imposed similar mandates, Gov. Ralph Northam said on Thursday.\nhttps://t.co/gYitbLsBZa",
  "data/tweet-nytimes/2021/8/1423663976156631044.json": "Breaking News: A woman who accused Gov. Andrew Cuomo of groping her last year has filed a criminal complaint, raising the possibility he may face criminal charges. https://t.co/YrdFdZtE8Y",
  "data/tweet-nytimes/2021/8/1423707956495933447.json": "California is now requiring all health care workers who work indoors with or near patients to be vaccinated against the coronavirus, largely removing an option that let unvaccinated employees submit to regular testing instead. https://t.co/Jsw82zfUIy",
  "data/tweet-nytimes/2021/8/1423737406583451653.json": "Major blazes in Greece are forcing evacuations and threatening historic sites amid a record-breaking heat wave.\n\nRead more: https://t.co/D5MgsYUtay https://t.co/BevpL7RCJ4",
  "data/tweet-nytimes/2021/8/1423735687673753608.json": "Scientists watching YouTube videos of birds stealing tufts of hair from living mammals, including humans, have dubbed the phenomenon “kleptorichy.” https://t.co/kONORtuLjI https://t.co/PiM95ApHDw",
  "data/tweet-nytimes/2021/8/1423746203511050243.json": "Breaking News: The U.S. Department of Education will extend the moratorium on federal student loan payments through Jan. 31. It had been set to expire next month. https://t.co/tVtcrDwVu6",
  "data/tweet-nytimes/2021/8/1423715532147154950.json": "The CDC recommends that people wear masks in indoor public places — regardless of their vaccination status — in parts of the U.S. with “substantial” or “high” coronavirus transmission rates.\n\nRight now, that covers nearly 2,800 counties in the U.S. https://t.co/yUoceARK8v",
  "data/tweet-nytimes/2021/8/1423736415519707136.json": "A judge in Arkansas on Friday temporarily blocked a state ban on mask mandates, a decision that will allow school districts and other government entities in the state to require face coverings to help curb the spread of new coronavirus infections. https://t.co/0obFP8MS0v",
  "data/tweet-nytimes/2021/8/1423752003050672138.json": "A single dose of the Covid-19 vaccine made by Johnson &amp; Johnson is highly effective in preventing severe illness and death from the Delta and Beta variants of the coronavirus, data from a clinical trial in South Africa suggest. https://t.co/qPzLOQ2vYB",
  "data/tweet-nytimes/2021/8/1423750786912247812.json": "Canada won its first gold medal in women's soccer on Friday at #Tokyo2020, making one of the team's starters, Quinn, the first openly transgender and nonbinary athlete to win an Olympic medal. https://t.co/ab9ipOaAx6 https://t.co/BA4KhPPk6d",
  "data/tweet-nytimes/2021/8/1423801087522480132.json": "\"Nobody thought I was going to be here. I’m a fighter.\"\n\nAllyson Felix won a bronze medal in the 400-meter race at #Tokyo2020 on Friday, her tenth medal overall. She's now tied with Carl Lewis as the most decorated American athlete in track and field. https://t.co/jPU94H0ZNU",
  "data/tweet-nytimes/2021/8/1423724330547097601.json": "Singapore pays its Olympians $740,000 for winning a gold medal, while Norwegian athletes may get a nice letter from the king. https://t.co/zMb7lB1gAk",
  "data/tweet-nytimes/2021/8/1423593453984915456.json": "A mayor in Japan apologized after biting an athlete’s gold medal as he stood in front of a backdrop promoting Covid safety precautions. He called his conduct “extremely inappropriate” after a backlash on social media.\nhttps://t.co/ZSv7UlElKE",
  "data/tweet-nytimes/2021/8/1423743944895221774.json": "When Barack Obama significantly scaled back the guest list for his party on Martha's Vineyard this weekend, it forced some choices on who would still be invited.\n\nJay-Z and Beyoncé were in, as of Friday at least. But David Axelrod and Larry David were out. https://t.co/o2NuAAiYhm",
  "data/tweet-nytimes/2021/8/1423760812666232832.json": "“It’s like showing you have a conscience,” said Margherita Catenuto,18, from Sicily, as she showed a barcode that certified she was vaccinated. “You do it for yourself, and you do it for others. It’s very sensible.” https://t.co/HZpSHa1rZt",
  "data/tweet-nytimes/2021/8/1423822546928013316.json": "Allyson Felix 🇺🇸 won bronze in the women's 400-meter race at #Tokyo2020, matching Carl Lewis as the most decorated American track and field athlete. Felix has won medals in every Summer Games since 2004. https://t.co/dGNUzGmTQd https://t.co/hN3Twab3XM",
  "data/tweet-nytimes/2021/8/1423767189132353537.json": "Unvaccinated adults who had been infected with the coronavirus may be more than twice as likely to get infected again than those who tested positive and then got vaccinated, according to a new small study. https://t.co/2Bt7KmiVaK",
  "data/tweet-nytimes/2021/8/1423863491052679173.json": "The United States beat France to win its fourth straight gold medal in men’s basketball. Kevin Durant led the Americans with 29 points. https://t.co/7xrec18az3",
  "data/tweet-nytimes/2021/8/1423770892052598784.json": "Some of the hundreds of thousands of bikers expected for the annual motorcycle rally have started to arrive in Sturgis, South Dakota. The rally is going on despite warnings from government officials about coronavirus cases and the Delta variant. https://t.co/oG7z1GTc1x https://t.co/bJ7OwJ3Y0O",
  "data/tweet-nytimes/2021/8/1423879112301727744.json": "Kevin Durant 🇺🇸 led the U.S. men's basketball team to gold at #Tokyo2020 on Saturday, the country's 16th gold medal in the event. Durant had 29 points and 6 rebounds. https://t.co/ikmOqXo5HO https://t.co/zPlcYEopAi",
  "data/tweet-nytimes/2021/8/1423808631536033793.json": "Gov. Ron DeSantis of Florida has been unyielding in his approach to the pandemic, refusing to change course or impose restrictions despite uncontrolled spread of the coronavirus and spiking hospitalizations across the state. https://t.co/aL3vlAqGor",
  "data/tweet-nytimes/2021/8/1423969909470633990.json": "Sifan Hassan 🇳🇱 is the first athlete to medal in all three track events at one #Olympics: the 1,500, the 5,000 and the 10,000 meters. https://t.co/auB7FnHpmc https://t.co/Qh9XjE8Oqo",
  "data/tweet-nytimes/2021/8/1423986462358478851.json": "Allyson Felix 🇺🇸 has won her 11th Olympic medal, making her the most decorated American Olympian in track and field, surpassing the 10 medals won by Carl Lewis. #Tokyo2020 #Olympics https://t.co/DHYsh3joXg",
  "data/tweet-nytimes/2021/8/1423984821982973962.json": "Jessica Springsteen, daughter of Bruce Springsteen, is now an Olympic medalist after winning silver with the U.S. show jumping team. #Tokyo2020 #Olympics https://t.co/yJirJwHZ8a",
  "data/tweet-nytimes/2021/8/1423924402547200004.json": "“It’s like showing you have a conscience,” said Margherita Catenuto,18, from Sicily, as she showed a barcode that certified she was vaccinated. “You do it for yourself, and you do it for others. It’s very sensible.” https://t.co/H1NAx7UeJ3",
  "data/tweet-nytimes/2021/8/1423821220009680902.json": "Barry the Barred Owl, whose majestic presence and unusually extroverted demeanor made her a beloved Central Park celebrity, died early Friday in a collision with a Central Park Conservancy maintenance vehicle.\nhttps://t.co/YmKzDGwZ3O",
  "data/tweet-nytimes/2021/8/1423998811689607168.json": "Breaking News: Japan beat the U.S., 2-0, to win its first gold medal in baseball, a sport brought back for these #Olympics because of Japan’s devotion to it. https://t.co/BcKegoIs4B",
  "data/tweet-nytimes/2021/8/1423982273439862787.json": "A growing number of companies are crafting vaccination policies to bring employees safely back to the office. Unvaccinated workers run the risk of being ostracized — or fired. https://t.co/NRsUj30OJg",
  "data/tweet-nytimes/2021/8/1424027588301836290.json": "Unvaccinated people who have had Covid-19 may be more than twice as likely to get infected again than those who tested positive and bolstered their natural immunity with a vaccine, according to a small study published by the CDC. https://t.co/8hBHS6eM16",
  "data/tweet-nytimes/2021/8/1423997384053465092.json": "Singapore pays its Olympians $740,000 for winning a gold medal, while Norwegian athletes may get a nice letter from the king. https://t.co/oaJSMPnevc",
  "data/tweet-nytimes/2021/8/1423909315245748228.json": "The megaflood that killed 189 people in western Germany last month has brought home the realization that climate change is here, and it has forced a painful recognition that many bad decisions over decades have made things worse. https://t.co/4NdElFM8kH",
  "data/tweet-nytimes/2021/8/1423714037909569545.json": "116,000 Native American remains are held by museums and other institutions around the country. But the U.S. government now intends to give tribes more power to reclaim them.\nhttps://t.co/umWp3swcKz",
  "data/tweet-nytimes/2021/8/1424067953629319169.json": "Watch: Flames tore through the coastline of Evia, a Greek island, causing residents and tourists to evacuate by ferry, as southern Europe grapples with one of its worst heat waves in decades. https://t.co/pUA0iVMIsC https://t.co/4LbprwjvcK",
  "data/tweet-nytimes/2021/8/1424020718224875528.json": "Donald Trump and the Republican Party returned $12.8 million to donors in the first half of the year, showing just how many online donors were ensnared by their aggressive fund-raising tactic of prechecking a box for recurring contributions on their forms. https://t.co/9yJRDGYS65",
  "data/tweet-nytimes/2021/8/1424093010019725312.json": "For many decades, researchers believed giraffes were barely capable of maintaining the most casual relationships. But recently, a different social picture has begun to emerge: one of yearslong bonds, lunch dates, mourning and family ties 🦒 https://t.co/zlrDlpTCzu",
  "data/tweet-nytimes/2021/8/1424062809143484416.json": "In her final race as an Olympian, and on the final night of track and field at the Tokyo Games, Allyson Felix went out as a champion, saving her crowning achievement for last. https://t.co/FKRNX0HrQM",
  "data/tweet-nytimes/2021/8/1424118169417945090.json": "Cuneiform tablets and thousands of other looted archaeological artifacts were returned to Iraq this week after being held for years by Cornell University and the Museum of the Bible, which was founded by the family that owns the Hobby Lobby chain. https://t.co/EvaMJqwsnh",
  "data/tweet-nytimes/2021/8/1424178559346790403.json": "Even the most elite gymnasts are no match for the average squirrel. https://t.co/GIWk4Vn8ZU",
  "data/tweet-nytimes/2021/8/1424183600136794114.json": "The protection offered by Moderna’s Covid vaccine does not wane in the first six months after the second dose, the company said in a statement.\n\nThe data came from a new analysis of its clinical trial, which started last year. https://t.co/ziiUf6itFM",
  "data/tweet-nytimes/2021/8/1424222144519720960.json": "Breaking News: The U.S. women’s basketball team capped its dominant run at the Olympics with a rout of Japan, 90-75, for its seventh consecutive gold medal. https://t.co/8XPu2Z6Ral",
  "data/tweet-nytimes/2021/8/1423994944163811337.json": "Michael Joseph Vaughan, a 5-year-old whose family calls him Monkey, was last seen on July 27 near his home in Fruitland, Idaho. Police say they have no leads. https://t.co/QYQKDlViBy",
  "data/tweet-nytimes/2021/8/1424302801988034568.json": "With 39🥇, the United States won the most gold medals at the #Tokyo2020 #Olympics. China came in second with 38 golds and Japan came in third with 27 golds. https://t.co/Wog99uun4u https://t.co/n5ethDOO2W",
  "data/tweet-nytimes/2021/8/1424311938385858565.json": "Some of us might have full-on burnout after a year-plus of loss, grief and pandemic challenges. Here are some ways to get your motivation back. https://t.co/ig1RKsHx1s https://t.co/2BRw7lAyxp",
  "data/tweet-nytimes/2021/8/1424045188771627010.json": "Trump tried to kill the infrastructure bill with the kind of threats that once sent chills down Republican spines. This time, they aren't as easily intimidated.\n\nWhy some GOP lawmakers are willing to cross him to deliver President Biden a win: https://t.co/XdTT4P0hBc",
  "data/tweet-nytimes/2021/8/1424284603758661634.json": "Breaking News: The Taliban have overrun Kunduz, a city in northern Afghanistan that would be a significant military and political prize for the insurgents. https://t.co/MqWiBs8OSz",
  "data/tweet-nytimes/2021/8/1424347185085304833.json": "With five Olympic Games under her belt, Allyson Felix’s 11th medal on Saturday made her the most decorated American track-and-field athlete in Olympic history. https://t.co/jFKyEgyiez",
  "data/tweet-nytimes/2021/8/1424133280379641864.json": "Masks will likely remain a part of our lives for some time. @wirecutter has tried 35 types and confirmed their filtration claims with government agencies or its own lab testing to identify reliable N95, KN95, and surgical masks. https://t.co/5Ev7vDmtua",
  "data/tweet-nytimes/2021/8/1424372597052039171.json": "We debunk a widely circulated video that purports to show a deputy overdosing at the mere exposure of fentanyl while responding to a call. Medical experts said the video promoted a false narrative about fentanyl and ways it can lead to an overdose. https://t.co/xySAIfGoCH",
  "data/tweet-nytimes/2021/8/1424153389940752391.json": "The J. Lo effect is hard to define but easy to identify. Generally speaking, it refers to the ways in which Jennifer Lopez defies human standards for beauty, success, age, flexibility, relevance, you name it. https://t.co/KccW7OTDLw",
  "data/tweet-nytimes/2021/8/1424394989551894536.json": "Jeffrey A. Rosen, former President Trump’s acting attorney general, told the Justice Department watchdog and congressional investigators on Friday that one of his deputies tried to help Mr. Trump subvert the results of the 2020 election. https://t.co/2KRNy4S23d",
  "data/tweet-nytimes/2021/8/1424316982975995904.json": "In a new study, one-third of Covid patients age 65 and older were more likely to have arrived at the hospital with atypical symptoms, including confusion, forgetfulness, fatigue, weakness and difficulty walking. https://t.co/V7EbigsAHg",
  "data/tweet-nytimes/2021/8/1424452899011182595.json": "Governor Asa Hutchinson of Arkansas said Sunday that he had made a mistake in signing a law banning mask mandates in his state.\n\n“It was an error to sign that law. I admit that.\" https://t.co/ybjfybUzj1",
  "data/tweet-nytimes/2021/8/1424413852670828553.json": "Karen Hastie Williams became the first Black woman to serve as a Supreme Court clerk when she went to work for Thurgood Marshall in 1974. She went on to break countless other glass ceilings, while helping others do the same. She has died at 76. https://t.co/eYsSHYel1o",
  "data/tweet-nytimes/2021/8/1424470497551654918.json": "If Governor Andrew Cuomo steps down or is forced out, his lieutenant governor, Kathy Hochul, 62, will take his place, becoming the first woman to lead New York State. https://t.co/abYYU1dj70",
  "data/tweet-nytimes/2021/8/1424480548622381058.json": "In Opinion\n\n\"It is a luxury to be irresponsible in a society where others would be responsible for you,\" @CharlesMBlow writes, \"where you simply assumed that you were safer because others took the appropriate precautions to be safe.\" https://t.co/wtAbQR4NvF",
  "data/tweet-nytimes/2021/8/1424490663551373317.json": "“Am I going to be able to be a good student ever again? Because this is really scary.”\n\nThe lingering physical, mental and neurological symptoms of long Covid are affecting children as well as adults, including many who had mild cases. https://t.co/AEFF8Ye9bD",
  "data/tweet-nytimes/2021/8/1424530892031238145.json": "\"I told myself, 'If they shoot me first, they’ll stop there and won’t hit my son.'\"\n\nA Black real estate agent and his clients were handcuffed by police at a house viewing after a neighbor called the police. https://t.co/2rjFUeyhsL",
  "data/tweet-nytimes/2021/8/1424558580049530885.json": "A federal judge on Sunday ruled to allow Norwegian Cruise Line to require proof of vaccination from passengers despite a Florida law that bans businesses from doing so. https://t.co/PPl285qnQL",
  "data/tweet-nytimes/2021/8/1424552841843257345.json": "Breaking News: Melissa DeRosa, Governor Andrew Cuomo’s top aide, has resigned, less than a week after the New York State attorney general released a report concluding Cuomo had sexually harassed 11 women. https://t.co/dIinyb4YBt",
  "data/tweet-nytimes/2021/8/1424540945819881474.json": "As a girl, Jane Withers landed leading roles that were the antidote to Shirley Temple’s. As an adult, she was known as Josephine the Plumber in ads for Comet cleanser. She died at at 95. https://t.co/uT9jgxlL42",
  "data/tweet-nytimes/2021/8/1424643082532839424.json": "Breaking News: Some devastating impacts of global warming are now unavoidable, a major UN report found. But there is still time to stop things from getting even worse.\nhttps://t.co/ZlUqyLSg0X",
  "data/tweet-nytimes/2021/8/1424668045515972610.json": "Global warming will get progressively worse and cannot be stopped over the next 30 years, a major new UN report has concluded, because the world's nations delayed so long in curbing emissions. A hotter future is now essentially locked in.\nhttps://t.co/tMnu8VJMpo",
  "data/tweet-nytimes/2021/8/1424468459258318852.json": "The executive assistant who accused Governor Andrew Cuomo of repeatedly groping her and who filed a criminal complaint against him has come forward in an interview to be aired on Monday. https://t.co/2YOfAmKmDc",
  "data/tweet-nytimes/2021/8/1424686965144920066.json": "A federal judge on Sunday ruled to allow Norwegian Cruise Line to require proof of vaccination from passengers despite a Florida law that bans businesses from doing so. https://t.co/2KwqNFe7OR",
  "data/tweet-nytimes/2021/8/1424725479467200517.json": "Breaking News: Democrats unveiled a $3.5 trillion budget that would start work on the most significant change to the social safety net since the Great Society.\nhttps://t.co/LG9wioAPoW",
  "data/tweet-nytimes/2021/8/1424148370315169799.json": "A diet high in omega-3s, the fats found in fish, and low in omega-6s, found in many vegetable oils, led to fewer headaches. https://t.co/XLP82Z7KFf",
  "data/tweet-nytimes/2021/8/1424751118056411137.json": "Families with high-risk children who can’t be vaccinated are increasingly concerned over the Delta variant. Parents are sharing their stories in a desperate attempt to convince the unvaccinated to get inoculated, for the sake of their children. https://t.co/aOyDnNXttP",
  "data/tweet-nytimes/2021/8/1424767452769103874.json": "Some devastating impacts of global warming are now unavoidable, a major new scientific report released on Monday found. But there is still a short window to stop things from getting even worse. https://t.co/GgLNMN4ZwH https://t.co/S3vjHEdJqJ",
  "data/tweet-nytimes/2021/8/1424773750759829507.json": "Charles Loeb, a pioneering Black war correspondent, defied propaganda from the U.S. military with an article that showed how deadly radiation from the atomic strike on Hiroshima sickened and killed.\n\nHis insights were lost to history — until now. https://t.co/TiBm43Fj7g",
  "data/tweet-nytimes/2021/8/1424800203736068099.json": "Senator Elizabeth Warren, Democrat of Massachusetts, will propose a minimum tax of 7% on the profits of the richest companies over $100 million based on the earnings they report to investors, not what they claim to the IRS.\nhttps://t.co/4Ox117djgj",
  "data/tweet-nytimes/2021/8/1424795611463921671.json": "Breaking News: Defense Secretary Lloyd Austin will seek to order mandatory coronavirus vaccines for 1.3 million active duty U.S. troops by mid-September, administration officials said on Monday. https://t.co/BUeIyljH37",
  "data/tweet-nytimes/2021/8/1424822829447536648.json": "The catastrophic fires that have been raging in Greece have entered a second week.\n\nEvia, the country's second largest island, has borne the brunt of the flames. Residents of some villages have defied government calls for them to abandon their homes. https://t.co/Ls7TOvd3QI https://t.co/w74rSWKOsG",
  "data/tweet-nytimes/2021/8/1424758655417737218.json": "Texas schools are preparing to reopen as there has been a 134% increase in Covid cases in the state over the last two weeks. But Gov. Greg Abbott is refusing to enact any mandates for masks and vaccines and prohibiting local officials from doing so. https://t.co/xGtDOH2TXF",
  "data/tweet-nytimes/2021/8/1424845471697231874.json": "A Dallas school district announced that everyone — students, employees and visitors — must wear a mask while on school property starting Tuesday, defying an executive order by Gov. Greg Abbott that bans school districts from requiring masks. https://t.co/mJs2hLTcvW",
  "data/tweet-nytimes/2021/8/1424850536671682563.json": "Most state employees and all health care workers in Washington State must be fully vaccinated against the coronavirus by Oct. 18 or risk losing their jobs, Gov. Jay Inslee announced on Monday. https://t.co/HMCNroxLXA",
  "data/tweet-nytimes/2021/8/1424561092362002435.json": "If Governor Andrew Cuomo steps down or is forced out, his lieutenant governor, Kathy Hochul, 62, will take his place, becoming the first woman to lead New York State. https://t.co/bH6LJmqxXn",
  "data/tweet-nytimes/2021/8/1424864347487186953.json": "Virginia Giuffre, one of Jeffrey Epstein's most prominent accusers, has filed a lawsuit against Prince Andrew saying that he sexually abused her when she was 17, according to court documents. https://t.co/Sm6X1MCmmg",
  "data/tweet-nytimes/2021/8/1424807747632128000.json": "A virologist who said the Trump administration retaliated against him last year by ousting him from his job has settled a whistle-blower complaint against the government, his lawyer said. The scientist, Rick Bright, will receive back pay and compensation.  https://t.co/PrdbKxAkwk",
  "data/tweet-nytimes/2021/8/1424893278424600577.json": "Two men, convicted in separate cases, spent more than three decades in prison. They were freed on Monday, found to have been unjustly convicted.\n\nThe reversal follows several other recent exonerations of Black men in murder cases dating back to the 1990s. https://t.co/X49UtDRtPl",
  "data/tweet-nytimes/2021/8/1424888260631875585.json": "Smoke from the Dixie Fire in California is turning the air in Salt Lake City and Denver into some of the dirtiest in the world, as megafires in the western U.S. leave a footprint much larger than the forests and towns they decimate. https://t.co/Ks27Uw5Xoo",
  "data/tweet-nytimes/2021/8/1424762437006417925.json": "A confluence of factors — including Delta’s contagiousness and the fact that people under 12 are not yet eligible to be vaccinated — is sending more children to the hospital, especially in areas of the U.S. where the virus is surging. https://t.co/lpuQLMwT2N",
  "data/tweet-nytimes/2021/8/1424966262585692161.json": "This cake is summer in a loaf pan. Have it as dessert or a snack, but it’s especially good at breakfast with hot coffee or tea. https://t.co/wsI1SIWcT6",
  "data/tweet-nytimes/2021/8/1425018864585388032.json": "Daniela Espirito Santo, 23, died after being assaulted by her boyfriend. She'd reported him seven times, but her cries for help went unanswered.\n\nHer story is an example of the British justice system's failure to protect women. \nhttps://t.co/4aFOY22C7J",
  "data/tweet-nytimes/2021/8/1425098365327577089.json": "Twitter suspended Rep. Marjorie Taylor Greene for seven days for violating the platform’s coronavirus misinformation policy. It's her fourth “strike,” Twitter said, which means she could be permanently barred if she violates the misinformation policy again.https://t.co/y61HpdmJOB",
  "data/tweet-nytimes/2021/8/1425105299367661585.json": "Breaking News: Lionel Messi has signed a two-year contract with Paris St.-Germain, the French powerhouse bankrolled by the state of Qatar, days after leaving F.C. Barcelona. The deal highlights the growing gap between soccer’s rich and its superrich.\nhttps://t.co/GN4k9ijzNf",
  "data/tweet-nytimes/2021/8/1425130385004974086.json": "Gov. Andrew Cuomo of New York announced his resignation, effective in 14 days, a week after the state attorney general’s office found he had sexually harassed nearly a dozen women. Lt. Gov. Kathy Hochul will become the state's first female governor. https://t.co/we1tpDKj0m https://t.co/3K0MmGmU0p",
  "data/tweet-nytimes/2021/8/1425128195448315923.json": "Breaking News: Gov. Andrew Cuomo of New York said he is resigning, ending a decade-long run in disgrace after the state attorney general’s office found he had sexually harassed nearly a dozen women. https://t.co/QF4IdgLhZV",
  "data/tweet-nytimes/2021/8/1425118644858675200.json": "Breaking News: The Senate has enough votes to pass the $1 trillion infrastructure bill, the largest federal investment in America's aging public works system in over a decade and a key part of President Biden's agenda. It faces a rocky path in the House.\nhttps://t.co/i0IAAJ1Q9Y",
  "data/tweet-nytimes/2021/8/1425136467605524481.json": "Lt. Gov. Kathy Hochul, a Democrat, will replace Andrew Cuomo after his resignation, which was spurred by an investigation that found he had sexually harassed nearly a dozen women. She will become New York's first female governor. https://t.co/jPuX85muFO https://t.co/hyUatyuSlG",
  "data/tweet-nytimes/2021/8/1425143677018677257.json": "Gov. Andrew Cuomo of New York said Tuesday he would resign from office, succumbing to a ballooning sexual harassment scandal that led most of his allies to abandon him. He said his resignation would take effect in 14 days. https://t.co/KB1Jk4oIy1 https://t.co/uiYxJXgfFD",
  "data/tweet-nytimes/2021/8/1425141169110110211.json": "One year ago, Gov. Andrew Cuomo of New York was hailed as a national leader during the pandemic. Now he is resigning in one of the most stunning falls in modern American politics. https://t.co/XIYBzO1fMT https://t.co/9O69cZ9KAw",
  "data/tweet-nytimes/2021/8/1425202829711511554.json": "Twitter suspended Rep. Marjorie Taylor Greene for seven days for violating the platform’s coronavirus misinformation policy. It's her fourth \"strike,\" Twitter said, which means she could be permanently barred if she violates the misinformation policy again.https://t.co/Thd3bYFJdO https://t.co/mDmapstlue",
  "data/tweet-nytimes/2021/8/1425197801458262020.json": "Lionel Messi’s two-year contract with PSG, the French soccer club bankrolled by the state of Qatar, includes a third option year, according to a team official. It will pay him about $41 million a season — much less than he earned at Barcelona. https://t.co/rjbzXsXa7U https://t.co/GqHch0ORYm",
  "data/tweet-nytimes/2021/8/1425146208926978053.json": "Right-wing television networks Newsmax and One America News have been sued for defamation by an election technology company that became a target of a baseless pro-Trump conspiracy theory about rigged voting machines. https://t.co/TNMh9PscbR",
  "data/tweet-nytimes/2021/8/1425235541059067907.json": "President Biden nominated Damian Williams as the U.S. attorney for Manhattan on Tuesday. Williams would be the first Black man to lead one of the most powerful prosecutor's offices in the country. https://t.co/sg7YD41umh",
  "data/tweet-nytimes/2021/8/1425241822981464068.json": "Oregon is preparing to restore a statewide mandate on Wednesday, ordering both vaccinated and unvaccinated people to use face coverings when gathering indoors. https://t.co/VrGIxLmIhr",
  "data/tweet-nytimes/2021/8/1424909638168875009.json": "A former Los Angeles police officer who shot and killed a mentally disabled man inside a Costco store in 2019 was arrested on Monday and charged with manslaughter and assault. https://t.co/XtHfyPzYcR",
  "data/tweet-nytimes/2021/8/1425289667147075584.json": "The front page of The New York Times for Aug. 11, 2021. https://t.co/mCr0FptUfH",
  "data/tweet-nytimes/2021/8/1425214144240918529.json": "\"Lionel Messi, the best of all time, does not have true agency over where he plays his final few years,\" @RorySmith writes. \"Even he was not able to resist the economic forces that carry the game along.\" https://t.co/fPyLcEe2kF",
  "data/tweet-nytimes/2021/8/1425309764821606405.json": "Hawaii is reimposing restrictions to try to curb a recent surge in coronavirus cases. Social gatherings will now be limited to no more than 10 people indoors and 25 people outdoors, and indoor venues, including restaurants, will be capped at 50% capacity. https://t.co/iZqTCcy5BK",
  "data/tweet-nytimes/2021/8/1425343766119002117.json": "President Jair Bolsonaro is attacking Brazil’s longstanding electronic voting system as he faces the prospect of a crushing defeat at the polls next year. His crusade is drawing comparisons to Donald Trump's efforts to undermine the 2020 U.S. election. https://t.co/lRboPttNSz",
  "data/tweet-nytimes/2021/8/1425370169401122818.json": "YouTube removed a video by Sen. Rand Paul and suspended his account for a week after he posted a clip that the company said violated its policy on Covid-19 misinformation.\nhttps://t.co/pbERv6v2Aw",
  "data/tweet-nytimes/2021/8/1425368272967512071.json": "Breaking News: The Senate approved a $3.5 trillion budget plan along party lines that would fund climate initiatives and health care while raising taxes on the wealthy.\nhttps://t.co/fGPtKvofXu",
  "data/tweet-nytimes/2021/8/1425288385388851203.json": "Breaking News: China sentenced Michael Spavor, a Canadian businessman, to 11 years in prison, in a case that is widely seen as retaliation for the detention of a Huawei executive. https://t.co/Hv4Amhixdt",
  "data/tweet-nytimes/2021/8/1425411711302053891.json": "YouTube removed a video by Sen. Rand Paul and suspended his account for a week after he posted a clip that the company said violated its policy on Covid-19 misinformation.\nhttps://t.co/rlmz8kr61E",
  "data/tweet-nytimes/2021/8/1425207888017072131.json": "Serious coronavirus infections among vaccinated people have been uncommon since the start of the vaccination campaign, a New York Times analysis of data from 40 states and Washington, D.C., shows.\n\nSee more of the data here. https://t.co/NfpUPOJp2o",
  "data/tweet-nytimes/2021/8/1425504216165097476.json": "Breaking News: \"Jeopardy!\" announced that it would have two hosts to succeed Alex Trebek: Mike Richards, the show's executive producer, and Mayim Bialik, the actress and neuroscientist known for her roles in \"The Big Bang Theory\" and “Blossom.\" https://t.co/EkhDa47mFN",
  "data/tweet-nytimes/2021/8/1425513882240618509.json": "Breaking News: The CDC strengthened its recommendation that pregnant people be vaccinated against Covid-19, pointing to new safety data that found no increased risk of miscarriage among those immunized during the first 20 weeks of gestation. https://t.co/QcwzUXNIqi",
  "data/tweet-nytimes/2021/8/1425522889575501825.json": "Breaking News: California will require all school teachers and staff to be fully vaccinated or be tested regularly, the governor said. It is the first state to do so. https://t.co/Kl0EgV2sUu",
  "data/tweet-nytimes/2021/8/1425517411852328962.json": "Mayim Bialik, who is known for her roles in the sitcoms “The Big Bang Theory” and “Blossom,” will be the first woman to be a permanent host of “Jeopardy!” Her role will include hosting a new college championship tournament set to air next year on ABC. https://t.co/jCfTsoFr2X https://t.co/hATmTozBsq",
  "data/tweet-nytimes/2021/8/1425450691682779138.json": "Thousands of people who were vaccinated against the coronavirus at an inoculation center in Germany have been asked to get a third shot after a nurse admitted to replacing the contents of a vial with a saline solution.\nhttps://t.co/jjEuIuL6lj",
  "data/tweet-nytimes/2021/8/1425560170726313989.json": "A program offering New York City residents $100 in exchange for a Covid vaccine has helped raise vaccination rates in the city. Here's what our reporter saw at vaccine sites. https://t.co/i73F4h1Z9v",
  "data/tweet-nytimes/2021/8/1425570250515488774.json": "A former U.S. attorney in Atlanta said his abrupt resignation in January was prompted by a warning that Donald Trump intended to fire him for refusing to say that widespread voter fraud had been found in Georgia. https://t.co/QKQ4Ohmj2d",
  "data/tweet-nytimes/2021/8/1425590373167075330.json": "In just 58,848 days — on Sept. 24, 2182 — NASA scientists say an asteroid the size of the Empire State Building has a slight chance of hitting Earth. https://t.co/sXjeP088DA",
  "data/tweet-nytimes/2021/8/1425635670052179971.json": "Breaking News: The FDA is expected to authorize a third shot of the Pfizer and Moderna vaccines as soon as Thursday for certain people with weakened immune systems, an effort to better protect them as the highly contagious Delta variant sweeps the U.S. https://t.co/yBMbLkGDid",
  "data/tweet-nytimes/2021/8/1425626864006090756.json": "Wisconsin officials authorized the killing of 300 wolves as part of a hunt this fall, far exceeding the recommendations of its own biologists for the once-protected species and drawing criticism from conservationists. https://t.co/3kBpPprme3",
  "data/tweet-nytimes/2021/8/1425373951304388611.json": "Starting as a teenager, Romal Noori risked his life aiding the U.S. war effort in Afghanistan.\n\nWith American troops leaving and the Taliban regaining power, watch how his life has changed. https://t.co/tBVGe2gJFG",
  "data/tweet-nytimes/2021/8/1425743880838844422.json": "Sept. 24, 2182, mark your calendars. https://t.co/doajWCnQJB",
  "data/tweet-nytimes/2021/8/1425765509430132739.json": "A California surfing instructor confessed to killing his two children with a spearfishing gun after abducting them and traveling to Mexico. He told investigators that his belief in the conspiracy theories known as QAnon made him do it, the authorities said.https://t.co/J15pHqp2I3",
  "data/tweet-nytimes/2021/8/1425536289940590604.json": "Why did the universe not destroy itself in the Big Bang, in a collision of matter and antimatter? For the Nobel laureate Toshihide Maskawa, a eureka moment in the bathtub led to an answer. He has died at 81. https://t.co/NWgpwqknmx",
  "data/tweet-nytimes/2021/8/1425587884573200387.json": "Dolly Parton and James Patterson are teaming up: \"Run, Rose, Run,\" a novel inspired by Parton's experiences, is slated for a 2022 release. Parton will also simultaneously release an album based on the book.\nhttps://t.co/aZYMDDbdwZ",
  "data/tweet-nytimes/2021/8/1425845811364118530.json": "In a simulation, we modeled Delta-driven Covid outbreaks in two communities, one with a high vaccination rate and another with a low rate. Their levels of serious illness and death were starkly different.\n\nHere's how vaccines can make a difference. https://t.co/McaTQ8rZ9V",
  "data/tweet-nytimes/2021/8/1425751435782803461.json": "New Zealand set out a cautious plan for reopening.\n\nPrime Minister Jacinda Ardern said the country's border restrictions would ease starting early next year, allowing vaccinated travelers from low-risk countries to enter without having to quarantine.\nhttps://t.co/QV5s7LFslr",
  "data/tweet-nytimes/2021/8/1425634408460169221.json": "Those who are pregnant should get vaccinated against Covid-19, the CDC recommended on Wednesday. New research shows the shots do not increase risk of miscarriage, the agency said. https://t.co/RQCQqb6bhI",
  "data/tweet-nytimes/2021/8/1425630651307413514.json": "Across Texas, health officials warned of a growing crisis not seen in months, with more than 10,000 people hospitalized and intensive care units stretched thin.\n\n\"I am frightened by what is coming,\" a top official said. https://t.co/5czPC3590D",
  "data/tweet-nytimes/2021/8/1425838270471151617.json": "After her last album, Lorde took four years for herself. Her phone, set to grayscale, has no internet browser; she is locked out of her social media apps, with others handling the passwords; and a coder friend even made YouTube inaccessible on her laptop. https://t.co/eO2JgZI95o",
  "data/tweet-nytimes/2021/8/1425854634166456331.json": "Watch: A Texas judge ordered indoor mask-wearing in the Dallas area after rising coronavirus cases fueled by the Delta variant brought the levels of virus transmission and hospitalizations to those seen during the height of the pandemic. https://t.co/U09FY3uTer https://t.co/7nuObnFqbK",
  "data/tweet-nytimes/2021/8/1425878518127382533.json": "Breaking News: America’s largest teachers’ union offered its support for policies that would require all teachers to be vaccinated or submit to regular testing. https://t.co/TwjS5QGzAi",
  "data/tweet-nytimes/2021/8/1425794234825719809.json": "Norway’s women’s beach handball team was fined for wearing shorts instead of bikini bottoms, prompting outrage and calls for a change to the rules.\n\nThe sport’s governing body, facing growing pressure, said a change was “very likely.”\nhttps://t.co/ZpRUrfH1Dw",
  "data/tweet-nytimes/2021/8/1425887374521810954.json": "Breaking News: The Census Bureau said America has grown far more diverse in the last decade, and reported the first recorded drop in the non-Hispanic white population. https://t.co/IuhAT0b0f6",
  "data/tweet-nytimes/2021/8/1425835559042183184.json": "Only 27% of young Black New Yorkers are fully vaccinated, data shows. Many say they fear that during these uncertain times they could not trust the government with their health.\n\n“This is a major public health failure,” said an epidemiologist. https://t.co/vximyBNdqp",
  "data/tweet-nytimes/2021/8/1425415467733225472.json": "The Senate approved a $3.5 trillion budget plan along party lines that would fund climate initiatives and health care while raising taxes on the wealthy.\nhttps://t.co/Fm5b9cEfXF",
  "data/tweet-nytimes/2021/8/1425935453329440771.json": "Breaking News: Britney Spears's father, Jaime Spears, said he would eventually step aside from the conservatorship that she has called abusive and seek \"an orderly transition to a new conservator.\" https://t.co/JVggm8acLw",
  "data/tweet-nytimes/2021/8/1425942641515110400.json": "Breaking News: The Supreme Court allowed Indiana University to require students to be vaccinated against the coronavirus. https://t.co/GKUXBk7bZc",
  "data/tweet-nytimes/2021/8/1425940669022019590.json": "Breaking News: Britney Spears's father, James Spears, said he would eventually step aside from the conservatorship that she has called abusive and seek \"an orderly transition to a new conservator.\" https://t.co/s8mmzqH3mM",
  "data/tweet-nytimes/2021/8/1425928847044882436.json": "The Pentagon is moving thousands of Marines into position for a possible evacuation of the American Embassy and U.S. citizens in Kabul as the Biden administration braces for a possible collapse of the Afghan government within 30 days, officials said. https://t.co/DLdZlvPjNq",
  "data/tweet-nytimes/2021/8/1425979180836139017.json": "San Francisco will impose some of the toughest restrictions on unvaccinated people in the U.S., barring them from indoor dining, bars, gyms and more. https://t.co/rzzUVNFYuP",
  "data/tweet-nytimes/2021/8/1425965347497259008.json": "President Biden encouraged wearing masks in American schools on Thursday, saying \"this isn’t about politics, this is about keeping our children safe.\"\n\nRead more updates on the virus: https://t.co/0UWzElX1o5 https://t.co/a89hycVMmZ",
  "data/tweet-nytimes/2021/8/1425962850082770945.json": "For years, technologists have predicted the rise of the “metaverse,” an all-encompassing digital world that will eventually have its own forms of identity, community and governance. Our tech columnist @kevinroose got a taste of it through Pudgy Penguins. https://t.co/D69pCCC46X",
  "data/tweet-nytimes/2021/8/1426022690343858184.json": "Breaking News: The FDA authorized third doses of Pfizer-BioNTech’s and Moderna’s Covid-19 vaccines for some people with weakened immune systems. https://t.co/2gH1EJY9C9",
  "data/tweet-nytimes/2021/8/1425855870957768710.json": "The U.S. Embassy in Kabul urged Americans who were not working for the U.S. government to leave Afghanistan immediately, as American negotiators try to get assurances from the Taliban that they will not attack the embassy if the capital is overrun. https://t.co/YECnnvI8Y8",
  "data/tweet-nytimes/2021/8/1426053423036776451.json": "In a simulation, we modeled Delta-driven Covid outbreaks in two communities, one with a high vaccination rate and another with a low rate. Their levels of serious illness and death were starkly different.\n\nHere's how vaccines can make a difference. https://t.co/6kHrUJaTGo",
  "data/tweet-nytimes/2021/8/1426023978833952769.json": "The FDA on Thursday authorized third doses of Pfizer-BioNTech’s and Moderna’s coronavirus vaccines for some people with weakened immune systems, giving physicians more leeway to protect those who did not respond to an initial series of shots. https://t.co/j8XkQGGXQO https://t.co/JWFk2GJsau",
  "data/tweet-nytimes/2021/8/1425983206621392897.json": "Nearly every county in the U.S. became more diverse in the last decade as the nation recorded its first drop in the white population in 2020, according to new census data released on Thursday. Here's a breakdown. https://t.co/EFH6RGpDjr https://t.co/NaOgBCgu1n",
  "data/tweet-nytimes/2021/8/1426209454836621319.json": "“Don’t kill me!” the man yelled during a scuffle with police. He later died, shot by a trooper he grew up with.\n\nPolice killings like this have occurred at high rates in rural areas — as they have in U.S. cities — but largely without national attention. https://t.co/Jux78UeVUO",
  "data/tweet-nytimes/2021/8/1426091162302132225.json": "Why did the universe not destroy itself in the Big Bang, in a collision of matter and antimatter? For the Nobel laureate Toshihide Maskawa, a eureka moment in the bathtub led to an answer. He has died at 81. https://t.co/FGtqIOO6ej",
  "data/tweet-nytimes/2021/8/1426268583861133315.json": "A woman who accused the rapper Nicki Minaj’s husband, Kenneth Petty, of sexual assault during high school filed a lawsuit on Friday against the couple, alleging that they harassed and intimidated her while trying to convince her to recant her account. https://t.co/So0sPiZZ9h",
  "data/tweet-nytimes/2021/8/1426259778880344070.json": "Snails burned in their shells from the heat. Lemons and oranges scorched by the sun nearly melted on the trees.\n\nTemperatures in one Sicilian town hit 51 Celsius, or nearly 124 Fahrenheit, this week, possibly the highest ever recorded in Europe.  https://t.co/rIrRc4atEF",
  "data/tweet-nytimes/2021/8/1426288213476454405.json": "Nanci Griffith, the Texas-born singer and songwriter whose career spanned five decades, has died at 68. She was praised by critics for straddling the worlds of folk and country and for writing lyrics that were both vivid and literary. https://t.co/QjeoD19V2B",
  "data/tweet-nytimes/2021/8/1426015683641585674.json": "\"It's like adding the population of Miami. It’s huge.\"\n\nDefying predictions that its population was on the decline, New York City grew by more than 629,000 people — or nearly 8% — since 2010, reaching 8.8 million, census data showed. https://t.co/O0b9GP3flE",
  "data/tweet-nytimes/2021/8/1426302562463064064.json": "It was so hot in Sicily this week — perhaps 124 Fahrenheit in one town — that the region's famous snails died in the heat, essentially stopped in their tracks as their feet burned on the ground. “They stop, and they die,” one resident said. https://t.co/lYkRVVQKf8 https://t.co/v4IRGtxL5h",
  "data/tweet-nytimes/2021/8/1426378055442894849.json": "In a simulation, we modeled Delta-driven Covid outbreaks in two communities, one with a high vaccination rate and another with a low rate. Their levels of serious illness and death were starkly different.\n\nHere's how vaccines can make a difference. https://t.co/QKpwKlEbY5",
  "data/tweet-nytimes/2021/8/1426312639320309761.json": "The Taliban’s advance has made it clear: America’s 20-year effort to turn the Afghan military into an independent fighting force has failed, and that failure is playing out in real time as the country slips into Taliban control. https://t.co/tCVOGYphMa",
  "data/tweet-nytimes/2021/8/1426337803244290053.json": "Biden administration officials have urged Afghanistan’s collapsing security forces to demonstrate “leadership” and “will” to defend the capital, Kabul, underscoring that the U.S. has no intention of rescuing them as the Taliban storm across the country. https://t.co/v5QXcRnbud",
  "data/tweet-nytimes/2021/8/1426524025648521216.json": "In a simulation, we modeled Delta-driven Covid outbreaks in two communities, one with a high vaccination rate and another with a low rate. Their levels of serious illness and death were starkly different.\n\nHere's how vaccines can make a difference. https://t.co/37iT1beZp2",
  "data/tweet-nytimes/2021/8/1426508922198937600.json": "Public parks are a lifeline, especially now — and it's not the first time. The initial popularization of public parks in the U.S. was a response to devastating epidemics. https://t.co/z6kO0soFKD",
  "data/tweet-nytimes/2021/8/1426540206363131904.json": "Breaking News: A magnitude 7 earthquake struck Haiti on Saturday morning — similar in strength to the devastating event in 2010 that killed tens of thousands of people. https://t.co/MN7tLWVrHS",
  "data/tweet-nytimes/2021/8/1426459598412787712.json": "Scientists are discovering that fermented foods may have intriguing effects on our gut, potentially altering the makeup of the trillions of bacteria, viruses and fungi that inhabit our intestinal tracts, collectively known as the gut microbiome. https://t.co/N7SCLiPLF6",
  "data/tweet-nytimes/2021/8/1426590966157357059.json": "The earthquake that struck Haiti Saturday morning occurred on the same system of faults as the one that devastated the capital, Port-au-Prince, in January 2010. One U.S. Geological Survey seismologist said there was no doubt the two quakes were linked.\nhttps://t.co/GmlVI33xpc",
  "data/tweet-nytimes/2021/8/1426619655490318340.json": "The last major city in northern Afghanistan fell to the Taliban on Saturday night, marking the complete loss of the country’s north to the Taliban as the insurgents appear on the verge of a full military takeover.\n\nFollow our live coverage: https://t.co/SOTXZFyqG8 https://t.co/XiTcsjsMu7",
  "data/tweet-nytimes/2021/8/1426614612678557699.json": "Over the past two decades, the U.S. has overestimated the results of the $83 billion it spent training and equipping Afghan security forces and underestimated the brutal strategy of the Taliban. https://t.co/vZdcUIwmRW",
  "data/tweet-nytimes/2021/8/1426629081471324163.json": "More than 220 people are dead after a magnitude 7.2 earthquake violently shook Haiti on Saturday morning. The event is a devastating blow to a country still reeling from a presidential assassination last month. https://t.co/rdmhPZKu3s",
  "data/tweet-nytimes/2021/8/1426539135679057920.json": "Once a fierce critic of Donald Trump, Senator Lindsey Graham remains his staunch defender. \n\nInside one of the unlikeliest relationships in politics: https://t.co/V9uk5BAWcK",
  "data/tweet-nytimes/2021/8/1426675019975962627.json": "In just 58,845 days — on Sept. 24, 2182 — NASA scientists say an asteroid the size of the Empire State Building has a slight chance of hitting Earth. https://t.co/9ApqespNF3",
  "data/tweet-nytimes/2021/8/1426600687107026950.json": "With most of Afghanistan under Taliban control, many of Kabul's residents fear the prospect of their home falling into the hands of the armed group. https://t.co/kDAHqwTUe4 https://t.co/fL5kouq5L9",
  "data/tweet-nytimes/2021/8/1426325225277362177.json": "Last month was Earth’s hottest month on record, the National Oceanic and Atmospheric Administration said on Friday. “This new record adds to the disturbing and disruptive path that climate change has set for the globe,” NOAA's administrator said. https://t.co/GrUTtIsDSS",
  "data/tweet-nytimes/2021/8/1426579376645316615.json": "After weeks of being able to visit Germany relatively easily, American tourists and other nonessential travelers will now have to quarantine for 10 days if they cannot prove full vaccination or immunity from a past infection. https://t.co/lnKJrh5SGR",
  "data/tweet-nytimes/2021/8/1426662075951091716.json": "Breaking News: President Biden is accelerating the deployment of 1,000 additional American troops to Afghanistan to help U.S. citizens and Afghans who worked for the U.S. government evacuate from Kabul safely as the Taliban nears. https://t.co/vxzrKWPLoL",
  "data/tweet-nytimes/2021/8/1426297527582744576.json": "Snopes retracted 60 articles after a BuzzFeed News investigation found that David Mikkelson, its co-founder, plagiarized from news outlets in an attempt to scoop up web traffic. Mikkelson, who owns half the company, will continue as chief executive. https://t.co/Sl5yjvBpkU",
  "data/tweet-nytimes/2021/8/1426911563668197377.json": "With the Taliban on the verge of regaining power in Afghanistan, some women are worried about what comes next. The group historically has barred women and girls from taking most jobs or receiving educations and essentially trapped them in their homes. https://t.co/GuSO3a5Cdo https://t.co/N8q5QZ8KUa",
  "data/tweet-nytimes/2021/8/1426927427113164813.json": "Breaking News: President Ashraf Ghani of Afghanistan fled the country, a top political figure said on Sunday. Members of the Taliban have entered the gates of the capital, Kabul, the last stronghold of the Afghan government. https://t.co/C0owf6jFN9",
  "data/tweet-nytimes/2021/8/1426948845175558145.json": "Afghanistan’s government collapsed on Sunday after President Ashraf Ghani fled the country and the Taliban entered the capital, Kabul, effectively sealing the insurgents’ takeover.  https://t.co/GXGQ1GwNza https://t.co/0gYL8LonW6",
  "data/tweet-nytimes/2021/8/1426956869713682436.json": "Over the past two decades, the U.S. has overestimated the results of the $83 billion it spent training and equipping Afghan security forces and underestimated the brutal strategy of the Taliban. https://t.co/o0ZSt7C0fo",
  "data/tweet-nytimes/2021/8/1426951959236513794.json": "Breaking News: The Biden administration approved the largest permanent increase in food stamps, a move that supporters say will reduce hunger and improve nutrition. https://t.co/8UdUhpEHWU",
  "data/tweet-nytimes/2021/8/1426997155504533513.json": "Naomi Osaka announced she will be donating any prize money she wins from this week’s Western and Southern Open tennis tournament to relief efforts in Haiti. Osaka's father is from the nation, which was hit by an earthquake Saturday. https://t.co/JrlXJy95hi",
  "data/tweet-nytimes/2021/8/1427002180075237382.json": "A Florida school board is defying Governor Ron DeSantis’s ban on mask mandates.\n\n“We believe that we have a constitutional obligation to protect the lives of our students and staff,\" said Rosalind Osgood, who serves as chairwoman. https://t.co/6j3yrgsHq3",
  "data/tweet-nytimes/2021/8/1427047461999288325.json": "With the Taliban on the verge of regaining power in Afghanistan, some women are worried about what comes next. The group historically has barred women and girls from taking most jobs or receiving educations and essentially trapped them in their homes. https://t.co/PeQPuP5brp",
  "data/tweet-nytimes/2021/8/1426987069914681346.json": "She has never experienced pain or anxiety, even during childbirth and surgery. In 2019, scientists finally figured out why. https://t.co/tfg6uw9OuD",
  "data/tweet-nytimes/2021/8/1427102833787219976.json": "Nothing beats a properly made affogato, which is to say some supercold gelato with a shot or two of hot espresso. The magic of an affogato is that even a bad one can be very good, but a very good one can change your life. https://t.co/GkFomTnJev",
  "data/tweet-nytimes/2021/8/1427117935013863428.json": "Taliban fighters poured into Kabul on Sunday amid scenes of panic and chaos.\n\nTheir takeover brought a swift, shocking end to the Afghan government and the 20-year American era in the country. https://t.co/WzbfKkrRJQ",
  "data/tweet-nytimes/2021/8/1427140564894453760.json": "This footage shows Taliban fighters inside Afghanistan's presidential palace. \n\nThe Afghan government collapsed after insurgents entered Kabul on Sunday. https://t.co/wIxCRE23aF https://t.co/xq6t55v6eM",
  "data/tweet-nytimes/2021/8/1427151915327053826.json": "In Opinion\n\n\"The war needed to end,\" the editorial board writes. \"But the Biden administration could and should have taken more care to protect those who risked everything in pursuit of a different future, however illusory those dreams proved to be.\" https://t.co/9ezHglkQ2G",
  "data/tweet-nytimes/2021/8/1427212315871563778.json": "The front page of The New York Times for Aug. 16, 2021.\n\nFollow updates on Afghanistan here: https://t.co/VWYNyPDfmT https://t.co/UUSmINGlob",
  "data/tweet-nytimes/2021/8/1427216092989100034.json": "News Analysis: \"Mr. Biden will go down in history, fairly or unfairly, as the president who presided over a long-brewing, humiliating final act in the American experiment in Afghanistan,\" David Sanger writes. https://t.co/D7lr5XcWA8",
  "data/tweet-nytimes/2021/8/1427226152205225984.json": "This footage shows Taliban fighters inside Afghanistan's presidential palace. \n\nThe Afghan government collapsed after insurgents entered Kabul on Sunday. https://t.co/7nVxN5fTSF https://t.co/eGD3SE59v5",
  "data/tweet-nytimes/2021/8/1427260324500148227.json": "Crowds of people desperate to escape Afghanistan stormed Kabul’s international airport, rushing onto the tarmac.\n\nPeople clung to the sides of military planes, even as one taxied down the runway, in a bid to flee as the Taliban takes control.\nhttps://t.co/BMfaEkDykr https://t.co/WkX0JQx3io",
  "data/tweet-nytimes/2021/8/1427248806719115265.json": "In Opinion\n\n\"The war needed to end,\" the editorial board writes. \"But the Biden administration could and should have taken more care to protect those who risked everything in pursuit of a different future, however illusory those dreams proved to be.\" https://t.co/JKbcqrHjBg",
  "data/tweet-nytimes/2021/8/1427227410093727744.json": "Prime Minister Muhyiddin Yassin of Malaysia and his entire cabinet resigned amid public anger over the government’s handling of the coronavirus. https://t.co/ersH43Y5Pr",
  "data/tweet-nytimes/2021/8/1427263903235514372.json": "Thousands of people are desperate to escape the Taliban’s takeover of Afghanistan. As the crisis deepens, other nations are bracing for a mass of refugees.\nhttps://t.co/BFpaP7iixD",
  "data/tweet-nytimes/2021/8/1427280264133230598.json": "Scenes of panic and chaos played out at the airport in Kabul as crowds of people desperate to escape Afghanistan rushed onto the tarmac.\n\nSome clung to the sides of planes, even as one taxied down the runway, in a bid to flee the Taliban.\nhttps://t.co/pAgoGW7tos https://t.co/4YGQd2iEzk",
  "data/tweet-nytimes/2021/8/1427286557417934852.json": "New York City will require visitors and employees at the city's museums, concert halls, aquariums and zoos to be vaccinated, an official said on Monday. https://t.co/KxHqON0ydh",
  "data/tweet-nytimes/2021/8/1427302910971498502.json": "With the Taliban on the verge of regaining power in Afghanistan, some women are worried about what comes next. \n\n\"I was born in 2004, and I have no idea what the Taliban did to women, but I know women were banned from everything,\" said a student in Kabul. https://t.co/X6DPZE1rmA https://t.co/ZpJA7WTPcA",
  "data/tweet-nytimes/2021/8/1427296621230968833.json": "News Analysis: \"Mr. Biden will go down in history, fairly or unfairly, as the president who presided over a long-brewing, humiliating final act in the American experiment in Afghanistan,\" David Sanger writes. https://t.co/MHOELj3oEw",
  "data/tweet-nytimes/2021/8/1427314256521924610.json": "More than 300 Afghan Americans, wielding signs that read “Help Afghan kids” and “America betrayed us,\" protested outside the White House on Sunday to decry the U.S. withdrawal from Afghanistan that led to the Taliban seizing control of the country. https://t.co/bNifYAcg7V https://t.co/9IhzoeWJYZ",
  "data/tweet-nytimes/2021/8/1427325555142234125.json": "A day after the Taliban seized control of Afghanistan, thousands of people flooded the tarmac of the international airport in Kabul. Images of people clinging to a flying plane circulated around the world. It was a scene of desperation, sadness and panic. https://t.co/fsV5mcCIDl https://t.co/4yE8shigBW",
  "data/tweet-nytimes/2021/8/1427344439853322245.json": "Kabul's international airport was one of the last places in the Afghan capital on Monday not controlled by the Taliban. The U.S. State Department said all its embassy personnel had been evacuated to the airport, which is defended by the U.S. military. https://t.co/ZHiF97E2HD https://t.co/c0NmF7NrIl",
  "data/tweet-nytimes/2021/8/1427365499835387915.json": "The collapse of the Afghan government has reinforced the idea that \"ending U.S. military involvement in Afghanistan now was the right decision,” President Biden said on Monday. “I stand squarely behind my decision,\" he added. https://t.co/iKf5kLfxtx",
  "data/tweet-nytimes/2021/8/1427370858713059339.json": "As the Taliban seized control of Afghanistan, there was chaos on the streets of Kabul. We spoke to a 33-year-old woman — an outspoken critic of the Taliban who asked that we refer to her by the initial R for fear of retaliation — about her experiences. https://t.co/uCrYYoJeFz https://t.co/fIqqZ7WteU",
  "data/tweet-nytimes/2021/8/1427393507367456775.json": "Breaking News: In a first, the U.S. government declared a shortage on the Colorado River, forcing water cuts in Arizona, Nevada and Mexico. https://t.co/jjcDKKYEZn",
  "data/tweet-nytimes/2021/8/1427414916084948994.json": "In the last seven days, the single most stunning week in two decades of war in Afghanistan, the country’s armed forces folded and the government collapsed. These maps show how swift the Taliban advanced in its takeover. https://t.co/tj8si8cjcr https://t.co/NV538NVVo4",
  "data/tweet-nytimes/2021/8/1427397281712644100.json": "President Biden on Monday said he stood \"squarely behind\" the decision to withdraw U.S. forces from Afghanistan despite a Taliban takeover of the country, and the collapse of the Afghan government and military. https://t.co/K8kd8hzQVt https://t.co/IuXEJPmwyu",
  "data/tweet-nytimes/2021/8/1427424974558711811.json": "A supporter of the Proud Boys, the far-right group, pleaded guilty on Monday to threatening to kill Senator Raphael Warnock of Georgia before and during the Jan. 6 storming of the U.S. Capitol. https://t.co/GePwJLFnBz",
  "data/tweet-nytimes/2021/8/1427456495017504768.json": "Breaking News: The Biden administration is expected to announce that most Americans should get a booster shot eight months after receiving their initial Covid-19 vaccine, and could begin offering the extra shots as early as mid-September. https://t.co/HJf3HoZzQF",
  "data/tweet-nytimes/2021/8/1427471515822481409.json": "The front page of The New York Times for Aug. 17, 2021. https://t.co/1nJPwknbc0",
  "data/tweet-nytimes/2021/8/1427419960356261894.json": "Thousands of desperate Afghans trying to escape the Taliban takeover swarmed Kabul's main international airport on Monday. At least half a dozen people were killed in the chaos.\n\n\"Our situation is bitter,\" said one Afghan man. \"There is no water or food.\" https://t.co/N7MlWz6vY2",
  "data/tweet-nytimes/2021/8/1427469177569300489.json": "Tens of thousands of Afghan nationals who risked their lives to assist American troops in Afghanistan have waited years for visas to come to the U.S. Now, after the Taliban's takeover, swift and safe passage to the U.S. may prove elusive. https://t.co/HXOQX1YwPT",
  "data/tweet-nytimes/2021/8/1427349454848471043.json": "Johnson &amp; Johnson has been sending millions of vaccine doses that were bottled and packaged in South Africa to Europe, leaving South Africans, devastated by the Delta variant, waiting for most of the shots the country ordered. https://t.co/DvIuHpEv88",
  "data/tweet-nytimes/2021/8/1427565895468081191.json": "Maki Kaji, the “Godfather of Sudoku” who turned the numbers game into one of the world’s most popular logic puzzles, died at his home in Tokyo. He was 69.\nhttps://t.co/bjAjN3arOr",
  "data/tweet-nytimes/2021/8/1427583491676459008.json": "A female presenter interviewed a Taliban official on an Afghan television station. It was a starkly different image from the scene on the ground in Kabul, where women remained at home, fearful for their lives and their futures under Taliban rule.\nhttps://t.co/wmkXyTKMiU",
  "data/tweet-nytimes/2021/8/1427552052432023587.json": "President Ashraf Ghani of Afghanistan fled the Taliban's advance on Kabul this weekend. Instead of fixing Afghanistan during his nearly seven years in power, he left much the way he governed: isolated from all but a handful of advisers. https://t.co/rUUeDDhces",
  "data/tweet-nytimes/2021/8/1427251299247087620.json": "One important question about breakthrough coronavirus infections remains unanswered: Can the fully vaccinated develop so-called long Covid?\nhttps://t.co/7cajEMNPgv",
  "data/tweet-nytimes/2021/8/1427502982770438176.json": "President Biden offered a defiant defense on Monday of his decision to withdraw troops from Afghanistan, blaming the swift collapse of the Afghan government on the refusal of the country's military to stand and fight in the face of the Taliban advance. https://t.co/z8Lje4Azse",
  "data/tweet-nytimes/2021/8/1427636362052874244.json": "A Taliban official told a female TV presenter, \"I am still astonished that people are afraid of Taliban.\" The interview, remarkable given the Taliban's history of subjugating women, was part of a broader effort to present a more moderate face to the world. https://t.co/t3kCVfqStK https://t.co/InLU7MTdIJ",
  "data/tweet-nytimes/2021/8/1427671612208390152.json": "The Taliban gave an interview to a female Afghan anchor on Tuesday as part of an effort to show a more moderate face to the world. Meanwhile, in some areas of Afghanistan, women have been told not to leave home without a man, and girls’ schools have closed.https://t.co/7y7XfzvsE6",
  "data/tweet-nytimes/2021/8/1427631362530496519.json": "Scientists have taken a first step toward creating a mosquito that is blind to humans. https://t.co/BX0fsvAV0k",
  "data/tweet-nytimes/2021/8/1427685415587393539.json": "In Opinion\n\nMalala Yousafzai, the education activist who survived a Taliban assassination attempt when she was 15, argues there’s still time to help Afghan women and girls: \"We have no time to spare.\" https://t.co/pZpGrx7oXQ",
  "data/tweet-nytimes/2021/8/1427708669953814529.json": "The Atlanta Falcons announced that all the team’s players and coaches are vaccinated against the coronavirus, becoming the first NFL team to reach 100%. https://t.co/R0r1LddreI",
  "data/tweet-nytimes/2021/8/1427714368700043264.json": "A small group of Afghan women risked their safety on Tuesday to test the Taliban's promise to respect women’s rights: They stood holding signs demanding the right to work and go to school mere feet from armed Taliban fighters. https://t.co/54iGHy3sOJ",
  "data/tweet-nytimes/2021/8/1427731992758689796.json": "In Opinion\n\nMalala Yousafzai, who survived a Taliban assassination attempt and is an activist for girls’ education, writes in a guest essay about Afghan girls: \"We cannot continue to fail them. We have no time to spare.\" https://t.co/9bmIRMPHYW https://t.co/4hA63msggD",
  "data/tweet-nytimes/2021/8/1427740832333971467.json": "Breaking News: Gov. Greg Abbott of Texas has tested positive for the coronavirus and is isolating while receiving treatment. Abbott, who has banned mask and vaccine mandates in the state, has faced criticism as virus cases increased sharply. https://t.co/7wqTaKPNPp",
  "data/tweet-nytimes/2021/8/1427764680588660738.json": "Pete Buttigieg and his husband, Chasten, are now parents, Buttigieg said on Tuesday. The transportation secretary added that the process was not yet complete, but that he and Chasten \"can't wait to share more soon.\" https://t.co/nXsZyp8m2n",
  "data/tweet-nytimes/2021/8/1427786103776493570.json": "The mask mandate for travelers at U.S. airports has been extended through January 2022, the Transportation Security Administration announced on Tuesday. The mandate also covers all public buses, trains, subways and ferries. https://t.co/HU0kOYVGHL",
  "data/tweet-nytimes/2021/8/1427713533924544514.json": "A Pentagon spokesman outlined the rescue strategy for getting Afghan citizens and foreign nationals out of Afghanistan after the country was taken over by the Taliban. https://t.co/rtHjFNa4Il https://t.co/Y4d0RqYNnD",
  "data/tweet-nytimes/2021/8/1427819806837907458.json": "“Getting the vaccines that are authorized by the respective authorities is an act of love,” Pope Francis said in a public service ad. https://t.co/8QdyG7kQm8",
  "data/tweet-nytimes/2021/8/1427613719459254276.json": "India said it would prioritize the repatriation of Hindus and Sikhs from Afghanistan. The move drew comparisons to a recent citizenship law that discriminates against Muslims.\nhttps://t.co/vldjYN4ZOY",
  "data/tweet-nytimes/2021/8/1427940882876145671.json": "In Opinion\n\nMalala Yousafzai, who survived a Taliban assassination attempt and is an activist for girls’ education, writes in a guest essay about Afghan girls: \"We cannot continue to fail them. We have no time to spare.\" https://t.co/vXTQqHnORd https://t.co/ZPiR7HQ0rC",
  "data/tweet-nytimes/2021/8/1427835190823604225.json": "David Sackler said on Tuesday that he and his family, the owners of Purdue Pharma, would withdraw a $4.5 billion pledge unless they are granted broad legal immunity. The money would go to communities that have been devastated by the opioid epidemic. https://t.co/iI7zcm4bwJ",
  "data/tweet-nytimes/2021/8/1427725777886400519.json": "One in five hospital ICUs in the U.S. now has at least 95% of beds occupied, as the Delta variant fuels a surge of coronavirus cases. \n\nSee where the crisis areas are concentrated. https://t.co/XrFm7pJTky",
  "data/tweet-nytimes/2021/8/1427944618071662593.json": "Hundreds of people marched against the Taliban’s takeover of Afghanistan in the northeast city of Jalalabad, the first outpouring of public anger. \n\nSoldiers responded forcefully, firing into the crowd and beating protesters and journalists.\nhttps://t.co/eERWTDcDGC",
  "data/tweet-nytimes/2021/8/1427641393359491078.json": "Afghanistan’s central bank governor has described scenes of chaos as he fled the country.\n\n“It did not have to end this way,” he wrote on Twitter. “I am disgusted by the lack of any planning by Afghan leadership.”\nhttps://t.co/PLZVxadfPC",
  "data/tweet-nytimes/2021/8/1427827621975441410.json": "Clemson University instituted a new mandatory mask policy, reacting swiftly to a decision by the South Carolina Supreme Court that mask mandates are allowed under state law. https://t.co/nfUTcVpj21",
  "data/tweet-nytimes/2021/8/1428004003674198023.json": "Breaking News: Americans who got the Pfizer-BioNTech and Moderna vaccines can get booster shots eight months after their second doses, starting in late September, the Biden administration said on Wednesday. Officials cited evidence of waning immunity. https://t.co/dGcnp4ZCkt",
  "data/tweet-nytimes/2021/8/1427983630492655618.json": "David Sackler said on Tuesday that he and his family, the owners of Purdue Pharma, would withdraw a $4.5 billion pledge unless they are granted broad legal immunity. The money would go to communities that have been devastated by the opioid epidemic. https://t.co/HjoQ4wlKYb",
  "data/tweet-nytimes/2021/8/1427999492708651036.json": "Breaking News: President Ashraf Ghani, who fled Afghanistan last weekend as the Taliban surrounded Kabul, is now in the UAE, the Gulf nation said after days of speculation about his whereabouts.\nhttps://t.co/XFESUFDjlj",
  "data/tweet-nytimes/2021/8/1427654012409630722.json": "Voters in California will soon receive ballots by mail for the Sept. 14 recall election to determine Gov. Gavin Newsom's future. With polls showing a dead heat, the vote may come down to whether Democrats can mobilize enough of the state's enormous base. https://t.co/glm7Semmca",
  "data/tweet-nytimes/2021/8/1428051593321230341.json": "Pope Francis is urging people around the world to get vaccinated against Covid-19 in a new public service ad, calling it an \"an act of love.\" https://t.co/CSS1bAU4zB https://t.co/crwJVlafe0",
  "data/tweet-nytimes/2021/8/1428059147526881285.json": "Garth Brooks has canceled his next five stadium tour dates as virus cases rise. \"I sincerely thought the pandemic was falling behind us,” he said in a statement. \"Now, watching this new wave, I realize we are still in the fight and I must do my part.\" https://t.co/rSmdqvyELp",
  "data/tweet-nytimes/2021/8/1428085668417318915.json": "Pope Francis is urging people around the world to get vaccinated against Covid-19 in a new public service ad, calling it \"an act of love.\" https://t.co/Jk6RGvYNfj https://t.co/eqS4cDSnqe",
  "data/tweet-nytimes/2021/8/1428072215157878784.json": "Breaking News: The EPA will ban a pesticide widely used on fruits and vegetables from use on food crops because of links to neurological damage in children. https://t.co/V7wqPd5FPW",
  "data/tweet-nytimes/2021/8/1428073012041973762.json": "Months after he was pardoned by Donald Trump, a former editor of The New York Observer was charged with two felonies in New York. Ken Kurson, a close friend of Jared Kushner, is accused of spying on his former wife by unlawfully accessing her computer. https://t.co/oVrUV8JsB6",
  "data/tweet-nytimes/2021/8/1428078250786533385.json": "Israel was once a model for beating Covid. But it now has one of the world’s highest infection rates, raising questions about waning vaccine efficacy. https://t.co/bneNI74MZw",
  "data/tweet-nytimes/2021/8/1428122070135803911.json": "All teachers and school personnel in Washington State — including coaches, bus drivers and volunteers — will need to be fully vaccinated as a condition of employment, Gov. Jay Inslee announced, imposing the nation's strictest vaccine mandate for schools. https://t.co/NrnZERTmNj",
  "data/tweet-nytimes/2021/8/1428169876833804292.json": "A federal judge in Alaska blocked permits for an oil drilling project in the state, citing the effects it would have on wildlife and global warming. https://t.co/gdDlvwJkjL",
  "data/tweet-nytimes/2021/8/1428271014375473154.json": "The Taliban are intensifying a search for people they believe worked with U.S. and NATO forces, including among the crowds at Kabul’s airport, a UN document says. Militants have threatened to kill or arrest their family members if they cannot find them. https://t.co/InIPfqZ23U",
  "data/tweet-nytimes/2021/8/1428285630337925127.json": "Some members of an Afghan girls’ robotics team have arrived in Qatar, fleeing the Taliban’s takeover. They will remain in Qatar to continue their education, the team says. https://t.co/god5XQPOWm",
  "data/tweet-nytimes/2021/8/1428111975071076353.json": "Disney World in Florida is permanently retiring its free, line-skipping FastPass system and will charge $15 a person for the privilege — an added cost for what is already an expensive destination. https://t.co/QbFAbXUtT4",
  "data/tweet-nytimes/2021/8/1428328414444986381.json": "The Taliban are intensifying a search for people they believe worked with U.S. and NATO forces, including among the crowds at Kabul’s airport, a UN document says. Militants have threatened to kill or arrest their family members if they cannot find them. https://t.co/eRKgwix5q4",
  "data/tweet-nytimes/2021/8/1428307010433560583.json": "There wasn’t a single ICU bed available in Alabama on Wednesday. https://t.co/VGv9AwEAE3",
  "data/tweet-nytimes/2021/8/1428295756184801285.json": "Israel was once a model for beating the coronavirus. But it now has one of the world’s highest infection rates, raising questions about waning vaccine efficacy. https://t.co/evGGEV1oe9",
  "data/tweet-nytimes/2021/8/1428365085055938583.json": "Plastic anti-Covid barriers now common in public places have little effect on the virus, and in some cases could help it spread, research suggests.\nhttps://t.co/3YsYdIaQcD",
  "data/tweet-nytimes/2021/8/1428325896763678720.json": "The Brazilian butt lift, or \"BBL,\" is one of the most popular cosmetic surgeries. It also has the highest mortality rate of any such procedure. https://t.co/EP299MHhLE",
  "data/tweet-nytimes/2021/8/1428411715042033669.json": "The Taliban face a challenge in running Afghanistan after protesters took to the streets across the country for a second day. One demonstration in Kabul drew 200 people before it was violently broken up. https://t.co/W9rJMlkWqp https://t.co/7z2Kypzbad",
  "data/tweet-nytimes/2021/8/1428372527890509832.json": "Breaking News: The U.S. Capitol Police are investigating an active bomb threat involving a “suspicious vehicle” outside the Library of Congress. \n\nIn alerts to staffers, the police urged people to move inside, lock doors and avoid windows. https://t.co/IcDXL6FEOa",
  "data/tweet-nytimes/2021/8/1428416550101569536.json": "Disney wants the robots in its parks to come alive. One goal: Setting them free from the confines of the rides and letting them wander walkways to turn the parks into, as one executive put it, \"inhabited places.\" https://t.co/UGlTjq0Cjw",
  "data/tweet-nytimes/2021/8/1428431598278545419.json": "As Kabul fell, hundreds of Russian armored vehicles were clearly visible at the border between Afghanistan and Tajikistan.\n\nThe effort signaled it will now be Russia, not the U.S., that will protect Central Asia from potential violence next door. https://t.co/ZvYTMQXTgv",
  "data/tweet-nytimes/2021/8/1428348306204340225.json": "Clear barriers probably don’t help protect against germs, research suggests. And sometimes they can even make things worse, impeding normal air flow and ventilation. https://t.co/goAjfR5i3l",
  "data/tweet-nytimes/2021/8/1428517153431556101.json": "17-year-old Zaki Anwari, a member of Afghanistan's youth soccer team, was among the people who died desperately trying to cling to a U.S. military plane leaving Kabul. “He had no hope and wanted a better life,\" a sports official said, confirming his death. https://t.co/ujrTNzv7xr",
  "data/tweet-nytimes/2021/8/1428529754811113482.json": "A white Iowa woman who admitted that she had tried to kill two children because of their race in 2019 by hitting them with her car was sentenced on Thursday to 25 years in prison on two federal hate crime charges, officials said. https://t.co/zjdvAEZELz",
  "data/tweet-nytimes/2021/8/1428461435462602763.json": "Breaking News: Chuck Close has died at 81.\n\nHe rose to success with colossal Photorealist portraits, becoming one of the leading artists of his generation, but faced accusations of sexual harassment later in his career. https://t.co/8cwBxYRFBh",
  "data/tweet-nytimes/2021/8/1428532255073386500.json": "A small school district in California is believed to be the first in the state — and possibly the nation — to require students 12 and older to be vaccinated against Covid-19. https://t.co/qtUTvLQJ3W",
  "data/tweet-nytimes/2021/8/1428367412269707272.json": "There wasn’t a single ICU bed available in Alabama on Wednesday. https://t.co/AMsZznvlEe",
  "data/tweet-nytimes/2021/8/1428547360519598082.json": "Parents of young children with disabilities are suing Gov. Greg Abbott of Texas over his ban on mask mandates in public schools, arguing that the executive order prevents their medically at-risk children from being able to attend school safely. https://t.co/X8gcmdTiCi",
  "data/tweet-nytimes/2021/8/1428395102792257542.json": "\"Everybody’s aerosols are going to be trapped and stuck there and building up,\" said Linsey Marr, one of the world’s leading experts on viral transmission, \"and they will end up spreading beyond your own desk.\" https://t.co/oxA4ph2Oxy https://t.co/883OYkkW1E",
  "data/tweet-nytimes/2021/8/1428134209181392900.json": "Breaking News: President Biden said he was committed to evacuating all Americans out of Afghanistan, even if U.S. troops must stay beyond his Aug. 31 withdrawal deadline. https://t.co/16lj7Uo17b",
  "data/tweet-nytimes/2021/8/1428552390131830787.json": "The Los Angeles City Council has passed a Covid-19 vaccine mandate for nearly 60,000 city workers, including police officers and firefighters, that does not include an option for regular testing. https://t.co/L1w5Yal529",
  "data/tweet-nytimes/2021/8/1428665639120556036.json": "17-year-old Zaki Anwari, a member of Afghanistan's youth soccer team, was among the people who died desperately trying to cling to a U.S. evacuation plane leaving Kabul. “He had no hope and wanted a better life,\" a sports official said. https://t.co/Dkcy0BMVPn",
  "data/tweet-nytimes/2021/8/1428646755437056002.json": "The Taliban are searching for Afghan journalists and in some cases harming them or members or their families, reports indicate, despite assurances of amnesty by the regime. https://t.co/LyhZyJKCFC",
  "data/tweet-nytimes/2021/8/1428685777035218946.json": "Felix Hall, a Black teenager, joined the Army in 1940 and was lynched at Fort Benning in Georgia the following year. No one was ever charged in his death.\n\nThis month, a plaque was dedicated in his memory. https://t.co/WydlIqfr6A",
  "data/tweet-nytimes/2021/8/1428695845617250305.json": "A white Iowa woman who admitted that she had tried to kill two children because of their race in 2019 by hitting them with her car was sentenced on Thursday to 25 years in prison on two federal hate crime charges, officials said. https://t.co/l29U80FysG",
  "data/tweet-nytimes/2021/8/1428723989606764546.json": "Breaking News: Mike Richards, who was named the new host of “Jeopardy!” last week, is abruptly leaving the role at the beloved game show after a report this week resurfaced offensive and sexist comments he made on a podcast several years ago. https://t.co/VUdPwDG9wZ",
  "data/tweet-nytimes/2021/8/1428619897714712576.json": "China has replaced Japan — the former colonial ruler — as the country regarded most unfavorably in South Korea, a ​survey says. Anti-China sentiment is growing particularly among young voters. https://t.co/hozb8AMr5z",
  "data/tweet-nytimes/2021/8/1428731136398794754.json": "A Massachusetts woman convicted of witchcraft at Salem in 1693 could finally be exonerated by the state thanks to the lobbying efforts of an unlikely constituency: an eighth-grade civics class. https://t.co/ZLRC33pEbw",
  "data/tweet-nytimes/2021/8/1428715983070449667.json": "A conservative Catholic blog published several posts claiming that priests at multiple levels of the Catholic hierarchy in the U.S. and the Vatican were using Grindr. The reports, based on analyses of cellphone data, have put church officials on edge. https://t.co/TulIwlUW7w",
  "data/tweet-nytimes/2021/8/1428760001993220101.json": "The images are heart-wrenching: in the chaos outside Kabul’s international airport, footage of babies and children being lifted above surging crowds into the arms of U.S. soldiers on blast walls. It was not clear if their parents had made it to safety. https://t.co/eoCINkdqYd https://t.co/GyHJuQZI2Q",
  "data/tweet-nytimes/2021/8/1428719754131431425.json": "Twenty years after Aaliyah, one of the most celebrated stars of '90s R&amp;B, died in a plane crash, her songs will finally be widely available on streaming platforms — starting with her second album, \"One in a Million,\" today. \nhttps://t.co/7fpQGVss1c",
  "data/tweet-nytimes/2021/8/1428756259264770051.json": "In Opinion\n\n\"So how do you feel about anti-vaxxers and anti-maskers? I’m angry about their antics,\" Paul Krugman writes. \"And I suspect that many Americans share that anger.\" https://t.co/eAUqT8IGnE",
  "data/tweet-nytimes/2021/8/1428796490072399875.json": "Breaking News: The maker of a popular rapid test for Covid-19 destroyed inventory and laid off workers just weeks before a virus surge in the U.S. drove up demand for tests. https://t.co/uEkAPoJRMv",
  "data/tweet-nytimes/2021/8/1428376222573203457.json": "Israel was once a model for beating the coronavirus. But it now has one of the world’s highest infection rates, raising questions about waning vaccine efficacy. https://t.co/RzOio3MR0l",
  "data/tweet-nytimes/2021/8/1428830473715847176.json": "Breaking News: The FDA is aiming to give full approval to Pfizer’s Covid-19 vaccine on Monday, according to people familiar with the agency’s planning. The move is expected to pave the way for a series of vaccine mandates. https://t.co/fAPMWec5MC",
  "data/tweet-nytimes/2021/8/1428832991749492741.json": "An infant handed to U.S. Marines at an airport in Afghanistan was safe and reunited with their family, officials said on Friday. Harrowing video of the incident had gone viral, fueling anger at a haphazard evacuation process from the country. https://t.co/Tg74y6CqJm https://t.co/52isnYdGRp",
  "data/tweet-nytimes/2021/8/1428851354135629827.json": "Crystal Bayat was one of seven women at a protest she helped organize on Independence Day in Afghanistan. Days after the Taliban took over, raising the Afghan flag became an act of resistance. “I am raising the voice of a million women,” she said. https://t.co/riqSV9xF6j https://t.co/XxLDuDSIKN",
  "data/tweet-nytimes/2021/8/1428892132778074114.json": "The Archdiocese of Philadelphia announced earlier this week that it will not sanction religious exemptions to Covid vaccine mandates, joining a growing chorus of Catholic dioceses that are declining to give parishioners an excuse for not getting inoculated.https://t.co/fwWG0PzqXP",
  "data/tweet-nytimes/2021/8/1428742400537677835.json": "The chaos at the Kabul airport on Thursday in Afghanistan was matched by calm in other pockets of the city. Some businesses resumed work, and many people were trying to get on with their lives. Others were in hiding, afraid for theirs. Women were scarce. https://t.co/EfGCJfhzKl https://t.co/IN1grxiDwV",
  "data/tweet-nytimes/2021/8/1428924844712808451.json": "For the first time, it rained at the high point of the Greenland ice sheet, known as the Summit — yet another troubling sign of a changing Arctic, which is warming faster than any other region on the planet. https://t.co/d9xMlQpbrM https://t.co/xRU7jtui5W",
  "data/tweet-nytimes/2021/8/1429070814851313668.json": "The FDA is aiming to give full approval to Pfizer’s Covid-19 vaccine on Monday, according to people familiar with the agency’s planning. The move is expected to pave the way for a series of vaccine mandates. https://t.co/Q6vomfzxbe",
  "data/tweet-nytimes/2021/8/1428902200701558787.json": "A California law that defines gig workers such as Uber and Lyft drivers as contractors is unconstitutional, a State Superior Court judge ruled. https://t.co/spYwRHEIZX",
  "data/tweet-nytimes/2021/8/1429073320083918850.json": "A study earlier this year found that Ivermectin, a popular but unproven treatment for Covid-19, does not speed recovery in those who have a mild version of the disease. https://t.co/xLsTMppITe",
  "data/tweet-nytimes/2021/8/1429141270522388481.json": "A former top homeland security adviser to Mike Pence accused the Trump administration of distorting the truth about Afghan refugees, tweeting that Trump and Stephen Miller, his top immigration adviser, sought to prevent them from entering the U.S. https://t.co/Yqhv3K7dsH",
  "data/tweet-nytimes/2021/8/1429131199600078849.json": "Executives at Facebook debated whether it would look bad to release a report showing that the most-viewed link on the site contained misleading information about the Covid vaccine. The company decided to shelve it. https://t.co/7UuBSZiH1a",
  "data/tweet-nytimes/2021/8/1429161954879459333.json": "Ivermectin, an anti-parasitic drug commonly used for livestock, should not be taken to treat or prevent Covid-19, the FDA said on Saturday. https://t.co/AfaqUMh1zD https://t.co/sPCEOJJYmB",
  "data/tweet-nytimes/2021/8/1428786437806301192.json": "They have their papers and plans, their children in tow, a few belongings in hand. But the chaos that continues to surround Kabul’s airport means that thousands of people who are trying to catch flights out of Afghanistan cannot reach them. https://t.co/hL0BfVTODe https://t.co/X9r8nG5KGG",
  "data/tweet-nytimes/2021/8/1428869500179472384.json": "Sonny Chiba, a Japanese action star who was known for ultraviolent martial arts movies and his role in Quentin Tarantino’s \"Kill Bill\" films, died on Wednesday at age 82. The cause was Covid-19, his manager said. https://t.co/NwOLQqdQo5",
  "data/tweet-nytimes/2021/8/1429211729989353478.json": "Scientists who study aerosols, air flow and ventilation say the plastic barriers people have started to use during the pandemic usually don’t help. In fact, they can impede airflow and create \"dead zones\" where viral aerosol particles can build up. https://t.co/kv8TNRaZ7a",
  "data/tweet-nytimes/2021/8/1429226829022482432.json": "In nearly 50 books for children, Eloise Greenfield wrote poetry and prose about the Black experience, as well as biographies of Rosa Parks, Paul Robeson and others. She has died at 92. https://t.co/Fq8FNLgwsE",
  "data/tweet-nytimes/2021/8/1429265972893032451.json": "Phil Valentine, a conservative radio host in Tennessee who refused to get vaccinated, then urged his followers to get a shot after being hospitalized with Covid-19, died, his station said. https://t.co/WwM6Gjiuiy",
  "data/tweet-nytimes/2021/8/1429075842848722945.json": "Analysis: Recent history shows it is foolish for Western powers to fight wars in other people’s lands. Homegrown insurgencies, though seemingly outmatched in money, technology and arms are often better motivated and have a constant stream of new recruits. https://t.co/wG8PG2fm85",
  "data/tweet-nytimes/2021/8/1429257036420861958.json": "There are rappers whose music focuses on sex, drugs, and expensive cars, and then there is 22-year-old Jimothy, who raps about one day earning enough money to shop at upmarket supermarkets and listening to his mother’s advice. https://t.co/GlJTqJx6Mp",
  "data/tweet-nytimes/2021/8/1428726026805317633.json": "In the chaos outside Kabul’s international airport, videos show babies and children being lifted above surging crowds into the waiting arms of U.S. soldiers perched above blast walls. They show small children are being almost thrown to safety. https://t.co/qMZRQgesbx",
  "data/tweet-nytimes/2021/8/1429432662503088138.json": "Breaking News: The U.S. ordered six airlines to provide planes to fly Americans and Afghan allies fleeing Kabul, picking them up from airbases outside Afghanistan. https://t.co/ttD7kLOdRm",
  "data/tweet-nytimes/2021/8/1429151345676804100.json": "In Opinion\n\n“I really am upset with myself because I did not get vaccinated,” a Covid patient told @AStocktonFilms during his visit to an Arkansas hospital. Rhetoric on freedom and choice is dissuading people from getting the shot, at a terrible cost. https://t.co/h0Zvtn5nnT https://t.co/BbwOi9eybe",
  "data/tweet-nytimes/2021/8/1429458384395423745.json": "Phil Valentine, a conservative radio host in Tennessee who refused to get vaccinated, then urged his followers to get a shot after being hospitalized with Covid-19, died, his station said. https://t.co/xSnrFf3kbf",
  "data/tweet-nytimes/2021/8/1429428162740563968.json": "Measuring some 700 square miles, Torres del Paine National Park is home to a breathtaking array of glaciers, lakes and mountains. It is often photographed in the summertime, but its scenery is especially stunning in the fall.\nhttps://t.co/6ND52kq7hn",
  "data/tweet-nytimes/2021/8/1429156363490504706.json": "Inspired by butter-pecan ice cream, this cake combines crunchy praline with graham crackers, coffee ice cream and fudge sauce to make an impressive, but easy to assemble dessert. https://t.co/DXkkbhU88P",
  "data/tweet-nytimes/2021/8/1429054440250748932.json": "Henrik Lundqvist, the star goalie who spent his 15 NHL seasons with the New York Rangers, announced his retirement on Friday. He was a rare hockey player whose stardom eclipsed his sport, in a city that's hard to impress. https://t.co/4Kd5Fw67GO",
  "data/tweet-nytimes/2021/8/1429455954563813387.json": "Tony Blair, the former prime minister of Britain who led the UK into Afghanistan, criticized Biden's withdrawal, calling it a hasty move made “in obedience to an imbecilic political slogan about ending ‘the forever wars.’” https://t.co/jJbWliMJc9",
  "data/tweet-nytimes/2021/8/1429498611453280262.json": "Getting simple medical care can cost more with insurance than without. Here are the prices insurers and hospitals didn't want you to see. https://t.co/XMzMzaVCZv",
  "data/tweet-nytimes/2021/8/1429337592709931012.json": "Like many of us, sea snakes are looking for love in all the wrong places. https://t.co/NLhGP8sVR7",
  "data/tweet-nytimes/2021/8/1429518761208524803.json": "Six months before Rosa Parks refused to give up her seat, Lucille Times had an altercation with a bus driver and stopped riding the city’s segregated buses. She died at 100 from complications of Covid-19. https://t.co/gInmuJd5Xg",
  "data/tweet-nytimes/2021/8/1429523791647023111.json": "Josephine Baker, an American-born Black dancer and civil rights activist who became one of France’s great music-hall stars, will be the first Black woman laid to rest in the Panthéon, France’s storied tomb of heroes. https://t.co/jz0kkuOq0B",
  "data/tweet-nytimes/2021/8/1429529301452476425.json": "Two prominent Republicans  — Representative Adam Kinzinger of Illinois and Senator Ben Sasse of Nebraska — condemned members of their own party on Sunday for objecting to bringing Afghan refugees to the U.S https://t.co/B4o2JX9VEv https://t.co/SvPbCGTdYb",
  "data/tweet-nytimes/2021/8/1429543930010521604.json": "Watch how the coronavirus nefariously infiltrates the cells of a bat brain in this video, taken by Sophie-Marie Aicher and Delphine Planas, which received an honorable mention in the 2021 Nikon Small World in Motion Competition. https://t.co/pM8Rsp6Hxe https://t.co/e9AqcdouPK",
  "data/tweet-nytimes/2021/8/1429604323047133185.json": "Watch how the coronavirus nefariously infiltrates the cells of a bat brain in this video, taken by Sophie-Marie Aicher and Delphine Planas, which received an honorable mention in the 2021 Nikon Small World in Motion Competition. https://t.co/VVmar9lPEu https://t.co/MP82hWwjTd",
  "data/tweet-nytimes/2021/8/1429589214220505091.json": "“We’re in dire straits down here. We have no ICU beds. I don’t know what’s going to make people do the right thing.” \nhttps://t.co/fPqGH3xRWP",
  "data/tweet-nytimes/2021/8/1429448295156490247.json": "Don Everly, the elder of the two Everly Brothers, the groundbreaking duo whose fusion of Appalachian harmonies and a tighter, cleaner version of big-beat rock ’n’ roll made them harbingers of both folk-rock and country-rock, has died at 84. https://t.co/Ekn9AugcM1",
  "data/tweet-nytimes/2021/8/1429761611212939269.json": "Ivermectin, an anti-parasitic drug commonly used for livestock, should not be taken to treat or prevent Covid-19, the FDA said on Saturday. https://t.co/ABc9AtUkXV https://t.co/rV33xERYTe",
  "data/tweet-nytimes/2021/8/1429759088305582081.json": "Watch how the coronavirus nefariously infiltrates the cells of a bat brain in this video, taken by Sophie-Marie Aicher and Delphine Planas, which received an honorable mention in the 2021 Nikon Small World in Motion Competition. https://t.co/MM4QuHDOwL https://t.co/cSSouFEB9O",
  "data/tweet-nytimes/2021/8/1429669754709626880.json": "When a Staten Island hospital implemented a coronavirus vaccine or testing mandate, some of its staff staged angry protests. Scientists point out that those who refuse vaccines are potentially endangering the lives of their patients. https://t.co/tLxriH28Tz",
  "data/tweet-nytimes/2021/8/1429650260784291853.json": "President Biden’s national security adviser, Jake Sullivan, said the threat of ISIS terrorists regaining a foothold in Afghanistan was of growing concern to security experts. “The threat is real,” he said. https://t.co/X1lQhbnZtj",
  "data/tweet-nytimes/2021/8/1429800957953589250.json": "Breaking News: The FDA granted full approval to the Pfizer-BioNTech vaccine, a first for a Covid shot in the U.S. It will pave the way for new vaccine mandates.\nhttps://t.co/Uq1PhlxWPi",
  "data/tweet-nytimes/2021/8/1429804589784653834.json": "Breaking News: New York City will require all education staff, including teachers and principals, to be vaccinated, a mandate that will affect about 148,000 workers.\nhttps://t.co/2gKd8foou3",
  "data/tweet-nytimes/2021/8/1429659678854848516.json": "Rachel Maddow, the top-rated anchor at MSNBC, has renewed her contract with the network, according to a person briefed on the deal. Maddow was reported to have expressed interest in leaving to pursue podcasting and streaming projects. https://t.co/Ko9q7M0BsD",
  "data/tweet-nytimes/2021/8/1429810691892985860.json": "The FDA granted full approval to Pfizer-BioNTech’s coronavirus vaccine for people 16 and older in the U.S.\n\nThe decision will set off a wave of vaccine requirements by hospitals, colleges, corporations and other organizations.\nhttps://t.co/PaRp5i0UFf https://t.co/abA6BFDe1o",
  "data/tweet-nytimes/2021/8/1429483530606759941.json": "As the Biden administration struggles to defend its chaotic withdrawal from Afghanistan and stanch a pandemic that appeared to be waning weeks ago, Democrats are increasingly worried about their ability to maintain power in Washington. https://t.co/I9sopogiXt",
  "data/tweet-nytimes/2021/8/1429839133321699334.json": "Breaking News: The Pentagon will mandate Covid vaccines for 1.4 million active duty U.S. service members, following the FDA approval of the Pfizer-BioNTech shot. Follow for updates: https://t.co/SjdvX8Iwhb",
  "data/tweet-nytimes/2021/8/1429864795898064905.json": "Mayim Bialik will temporarily take over weeknight hosting duties at “Jeopardy!” as the quiz show regroups after its new host, Mike Richards, stepped down after a furor over sexist and offensive comments he made on a podcast several years ago. https://t.co/QMVswfP33R",
  "data/tweet-nytimes/2021/8/1429862275083653127.json": "The decline in the mental health of children and adolescents and worsening suicide rates have led some states to allow students to take mental health days off from school. https://t.co/iBFEQSKDDa",
  "data/tweet-nytimes/2021/8/1429857032203538433.json": "Breaking News: Lt. Gov. Kathy Hochul, who will become New York’s first female governor just after midnight, selected two experienced political aides, both women, to fill her top administration posts. https://t.co/QOa98aWogB",
  "data/tweet-nytimes/2021/8/1429869857491800065.json": "Giant tortoises were believed to be herbivorous. For the first time, scientists in the Seychelles captured footage of one of the hulking reptiles stalking and killing a baby bird. \n\n\"It's totally surprising and rather horrifying,\" one said. https://t.co/ta60enangX https://t.co/5wm7hyIyGM",
  "data/tweet-nytimes/2021/8/1429981806208724996.json": "The Pentagon announced that it was moving ahead with plans to require all 1.4 million active-duty troops to be vaccinated following full federal approval for the Pfizer-BioNTech coronavirus vaccine for people 16 and older. https://t.co/GnjwZTWtkQ https://t.co/TCRzbicQlQ",
  "data/tweet-nytimes/2021/8/1429989372070449152.json": "North Carolina must immediately allow felons who are on parole, probation or supervised release to register to vote, a state court panel said on Monday. The ruling restores voting rights to a group of roughly 56,000 people that is disproportionately Black. https://t.co/THBYBcZYzL",
  "data/tweet-nytimes/2021/8/1429956656650199043.json": "A passenger and 26 crew members aboard the Carnival Vista tested positive for the coronavirus and the passenger later died. The company says its protocols successfully stopped further spread. https://t.co/VwohjTfdgz",
  "data/tweet-nytimes/2021/8/1430021557385146370.json": "Kathy Hochul, a former congresswoman from Buffalo, has become the first female governor of New York. https://t.co/AkYx6DcqJX",
  "data/tweet-nytimes/2021/8/1429996915630936064.json": "Within hours, the Pentagon, CVS, the State University of New York system and the New York City school system announced that they would enforce mandates they had prepared but made contingent on the FDA’s action. https://t.co/yYBZospayI",
  "data/tweet-nytimes/2021/8/1429922665893142531.json": "To map inequality in New York, you can just count trees or measure the temperature.\n\nIn early August, the sidewalk temperature on an East Harlem street was 31 degrees hotter than Central Park West. https://t.co/hzgbHhLRQ8",
  "data/tweet-nytimes/2021/8/1430149157776510999.json": "Airbnb said it intended to provide free temporary housing for 20,000 refugees fleeing the Taliban’s takeover of Afghanistan. https://t.co/E0jJ4nNmxp",
  "data/tweet-nytimes/2021/8/1430134059083223053.json": "Mexico is bringing a lawsuit against 10 gun manufacturers in a U.S. federal court, accusing them of knowingly facilitating the sale of guns to drug cartels in the country.\n\nHow did the case get to this point? Listen to today’s episode of The Daily.\nhttps://t.co/WV0gId130m",
  "data/tweet-nytimes/2021/8/1430145406307082245.json": "North Carolina must immediately allow felons who are on parole, probation or supervised release to register to vote, a state court panel said on Monday. The ruling restores voting rights to a group of roughly 56,000 people that is disproportionately Black. https://t.co/DhwFbLVzTE",
  "data/tweet-nytimes/2021/8/1430179365871046672.json": "Afghanistan’s flag was carried into the Paralympics opening ceremony by a volunteer after two of the country’s Paralympians were unable to travel to Tokyo to compete.\nhttps://t.co/Xk0soQGLzi",
  "data/tweet-nytimes/2021/8/1430202184801689605.json": "Afghan athletes were unable to attend The Tokyo Paralympic Games, which opened on Tuesday. But in a show of respect for the country’s two Paralympians, the flag of Afghanistan was carried into the parade by a volunteer. https://t.co/2WspzQWaJZ https://t.co/pkDwOVcB8A",
  "data/tweet-nytimes/2021/8/1430215489079365638.json": "Breaking News: Charlie Watts of the Rolling Stones has died at 80. His strong but unflashy drumming powered the band for over 50 years. https://t.co/lsSMjywwBa",
  "data/tweet-nytimes/2021/8/1430193191022628870.json": "Hawaii’s governor asked tourists to stay away as the islands face a surge in Covid-19 cases that is straining hospitals.\n\n“It’s not a good time to travel to the islands,” Gov. David Ige said.\nhttps://t.co/Z1HC5imZ4Y",
  "data/tweet-nytimes/2021/8/1430252338137255945.json": "“As much as Mick’s voice and Keith’s guitar, Charlie Watts’s snare sound is the Rolling Stones.\" https://t.co/CuzylD0x4Q https://t.co/Aa1Uug9rwO",
  "data/tweet-nytimes/2021/8/1430118965309804544.json": "Hawaii’s governor asked tourists to stay away as the islands face a surge in Covid-19 cases that is straining hospitals.\n\n“It’s not a good time to travel to the islands,” Gov. David Ige said.\nhttps://t.co/3peSdlTuax",
  "data/tweet-nytimes/2021/8/1430273734737338368.json": "Charlie Watts, who died on Tuesday at 80, was a vital part of the Rolling Stones’ sound, with rhythmic drumming that was as much a part of the Stones’ musical fingerprint as Keith Richards’s sharp-edged guitar or Mick Jagger’s sneering vocals. https://t.co/7Wkdd265EE",
  "data/tweet-nytimes/2021/8/1430285059899133959.json": "Unionized workers who make Oreos, Chips Ahoy!, and other Nabisco snacks are on strike in five states. The workers say they have often put in 16-hour days as demand for snack foods has increased during the pandemic. https://t.co/8AkBa9hXRO",
  "data/tweet-nytimes/2021/8/1430266200186134528.json": "Are cotton tote bags earth-friendly? Not exactly.\n\nAn organic cotton tote needs to be used 20,000 times to offset its overall impact of production, according to a 2018 study. That equates to daily use for 54 years. https://t.co/5xVfRc04h0",
  "data/tweet-nytimes/2021/8/1430303946418106368.json": "Massachusetts is preparing to require all students over age 5, regardless of vaccination status, to wear masks in the state’s public schools as early as Wednesday, a reversal for Gov. Charlie Baker. https://t.co/N7v6997OA2",
  "data/tweet-nytimes/2021/8/1430276253584699400.json": "Oregon is restoring a statewide outdoor mask mandate for both vaccinated and unvaccinated people. People will now be required to use face coverings indoors or out starting on Friday, Gov. Kate Brown announced. https://t.co/gYj2mqs8sF",
  "data/tweet-nytimes/2021/8/1430228443459883013.json": "Kathy Hochul, a former congresswoman from Buffalo, became New York's first female governor on Tuesday. She said she was intent on \"changing the culture of Albany.\" https://t.co/8jklJo9LQE https://t.co/3m6NAcSKkV",
  "data/tweet-nytimes/2021/8/1430341677877764100.json": "Ohio State University announced that all students, faculty and staff would be required to be vaccinated against Covid-19 during the fall semester, becoming one of the first large state universities to issue a vaccine mandate that extends beyond students. https://t.co/W2VFsxHOSP",
  "data/tweet-nytimes/2021/8/1430300158160515074.json": "On her first day in office, Gov. Kathy Hochul of New York said she would order a universal mask mandate in the state’s schools and push for Covid vaccine-or-test requirements for school employees.\nhttps://t.co/oeQuysuDMU https://t.co/6mJHxeBrG9",
  "data/tweet-nytimes/2021/8/1430351756467265538.json": "Goldman Sachs told employees on Tuesday that it will require anyone who enters the bank’s U.S. offices, including clients, to be fully vaccinated starting on Sept. 7, making it the most prominent Wall Street bank to issue such a broad requirement. https://t.co/Yhzptr3Y8W",
  "data/tweet-nytimes/2021/8/1430115179061260305.json": "When a Staten Island hospital implemented a coronavirus vaccine or testing mandate, some of its staff staged angry protests. Scientists point out that those who refuse vaccines are potentially endangering the lives of their patients. https://t.co/YRN9KBbGPA",
  "data/tweet-nytimes/2021/8/1430389490963652609.json": "Tom Fong, who owns one of the nation’s oldest Chinese restaurants, said his father never spoke much about his life, but he knew he had survived a shipwreck. It turned out to be the Titanic. The story is told in a new film. https://t.co/cLKNquUNqM",
  "data/tweet-nytimes/2021/8/1430366834189033473.json": "The school board in Philadelphia approved a resolution on Tuesday to mandate Covid-19 vaccinations for all its school district employees, joining a number of other school districts across the U.S.\nhttps://t.co/OyJs82JKtA",
  "data/tweet-nytimes/2021/8/1430122749813526536.json": "Kathy Hochul, a former congresswoman from Buffalo, made history by becoming the first female governor of New York. https://t.co/Hp1MUbA1Hi",
  "data/tweet-nytimes/2021/8/1430466255069360133.json": "Zhang Zhan, a Chinese journalist, was sentenced to four years in prison for documenting the Covid-19 outbreak in Wuhan. She is now seriously ill from a hunger strike and weighs less than 90 pounds, her former lawyer said.\nhttps://t.co/xFueD3utlL",
  "data/tweet-nytimes/2021/8/1430516531134451717.json": "Breaking News: About 89% of the federal funds meant to help renters avoid eviction during the pandemic has not been distributed, the U.S. Treasury Department said.\nhttps://t.co/55q18cBYY6",
  "data/tweet-nytimes/2021/8/1430522892945604612.json": "Ohio State University announced that all students, faculty and staff would be required to be vaccinated against Covid-19 during the fall semester, becoming one of the first large state universities to issue a vaccine mandate that extends beyond students. https://t.co/Eglg20MAD1",
  "data/tweet-nytimes/2021/8/1430540263009787915.json": "Delta Air Lines will require any employee who is unvaccinated to pay an additional $200 per month to stay on the company’s health care plan starting Nov. 1. Unvaccinated workers have to wear masks and will soon have to take weekly coronavirus tests. https://t.co/LYOSZ3H3dF",
  "data/tweet-nytimes/2021/8/1430504009304092677.json": "A booster shot of the Johnson &amp; Johnson vaccine dramatically raises the levels of antibodies against the coronavirus, the company reported.\n\nThe drugmaker hopes the new data will allow its shots to be included in President Biden’s booster plan.\nhttps://t.co/plnOiLx0Bl",
  "data/tweet-nytimes/2021/8/1430553102659248141.json": "Delta Air Lines will require unvaccinated employees to pay an additional $200 per month to stay on the company’s health care plan starting Nov. 1. The average coronavirus-related hospitalization has cost the company about $40,000 per person, the CEO said. https://t.co/iBAWd5sjgb https://t.co/YyHsDziXst",
  "data/tweet-nytimes/2021/8/1430476316961382405.json": "A group of Afghans who worked for The New York Times, along with their families, touched down in Mexico after a harrowing escape from Kabul.\n\nHere's how Mexican officials, unlike their U.S. counterparts, were able to offer them sanctuary, @benyt writes.\nhttps://t.co/nlL5nWaetG",
  "data/tweet-nytimes/2021/8/1430547022734635020.json": "OnlyFans reversed its decision to ban explicit content days after the move sparked backlash from creators who were beginning to leave the platform. https://t.co/83HsQyziZk",
  "data/tweet-nytimes/2021/8/1430290100508925963.json": "You can get cotton bags pretty much everywhere. How did an environmental solution become part of the problem? https://t.co/f0nW1PpKNM https://t.co/nqmEFzNjda",
  "data/tweet-nytimes/2021/8/1430560987602694157.json": "Breaking News: Aleksei Navalny gave his first interview from jail through 54 handwritten pages, detailing how he is forced to watch state TV for more than eight hours a day and why he still insists that for Russia, \"Putin is not eternal.\" https://t.co/mjWRWMOmIx",
  "data/tweet-nytimes/2021/8/1430516580614647819.json": "Uganda became the first African nation to receive refugees from Afghanistan after a request from the U.S. government.\n\nThe East African nation is the top fourth refugee host in the world, with nearly 1.5 million displaced people living within its borders.\nhttps://t.co/B1fsEf4Q7n",
  "data/tweet-nytimes/2021/8/1430636583527534598.json": "Breaking News: The first of 14 defendants in the plot to kidnap Gov. Gretchen Whitmer of Michigan was sentenced to six years. The plan was seen as a precursor to the Jan. 6 riot. https://t.co/0Aqya2rmUB",
  "data/tweet-nytimes/2021/8/1430638641089503236.json": "Members of an all-girls Afghan robotics team arrived in Mexico as part of the first group of evacuees to land there since the Taliban's takeover of Afghanistan. Other team members fled to Qatar and some have not been evacuated, according to a statement. https://t.co/paAWbfiAlu https://t.co/NUIjZ6biV2",
  "data/tweet-nytimes/2021/8/1430653738621022214.json": "The naked baby of Nirvana's 1991 album, \"Nevermind,\" is now 30 and suing former band members and Kurt Cobain's estate. https://t.co/C2sfZAeXkV",
  "data/tweet-nytimes/2021/8/1430666331649683456.json": "More people in Florida are catching the coronavirus, being hospitalized and dying of Covid-19 now than at any previous point in the pandemic — underscoring the perils of limiting public health measures as the Delta variant rips through the state. https://t.co/BE447XyeRf",
  "data/tweet-nytimes/2021/8/1430726714276057088.json": "A federal judge ordered sanctions against 9 pro-Trump lawyers, including Sidney Powell and L. Lin Wood, ruling that a lawsuit that they filed challenging the validity of the presidential election was \"a historic and profound abuse of the judicial process.\" https://t.co/hY7EXUOT0Y",
  "data/tweet-nytimes/2021/8/1430734282163691520.json": "The risk of heart inflammation is higher after coronavirus infection than after vaccination, according to a large new study. https://t.co/EFDD5QIUdx",
  "data/tweet-nytimes/2021/8/1430721666145992711.json": "The Episcopal Diocese of Maine will mandate coronavirus vaccines for all clergy and staff members, becoming one of the first religious authorities in the U.S. to require inoculations.\nhttps://t.co/hxXn6PIrR2",
  "data/tweet-nytimes/2021/8/1430247334030553097.json": "Satellite images of Kabul’s airport taken on Monday underscore the size of the crowds outside the gates. The area around the airport has been an epicenter of chaos for days. Some who have managed to gain entrance can be seen waiting on a tarmac. https://t.co/PK27TAamYE https://t.co/2SRoiRWd1k",
  "data/tweet-nytimes/2021/8/1430298471567876096.json": "The U.S. has a far higher share of seniors without full vaccine protection than many other wealthy countries, a New York Times analysis shows.\n\nEven as vaccinations pick up, many older Americans are deeply vulnerable. https://t.co/UaluTuMnER",
  "data/tweet-nytimes/2021/8/1430772053511221248.json": "Ahmad Massoud, the 32-year-old son of a legendary mujahedeen commander, is leading a budding resistance against the Taliban from a strategic valley just 70 miles north of Kabul. https://t.co/D3mdMWiR26",
  "data/tweet-nytimes/2021/8/1430639902748811268.json": "ESPN has taken Rachel Nichols off its NBA programming and canceled “The Jump,” the daily basketball show she hosted, the network said. The news comes one month after The New York Times reported on disparaging comments made by Nichols about Maria Taylor. https://t.co/vOPSUKT9DJ",
  "data/tweet-nytimes/2021/8/1430908110965669896.json": "Breaking News: Seven Capitol Police officers are suing Donald Trump, his allies and far-right groups in the latest effort to hold them accountable for the Jan. 6 riot. The suit implicates members of the Proud Boys, the Oath Keepers and Roger Stone. https://t.co/2NDobDYlpj",
  "data/tweet-nytimes/2021/8/1430906331385397259.json": "Breaking News: An explosion outside the Kabul airport has left an unconfirmed number of casualties, the Pentagon said, hours after warnings of a security threat. The explosion was at a main entryway where large crowds have been gathering in recent days. https://t.co/3gfhJCvLnM",
  "data/tweet-nytimes/2021/8/1430892630104166401.json": "Breaking News: An explosion rattled an area outside Hamid Karzai International Airport in Kabul on Thursday, the Pentagon confirmed, just hours after Western governments had warned of a security threat there.\nhttps://t.co/FrXBqSWvyQ",
  "data/tweet-nytimes/2021/8/1430935573179600899.json": "Illinois will require everyone over 2 years old to wear masks indoors and require all educators to be vaccinated or face regular testing, Governor J.B. Pritzker announced on Thursday. https://t.co/PuOyro6HKN",
  "data/tweet-nytimes/2021/8/1431011364634570764.json": "Breaking News: President Biden pledged to hunt down those responsible for the attacks at the Kabul airport on Thursday and said the frantic evacuation of U.S. citizens and allies would continue. \"We will hunt you down and make you pay,\" he said. https://t.co/VFfra1tXWl",
  "data/tweet-nytimes/2021/8/1430990943067463680.json": "Inge Ginsberg — a Holocaust survivor who helped American spies in Switzerland during World War II, wrote songs in Hollywood and fronted a heavy metal act in her nineties — has died at 99. https://t.co/UIStplj7NI",
  "data/tweet-nytimes/2021/8/1430497699820867593.json": "Un grupo de afganos que trabajaron para The New York Times aterrizó en México junto con sus familias tras una terrible huida de Kabul. Así fue como los funcionarios mexicanos, a diferencia de sus contrapartes en EE. UU., pudieron recibirlos, escribe @benyt.https://t.co/OEK3jfq83A",
  "data/tweet-nytimes/2021/8/1431046324720394244.json": "President Biden mourned the U.S. service members and Afghans killed in the attacks at the Kabul airport on Thursday and addressed those responsible: “We will hunt you down and make you pay.” https://t.co/YXINpuW0qb https://t.co/B8b7vvRhi3",
  "data/tweet-nytimes/2021/8/1430964538594275335.json": "An Afghan interpreter described his desperate battle to get his family out alive as he hid in Kabul.\n\n\"I kept thinking, after everything I did for the Americans. After all my hard work and risking my life, now this is what happens to my family?\" https://t.co/onurtxN8QV",
  "data/tweet-nytimes/2021/8/1430911674374971402.json": "Harvard’s organization of chaplains has elected as its next president an atheist named Greg Epstein. His appointment reflects a broader trend of young people who increasingly identify as spiritual but religiously nonaffiliated. https://t.co/5Rp13BfaPI",
  "data/tweet-nytimes/2021/8/1430892910749184009.json": "Afghan refugees and Americans who recently fled the Taliban's takeover are relieved to be in the U.S., but they fear for those left behind. “I felt heavy,” one woman said. “Everything I worked for, 20 years of work, crumbling in front of my eyes.” https://t.co/0aH02lMvTG",
  "data/tweet-nytimes/2021/8/1431074024415694848.json": "One year after becoming ill with the coronavirus, nearly half of patients in a large new study were still experiencing at least one lingering health symptom. https://t.co/JA2VkLwN4V",
  "data/tweet-nytimes/2021/8/1431099416463675394.json": "The front page of The New York Times for Aug. 27, 2021. https://t.co/KjB6jHOr5s",
  "data/tweet-nytimes/2021/8/1431114256624275458.json": "Inge Ginsberg — a Holocaust survivor who helped American spies in Switzerland during World War II, wrote songs in Hollywood and fronted a heavy metal act in her nineties — has died at 99. https://t.co/Zg8hu23DzW",
  "data/tweet-nytimes/2021/8/1431043840975192069.json": "This image shows the dense crowds of Afghans and U.S. troops at a gate outside Kabul’s airport on Thursday, just hours before two explosions ripped through the crowds and killed dozens of people. https://t.co/LV61Mr5jWu https://t.co/Hqyp2OYU28",
  "data/tweet-nytimes/2021/8/1430926790655188993.json": "The New Chief Chaplain at Harvard? An Atheist. https://t.co/Sp0utPobGy",
  "data/tweet-nytimes/2021/8/1431202349440241667.json": "A baby girl was born on an aircraft that carried her and her parents to safety from Afghanistan.\n\nHer name is Reach – after the aircraft's call sign. https://t.co/g8eDDG4fnl",
  "data/tweet-nytimes/2021/8/1431206588367446017.json": "One year after becoming ill with the coronavirus, nearly half of patients in a new study were still experiencing at least one lingering health symptom. https://t.co/3OCl888H4H",
  "data/tweet-nytimes/2021/8/1431038778295074820.json": "Facing a 990% increase in virus hospitalizations since July 9, Oregon has implemented some of the U.S.'s toughest restrictions. Beginning Friday, the state will mandate masks for vaccinated and unvaccinated people gathering closely in public, even outdoors.https://t.co/OgMmN1fJSa",
  "data/tweet-nytimes/2021/8/1431243888077987840.json": "A tiny number of doctors have had an outsize influence in spreading misinformation about Covid-19 and vaccines. Now, there's a growing call among medical groups to discipline them. https://t.co/kp9p2h4GXs",
  "data/tweet-nytimes/2021/8/1431134432023486469.json": "Lt. Michael Byrd, the Capitol Police officer who fatally shot a rioter during the Jan. 6 attack, said that pulling the trigger had been a “last resort” that stopped the mob from killing lawmakers. \n\n\"I know that day I saved countless lives,\" he said. https://t.co/0v7nLqEr2j",
  "data/tweet-nytimes/2021/8/1431084066040946689.json": "Maryland on Thursday prepared to join a growing list of states that have decided to require students and teachers to wear masks in school to combat the wave of coronavirus cases sweeping the U.S.\nhttps://t.co/fGXN7gAYXa",
  "data/tweet-nytimes/2021/8/1431294199257784333.json": "Cristiano Ronaldo will return to Manchester United, the team where he first established himself as one of the finest soccer players of this, and any, generation. He rejoins the Premier League team from Juventus on a two-year contract. https://t.co/m054caJ7uA",
  "data/tweet-nytimes/2021/8/1431304242606837768.json": "Breaking News: Florida school districts may impose mask mandates, a judge ruled, handing a defeat to Governor Ron DeSantis, who has said it's a decision for parents. https://t.co/3zJv5YZMHj",
  "data/tweet-nytimes/2021/8/1431270797407096836.json": "Steve Martin. Martin Short. Selena Gomez.\n\nThe three stars are teaming up for \"Only Murders in the Building,\" an arch sendup of cutthroat New York life that's also a murder mystery. https://t.co/mfuemPA52G",
  "data/tweet-nytimes/2021/8/1431353338415796229.json": "Rylee McCollum’s dad messaged his son on Thursday in Afghanistan, where McCollum’s Marine unit had deployed to help with evacuations at Kabul airport. “Hey man, you good?” he asked.\n\nMcCollum, a 20-year-old Marine and an expectant father, never answered. https://t.co/TXOfDMxild",
  "data/tweet-nytimes/2021/8/1431221227226648577.json": "India has given at least one Covid-19 vaccine shot to more than half of the eligible population, a milestone in a country that initially struggled to roll out enough doses for its 1.4 billion people. https://t.co/qZ9ToJvlbr",
  "data/tweet-nytimes/2021/8/1431406187229110272.json": "Rylee McCollum, a 20-year-old Marine, was a baby when the war in Afghanistan began. He became one of the last casualties of America’s longest war on Thursday when he and 12 other service members were killed in an attack that also killed scores of Afghans. https://t.co/V93S3EhcYH",
  "data/tweet-nytimes/2021/8/1431421299407130631.json": "Caleb Wallace, a leader in the anti-mask movement in central Texas, became infected with the coronavirus and has been lying in an intensive care unit for the past three weeks, clinging to life, his wife Jessica said on social media. https://t.co/tDn8Cz1Yo6",
  "data/tweet-nytimes/2021/8/1431441420204888068.json": "A New Orleans children’s hospital has so many Covid patients that a federal “surge team” was called in. “It’s just paralyzing,” a mother said. https://t.co/jXfTlpsCbY",
  "data/tweet-nytimes/2021/8/1431435140404817922.json": "Breaking News: The U.S. carried out its first reprisal strike since the Kabul airport attack and again warned Americans to leave the airport immediately. https://t.co/mcX544jv4V",
  "data/tweet-nytimes/2021/8/1431431360946876418.json": "As coronavirus cases surge again, a small number of hotels in the U.S. have announced that they will require proof of vaccination from guests and staff. https://t.co/qwjJF0bWJL",
  "data/tweet-nytimes/2021/8/1431315600220073984.json": "A New Orleans children’s hospital has so many Covid-19 patients that a federal \"surge team\" was called in to bolster an exhausted staff.\n\n\"You can't do anything. It's just paralyzing,\" a mother said as her infant son struggled to breathe. https://t.co/hDlFlhymWF",
  "data/tweet-nytimes/2021/8/1431607512038531072.json": "Caleb Wallace, a leader in the anti-mask movement in central Texas, became infected with the coronavirus and has been lying in an intensive care unit for the past three weeks, clinging to life, his wife Jessica said on social media. https://t.co/LAbbVvCFeA",
  "data/tweet-nytimes/2021/8/1431637706875023360.json": "An unvaccinated elementary school teacher infected with the Delta variant spread the virus to half of the students in a classroom, seeding an outbreak that eventually infected 26 people, according to a new report from the CDC. https://t.co/HqV9zx0txk",
  "data/tweet-nytimes/2021/8/1431597452134686727.json": "Britain has entered a strange new phase of the pandemic: The public has moved on, even if the virus has not. https://t.co/oJNxcLToRb",
  "data/tweet-nytimes/2021/8/1431710698200047622.json": "One of the last photos that Marine Sgt. Nicole Gee shared with her family shows her amid the chaos of Kabul, carefully cradling a baby.\n\nShe was killed not long after, one of two women in uniform who died during this week's suicide bombing. https://t.co/PGciEpuPB9",
  "data/tweet-nytimes/2021/8/1431703921102409731.json": "Ivermectin, an anti-parasitic drug commonly used for livestock, should not be taken to treat or prevent Covid-19, according to the FDA. https://t.co/pM3QhsHcel https://t.co/5gMJn8Qxbp",
  "data/tweet-nytimes/2021/8/1431783671221129216.json": "The risk of heart inflammation is higher after coronavirus infection than after vaccination, according to a large new study. https://t.co/NeL6v5LYzG",
  "data/tweet-nytimes/2021/8/1431818909464862723.json": "Some female hummingbirds can take on feathers to appear essentially identical to males to avoid being chased and pecked at. https://t.co/gKR4YB4ezf",
  "data/tweet-nytimes/2021/8/1431738402718851079.json": "In Opinion\n\nElliot Ackerman writes: “Never have I witnessed a greater, swifter collapse of competence than what I have seen with the U.S. evacuation of Afghanistan.” https://t.co/ew7IXSgmEX",
  "data/tweet-nytimes/2021/8/1431798808363642880.json": "Steve Martin. Martin Short. Selena Gomez.\n\nThe three stars are teaming up for \"Only Murders in the Building,\" an arch sendup of cutthroat New York life that's also a murder mystery. https://t.co/4TTaoVku5Q",
  "data/tweet-nytimes/2021/8/1431914577269198857.json": "Giant tortoises were believed to be herbivorous. For the first time, scientists in the Seychelles captured footage of one of the hulking reptiles stalking and killing a baby bird. \n\n\"It's totally surprising and rather horrifying,\" one said. https://t.co/5NCL8WhlcM https://t.co/BFZqPwtNoc",
  "data/tweet-nytimes/2021/8/1431951202405830663.json": "Caleb Wallace, a leader of the anti-mask movement in central Texas, has died after being infected with the coronavirus and spending three weeks in the ICU, his wife, Jessica, said on Saturday. He was 30. https://t.co/ttNmn2yy2b",
  "data/tweet-nytimes/2021/8/1431793754948743173.json": "He’s lap dancing on the devil and winning the internet. Hear how Lil Nas X is redefining what a pop star can be. https://t.co/1AuEh8FMK0 https://t.co/3o95gwi6DT",
  "data/tweet-nytimes/2021/8/1431884331866263555.json": "Faced with high stress levels among adolescents and a mental health crisis that includes worsening suicide rates, some states are now allowing students to declare a mental health day. https://t.co/dAOsrmhg2m",
  "data/tweet-nytimes/2021/8/1431980224690933761.json": "President Biden was set to fly to Dover Air Force Base in Delaware on Sunday morning to join the families of the 13 members of the U.S. military who were killed in a bombing last week in Afghanistan.\n\nThese are their names. https://t.co/S66t5TMGhp https://t.co/VfxtLQouWg",
  "data/tweet-nytimes/2021/8/1432025272430252035.json": "One of the last photos that Marine Sgt. Nicole Gee shared with her family shows her amid the chaos of Kabul, carefully cradling a baby.\n\nShe was killed not long after, one of two women in uniform who died during this week's suicide bombing. https://t.co/5JW9Eg1iZe",
  "data/tweet-nytimes/2021/8/1431778650995691534.json": "On the final day of her trip to Southeast Asia, Vice President Kamala Harris said that the U.S. would work with allies to protect women and children in Afghanistan.\nhttps://t.co/c4px8z11Oq",
  "data/tweet-nytimes/2021/8/1432046669466570753.json": "Ed Asner, the Emmy-winning character actor best known as Lou Grant, the gruff but lovable newsman first introduced on “The Mary Tyler Moore Show,” has died at 91. https://t.co/biw0osLwAm",
  "data/tweet-nytimes/2021/8/1431986034057916424.json": "The U.S. and 97 other countries said on Sunday that they would continue to take in people fleeing Afghanistan after the American military departs next week and had secured an agreement with the Taliban to allow safe passage for those who are leaving. https://t.co/23hraRArS2",
  "data/tweet-nytimes/2021/8/1432063029689077764.json": "Hurricane Ida made landfall near Port Fourchon, Louisiana on the 16th anniversary of Hurricane Katrina, slamming the southeastern coast with dangerous winds and storm surge.\n\nFollow for updates: https://t.co/HOEhC9sbT4 https://t.co/18ggIUBsU5",
  "data/tweet-nytimes/2021/8/1432065778577252352.json": "“I feel sick to my stomach watching this hurricane.\"\n\nAs Hurricane Ida closed in on the Louisiana coast on Sunday morning, meteorologists were stunned to watch the storm strengthen so quickly.\nhttps://t.co/V8PsaNQxnt",
  "data/tweet-nytimes/2021/8/1432070601334743050.json": "Hurricane Ida gained power faster than most storms. Because of climate change, such rapid strengthening is happening more often as hurricanes pick up more energy from ocean water that is warmer than before. https://t.co/oAQhz5YEdP",
  "data/tweet-nytimes/2021/8/1432090713731252226.json": "Watch: President Biden joined the families of 13 U.S. service members killed in a bombing at the Kabul airport in Afghanistan last week, as their remains were brought to Dover Air Force Base in Delaware. https://t.co/C3WXPwqgZK https://t.co/W7YEek8p4Y",
  "data/tweet-nytimes/2021/8/1432113365070098434.json": "Tens of millions of older Americans who cannot afford dental care may soon get help as Democrats maneuver to add dental benefits to Medicare for the first time in its history. https://t.co/uYqSCSYTOH https://t.co/z1mmwJZm2P",
  "data/tweet-nytimes/2021/8/1432086946973687813.json": "Students from the American University of Kabul have been denied flights out of the country by the U.S. military. \n\nAccording to four students, the university informed the group that their names and passport information had been shared with the Taliban. https://t.co/atcy6REbLr",
  "data/tweet-nytimes/2021/8/1432187084878532612.json": "Tens of millions of older Americans who cannot afford dental care may soon get help as Democrats maneuver to add dental benefits to Medicare for the first time in its history. https://t.co/K27A3tl9rJ",
  "data/tweet-nytimes/2021/8/1432166194677698565.json": "“I feel sick to my stomach watching this hurricane.\"\n\nAs Hurricane Ida closed in on the Louisiana coast on Sunday morning, meteorologists were stunned to watch the storm strengthen so quickly.\nhttps://t.co/3KTU6HGqoE",
  "data/tweet-nytimes/2021/8/1432324747505946630.json": "Family members said 10 people, including seven children, were killed by a U.S. drone strike in Kabul on Sunday.\n\n“At first I thought it was the Taliban,” one survivor said. “But the Americans themselves did it.” https://t.co/R0EzvPAgJg",
  "data/tweet-nytimes/2021/8/1431768622339444740.json": "A silent majority of American workers do want to get back to the office, at least for a few days a week. As coronavirus cases rise and companies keep workplaces closed, these frustrated employees can’t wait to return to their cubicles.\n\nhttps://t.co/ele90OIqRB",
  "data/tweet-nytimes/2021/8/1432372722030583808.json": "Breaking News: The E.U. recommended reimposing travel restrictions for unvaccinated U.S. visitors. The change is not mandatory, and each member state imposes its own rules and can decide whether to follow the guidelines.\nhttps://t.co/17HjDNNhm9",
  "data/tweet-nytimes/2021/8/1432120900263063555.json": "“I’m convinced this movie couldn’t have been done in the U.S.” When “Y Tu Mamá También” opened in Mexico, the movie upended the lives of its filmmakers and stars. Twenty years later, they revisit the film in an interview with The New York Times. https://t.co/9sbn9d2QO7",
  "data/tweet-nytimes/2021/8/1432368811366305800.json": "President Biden made an unannounced appearance at Dover Air Force Base on Sunday to receive the remains of the 13 soldiers killed in the Kabul bombing. They were on their way from Afghanistan, via Kuwait and Germany, to final rest in the U.S. https://t.co/LQx1MGeOO3 https://t.co/3ig6WBzZ2K",
  "data/tweet-nytimes/2021/8/1432387689655984137.json": "The $14.5 billion flood-protection system built around New Orleans after Hurricane Katrina seems to have succeeded at keeping the city from going underwater again. But that narrow success doesn’t mean residents are safe, as many remain without power. https://t.co/H5VL3Mg86y",
  "data/tweet-nytimes/2021/8/1432400180440178688.json": "Breaking News: The Education Department is investigating five states with bans on mask mandates, saying they may run afoul of civil rights laws protecting students with disabilities. https://t.co/3WL8NUi7Cs",
  "data/tweet-nytimes/2021/8/1432380138310733830.json": "Though it has not been shown to be effective in treating Covid-19, people are now clamoring to get ivermectin, an anti-parasite drug commonly used in animals.\n\n\"You are not a horse,\" the Food and Drug Administration tweeted on Aug. 21. https://t.co/iFPefnv7UO",
  "data/tweet-nytimes/2021/8/1432332304379269121.json": "The coronavirus has caused “the most catastrophic disruption of education in history,” and it’s vital for children’s learning and mental health that schools take measures to open and continue in-person lessons, the WHO’s top European official said. https://t.co/PQV8iSat2q",
  "data/tweet-nytimes/2021/8/1432442250416599044.json": "Breaking News: The U.S. military has departed Afghanistan, officials said, ending a 20-year occupation and leaving the country in the Taliban’s hands. https://t.co/0Ef0cGJs41",
  "data/tweet-nytimes/2021/8/1432244222695026688.json": "Average daily Covid hospitalizations in the U.S. surpassed 100,000 patients over the past week, a level not seen since the peak last winter. https://t.co/FBYVLPwHKw",
  "data/tweet-nytimes/2021/8/1432453246652723205.json": "The home page of The New York Times at 5:20 p.m. Eastern on Aug. 30, 2021. https://t.co/klS0wPzeML",
  "data/tweet-nytimes/2021/8/1432444280874881029.json": "New data confirm that the Pfizer-BioNTech and Moderna Covid-19 vaccines carry a small risk of rare heart problems, most common in adolescent boys and young men. Still, the benefits of vaccination outweigh the risks, scientists said. https://t.co/2wjGnspaqH",
  "data/tweet-nytimes/2021/8/1432531101440954378.json": "A federal judge on Monday struck down a Trump-era environmental rule that allowed the discharge of pollutants such as fertilizers, pesticides and industrial chemicals into millions of streams and wetlands across the U.S. https://t.co/9WPohWsIG5",
  "data/tweet-nytimes/2021/8/1432435481703223309.json": "In Opinion\n\n“What’s beyond debate is that Biden’s execution of his own policy has been a fiasco,” Bret Stephens tells Gail Collins in their latest conversation. “He made the United States look humiliated, incompetent and weak.” https://t.co/T9jUtQTg4k",
  "data/tweet-nytimes/2021/8/1432424152418369538.json": "\"Conditions are still severe throughout the city of New Orleans,\" Mayor LaToya Cantrell said Monday after about a million customers were without power following Hurricane Ida. Follow for updates. https://t.co/JaCG6pGVE3 https://t.co/KlFGxfOT7f",
  "data/tweet-nytimes/2021/8/1432541183771881473.json": "The front page of The New York Times for Aug. 30, 2021. https://t.co/O8L63XG5Dk",
  "data/tweet-nytimes/2021/8/1432376342750826500.json": "Defense Department officials said a drone strike in Kabul on Sunday had blown up a vehicle laden with explosives. But survivors said 10 people, including seven children, were killed.  \n\n\"I saw the whole scene. There were burnt pieces of flesh everywhere.\" https://t.co/qpBBypDBkG https://t.co/iOdNIkkON8",
  "data/tweet-nytimes/2021/8/1432503418082504710.json": "The last U.S. forces left Afghanistan late Monday, ending a 20-year occupation that cost over $2 trillion, took more than 170,000 lives, left behind tens of thousands of Afghans and ultimately failed to defeat the Taliban. https://t.co/XurOiLd0Xc",
  "data/tweet-nytimes/2021/8/1432619455515926528.json": "The front page of The New York Times for Aug. 31, 2021. https://t.co/hL9nNirZri",
  "data/tweet-nytimes/2021/8/1432451820023128064.json": "China has tightened restrictions on online gaming. Children and teenagers can't play on school days, and are limited to an hour a day of gaming on Fridays, weekends and holidays. https://t.co/htoHm8rDTJ",
  "data/tweet-nytimes/2021/8/1432684597817626628.json": "About 70% of adults in the EU have been fully vaccinated against the coronavirus, officials said, a milestone that puts the bloc among the world’s leaders in vaccinations despite a fumbling start. https://t.co/tyTBSXdZAv",
  "data/tweet-nytimes/2021/8/1432706015087276045.json": "A federal judge on Monday struck down a Trump-era environmental rule that allowed the discharge of pollutants such as fertilizers, pesticides and industrial chemicals into millions of streams and wetlands across the U.S. https://t.co/AwG1u88hy6",
  "data/tweet-nytimes/2021/8/1432741353549668355.json": "Breaking News: Mike Richards, who lasted one day of filming as host of \"Jeopardy!,\" will exit the job of executive producer as well, Sony said. https://t.co/S9O3Vrrm26",
  "data/tweet-nytimes/2021/8/1432717333928321032.json": "The lashing winds have ceased and the downpours have stopped, but despite Hurricane Ida’s departure from Louisiana, recovery is far away for a state that is no stranger to storms and their aftermath. https://t.co/Sf0AuMLMuV https://t.co/OTo1f6mK8X",
  "data/tweet-nytimes/2021/8/1432707275060301831.json": "Florida is cutting funds to school districts that defied Gov. Ron DeSantis’s ban on mask mandates. It is one of five states being investigated by the U.S. Education Department over such prohibitions. https://t.co/9c4E6t1qvJ",
  "data/tweet-nytimes/2021/8/1432772684123975680.json": "A New Jersey woman who went by AntiVaxMomma on Instagram was charged in Manhattan on Tuesday with a conspiracy to sell hundreds of fake coronavirus vaccination cards over the social media platform. https://t.co/slumYpnLCs",
  "data/tweet-nytimes/2021/8/1432800393302532100.json": "Social Security will be depleted in 2033, a year earlier than previously projected, according to a government report, as the pandemic has drained revenues and put additional strain on one of the U.S.’s most important social safety net programs. https://t.co/FmiLY5UNsL",
  "data/tweet-nytimes/2021/8/1432797424154779666.json": "President Biden on Tuesday vehemently defended his decision to end America’s war in Afghanistan, saying the choice was \"between leaving or escalating.\" \n\n\"I was not going to extend this forever war,\" Biden declared. https://t.co/hJ4fh29LNA",
  "data/tweet-nytimes/2021/8/1432829343798005763.json": "President Biden defended his decision to end America's 20-year war in Afghanistan, a day after the U.S. closed a two-week evacuation of 125,000 people from Kabul that saw the deaths of 13 U.S. service members and dozens of Afghan civilians. https://t.co/G5eSF6iiRV https://t.co/zy5eQwbhsR",
  "data/tweet-nytimes/2021/8/1432836874888962054.json": "President Biden on Tuesday hailed what he called the \"extraordinary success\" of the evacuation of Kabul as he vehemently defended his decision to end America's 20-year war in Afghanistan. https://t.co/I6YgFzTVna https://t.co/ltGxIkSzvz",
  "data/tweet-nytimes/2021/8/1432770354032820226.json": "Scientists say that Ida is a harbinger of future hurricanes. \"If our planet continues to warm at the alarming pace that it is warming, then Ida is an example of what we might expect to see in the future,\" said a meteorologist. \"That’s very scary.\" https://t.co/F3M7b4xQdn",
  "data/tweet-nytimes/2021/8/1432840653269094404.json": "Seven Black men who were executed 70 years ago for the rape of a white woman were posthumously pardoned on Tuesday by Virginia's governor, who said that the group, known as the Martinsville Seven, was denied due process because of race. https://t.co/gwRyj7faOI",
  "data/tweet-nytimes/2021/8/1432823770281091074.json": "Pennsylvania’s governor announced a statewide mask requirement for all schools. Masks will be required for teachers, staff and visitors in public and private schools, early learning programs and child care centers in the state beginning Sept. 7. https://t.co/KJd6mj3RYG",
  "data/tweet-nytimes/2021/8/1432599049815814144.json": "Black Americans die at higher rates than white Americans at nearly every age. \n\nSome clues on why the health care system fails Black Americans can be found in a document written over 100 years ago: the Flexner Report. https://t.co/pLJPQuP4uL"
}