{
  "data/tweet-quora/2022/2/1488965648717950989.json": "What is up with the Finnish language? Steven Haddock explains: https://t.co/m2Nn3kSsFw",
  "data/tweet-quora/2022/2/1489057309770850304.json": "What type of plastic surgery would a plastic surgeon tell you not to get? Find out from plastic surgeon R. Laurence Berkowitz, MD: https://t.co/wIIeaVXarI https://t.co/NvtK89bUjt",
  "data/tweet-quora/2022/2/1489374974754181120.json": "What would you like to see us discuss? https://t.co/dBMh5qfTo9",
  "data/tweet-quora/2022/2/1489678714073870340.json": "Who's working on their novel this weekend? Quora writer @mercedeslackey gives the perfect demonstration of Goodhart's law applied to the bestseller category: https://t.co/VaJWksTMWv",
  "data/tweet-quora/2022/2/1490022511463051269.json": "Did you know that Arthur, as in King Arthur, was just a nickname? Claire Jordan, folklore expert, tells us about the real King Arthur https://t.co/2VbxMOXpGk https://t.co/itUAgoOf8m",
  "data/tweet-quora/2022/2/1490445273625157636.json": "How many megapixels would our eyes be? Steve Baker explains how our eyes are not at all like a digital camera: https://t.co/qUugBnRTV4 https://t.co/GzyvflXZ0E",
  "data/tweet-quora/2022/2/1490460355037995011.json": "Will CEO Elizabeth Holmes face jail time for the Theranos scandal? Former federal prosecutor and founder of @WestCoastTrial, Neama Rahmani, shares his insights: https://t.co/Zc1fFW6v85 https://t.co/xBVMjfdrgA",
  "data/tweet-quora/2022/2/1490756575484465153.json": "Did you know that Queen Amidala from Star Wars: The Phantom Menace was based on a real person? Tomas Hernandez tells the heart-breaking story of what happened to her: https://t.co/YcPFyWDKzo https://t.co/hH7GWXMH3k",
  "data/tweet-quora/2022/2/1491166810724618240.json": "Oscar nominations were announced today. Interested in the art of film making? We'll be sharing answers over awards season that might interest you. Let's start with @NorthwesternU professor, Clayton Brown, explaining why green screens are green: https://t.co/3OMnkGGuqS",
  "data/tweet-quora/2022/2/1491501915061972993.json": "Everyone knows about Martin Luther King, but do you know about Fred Hampton's contributions to civil rights? Read about it in this answer from Robert Strickland in the Black History Space: https://t.co/Q0nRCQxpwm https://t.co/wtQq52GTsP",
  "data/tweet-quora/2022/2/1491560311786127365.json": "At Quora, we talk a lot about sharing knowledge, but what do we mean by that? When you think of knowledge, you may first think about one specific kind - knowing facts about the world. This is referred to in @vervaeke_john's lectures as perspectival knowing, but there are others!",
  "data/tweet-quora/2022/2/1491857162385051657.json": "Did Harriet Tubman have an adopted daughter? Here's what historians think: https://t.co/HXKvOlyXjE https://t.co/2rJf7eewBf",
  "data/tweet-quora/2022/2/1492529195607629833.json": "How can you use statistics to increase your changes of school admissions? CEO, Crimson Education, @JamieBeaton_nz, explains two crucial ways you can use numbers to your advantage. https://t.co/kaIeT062GS https://t.co/Tgea5HWhpu",
  "data/tweet-quora/2022/2/1493349700526698497.json": "Have you ever seen a firetruck with an oddly-specific notice to stay back 343 feet? Firefighter David Wayne explains why: https://t.co/xC1bTk2ljv",
  "data/tweet-quora/2022/2/1493671509511995395.json": "Why is a green screen green and not some other color? Clayton Brown explains the science behind it: https://t.co/3OMnkGY5iq",
  "data/tweet-quora/2022/2/1494061360392462340.json": "Did you know that King Nebuchadnezzar II, famous for the Hanging Gardens of Babylon, built an enormous labyrinth around his palace that still exists today? Silvia Serra shares the story in the Wonders of the Past Space: https://t.co/lfvP23Dhmf https://t.co/RGhBj4CVo5",
  "data/tweet-quora/2022/2/1494093658940915715.json": "President &amp; CEO of @sffed (San Francisco Federal Reserve), @MaryDalyEcon answers the questions everyone wants to know: Will the labor market improve in 2022? And why are so many job openings not getting filled? https://t.co/SKoe6wLRTt https://t.co/QdZXKWW5EW"
}