{
  "data/tweet-nytimes/2022/3/1498451756547657734.json": "Putin has tried to control news outlets, social media and the opposition. Yet protests over the war in Ukraine still broke out. @sheeraf and @antontroian discuss Russian public opinion on Tuesday at 12 p.m. ET. DM questions to @nytimesevents. https://t.co/3fGr5m9yvk",
  "data/tweet-nytimes/2022/3/1498447987433000965.json": "News Analysis: After miscalculating Ukraine’s resolve to fight, Russian forces are turning to an old pattern of firing on cities and mounting sieges. https://t.co/LktaeJhlOX",
  "data/tweet-nytimes/2022/3/1498474364269998087.json": "Three members of Russia’s rubber-stamp Parliament have criticized their country’s war in Ukraine, a rare episode of dissent from within the Russian establishment. https://t.co/mopHtyoJU9",
  "data/tweet-nytimes/2022/3/1498464792243281926.json": "Senator Richard Durbin has called on the Biden administration to offer Temporary Protected Status to thousands of Ukrainians who are temporarily working or studying in the U.S., allowing them to stay without fear of deportation. https://t.co/YByruo2jaK",
  "data/tweet-nytimes/2022/3/1498459285117976576.json": "About half a million refugees have fled Ukraine since Russia’s invasion began last week, according to the United Nations refugee agency.\n\nAbout half of them crossed the western border to Poland. Others have gone to Hungary, Moldova, Romania and Slovakia.\nhttps://t.co/ktF9ultRmZ https://t.co/mNzTg2PvWr",
  "data/tweet-nytimes/2022/3/1498490713746681857.json": "President Volodymyr Zelensky called on Monday for an international tribunal to investigate and punish Russia for its actions in Ukraine, which he described as war crimes. https://t.co/Ra39PmfOJr",
  "data/tweet-nytimes/2022/3/1498478165362200581.json": "Disney said on Monday that it was “pausing” theatrical releases in Russia, including the Pixar film “Turning Red,” which was scheduled to release there on March 10. https://t.co/75KNP8nY9P",
  "data/tweet-nytimes/2022/3/1498470632438353922.json": "The prosecutor of the International Criminal Court said Monday that he will pursue an investigation into the war in Ukraine, citing a “reasonable basis to believe that both alleged war crimes and crimes against humanity have been committed.” https://t.co/9sycoJn4IV",
  "data/tweet-nytimes/2022/3/1498488213626884104.json": "The first talks between Ukraine and Russia aimed at halting the Russian invasion were eclipsed Monday by a deadly Russian rocket assault on Kharkiv, Ukraine’s second-largest city, that killed at least nine civilians and wounded dozens. https://t.co/42Hm2jl7iS",
  "data/tweet-nytimes/2022/3/1498504561656479749.json": "When \"wiper\" malware appeared to target Ukraine a few hours before Russia's invasion, Microsoft stepped in, throwing itself into the middle of a war. https://t.co/wM51WB5G43",
  "data/tweet-nytimes/2022/3/1498468080267182080.json": "The U.S. said Monday that it would expel 12 Russian diplomats from Moscow’s UN mission, saying they were actually intelligence operatives who had spied on the United States. https://t.co/JGl93kGyV1",
  "data/tweet-nytimes/2022/3/1498523459567202306.json": "In Opinion\n\nThe idealism of Ukrainians \"has turned out to be a powerful weapon,\" writes Michelle Goldberg. \"They’ve shown older democracies what it means to fight for their own putative values, leading to an almost ecstatic global outpouring of support.\" https://t.co/Wt1zYoIDSX",
  "data/tweet-nytimes/2022/3/1498513379144650755.json": "Cryptocurrency investors have donated more than $22 million worth of digital assets to the Ukrainian government and a nonprofit supporting the country’s military, according to data provided by the blockchain tracking firm Elliptic. https://t.co/Zf8Np4nQjN",
  "data/tweet-nytimes/2022/3/1498536862637608962.json": "Internet terminals sent by Elon Musk have arrived in Ukraine, according to the country's vice prime minister. The terminals were designed to work with satellites orbiting in space to provide internet access. https://t.co/6DVMHeaH9G",
  "data/tweet-nytimes/2022/3/1498463050424373250.json": "Republican congressional leaders on Monday denounced the actions of two House Republicans — Representative Marjorie Taylor Greene of Georgia and Representative Paul Gosar of Arizona — who participated in a far-right conference with ties to white supremacy. https://t.co/n8CYa8ztlu",
  "data/tweet-nytimes/2022/3/1498550564933804036.json": "As antiwar protests continued across Russia, the police detained at least 411 people in 13 cities on Monday, an activist group said. \n\nThe protests are a remarkable display of defiance in a country where prison terms are sometimes sought for demonstrators. https://t.co/etECbB73Gn https://t.co/zooLbvDvhe",
  "data/tweet-nytimes/2022/3/1498518529125015552.json": "For many Afghans who fled during the Taliban takeover, the few personal items they could grab are now their only tangible ties to the world they left behind. For Tahera Ahmadi, who sold her jewelry to afford the travel, it was a pin from her eldest sister. https://t.co/uhNHcQiQeL https://t.co/2Xjr3tiXBR",
  "data/tweet-nytimes/2022/3/1498598946989608960.json": "Valery Gergiev, a Russian maestro and prominent supporter of President Vladimir Putin of Russia, was removed from his post as chief conductor of the Munich Philharmonic after he refused to denounce Russia’s invasion of Ukraine.\nhttps://t.co/fCE9W6B2dG",
  "data/tweet-nytimes/2022/3/1498583871071436809.json": "An enormous explosion hit central Kharkiv, directly in front of a government building in Ukraine’s second largest city, officials said.\n\nVideo of the attack showed a large fireball that appeared to engulf several cars driving through the area.\nhttps://t.co/JjIV2DXnKZ https://t.co/oEboRgSgpU",
  "data/tweet-nytimes/2022/3/1498621339602673665.json": "Internet terminals sent by Elon Musk have arrived in Ukraine, according to the country's vice prime minister. The terminals were designed to work with satellites orbiting in space to provide internet access.\nhttps://t.co/uPI9IVWicq",
  "data/tweet-nytimes/2022/3/1498618157984100355.json": "Lee Young-ae, a South Korean actress popular in Ukraine, donated $83,500 to help the victims of war there, the Ukrainian ambassador-designate to Seoul​ said​.\n\nLee said she hoped that “the Ukrainian people will not lose hope and courage.”\nhttps://t.co/R0DJVCk9X5"
}