{
  "data/tweet-nytimes/2022/4/1509687016732123140.json": "President Biden announced on Thursday that the U.S. would release up to 180 million barrels of oil from a strategic reserve to counteract the economic impact of Russia’s invasion of Ukraine.\nhttps://t.co/86ha1QTWVn https://t.co/ZDxwm36APQ",
  "data/tweet-nytimes/2022/4/1509712169058897924.json": "A bill to limit the cost of insulin to $35 a month for most Americans who depend on it passed the House on Thursday. To become law, the bill will need to attract at least 10 Republican votes in the Senate to overcome a filibuster. https://t.co/E0FkuiRN6P",
  "data/tweet-nytimes/2022/4/1509694552986300421.json": "A law keeps personal census data secret for 72 years. The 1950 census goes public on Friday, a bonanza for historians and the merely curious. https://t.co/rLCkybleho",
  "data/tweet-nytimes/2022/4/1509727310710284296.json": "Russia is running its military campaign against Ukraine out of Moscow, with no central war commander on the ground to call the shots, according to American officials who have studied the five-week-old war. https://t.co/SPNJJZsCh2",
  "data/tweet-nytimes/2022/4/1509799241937723398.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/4prgyfysgf",
  "data/tweet-nytimes/2022/4/1509855670782283779.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/ZMPpOhC3OL https://t.co/XjNMQCiXmi",
  "data/tweet-nytimes/2022/4/1509852093439426565.json": "The U.S. Navy will name a new ship after the late Supreme Court Justice Ruth Bader Ginsburg.\n\nThe ship will join a class of vessels named after those who have fought for civil and human rights, including Harvey Milk, Robert F. Kennedy and Sojourner Truth.\nhttps://t.co/T1RDtIUw7w",
  "data/tweet-nytimes/2022/4/1509853035635388425.json": "Breaking News: Pope Francis apologized for the Roman Catholic Church’s role in a system of Canadian schools that abused Indigenous children for 100 years. He also promised to visit Canada as part of a process of healing and reconciliation. https://t.co/OjDnsLycH6",
  "data/tweet-nytimes/2022/4/1509870464491048960.json": "President Vladimir Putin of Russia is “a man in a cage he built himself” because of his decision to invade Ukraine, and he has damaged both his own nation and its army, Britain’s defense minister said.\nhttps://t.co/TgAbXgnw2U",
  "data/tweet-nytimes/2022/4/1509848328682590208.json": "The UN’s nuclear watchdog is looking into reports that some Russian soldiers who left the shuttered Chernobyl nuclear plant have radiation poisoning. They pulled out on Thursday, five weeks after seizing it, Ukraine’s state-run energy company said.\nhttps://t.co/OZOqLSSogV",
  "data/tweet-nytimes/2022/4/1509872452674936837.json": "Breaking News: The U.S. hiring spree continued in March, with employers adding 431,000 jobs, another sign of the economy’s resilience amid uncertainty. The unemployment rate was 3.6%, down from 3.8% a month earlier.\nhttps://t.co/01QmNXaJsz",
  "data/tweet-nytimes/2022/4/1509923567097556994.json": "Two low-flying Ukrainian helicopters crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, a regional governor said — the first time Russia has reported a Ukrainian airstrike on its territory since the war began. https://t.co/LA8CKJBFA1 https://t.co/5qEArPIFkh",
  "data/tweet-nytimes/2022/4/1509933257604964357.json": "Breaking News: Amazon workers voted to unionize at a massive New York warehouse, in a stunning win for a campaign targeting the second-largest employer in the U.S. and one of the biggest victories for organized labor in a generation. https://t.co/Jy5WDa21j4",
  "data/tweet-nytimes/2022/4/1509928598010044424.json": "Jen Psaki, the White House press secretary, is in advanced talks to join MSNBC after she leaves the Biden administration, according to two people familiar with the negotiations. She could leave the White House as soon as next month, one of the people said. https://t.co/GqmGB1iWmM",
  "data/tweet-nytimes/2022/4/1510007873153216513.json": "Two low-flying Ukrainian helicopters crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, a regional governor said — the first time Russia has reported a Ukrainian airstrike on its territory since the war began. https://t.co/LRzAFogyxd https://t.co/eoMatzd91w",
  "data/tweet-nytimes/2022/4/1510024233048489985.json": "Standing outside the Brooklyn office where Amazon unionization ballots were tallied, Christian Smalls, a former employee who started organizing workers before he was fired, popped a bottle of champagne: “To the first Amazon union in American history.\" https://t.co/flfFQyzM69 https://t.co/nc8oA211Ct",
  "data/tweet-nytimes/2022/4/1509956290805653506.json": "At 26, Sammy Basso is believed to be the oldest person with Progeria, an exceedingly rare and fatal disease that afflicts only about one in 18 million people. And now he’s researching it, hoping to find a treatment and the secrets of aging.\nhttps://t.co/1eRGoNgg7x https://t.co/2gsbjtXcVk",
  "data/tweet-nytimes/2022/4/1509946218998382602.json": "\"Putin is not the force he used to be\": Britain’s defense minister said that Russia’s army was \"exhausted\" and that its reputation \"has been trashed\" because of President Vladimir Putin's decision to invade Ukraine. https://t.co/tGsXhkj8al https://t.co/r6orvRlsQB",
  "data/tweet-nytimes/2022/4/1509999097427730435.json": "Amazon workers voted to unionize in a New York warehouse, in one of the biggest wins for organized labor in a generation.\n\nIn 2020, we interviewed Christian Smalls, who was fired by Amazon after protesting safety conditions and now is the union’s leader. https://t.co/vCod2WY6lU",
  "data/tweet-nytimes/2022/4/1510035581212016656.json": "Breaking News: Will Smith, who slapped the comedian Chris Rock at the Oscars, said he was resigning from the Academy of Motion Picture Arts and Sciences. https://t.co/wovv3Oo3FZ https://t.co/DID2mo6VAo",
  "data/tweet-nytimes/2022/4/1510067009551278085.json": "Breaking News: The Biden administration will work with allies to transfer Soviet-made tanks to bolster Ukrainian defenses, the first time the U.S. has done so. https://t.co/TxAH9vuIsk",
  "data/tweet-nytimes/2022/4/1510089666162266114.json": "Western diplomats and independent military analysts say the Russian pullback from Kyiv is real, a sign that Moscow’s initial strategy has failed in the face of grave planning failures, logistical problems and fierce and effective Ukrainian resistance. https://t.co/RDQAQ892pd",
  "data/tweet-nytimes/2022/4/1510029255140331530.json": "Ukraine’s army claims to be in control of dozens of towns to the west and east of Kyiv where some of the most intense fighting of the war has happened. If the stated gains hold up, it would mark the largest shift in fighting around the capital in weeks. https://t.co/D70MfQ1Ft1",
  "data/tweet-nytimes/2022/4/1510225602594447368.json": "Female patients and people of color are more likely to have their symptoms dismissed by medical providers, studies show.\nNew York Times readers shared their experiences with what many refer to as \"medical gaslighting.\" Read more: https://t.co/D6VUOktwR9 https://t.co/6e16d2cYCC",
  "data/tweet-nytimes/2022/4/1510180269411741698.json": "Polls and interviews show many Russians now accept President Putin’s assertion that their country is under siege from the West and had no choice but to attack. The war’s opponents are leaving the country or keeping quiet. https://t.co/ACsLJA9hXw",
  "data/tweet-nytimes/2022/4/1510050662498902017.json": "Sarah Palin is joining the crowded race for Alaska’s lone congressional seat, which was left vacant by the unexpected death of Don Young. https://t.co/lIWXXZbNca",
  "data/tweet-nytimes/2022/4/1510284693937311754.json": "Kyiv was the key target for Russia. It’s the heart of Ukraine and the seat of its government. But despite more troops and firepower, Russia’s advance there has failed. Here’s why. https://t.co/RMYLZ5Bptd",
  "data/tweet-nytimes/2022/4/1510307351466762248.json": "The next wave of Covid-19 is coming. Are you ready?\n\nThe culprit this time is BA.2, a subvariant of the Omicron variant. Nobody knows for sure how much havoc it will cause, but BA.2 is now the dominant strain in the United States and around the world. https://t.co/l8Fk8H5VT7 https://t.co/uVas8ndi7g",
  "data/tweet-nytimes/2022/4/1510320992127799297.json": "Amazon spent millions to fight worker unrest. The company deployed an “incident commander,\" according to court documents.\n\nUnion organizers in New York had a budget of $120,000. They deployed TikToks, homemade ziti and free marijuana.\n\nHere's how they won. https://t.co/e3jp9q8eco",
  "data/tweet-nytimes/2022/4/1510105245631848449.json": "In a new special, the stand-up comic Jerrod Carmichael reveals that he is gay and has been lying about it for years. Stylishly directed by Bo Burnham, the special, “Rothaniel,” grapples with the roots of his silence — and the price of breaking it. https://t.co/xBWIKQDHWy",
  "data/tweet-nytimes/2022/4/1510326221644738565.json": "Tesla said it delivered 310,000 vehicles from January through March, up from 185,000 cars during the same period in 2021. The nearly 70 percent increase was in contrast with major carmakers like General Motors and Toyota, which reported big sales declines. https://t.co/mCNjxKcXhV",
  "data/tweet-nytimes/2022/4/1510314895488782337.json": "The attorney general’s deliberative approach to Jan. 6 has frustrated Democratic allies of the White House and, at times, President Biden himself. Biden said privately that he wanted Garland to act less like a ponderous judge and more like a prosecutor. https://t.co/N2DDZvaJ2M",
  "data/tweet-nytimes/2022/4/1510250707097726977.json": "The photographer, Maks Levin, was shot by Russian armed forces with “small arms fire” and a criminal investigation into his death is underway, according to the office of Ukraine’s prosecutor general. https://t.co/HepY8kyGC5",
  "data/tweet-nytimes/2022/4/1510416821568028675.json": "Lithuania has stopped importing natural gas from Russia as of this month, saying the move was an example for other European Union members.\n\n“If we can do it, the rest of Europe can do it too,” Gitanas Nauseda, Lithuania’s president, said Saturday. https://t.co/1Hp9e0GKDM",
  "data/tweet-nytimes/2022/4/1510428130028273669.json": "After months of dreary weather and bare branches, it’s finally cherry blossom season in New York City.\n\nHere’s an overview of what kind of cherry blossoms you can find in New York City, when they’ll be in bloom and where you can find them. https://t.co/j2dqeCiNLd",
  "data/tweet-nytimes/2022/4/1510397923141599238.json": "Jen Psaki is in advanced talks with MSNBC to join the network and could leave the White House as soon as next month, a person familiar with the negotiations said. https://t.co/q8Il3V1Pep",
  "data/tweet-nytimes/2022/4/1510299781708587012.json": "History has tended to smite Russian leaders who launched what they wrongly anticipated would be short, victorious wars. Some analysts believe that Vladimir Putin is risking a similar fate. https://t.co/o3bIUxQpvw",
  "data/tweet-nytimes/2022/4/1510594230674149382.json": "The outgunned people of Vasylkiv, a provincial Ukrainian town, successfully fought off Russian troops in the early days of the war — helping to keep the capital safe and entering Ukraine’s military lore. https://t.co/z0lMRZqaZX",
  "data/tweet-nytimes/2022/4/1510645605277876234.json": "Estelle Harris, who hyperventilated her way into the hearts of “Seinfeld” fans as Estelle Costanza, the mother of George Costanza, died Saturday.\n\nShe wound her way through community theaters and television commercials before her big \"Seinfeld\" break. https://t.co/tsfgVsQ7hV https://t.co/VIIO9cTX8N",
  "data/tweet-nytimes/2022/4/1510628205031477250.json": "Global outrage against Moscow mounted on Sunday over allegations that Russian forces had executed civilians in Ukraine, with Western leaders redoubling calls for war crimes investigations. https://t.co/mQbX2mz0iQ",
  "data/tweet-nytimes/2022/4/1510613116559765511.json": "Will Smith has spent decades radiating boundless likability. His family has become known for sharing therapy sessions online. \n\nHis slap at the Oscars has complicated all of that. https://t.co/PQrOKx1n5Q",
  "data/tweet-nytimes/2022/4/1510653595594727428.json": "Western officials expressed outrage on Sunday at videos and images emerging from Bucha, a town near Kyiv, Ukraine, that appeared to show civilian bodies scattered on the streets after Russia withdrew its troops from the area in recent days. https://t.co/zwNGZ8bhlR https://t.co/Uusv56MGkt",
  "data/tweet-nytimes/2022/4/1510684820950691840.json": "Christian Smalls and his best friend from Amazon's New York warehouse, Derrick Palmer, set their sights on unionizing.\n\nAmazon spent more than $4.3 million on anti-union consultants last year. The union spent $120,000 — and won a historic labor victory. https://t.co/XvNPyxIQaE https://t.co/BJ9qiqnuOh",
  "data/tweet-nytimes/2022/4/1510707699276820484.json": "Human Rights Watch said it documented “apparent war crimes” by Russian forces against Ukrainian civilians in occupied areas. A report published Sunday describes laws-of-war violations with chilling detail, including repeated rape and two summary killings. https://t.co/RYRJCHhWfL",
  "data/tweet-nytimes/2022/4/1510360184366977024.json": "Sufyian Barhoumi, 48, was captured in Pakistan in March 2002 and soon taken to Guantánamo Bay, where he never faced trial. He was notified in August 2016 that he was eligible for release, but his case was sidelined by a Trump administration policy. https://t.co/GpeAgCISBn",
  "data/tweet-nytimes/2022/4/1510788903585861633.json": "Breaking News: Olivia Rodrigo, 19, won best new artist at the #Grammys. The singer-songwriter and Disney star dominated last year — culturally, critically and commercially. https://t.co/sIpkwrlEsa https://t.co/j5UX0M1Li6",
  "data/tweet-nytimes/2022/4/1510784828110745602.json": "Billie Eilish performed the title track from her album \"Happier Than Ever\" at the #Grammys in a T-shirt paying tribute to the late Foo Fighters drummer Taylor Hawkins. \n\nLive updates: https://t.co/UvUR9wfNP4 https://t.co/9bzw6pBH6V",
  "data/tweet-nytimes/2022/4/1510750269407121418.json": "With Russian forces retreating, Ukrainians in Bucha are finding scores of bodies in yards and on roads amid mounting evidence that civilians had been killed purposely and indiscriminately. A mass grave filled up after the morgue became inoperable. https://t.co/H8tbmTO3kD",
  "data/tweet-nytimes/2022/4/1510806174203105284.json": "President Volodymyr Zelensky of Ukraine addressed the Grammy Awards in a video, giving an emotional plea for support in his country’s war against Russia. “What is more opposite to music?” Zelensky said. “The silence of ruined cities and killed people.” https://t.co/wI83OZMO5k https://t.co/FDTiY5RArZ",
  "data/tweet-nytimes/2022/4/1510801839855439880.json": "At 95, Tony Bennett is the oldest album of the year nominee ever, for “Love for Sale,” his Cole Porter tribute with Lady Gaga. And Bennett’s extraordinary history with the Grammy Awards goes back nearly six decades. https://t.co/HpU4Zx1vGs",
  "data/tweet-nytimes/2022/4/1510798293764300802.json": "In a remarkable moment at the #Grammys: President Volodymyr Zelensky of Ukraine gave an impassioned pre-taped message, leading into a performance from John Legend. https://t.co/LTXd22U7YJ",
  "data/tweet-nytimes/2022/4/1510742717139193861.json": "Olivia Rodrigo, who has earned seven #Grammy nominations — including for record, album, song of the year and best new artist — has arrived at the red carpet. \n\nFollow live updates: https://t.co/sbLstgTPv6 https://t.co/ScCWpCTRqT",
  "data/tweet-nytimes/2022/4/1510806899247263748.json": "Olivia Rodrigo won the #Grammy for best pop vocal album for \"Sour.\" https://t.co/prtvSaon0S https://t.co/wMBzCwEGWc",
  "data/tweet-nytimes/2022/4/1510822869001027585.json": "Breaking News: Jon Batiste won album of the year at the 2022 #Grammys for \"We Are.\" https://t.co/kBCPjRAcEX https://t.co/CtDDlI1I41",
  "data/tweet-nytimes/2022/4/1510809400927260674.json": "Jon Batiste was nominated for 11 #Grammys — more than any other artist this year. On Sunday, he got a chance to celebrate the recognition by performing the song “Freedom” from his album “We Are.” The track is a contender for record of the year. https://t.co/pfD2QWfWE8",
  "data/tweet-nytimes/2022/4/1510818653683568645.json": "Doja Cat, who won a #Grammy while apparently in the bathroom, dodged the CBS censors while accepting her award. https://t.co/vOPODQ2chT https://t.co/NZgcNa7VlN",
  "data/tweet-nytimes/2022/4/1510745234820538376.json": "Doja Cat, who has eight #Grammy nominations, arrives on the red carpet. \n\nHer latest album, “Planet Her,” broke Spotify and Billboard records to become one of the biggest releases of 2021. https://t.co/An4FiHtkaJ https://t.co/zjHE9WaLZe",
  "data/tweet-nytimes/2022/4/1510791812386066436.json": "Lil Nas X, who is nominated for multiple awards including record of the year and album of the year, arrived at the #Grammys wearing Balmain.\n\nSee all the stars on the red carpet: https://t.co/y6AujmK3QA https://t.co/2u40CdYpYP",
  "data/tweet-nytimes/2022/4/1510882133878923270.json": "President Volodymyr Zelensky of Ukraine addressed the Grammy Awards in a video, giving an emotional plea for support in his country’s war against Russia. “What is more opposite to music?” Zelensky said. “The silence of ruined cities and killed people.” https://t.co/YocS9HmwUN https://t.co/W3R1aVPshD",
  "data/tweet-nytimes/2022/4/1510958880800624640.json": "Elon Musk bought a nearly 10% stake in Twitter. News of the purchase, which makes the Tesla founder Twitter’s largest shareholder, sent the social media platform’s share prices soaring 25%.\nhttps://t.co/EOXvBnwkta",
  "data/tweet-nytimes/2022/4/1510970460837658625.json": "President Volodymyr Zelensky of Ukraine criticized the former leaders of Germany and France, Angela Merkel and Nicolas Sarkozy, inviting them to visit Bucha, a Kyiv suburb, “to see what the policy of 14 years of concessions to Russia has led to.”\nhttps://t.co/GYZbWPWwce",
  "data/tweet-nytimes/2022/4/1510986820196130818.json": "President Volodymyr Zelensky visited Bucha, where emergency workers were still gathering bodies of civilian victims from streets and backyards after Russian troops withdrew, Ukrainian news media reported.\nhttps://t.co/OWSlkRGRU2 https://t.co/1R5sWQWwXP",
  "data/tweet-nytimes/2022/4/1510975854423199751.json": "Elon Musk bought a 9.2% stake in Twitter, making him its largest shareholder as he questions its policy on moderating speech.\nhttps://t.co/G9DMVuKNF6",
  "data/tweet-nytimes/2022/4/1510673505683230728.json": "Mantas Kvedaravicius, a Lithuanian documentary filmmaker, has been killed in the besieged city of Mariupol. \n\nThe Ukrainian Defense Ministry’s information agency said Kvedaravicius had been killed in an attack by Russia “while trying to leave Mariupol.” https://t.co/qdUX909dF2",
  "data/tweet-nytimes/2022/4/1510980604564758535.json": "Russian forces occupied Trostyanets, a strategic town in northeast Ukraine, for a month before the Ukrainian military freed it. Residents described mounting atrocities during the weeks of violence.\n\n“This is true barbarity,” one said. https://t.co/iWt6wHzj9t",
  "data/tweet-nytimes/2022/4/1511060668610457612.json": "Breaking News: Satellite images refute Russia’s claim that the killing of civilians in Bucha, a suburb of Ukraine's capital, occurred after its soldiers had left town, a New York Times analysis found. https://t.co/2pDlly6EHs",
  "data/tweet-nytimes/2022/4/1511067345304887306.json": "President Volodymyr Zelensky of Ukraine lambasted the former leaders of Germany and France, Angela Merkel and Nicolas Sarkozy, inviting them to visit Bucha, a Kyiv suburb, “to see what the policy of 14 years of concessions to Russia has led to.”\n https://t.co/E5sM9Kt3LO https://t.co/FyfV0OAr8c",
  "data/tweet-nytimes/2022/4/1510973736371040256.json": "China Eastern Airlines Flight 5735 was almost exactly vertical and approaching the speed of sound as it tore into a hillside in China in March, killing all 132 people onboard. Now investigators are facing the formidable task of working out what went wrong.\nhttps://t.co/Z3h241RbMO https://t.co/TQu6k721Lt",
  "data/tweet-nytimes/2022/4/1510976773437206540.json": "Tetiana Pomazanko was killed in her garden when Russian troops entered Bucha. Her 76-year-old mother covered her corpse as best she could amid the chaos.\n\nHer death is just one of many uncovered days after Russian forces withdrew from the Kyiv suburb.\nhttps://t.co/QvDWQGYi16 https://t.co/wv7B9E28jP",
  "data/tweet-nytimes/2022/4/1511072892796162055.json": "President Biden on Monday said reports of indiscriminate killings of civilians in the town of Bucha constituted a \"war crime.\" \"This guy is brutal,\" Biden said about President Putin. \"And what’s happening in Bucha is outrageous, and everyone’s seen it.\" https://t.co/RWExRytKaN https://t.co/QwUv6D4zuk",
  "data/tweet-nytimes/2022/4/1510955374978945031.json": "Jon Batiste, a New Orleans native and musical fixture of “The Late Show With Stephen Colbert,” won five Grammys, including album of the year. He beat stars like Lil Nas X, Billie Eilish, Olivia Rodrigo, Taylor Swift, Justin Bieber, Kanye West and Doja Cat. https://t.co/XcqjhP01lo",
  "data/tweet-nytimes/2022/4/1511071128097284097.json": "Each spring and autumn, the skies in southern Denmark come to life with the swirling displays of hundreds of thousands of starlings, an event known locally as “sort sol,” or “black sun.” \n\nSee more of the visual phenomenon: https://t.co/aGrRFA3UhC https://t.co/Suun8xnOGd",
  "data/tweet-nytimes/2022/4/1511106368408858624.json": "Tatyana Petrovna, 72, in the garden where the bodies of two of her relatives lay. \n\nNeighbors told our reporter that one of the men had stayed in Bucha to look after his dogs. Not far from his body, our reporter found two dogs, dead. They had been shot. https://t.co/DxANUvN8RK https://t.co/j4j2KvjmJE",
  "data/tweet-nytimes/2022/4/1511093785484271618.json": "The College of the Holy Cross is renaming the science buildings on its campus in Worcester, Massachusetts, in honor of one of its most famous graduates, Dr. Anthony Fauci. https://t.co/feayz4tqxf",
  "data/tweet-nytimes/2022/4/1511129899230240777.json": "Breaking News: Senators Mitt Romney of Utah and Lisa Murkowski of Alaska said they would side with Democrats in supporting Judge Ketanji Brown Jackson, paving the way for her confirmation as the first Black woman on the Supreme Court. https://t.co/fR7YTnM9qI",
  "data/tweet-nytimes/2022/4/1511156687171989507.json": "The next wave of Covid-19 is coming. Here are seven ways you can lower your risk. https://t.co/wRdMJD352f https://t.co/CNzvLRsYIe",
  "data/tweet-nytimes/2022/4/1510991605725073415.json": "The U.S. and its allies will seek to suspend Russia from the UN Human Rights Council, according to the U.S. ambassador to the UN.\n\n“The images out of Bucha and devastation across Ukraine require us now to match our words with action,” she said.\nhttps://t.co/tIpkOrNBb3",
  "data/tweet-nytimes/2022/4/1510957373871038471.json": "As the war in Ukraine continues, China is pushing an ideological campaign to defend its ties with Moscow. The centerpiece is a Communist Party-produced documentary that paints President Vladimir Putin as a hero and Russia as a long-suffering victim.\nhttps://t.co/EVSbQMuhu8",
  "data/tweet-nytimes/2022/4/1511194436797181954.json": "After trailing by 15 points at halftime, Kansas erased their deficit and took the lead within 10 minutes, holding off North Carolina to win the NCAA Men's championship on Monday. The victory was the first championship for the Jayhawks since 2008. https://t.co/qZtCpPs1U1 https://t.co/XNUB7q4IFs",
  "data/tweet-nytimes/2022/4/1511058545432743942.json": "Beijing is mounting a campaign aimed at officials and students to rally domestic support for Russia. The message: China will not turn its back. https://t.co/jSUWwqiG63",
  "data/tweet-nytimes/2022/4/1511222143526359042.json": "Satellite images refute Russia’s claim that the killing of civilians in Bucha, a suburb of Ukraine's capital, occurred after its soldiers had left town, a New York Times analysis found. https://t.co/yTsRuItPuA",
  "data/tweet-nytimes/2022/4/1511274452847411211.json": "The images of lifeless bodies, bloodied by bullets, left behind in Bucha, Ukraine, after Russia’s withdrawal have provoked international outrage.\n\nThe photographs and eyewitness accounts could provide documentation for potential war crimes investigations.\nhttps://t.co/fpICkUYTdB",
  "data/tweet-nytimes/2022/4/1511263137542066178.json": "More than 300 people have been tortured and killed in Bucha, a suburb of Kyiv, President Volodymyr Zelensky of Ukraine said, adding that the list of victims is likely to grow.\nhttps://t.co/8XiwQT7drJ",
  "data/tweet-nytimes/2022/4/1511040917033136130.json": "President Biden on Monday declined to call what was happening in Ukraine a genocide but said reports of indiscriminate killings of civilians in the town of Bucha constituted a \"war crime\" and that the U.S. would bring additional sanctions against Russia. https://t.co/DGCRIDYw1Q",
  "data/tweet-nytimes/2022/4/1511323797382647820.json": "Vitali Klitschko, Kyiv’s mayor, described the killing of civilians by Russian forces as “genocide” and repeated calls by President Volodymyr Zelensky for the international community to send more aid to Ukraine and to cut off all business ties with Russia.\nhttps://t.co/H9azppG1Bq",
  "data/tweet-nytimes/2022/4/1511329617289875460.json": "Elon Musk is joining Twitter’s board of directors, the social media platform said, one day after he disclosed he had become the company’s largest shareholder.\nhttps://t.co/C16elBtAMW",
  "data/tweet-nytimes/2022/4/1511349892454703114.json": "Breaking News: President Volodymyr Zelensky of Ukraine is addressing the UN Security Council amid evidence of Russian atrocities.\n\nWatch the address, and follow our live analysis. \nhttps://t.co/10gHDim2MU",
  "data/tweet-nytimes/2022/4/1511267663309332484.json": "France, the U.S. and Britain are likely to present evidence of atrocities in Bucha, Ukraine, to the UN Security Council, as they look to isolate President Vladimir Putin and demand that he be held accountable for possible war crimes.\n\nFollow our updates.\nhttps://t.co/95HVwxUjHC",
  "data/tweet-nytimes/2022/4/1511369343963222025.json": "Tens of thousands of Ukrainians are reportedly being taken to what are being referred to as filtration camps in Russia, where their passports and phones are being taken away, and family members are being separated, the U.S ambassador to the UN said. https://t.co/rfco4F888b https://t.co/KuyTW7NKfj",
  "data/tweet-nytimes/2022/4/1511373126835351565.json": "President Volodymyr Zelensky, in his first speech to the UN Security Council since the invasion began, called the Russians war criminals who he said had killed families, raped women in front of their children and left Ukraine “filled with mass graves.” https://t.co/32vtmmOhpU https://t.co/c002bDxkzU",
  "data/tweet-nytimes/2022/4/1511116482666762245.json": "Spanish authorities seized a $90 million yacht owned by a Russian oligarch at the request of American officials, the Justice Department said on Monday. Over one week last month, Spain seized three superyachts believed to belong to Russian oligarchs. https://t.co/5IVqRmeRkI",
  "data/tweet-nytimes/2022/4/1511313985211187205.json": "France opened three investigations into potential war crimes against French citizens in Ukraine.\n\nOfficials said the crimes were committed in three cities from Feb. 24, the day the Russian invasion began, through March 16.\nhttps://t.co/NslAHAR6nR",
  "data/tweet-nytimes/2022/4/1511127751599833091.json": "When the Transportation Security Administration comes up, “funny” is not the word that springs to mind. But the agency’s Instagram account is remarkably lighthearted and pun-filled. Meet the woman behind it. https://t.co/ZwmL2tIdq1 https://t.co/n8P8jMhTzS",
  "data/tweet-nytimes/2022/4/1511414653359906820.json": "Attempts to ban books in the U.S. surged in 2021 and most of the targeted books are about Black and LGBTQ people, according to the American Library Association. \n\nHere are the ten most frequently challenged books, according to the association. https://t.co/begaJX1yBf https://t.co/FLrIsohC0f",
  "data/tweet-nytimes/2022/4/1511365589075480581.json": "A technical problem with President Zelensky’s video at the UN Security Council was resolved. Images of charred, rotting and slaughtered bodies from several Ukraine cities filled the screen at the meeting, momentarily shocking its members into silence. https://t.co/v81esmYdSX",
  "data/tweet-nytimes/2022/4/1511473784305373191.json": "President Volodymyr Zelensky, in a live video speech to the UN Security Council, called the Russians war criminals who he said killed families, raped women in front of their children, pillaged homes and left his country in ruins, “filled with mass graves.” https://t.co/6RbjEqTzAJ https://t.co/2qzjVns9KG",
  "data/tweet-nytimes/2022/4/1511488871678234642.json": "Linda Thomas-Greenfield, the U.S. ambassador to the UN, called for Russia to be suspended from the UN’s Human Rights Council, saying its inclusion “hurts the council’s credibility” and is “just plain wrong.”\n\nFollow live updates on Ukraine: https://t.co/nmZbqS3iL6 https://t.co/yfwBo7qABv",
  "data/tweet-nytimes/2022/4/1511452393258594316.json": "Hackers have repeatedly broken into social media accounts and broadcasting systems in Ukraine to spread false messages of a surrender and attempt to erode confidence in Ukrainian institutions, mirroring tactics used in Russian disinformation campaigns.\nhttps://t.co/hItMkG80Td",
  "data/tweet-nytimes/2022/4/1511448625871785992.json": "As many as 200 people are missing and presumed dead in Borodyanka, a one-street town not far from Kyiv, Ukraine. It has been devastated by Russian airstrikes, the acting mayor said Tuesday.\n\nFollow our live coverage. https://t.co/yeFtAo3UNh https://t.co/ii2sLsVqgu",
  "data/tweet-nytimes/2022/4/1511529129849626630.json": "With evidence mounting of atrocities in the Kyiv suburbs, President Volodymyr Zelensky of Ukraine delivered a scathing speech to the UN on Tuesday, accusing Russia of a litany of horrors and questioning the world body over its inaction. https://t.co/Smqm3iT9kH",
  "data/tweet-nytimes/2022/4/1511503982958686212.json": "Barack Obama returned to the White House on Tuesday, his first visit since departing in January 2017.\n\n“Vice President Biden,” Obama joked in his opening.\n“Welcome back to the White House, man,” President Biden said. “Feels like the good old days.” https://t.co/8L1RfxA3kH",
  "data/tweet-nytimes/2022/4/1511456157776367617.json": "The evidence showed that Russian forces had committed war crimes in Ukraine, the U.S. Ambassador to the UN, Linda Thomas-Greenfield, said on Tuesday, adding that the world will never hear those of the civilians brutally killed in Bucha. https://t.co/EjA6dC1yf8 https://t.co/Cx9LugO7WS",
  "data/tweet-nytimes/2022/4/1511524138967617536.json": "Russian troops recently withdrew from the area around Borodyanka, Ukraine, which was among the first places to be hit by Russian airstrikes after the invasion. Now, dozens of people who were sheltering there are missing and presumed dead under the rubble. https://t.co/YeQu12mJab"
}