{
  "data/tweet-wsj/2022/1/1477682387656101898.json": "A paper-packaging giant wants its customers to say goodbye to foam cups, clamshell containers and six-pack rings: “We are attacking anything that is plastic.” https://t.co/kNtAs3QiSm",
  "data/tweet-wsj/2022/1/1477718357763887115.json": "“In a triangle with three countries, you don’t want to be the one opposite the other two.” Strengthened military ties between China and Russia are triggering U.S. concerns. https://t.co/pOS6eRgH8G",
  "data/tweet-wsj/2022/1/1477301123774140420.json": "A couple bought their first home together in London and turned a stripped-down warehouse space into a cozy two-bedroom home built for their work-from-home lifestyle—all during the pandemic https://t.co/LDJztphsGV",
  "data/tweet-wsj/2022/1/1477874890929754117.json": "Take an early look at the front page of The Wall Street Journal https://t.co/9FAutoUgHr https://t.co/rFFXNuDxWc",
  "data/tweet-wsj/2022/1/1477859781306163205.json": "With Covid-19 infections surging due to the fast-spreading Omicron variant, doctors are now urging people to ditch cloth face masks https://t.co/dopTYDxqMv",
  "data/tweet-wsj/2022/1/1477829585698013187.json": "“In a triangle with three countries, you don’t want to be the one opposite the other two.” Strengthened military ties between China and Russia are triggering U.S. concerns. https://t.co/v2OBXF4KIu",
  "data/tweet-wsj/2022/1/1477795608127852544.json": "Hit TV shows typically get a hot start in cities, then spread to the rest of the country. “Yellowstone,” the most popular series on cable, bucked that pattern. https://t.co/EHelkijOZQ",
  "data/tweet-wsj/2022/1/1477772974765875200.json": "With Covid-19 infections surging due to the fast-spreading Omicron variant, doctors are now urging people to ditch cloth face masks https://t.co/Frp9vq4nEi",
  "data/tweet-wsj/2022/1/1477769212169191425.json": "A paper-packaging giant wants its customers to say goodbye to foam cups, clamshell containers and six-pack rings: “We are attacking anything that is plastic.” https://t.co/lO65cVm1C5",
  "data/tweet-wsj/2022/1/1477765413526286341.json": "Twitter has permanently suspended GOP Rep. Marjorie Taylor Greene's personal account, citing violations of the platform’s Covid-19 misinformation policy https://t.co/eZAng8Ay8z",
  "data/tweet-wsj/2022/1/1477750322177220612.json": "Tesla's annual vehicle deliveries surged 87% in 2021, growing at their fastest pace in years despite computer chip shortages https://t.co/tdDccsqX7L",
  "data/tweet-wsj/2022/1/1477742748232990724.json": "Jelena McWilliams’s decision to resign as chairman of the FDIC paves the way for Democrats to gain control of the agency’s agenda https://t.co/373ZpTiICv",
  "data/tweet-wsj/2022/1/1477640856102387716.json": "Many stock investors see increased threats to the pandemic-era rally as the Federal Reserve starts removing support for the economy https://t.co/zCcdzbKTVT",
  "data/tweet-wsj/2022/1/1477603096910090244.json": "An overdose epidemic that has swept across North America is leading more cities to try to decriminalize small amounts of heroin, fentanyl, cocaine and other drugs https://t.co/wCe2GEKQNf",
  "data/tweet-wsj/2022/1/1477942863937818628.json": "Some of the people who built the internet think it’s time for a reboot—starting with social media https://t.co/Uc1Peh4Hgz",
  "data/tweet-wsj/2022/1/1477935314182287360.json": "The U.S. and Japan are staging joint exercises to prepare for regional conflict that could spill over from Chinese aggression https://t.co/JDO9pDPY2P",
  "data/tweet-wsj/2022/1/1477833363230760962.json": "Defense Secretary Lloyd Austin tested positive for Covid-19 on Sunday, the Pentagon said, becoming one of the highest-ranking officials in the Biden cabinet to contract the coronavirus https://t.co/NP3vFycQs9",
  "data/tweet-wsj/2022/1/1477389188333027330.json": "Russia and Ukraine contest the legacy of Yaroslav the Wise, a figure whose remains Ukraine is now hunting for. Finding them would be a notable if symbolic victory at a moment of significant tension with its neighbor. https://t.co/RSZSQsRpEl",
  "data/tweet-wsj/2022/1/1477991902192488453.json": "Tesla has opened a new dealership in Xinjiang, the remote region where Chinese authorities are carrying out a campaign of forcible assimilation against religious minorities that has become a public-relations quagmire for Western brands https://t.co/83DUZxw6tq",
  "data/tweet-wsj/2022/1/1477791868779966466.json": "Restaurants switched over to digital menus during the pandemic. Should we get rid of paper menus forever? Industry insiders weigh in. https://t.co/oK2nyFFdCR",
  "data/tweet-wsj/2022/1/1478025909676515330.json": "Three former Minneapolis police officers are set to go on trial for violating George Floyd’s civil rights. They can more easily lay the blame on Derek Chauvin, who won’t be tried with them, say lawyers not involved in the case. https://t.co/KIaLdEs478",
  "data/tweet-wsj/2022/1/1478076029637955595.json": "Apple became the first U.S. company to reach $3 trillion in market value, with shares tripling since the pandemic lows of March 2020 https://t.co/1ilbeCaH45",
  "data/tweet-wsj/2022/1/1478101377293369345.json": "Starbucks is requiring its U.S. employees to be vaccinated against Covid-19 or submit to regular testing, one of the first large restaurant chains to take such a step ahead of potential federal vaccination mandates for large employers https://t.co/0NNFUGl64l",
  "data/tweet-wsj/2022/1/1478112721740648448.json": "Senate Majority Leader Chuck Schumer set a mid-January deadline for trying to change the chamber’s procedures on passing legislation if Republicans again block sweeping changes to the nation’s election laws https://t.co/pYzw9lO7TZ",
  "data/tweet-wsj/2022/1/1478105157606981648.json": "From @WSJopinion: The Omicron variant is far less lethal than previous versions, and its fast spread may finally push us to herd immunity, writes Rob Arnott https://t.co/jhN9Ioy5UT"
}