{
  "data/tweet-wsj/2022/8/1553912174195707905.json": "Russia’s intelligence service worked for nearly a decade to recruit members of fringe U.S. political groups to advance pro-Russia propaganda, according to an indictment https://t.co/QCZSHtnD5e",
  "data/tweet-wsj/2022/8/1553904619859939328.json": "England won the Women's European Championship Sunday, 56 years after the men's team won the country's last major soccer trophy https://t.co/XDGMIuBZDC",
  "data/tweet-wsj/2022/8/1553897075292733452.json": "The campaign to rename New Zealand https://t.co/EQaNXpsa7e",
  "data/tweet-wsj/2022/8/1553961248286560256.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/qRci2Jtk71",
  "data/tweet-wsj/2022/8/1554006612112809988.json": "The first grain shipment since the Russian invasion left Ukraine’s Odessa port under a deal aimed at easing global food shortages https://t.co/n8QqCWhmL9",
  "data/tweet-wsj/2022/8/1554100326122328066.json": "House Speaker Nancy Pelosi is planning to visit Taiwan this week and meet with officials, a person familiar said. China has warned against such a visit. https://t.co/PsQO6GbDcO",
  "data/tweet-wsj/2022/8/1554102398313848838.json": "The first grain shipment from Ukraine since the start of Russia’s invasion set sail from the port of Odessa under a deal aimed at easing global food shortages #WSJWhatsNow https://t.co/wNpsqOI53u https://t.co/nIR0sQ95Dk",
  "data/tweet-wsj/2022/8/1554116016002703362.json": "The death toll from Kentucky’s historic flooding rose to 30 people, as rescue workers continue searching for missing people and more severe weather was expected Monday https://t.co/QdYAdZBsRE",
  "data/tweet-wsj/2022/8/1554138641907257345.json": "Amazon is looking to draw in new audiences to its “Thursday Night Football” coverage by having Dude Perfect, known for their comedy routines and trick shots, call some of its games https://t.co/MfCYjIvDC6",
  "data/tweet-wsj/2022/8/1554153764751278081.json": "From @WSJopinion: Chuck Schumer wants a Senate vote on his partisan tax deal with Joe Manchin as early as this week, and no wonder he wants to rush it through. The more Americans learn what’s in this tax-and-spend behemoth, the more they’ll dislike it. https://t.co/GQc4YWIXYP",
  "data/tweet-wsj/2022/8/1554123565124968455.json": "From @WSJopinion: Biden’s climate plans are unsustainable, writes Stuart Gottlieb. The current White House agenda is so unrealistic it risks a backlash that will hurt the cause for decades. https://t.co/0eQK01beQH",
  "data/tweet-wsj/2022/8/1554176403184271360.json": "Authorities in Bulgaria are investigating an explosion at an ammunition depot owned by an arms dealer who Bulgarian officials say is a middleman for exports of munitions to Ukraine https://t.co/LvfxRXQpyr",
  "data/tweet-wsj/2022/8/1554200712539684865.json": "Breaking: The first Jan. 6 rioter convicted by a jury was sentenced to over seven years in prison, the longest sentence for a Capitol rioter so far https://t.co/etjU5y4GFB",
  "data/tweet-wsj/2022/8/1554248934528270336.json": "A U.S. drone strike killed al Qaeda leader Ayman al Zawahiri in Afghanistan, congressional officials said. He was a key strategist behind the 9/11 attacks. https://t.co/UTSVKZTMLi",
  "data/tweet-wsj/2022/8/1554256344978493441.json": "Al Qaeda leader Ayman al Zawahiri, a founding member of the jihadist movement and key strategist behind the 9/11 attacks, was killed in a drone strike in Afghanistan, officials said https://t.co/2v8WJHZhks",
  "data/tweet-wsj/2022/8/1553915957319532547.json": "Essay: Psychological research on the “bystander effect” can help explain why police took so long to confront a school shooter in Uvalde, Texas. https://t.co/9dj6VNnPCz",
  "data/tweet-wsj/2022/8/1554296223019966464.json": "The White House said Monday that a U.S. missile launched from a drone in Afghanistan killed al Qaeda leader Ayman al Zawahiri, a founding member of the jihadist movement and a key strategist behind the Sept. 11 attacks https://t.co/byQFWtHz2u",
  "data/tweet-wsj/2022/8/1554304746684645376.json": "House Speaker Nancy Pelosi is planning to visit Taiwan this week and meet with officials, a person familiar said. China has warned against such a visit. https://t.co/jGEOqznAc1",
  "data/tweet-wsj/2022/8/1554246363927515136.json": "The U.S. conducted the first known counterterrorism operation in Afghanistan in almost a year, officials said. The Taliban said the drone strike took place in central Kabul and targeted a residential home. https://t.co/dLfVcVl8e2",
  "data/tweet-wsj/2022/8/1554244348111245312.json": "From @WSJopinion: The Democrats’ latest inaptly named measure will hamstring business with more rules, taxes and red tape, making the supply-demand imbalance even worse. The Inflation Reduction Act won’t reduce inflation, writes Stephen Miran. https://t.co/7oS15E7NYu",
  "data/tweet-wsj/2022/8/1554312296893415424.json": "Live coverage: China said it was conducting military exercises in the waters off its southern and northeastern coasts this week, as U.S. House Speaker Nancy Pelosi prepares to travel to Taiwan for a visit that Beijing has strongly opposed https://t.co/1vsyDLpUqK",
  "data/tweet-wsj/2022/8/1554338743787610113.json": "Chinese stocks tumbled on Tuesday ahead of U.S. House Speaker Nancy Pelosi’s planned visit to Taiwan, as investors fretted over the tensions between Beijing and Washington surrounding her trip. https://t.co/f5OOu7p2WG",
  "data/tweet-wsj/2022/8/1554206599253737475.json": "The Securities and Exchange Commission said on Monday it charged 11 individuals with creating and promoting a fraudulent platform that operated as a global crypto pyramid and Ponzi scheme https://t.co/kFwVS9r4Bl",
  "data/tweet-wsj/2022/8/1554326165745242113.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/UReEdKQ1xw",
  "data/tweet-wsj/2022/8/1554448195228418048.json": "U.S. House Speaker Nancy Pelosi will spend a night in Taipei after the plane carrying her and other members of a Congressional delegation arrives from Kuala Lumpur, people familiar with the plans said. The imminent arrival hasn’t been officially confirmed. https://t.co/KezhDB9J5B",
  "data/tweet-wsj/2022/8/1554455757558616064.json": "The game of the day in Asia has been \"Where is Nancy Pelosi’s plane?\" Thousands of people were glued to flight-tracking websites to monitor her trip and to see for themselves if she would indeed head to Taiwan. https://t.co/ivCHIydjBo",
  "data/tweet-wsj/2022/8/1554467512955322368.json": "Investors are closely monitoring House Speaker Nancy Pelosi’s planned Taiwan visit, which risks setting up the potential for increased tensions between the U.S. and China, explains @RebeccaYFeng #WSJWhatsNow https://t.co/1MbLeGjpEm https://t.co/p45bSpugvY",
  "data/tweet-wsj/2022/8/1554481008992468992.json": "Nancy Pelosi arrived in Taiwan and plans to meet its president, despite China's warnings. She's the highest-level U.S. official to visit in 25 years. https://t.co/Y1oPiCN1OV",
  "data/tweet-wsj/2022/8/1554129870384422914.json": "Breaking: Estée Lauder is in talks to buy luxury fashion brand Tom Ford, people familiar with the matter said. The potential $3 billion acquisition would be the cosmetics giant’s biggest ever. https://t.co/XFoeldmVsz",
  "data/tweet-wsj/2022/8/1554425072777105408.json": "Amid deadly flooding in Kentucky and fierce wildfires in California, Vice President Kamala Harris announced $1 billion in grants for communities to prepare and respond to climate-related disasters #WSJWhatsNow https://t.co/12uuCamV3H https://t.co/CALyOKCkK9",
  "data/tweet-wsj/2022/8/1554527471260794880.json": "From @WSJopinion: Even if Nancy Pelosi’s trip to Taiwan ends in anticlimax, China’s military threats show that the status of Taiwan and its protection are fast becoming emergencies https://t.co/PGNGmU6G0J",
  "data/tweet-wsj/2022/8/1554548349398835203.json": "Breaking: Equifax provided inaccurate credit scores on millions of Americans seeking home, car and credit-card loans, people familiar with the matter said, resulting in higher interest rates and denied applications for some consumers https://t.co/AdH2cbAGft",
  "data/tweet-wsj/2022/8/1554542575763263490.json": "Interest in House Speaker Nancy Pelosi’s visit to Taiwan appears to have overwhelmed Weibo, one of China’s largest social-media platforms https://t.co/jzzsSsyvAy",
  "data/tweet-wsj/2022/8/1554553902586118145.json": "A missile strike in Afghanistan that killed al Qaeda leader Ayman al Zawahiri and House Speaker Nancy Pelosi’s visit to Taiwan have put foreign policy back on center stage for President Biden https://t.co/BexOQK9vUg",
  "data/tweet-wsj/2022/8/1554612282931437570.json": "The U.S. Air Force plane carrying House Speaker Nancy Pelosi to Taiwan took a three-hour detour to avoid potential military conflicts in the South China Sea, where Beijing has an established military presence https://t.co/rM3HNbftiN",
  "data/tweet-wsj/2022/8/1554652045470273536.json": "Former Missouri Gov. Eric Greitens, who resigned amid scandals in 2018, lost the GOP Senate primary to state Attorney General Eric Schmitt, the AP projects https://t.co/0V7JcUQh6O",
  "data/tweet-wsj/2022/8/1554618067187032066.json": "The Senate has passed the largest expansion of veteran healthcare benefits in decades, just a week after Republicans blocked the bill, sparking blowback https://t.co/ucQzw6YKYW",
  "data/tweet-wsj/2022/8/1554566265355780097.json": "Robinhood is laying off 23% of its staff, the second round of cuts since April as the online brokerage reels from a slowdown in trading https://t.co/ZzR07IYow3",
  "data/tweet-wsj/2022/8/1554263248081395713.json": "Many Americans inheriting an IRA will pay a much larger tax bill under new IRS guidance.“Grandma meant well, but the plan backfired.” https://t.co/oSRlwDfCsZ",
  "data/tweet-wsj/2022/8/1554669534749024256.json": "House Speaker Nancy Pelosi, the highest-ranking U.S. official in a quarter-century to visit Taiwan, met Wednesday with President Tsai Ing-wen and reiterated her support for cooperation between the two governments https://t.co/YSN8SHXys7",
  "data/tweet-wsj/2022/8/1554662544714915844.json": "Kansas voters soundly rejected a proposed state constitutional amendment that would have ended protections for abortion https://t.co/g5BDCS3PWc",
  "data/tweet-wsj/2022/8/1554489746977595401.json": "Dozens of major corporations, including Apple, GM and Lyft, have asked the Supreme Court to affirm the use of racial preferences in college admissions, arguing that more diversity on campuses contributes both to commercial innovation and business success https://t.co/TmDF4fMWvZ",
  "data/tweet-wsj/2022/8/1554689790758555650.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/ncuQrwHKsB",
  "data/tweet-wsj/2022/8/1554681185204314113.json": "House Speaker Nancy Pelosi is the highest-ranking U.S. official in a quarter-century to visit Taiwan, despite stern warnings from China. Follow our live coverage for the latest updates: https://t.co/ZJlCMLJu1t https://t.co/3cEwCV0m5M",
  "data/tweet-wsj/2022/8/1554485956811579393.json": "In the wake of the Ukraine war, Europe is weaning off Russian coal and turning to Colombia and other countries with an urgent appeal: Sell us more coal https://t.co/sctxT9zcY6",
  "data/tweet-wsj/2022/8/1554746412902109184.json": "House Speaker Nancy Pelosi vowed to preserve democracy in Taiwan in the face of growing threats from mainland China in a closely watched meeting with Taiwan’s president https://t.co/sdhDxw5i4V",
  "data/tweet-wsj/2022/8/1554708708839624704.json": "Vin Scully, Baseball’s Master Storyteller, Dies at 94 https://t.co/Y8hcp8N3Sc",
  "data/tweet-wsj/2022/8/1554740114248683520.json": "Trump-backed Blake Masters won Arizona's GOP Senate primary, AP projects. Peter Thiel, his former boss, spent millions of dollars in support of him. https://t.co/mmxEr5MOPE",
  "data/tweet-wsj/2022/8/1554803057095053313.json": "Leaders of a Senate committee are set to propose legislation that would assign oversight of the two largest cryptocurrencies, bitcoin and ether, to the federal agency that regulates milk futures and interest-rate swaps https://t.co/lPUfU7jELx",
  "data/tweet-wsj/2022/8/1554810576328691714.json": "Vin Scully, the voice of the Dodgers for nearly seven decades who elevated baseball broadcasting to artful storytelling, has died. He was 94. https://t.co/j9ihR72IYq",
  "data/tweet-wsj/2022/8/1554833248936534023.json": "U.S. gas prices have fallen for seven straight weeks and are approaching an average price of $4 a gallon, easing the pain of record-high fuel costs amid shrinking global demand for oil https://t.co/oWu77OWvBB",
  "data/tweet-wsj/2022/8/1554761533384704003.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/bxuMFr9yhP",
  "data/tweet-wsj/2022/8/1554874059007090691.json": "Breaking: Phil Mickelson and 10 other LIV golfers filed an antitrust lawsuit against the PGA Tour challenging their suspensions https://t.co/zsnYgU3E0u",
  "data/tweet-wsj/2022/8/1554821920226512896.json": "Germany might postpone closing its last nuclear reactors, Chancellor Scholz said, as Russia's cuts in gas flows threaten energy shortages https://t.co/b74fpkT8O0",
  "data/tweet-wsj/2022/8/1554820127715049478.json": "Officials from Russia, Ukraine, Turkey and the U.N. cleared a cargo ship carrying corn to continue its journey from Ukraine to Lebanon, in an early test for a deal on grain exports between Moscow and Kyiv #WSJWhatsNow https://t.co/L7tNBeRMrm https://t.co/HzQgMaJf3u",
  "data/tweet-wsj/2022/8/1554893622012698625.json": "The U.S. Senate is expected to pass a resolution that would approve the addition of Finland and Sweden to NATO https://t.co/jbH4TIZlkL",
  "data/tweet-wsj/2022/8/1554796476466970624.json": "Colleges are scaling back Covid-19 precautions for the fall, saying the pandemic phase is over https://t.co/X7r02wQXZw",
  "data/tweet-wsj/2022/8/1554942737774006272.json": "Some 60% of Kansas voters across the political spectrum rejected an amendment that would have eliminated abortion rights in the state, signaling the potential for the issue to shake up elections this fall https://t.co/r8TBToj4ca",
  "data/tweet-wsj/2022/8/1554931384476729345.json": "Alex Jones told a jury Wednesday that a significant defamation judgment could foretell the end of his Infowars media empire, in testimony during a trial to determine damages for repeatedly saying publicly that the 2012 Sandy Hook school shooting was a hoax https://t.co/I2hG0zrNW1",
  "data/tweet-wsj/2022/8/1554957387177541633.json": "The Senate overwhelmingly approved adding Finland and Sweden to NATO, a move that leaders said is key to U.S. security after Russia's invasion of Ukraine https://t.co/55OHxeP4ji",
  "data/tweet-wsj/2022/8/1554965433526239237.json": "The Justice Department sued former Trump adviser Peter Navarro on Wednesday over missing official emails https://t.co/UIoYYvG4jU",
  "data/tweet-wsj/2022/8/1555021971368382464.json": "New York's attorney general called for investigations, potentially leading to fines if airlines deliberately book flights despite staff shortages https://t.co/jmYwLQKSXE"
}