{
  "data/tweet-stocks/2021/12/1466090369951612928.json": "*MERKEL PROPOSES NATION-WIDE RESTRICTIONS FOR UNVACCINATED\n*MERKEL PROPOSES MANDATORY COVID SHOTS STARTING FEBRUARY 2022",
  "data/tweet-stocks/2021/12/1466042143030628355.json": "Jim Cramer Demands Biden Impose Military-Enforced Vaccine Mandate For All Americans https://t.co/gGXNUrqwQI",
  "data/tweet-stocks/2021/12/1465912043517755395.json": "Unvaccinated Italians over the age of 12 need to take a COVID test every 48 hours to go to work or school.\n\nFor an average family of four, that is €60 every 48 hours.\n\nThat is €960 a month for a family of four.\n\nThat is a vaccine mandate.",
  "data/tweet-stocks/2021/12/1466164475279646732.json": "1/\nBombshell 🚨\n\nAs ordered by the courts the FDA must release the data it based it's EUA for the Pfizer shot. \n\nThe FDA requested the courts to keep this information confidential for no oess than 55 YEARS!!\n\nThe court returned with an order to release 500 documents a month. https://t.co/CZI24LItfR",
  "data/tweet-stocks/2021/12/1465961167923392514.json": "Just to put things into perspective: #Germany's Dax trades in tandem w/ECB balance sheet. https://t.co/NFhP398ILJ",
  "data/tweet-stocks/2021/12/1466922963429695499.json": "We're excited to announce that we are collaborating with @Stocktwits on their 2nd annual Chips for Charity Poker Tournament.\n\nThe tournament was started to promote diversity throughout the financial sector, and #FLOKI is proud to be a platinum sponsor!\n\n https://t.co/nEHjnOM4NP",
  "data/tweet-stocks/2021/12/1467748184399171584.json": "CHINESE DEVELOPER EVERGRANDE ADMITTED IT MAY FORMALLY DEFAULT, $10B IN PROPERTY BONDS MATURING IN JANUARY ALONE -RTRS",
  "data/tweet-stocks/2021/12/1468357630779396101.json": "There's a lot of coincidence in Hollywood! https://t.co/4HvuHVLWjH",
  "data/tweet-stocks/2021/12/1468224168000897029.json": "Every year I compile my absolute favorite investment writing and 2021 was a year unlike any other.\n\nLike this, RT it, save it for later. Whatever you do, don't miss out on these incredible pieces.\n\nMy Favorite Investment Writing of 2021:\n\nhttps://t.co/GyAwoTpgzp",
  "data/tweet-stocks/2021/12/1468723743342137346.json": "Guess this is the tweet that nuked the trial tracker https://t.co/DjKEpclcF5",
  "data/tweet-stocks/2021/12/1469114551782236161.json": "BREAKING: New York City lawmakers vote to grant noncitizens the right to cast ballots in municipal elections - AP",
  "data/tweet-stocks/2021/12/1469694695207014405.json": "Price increases over last year (CPI report)...\nGasoline: +58.1%\nUsed Cars: +31.4%\nGas Utilities: +25.1%\nMeats/Fish/Eggs: +12.8%\nNew Cars: +11.1%\nOverall CPI: +6.8%\nElectricity: +6.5%\nFood at home: +6.4%\nFood away from home: +5.8%\nApparel: +5%\nTransportation: +3.9%\nShelter: +3.8%",
  "data/tweet-stocks/2021/12/1469694556350390280.json": "S&amp;P 500 closes at an all-time high for the 67th time this year. Only 1995 has had more all-time highs in a single calendar year. $SPX https://t.co/9YhfRcrjOi",
  "data/tweet-stocks/2021/12/1469694464864272386.json": "1. Stocks: all-time highs\n2. Home prices: all-time highs\n3. Wages: all-time highs\n4. Job openings minus unemployed persons: all-time highs\n5. Inflation: highest since 1982\n6. Fed/Government: we need to continue to hold interest rates down at 0% and borrow/spend trillions more",
  "data/tweet-stocks/2021/12/1469694435764154375.json": "Global Inflation Rates... https://t.co/dh7fRwQtGs",
  "data/tweet-stocks/2021/12/1469766316995325954.json": "WATCH: Viral video shows tornado that hit Sacramento, Kentucky - ABC\n\nhttps://t.co/ln3MzUFND6",
  "data/tweet-stocks/2021/12/1470395937952514052.json": "\"The goal overall has been to make life multi-planetary and enable humanity to become a spacefaring civilization,” @elonmusk tells TIME.\n\nElon Musk is TIME’s 2021 Person of the Year #TIMEPOY https://t.co/9ZB8LKFM82 https://t.co/jpjpcGd1s2",
  "data/tweet-stocks/2021/12/1470421759652515846.json": "JUST IN - Russia vetoes UN resolution to recognize \"climate change\" as a threat to global security.",
  "data/tweet-stocks/2021/12/1470536068718080000.json": "War is Peace.\nFreedom is Slavery.\nIgnorance is Strength.\nThe Penised Individual Who Raped You Is a Woman.\nhttps://t.co/SyxFnnboM1",
  "data/tweet-stocks/2021/12/1470547243476389888.json": "An article from 2008 https://t.co/8q3AIjZNnv",
  "data/tweet-stocks/2021/12/1471739712658460675.json": "No respite for the currency in #Turkey…now with a 16 handle in the midst of a disorderly depreciation. \nWith market doubts Re the sustainability of central bank fx intervention and unless internal opposition to rate hikes eases, the possibility of capital controls is increasing https://t.co/K3iXNi6RgV",
  "data/tweet-stocks/2021/12/1472626297989963778.json": "Child Vaccine Death &amp; Injury Testimonies\nJust a few of thousands of families who have been injured or lost their children to the Covid-19 vaccines. Read their stories here:\nhttps://t.co/PgYZQTXg0Q",
  "data/tweet-stocks/2021/12/1472758856598106112.json": "We’re in the “executive branch using genocidal language against the outgroup” stage of the biomedical security state https://t.co/2XJfUBNwXg",
  "data/tweet-stocks/2021/12/1473319285640552457.json": "JUST IN - Austria is looking for employees to \"hunt down vaccine refusers\" in light of the upcoming compulsory vaccination.\n\nhttps://t.co/McA6U3qcWV https://t.co/R7JtBgrrzX",
  "data/tweet-stocks/2021/12/1473802148899086340.json": "Government Officials Using Phony \"Emergency Powers\" To Impose Vaccine Passports https://t.co/FaV0d4Q409",
  "data/tweet-stocks/2021/12/1473846733276917766.json": "Russian Defence Minister Shoygu has said that an American PMC is preparing a provocation using chemical components in Donbas. According to him, unknown chemicals were delivered to Avdiivka and Krasnyy Lyman. https://t.co/4KpM2HsHL8",
  "data/tweet-stocks/2021/12/1473893935709831172.json": "In May, 2020, @PolitiFact falsely claimed it knew for certain where COVID came from, had confirmed its origin. They lied. 16 months later, not even the US Govt claims it knows. \n\nFact-checkers are partisan posers, feigning objectivity they do not possess.\n\nhttps://t.co/AXeYh6N4Nf https://t.co/oa3Y9F6ODR",
  "data/tweet-stocks/2021/12/1473913927255920644.json": "This is insane https://t.co/PJEs3lcWyG",
  "data/tweet-stocks/2021/12/1474286124961091584.json": "Remember to surround yourself with loved ones and most importantly, have yourself a merry little christmas ⭐️🎄 https://t.co/LZCNWtU7P8",
  "data/tweet-stocks/2021/12/1474605933363871744.json": "COVID Update for Alberta - Data to December 21st.\n\nEven I'm a bit shocked at the infection rate amongst the fully vaccinated. 80.94% of the new cases yesterday are fully vaccinated. https://t.co/TJDfaH8y7z",
  "data/tweet-stocks/2021/12/1475247993183944712.json": "Swimming official quits in protest over transgender swimmer #LiaThomas: 'I can’t do this'\nCynthia Millen: 'I can no longer participate in a sport which allows biological men to compete against women. Everything fair about swimming is being destroyed.'\nhttps://t.co/MsiUTrY4lN",
  "data/tweet-stocks/2021/12/1476396503472263174.json": "ZOOKEEPER: 3 Unvaxxed Lions At New Orleans Zoo Test Positive For COVID-19, Can’t Stop Coughing and Sneezing - https://t.co/iD81HcRrTR https://t.co/zdEhJkJzb8",
  "data/tweet-stocks/2021/12/1476700507725078536.json": "Fauci regurgitates CONSPIRACY THEORY that \"hospitalizations\" data is bullshit because most people are in WITH COVID, not FROM COVID. https://t.co/hZBPa40klC"
}