{
  "data/tweet-economist/2021/5/1390656963130834944.json": "The eastern sides of English cities tend to be poorer. This pattern can be traced back to the Industrial Revolution, when winds blew pollution east, causing the rich to flee west.\n\n#dataviz https://t.co/8f5bLKzUoo https://t.co/Bgm11JK2eO",
  "data/tweet-economist/2021/5/1392879596819947523.json": "Making black lives visible—making them count, in every sense—is the overarching plot-line of both Stacey Abrams’s literary and political endeavours https://t.co/evskPIdFof",
  "data/tweet-economist/2021/5/1395392315146084352.json": "New data piece:\n\nA study found peaceful BLM/George Floyd protests last year were correlated with increases in vote share for Joe Biden. But more violent demonstrations (such as rioting in Kenosha) appear to have dragged him down by significant margins:\n\nhttps://t.co/VnxFMxizxk https://t.co/RylML6HRNq",
  "data/tweet-economist/2021/5/1397286005946912772.json": "Polar charts, which plot data around a circle, make beautiful and memorable #dataviz. But they can also be confusing, or worse, misleading.\n\nI've written a newsletter about this family of charts, and why they don't often make it into The Economist. \n\nhttps://t.co/GYZRAcfk2R https://t.co/g5ZCyPdY7H",
  "data/tweet-economist/2021/5/1397944979524403203.json": "It's past time to admit the \"peace process\" is dead. Not only that, it has been unhelpful and counterproductive, granting Israel cover to entrench permanent occupation and contributing to the rot in Palestinian politics. What exists is a one-state reality. https://t.co/MdNlZUoyIr",
  "data/tweet-economist/2021/5/1398322188789354496.json": "I see Mexico's President Lopez Obrador has denounced our cover story in his morning press conference. Read it and decide for yourself. \n\nhttps://t.co/hjYFjhrHxv https://t.co/w46U4aqX9k",
  "data/tweet-economist/2021/5/1398322241033719809.json": "Our Economist/YouGov poll this week found that 56% of adults approve of the House-passed independent commission to investigate the January 6th insurrection, while just 29% oppose it. (But Republicans just filibustered it to death in the Senate.)\n\nhttps://t.co/zyahPguBw9"
}