{
  "data/tweet-crypto/2022/2/1488547640480567297.json": "Today, Denmark lifted *all* restrictions, while cases are soaring.\n\nThe international reaction: Disbelief.\n\nI am leading the largest Danish project on pandemic behavior &amp; I am advising the gov.\n\nHere is why Danes are still supportive. And what may be learned from this.\n\n🧵(1/19) https://t.co/C6E9Fc9D1G",
  "data/tweet-crypto/2022/2/1488645847772545025.json": "Did it ever fucking occur to you that if a board certified licensed practicing Cardiologist who has published over 700 peer reviewed research papers and practiced medicine for 30 years says he thinks a treatment is too dangerous that maybe he is not just some conspiracy theorist?",
  "data/tweet-crypto/2022/2/1488809472118116356.json": "https://t.co/BD9rguhSBJ",
  "data/tweet-crypto/2022/2/1488974352632754179.json": "Bitcoin is currently the 4th most oversold in its history according to dormancy flow.\n\nDollar-cost averaging more heavily into this area is probably the best approach for the long-term investor. https://t.co/5c2irfOL5L",
  "data/tweet-crypto/2022/2/1488974208679952398.json": "IT'S HAPPENING!\n\nFinland has announced they will be REMOVING all restrictions later this month.",
  "data/tweet-crypto/2022/2/1488974006241964032.json": "JUST IN - Switzerland eases Covid restrictions \"as we are about to enter the endemic phase,\" says Health Minister Berset.\n\nNo more contact quarantine or home office requirements. Further steps (mask mandates, vaccine pass) are to follow in 2 weeks, pending further consultations.",
  "data/tweet-crypto/2022/2/1488973025609408519.json": "JUST IN - Supreme Administrative Court of the Czech Republic strikes down vaccine passes for restaurants, clubs, and hotels. Sets a one-week deadline for the government to react.\n\n\"Measures cannot aim to indirectly force citizens to be vaccinated,\" the judges ruled.",
  "data/tweet-crypto/2022/2/1488972717256806400.json": "BREAKING : Sweden is expected to announce tomorrow that they will be REMOVING all restrictions on the 9th of February.",
  "data/tweet-crypto/2022/2/1489580764115181572.json": "Remember when after the financial crisis Ben Bernanke told Congress he'd bring the Fed's balance sheet back down to $1 trillion or less?\n\nAfter that he launched QE2, Operation Twist and QE3 and ballooned it up to $4.5T instead.\n\nPowell has now bloated it up to the current $8.7T. https://t.co/t7vipXsNnx",
  "data/tweet-crypto/2022/2/1489596972059316229.json": "BREAKING: Polish immigrants just arrived in Ottawa with thousands of  Polish sausages and bread for the truckers \n\n“We came from communism. We want a free country.”\nhttps://t.co/T09i7p0z1b",
  "data/tweet-crypto/2022/2/1489591980598468612.json": "2014: '#Bitcoin falls to $400'\n2018: '#Bitcoin falls to $4,000'\n2022: '#Bitcoin falls to $40,000'\n\nSeems like a bit of a pattern. https://t.co/huMpwmr8Zf",
  "data/tweet-crypto/2022/2/1489590320597774337.json": "Our Natural Immunity Study out today in JAMA:\n👍🏼816 people\n👍🏼99.3% with prior Covid had circulating antibodies (unvax)\n👍🏼Durable for ~2yrs studied\n👍🏼Lexicon of immune/non-imm &gt;&gt; vax/unvax\n👍🏼Don't try to get Cov. But if you had it, imm more durable than vax https://t.co/mlR2GIhzOh https://t.co/PuP1L1cNIi https://t.co/7tLqPlbIvk",
  "data/tweet-crypto/2022/2/1489585622792785920.json": "As an Ottawa resident, it’s so bizarre watching this thing unfold. Local news, city council are all “end of days, chaos and call in the army” but my Mom’s groups on Facebook are baking muffins, making sandwiches, sharing videos of singing protestors and doing trucker crafts 🇨🇦",
  "data/tweet-crypto/2022/2/1489226242675122177.json": "I just published Solo Mining with Blockstream Satellite and your own #Bitcoin Core node. 🛰️💻 https://t.co/BhakS0z0tw",
  "data/tweet-crypto/2022/2/1489616758117965827.json": "💥Intel will present its new #Bitcoin mining ASIC chip on February 23!",
  "data/tweet-crypto/2022/2/1489995619825500161.json": "Dit is het moment om na te denken over de toekomst. Spreek je samen met ons uit voor een onverdeelde samenleving waar deelname niet afhankelijk is van een gezondheidspas. Doe je mee? Sluit je aan bij onze coalitie. https://t.co/PLRpKJfMwS\n\n#onverdeeldopen https://t.co/08IzSoCR8U",
  "data/tweet-crypto/2022/2/1490631268735729664.json": "#Bitcoin making a macro bottom.\nShort-term holders supply indicates a macro bottom, comparable to the low of the 2014/15 and 2018/19 bear market, an opportunity that doesn't occur often. https://t.co/wkpB3jp0BE",
  "data/tweet-crypto/2022/2/1490628430911750147.json": "Look at how hard it is to get your freedom back once you’ve allowed someone to take it away.",
  "data/tweet-crypto/2022/2/1490622909865472001.json": "What happened with GoFundMe/truckers will occur at all levels of society once CBDCs are functional: Money will not only be debased but also automatically frozen &amp; taken from you when used in ways the overlords disapprove.\n\n#Bitcoin is the only known insurance against that threat. https://t.co/bed0qLDXDG",
  "data/tweet-crypto/2022/2/1490621628002316288.json": "Organized civil disobedience is the correct next response to the prolonged, indefinite and deliberate abuse of exotic emergency powers inconsistent with being a free people in our own country.\n\nI don’t want to go there, but it is time.",
  "data/tweet-crypto/2022/2/1490694820297330691.json": "Likely the macro bottom is in. #Bitcoin \nWho could have known. https://t.co/90PE8ePdFu https://t.co/vH4vPRUKP5",
  "data/tweet-crypto/2022/2/1490733643890896896.json": "We have just completed an allocation of cryptoassets to our corporate treasury, our firm’s first of its kind investment in the asset class. This includes Bitcoin and Ethereum tokens, and carbon offsets to maintain a net-zero carbon transaction: https://t.co/32hsKbnGuC",
  "data/tweet-crypto/2022/2/1490822792559878146.json": "I would rather live in a country run by truckers and farmers than a country run by journalists and academics",
  "data/tweet-crypto/2022/2/1490976964030922755.json": "BREAKING: Sweden announced they will REMOVE restrictions for traveller's to the country from the Nordics, EU and EEA on the 9th February. \n\nNo need for testing or vaccination to enter Sweden.\n\nThis comes after they announced all restrictions will be removed on the same day.",
  "data/tweet-crypto/2022/2/1490970852934189062.json": "Corporal Bulford Resigns From His Position of Personal Security for Justin Trudeau\n\n\"I have drawn my line in the sand. No more silence and compliance from me.\" https://t.co/KiESy1ZtNo",
  "data/tweet-crypto/2022/2/1491071854152675329.json": "For my Dutch followers:\n\n700,000 handtekeningen al gezet!\n\nTeken de petitie voor ONMIDDELIJKE AFSCHAFFING van het coronatoegangsbewijs:\n\n1) vul in: naam, email, woonplaats\n2) bevestig via de email die je krijgt\n\nWacht niet, doe het nu!\nGraag retweeten🙏\nhttps://t.co/2aUGK1VK2A",
  "data/tweet-crypto/2022/2/1491062655343542278.json": "54% of Canadians now want all covid restrictions lifted, a 15 point swing in a couple of weeks. The Canadian truckers are having a massive impact. Keep going. https://t.co/57o9V2eiIp",
  "data/tweet-crypto/2022/2/1491372730901725184.json": "BREAKING: The Russian government and central bank have just reached an agreement on cryptocurrencies, according to Russia's Kommersant.\n\nBoth organizations will treat bitcoin and crypto assets as currencies.",
  "data/tweet-crypto/2022/2/1491371515085934593.json": "JUST IN - Canada: Alberta to scrap vaccine passport program at midnight tonight, Premier Jason Kenney announces.",
  "data/tweet-crypto/2022/2/1491374635161878532.json": "The funniest timeline is Russia has a spot #Bitcoin ETF before the US and Snowden keeps dunking on America for thinking its still a global leader on freedom",
  "data/tweet-crypto/2022/2/1491400537606361088.json": "Tow-truck companies refuse to haul away large trucks gridlocking Ottawa \nhttps://t.co/0uo4EI7XMX",
  "data/tweet-crypto/2022/2/1491399794778341379.json": "Judge orders Ottawa Police to return the confiscated fuel back to the truckers.",
  "data/tweet-crypto/2022/2/1491431981531680768.json": "BREAKING: Prime Minister Boris Johnson announces the government will remove all Covid restrictions in England, including the legal requirement to self-isolate, a month early.\n\n https://t.co/xWwAM6JF6x",
  "data/tweet-crypto/2022/2/1491437217608507393.json": "💥BREAKING: Russia will treat #Bitcoin as a currency! 😱",
  "data/tweet-crypto/2022/2/1491703074351685634.json": "We've had a complete retail obliteration. \nSimply put: all the supply is now held by LTH, no sell pressure, but also - nothing more to be taken. Job's done. This means blue skies ahead.\n\n#Bitcoin #BTC #BTCUSDT #supply \n🧵👇👇👇 https://t.co/jTaYfaelnU",
  "data/tweet-crypto/2022/2/1491700787927519238.json": "Non-randomized hospitalization data not valid due to differential testing, lack of adjudication, and inadequate ascertainment of exposure.  Prior infection, however, has been rock solid in the data and finally capitulation is near.  Those who suffered deserve return to normalcy. https://t.co/ZVzUpundo7",
  "data/tweet-crypto/2022/2/1491841329873182727.json": "Nicely done.  https://t.co/bEME7YFPm0",
  "data/tweet-crypto/2022/2/1492053758406180883.json": "nO oNe SaW iNfLaTiOn cOmInG https://t.co/xLAlHFRprh",
  "data/tweet-crypto/2022/2/1492050789816221742.json": "Wow! 10 minutes ago someone donated 5 #Bitcoin to the Bitcoin for Truckers fund 🤯 https://t.co/7FiB7ZXYAU",
  "data/tweet-crypto/2022/2/1492050411716493324.json": "After long lying that #NaturalImmunity is weak and inferior, the #CDC has finally admitted it offers better protection than #COVID19 #vaccines.\nhttps://t.co/sClKFSMKlw",
  "data/tweet-crypto/2022/2/1492070462268088338.json": "Yesterday was an historical moment for #tether \nIn ~3 weeks you'll understand why 🍫\n\n(Yes yes, announcement-ception)",
  "data/tweet-crypto/2022/2/1492417248337739777.json": "What happened to the \"winter of death\" for the unvaccinated - Biden was screaming about a few months ago?",
  "data/tweet-crypto/2022/2/1492426988782563328.json": "Intel, the semiconductor giant, announced its #Bitcoin mining chips will ship later this year. Argo Blockchain, BLOCK (formerly known as Square) and GRIID Infrastructure are among our first customers. \n\nhttps://t.co/RjeLwii0RF",
  "data/tweet-crypto/2022/2/1492535696065810433.json": "Hundreds of thousands of Australians demonstrate today in their capital city to demand an end to the COVID police state.\nhttps://t.co/b6OZszC47h",
  "data/tweet-crypto/2022/2/1492788874782949377.json": "Does anyone still believe CBDCs are a good idea at this point? 😂 https://t.co/aUAZdKM7oS",
  "data/tweet-crypto/2022/2/1492788648701480964.json": "There was a time when I believed that competent people with good intentions were running things.\n\nTimes have changed.",
  "data/tweet-crypto/2022/2/1493162672724062215.json": "Senate Panel 1/24/22 \"Second Opinion\" for America on pandemic truth bombs including the US DOD data demonstrating year on year increases in multiple disease categories with 2021 broad exposure of unwanted and forced genetic therapy.  Renz, Cole, Kory, with Senator Ron Johnson. https://t.co/HGxI5XZA1T",
  "data/tweet-crypto/2022/2/1493352739656642560.json": "Trudeau declared War against his own Citizens on Valentine’s Day.",
  "data/tweet-crypto/2022/2/1493351663033372677.json": "NOW - PM Trudeau invokes the Emergencies Act, the successor to the War Measures Act, to quell protests in Canada. https://t.co/9LcMjj2i8x",
  "data/tweet-crypto/2022/2/1493523475213991936.json": "https://t.co/7bv5Etw7Gc",
  "data/tweet-crypto/2022/2/1493521668521791489.json": "Bam 💥 This #bitcoin sign at the #Amsterdam #NoVaccinePassport protest says it all 🚀💥🚀 https://t.co/vFYY30wVvx",
  "data/tweet-crypto/2022/2/1493519809744674817.json": "The exact moment your national currency becomes a shitcoin.  https://t.co/MXbQEdfngl",
  "data/tweet-crypto/2022/2/1493516114135076867.json": "Pay attention…not one Western Leader has condemned the actions of Trudeau.",
  "data/tweet-crypto/2022/2/1493581691813871617.json": "Are these the people who like to give lessons to other countries about democracy and freedom?\n\nThis is one of the top ranking countries in the “democracy index”?\n\nYour credibility on these topics is now worth 0.\nhttps://t.co/wCjh9bXwDt",
  "data/tweet-crypto/2022/2/1493644594394898443.json": "Here we go!\n\nConocoPhillips, the $100+ billion oil producer, has announced that they are mining bitcoin in the United States.\n\nEventually every single major oil producer is going to mine bitcoin.",
  "data/tweet-crypto/2022/2/1494071547467870211.json": "OK boomers…\n\nYou have 0 jurisdiction on a sovereign and independent nation.\n\nWe are not your colony, your back yard or your front yard.\n\nStay out of our internal affairs.\n\nDon’t try to control something you can’t control 😉\n https://t.co/pkejw6dtYn",
  "data/tweet-crypto/2022/2/1494086168866082826.json": "At least now people should realize why CBDCs are a horrible idea. When you become an enemy of the state, which seems quite easy these days, all your money will be gone. #Bitcoin is the separation of money and state, CBDCs are the complete integration of money and state.",
  "data/tweet-crypto/2022/2/1494080139277254657.json": "Bitcoin is the continuation of politics by other means.",
  "data/tweet-crypto/2022/2/1494280817828319235.json": "BANK Outages at all big 5 banks! \nIt’s happening.\nTrudeau has crushed consumer confidence in the banks in less than 48 hours. Some ATMs are still allowing cash to be pulled out but going empty.\nThe bank has now locked up EVERYONES funds!\n🇨🇦 🔔 https://t.co/9CslynYJjD",
  "data/tweet-crypto/2022/2/1494295756836065282.json": "What the hell is happening to Canada’s banks right now? https://t.co/NRjPWlG0GE",
  "data/tweet-crypto/2022/2/1494332812010217483.json": "OFFICIAL: Ukraine passes law legalizing #Bitcoin 🇺🇦 https://t.co/gjjZ9tUUZ2",
  "data/tweet-crypto/2022/2/1494296372908019712.json": "Buenos días El Salvador 🇸🇻 este día haremos historia.",
  "data/tweet-crypto/2022/2/1494804061153026054.json": "I just can’t believe no western leader has condemned Trudeau yet.  It’s SICKENING",
  "data/tweet-crypto/2022/2/1494803298649530369.json": "They won't condemn Trudeau because they're all planning to do it too",
  "data/tweet-crypto/2022/2/1494963443413270530.json": "To clarify, the police are executing orders under legislation that has not been approved by Parliament, the debate of which has been cancelled. \n\nThis is dark.",
  "data/tweet-crypto/2022/2/1494962864335081475.json": "\"Just until we flatten the curve\" 🇨🇦 https://t.co/Bz5TfnG788",
  "data/tweet-crypto/2022/2/1494962824682029056.json": "I just can’t believe no western leader has condemned Trudeau yet.  It’s SICKENING",
  "data/tweet-crypto/2022/2/1494962387593711616.json": "I'm guessing you won't see this photo printed in any of Canada's newspapers tomorrow. https://t.co/LJbTf1X1aO",
  "data/tweet-crypto/2022/2/1496064744574398465.json": "Puppet master. https://t.co/ZhVax3fpeb",
  "data/tweet-crypto/2022/2/1496062813923590145.json": "Breaking news is Moderna and Pfizer stock prices falling, not because of VAERS, or DMED, or even the overturned FOI 75 moratorium - but due to Insurance data - money talks - people are selling out",
  "data/tweet-crypto/2022/2/1496061390343352320.json": "[NEW POST] Bitcoin Is The Freedom Technology The Western World Needs\n\n\"Millions of people come for the profits, but stay for the revolution. Bitcoin has a unique way of teaching economics, personal finance, mathematics, philosophy, geopolitics, &amp; more.\"\n\nhttps://t.co/wIfMLSj1WC",
  "data/tweet-crypto/2022/2/1496059537081700352.json": "“Meme #Bitcoin Bond”\n\nFirst they ignore you, then they laugh at you… https://t.co/JiNdoJJpYN",
  "data/tweet-crypto/2022/2/1496419227045093380.json": "Hey @JustinTrudeau 👹….Are we allowed to help people pay for groceries who have had their bank accounts frozen? \n\nOr would that make us a collaborator and have our accounts frozen too? \n\nNever lived in a dictatorship before so not sure of all the logistics 🤔",
  "data/tweet-crypto/2022/2/1496426028310355968.json": "nO oNe SaW iNfLaTiOn cOmInG https://t.co/xLAlHFRprh",
  "data/tweet-crypto/2022/2/1496629828572827650.json": "This German Insurance company called out the public data as too low &amp; mentioned ethics…this provides cover for others in the insurance industry to follow suit &amp; they will. The tsunami of news flow will be uncontrollable for the propagandists. \n\n2/23/2022 the day the levee broke! https://t.co/EUf7OFqsea",
  "data/tweet-crypto/2022/2/1496872810819784707.json": "GOLDMAN SACHS: THINK GEOPOLITICAL UNCERTAINTY FURTHER LOWERS THE ODDS OF A 50 BPS HIKE IN MARCH",
  "data/tweet-crypto/2022/2/1496840792790425607.json": "JUST IN - Large German health insurance company analyzed data from 10.9 million insured individuals regarding vaccination complications.\n\nThe new data is \"alarming,\" says BKK board member Schöfbeck in a report by WELT.\n\nhttps://t.co/KV4orAjUCB",
  "data/tweet-crypto/2022/2/1497155558671101952.json": "Those who complied expected some benefit on the binary outcome of viral URI--that was the only FDA EUA claim.  Reductions in hospitalization and death were never demonstrated in RCT's.  Now disappointment as the data come in to support what everyone has known for months. https://t.co/wtF7YnQGZw",
  "data/tweet-crypto/2022/2/1497287852568289289.json": "Alden et al, Lund University, Sweden, confirms one of our worst fears.  The exogenous genetic material coding for the dangerous Spike protein is reverse-transcribed into the human genome; possible long-term constitutive expression/synthesis of disease promoting/lethal Spike. https://t.co/JEzSwSruWM",
  "data/tweet-crypto/2022/2/1497217015513292801.json": "European Parliament delays vote on crypto assets bill over proof-of-work debate due to pressure from the public.\n\nChairman of the Economics Committee, \"it is central for me that the MiCA Directive is not misinterpreted as a de facto #Bitcoin ban.\"\n\nhttps://t.co/ZreX5bJOum",
  "data/tweet-crypto/2022/2/1497327786964434949.json": "#Bitcoin went from $30K to $60K, back to $30K, up again to $$60K and back again to $30K ... in 1 year.\n\nWhen does BTC hit $60K again?",
  "data/tweet-crypto/2022/2/1497493644449914880.json": "My Ukrainian credit cards don't work anymore. I'm safe physically in Kazakhstan, but all my savings are gone.\n\nCrypto is the only money I still have, and today I can say without exaggeration that $BTC, $ETH, and #NFT are going to save my life while I can't come back home.",
  "data/tweet-crypto/2022/2/1497563137985458179.json": "The first city in the world to be heated by #bitcoin mining.\n\nNorth Vancouver's local energy utility company announced it was partnering with MintGreen to create heat for the city using renewable energy and #bitcoin mining. ♻️\n\nhttps://t.co/ocycRy3GxH",
  "data/tweet-crypto/2022/2/1497177756953628678.json": "The Macro Narrative Of #Bitcoin\n\n@100trillionUSD and @TimmerFidelity cover:\n\n- The next phase of Bitcoin adoption\n- Bond market manipulation\n- Equity market outlook\n- How to value Bitcoin\n- Fed’s rate policy\n\nApple: https://t.co/mJnnMHS37f\nSpotify: https://t.co/0lfw5u6vuZ https://t.co/CEFRmu2M8b",
  "data/tweet-crypto/2022/2/1497733849111044105.json": "Woops. turns out the RNA from Pfizer vaccine is rapidly reverse transcribed into DNA in as fast as 6 hours! But don't worry, it's in vitro, I'm sure in vivo they must have studied it and everything's just fine ... right? 🤨 https://t.co/ThP87iIUTl",
  "data/tweet-crypto/2022/2/1497885178936672258.json": "Think twice ...everything is not what it seems to be on tv https://t.co/NvoqviokYK",
  "data/tweet-crypto/2022/2/1498206498496864261.json": "Cheers for the high-court decision and relief from a societal menace.  \"Gross violation of human rights\" an appropriate description of the offending practice. https://t.co/iXcVTwbi7r",
  "data/tweet-crypto/2022/2/1498231627058716672.json": "1/n\n\nPutin didn’t just invade the Ukraine on 2/24/2022, he officially ended the #petrodollar system. How? Remember, Russians don’t do anything without a plan. They and China have been prepping for this moment for years and are now ready:\n\nhttps://t.co/b7IYdVYepG"
}