{
  "data/tweet-economist/2021/9/1432920755566792705.json": "More than half of the world’s population lives in countries where aquifers are overpumped for crop irrigation https://t.co/GahW4N5gGr",
  "data/tweet-economist/2021/9/1432903386958123008.json": "\"As China descends further into personalistic rule, it will be less able to correct or reverse the questionable decisions made by its top leadership\" argues China expert Minxin Pei https://t.co/33tVLvz27W",
  "data/tweet-economist/2021/9/1432858079637516290.json": "Carbon dioxide is by far the most important driver of climate change https://t.co/G7t75lzpHp",
  "data/tweet-economist/2021/9/1432925033089937415.json": "The gap between their average performance and that of people who reported never having had covid-19 was equivalent to seven IQ points in recent tests https://t.co/M9YkQSn79W",
  "data/tweet-economist/2021/9/1432965553480683523.json": "Doctors are focusing on three possible biological explanations for long covid https://t.co/2rmPBZ0KXc",
  "data/tweet-economist/2021/9/1432976716759187459.json": "The impact of covid-19 has also given a sense of just how hard it will be to deal with climate change https://t.co/1EO00gl8z8 https://t.co/GEt9pWnaxx",
  "data/tweet-economist/2021/9/1432880703184805890.json": "The Arab world is too big and diverse to be dominated by one ideology. It needs greater unity, but of the boring, technocratic sort https://t.co/FqpUm2LEeV",
  "data/tweet-economist/2021/9/1433130177501016065.json": "Premier League rules state that a player must retain his number throughout the season. Manchester United has asked the league to make an exception for Cristiano Ronaldo https://t.co/F5SXCIimFA",
  "data/tweet-economist/2021/9/1433155492923285507.json": "\"Whereas China has no real allies, America is blessed with many.\" Political scientist Minxin Pei explains one reason why China will not overtake America https://t.co/1wjgZ9jh39",
  "data/tweet-economist/2021/9/1433176856174411776.json": "A fundamental concern is how America found itself withdrawing from Afghanistan \"without much warning or consultation with allies or the people most directly involved in 20 years of sacrifice,” argues Henry Kissinger in The Economist\nhttps://t.co/JZ2E4KoV1e",
  "data/tweet-economist/2021/9/1433179371624353800.json": "Researchers made a surprising observation: they saw a giant tortoise, thought to be gentle and vegetable loving species, quite deliberately attack, kill and eat a chick https://t.co/eJ9H4d6wLe",
  "data/tweet-economist/2021/9/1433161124141273090.json": "So far 58% of the world's population aged 12 and over has received at least one dose of a covid-19 vaccine https://t.co/BT08vM5vJm",
  "data/tweet-economist/2021/9/1433228439016939523.json": "For every degree that temperatures rise, maize yields will fall by 7.4%, wheat yields will fall by 6% and rice yields will fall by 3.2%. Those crops supply around two-thirds of all the calories humans consume https://t.co/pQuhQfGc7z",
  "data/tweet-economist/2021/9/1433223455781097475.json": "Elizabeth Holmes was once touted as the next Steve Jobs and the world’s youngest self-made female billionaire  https://t.co/2bM61Dk9I8",
  "data/tweet-economist/2021/9/1433215306189742086.json": "While rectal ventilation sounds uncomfortable, it might actually be easier on the body than the traumatic process of tracheal intubation  https://t.co/yssOJixA4C",
  "data/tweet-economist/2021/9/1433237847398617091.json": "Afghanistan produces 90% of the world’s illegal opium, the tacky gum harvested from poppies that can be turned into heroin https://t.co/3XXHCzsvJp",
  "data/tweet-economist/2021/9/1433260235142094850.json": "In 2020 Mullah Abdul Ghani Baradar met Mike Pompeo, then US Secretary of State, twice and spoke with President Donald Trump by telephone\nhttps://t.co/4pB6QilL7z",
  "data/tweet-economist/2021/9/1433247241553186816.json": "Not all vaccines will allow you freely to jet off overseas https://t.co/GEqllETd09",
  "data/tweet-economist/2021/9/1433287023545049098.json": "A mathematician in Australia recently discovered that a 3,700-year-old clay tablet known as Si.427 was used for measuring the land   https://t.co/ShjkolMOhH",
  "data/tweet-economist/2021/9/1433282874120151044.json": "Neither coral reefs nor the Amazon rainforest will be likely to survive in a 3°C world https://t.co/9FrfT9UM8a",
  "data/tweet-economist/2021/9/1433269437981990912.json": "Only 2% of US air-force pilots are black, unchanged from 30 years ago   https://t.co/HJUuZz95SD",
  "data/tweet-economist/2021/9/1433175838594326528.json": "In 2019, 14.6% of Harvard’s first-year students had a parent who attended as an undergraduate. Only 2% did at MIT, which has no legacy preference https://t.co/9syO6l35nK",
  "data/tweet-economist/2021/9/1433305516114124800.json": "Today the opium trade is worth between 6% and 11% of Afghanistan’s GDP https://t.co/NYtMaZsHl6",
  "data/tweet-economist/2021/9/1433350699539210240.json": "A study has found the real source of inefficiency was time spent in meetings. The answer is simple: don't call as many meetings, and keep them short       https://t.co/akDyxrg07I",
  "data/tweet-economist/2021/9/1433339580309192709.json": "Henry Kissinger is a titan of US politics and one of the best-known veterans of foreign policy. He spoke to “The Economist Asks” podcast in April 2021 about current threats to the world order https://t.co/klu3M3A2j2 https://t.co/XoyO2MBowp",
  "data/tweet-economist/2021/9/1433313320249987074.json": "Tim Cook has succeeded because he did the opposite of what Steve Jobs would have done in his position   https://t.co/QpOO8QLGLq",
  "data/tweet-economist/2021/9/1433119964198801418.json": "If Xi Jinping can \"avoid missteps\", he could \"present the biggest challenge that America may ever face,\" argues historian Paul Kennedy in The Economist.\n\nRead why America has a new contender for supremacy 👇",
  "data/tweet-economist/2021/9/1433384203513704449.json": "RT @PedderSophie: Chaos here in Marseille as Macron plunges into an (unfiltered) crowd on a housing estate in the northern banlieue. The es…",
  "data/tweet-economist/2021/9/1433365662362112001.json": "Researchers have found evidence of covid-19 cases exported from China early as September 2019 https://t.co/sAlIfHcno3",
  "data/tweet-economist/2021/9/1433373800809308162.json": "Many workers like working from home because they can save time and money by not having to commute https://t.co/R2oWyhOQqY",
  "data/tweet-economist/2021/9/1433309406142341123.json": "President Nayib Bukele, a 40-year-old populist, is threatening the fragile democracy that was built up in El Salvador over 30 years of peace https://t.co/BJYAoFgO1G",
  "data/tweet-economist/2021/9/1433444871239610369.json": "Don't underestimate the danger of left-leaning identity politics. Classical liberals must understand what they are up against and fight back. Our cover this week https://t.co/PGOSvONWxN https://t.co/1QUkFmC74B",
  "data/tweet-economist/2021/9/1433396225714294784.json": "Many children are dropping out of school to work or forage for food\nhttps://t.co/GZVSQFrA6E",
  "data/tweet-economist/2021/9/1433475345970253829.json": "The world’s official covid-19 death count is 4.5m, but we estimate that between 9.3m and 18.1m people have died. Our new model will continue to update as the pandemic progresses https://t.co/KRtybWMwSU",
  "data/tweet-economist/2021/9/1433487900520427523.json": "This week’s cartoon from KAL: https://t.co/ChnYgNoSah https://t.co/OD7esHk73o",
  "data/tweet-economist/2021/9/1433513145390280718.json": "Manchester United have confirmed that Cristiano Ronaldo will wear his famous number seven shirt after returning to Old Trafford.\n\nWe explain how the awarding of shirt numbers at club level dates back to at least 1928 https://t.co/pvwzI2b9tf",
  "data/tweet-economist/2021/9/1433516580122529802.json": "Life can only begin when we give up perfectionism, explains psychoanalyst Josh Cohen. From @1843mag\nhttps://t.co/RG7qpT9QzW",
  "data/tweet-economist/2021/9/1433505521521278989.json": "Afghanistan produces 90% of the world’s illegal opium, the tacky gum harvested from poppies that can be turned into heroin https://t.co/yogtKeTvFK",
  "data/tweet-economist/2021/9/1433469797921140741.json": "Researchers found that the use of AC itself contributes to global warming, making life even hotter for everyone  https://t.co/ScA2Eq4HC8",
  "data/tweet-economist/2021/9/1433444426458796033.json": "Peruvians still benefit from 15th-century infrastructure https://t.co/2RztGJRsXI",
  "data/tweet-economist/2021/9/1433581250455945216.json": "A black Brazilian is nearly three times as likely as a white one to be a victim of homicide   https://t.co/ISKF6aMb88",
  "data/tweet-economist/2021/9/1433512827294212102.json": "Potatoes were once feared and hated. Now billions of us eat them. So what happened? https://t.co/Crokl9ib0T",
  "data/tweet-economist/2021/9/1433490099304599558.json": "Artificial intelligence is helping humans make new kinds of art. It is more likely to emerge as a collaborator than a competitor for those working in creative industries https://t.co/lLrNmMmDYJ https://t.co/7CX4yfRcLr",
  "data/tweet-economist/2021/9/1433623563509055488.json": "Today the opium trade is worth between 6% and 11% of Afghanistan’s GDP https://t.co/ThGc5mmDsj",
  "data/tweet-economist/2021/9/1433645410124550144.json": "The Afghan government was undone by its own corruption https://t.co/PPBo6n8EII",
  "data/tweet-economist/2021/9/1433701391441219591.json": "Criminalising sex work does more harm than good https://t.co/iO0x6XLhzh",
  "data/tweet-economist/2021/9/1433649405824020480.json": "Introducing Xi Jinping Thought on Socialism with Chinese Characteristics for the New Era—as the Chinese president’s political philosophy is formally known https://t.co/Vq7wC0vstv",
  "data/tweet-economist/2021/9/1433692229680386058.json": "RT @PedderSophie: Après Afghanistan: Europe ponders the uncomfortable thought that Macron may have been right about excessive reliance on A…",
  "data/tweet-economist/2021/9/1433795786228240386.json": "The world’s official covid-19 death count is 4.5m, but we estimate that between 9.3m and 18.1m people have died. \n\nOur new model will continue to update as the pandemic progresses.\n\nClick to read more 👇",
  "data/tweet-economist/2021/9/1433790156914503684.json": "This week’s cartoon from KAL: https://t.co/cs0pboVH3K https://t.co/47NwYOY9f0",
  "data/tweet-economist/2021/9/1433865136587124737.json": "Gino Strada spent his life in operating theatres in desperate places, draining, cleaning, cutting and suturing the worst wounds imaginable https://t.co/H0OAbV8DS5",
  "data/tweet-economist/2021/9/1433782854530514946.json": "Nasir El-Rufai, governor of Nigeria’s northern state of Kaduna, says he models himself on Deng Xiaoping, who put China on a path to growth \nhttps://t.co/UgN8Fa8WUj",
  "data/tweet-economist/2021/9/1433932842212409353.json": "Afghanistan's ex-president, Ashraf Ghani, once wrote a book called “Fixing Failed States”. On August 15th he gave up trying to fix Afghanistan and fled to avoid capture by the Taliban https://t.co/JlHQQxpyrX",
  "data/tweet-economist/2021/9/1433924787940823042.json": "It is hard work to be a genuine liberal. It requires you to defend your opponents’ right to speak, even when you know they are wrong https://t.co/ExXsESEgrR",
  "data/tweet-economist/2021/9/1433826393671061504.json": "On September 7th El Salvador will become the first country to adopt bitcoin as legal tender. What will change? https://t.co/LPdO1ipkoe",
  "data/tweet-economist/2021/9/1434012098674270208.json": "Ivermectin’s rise parallels that of hydroxychloroquine, another much-touted “cure” for covid-19 https://t.co/HW1SXwtvUs",
  "data/tweet-economist/2021/9/1434008305572225024.json": "Without opium the Taliban face a big financial hole https://t.co/oLXNlPfrz2",
  "data/tweet-economist/2021/9/1434023443473879041.json": "In recent months, pundits have applied the label to Afghanistan, Myanmar, Lebanon and even Nigeria. But what does it mean? When does a state slide from fragility to outright collapse? https://t.co/fbxj6MmXeK",
  "data/tweet-economist/2021/9/1434043642101051397.json": "In France a documentary alleging that covid-19 was invented by political elites as part of a conspiracy to bring about a “new world order” was watched 2.5m times in three days https://t.co/uoREWgt7Ha",
  "data/tweet-economist/2021/9/1434061929765560324.json": "In Afghanistan, he built a trauma hospital in the Panjshir Valley, as well as the best maternity centre in the country; in 2018 more than 7,500 babies were born there https://t.co/mPTiOtqJcc",
  "data/tweet-economist/2021/9/1434096665829560320.json": "A few months ago Iraq’s government began to build the Makhoul dam. Once complete, it is likely to ﬂood Ashur—and another 200 historical sites\nhttps://t.co/qcdkqDgJfB",
  "data/tweet-economist/2021/9/1434125358278791178.json": "It was once hoped that as Americans started to experience global warming’s devastating effects they would become more accepting of climate science. That is not happening https://t.co/tZuy6gUB0d",
  "data/tweet-economist/2021/9/1434118555751047171.json": "The prevalence of covid-19 cases in villages that received cloth masks was 8% lower than in those that received none, in a study in Bangladesh https://t.co/1SsrkdZkdi",
  "data/tweet-economist/2021/9/1434106230612561922.json": "Classical liberals must rediscover their fighting spirit https://t.co/lncEMkxkTl",
  "data/tweet-economist/2021/9/1433870796141772800.json": "RT @Sondreus: What is the pandemic's true death toll? After months of work, we are launching our daily updating estimate of excess deaths a…",
  "data/tweet-economist/2021/9/1434182738014318593.json": "In Kabul in 2001, Gino Strada had to talk to Mullah Omar, then-leader of the Taliban, to get permission to build a hospital. Persuading him he was neutral in the war—as he truly was https://t.co/dIuQrpCyXk",
  "data/tweet-economist/2021/9/1434158569239334912.json": "Both the World Bank and the IMF have warned against adopting bitcoin. Why is El Salvador doing it? https://t.co/GhqClHWIps",
  "data/tweet-economist/2021/9/1434168645748461570.json": "Covid-19 has made people poorer. Madagascar has all but shut itself oﬀ from the outside world, causing its main source of hard currency, tourism, to collapse https://t.co/Lu1uHQketD",
  "data/tweet-economist/2021/9/1434101463219847175.json": "A poll of more than 4,000 college students in 2019 found that 68% felt that students cannot say what they think for fear of offending their classmates https://t.co/Yl6JM9GYoJ",
  "data/tweet-economist/2021/9/1434196813662334977.json": "Liberalism is still the best engine for equitable progress. Liberals must have the courage to say so https://t.co/gEIJpNnyKH",
  "data/tweet-economist/2021/9/1434127869521838082.json": "When the French began to pull out Afghan staff and their families in May, even friends accused them of defeatism, and of hastening the regime’s collapse https://t.co/J7N57IRuDm",
  "data/tweet-economist/2021/9/1434228042541436928.json": "This week’s cartoon from KAL: https://t.co/eGbI5FBwVI https://t.co/bN4f8CruRR",
  "data/tweet-economist/2021/9/1434248686863781891.json": "Global economic losses resulting from weather-related catastrophes went from $214bn in the 1980s, in 2019 prices, to $1.62trn in the 2010s https://t.co/fMIARjCdX0",
  "data/tweet-economist/2021/9/1434290707041329152.json": "If rich countries do not redistribute surplus vaccine this year, between 1m and 2.8m lives could be lost, according to new analysis by Airfinity, a life-sciences data firm https://t.co/GKKnGka7zD",
  "data/tweet-economist/2021/9/1434227142984757258.json": "RT @AlexSelbyB: Our excess-deaths model, launched this week, is an exceptional piece of work by @Sondreus and @martgnz.  The central estima…",
  "data/tweet-economist/2021/9/1434309569187098631.json": "El Salvador's new bitcoin law says that businesses must accept the cryptocurrency as payment for goods or services https://t.co/ylVJ6liaDK",
  "data/tweet-economist/2021/9/1434257232108134400.json": "\"The real tragedy for the United States is not the debacle in Afghanistan, but that it was played out on live television,\" argues Arundhati Roy in a piece for The Economist https://t.co/hQlap6nlcF",
  "data/tweet-economist/2021/9/1434165368583561221.json": "Although Mr Maduro is supported by only 16% of Venezuelans, he has all the guns and is prepared to use them. The opposition are exhausted, hungry and scared https://t.co/PXTT0VrDbA",
  "data/tweet-economist/2021/9/1434340777153474563.json": "If the state no longer has a monopoly on violence, everything else breaks down, from electricity to roads, schools to health care https://t.co/N747OWxpHW",
  "data/tweet-economist/2021/9/1434345311388909568.json": "The distribution of surgical masks resulted in a striking 35% drop in confirmed symptomatic cases among people aged 60 or older, in a study in Bangladesh https://t.co/ddgBNSSPWr",
  "data/tweet-economist/2021/9/1434378279201427460.json": "Everyone from “the Soviets, the American- and Pakistan-backed mujahideen, the Taliban…and the US and NATO armed forces have boiled the very bones of the Afghan people into a blood soup” writes Arundhati Roy in a piece for The Economist https://t.co/UWNf0cSmV2",
  "data/tweet-economist/2021/9/1434389304403451906.json": "RT @natashaloder: Breaking news. \n\nG7 countries have such a glut of vaccine they can redistribute &gt;300m doses today with no impact on plans…",
  "data/tweet-economist/2021/9/1434351107430563841.json": "Opium production rebounded after America entered Afghanistan in 2001 https://t.co/R1M3pmvMw9",
  "data/tweet-economist/2021/9/1434441845069713410.json": "Most people in a failed state tend to be poor, while elites tend to be predatory https://t.co/O7THC28Tpo",
  "data/tweet-economist/2021/9/1434426568105934851.json": "As the popularity of chicken has grown, the price has dropped. How has this happened? https://t.co/l6hquRRq5E https://t.co/yZFIUJrbZw",
  "data/tweet-economist/2021/9/1434449607124213763.json": "Gino Strada treated everyone alike, as human beings whose faith or affiliation made no difference to him https://t.co/N4sBoVDSLm",
  "data/tweet-economist/2021/9/1434459324605255680.json": "Corruption often plays a part: the bigger the project, the bigger the contractors’ bribes\nhttps://t.co/X2fMT2SvZK",
  "data/tweet-economist/2021/9/1434513157708525577.json": "President Xi wants the young to study diligently, to take regular exercise and to listen to teachers talk about 5,000 years of glorious Chinese culture https://t.co/Rzk8YPIvgs",
  "data/tweet-economist/2021/9/1434506413502566401.json": "Without opium the Taliban face a big financial hole https://t.co/VLvnBVSjNk",
  "data/tweet-economist/2021/9/1434499322914250755.json": "\"The polarisation and schisms within the United States could in time lead to a serious breakdown of public order,\" argues Arundhati Roy in a piece for The Economist. \"We've already seen the early signs,\" she warns https://t.co/Ppj1wYAdTI",
  "data/tweet-economist/2021/9/1434517921452204032.json": "Nasir El-Rufai ﬁred almost 22,000 primary-school teachers—they had failed a test designed for nine-year-olds\nhttps://t.co/2NzHLSPpvn",
  "data/tweet-economist/2021/9/1434393240657088514.json": "Data show that G7 countries could redistribute 500m doses of covid-19 vaccine this month, and up to 1.2bn doses by the end of the year https://t.co/8WeQQVaV6i https://t.co/VhoFPNtntE",
  "data/tweet-economist/2021/9/1434336245820317703.json": "Free to read | A new poll shows that 33% of conservatives believe that ivermectin, a deworming medicine, is a “possibly” or “very” effective treatment for covid-19. It's not proven it works https://t.co/kEQIAVmMMk",
  "data/tweet-economist/2021/9/1434578332331520000.json": "Six in ten Americans think global warming is anthropogenic and already manifest, and want drastic cuts in fossil-fuels. The rest, a group that represents a majority of Republican voters, say the opposite https://t.co/c43B4uxtcq",
  "data/tweet-economist/2021/9/1434560226330660868.json": "Wherever Gino Strada worked, in Iraq, Pakistan, Rwanda, Yemen and especially Afghanistan, the war-wounded he treated were almost all civilians https://t.co/fppQECJCpu",
  "data/tweet-economist/2021/9/1434580877565177859.json": "Europe seems to realise it will have to do more by itself. Whether sceptics understand it or not, this is exactly what France has been saying https://t.co/lf3BpXIstW",
  "data/tweet-economist/2021/9/1434610546020597767.json": "Vladimir Putin, who will turn 70 next year, has plenty of repressive tools at his disposal. But the young have one crucial advantage. Time is on their side, not his https://t.co/EqmN8KZMNO",
  "data/tweet-economist/2021/9/1434621383267467268.json": "France's ambassador to Afghanistan declared—a full month before the fall of Kabul—that a safe exit could no longer be guaranteed for its nationals https://t.co/DxI4yXJcZT",
  "data/tweet-economist/2021/9/1434531785669554177.json": "India’s official covid-19 death are 440k, our model estimates the pandemic's death toll to be between 1.1m-7m. Our data team shows why the true death toll across the world is far larger than previously assumed https://t.co/hgovuDEugt",
  "data/tweet-economist/2021/9/1434669195879460867.json": "Until the mid-1990s, Republicans and Democrats worried about climate change equally. Voters on the right were then persuaded to quit worrying by a well-documented misinformation campaign https://t.co/wY4bzqyCzv",
  "data/tweet-economist/2021/9/1434662403011137543.json": "They hold a special place in the arsenal of measures to stop the spread of the virus. They are cheap, easy to use and can be deployed almost immediately https://t.co/N1IlfQcMi8",
  "data/tweet-economist/2021/9/1434652077276401664.json": "After Jair Bolsonaro took office in 2019, most reforms stalled amid political turmoil and covid-19. Now, with elections looming, time is running out https://t.co/rjbrMkM5Fx",
  "data/tweet-economist/2021/9/1434736668389564417.json": "Madagascar’s people need immediate help. In the long run, they need better government https://t.co/z8Ounb3rWk",
  "data/tweet-economist/2021/9/1434546892080394240.json": "Across England, the number of pupils poor enough to qualify for free lunches rose by 20% in a year https://t.co/7xDLuv6Glf",
  "data/tweet-economist/2021/9/1434618437955985408.json": "A military coup in Guinea appears to have succeeded, yet the Ministry of Defence maintains that the \"threat\" was put down https://t.co/zChPeCBvfB",
  "data/tweet-economist/2021/9/1434785330532519937.json": "Vaccine geopolitics aside, the moral case for vaccines to flow quickly to lower-income countries could not be clearer or more urgent https://t.co/8H7ffTB7Od",
  "data/tweet-economist/2021/9/1434718223900069889.json": "America and other countries have ended official financing of overseas coal projects. But China has not yet issued such a ban to its own banks and development institutions https://t.co/gXG79ndfxV",
  "data/tweet-economist/2021/9/1434788619051577348.json": "Satoshi Nakamoto is the mysterious inventor behind bitcoin. Nobody knows if he or she is a real person, or even if they are alive. But if Nakamoto exists, they are thought to own more than 1m bitcoin, worth more than $30bn https://t.co/8JJYs0Zo17 https://t.co/L5Ag4yfMOY",
  "data/tweet-economist/2021/9/1434873296999403523.json": "A new paper makes use of satellite images to spy on polluters at times when they think no one is watching. It turns out American air pollution is worse on days when regulators are not looking\nhttps://t.co/iQUbrRCw1G",
  "data/tweet-economist/2021/9/1434732799496495104.json": "26% of Republicans and 33% of conservatives believe that ivermectin is a “possibly” or “very” effective treatment https://t.co/cXuM9eMhS4",
  "data/tweet-economist/2021/9/1434614838685282310.json": "Our machine learning model makes Latin America the world’s hardest-hit region in terms of deaths per population https://t.co/65yTiO0tQr",
  "data/tweet-economist/2021/9/1434888652006567936.json": "The prevalence of covid-19 cases in villages that received cloth masks was 8% lower than in those that received none, in a study in Bangladesh https://t.co/dzx1KTry1g",
  "data/tweet-economist/2021/9/1434880579435212800.json": "The falling cost of renewable energy, and its deployment across Republican states, has created surprisingly broad support for decarbonisation even among those who claim to see no need for it https://t.co/4GC3ro4V2A",
  "data/tweet-economist/2021/9/1434908768370925569.json": "Angela Merkel will be a pretty tough act to follow. She has been a rock through the pandemic and four terms of economic and political crises\nhttps://t.co/iVXBypwXGN",
  "data/tweet-economist/2021/9/1434883618451697666.json": "In El Salvador, 200 bitcoin cash machines are being installed across the country. But few people seem to be planning to use the cryptocurrency https://t.co/I3BtlGihZ2",
  "data/tweet-economist/2021/9/1434822707670028291.json": "France was quick off the mark to urge its nationals to leave Afghanistan. But the crisis has led to wider questions about Europe's reliance on America https://t.co/q3UeAsYNFl",
  "data/tweet-economist/2021/9/1434896273816051714.json": "Ahmad Shah Masoud fought the Soviets and the Taliban from his base in the Panjshir valley for decades. His son’s resistance has crumbled in less than a month https://t.co/4RGnccf2p8",
  "data/tweet-economist/2021/9/1434695606392459264.json": "The Conservative leader, Erin O’Toole, has displayed keen political instincts on the campaign trail. He avoids broaching topics which risk alienating the broader public https://t.co/K1X8yv5YIw",
  "data/tweet-economist/2021/9/1434992812903354371.json": "According to a new poll, Americans’ continuing scepticism of covid-19 vaccines now makes it an outlier among other rich Western countries  https://t.co/HiMNqe0BPL",
  "data/tweet-economist/2021/9/1435026349199142913.json": "Denis Villeneuve and Greig Fraser, the cinematographer, have produced a visually stunning film, with rippling sands, monstrous sandworms and enormous spaceships https://t.co/rBKcLJk0th",
  "data/tweet-economist/2021/9/1435062058689650689.json": "A survey conducted between August 24th and 30th, showed that 28% of Americans say they do not plan to get vaccinated or are unsure whether they will do so, more than double the average for the 15 countries surveyed  https://t.co/KeOch1eNym",
  "data/tweet-economist/2021/9/1435028559526076419.json": "\"Notwithstanding the horror show at the Kabul airport, the debacle of withdrawal may not be as big a blow to the United States as it is being made out to be,\" says Arundhati Roy. Writing for The Economist, she explains why https://t.co/4q4g6iVIdI",
  "data/tweet-economist/2021/9/1435108287649878021.json": "Why Madagascar is going hungry https://t.co/i4VLEWJnIC",
  "data/tweet-economist/2021/9/1435131169453051908.json": "The Afghan government was undone by its own corruption https://t.co/UUe4XBJp0n",
  "data/tweet-economist/2021/9/1434955575591329800.json": "Ivermectin and hydroxychloroquine are being used by some Americans as a \"cure\" for covid-19. Why do so many people buy into these unproven cures? https://t.co/MBkcGaYnaS",
  "data/tweet-economist/2021/9/1435139590743068672.json": "After Angela Merkel steps down, anyone navigating Germany’s political topography is going to need a new map\nhttps://t.co/Ittam2eKNy",
  "data/tweet-economist/2021/9/1435166226561576962.json": "The world’s official covid-19 death count is 4.6m, but we estimate that between 9.4m and 18.2m people have died. Our new model will continue to update as the pandemic progresses https://t.co/sVBi8xfBH4",
  "data/tweet-economist/2021/9/1435174897504956417.json": "Today El Salvador becomes the first country to adopt bitcoin as a national currency. What will change? https://t.co/mSQS4DWyI6",
  "data/tweet-economist/2021/9/1435170323821891585.json": "According to a new poll, only Russians are less enthusiastic than Americans about getting vaccinated  https://t.co/cnw6ciaBl7",
  "data/tweet-economist/2021/9/1435173044511719424.json": "♦️ El Salvador becomes the first country to use bitcoin as a national currency.\n\n♦️ America's opioid distributors go on trial.\n\n♦️ What's behind South Africa’s struggling economy?\n\nClick to read today's news, updated regularly 👇",
  "data/tweet-economist/2021/9/1435218313718738949.json": "Frank Herbert’s bestselling epic novel of 1965 was long considered unwieldy by film-makers. Denis Villeneuve has created the most faithful and most successful film version to date https://t.co/FPxJ6xWCBY",
  "data/tweet-economist/2021/9/1435194892150611969.json": "America is inching towards a possible escape from its dysfunctional climate politics  https://t.co/RSES89LmkG",
  "data/tweet-economist/2021/9/1435287463883386887.json": "The distribution of surgical masks resulted in a striking 35% drop in confirmed symptomatic cases among people aged 60 or older, in a study in Bangladesh https://t.co/VrNsrQoDLe",
  "data/tweet-economist/2021/9/1435302486152204291.json": "Henry Kissinger brokered detente with the Soviet Union and negotiated a breakthrough presidential summit to China in 1972. His successors have long sought his expertise in foreign policy, especially in periods of fraught diplomacy https://t.co/BrAOLl17V6 https://t.co/Ju6REdEu5c",
  "data/tweet-economist/2021/9/1435126234330054662.json": "China’s problem is not simply that it has a short fuse. Its temper may prove more problematic than before because its ambitions are changing https://t.co/TRMxZfX5YJ",
  "data/tweet-economist/2021/9/1435275605734576128.json": "After almost 16 years, Angela Merkel will soon step down as Germany’s chancellor. Who stands the best chance of replacing her? #BTW21 👇 https://t.co/dOH1EkkbVa https://t.co/eM2x4o7viS",
  "data/tweet-economist/2021/9/1435376853351546881.json": "Brazil’s economy always seems to be “on the edge of a precipice”, says Joaquim Levy, a former finance minister https://t.co/xX6m8FzhDg",
  "data/tweet-economist/2021/9/1435277629574291458.json": "China is happy to see America humbled in Afghanistan https://t.co/1ij0F2YNsi",
  "data/tweet-economist/2021/9/1435380130361270282.json": "Some parts of San Francisco feel more like an abandoned Rust Belt city than a tech hub https://t.co/GZHTBO6O75",
  "data/tweet-economist/2021/9/1435480350214533120.json": "Doctors are focusing on three possible biological explanations for long covid https://t.co/YnDPWgYJt6",
  "data/tweet-economist/2021/9/1434948028159430663.json": "\"The United States continues to be the only state capable of truly projecting military power throughout the globe, and not just in its surroundings\", argues Jorge Castañeda in The Economist https://t.co/FYT3hOGYpN",
  "data/tweet-economist/2021/9/1435226114801164293.json": "Covid-19 cases have been rising fastest over the past seven days in North America. Find out how our data team is tracking the pandemic there https://t.co/6LwouArhya",
  "data/tweet-economist/2021/9/1435489963085377536.json": "While rectal ventilation sounds uncomfortable, it might actually be easier on the body than the traumatic process of tracheal intubation  https://t.co/f0GVcJIi7N",
  "data/tweet-economist/2021/9/1435521548950069252.json": "One example: China wants to cover 30 cities with sponge-like features, which promise to soak up or re-use 80% of rainfall https://t.co/6QFHUEp0C7",
  "data/tweet-economist/2021/9/1435671506562977794.json": "A mysterious illness is afflicting American and Canadian diplomats, spies and embassy staff all over the world https://t.co/rp75kM5VVh",
  "data/tweet-economist/2021/9/1435805700786098179.json": "They hold a special place in the arsenal of measures to stop the spread of the virus. They are cheap, easy to use and can be deployed almost immediately https://t.co/ntm76fVhXZ",
  "data/tweet-economist/2021/9/1435775357580455936.json": "The rate of vaccine hesitancy has held steady in many of the states where Delta has hit hardest in recent months  https://t.co/6zNQ4UlumN",
  "data/tweet-economist/2021/9/1435823989964906497.json": "Perfectionism may appear to spur us on to adult successes. But it is a fundamentally childish attitude \nhttps://t.co/w1lULNsLD3",
  "data/tweet-economist/2021/9/1435833852002455552.json": "Sharia law is based on the Koran, Islam’s holy book; the hadith, or sayings of the prophet Mohammed; and the subsequent work of Islamic legal scholars https://t.co/ppJxiFIT18",
  "data/tweet-economist/2021/9/1435918959392575490.json": "President Joko Widodo suppresses critics, centralises authority and erodes checks on executive privilege https://t.co/45pYqNq1b0",
  "data/tweet-economist/2021/9/1435937192422088705.json": "America set out to reshape the world order after the attacks of 9/11—but now, it is in danger of swinging from hubris to muddle.\n\nOne of our two covers this week assesses the superpower’s global standing, 20 years on https://t.co/h2dzkvTM0q https://t.co/cQ4AbhguPf",
  "data/tweet-economist/2021/9/1435952061200445442.json": "Societies that oppress women are far more likely to be violent and unstable. Policymakers who fail to consider the interests of half the population cannot hope to understand the world. One of our two covers this week https://t.co/X3V4VRZFv0 https://t.co/L0TddQCGqQ",
  "data/tweet-economist/2021/9/1435914194080182276.json": "In the 1970s Alejandro Jodorowsky and Ridley Scott worked on versions of the novel. David Lynch made an adaptation in 1984 but the movie was a financial and critical failure. Now a film directed by Denis Villeneuve has just had its premiere in Venice https://t.co/zSOP7PLQj3",
  "data/tweet-economist/2021/9/1435970024817283076.json": "A fifth of the world’s young women were married before the age of 18. Child brides are more likely to drop out of school, less able to stand up to abusive husbands and less likely to raise healthy, well-educated children https://t.co/6JzK5NSsov",
  "data/tweet-economist/2021/9/1436021107522428930.json": "Researchers have found a strong statistical link between pre-modern attitudes to women and violent political instability https://t.co/O5vGTsj0dV",
  "data/tweet-economist/2021/9/1436011692798926854.json": "Between 1992 and 2019, only 13% of negotiators and 6% of signatories of peace deals were female. Yet peace tends to last longer when women are at the table https://t.co/boEgaGrHJW",
  "data/tweet-economist/2021/9/1436049773530857480.json": "After the attacks of September 11th America set out to reshape the world order. Instead the resulting mire in the Middle East has been a distraction from the real story of the early 21st century, the rise of China https://t.co/CWQS3MZ8Z8",
  "data/tweet-economist/2021/9/1436061628102029314.json": "There is growing evidence that Hillary Clinton was on to something a decade ago when she said: “The subjugation of women is...a threat to the common security of our world” https://t.co/JEItGxPT6Q",
  "data/tweet-economist/2021/9/1435999728991363077.json": "According to a new poll, Americans’ continuing scepticism of covid-19 vaccines now makes it an outlier among other rich Western countries  https://t.co/cN0VnFq30O",
  "data/tweet-economist/2021/9/1436069297491689477.json": "“It seems as if the surest way to curse one’s nation is to subordinate its women,” say the authors of a study that ranks 176 countries for misogyny https://t.co/bh2GVSghKW",
  "data/tweet-economist/2021/9/1436122867071082496.json": "Societies that oppress women are far more likely to be violent and unstable. Policymakers who fail to consider the interests of half the population cannot hope to understand the world https://t.co/oyF4bioxPs",
  "data/tweet-economist/2021/9/1436091123450224650.json": "Mexico’s Supreme Court unanimously voted to decriminalise abortion  https://t.co/pgdln6ARE8",
  "data/tweet-economist/2021/9/1436042981711167493.json": "The people of El Salvador see Nayib Bukele as an answer to gang violence and corruption. But look beyond his nerdy puffery, and there lies an old-fashioned autocrat https://t.co/3PXpBcJQZy",
  "data/tweet-economist/2021/9/1436119073285361672.json": "In rich, liberal countries, the idea of the male kinship group as the basic unit of society faded long ago. Elsewhere it is surprisingly common, and not just in Afghanistan https://t.co/aQ2gxqVdjM",
  "data/tweet-economist/2021/9/1436032186722000897.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/nKm9MkjjVG  From @1843mag",
  "data/tweet-economist/2021/9/1436164562856910850.json": "KAL’s cartoon https://t.co/FBMNpCICSQ",
  "data/tweet-economist/2021/9/1436159723045363714.json": "The effects of a warmer world are visible in animals’ bodies https://t.co/nDl4JkvaOy",
  "data/tweet-economist/2021/9/1436190913974394883.json": "Researchers made a surprising observation: they saw a giant tortoise, thought to be gentle and vegetable loving species, quite deliberately attack, kill and eat a chick https://t.co/NLTCS55jk9",
  "data/tweet-economist/2021/9/1436212421182607360.json": "Researchers estimate that 120 countries are still to some degree swayed by pre-modern attitudes to women that endanger political stability https://t.co/ZOf3nX7wEd",
  "data/tweet-economist/2021/9/1436216402524971013.json": "Nations that treat women badly are more likely to suffer violent unrest. Studying geopolitics through the prism of sex suggests trouble in store for Saudi Arabia, Pakistan and even India https://t.co/erRVRXccGD",
  "data/tweet-economist/2021/9/1436257057351557121.json": "Some studies have found that the vapour can contain high levels of unambiguously nasty chemicals such as formaldehyde, acetaldehyde and acrolein https://t.co/KRhEYttXiV",
  "data/tweet-economist/2021/9/1436200281990176769.json": "“Mutations are the whole reason that we’re here on this planet...without mutations, you couldn’t have evolution,” explains @AlisonWoollard from @UniofOxford on “Babbage” with @kncukier https://t.co/nF1ZNTsA77 https://t.co/6F1vwY4nd4",
  "data/tweet-economist/2021/9/1436075056346673154.json": "Writing for The Economist, Henry Kissinger says Afghanistan has been presented to the public as “a choice between full control of Afghanistan or complete withdrawal”  https://t.co/OpOnWFRUGE",
  "data/tweet-economist/2021/9/1436305278891347970.json": "Where polygamy is common, many young men are doomed to frustrated bachelorhood. And that is dangerous. All of the 20 most unstable countries in the world practise polygamy  https://t.co/2ARRYAdfCC",
  "data/tweet-economist/2021/9/1435808957545725952.json": "By the end of August, South-East Asia had recorded some 217,000 deaths from covid, about 2.6 times its total just three months earlier. Yet the real figure is probably much higher https://t.co/zqB43SReLp",
  "data/tweet-economist/2021/9/1436330803437490179.json": "The gains that Afghan women and girls have made in the past 20 years are now in jeopardy. \n\nAs a group that champions violent misogyny takes over, it is worth studying how the most sexist societies work 👇 https://t.co/Pq21zmCIPy",
  "data/tweet-economist/2021/9/1436338435090964501.json": "Researchers have found patriarchy to be a better predictor of violent instability than income, urbanisation or bad governance https://t.co/Q3RltpMDPp",
  "data/tweet-economist/2021/9/1436356978528464904.json": "How the world changed after 9/11—as told through 20 years of The Economist’s covers. \n\nIn our first issue afterwards, we likened the moment to the attack on Pearl Harbour. We called for America, and its allies, to offer up a response that remained “measured” https://t.co/PwRFqqvHV2",
  "data/tweet-economist/2021/9/1436323097418899462.json": "The Taliban plans to rule Afghanistan in accordance with sharia law. But what is it, and how is it applied? We explain https://t.co/rbUZ3tnUFL",
  "data/tweet-economist/2021/9/1436300923626737668.json": "A survey conducted between August 24th and 30th, showed that 28% of Americans say they do not plan to get vaccinated or are unsure whether they will do so, more than double the average for the 15 countries surveyed  https://t.co/H5KrGjDHe0",
  "data/tweet-economist/2021/9/1436343224990408709.json": "Frank Herbert’s bestselling epic novel of 1965 was long considered unwieldy by film-makers. Denis Villeneuve has created the most faithful and most successful film version to date https://t.co/ZRt5LX2sKB",
  "data/tweet-economist/2021/9/1436408905027006464.json": "Researchers have found that sexist customs are highly correlated with violent instability in a country. Various lessons can be drawn from this https://t.co/iah2Fx9Yym",
  "data/tweet-economist/2021/9/1436375939747926056.json": "Abortions will not immediately become available in Mexico, but judges in all states can no longer prosecute women for having an abortion, and must release any women or doctors behind bars for terminating pregnancies  https://t.co/ajKwWJkrKc",
  "data/tweet-economist/2021/9/1436470303467655168.json": "HIV has a high mutation rate, which helps it adapt to evade both natural immune systems and artificial vaccines. Has Moderna created a vaccine which the virus cannot easily dodge? https://t.co/HmOBZS4GEe",
  "data/tweet-economist/2021/9/1436483891263586305.json": "Anti-vaxxer Trump voters who are now likeliest to be hospitalised with the disease tend to be the most anti-Muslim Americans. The doctors treating them are quite likely to be Muslim https://t.co/9dUjzUNUQs",
  "data/tweet-economist/2021/9/1436444142759026700.json": "The obstacles girls face begin in the womb. Thanks to sex-selective abortion and neglect, at least 130m females are missing from the world’s population https://t.co/7tZU3ghnnR",
  "data/tweet-economist/2021/9/1436522913499340812.json": "Denis Villeneuve and Greig Fraser, the cinematographer, have produced a visually stunning film, with rippling sands, monstrous sandworms and enormous spaceships https://t.co/GSvQhKZ9hC",
  "data/tweet-economist/2021/9/1436544283243335680.json": "By 1995 there was just one kakapo left on the mainland, and 50 on Stewart Island, off New Zealand’s South Island https://t.co/nZpIuXZ86z",
  "data/tweet-economist/2021/9/1436544284799418369.json": "The American dream was always an antidote to extremism https://t.co/Gyo8EXrWjn",
  "data/tweet-economist/2021/9/1436590352455061505.json": "All conflicts have complex causes. But it may be no coincidence that Kashmir has one of the most unbalanced sex ratios in India, or that all of the 20 most turbulent countries on the Fragile States Index practise polygamy https://t.co/XcSekYbQDA",
  "data/tweet-economist/2021/9/1436565178204762117.json": "While natural reefs take centuries to grow, hybrid versions can be conjured up in months https://t.co/TqvksQpwDW",
  "data/tweet-economist/2021/9/1436518126653427712.json": "The Supreme Court ruling that lets El Salvador’s presidents run for a second consecutive term allows Nayib Bukele to stand in 2024, and appears to go against the constitution  https://t.co/g18bnGTBIO",
  "data/tweet-economist/2021/9/1436640436379082752.json": "In rich, liberal countries, the idea of the male kinship group as the basic unit of society faded long ago. Elsewhere it is surprisingly common, and not just in Afghanistan https://t.co/41qrReNOKQ",
  "data/tweet-economist/2021/9/1436596898257940481.json": "The world of the future is not just going to be hotter than humans are used to. The animals living in it will look different, too https://t.co/0COZJ0XYBN",
  "data/tweet-economist/2021/9/1436645703778902019.json": "Societies that oppress women are far more likely to be violent and unstable. \n\nPolicymakers who fail to consider the interests of half the population cannot hope to understand the world. \n\nRead one of our two covers this week 👇",
  "data/tweet-economist/2021/9/1436666640716992514.json": "America set out to reshape the world order after the attacks of September 11th. But 20 years on, the war on terror has improved neither America’s standing nor the nation itself. A thread👇 https://t.co/UJgUhsxtf1",
  "data/tweet-economist/2021/9/1436680957789093890.json": "Societies that oppress women are far more likely to be violent and unstable. Policymakers who fail to consider the interests of half the population cannot hope to understand the world https://t.co/ZhV5JgoEaZ",
  "data/tweet-economist/2021/9/1436463512558215207.json": "According to a new poll, only Russians are less enthusiastic than Americans about getting vaccinated  https://t.co/WvUtFIRYSC",
  "data/tweet-economist/2021/9/1436708624101949448.json": "America set out to reshape the world order after the attacks of September 11th. But the war on terror improved neither America’s standing nor the nation itself. What has this 20-year experiment in power projection achieved? https://t.co/GwgkloSBPZ",
  "data/tweet-economist/2021/9/1436668869020618752.json": "America’s national mood of fatigue and apathy is a poor guide to the country’s future role in the world https://t.co/x9roth9U2i",
  "data/tweet-economist/2021/9/1436731303697829893.json": "One study found that in China, for every 1% rise in the ratio of men to women, violent and property crime rose by 3.7% https://t.co/QxZxC31DQb",
  "data/tweet-economist/2021/9/1436742096459902989.json": "Three decades of attempts to create a vaccine against HIV have been fruitless. Can Moderna succeed where others have failed?  https://t.co/yJIeXE0yHo",
  "data/tweet-economist/2021/9/1436468790523486208.json": "Island-dwelling flightless birds suffer when they meet humans: they are delicious and easy to catch. This has caused near disaster for the kakapo as their numbers have plummeted  https://t.co/xMxIkWaLqq",
  "data/tweet-economist/2021/9/1436751498021588999.json": "America is one of the richest countries in the world. So why does it have so many people living in profound need?\nhttps://t.co/htfQGqqEM8",
  "data/tweet-economist/2021/9/1436631114123198467.json": "In some ways America is worse off now than it was on September 10th 2001: more anxious, more polarised, less trusting. New York City, though, is better https://t.co/EFWBzXhEAg",
  "data/tweet-economist/2021/9/1436675966932299780.json": "China and Russia have kept their embassies in Kabul open, under Taliban protection, and indicated they are ready to deal with the new regime  https://t.co/GMbgXHeF76",
  "data/tweet-economist/2021/9/1436773551994978308.json": "America set out to reshape the world order after the attacks of September 11th. But the war on terror improved neither America’s standing nor the nation itself. What has this 20-year experiment in power projection achieved? https://t.co/vlKCDlbD5C",
  "data/tweet-economist/2021/9/1436786682582405122.json": "Researchers have found that sexist customs are highly correlated with violent instability in a country. Various lessons can be drawn from this https://t.co/XkcnKXKE6c",
  "data/tweet-economist/2021/9/1436772036542615552.json": "Mexico’s Supreme Court unanimously voted to decriminalise abortion  https://t.co/X7MxHzxo46",
  "data/tweet-economist/2021/9/1436836989177929729.json": "Patriarchy and poverty go hand in hand https://t.co/0DZoBY2DnH",
  "data/tweet-economist/2021/9/1436832184137027584.json": "America set out to reshape the world order after the attacks of September 11th. But the war on terror improved neither America’s standing nor the nation itself. What has this 20-year experiment in power projection achieved? https://t.co/erQjafZjDj",
  "data/tweet-economist/2021/9/1436908179686834176.json": "Moderna hopes the mRNA technology used to produce its covid-19 jab will succeed against HIV too https://t.co/hYJK3d33hm",
  "data/tweet-economist/2021/9/1436876734733950976.json": "Inbreeding can help expose harmful recessive mutations in particular to the force of natural selection, helping to remove them from the gene pool https://t.co/yTqVB5s4fD",
  "data/tweet-economist/2021/9/1436775073952714763.json": "Nayib Bukele’s approval rating has hovered at around 90% since he took power in 2019, by far the highest of any leader in Latin America, and possibly the world. But he is exploiting his popularity for authoritarian ends  https://t.co/s42bzIAPmX",
  "data/tweet-economist/2021/9/1436913989267623939.json": "Scientists believe that animals are evolving to have larger appendages. This provides more surface area, and make it easier for them to regulate their temperature https://t.co/CyAAToc4Je",
  "data/tweet-economist/2021/9/1436904161791168518.json": "The lack of support from President Joe Biden probably will not make Nayib Bukele change course. Given where the road he is on usually leads, voters should be wary https://t.co/FnkcbBoytY",
  "data/tweet-economist/2021/9/1436791188565151749.json": "Some people seem to embody the role they play. But eventually it’s time to leave\nhttps://t.co/Fk1DllHePo",
  "data/tweet-economist/2021/9/1436925061689192448.json": "America set out to reshape the world order after the attacks of September 11th. Twenty years on, is the era of American interventionism over? Our “Checks and Balance” podcast investigates https://t.co/WjCKZJ4U6R https://t.co/qoLJd8gNm4",
  "data/tweet-economist/2021/9/1436892856380235783.json": "America set out to reshape the world order after the attacks of September 11th. But the war on terror improved neither America’s standing nor the nation itself. What has this 20-year experiment in power projection achieved? https://t.co/nCPn4KSwu8",
  "data/tweet-economist/2021/9/1436941636500656130.json": "Two Japanese companies, Aoki and Whatever Inc, created pyjama suits—a hybrid of a suit and soft, comfy loungewear—perfect for the video conference attended from home  https://t.co/KLDiw6CeNa",
  "data/tweet-economist/2021/9/1436953486160236544.json": "America set out to reshape the world order after the attacks of September 11th. But the war on terror improved neither America’s standing nor the nation itself. What has this 20-year experiment in power projection achieved? https://t.co/cTDRM04uQw",
  "data/tweet-economist/2021/9/1436677669140287494.json": "After 9/11, New York came back stronger. What lessons can the city’s leaders learn from that success to help the city bounce back from the pandemic today? Watch our film 👇 https://t.co/YbMfcALkqr https://t.co/fLara7iV13",
  "data/tweet-economist/2021/9/1436911961451728898.json": "In some ways America is worse off now than it was on September 10th 2001: more anxious, more polarised, less trusting. New York City, though, is better https://t.co/3ij6Tg5rzV",
  "data/tweet-economist/2021/9/1436681198500204550.json": "If Spain were starting from scratch, the best answer to its regional conundrums would be German-style federalism. But there is little chance of that https://t.co/BtpWLjQfow",
  "data/tweet-economist/2021/9/1437013145256611845.json": "Nations that treat women badly are more likely to suffer violent unrest. Studying geopolitics through the prism of sex suggests trouble in store for Saudi Arabia, Pakistan and even India https://t.co/Zgx2qtyRZw",
  "data/tweet-economist/2021/9/1437018178828259328.json": "All of the world's 20 most unstable countries practise polygamy https://t.co/Dos3xjPw4N",
  "data/tweet-economist/2021/9/1437021441816420352.json": "Social media has changed things: videos of Taliban fighters beating women who attended a protest in Kabul are circulating, and the new government cannot block them\nhttps://t.co/4xSQXDx03Y",
  "data/tweet-economist/2021/9/1437035032619651078.json": "A new paper demonstrates that climate change is already altering the bodies of many animal species, giving them bigger beaks, limbs and ears https://t.co/XJMNC4Ab2s",
  "data/tweet-economist/2021/9/1437028981153353732.json": "America set out to reshape the world order after the attacks of September 11th. But the war on terror improved neither America’s standing nor the nation itself. What has this 20-year experiment in power projection achieved? https://t.co/hHPJC61bwq",
  "data/tweet-economist/2021/9/1437045494035927044.json": "Researchers made a surprising observation: they saw a giant tortoise, thought to be gentle and vegetable loving species, quite deliberately attack, kill and eat a chick https://t.co/pc7jvRPJWl",
  "data/tweet-economist/2021/9/1437057937244053506.json": "Muslims are one of America’s most educated religious groups. More than 15% of doctors in Michigan are Muslim, though less than 3% of the state’s population is https://t.co/fZv60ly5Iq",
  "data/tweet-economist/2021/9/1436849288089423873.json": "Intermarriage between castes in India remains rare and housing segregation by caste is rife. You can be lynched for marrying above your caste https://t.co/Ohm8mXXaMr",
  "data/tweet-economist/2021/9/1437083590337171460.json": "Societies that oppress women are far more likely to be violent and unstable. \n\nPolicymakers who fail to consider the interests of half the population cannot hope to understand the world. \n\nRead one of our two covers this week 👇",
  "data/tweet-economist/2021/9/1437103735763836929.json": "There is growing evidence that Hillary Clinton was on to something a decade ago when she said: “The subjugation of women is...a threat to the common security of our world” https://t.co/xR9LPRTAJz",
  "data/tweet-economist/2021/9/1437104480521175050.json": "Frank Herbert’s bestselling epic novel of 1965 was long considered unwieldy by film-makers. Denis Villeneuve has created the most faithful and most successful film version to date https://t.co/e6n50MOgqw",
  "data/tweet-economist/2021/9/1437161129336246280.json": "Abortions will not immediately become available in Mexico, but judges in all states can no longer prosecute women for having an abortion, and must release any women or doctors behind bars for terminating pregnancies  https://t.co/26Rh5h5MW6",
  "data/tweet-economist/2021/9/1437153804257046533.json": "Angela Merkel will depart from German politics shortly. Her successor may be forgiven for feeling like George Lazenby reading the reviews of “On Her Majesty’s Secret Service” https://t.co/WE4WK05s2v",
  "data/tweet-economist/2021/9/1437184274097135618.json": "If women are subject to autocracy and terror in their homes, society is also more vulnerable to these ills https://t.co/ta8RJTi7LZ",
  "data/tweet-economist/2021/9/1437194332428247047.json": "Between 1992 and 2019, only 13% of negotiators and 6% of signatories of peace deals were female. Yet peace tends to last longer when women are at the table https://t.co/iIawQHh7bY",
  "data/tweet-economist/2021/9/1437174208732307462.json": "Perfectionism may appear to spur us on to adult successes. But it is a fundamentally childish attitude \nhttps://t.co/RCmpqyms4D",
  "data/tweet-economist/2021/9/1437167637696548864.json": "Many people say Nayib Bukele has made their lives better, through new roads, food handouts and safer neighbourhoods. This popularity has given him cover for a quick takeover of the state  https://t.co/vX9QLV4Pnn",
  "data/tweet-economist/2021/9/1437254674994827265.json": "If the Delta variant, and the wards full of patients suffering from it in local hospitals, cannot change Americans’ minds, then it is hard to see what will https://t.co/7hfOZ5wnuO",
  "data/tweet-economist/2021/9/1437230056666013698.json": "In the past year it has become increasingly clear that China’s Communist Party means to take a legal fight to the world on multiple fronts \n https://t.co/pA6sPaJWLf",
  "data/tweet-economist/2021/9/1437292024785473537.json": "Every year since the 1960s, the 10% of voters with the most years of schooling gravitated towards left-wing parties, while the remaining 90% slid the other way https://t.co/aJjT11AzOe",
  "data/tweet-economist/2021/9/1437134692210417671.json": "The rate of vaccine hesitancy has held steady in many of the states where Delta has hit hardest in recent months  https://t.co/Xutt5WBEVw",
  "data/tweet-economist/2021/9/1437303629673816064.json": "The average cost of shipping a standard large container has surpassed $10,000, some four times higher than a year ago  https://t.co/DH4jJ1UgaC",
  "data/tweet-economist/2021/9/1437295940717715459.json": "President Xi Jinping wants China’s legal apparatus to grow more muscular in international disputes, and to reshape international legal and regulatory norms  https://t.co/AzW7lB1Pz4",
  "data/tweet-economist/2021/9/1437106275897184258.json": "“This next era will not see the deployment of troops on the ground except in quite unusual circumstances.” @SlaughterAM, a former aide to President Barack Obama, tells “Checks and Balance” American interventionism is over https://t.co/FOs8VTrg0L https://t.co/WEN85nglsP",
  "data/tweet-economist/2021/9/1437385612802281476.json": "Netflix says Britain is now its third-biggest production site. The country has even won plum productions away from other countries https://t.co/lnTfwd0PWw",
  "data/tweet-economist/2021/9/1437437195992842240.json": "In America, the virus is spreading fastest among young people https://t.co/IXZuuihLBd",
  "data/tweet-economist/2021/9/1437530046932168708.json": "The spot price for sending a standard large container from Shanghai to New York, which in 2019 would have been around $2,500, is now close to $15,000  https://t.co/fm48hkZecr",
  "data/tweet-economist/2021/9/1437635801702141953.json": "Because Madagascar has banned foreign journalists (due to covid-19), few in the outside world are aware of the famine that has left more than a million people hungry in the south of the Island https://t.co/ppgl9aWsu5",
  "data/tweet-economist/2021/9/1437664331676667905.json": "Societies that treat women badly are poorer and less stable https://t.co/TCnhODH28L",
  "data/tweet-economist/2021/9/1437688001140822021.json": "Sea cucumbers are under threat. Growing them in designated and contained areas is helping to protect both this important species and other kinds of marine life here in the south-west of Madagascar https://t.co/CIztRTgzcG https://t.co/EidYNivvqx",
  "data/tweet-economist/2021/9/1437564214286209024.json": "If women are subject to autocracy and terror in their homes, society is also more vulnerable to these ills https://t.co/mnluf6iy3P",
  "data/tweet-economist/2021/9/1437568881539883024.json": "Europe seems to realise it will have to do more by itself. Whether sceptics understand it or not, this is exactly what France has been saying https://t.co/ppOc3NomKp",
  "data/tweet-economist/2021/9/1437754269827014659.json": "In America, the virus is spreading fastest among young people https://t.co/DrQTfdhY3X",
  "data/tweet-economist/2021/9/1437870530548404226.json": "The California recall election will cost $276m in taxpayer money https://t.co/Q24Tfx3YTr",
  "data/tweet-economist/2021/9/1437911820992401413.json": "The global score of 5.37 out of ten is the lowest recorded since @TheEIU's Democracy Index began in 2006 https://t.co/Lo9zjby2e3",
  "data/tweet-economist/2021/9/1437924934647488513.json": "Recent modelling by scholars at Columbia University estimates that in July child poverty was 41% lower than normal. It appears that Joe Biden is fulfilling his promise to oversee America’s “largest ever one-year decrease in child poverty”  https://t.co/wp0belRYFW",
  "data/tweet-economist/2021/9/1437960911415877644.json": "There is growing evidence that Hillary Clinton was on to something a decade ago when she said: “The subjugation of women is...a threat to the common security of our world” https://t.co/YULoj4U4ei",
  "data/tweet-economist/2021/9/1437979711641169921.json": "Social media has changed things: videos of Taliban fighters beating women who attended a protest in Kabul are circulating, and the new government cannot block them\nhttps://t.co/gXvstZnLvI",
  "data/tweet-economist/2021/9/1438039558306865153.json": "Societies that treat women badly are poorer and less stable https://t.co/YtwivDLODf",
  "data/tweet-economist/2021/9/1438021564855988225.json": "France's ambassador to Afghanistan declared—a full month before the fall of Kabul—that a safe exit could no longer be guaranteed for its nationals https://t.co/dit6x1wIXj",
  "data/tweet-economist/2021/9/1438066640936132617.json": "The average door-to-door shipping time for ocean freight has gone from 41 days a year ago to 70 days  https://t.co/g2MMrKrvHc",
  "data/tweet-economist/2021/9/1438130530827055104.json": "The child-poverty rate dropped from 15.8% in June to 11.9%, representing a decline of 3m American children living in poverty  https://t.co/EWIjlxihRJ",
  "data/tweet-economist/2021/9/1438198840381911045.json": "Nations that treat women badly are more likely to suffer violent unrest. Studying geopolitics through the prism of sex suggests trouble in store for Saudi Arabia, Pakistan and even India https://t.co/9Xji4fIXBR",
  "data/tweet-economist/2021/9/1438203437322326017.json": "The spot price for sending a standard large container from Shanghai to New York, which in 2019 would have been around $2,500, is now close to $15,000  https://t.co/W96iW1AWpF",
  "data/tweet-economist/2021/9/1438120495954735109.json": "In America, the virus is spreading fastest among young people https://t.co/t3GwhD5Mkm",
  "data/tweet-economist/2021/9/1438211775795765248.json": "Many children are dropping out of school to work or forage for food\nhttps://t.co/MbFDhkcaCo",
  "data/tweet-economist/2021/9/1438258196762791936.json": "The pact, which will be signed formally next week, reflects their shared concern over China’s growing power, and America’s eagerness to beef up the military capabilities of its Asian partners  https://t.co/Gu9eiYsixr",
  "data/tweet-economist/2021/9/1438257203757162499.json": "North Korea has continued to expand both its nuclear and its conventional arsenal, in the face of UN sanctions that ban it from developing nuclear weapons and ballistic missiles https://t.co/InXrlsnXZ4",
  "data/tweet-economist/2021/9/1438270410622181378.json": "By our estimates, the pandemic has claimed 860,000 lives in America. Yet measures to curb the virus by mandating vaccination are being treated as a terrifying affront to liberty https://t.co/TEot1Gl31f",
  "data/tweet-economist/2021/9/1438266209762516997.json": "In theory the need to make up for lost schooling could be an opportunity to try something new. But America remains stuck in debate about teaching children to read that has been rumbling on for decades  https://t.co/byGOABSqne",
  "data/tweet-economist/2021/9/1438288719107305472.json": "Only six countries in the world—America, Britain, China, France, India and Russia—currently operate nuclear-powered submarines. Australia may become the unlikely seventh   https://t.co/eT22bisUSy",
  "data/tweet-economist/2021/9/1438298607476789251.json": "Five of the top twenty sugar-consuming nations are in the Middle East. Why is the region so enchanted by sweet stuff? https://t.co/unPsGuqjnU",
  "data/tweet-economist/2021/9/1438284061135474689.json": "America set out to reshape the world order after the attacks of September 11th. Twenty years on, is the era of American interventionism over? Our “Checks and Balance” podcast investigates https://t.co/PoDPd7qCYq https://t.co/YqU4RKmoQX",
  "data/tweet-economist/2021/9/1438323634540621825.json": "The average cost of shipping a standard large container has surpassed $10,000, some four times higher than a year ago  https://t.co/p6hiAQYl1Y",
  "data/tweet-economist/2021/9/1437956560043626502.json": "Nayib Bukele is wrecking democracy in El Salvador https://t.co/10VovpMiDR",
  "data/tweet-economist/2021/9/1438347122026418176.json": "Societies that oppress women are far more likely to be violent and unstable. Policymakers who fail to consider the interests of half the population cannot hope to understand the world https://t.co/3tHGOfK8rm",
  "data/tweet-economist/2021/9/1438343123592167425.json": "One study found that in China, for every 1% rise in the ratio of men to women, violent and property crime rose by 3.7% https://t.co/3AslMZfFoL",
  "data/tweet-economist/2021/9/1438335352754872321.json": "Australia is ending its zero-covid strategy https://t.co/ksJ9WQTl8k",
  "data/tweet-economist/2021/9/1438360428376207360.json": "The acquisition of nuclear-powered submarines would significantly bolster Australia’s navy  https://t.co/0rryw2Ihe7",
  "data/tweet-economist/2021/9/1438390606892572673.json": "Social media has changed things: videos of Taliban fighters beating women who attended a protest in Kabul are circulating, and the new government cannot block them\nhttps://t.co/rre6pLs1yo",
  "data/tweet-economist/2021/9/1438421438998978568.json": "A mathematician in Australia recently discovered that a 3,700-year-old clay tablet known as Si.427 was used for measuring the land   https://t.co/W2YuHIAAVZ",
  "data/tweet-economist/2021/9/1438374357542318081.json": "“I am not rich enough to eat baklava every day”: the Middle Eastern treat has a layered history. From @1843mag https://t.co/e1JcAWxSyw",
  "data/tweet-economist/2021/9/1438412673314607106.json": "Losses from disasters cost the insurance industry $144bn in 2017. How will it adapt to the worsening impact of climate change? https://t.co/9phYgBGNJI https://t.co/HZda17Mg03",
  "data/tweet-economist/2021/9/1438469967457001475.json": "The spot price for sending a standard large container from Shanghai to New York, which in 2019 would have been around $2,500, is now close to $15,000  https://t.co/omSlvcEVYy",
  "data/tweet-economist/2021/9/1438435200174854146.json": "Unlike the trips of Richard Branson and Jeff Bezos, SpaceX’s passengers have gone all the way to orbit https://t.co/seGJfNyk8Q",
  "data/tweet-economist/2021/9/1438502450982375438.json": "As the 20th anniversary of the previous fall of Kabul approaches, @PayendaSargand, a journalist from Kabul, realises he “should have been paying more attention to history”. From @1843mag \nhttps://t.co/rHiSvdJ9In",
  "data/tweet-economist/2021/9/1438524270175477760.json": "Decentralised finance is one of three tech trends disrupting finance—and it has the potential to rewire how the industry works. In our cover this week, we go down the “DeFi” rabbit hole https://t.co/j7G04qDCJ3 https://t.co/UO2mp6ejVG",
  "data/tweet-economist/2021/9/1438514105262895106.json": "Six Balkan nations keep trying to join the European Union https://t.co/aTL3kCvYLa",
  "data/tweet-economist/2021/9/1438425302934360064.json": "Some female academics who have objected to “gender ideology”—the primacy of gender identity over biological sex—have been removed from professional posts. They are fighting back https://t.co/nuKXUis5iE",
  "data/tweet-economist/2021/9/1438585017605763073.json": "Beyond the bitcoin tech-bro hype is an old-fashioned autocrat https://t.co/jjdYJQZVGk",
  "data/tweet-economist/2021/9/1438673648680947713.json": "How Hunter S. Thompson’s drug-fuelled bender became a cult novel https://t.co/QGJBOoB4LP",
  "data/tweet-economist/2021/9/1438596781097488388.json": "With an extra 8m children working and some 6.5m more doing dangerous jobs, progress on child labour has reversed since 2016  https://t.co/WtpzRI6Etg",
  "data/tweet-economist/2021/9/1438750171769319427.json": "Societies that oppress women are far more likely to be violent and unstable. Policymakers who fail to consider the interests of half the population cannot hope to understand the world https://t.co/KXo0cK9fuH",
  "data/tweet-economist/2021/9/1438746310040068101.json": "“It seems as if the surest way to curse one’s nation is to subordinate its women,” say the authors of a study that ranks 176 countries for misogyny https://t.co/Ullyv9x92c",
  "data/tweet-economist/2021/9/1438410095025590275.json": "An “enhanced trilateral security partnership” between America, Britain and Australia, named AUKUS, reflects their shared concern over China’s growing power   https://t.co/5MSq4zxhEJ",
  "data/tweet-economist/2021/9/1438766950809841667.json": "Social media creates additional pressure to construct a perfect public image, exacerbating our feelings of inadequacy\nhttps://t.co/1TQuEMXvrp",
  "data/tweet-economist/2021/9/1438725415728783360.json": "The crowdsourced encyclopedia is a welcome oddity on the modern internet https://t.co/oPghixX0wK",
  "data/tweet-economist/2021/9/1438842619631751168.json": "RT @PedderSophie: Macron's covid passports have been controversial, risky--and a spectacular success. By September 15 74% of the French (an…",
  "data/tweet-economist/2021/9/1438839081421660165.json": "This week’s cartoon from KAL: https://t.co/ribhn54LOF https://t.co/KF28Faucit",
  "data/tweet-economist/2021/9/1438697778801217537.json": "We live in an age of infinite scrolling and endless interruptions. So what happens when you unplug your life? Tom Lamont met the man who works in total darkness https://t.co/R64i6TftiW",
  "data/tweet-economist/2021/9/1438894032416133121.json": "The Kremlin has been hoping that most Russians will take no interest in the election. The opposite may be happening https://t.co/npovqUID5o",
  "data/tweet-economist/2021/9/1438920964083957763.json": "Muhammad Ali was as brave as he was brilliant; happily, few athletes today are called upon to risk so much. From Back Story, our new culture column\nhttps://t.co/nsoCpmSvWO",
  "data/tweet-economist/2021/9/1438869365441634313.json": "The covid-19 pandemic has helped increase China’s share of global trade https://t.co/Pw4cK1vNV1",
  "data/tweet-economist/2021/9/1438987136494186498.json": "The average cost of shipping a standard large container has surpassed $10,000, some four times higher than a year ago https://t.co/WnFmOKP6mK",
  "data/tweet-economist/2021/9/1438990190253645832.json": "Ten years ago an economist predicted that China’s economic power would overtake that of America by 2020. That has come true—on one measure https://t.co/H3SaUGyx2h",
  "data/tweet-economist/2021/9/1438945882783748103.json": "Across Africa, more than a fifth of children work https://t.co/nH5uhJDTHc",
  "data/tweet-economist/2021/9/1439029674659794945.json": "In Iceland, the \"Orca\" carbon-capture plant has switched on its fans and begun scrubbing carbon dioxide from the atmosphere https://t.co/IzMzPzZYqE",
  "data/tweet-economist/2021/9/1439056875933294592.json": "Evergrande, once thought too big to fail, now finds itself on the cusp of default, with debts of $300bn https://t.co/dlQRMC4BSK",
  "data/tweet-economist/2021/9/1439081180633124864.json": "When President Barack Obama opened combat roles to women in 2015, the legal logic barring women from the draft came undone https://t.co/tPvyQ3q3qV",
  "data/tweet-economist/2021/9/1439100141265371138.json": "With 663,325 deaths from covid-19, America will shortly exceed the number of fatalities resulting from the 1918 influenza pandemic (675,000)  https://t.co/ZbozBhHDRO",
  "data/tweet-economist/2021/9/1439131061720657920.json": "If you thought men hunted and women gathered, think again https://t.co/wlv6B8XmQr",
  "data/tweet-economist/2021/9/1439139237400563716.json": "Between 2016 and 2020, the number of working children around the world rose for the first time since 2000. All of the net increase happened in sub-Saharan Africa https://t.co/zmwRTPdilL",
  "data/tweet-economist/2021/9/1439168324282298368.json": "The spot price for sending a standard large container from Shanghai to New York, which in 2019 would have been around $2,500, is now close to $15,000 https://t.co/QCk40FG6of",
  "data/tweet-economist/2021/9/1439135380599619590.json": "For the world to reach the Paris climate agreement targets, carbon will have to be removed from the atmosphere https://t.co/BXX6ZCsAfN",
  "data/tweet-economist/2021/9/1439095844695945216.json": "The closure of Toshiba’s factory in Dalian shows how global supply chains are being reconfigured: delicately and at the margin https://t.co/oDf2Xfn7is",
  "data/tweet-economist/2021/9/1439206596484210692.json": "The average door-to-door shipping time for ocean freight has gone from 41 days a year ago to 70 days  https://t.co/9M1WfoqFK7",
  "data/tweet-economist/2021/9/1439232011160494089.json": "In 2010 Arvind Subramanian, an economist, predicted that China would become the world's most dominant economy by 2020. How has that prediction fared? https://t.co/ei1ScvGkIc",
  "data/tweet-economist/2021/9/1439272515650658308.json": "Russia’s internet censor has blocked a smart­-voting website. There is Soviet­-style intimidation offline, too  https://t.co/WwfR6uE9q9",
  "data/tweet-economist/2021/9/1439268496555364354.json": "Long before his conversion to Islam and stance on Vietnam, Ali was booed by crowds and loathed by the wider public—for his cockiness, his opinions and the fact that he had them\nhttps://t.co/C70Zn9yXxJ",
  "data/tweet-economist/2021/9/1439288457663336450.json": "Climate-controlling technology might be the only solution for cooling the planet. But it comes with great risk https://t.co/oaBgPdE4Bi https://t.co/qGc8jcpqaG",
  "data/tweet-economist/2021/9/1439278308148006920.json": "African children go to cities to get an education. Instead, many are put to work by relatives, acquaintances or criminal gangs https://t.co/SMDDSiBR5d",
  "data/tweet-economist/2021/9/1439308505832476672.json": "From Zambia to Nigeria, millions of children as young as five toil as domestic servants https://t.co/s1ZSc6Lrvy",
  "data/tweet-economist/2021/9/1439220428979986433.json": "Did the Turks really invent baklava? @1843mag has the answer https://t.co/znnIhPhZa5",
  "data/tweet-economist/2021/9/1439042257613692932.json": "The Marxist philosopher who created a shadowy terrorist army called Sendero Luminoso (Shining Path), ordered massacres, murders, car bombs and the destruction of police stations  https://t.co/zHwty2aixG",
  "data/tweet-economist/2021/9/1439315805389328387.json": "Cow urine produces ammonia, which in turn is converted into nitrous oxide, a potent greenhouse gas https://t.co/xjJjLeS7wb",
  "data/tweet-economist/2021/9/1439358600133156868.json": "Mexico’s warmer climate means it can grow certain produce when the United States cannot, and in bigger quantities than California or Florida  https://t.co/V1y4kqtF9l",
  "data/tweet-economist/2021/9/1439397846722166789.json": "Many Japanese firms are moving factories out of China and into Thailand, or back home—still, most are not rushing to exit China altogether https://t.co/SuuSpwAkTj",
  "data/tweet-economist/2021/9/1439258952966057988.json": "The dream of a low-friction financial system, built on the likes of Ethereum, may be just the beginning https://t.co/lq8Pf4KoLa",
  "data/tweet-economist/2021/9/1439227970137346056.json": "Utah was the fastest growing state between 2010 and 2020, and has a jobless rate of just 2.8%, compared with a national rate of 5.2%. It has also had one of the strongest rebounds from covid-19 https://t.co/wS8fLRB2a0",
  "data/tweet-economist/2021/9/1439187953113309185.json": "Why blockchains—from Bitcoin to Ethereum—have taken the tech world by storm https://t.co/HFassHnasx",
  "data/tweet-economist/2021/9/1439431824124620800.json": "Versions of the sweet, nutty pastries have been made for centuries, but it was the Ottomans who perfected the sticky glory of baklava https://t.co/5y7d5FFk6W",
  "data/tweet-economist/2021/9/1439447616828366852.json": "“The end of American empire was not difficult to foresee,” argues historian Niall Ferguson in The Economist. What does this mean for world affairs? https://t.co/AiEwJjjQby",
  "data/tweet-economist/2021/9/1439451482575757312.json": "The pandemic has shown how risk-averse humans usually are. But there are always outliers https://t.co/QPmU5PVDRZ",
  "data/tweet-economist/2021/9/1439320853401985029.json": "How do you persuade those hesitant to be vaccinated to get the jab? France has a success story https://t.co/MOe5Ql27r0",
  "data/tweet-economist/2021/9/1439474676510638093.json": "How should economic dominance be measured? https://t.co/04YtHYenaL",
  "data/tweet-economist/2021/9/1439346759193538561.json": "The Orca carbon-capture plant will bury 4,000 tonnes of carbon dioxide a year, out of around 35bn tonnes produced by burning fossil fuels https://t.co/FafvTM8Acs",
  "data/tweet-economist/2021/9/1439325121043386373.json": "That would help roll out the Internet of Things https://t.co/1dRuqbxq5N",
  "data/tweet-economist/2021/9/1439209602332176389.json": "Instead of a measure of how easy it is to do business in 190 countries, the rankings have become a revealing gauge of how the World Bank itself does business under political pressure  https://t.co/ehmZTAp0Kr",
  "data/tweet-economist/2021/9/1439491296402489345.json": "Ethereum verified transactions worth $2.5trn in the second quarter. The blockchain network is reaching critical mass https://t.co/oesdvsXbgS",
  "data/tweet-economist/2021/9/1439511813977251840.json": "One child-labourers’ union says its members have no choice but to work. It calls for better protection for child workers https://t.co/Z4HDYKCHVu",
  "data/tweet-economist/2021/9/1439506322588831745.json": "The crisis of covid-19 vaccine distribution illustrates the problem, argues Gordon Brown. New covid-19 variants will “haunt us all” unless the West commits to vaccinating poorer countries as widely as rich ones  https://t.co/OrharOfOn8",
  "data/tweet-economist/2021/9/1439375972709683202.json": "Global supply chains are under intense pressure. But they will survive this trial https://t.co/rrUlX7p9un",
  "data/tweet-economist/2021/9/1439566710865121282.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/w79lWXTpwd",
  "data/tweet-economist/2021/9/1439470872901869570.json": "To promote reading, Saudi Arabia is distributing Japanese-style comics to every Saudi child over ten, with superheroes speaking Arabic slang https://t.co/zLI2kKf6gT",
  "data/tweet-economist/2021/9/1439349785958420487.json": "A blockchain contract may say you own a house but only the police can enforce an eviction. Integrating with the real world is a challenge for DeFi https://t.co/lRxHxPcaQu",
  "data/tweet-economist/2021/9/1439585309763715076.json": "Giving cash transfers, investing in education and providing women with opportunities helps to keep children in school and out of the fields https://t.co/N4FSgYrWen",
  "data/tweet-economist/2021/9/1439530268759572485.json": "The pandemic has exposed how racism can be a matter of life or death. In America, black people are almost twice as likely as white people to die from covid-19 https://t.co/zEBJ4Nl0Ao https://t.co/LEfRctmB7r",
  "data/tweet-economist/2021/9/1439393889199198208.json": "“No other wealthy country in the world has introduced a six-week abortion ban, it’s not a compassionate thing to do.” @mianridge tells our “Checks and Balance” podcast that it’s the poorest women in Texas who will be most affected by the new abortion law https://t.co/Rknr1Tibs3 https://t.co/qIZ154u3Fz",
  "data/tweet-economist/2021/9/1439615023534460932.json": "Cows are intelligent animals. So toilet training has been quite successful  https://t.co/4XNC4YHQz5",
  "data/tweet-economist/2021/9/1439630239454400512.json": "A German scientist has developed a three-stage process to help cows master toilet training in an attempt to reduce greenhouse gas emissions https://t.co/qBbPEM0W9U",
  "data/tweet-economist/2021/9/1439645980866064389.json": "Few stories can sustain eight hours of television, but Muhammad Ali’s is one of them. Back Story, our new culture column, assesses a new four-part documentary series about the boxer\nhttps://t.co/z65lmHVEa2",
  "data/tweet-economist/2021/9/1439658560665919495.json": "Baklava pops up everywhere, from Morocco to Iran. But who really invented the Middle Eastern pastry? https://t.co/p3LVAk1cAd",
  "data/tweet-economist/2021/9/1439658079562391555.json": "The Economist built a machine learning model to estimate excess deaths. The true death toll of covid-19 is dramatically different from official death tallies https://t.co/tF8FOz2cdR",
  "data/tweet-economist/2021/9/1439640696001110016.json": "How Hunter S. Thompson’s drug-fuelled bender became a cult novel https://t.co/ZgDMfjXphi",
  "data/tweet-economist/2021/9/1439405887291002881.json": "American companies have raised nearly $350bn since the start of 2020, more than in the previous seven years combined https://t.co/WM59AD1ms9",
  "data/tweet-economist/2021/9/1439717443652497408.json": "Beyond the bitcoin tech-bro hype is an old-fashioned autocrat https://t.co/XINccwbH0h",
  "data/tweet-economist/2021/9/1439751761863061510.json": "The covid-19 pandemic has helped increase China’s share of global trade https://t.co/HIRC28E86o",
  "data/tweet-economist/2021/9/1439769646039769091.json": "By one estimate, about two-thirds of Evergrande’s roughly $300bn in liabilities is cash that customers have put down for homes that have yet to be finished https://t.co/Iw9FOUT9z3",
  "data/tweet-economist/2021/9/1439805749924880384.json": "Decentralised finance is one of three tech trends disrupting the money industry. As with the early days of the internet, no one knows where the revolution will end https://t.co/SEskXp19Qr",
  "data/tweet-economist/2021/9/1439727386099130368.json": "Unlike a bank or a tech platform, blockchains are verified by a decentralised network of individuals https://t.co/ZLouLD4T4F",
  "data/tweet-economist/2021/9/1439814595510775809.json": "“I didn’t choose this for my children,” says a mother of six, all of whom work at a quarry https://t.co/1rzO81pzft",
  "data/tweet-economist/2021/9/1439604973663363073.json": "Immigration has become far less salient in Britain. That is a big political shift\nhttps://t.co/k9RfcVF0tl",
  "data/tweet-economist/2021/9/1439883225715838978.json": "The announcement by America, Australia and Britain of a new security pact, which torpedoed Australia’s $90bn submarine contract with France, has left the country humiliated  https://t.co/syak8SslJu",
  "data/tweet-economist/2021/9/1439670135942434819.json": "At $2bn, Gary Gensler’s budget at the SEC is smaller than JPMorgan Chase’s annual spending on marketing https://t.co/5tUUsap14O",
  "data/tweet-economist/2021/9/1439862037463642122.json": "What are blockchains? We explain https://t.co/7YqQlPcXeY",
  "data/tweet-economist/2021/9/1439930048828563458.json": "The Taliban have shut down the women’s affairs ministry and girls have already been barred from secondary schools. This will have wide-reaching consequences https://t.co/7fRFIYbZNH",
  "data/tweet-economist/2021/9/1439649005387108361.json": "It costs ClimeWorks $600-800 to sequester one tonne of carbon dioxide. The firm sells offset packages online for around $1,200 per tonne https://t.co/vkhSmWCAqF",
  "data/tweet-economist/2021/9/1439938159853375494.json": "Female employees of Kabul’s municipal government were told to stay home, as Afghanistan’s Taliban rulers continued to choke women’s rights in the name of sharia law. We explain what it is https://t.co/WxobRTKFaL",
  "data/tweet-economist/2021/9/1439793255466536962.json": "Severing ties with China would disrupt relationships with suppliers and manufacturing know-how. But at the margin, China no longer looks like the place to be https://t.co/719lQw9bmn",
  "data/tweet-economist/2021/9/1440023734442680323.json": "Both Muhammad Ali and Martin Luther King came to be revered for their principles and courage, but were first, and for years, reviled for them. From Back Story, our new culture column\nhttps://t.co/ryvO612Id2",
  "data/tweet-economist/2021/9/1439682020590985217.json": "Will investors be taken for a ride? https://t.co/wBQvyl4nE1",
  "data/tweet-economist/2021/9/1440023469345943561.json": "The moment that Jean-Yves Le Drian, the French foreign minister, described the new American-Australian sub deal as a “stab in the back”, the anger in Paris was plain https://t.co/g2dPRMC0cV",
  "data/tweet-economist/2021/9/1440040832602574855.json": "Angela Merkel has at times seemed more monarch than chancellor. Her departure will leave a big hole in Germany—and much for her successor to do. Our latest special report  https://t.co/0RZIwjN7B4 https://t.co/tbGDdHPvnw",
  "data/tweet-economist/2021/9/1439941173678850051.json": "It is speculative to think that decentralised finance will take off. But the potential gains from it could be vast https://t.co/TmBGLGG3Fm",
  "data/tweet-economist/2021/9/1440045108569591809.json": "Rarely do you get to witness geopolitical shifts. The new AUKUS deal is one of those times https://t.co/FR7UsXEb3k",
  "data/tweet-economist/2021/9/1440177196052533253.json": "Despite Delta, severe covid-19 is much rarer among vaccinated Britons https://t.co/YVWkhY0hVZ",
  "data/tweet-economist/2021/9/1440164461424230409.json": "Rapid emission cuts can reduce the risks but not eliminate them https://t.co/jHWsY9SAK6",
  "data/tweet-economist/2021/9/1440213645212876800.json": "The most probable geopolitical conclusion that France will draw from the new sub deal is that they were right to judge America an unreliable ally, and to seek greater self-reliance instead https://t.co/8f8nAV5aZp",
  "data/tweet-economist/2021/9/1440054171571408905.json": "Both the World Bank and the IMF have warned against adopting bitcoin. Why is El Salvador doing it? https://t.co/udjxyMsG8N",
  "data/tweet-economist/2021/9/1440270761567031308.json": "Until covid-19 rekindled interest in the history of pandemics, the Spanish flu was ignored in some history books https://t.co/gmZDJnJbtq",
  "data/tweet-economist/2021/9/1440287969651220492.json": "Due to the financial crisis of 2007-2009, the increased tempo of extreme-weather events and the coronavirus pandemic, more people have been drawn to the apocalypse preparation movement\nhttps://t.co/10jq1VWgGb",
  "data/tweet-economist/2021/9/1440284949991485450.json": "The Kremlin is frantically fighting Mr Navalny’s effort to awaken and co­-ordinate voters https://t.co/Nnk9nWe3DP",
  "data/tweet-economist/2021/9/1440281234681171974.json": "Out of 16 calves in the experiment, 11 were considered successfully toilet-trained by the end of it https://t.co/BSqXkaTv1W",
  "data/tweet-economist/2021/9/1440291998217297928.json": "Angela Merkel has at times seemed more monarch than chancellor. Now, her 16-year reign is about to come to an end. What does the future hold for Germany? https://t.co/NKKeWzsidZ",
  "data/tweet-economist/2021/9/1440308773743067148.json": "A team of forensic architects and historians has studied old maps, soil samples, photographs and witness statements to reconstruct a lost topography, and the terrible events that followed the Nazi invasion https://t.co/zIo2nMDJTk",
  "data/tweet-economist/2021/9/1440309609084846091.json": "The United Nations General Assembly kicks off in-person this week. On the UN’s 75th birthday last year, our special report assessed the organisation’s role in the world https://t.co/T4dbUn5Ckf",
  "data/tweet-economist/2021/9/1440316866434502669.json": "The French president asked for “forgiveness” on the behalf of France for the Algerian soldiers who fought for France during the Algerian war https://t.co/fmRWUz6P53",
  "data/tweet-economist/2021/9/1440300046524637196.json": "America and the EU have launched a joint effort to curb emissions of methane. Here's why it should be a priority for leaders at #COP26 https://t.co/m2emHV1lVL",
  "data/tweet-economist/2021/9/1440336300066836484.json": "With energy prices expected to remain high, consumers may soon feel the pinch https://t.co/tdHbQLW9CV",
  "data/tweet-economist/2021/9/1440342077594685445.json": "The Taliban plans to rule Afghanistan in accordance with sharia law. But what is it, and how is it applied? We explain https://t.co/y9un3DMAjX",
  "data/tweet-economist/2021/9/1440353377603362824.json": "America's official covid-19 death toll has surpassed that of the 1918 Spanish flu pandemic. Our excess deaths model estimates its true death toll to be 30% greater\nhttps://t.co/Ub8W0be8cI",
  "data/tweet-economist/2021/9/1440319407788474376.json": "All parties agree on the need to speed up climate protection, but differ strongly on the balance between market mechanisms and regulation https://t.co/kETai0dHz8",
  "data/tweet-economist/2021/9/1440304421099823109.json": "Free to read | A new poll from The Economist and YouGov found that 52% of adults approve of vaccine mandates  https://t.co/C3NSj3dm6w",
  "data/tweet-economist/2021/9/1440349483426926601.json": "To promote reading, Saudi Arabia is distributing Japanese-style comics to every Saudi child over ten, with superheroes speaking Arabic slang https://t.co/YC62J7QuQ6",
  "data/tweet-economist/2021/9/1440356906858471427.json": "The bank has said it will stop its Doing Business rankings. That was perhaps inevitable, given the damage to their credibility https://t.co/43GruV4jJl",
  "data/tweet-economist/2021/9/1440330316082601984.json": "Paul Rusesabagina has been sentenced to 25 years in prison. Last year we looked at what his arrest revealed about Paul Kagame’s willingness to attack critics of his authoritarian regime https://t.co/ESBDJQLScQ",
  "data/tweet-economist/2021/9/1440357427883347972.json": "Justin Trudeau remains Canada’s prime minister after Monday’s election. But as @hoganem tells “The Intelligence”, his soft power is damaged after a disappointing result https://t.co/XCYxnGZaAi",
  "data/tweet-economist/2021/9/1440375272990068742.json": "The Biden administration is rolling out perhaps the most important anti-poverty policy in a generation. \n\nAs these charts show, it has already had a big effect. But read why it has not received enough attention 👇",
  "data/tweet-economist/2021/9/1440376040191250437.json": "Angela Merkel has been Europe’s indispensable leader, and has shaped its response to crises. Who will take her place? #BTW21 https://t.co/tQ8Ute04yp",
  "data/tweet-economist/2021/9/1440372274733871108.json": "The new kind of digital economy that developers are trying to build on top of blockchains could revolutionise finance—but DeFi is still in its infancy https://t.co/mUO8bqlIu2 https://t.co/EHg7BNF0Dg",
  "data/tweet-economist/2021/9/1440490219485085705.json": "Sunlight is the best disinfectant https://t.co/VumhZDohp1",
  "data/tweet-economist/2021/9/1440333532375633921.json": "Germany’s election is just a few days away. Meet the candidates hoping to become Germany’s next chancellor—and find out how strong their chances are #BTW21 https://t.co/vDGjVAudYv",
  "data/tweet-economist/2021/9/1440653173660602372.json": "Natural immunity is most common among the young, the last group to be offered the vaccine https://t.co/8sey5xVtG1",
  "data/tweet-economist/2021/9/1440648438920613895.json": "At the UN General Assembly, President Xi Jinping said China would stop financing coal-fired power plants overseas https://t.co/Jq7y4aWKgI",
  "data/tweet-economist/2021/9/1440657885772455946.json": "After George Floyd’s death on May 25th the number of 911 calls for every gun death or injury fell by almost half https://t.co/ybfGOFLUrQ",
  "data/tweet-economist/2021/9/1440666228163371019.json": "Provoking a financial crisis and a government shutdown at the same time would be an extraordinary act of self-sabotage https://t.co/lx3BeiSbt7",
  "data/tweet-economist/2021/9/1440675353479970818.json": "The politics of gardens from Eden to outer space\nhttps://t.co/KOUJiswWsZ",
  "data/tweet-economist/2021/9/1440698055083266054.json": "Angela Merkel will be a pretty tough act to follow. She has been a rock through the pandemic and four terms of economic and political crises #BTW21 https://t.co/eSlzpWinwp",
  "data/tweet-economist/2021/9/1440733402697584649.json": "It is hard to overstate the sense of bitterness and grievance in Paris after the American-Australian deal was made https://t.co/G2LaBaPZlP",
  "data/tweet-economist/2021/9/1440693222729080840.json": "Since the onset of the coronavirus pandemic in early 2020 many have wondered when the world will return to “normal”. How close are countries? A thread 👇 (1/9) https://t.co/Id0MGgHQ1A https://t.co/O7exERLak3",
  "data/tweet-economist/2021/9/1440471206805721091.json": "Here’s how innovation in decentralised finance could improve the real-world industry—beyond shopping in “metaverse” malls https://t.co/HtiUXuF8TT https://t.co/WsWeg2Jy3X",
  "data/tweet-economist/2021/9/1440462112875188228.json": "In the wake of George Floyd’s murder in May 2020, civilian engagement with police plummeted https://t.co/PktHV81Tkp",
  "data/tweet-economist/2021/9/1440920241215877120.json": "Angela Merkel made herself the indispensable European: brilliantly briefed, invested in personal relationships, and possessing almost superhuman negotiating stamina https://t.co/mYYeL9sBOC",
  "data/tweet-economist/2021/9/1440965541036953600.json": "Anti-greenery is brewing in Britain. A backlash against environmentalism could reshape politics as radically as Brexit did https://t.co/zC0duaQMfm",
  "data/tweet-economist/2021/9/1440992610592624642.json": "China's financial system is ineﬃcient at allocating capital. This a problem the world cannot ignore https://t.co/L4QdxFj9rp",
  "data/tweet-economist/2021/9/1441064979596259328.json": "With AUKUS, America is at last getting serious about countering China in Asia. Yet the deal amounts to only half a China strategy. One of our two covers this week https://t.co/FqBZxb2ZXT https://t.co/jNF1F2TVQh",
  "data/tweet-economist/2021/9/1440879368092454914.json": "Containers are in short supply and many planes remain grounded, which restricts the movement of fresh food https://t.co/5uUnQWiWw2",
  "data/tweet-economist/2021/9/1441083202274086915.json": "The CDU/CSU has blown it. We would prefer the Social Democratic Party to lead Germany’s next coalition. One of our two covers this week #BTW21 https://t.co/vIwMX2winc https://t.co/YlMI0DbdOF",
  "data/tweet-economist/2021/9/1441122213361426446.json": "Gross domestic product (GDP) is increasingly a poor measure of prosperity. It is not even a reliable gauge of production\nhttps://t.co/wrMtBdfnEZ",
  "data/tweet-economist/2021/9/1441144110182658050.json": "RT @gelliottmorris: Our The Economist/YouGov poll this week finds a clear majority of the public is in favor of abortion rights. Only 28% o…",
  "data/tweet-economist/2021/9/1441184134051758085.json": "Tracks from a dried-up lake bed in New Mexico are one of several sets which radiocarbon evidence suggests were made between 21,000 and 23,000 years ago https://t.co/PBXlz2GgiW",
  "data/tweet-economist/2021/9/1440956627016900608.json": "“No other wealthy country in the world has introduced a six-week abortion ban, it’s not a compassionate thing to do.” @mianridge tells our “Checks and Balance” podcast that it’s the poorest women in Texas who will be most affected by the new abortion law https://t.co/DVUnRIsZbo https://t.co/LMtOb992IX",
  "data/tweet-economist/2021/9/1441219395934736384.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/Uizzf0CcnW",
  "data/tweet-economist/2021/9/1441182362440646663.json": "DNA vaccines could play a part in fighting illnesses such as cancer and HIV https://t.co/xz7QhqK0el",
  "data/tweet-economist/2021/9/1441175057124904961.json": "Balance is needed between the hard power of AUKUS and the collaboration and rules-based competition with China that are required for climate diplomacy and trade https://t.co/yddCnaUr2p",
  "data/tweet-economist/2021/9/1441268015262093317.json": "To build a system that America’s army can use for tactical intelligence, Microsoft has modified an AR headset called HoloLens that it has so far sold mostly to businesses and research outfits https://t.co/X2IYVod5qi",
  "data/tweet-economist/2021/9/1441256049336459273.json": "The tracks are the oldest undisputed evidence of human beings in North America https://t.co/8WPJDhy6z2",
  "data/tweet-economist/2021/9/1441297116224180225.json": "“She proved to be the only calm person in the room, the only grown-up.” Political veteran Wolfgang Nowak looks back at Angela Merkel’s 16-year leadership with @AnneMcElvoy, on “The Economist Asks” podcast  https://t.co/qF6O5mQKhZ",
  "data/tweet-economist/2021/9/1441263744928161793.json": "Both DNA and mRNA vaccines have robust safety records and far lower production costs than conventional ones https://t.co/FrJe2PLIR6",
  "data/tweet-economist/2021/9/1441369192201031687.json": "Angela Merkel's approach to Europe has not been to everyone's taste. But she has held Europe together when it counts https://t.co/Ch4q4mONjj",
  "data/tweet-economist/2021/9/1441356891167150090.json": "This week's cartoon from KAL: https://t.co/frkJVLnHx1 https://t.co/Jhem2ZUheG",
  "data/tweet-economist/2021/9/1441304119122268160.json": "The fact that Australia ditched the French submarine deal for the Anglo-American one is evidence of strategic seriousness https://t.co/HEUdI4JsBb",
  "data/tweet-economist/2021/9/1441382176705040388.json": "One study covering 11 European countries, all rich, found the link between personal income and well-being was stronger in irreligious places than devout ones https://t.co/NqxYAVYM73",
  "data/tweet-economist/2021/9/1441316684732633100.json": "RT @PedderSophie: After the sub snub. Some on the French right are calling for a de Gaulle-like flourish. But Mr Macron is no anti-American…",
  "data/tweet-economist/2021/9/1441432134812536836.json": "“In a world desperately short of funds for urgent necessities”, America’s extreme dominance in military power is “madness” and “a substantial contribution to environmental destruction”, argues Noam Chomsky https://t.co/dYVIq2nsTP",
  "data/tweet-economist/2021/9/1441474033489305602.json": "“Once we abstract ourselves from thinking ‘we are exceptional’ and universalise issues, we start treating ourselves by the same standards that we apply to others,” argues Noam Chomsky https://t.co/Gp6dW4U2ps",
  "data/tweet-economist/2021/9/1441485868871471106.json": "There was no evidence to prove that anyone outside northern Europe had heard of America until Columbus’s voyage in 1492. Until now  https://t.co/ESjnlNpCt8",
  "data/tweet-economist/2021/9/1441509251092926464.json": "Californians make up 12% of America’s population, but 28% of its homeless https://t.co/hYCZ6N8JSV",
  "data/tweet-economist/2021/9/1441573418705448962.json": "“Since its founding, America has scarcely had a year without resorting to violence,” says Noam Chomsky https://t.co/7H0X7jx7Xp",
  "data/tweet-economist/2021/9/1441610685838995456.json": "In 2018 three authors tried to publish 20 fake papers, in order to expose what they saw as a willingness to publish anything that used the right jargon. Seven were published https://t.co/nqJZFpihTc",
  "data/tweet-economist/2021/9/1441468985023741952.json": "The handshake is on its way out. What will replace it? https://t.co/mWaLKgtwKk",
  "data/tweet-economist/2021/9/1441628584829849602.json": "A critical success and a favourite in Europe, “12 Angry Men” bombed in America on its release. Yet over the years its stature grew https://t.co/zCn0S8E0Kj",
  "data/tweet-economist/2021/9/1441739533494611975.json": "“There are known, feasible remedies for each of the crises that the world faces,” writes Noam Chomsky in a piece for The Economist. “Today, with global warming and the threat of nuclear war, there can be no delay” https://t.co/rPillOki9y",
  "data/tweet-economist/2021/9/1441728705479335941.json": "That they were not being held hostage was always a fiction https://t.co/8f5O5xVtt5",
  "data/tweet-economist/2021/9/1441705646467002369.json": "Artificial intelligence is helping humans to make new kinds of art https://t.co/MLVs8gj7NH https://t.co/gi73I6sUEn",
  "data/tweet-economist/2021/9/1441586548441452551.json": "DNA vaccines have unlocked yet another class of vaccination to experiment with in the fight against covid-19 and other illnesses https://t.co/zK9ZaH8MMY",
  "data/tweet-economist/2021/9/1441770987494727681.json": "Japan’s government is pouring money into researching solid-state battery technology https://t.co/ELKYdVWvNY",
  "data/tweet-economist/2021/9/1441770491728048129.json": "Two days before the election, cities across Germany have been convulsed by the latest Fridays for Future climate strikes https://t.co/E4Nmsrqphp",
  "data/tweet-economist/2021/9/1441803955470839808.json": "New research reveals an Italian monk may have written about seafarers’ accounts of the Americas between around 1339 and 1345  https://t.co/FIabnXXhjO",
  "data/tweet-economist/2021/9/1441788601084399617.json": "Chile is looking to become a world-class exporter of sustainable fish  https://t.co/5xrLF7hsej",
  "data/tweet-economist/2021/9/1441830120612896774.json": "“Donald Trump has brilliantly tapped poisons running below the surface of American society, stirring up a toxic brew that may destroy the country,” says Noam Chomsky. “If that course persists [...] it will be devastating for the world” https://t.co/3UsDj2PjcH",
  "data/tweet-economist/2021/9/1441864346070659075.json": "Britain, Chile, Denmark, France, Germany, Montenegro and Sri Lanka have promised to stop building new coal plants. Here’s why the world needs to kick its coal habit  https://t.co/wpCLuN5x0M https://t.co/wpCLuN5x0M",
  "data/tweet-economist/2021/9/1441861339689881608.json": "The German and international press has been full of farewells to Angela Merkel, and the reviews are mixed https://t.co/B8ygTEVG6c",
  "data/tweet-economist/2021/9/1441880461203050501.json": "Bitcoin tends to move independently of other assets, making it an excellent potential source of diversification https://t.co/1CvGduRp7o",
  "data/tweet-economist/2021/9/1441788851958296577.json": "Seven countries have signed a “no new coal” pledge, initiated by the United Nations, ahead of #COP26 https://t.co/BKxVvFPido https://t.co/BKxVvFPido",
  "data/tweet-economist/2021/9/1441914784618672131.json": "Chinese officials may well conclude that hostage-taking works. But their bullying has come at a diplomatic and strategic cost https://t.co/GNtpRUpxJJ",
  "data/tweet-economist/2021/9/1441613457707737089.json": "In Beijing, it is seen as enraging that America, a failing ex-­hegemon, remains strong enough to defy or dream of containing China https://t.co/Rby1bsLb3X",
  "data/tweet-economist/2021/9/1441935771917824003.json": "The secret pact was as brutal a blow as any Western ally has landed on another in recent times. Trust is the first casualty https://t.co/iXSk42Mhoz",
  "data/tweet-economist/2021/9/1441814273844514816.json": "Daniel Ortega has banned a new novel by Sergio Ramírez and customs officers have been seizing copies  https://t.co/67hXvUTdOE",
  "data/tweet-economist/2021/9/1441953215918927876.json": "“She proved to be the only calm person in the room, the only grown-up.” Political veteran Wolfgang Nowak looks back at Angela Merkel’s 16-year leadership with @AnneMcElvoy, on “The Economist Asks” podcast  https://t.co/k4yGwq76sN",
  "data/tweet-economist/2021/9/1441972010964307969.json": "Japanese battery-makers are betting on solid-state batteries, which are more stable—and potentially more powerful—than conventional Li-ion batteries https://t.co/Ii1Dm7XVFN",
  "data/tweet-economist/2021/9/1441967894133452800.json": "China has so far pursued narrower, rather technical lines of attack on AUKUS https://t.co/OUOr2fPdFm",
  "data/tweet-economist/2021/9/1441977845882916870.json": "Anyone can learn to reason better; in his new book Steven Pinker argues that rationality should join reading, writing and arithmetic as a fourth R https://t.co/gaf4IBmnxB",
  "data/tweet-economist/2021/9/1441989852233228288.json": "The exchange—the “two Michaels” for Meng Wanzhou—puts an end to the elaborate double game played by all three countries https://t.co/ALyWNcGSu8",
  "data/tweet-economist/2021/9/1442071310549413895.json": "“Donald Trump has brilliantly tapped poisons running below the surface of American society, stirring up a toxic brew that may destroy the country,” says Noam Chomsky. “If that course persists [...] it will be devastating for the world” https://t.co/oqlUO16EX4",
  "data/tweet-economist/2021/9/1441829865083179009.json": "When Angela Merkel steps down anyone navigating Germany’s political topography is going to need a new map #BTW21 https://t.co/b7bAPDWxK5",
  "data/tweet-economist/2021/9/1442102916169490434.json": "New research reveals an Italian monk may have written about seafarers’ accounts of the Americas between around 1339 and 1345  https://t.co/wHuBCcpg9b",
  "data/tweet-economist/2021/9/1442082106772004866.json": "China has so far pursued narrower, rather technical lines of attack on AUKUS https://t.co/0RgFHChgcx",
  "data/tweet-economist/2021/9/1442052358918352897.json": "China’s hardening edge in military, diplomatic, economic and technological fields has given the grouping renewed purpose https://t.co/vQ8iYyjnLI",
  "data/tweet-economist/2021/9/1442101180897927168.json": "The secret pact was as brutal a blow as any Western ally has landed on another in recent times. Trust is the first casualty https://t.co/z8ozUVYSpl",
  "data/tweet-economist/2021/9/1442043793755107331.json": "“She was more modern than any other. She wasn’t a typical Christian Democrat.” Political veteran Wolfgang Nowak tells @AnneMcElvoy about the qualities that made Angela Merkel stand out at the start of her political career, on “The Economist Asks” podcast https://t.co/fErU2rlny1",
  "data/tweet-economist/2021/9/1442116519291338754.json": "Angela Merkel will be a pretty tough act to follow. She has been a rock through the pandemic and four terms of economic and political crises #BTW21 https://t.co/AfglOw7HD5",
  "data/tweet-economist/2021/9/1442090342824689669.json": "The Kremlin banned opposition politics, barred independent observers, muzzled independent media and blocked internet sites tied to Alexei Navalny https://t.co/q9hVG6Yh1c",
  "data/tweet-economist/2021/9/1442036218263449600.json": "Sharia means “path” in Arabic. The rules cover everything from social mores to crime and commercial law, and interpretations vary\n\n⬇️ Click to learn what sharia is, and how it is applied",
  "data/tweet-economist/2021/9/1441980611569221636.json": "Many Asian countries worried that America could not provide a counterweight to China. AUKUS offers a rebuttal https://t.co/HK4cCroGhp",
  "data/tweet-economist/2021/9/1442162317546831891.json": "China’s power is “no more of an international threat than many other atrocities, including some that America could easily bring to an end instead of expediting,” argues Noam Chomsky in a piece for The Economist  https://t.co/UiZEWgmzJ6",
  "data/tweet-economist/2021/9/1442194794021851139.json": "The 3,500 households making up the top 0.01% in South Africa have more net wealth than the bottom 90% combined https://t.co/j826J9prYp",
  "data/tweet-economist/2021/9/1442210622729441292.json": "It is too soon to call who will lead Germany’s next government. The Greens and the FDP may be the real winners, as they are both likely to return to government in a coalition #BTW21 https://t.co/t29zDru7DI",
  "data/tweet-economist/2021/9/1442125070999060486.json": "Two planes from the same airline crashed in the same spot, 16 years apart. The melting ice is releasing their secrets https://t.co/kAKc1guFMi",
  "data/tweet-economist/2021/9/1442213276662710272.json": "It is too soon to call who will lead Germany’s next government. Exit polls indicate a tight outcome, leaving the election on a knife edge.\n\nA thread on how the parties stand 👇 https://t.co/hxtmo3mawu https://t.co/XTLTcl4Q2u",
  "data/tweet-economist/2021/9/1442164603966967808.json": "It is as hard to overstate the depth of the anger in Paris as it is to fathom America’s failure to anticipate it https://t.co/wl3cEn00JM",
  "data/tweet-economist/2021/9/1442260211838840832.json": "In 2018, Mark Perry of the University of Michigan revealed that his university had nearly 80 diversity officers at a total annual payroll cost of $10.6m https://t.co/qKLkugouid",
  "data/tweet-economist/2021/9/1442232512416137216.json": "The Biden administration is rolling out perhaps the most important anti-poverty policy in a generation. \n\nAs these charts show, it has already had a big effect. But read why it has not received enough attention 👇",
  "data/tweet-economist/2021/9/1442310704225210368.json": "The American Film Institute recognises “12 Angry Men” as one of the 20th century’s best movies. A new book examines Reginald Rose’s masterpiece https://t.co/2RtdtC4vY5",
  "data/tweet-economist/2021/9/1442324298530639875.json": "Chinese officials may well conclude that hostage-taking works. But their bullying has come at a diplomatic and strategic cost https://t.co/aAHwS6AfCN",
  "data/tweet-economist/2021/9/1442328820007284738.json": "China may see a benefit in letting Western powers feud, uninterrupted https://t.co/cjj1r0xbHB",
  "data/tweet-economist/2021/9/1442192304136089602.json": "It is too soon to call who will lead Germany’s next government. Rarely has the identity of the next chancellor and the make-up of a leading coalition been so uncertain #BTW21 https://t.co/eqUrzgaM2F https://t.co/KKPt64lhm5",
  "data/tweet-economist/2021/9/1442226746514833408.json": "A copy of the Cronica universalis, written by a Dominican in the early 14th century, describes the Americas as “another land, named Marckalada, where giants live”  https://t.co/QRTq3WBhvq",
  "data/tweet-economist/2021/9/1442372884664565765.json": "Angela Merkel will be a pretty tough act to follow. She has been a rock through the pandemic and four terms of economic and political crises #BTW21 https://t.co/jhzexRZotT",
  "data/tweet-economist/2021/9/1442342955176521728.json": "The fact that Australia ditched the French submarine deal for the Anglo-American one is evidence of strategic seriousness https://t.co/lGzPQHYq6Q",
  "data/tweet-economist/2021/9/1442419079860551685.json": "Germany's election results are in—and it’s close. Take a deep dive into how the parties have performed #BTW21 👇 https://t.co/9aO7hBHwVy https://t.co/SnU7Dypt2q",
  "data/tweet-economist/2021/9/1442464566093303820.json": "“The crises that threaten the world have no borders,” argues Noam Chomsky. “The future of the United States, and the world, rests on American-Chinese co-operation” https://t.co/HxWrcS3bOP",
  "data/tweet-economist/2021/9/1442391327702929415.json": "Redistribution of South Africa’s wealth and elite empowerment are no substitute for growth and jobs https://t.co/XTz5SmZQsY",
  "data/tweet-economist/2021/9/1442287188612419590.json": "London is littered with transformations and unexpected tales. In his new book Tom Chivers uncovers some of these stories https://t.co/6viZeXxdlI",
  "data/tweet-economist/2021/9/1442419262119976960.json": "Taiwan and Japan both gave swift endorsements to AUKUS. It is possible that Japan may seek to join it https://t.co/VAGqQ1Bezq",
  "data/tweet-economist/2021/9/1442592624062476290.json": "To lose a big defence deal is one thing. To be kept in the dark for months by three close friends who see no place for you is quite another https://t.co/E9Em02oIC1",
  "data/tweet-economist/2021/9/1442670091468947456.json": "A monk in 14th-century Italy wrote about the Americas https://t.co/Fl3VviXtJA",
  "data/tweet-economist/2021/9/1442677986143215617.json": "“She proved to be the only calm person in the room, the only grown-up.” Political veteran Wolfgang Nowak looks back at Angela Merkel’s 16-year leadership with @AnneMcElvoy, on “The Economist Asks” podcast  https://t.co/Hx4qUQcsMv",
  "data/tweet-economist/2021/9/1442712938272395266.json": "France’s humiliation by America will have lasting effects https://t.co/njvsIAqDXw",
  "data/tweet-economist/2021/9/1442683357666631681.json": "The International Criminal Court takes on Rodrigo Duterte https://t.co/meVwVNXINA",
  "data/tweet-economist/2021/9/1442832138202660867.json": "Many see Brazil’s quest for nuclear subs as a quixotic frippery https://t.co/1KCOM5Ckwi",
  "data/tweet-economist/2021/9/1442869477935173643.json": "Burgernomics was never intended as a precise gauge of currency misalignment, merely a tool to make exchange-rate theory more digestible. Yet the Big Mac index has become a global standard https://t.co/9EvWMqgmWA",
  "data/tweet-economist/2021/9/1442898410747531279.json": "Appointed by the president to a single four-year term, his job was not to make decisions but to advise the president and secretary of defence, laying out the costs and benefits of each option https://t.co/qogcEpF0i3",
  "data/tweet-economist/2021/9/1442893181356445698.json": "It can be hard to tell what’s fact and what’s fake. Time to learn the techniques – and language – of disinformation. From @1843mag https://t.co/rNCyOsWJnV",
  "data/tweet-economist/2021/9/1442908391165202432.json": "New research reveals an Italian monk may have written about seafarers’ accounts of the Americas between around 1339 and 1345  https://t.co/DPyRGgPorY",
  "data/tweet-economist/2021/9/1442898922746220547.json": "Will people return to the office like they used to? Our normalcy tracker offers some insight  https://t.co/546GoFLUWU",
  "data/tweet-economist/2021/9/1442916345088073740.json": "And what would happen if Congress failed to raise it? https://t.co/6Dk1OuWpCX",
  "data/tweet-economist/2021/9/1442920866803707904.json": "Why spaghetti bolognese doesn’t exist in Italy https://t.co/Y3La3reFhL From @1843mag",
  "data/tweet-economist/2021/9/1442912250239483904.json": "Humans are wreaking havoc on global biodiversity. How should economists think about biodiversity? https://t.co/DbNMcAfhX3",
  "data/tweet-economist/2021/9/1442931095486435330.json": "Snubbed over subs, President Emmanuel Macron is even keener to build up European autonomy https://t.co/7a26LTlXYd",
  "data/tweet-economist/2021/9/1442936172582375425.json": "There was a 15­-hour delay in publishing the result of the electronic vote. “The robot decided to have a think and a smoke,” quipped Alexei Navalny https://t.co/pUD829kNIZ",
  "data/tweet-economist/2021/9/1442937205207437312.json": "What has sparked Britain’s petrol shortage? We explain https://t.co/LWVmJ0uc7j",
  "data/tweet-economist/2021/9/1442954307934904320.json": "A new paper claims to have clarified when humans colonised the Pacific by analysing the DNA of 430 modern-day Polynesians https://t.co/LYTb1Udqxu",
  "data/tweet-economist/2021/9/1442963769768828929.json": "Brazilian officials justify its nuclear-submarine programme by pointing to a doctrine known as the “Blue Amazon” https://t.co/qw9KRXEP9x",
  "data/tweet-economist/2021/9/1442796167373496325.json": "India is the first country to approve a new type of jab to fight covid-19 https://t.co/pxvoLhYGFI",
  "data/tweet-economist/2021/9/1442937428386275335.json": "Industrial transformation and climate policy are coming after two big sources of jobs in Germany: cars and what remains of steel  https://t.co/QppvtgRN0d",
  "data/tweet-economist/2021/9/1442787438305419264.json": "What has sparked Britain’s petrol shortage? We explain https://t.co/G5kFPOk3aC",
  "data/tweet-economist/2021/9/1442990334976294914.json": "Children born in 2020 will face a two- to seven-fold increase in extreme climate-related events compared to those born in 1960, under current climate pledges https://t.co/weYqVfnEIm",
  "data/tweet-economist/2021/9/1443005232938688516.json": "Adjusting for population, the daily death rate is now about eight times higher in America than in the rest of the rich world https://t.co/BPTZgvb4mI",
  "data/tweet-economist/2021/9/1442896409540268032.json": "The gap between stock prices for a company that is listed both on the mainland and in Hong Kong has widened. Onshore investors now pay a premium of 45% https://t.co/Sl4qrF2EJw",
  "data/tweet-economist/2021/9/1443029330322468868.json": "A copy of the Cronica universalis, written by a Dominican in the early 14th century, describes the Americas as “another land, named Marckalada, where giants live”  https://t.co/nseUkNYhXU",
  "data/tweet-economist/2021/9/1442806640454086657.json": "A profound geopolitical shift is happening https://t.co/EBpi53rCBg",
  "data/tweet-economist/2021/9/1443067861472251906.json": "India is the first country to approve a new type of jab to fight covid-19 https://t.co/5k2KH7ZKBj",
  "data/tweet-economist/2021/9/1443071729652453377.json": "The film, made in 1957, depicts a roomful of jurors—all white men from various walks of life—struggling to reach a consensus in a murder case https://t.co/8dN8K0I4t3",
  "data/tweet-economist/2021/9/1443112890530242564.json": "Did the Turks really invent baklava? @1843mag has the answer https://t.co/2dL6YMjeUE",
  "data/tweet-economist/2021/9/1442942705508569091.json": "Catching up on Germany’s election results? Get up to speed with the latest data and analysis here #BTW21 https://t.co/X8rJFDtV6J",
  "data/tweet-economist/2021/9/1443163060055814146.json": "The American Film Institute recognises “12 Angry Men” as one of the 20th century’s best movies. A new book examines Reginald Rose’s masterpiece https://t.co/4gwhC5ZZMF",
  "data/tweet-economist/2021/9/1443153782070816774.json": "Why do languages die? https://t.co/DAPVwyWfql https://t.co/nSaV5XU0zG",
  "data/tweet-economist/2021/9/1443190214223142917.json": "There was no evidence to prove that anyone outside northern Europe had heard of America until Columbus’s voyage in 1492. Until now  https://t.co/ddbrXmChOR",
  "data/tweet-economist/2021/9/1443185302747631617.json": "Deaths from covid-19 over the past seven days are currently highest, per head of population, in North America. Our data team is tracking the pandemic’s march across the United States https://t.co/fYBTpYDOX0",
  "data/tweet-economist/2021/9/1443230626673577987.json": "Adjusting for population, the daily death rate is now about eight times higher in America than in the rest of the rich world https://t.co/zrhdbjXD4U",
  "data/tweet-economist/2021/9/1443239047737004040.json": "Brazil could produce weapons-grade uranium if it so chose https://t.co/oWVP3zdClv",
  "data/tweet-economist/2021/9/1442871000383717384.json": "Both Olaf Scholz, the SPD’s chancellor-candidate, and Armin Laschet of the CDU/CSU have claimed a mandate to try to form Germany's next government. \n\nGet up to speed with the latest news and analysis from the election here #BTW21 👇",
  "data/tweet-economist/2021/9/1443274404557959178.json": "The world’s official covid-19 death count is 4.8m, but our machine-learning model estimates that the true value is between 9.8m and 18.5m additional deaths https://t.co/yvSbEFmfdJ",
  "data/tweet-economist/2021/9/1443375877987962882.json": "Think you know the potato? The island of Chiloé’s boasts 286 varieties https://t.co/LIOOQFDzrM From @1843mag",
  "data/tweet-economist/2021/9/1443317678303809544.json": "Angela Merkel will be a pretty tough act to follow. She has been a rock through the pandemic and four terms of economic and political crises  https://t.co/rPsn6aMIoK",
  "data/tweet-economist/2021/9/1443385651269935110.json": "No country below the equator has ever owned or operated a nuclear-powered submarine. Brazil and Australia will now be vying to get there first https://t.co/F52j63Ui9c",
  "data/tweet-economist/2021/9/1443441991002607617.json": "What was the point of offices anyway? https://t.co/J8muESIYpS From @1843mag",
  "data/tweet-economist/2021/9/1443456419848720384.json": "In the Ottoman Empire coffee was banned by several sultans: the authorities realised that when people had had enough coffee they dared to challenge the existing order https://t.co/MceAS7DUA7 From @1843mag",
  "data/tweet-economist/2021/9/1443452358516690949.json": "People flock to gurus to seek divine assistance in every part of their lives, be it the birth of a child, a promotion at work, the purchase of a new car or to treat a disease  https://t.co/RefGks9oMP",
  "data/tweet-economist/2021/9/1443418995743416322.json": "The failure to break the link between property and the economy may be one of China’s biggest economic blunders of recent decades https://t.co/tVxVfyuwQ2",
  "data/tweet-economist/2021/9/1443381092938027009.json": "“She proved to be the only calm person in the room, the only grown-up.” Political veteran Wolfgang Nowak looks back at Angela Merkel’s 16-year leadership with @AnneMcElvoy, on “The Economist Asks” podcast  https://t.co/DgmFW13kRI",
  "data/tweet-economist/2021/9/1443461055674470401.json": "Ian Fleming didn’t live to see Bond mania reaching the heights of recent years. His letters reveal that the man with the golden typewriter also had a golden heart. From @1843mag's archive https://t.co/Vf2HXf51by",
  "data/tweet-economist/2021/9/1443533624352124933.json": "The Economist built a machine-learning model to estimate excess deaths. The true death toll of covid-19 is dramatically different from official death tallies https://t.co/huysYPlFM4",
  "data/tweet-economist/2021/9/1443566295933411332.json": "Xi Jinping’s presidency will be defined by his campaign to tame capitalism in China. Whether he can impose his new reality will shape the country’s future. One of our two covers this week https://t.co/9Zw24Xp1qe https://t.co/1Mt0QIfaVV",
  "data/tweet-economist/2021/9/1443724787801542661.json": "There was no evidence to prove that anyone outside northern Europe had heard of America until Columbus’s voyage in 1492. Until now  https://t.co/uC46pxlCwx",
  "data/tweet-economist/2021/9/1443682088520126466.json": "\"Bodies with vaginas\" and \"birthing people\" are strange ways to refer to half of humanity https://t.co/ZyCNzGDZIU",
  "data/tweet-economist/2021/9/1443667005329051650.json": "The world’s official covid-19 death count is 4.8m, but our new machine-learning model estimates that between 9.8m and 18.5m people have died https://t.co/1vYWzPhTEr",
  "data/tweet-economist/2021/9/1443701949556273153.json": "Lab-grown meat could play an essential role in staving off a climate catastrophe https://t.co/dhbvPnkOFX",
  "data/tweet-economist/2021/9/1443624038862147584.json": "Vertical farms don't have soil and crops are planted on top of each other   https://t.co/6pFPoUFX2d",
  "data/tweet-economist/2021/9/1443578812831191049.json": "London’s high-flying stockmarket has spent the past decade tumbling back to earth. Our cover in Britain this week outlines how to revive it https://t.co/fxNqKJNicM https://t.co/pPi7b3qGcD",
  "data/tweet-economist/2021/9/1443645344487776264.json": "RT @Sondreus: In this week's issue of @TheEconomist, I take a look at the latest research on greenhouse gas emissions. I find that cows are…"
}