{
  "data/tweet-economist/2021/5/1388293901568593921.json": "Latin America's economy shrank by 7% last year, more than double the average contraction around the world https://t.co/1MwRAl5Q9H",
  "data/tweet-economist/2021/5/1388282931416797186.json": "\"Only 1.8% of India has been fully vaccinated and it is anybody’s guess how long it will take to manufacture or import the roughly 2bn doses we are left wanting\" https://t.co/koJZY1BwWl",
  "data/tweet-economist/2021/5/1388312734090027019.json": "Loss of virgin forest in Indonesia and Malaysia has slowed for the fourth year in row—a contrast with other parts of the world https://t.co/gGMaf6N22o",
  "data/tweet-economist/2021/5/1388310456205561858.json": "Doctors are focusing on three possible biological explanations for long covid https://t.co/gku9iz5kj7",
  "data/tweet-economist/2021/5/1388355268870877184.json": "Thousands of people respond to endless pleas on social media for help to find a hospital bed or oxygen or simply money to pay medical bills https://t.co/rRNOgTOit4",
  "data/tweet-economist/2021/5/1388377603237687297.json": "Analysing sewage is quicker and less expensive than covid-19 test centres. Plus everyone goes to the toilet https://t.co/UGIfaIo68u",
  "data/tweet-economist/2021/5/1388297382463479808.json": "Some American analysts predict that as China grows militarily stronger, it may be tempted to invade Taiwan https://t.co/ACqJAXQnRC",
  "data/tweet-economist/2021/5/1388387997637283843.json": "Epidemiologists estimate that perhaps three-quarters of people infected with SARS-CoV-2 show no symptoms. The quality of testing regimes varies enormously across the world https://t.co/3DphbSgfuI",
  "data/tweet-economist/2021/5/1388423470032343045.json": "When the pandemic first hit “India fought a phony war and—by dumb luck—it won. Then suddenly, less than three weeks ago, our world turned upside down” https://t.co/OK4kANWyWv",
  "data/tweet-economist/2021/5/1388420936592936962.json": "\"Vaccine passports discriminate against people who have no control over the ability to get inoculated,\" argues @clarewenham in The Economist https://t.co/cVYpKhK7Xe",
  "data/tweet-economist/2021/5/1388446370839793665.json": "Research suggests long covid could be a persistent viral infection, an autoimmune disorder or a consequence of inflammation during the initial infection with SARS-CoV-2 https://t.co/jhjRVfQjAu",
  "data/tweet-economist/2021/5/1388440594792452096.json": "Taiwan is the most dangerous place on Earth. A war over the island would be a catastrophe: America and China must work harder to avoid it. Our cover this week https://t.co/3efO193Ty6\n\nSound: Mass Communication Specialist 2nd Class Joshua Scott https://t.co/GDIH3IMiew",
  "data/tweet-economist/2021/5/1388354501992669184.json": "Many Africans put their money into buildings, rather than in banks. Such investments often escape the notice of tax collectors https://t.co/XvKgPvIXYv",
  "data/tweet-economist/2021/5/1388476571418337281.json": "The fact that other firms respond to the wage policies of Amazon and Walmart suggests that these big employers have monopsony power that allows them to set local wages https://t.co/c2LdMjfI8t",
  "data/tweet-economist/2021/5/1388453484933132290.json": "Twelve hours, 250 phone calls, ten time zones: the hunt for one cylinder of oxygen in Kolkata. From @1843mag https://t.co/COryWlKIRp",
  "data/tweet-economist/2021/5/1388397996400840704.json": "Recep Tayyip Erdogan has said that Turkey's central bank had spent $165bn using its reserves to defend the lira https://t.co/FKNOLBvF6D",
  "data/tweet-economist/2021/5/1388411900095041537.json": "Chinese officials are increasingly using policies such as cash payments to encourage parents to have a second child https://t.co/Q6jvYXZNya",
  "data/tweet-economist/2021/5/1388541989109514247.json": "\"Vaccine passports are an affront to rules against discrimination,\" argues associate professor of global health policy at the London School of Economics Clare Wenham in The Economist https://t.co/np9UDka3UF",
  "data/tweet-economist/2021/5/1388574470235897859.json": "“This time young people and even children are developing symptoms, including an erstwhile quarantine-playmate of our four-year-old” https://t.co/oR8E2aTAFp",
  "data/tweet-economist/2021/5/1388596108327362562.json": "A federal court in Texas ruled that police officers who fired 17 shots, tasered and killed a mentally disabled man carrying a toy gun were protected by qualified immunity https://t.co/bSzkv5k7W5",
  "data/tweet-economist/2021/5/1388289942170841090.json": "Some countries have seen modest increases in fertility after providing cash. But more sustainable approaches involve helping women to have both a career and children https://t.co/tysH92k60d",
  "data/tweet-economist/2021/5/1388580755450867724.json": "Remarkably, after all that has happened recently, the president insisted he had “never been more confident or more optimistic about America” https://t.co/QRrclTGXgE",
  "data/tweet-economist/2021/5/1388488404292210691.json": "China’s stability and its status in Asia and the world would be jeopardised by an attack on Taiwan whose results come with lots of uncertainty attached https://t.co/BxmwaPCVBG",
  "data/tweet-economist/2021/5/1388614223471783943.json": "In January, the Danish prime minister announced a goal of having “zero asylum-seekers” in Denmark  https://t.co/0ygqRjOsZo",
  "data/tweet-economist/2021/5/1388650969131536389.json": "“Social-media feeds are an endless list of pleas on behalf of the dying” https://t.co/HVwBtxetHt",
  "data/tweet-economist/2021/5/1388584042677813250.json": "“The Light of Days” is an important addition to the Holocaust canon—and to the understanding of the response of eastern Europe’s Jewish communities to the Nazi extermination https://t.co/up7XiKEQ7D",
  "data/tweet-economist/2021/5/1388680224691441671.json": "Orhan Pamuk set his new novel in the early 1900s, amid an outbreak of bubonic plague. Just as he began to wrap it up, covid­-19 hit Turkey https://t.co/ZKDdHBFuT4",
  "data/tweet-economist/2021/5/1388659343839608841.json": "France’s health system is fragmented, with no vaccine booking booking. A young engineer resolved this, crowdsourcing help to refine the algorithm and design   https://t.co/nm4o87SAPC",
  "data/tweet-economist/2021/5/1388668523145203712.json": "Employers must rethink how to cope with workers who have a disability that ﬂares up in unpredictable bouts https://t.co/5o9lPpwIRY",
  "data/tweet-economist/2021/5/1388688715242000390.json": "The LEAF Coalition has pledged $1bn to reward countries for protecting forests. South-East Asia could be a big beneficiary https://t.co/g05xc61uTS",
  "data/tweet-economist/2021/5/1388717720020135938.json": "India's government is flailing in the face of the country's deadly second wave of covid-19. Its inaction has spurred citizens across India to help https://t.co/xXSsv1IHsp",
  "data/tweet-economist/2021/5/1388722687330197505.json": "South Korea's economy has already regained its pre-pandemic size. That is mainly down to exports, which are dominated by semiconductors https://t.co/J5JNsd16NE",
  "data/tweet-economist/2021/5/1388713518443139073.json": "For over a year, Denmark has been trying to send people back to Syria. It says it will only send back those who hail from in or around Damascus, the Syrian capital, which they claim is safe  https://t.co/tKhFD6LfLE",
  "data/tweet-economist/2021/5/1388628305012793347.json": "It is hoped wastewater analysis will expand to include not just coronavirus but everything from the next potential pandemic to antimicrobial resistance https://t.co/DWnMSC2Ceu",
  "data/tweet-economist/2021/5/1388641513027121155.json": "LaDonna Brave Bull Allard managed to unite the seven bands of the Sioux together the first time in 140 years   https://t.co/T0eL4UojvZ",
  "data/tweet-economist/2021/5/1388763644280848384.json": "“We are amid an ocean of human suffering but cannot see it.” Our correspondent’s diary about life in India  https://t.co/XPCBmOyjtF",
  "data/tweet-economist/2021/5/1388731212890615809.json": "Some of the world’s strictest border controls have generally held the virus at bay https://t.co/w8SeG7cLcD",
  "data/tweet-economist/2021/5/1388765467695796224.json": "Deaths over the past seven days are currently highest, per head of population, in South America, although they are rising fastest in South Asia https://t.co/8LpmClvDSk",
  "data/tweet-economist/2021/5/1388744249869586432.json": "Army pay in China starts at $108 per month, compared with $1,733 in America https://t.co/yQ1k8KypKe",
  "data/tweet-economist/2021/5/1388785314844577793.json": "China’s working-age population, defined as those between 15 and 59 years old, has been falling since 2011 https://t.co/Hslv17XuQb",
  "data/tweet-economist/2021/5/1388735282627977217.json": "If they are to ensure that war remains too much of a gamble for China, America and Taiwan need to think ahead https://t.co/qi8uBv5EMl",
  "data/tweet-economist/2021/5/1388820924879839232.json": "In no country in Europe was the church as powerful for many centuries as it was in Spain https://t.co/qJSSYYxMc5",
  "data/tweet-economist/2021/5/1388810777751166977.json": "China must be deterred from trying to change Taiwan’s status by force at the same time as it is reassured that America will not support a dash for formal independence by Taiwan https://t.co/Mi1AU4YKjb",
  "data/tweet-economist/2021/5/1388645882304794626.json": "Twelve hours, 250 phone calls, ten time zones: the hunt for one cylinder of oxygen in Kolkata. From @1843mag https://t.co/jEkAjDCuXC",
  "data/tweet-economist/2021/5/1388540984930230279.json": "Voters who live near the Scottish border are likely to back the Conservatives at next week's elections. Many in the region oppose independence  https://t.co/QQus1wSkVA",
  "data/tweet-economist/2021/5/1388852795114131461.json": "Franklin Roosevelt set the standard for what a new president can do in 100 days. On our “Checks and Balance” podcast: how does Joe Biden measure up to his hero? https://t.co/aRH5Y7LFRz",
  "data/tweet-economist/2021/5/1388845997212700676.json": "With movement restricted once again, and vaccination happening slowly, 2021 is shaping up to be another difficult year for Latin America https://t.co/0lFgmP5W7L",
  "data/tweet-economist/2021/5/1388863369650786305.json": "He branded Putin “Vladimir the Poisoner of Underpants”. @1843mag looks at the career of Alexei Navalny, the self-made politician who defied the Kremlin   https://t.co/5lfqZGC9jD",
  "data/tweet-economist/2021/5/1388726932917952513.json": "Since coming to power, Law and Justice has tightened its hold on Poland’s institutions. In October it ruled that women could no longer cite severe fetal defects as a reason for an abortion   https://t.co/UNjqnWFUZw",
  "data/tweet-economist/2021/5/1388841232521207810.json": "A portrait of FDR hangs opposite Joe Biden’s desk in the Oval Office. Can the new president live up to his hero? On our “Checks and Balance” podcast, our editors consider his first 100 days https://t.co/0vGLy0lW4m https://t.co/ag2UokPLX2",
  "data/tweet-economist/2021/5/1388907549269938177.json": "Twenty years ago, only Vermont allowed people to carry handguns without a permit. By the end of this year, at least 20 American states will   https://t.co/2FtDutrZMZ",
  "data/tweet-economist/2021/5/1388884501699432452.json": "Post-viral syndromes on this scale affect not only those who are experiencing them directly. They also have serious consequences for everyone else https://t.co/TJi0vrW2HW",
  "data/tweet-economist/2021/5/1388912059367268357.json": "Human Rights Watch, an NGO, says that Syrians who are deported from Denmark back to Syria are likely to be locked up or tortured  https://t.co/IB22EfFEMe",
  "data/tweet-economist/2021/5/1388923764876906498.json": "After a record surge in covid cases, the Turkish government has said it would ban the sale of alcohol during the 18 day lockdown that began on April 29th  https://t.co/F4EP5G8qX8",
  "data/tweet-economist/2021/5/1388951193091719168.json": "Venezuela is ill-prepared for the pandemic. In 2019 fully 70% of public hospitals did not have reliable running water https://t.co/eHExk6Poq9",
  "data/tweet-economist/2021/5/1388931559701504000.json": "China’s visible capabilities and veiled intent are deeply perturbing. War may not be round the corner. But nor, shockingly, is it unthinkable https://t.co/IbkuKNkqss",
  "data/tweet-economist/2021/5/1388921989058994176.json": "With its reserves eroded, Turkey's central bank might not be able to defend the lira for much longer https://t.co/VNQnf74WlH",
  "data/tweet-economist/2021/5/1388976626164187138.json": "Alexei Navalny displays the extraordinary bravery of an ordinary man. Read about the making of Russia’s political prisoner number one    https://t.co/kARPRTN8nI",
  "data/tweet-economist/2021/5/1388977603722219521.json": "\"Vaccine certificates are needed so everyone’s full participation in society can be restored,\" argues @ashishkjha in The Economist https://t.co/uDz4MUR7qp",
  "data/tweet-economist/2021/5/1388979376868544519.json": "America spent $778bn on defence in 2020, which was 39% of the global total and more than the rest of the top ten countries put together https://t.co/GmrYYFPY5r",
  "data/tweet-economist/2021/5/1389022157569658880.json": "171 countries have mass-vaccination programmes underway, and about 1.1bn doses have been administered so far. Our global covid-19 data tracker is updated around the clock with the latest figures https://t.co/sioJhhsTJI",
  "data/tweet-economist/2021/5/1389020976441135108.json": "Across America, states are trying to make it easier for people to carry their guns with them in public without applying for a permit, a background check or going through training    https://t.co/gLnJ1b1FET",
  "data/tweet-economist/2021/5/1388991722059874317.json": "Critics of President Recep Tayyip Erdogan have fumed, accusing Mr Erdogan of using a health crisis to impose part of his Islamist agenda\nhttps://t.co/FwmYSNIZAa",
  "data/tweet-economist/2021/5/1389059538712735746.json": "A local bureaucrat in a remote rural district poured his meagre resources into preparing for a second wave. Had such efforts been replicated across India, they would have saved tens of thousands of lives https://t.co/SFmzaFnqBv",
  "data/tweet-economist/2021/5/1389095511911698435.json": "He survived poisoning. Then he was imprisoned, deprived of sleep and denied urgent medical care. Still Navalny remains Vladimir Putin's most persistent opponent\nhttps://t.co/9VdPS7tYN1",
  "data/tweet-economist/2021/5/1389078876417056771.json": "There are indications that China's total fertility rate has dropped faster and further than previously thought https://t.co/tSXheND9Z7",
  "data/tweet-economist/2021/5/1389083687854166016.json": "Henry Mance’s lively first book argues for a profound reassessment of humans’ relationships with other species https://t.co/kakeP8I7v5",
  "data/tweet-economist/2021/5/1389136088669769728.json": "Most of the 6.6m refugees from Syria are in Jordan, Lebanon and Turkey. If Denmark will not accept these people, poorer countries may ask why they should   https://t.co/CIaM5BnwPm",
  "data/tweet-economist/2021/5/1389156144338321408.json": "Though Vladimir Putin controls the courts, security services and the repressive machinery of the state, Alexei Navalny controls the narrative. From @1843mag \nhttps://t.co/uoleMpksVK",
  "data/tweet-economist/2021/5/1389116499365859330.json": "Even when the pandemic of acute covid-19 has been dealt with, a big problem will remain https://t.co/c8ojqwC0Vd",
  "data/tweet-economist/2021/5/1389162177949483008.json": "If an independent Scotland were to rejoin the EU, it would mean border controls and goods checks at the border between England and Scotland https://t.co/UXpKh9tasd",
  "data/tweet-economist/2021/5/1389203093942939648.json": "Focused obsessively on its campaign, the BJP failed to pay attention as India’s second wave of covid-19 grew from a swell into a tidal wave https://t.co/kh8RUpZhnf",
  "data/tweet-economist/2021/5/1389006969344860163.json": "A bipartisan array of judges and policymakers have decided that qualified immunity has metastasised beyond reason https://t.co/KNeYic4SRl",
  "data/tweet-economist/2021/5/1389294351881228289.json": "“This time young people and even children are developing symptoms, including an erstwhile quarantine-playmate of our four-year-old” https://t.co/KntYA3Uwql",
  "data/tweet-economist/2021/5/1389349815943827457.json": "Legally, China’s digital currency, known as eCNY, would be as real as hard cash https://t.co/WSERMU8Dg3",
  "data/tweet-economist/2021/5/1389421287622205442.json": "Narendra Modi's apparent lack of interest in the mounting body-count from the pandemic has shaken India's confidence in his leadership https://t.co/Ix4e6WpOrM",
  "data/tweet-economist/2021/5/1389438523015680000.json": "The number of covid cases in India has surpassed 400,000 with hardly a sign of slowing https://t.co/40EAuAqk9W",
  "data/tweet-economist/2021/5/1389456657151836163.json": "A teacher who drove for 24-hours to deliver oxygen; a couple who sold their jewellery to pay for oxygen cylinders. Across India, ordinary people are doing what the government hasn’t https://t.co/KxsLuIJrbI",
  "data/tweet-economist/2021/5/1389443041874874372.json": "In an age of animal-lovers, many creatures are suffering https://t.co/lAN5HaEVgv",
  "data/tweet-economist/2021/5/1389472696967258114.json": "Iván Duque’s tax reform was sorely needed. His government needs more revenue https://t.co/Pnlr5wL6Rk",
  "data/tweet-economist/2021/5/1389485382442569728.json": "Joe Biden was a boring candidate. He now draws comparisons to FDR https://t.co/hod24gR4PH",
  "data/tweet-economist/2021/5/1389494622330703874.json": "It was in West Bengal where Narendra Modi suffered the greatest humiliation. He had hosted 20 giant rallies across the state, but his party captured just 77 seats https://t.co/2U7CMz4zpk",
  "data/tweet-economist/2021/5/1389554414688612352.json": "Even though the tax increases would hit Colombia's wealthiest hardest, many feel that it is not the right time to raise taxes https://t.co/Ua13Ylwvzg",
  "data/tweet-economist/2021/5/1389271427333992457.json": "Formally, the condition is called “post-covid syndrome”. But even the official definition of its symptoms is fluid, because knowledge of its details is still evolving https://t.co/IWnSff2b8N",
  "data/tweet-economist/2021/5/1389577069596708864.json": "Some of India’s most populous states, such as Gujarat and Uttar Pradesh, are almost certainly underestimating covid deaths  https://t.co/NpXG3Ygybq",
  "data/tweet-economist/2021/5/1389631887245815809.json": "Depression’s diagnosis depends on a doctor's assessment, and can be subjective. This has led to a search for reliable biochemical markers of the illness https://t.co/ZeImnOdg36",
  "data/tweet-economist/2021/5/1389641091843035141.json": "Magic mushrooms may have therapeutic uses for treating mental illness—from addiction to depression. Here’s why psychedelics should be decriminalised https://t.co/B4Vv0oT4pi https://t.co/O89aKuv0jC",
  "data/tweet-economist/2021/5/1389667416964227078.json": "The bill was not the protesters’ only grievance. Colombians are frustrated, particularly with Iván Duque https://t.co/GlqNTDZyJF",
  "data/tweet-economist/2021/5/1389667657423728641.json": "New cases in India have surpassed 400,000—the highest caseload yet. Even that is sure to be an underestimate https://t.co/x6kI3wlTGr",
  "data/tweet-economist/2021/5/1389677217815400463.json": "He survived poisoning. Then he was imprisoned, deprived of sleep and denied urgent medical care. Still Navalny remains Vladimir Putin's most persistent opponent\nhttps://t.co/6Ecwlj4fBq",
  "data/tweet-economist/2021/5/1389464642209173504.json": "A poll found that 71% of Aussies want to keep the international border closed until the “public health crisis has passed”. That suggests they will be cut off for some time. https://t.co/T3hd0q115c",
  "data/tweet-economist/2021/5/1389758018636730370.json": "Iván Duque is weak politically—unlike his predecessors, he does not have a stable majority coalition in Congress https://t.co/FrO3tGwxdr",
  "data/tweet-economist/2021/5/1389749488894550018.json": "Alexei Navalny displays the extraordinary bravery of an ordinary man. Read about the making of Russia’s political prisoner number one    https://t.co/fT8DDcM1dH",
  "data/tweet-economist/2021/5/1389788800788963329.json": "What has shocked millions of Indians, including much of his own base, is Narendra Modi’s deafness to widespread suffering https://t.co/NFuKJI3O7w",
  "data/tweet-economist/2021/5/1389797262763696128.json": "The stories of Jewish women in the ghettos, half-buried for so long, are superbly told in a gripping, haunting book https://t.co/Es3B74SW5T",
  "data/tweet-economist/2021/5/1389793197661040640.json": "Biryani was supposedly invented during the 17th century, when India was part of the Mughal empire. From @1843mag\n https://t.co/Tkx5JK2eOv",
  "data/tweet-economist/2021/5/1389735586483818498.json": "China is the world’s leader in mobile payments, processing about $67trn-worth of transactions last year https://t.co/wHcjkS5BFl",
  "data/tweet-economist/2021/5/1389784574239154180.json": "America spent $778bn on defence in 2020, which was 39% of the global total and more than the rest of the top ten countries put together https://t.co/4xO3pQfDBJ",
  "data/tweet-economist/2021/5/1389430379795341312.json": "Turkey and Armenia show no signs of reconciling https://t.co/sDEoRs4gAY",
  "data/tweet-economist/2021/5/1389902353680191490.json": "A wave of  “long covid” is emerging in countries where acute cases of covid-19 have been falling. Even when the pandemic is over, it will remain a big problem. Thread 👇 https://t.co/kaSBbWcVUO",
  "data/tweet-economist/2021/5/1389922488184983555.json": "Narendra Modi's carefully cultivated reputation for dynamism, patriotism and compassion for the little man has been shredded https://t.co/MIuQlOhlvX",
  "data/tweet-economist/2021/5/1389942971685089293.json": "Two hundred years after the death of Napoleon, France is still unsure whether to remember him as a strategic mastermind or as a tyrant  https://t.co/0QXWfChjJ3",
  "data/tweet-economist/2021/5/1389942221898670081.json": "Together, 13 RNA markers form the basis of a blood test that can diagnose depression and predict who will go on to develop bipolar disorder https://t.co/qyfWliXKQE",
  "data/tweet-economist/2021/5/1389948361567051784.json": "South Asia is recording four times as many covid-19 cases today as it was at the peak of the first wave https://t.co/ggZFdl1C6P https://t.co/FeqGkbA9ln",
  "data/tweet-economist/2021/5/1389985266639777792.json": "Remains of an infant Homo sapiens nicknamed Mtoto are 78,000 years old, making them the most ancient human burial yet unearthed in Africa https://t.co/S8syxQQ708",
  "data/tweet-economist/2021/5/1390005636285468674.json": "What has shocked millions of Indians, including much of his own base, is Narendra Modi’s deafness to widespread suffering https://t.co/oR2ROME2cr",
  "data/tweet-economist/2021/5/1390003751491153920.json": "Russia now has one of the world’s largest excess-mortality gaps. It recorded about 460,000 more deaths than expected between April 2020 and February 2021, compared with an official covid-19 toll of only 85,000 https://t.co/CHhCYTU42B",
  "data/tweet-economist/2021/5/1390025029463777280.json": "He survived poisoning. Then he was imprisoned, deprived of sleep and denied urgent medical care. Still Navalny remains Vladimir Putin's most persistent opponent\nhttps://t.co/Z8gcQ1F3ja",
  "data/tweet-economist/2021/5/1390009421800030208.json": "The reunification of Ireland has never looked closer, and Scottish nationalists have exploited Scots' dislike of Brexit. In \"getting Brexit done\", Boris Johnson has endangered his country https://t.co/GpZgZFwgqi",
  "data/tweet-economist/2021/5/1390066609331523585.json": "A new malaria vaccine is the first time one has met the 75% efficacy threshold set by the WHO https://t.co/L86sUHr6Eu",
  "data/tweet-economist/2021/5/1390051198317867014.json": "Doctors are focusing on three possible biological explanations for long covid https://t.co/dOdNs7bOM3",
  "data/tweet-economist/2021/5/1390142538238070784.json": "Rich countries have focused on vaccinating their own populations, leaving poorer ones scrambling to procure covid-19 vaccines or develop their own https://t.co/ktDiwd2rZE",
  "data/tweet-economist/2021/5/1390160197948264449.json": "What has shocked millions of Indians, including much of his own base, is Narendra Modi’s deafness to widespread suffering https://t.co/RL8O9UY9AR",
  "data/tweet-economist/2021/5/1390174634633572354.json": "Doctors are focusing on three possible biological explanations for long covid https://t.co/Q7JHwGsKqm",
  "data/tweet-economist/2021/5/1390165103404802048.json": "Scotland's quest for independence may have ended in 2014, were it not for Brexit. Around 65% of Scots still want to rejoin the EU https://t.co/3zhVoag8TU",
  "data/tweet-economist/2021/5/1390200852464472067.json": "A new malaria vaccine is the first time one has met the 75% efficacy threshold set by the WHO https://t.co/e6QiJZVB6a",
  "data/tweet-economist/2021/5/1390096622562983937.json": "The costs of long covid are yet to be tallied, but they will be huge https://t.co/mxF0CpDd9I",
  "data/tweet-economist/2021/5/1390242012528615426.json": "There is a strong moral case for vaccinating the world’s poor. But it is also in rich countries’ own interest https://t.co/OPCI9m5j1x",
  "data/tweet-economist/2021/5/1390246201841184771.json": "Canada approved a covid-19 vaccine for use in children aged 12-15. In March we explained why the sooner children get a vaccine, the greater the chances of taming the virus https://t.co/xo72dFwOGY",
  "data/tweet-economist/2021/5/1390151576808009731.json": "For the first time since the pandemic began, Americans are split on whether the economy is on the rise or in decline https://t.co/6rXex12asg",
  "data/tweet-economist/2021/5/1390282290723500033.json": "Government-run virtual currencies are coming. They are a giant risk—but one that is worth taking. Our cover this week https://t.co/bTElwwS23o https://t.co/eMZIbVW2Nd",
  "data/tweet-economist/2021/5/1390264591956029443.json": "\"Monopoly control over critical public-health technologies cannot be justified in a global emergency,\" argue Mariana Mazzucato, Jayati Ghosh and Els Torreele in The Economist https://t.co/7BSUol6FjH",
  "data/tweet-economist/2021/5/1390328328897323012.json": "Somaliland has become a functioning state in all but name https://t.co/o9gQXmPIUm",
  "data/tweet-economist/2021/5/1390375106090881028.json": "\"Govcoins\" are a new incarnation of money. They are to be treated with optimism, and humility https://t.co/HjLU7h9ZtP",
  "data/tweet-economist/2021/5/1390422894870736900.json": "A researcher at the University of California uncovered documents from 1967 showing that sugar companies secretly funded studies at Harvard University designed to blame fat – not sugar – for the growing obesity epidemic https://t.co/mJOkTzu6Ul",
  "data/tweet-economist/2021/5/1390418106842066945.json": "About 29% of adults worldwide said they would refuse a free vaccine if it were available to them  https://t.co/LpLqHoAAiA",
  "data/tweet-economist/2021/5/1390464915601756160.json": "Central-bank digital currencies may threat­en the traditional banking system https://t.co/j7wqSGknWX",
  "data/tweet-economist/2021/5/1390461626269249538.json": "In the eyes of the world, Somaliland remains part of Somalia. But in 2001, 97% of its people supported independence in a referendum  https://t.co/Uji6yNH1OK",
  "data/tweet-economist/2021/5/1390395983796834308.json": "We deleted an earlier tweet linked to an article published with the wrong picture. Apologies. Here is that article with the updated photo \n https://t.co/haOAFSTUXX",
  "data/tweet-economist/2021/5/1390543849278296065.json": "Governments and financial firms need to prepare for a long-term shift in how money works, as momentous as the leap to metallic coins or payment cards https://t.co/fOdNUE4xWu",
  "data/tweet-economist/2021/5/1390519751277953025.json": "More than 90% of China's cosmetic-surgery patients are under 35, and 85% are female https://t.co/1eNXb4st2S",
  "data/tweet-economist/2021/5/1390339400324853763.json": "Dominic Ongwen, a member of a rebel group that conscripted child soldiers, has been sentenced to 25 years in prison. Yet such convictions by the ICC are sparse—here's why https://t.co/wjFJe6SjwG",
  "data/tweet-economist/2021/5/1390370289318518786.json": "\"Monopoly control over critical public-health technologies cannot be justified in a global emergency,\" argue Mariana Mazzucato, Jayati Ghosh and Els Torreele in The Economist https://t.co/ewVVtvOfYm",
  "data/tweet-economist/2021/5/1390574669875535875.json": "Central bankers worry that digital payments may bring about the end of cash https://t.co/DMqLPHSk7a",
  "data/tweet-economist/2021/5/1390567554226270208.json": "After 30 years of running itself, Somaliland deserves international recognition  https://t.co/VzspMM53cY",
  "data/tweet-economist/2021/5/1390444786671398919.json": "Technological change is upending finance. Government or central-bank digital currencies are the next step—but they come with a twist https://t.co/u07ZBOfBGC",
  "data/tweet-economist/2021/5/1390656963130834944.json": "RT @_rospearce: The eastern sides of English cities tend to be poorer. This pattern can be traced back to the Industrial Revolution, when w…",
  "data/tweet-economist/2021/5/1390649637292412929.json": "Financial decisions are no longer the preserve of men alone. Women control about a third of household wealth in America, and the share is likely to rise https://t.co/guqj6ps7F5",
  "data/tweet-economist/2021/5/1390648633410871299.json": "The political fallout of the Mexico City metro accident could affect the mayor and foreign minister—both seen as potential successors to President Andrés Manuel López Obrador https://t.co/MxcVYWiaN4",
  "data/tweet-economist/2021/5/1390584943085068289.json": "Somaliland has been largely peaceful. Unlike Somalia, it controls its borders and its territory, and periodically votes for its president and lawmakers https://t.co/TdYkEycPH2",
  "data/tweet-economist/2021/5/1390637808352628736.json": "This month Somalilanders will mark 30 years of peace. The country of 4.5m people is winning friends abroad. But its sovereignty remains unrecognised https://t.co/YfEqlkzp4Z",
  "data/tweet-economist/2021/5/1390582393317253120.json": "Nobody likes banks. Their technology is often primitive. Their users are hit with unpredictable fees. Their functions matter, yet their coverage is incomplete  https://t.co/oDtyEGPgBw",
  "data/tweet-economist/2021/5/1390400478635339778.json": "A proposal to waive intellectual property on covid-19 vaccines \"undermines the very system that produced the life-saving science in the first place\", argues Michelle McMurry-Heath in The Economist https://t.co/fggtL9jOom",
  "data/tweet-economist/2021/5/1390778747549372419.json": "What percentage of the adult population is willing to get the jab?\n\nNorth America: 59%\nEurope: 53%\nAfrica: 64%\nLatin America: 68%\nAsia: 76%  https://t.co/pZzLN5O2uF",
  "data/tweet-economist/2021/5/1390843416477642754.json": "Govcoins could make finance accessible for the 1.7bn people who lack bank accounts https://t.co/45nihiJWud",
  "data/tweet-economist/2021/5/1390872898164908034.json": "Americans who make less than $20,000 a year spend around 46 minutes a day waiting for basic services like child care, health care and groceries https://t.co/DuyU2RxNkq",
  "data/tweet-economist/2021/5/1390889964305633281.json": "Bangladesh, which sits within the world's largest river delta, has no shortage of water. Yet hardly any of it is drinkable https://t.co/WChleghPx6",
  "data/tweet-economist/2021/5/1390849210904465421.json": "Foreign workers in Qatar can now quit their jobs and find new ones without risk of deportation https://t.co/TrEtYjm7Hc",
  "data/tweet-economist/2021/5/1390919651002040325.json": "Let the machines do the dull and repetitive tasks that make up all, or part, of many people's jobs. It will open the way for creativity https://t.co/8qv2r949wa",
  "data/tweet-economist/2021/5/1390936609261072388.json": "India's catastrophic second wave has forced Narendra Modi’s government into embarrassing policy reversals https://t.co/Ootyqq5rse",
  "data/tweet-economist/2021/5/1390974776810905603.json": "India's Supreme Court has told the government to \"look to Mumbai and take note\" of its successes in managing oxygen supplies https://t.co/2Wg0wFnbC9",
  "data/tweet-economist/2021/5/1391011199081459712.json": "Americans who make less than $20,000 a year spend almost 12 minutes more a day waiting than those earning over $150,000  https://t.co/ygCXPpdg2W",
  "data/tweet-economist/2021/5/1390992532306374665.json": "Govcoins promise a free, safe, instant, universal means of payment. But there are dangers https://t.co/8YjWnaLeTV",
  "data/tweet-economist/2021/5/1390692425241333762.json": "State digital currencies are the next great experiment in finance. They are a giant risk—but one that is worth taking https://t.co/g8ZHAPbjNh",
  "data/tweet-economist/2021/5/1390910290590670849.json": "Nobody conceived that a share price might reach the heights that Berkshire Hathaway’s has https://t.co/EnxthxRDOw",
  "data/tweet-economist/2021/5/1391085014859800582.json": "\"Govcoins\" are the least-noticed disruption on the frontier between technology and finance. But they may end up as the most revolutionary https://t.co/d3196AwIWe",
  "data/tweet-economist/2021/5/1390973270556647425.json": "As bank margins are compressed, their capital is often eroded, which can hinder banks' ability to lend https://t.co/NzROqgOMta",
  "data/tweet-economist/2021/5/1391141372363788288.json": "Low-income neighbourhoods often have fewer shops and medical centres, with fewer staff on hand and crowds at their doors https://t.co/3867yFdRQw",
  "data/tweet-economist/2021/5/1391213115816173574.json": "The public, overwhelmed with anguish at death on so vast a scale, has been flabbergasted by repeated revelations of the government's incompetence https://t.co/DzgdCxHBYb",
  "data/tweet-economist/2021/5/1391154976035065856.json": "The SNP had promised a second referendum on independence before the end of 2023. But a long and gruelling stalemate is more likely https://t.co/ECsLyFZnZv",
  "data/tweet-economist/2021/5/1391248735510859783.json": "China has spent hundreds of millions of dollars annually over the past decade to expand a \"Great Foreign Propaganda Campaign\" https://t.co/W560PrQYK2",
  "data/tweet-economist/2021/5/1391270158992384003.json": "\"Govcoins\" are a new incarnation of money. They are to be treated with optimism, and humility https://t.co/o6zLBVYNyG",
  "data/tweet-economist/2021/5/1391265067077935104.json": "Nicola Sturgeon insists that the election result is a mandate for an independence referendum. Polls suggest only around a third of Scots agree https://t.co/9eGSa66M10",
  "data/tweet-economist/2021/5/1391274222098522112.json": "Elections will prove the real test for Narendra Modi and the BJP. That the party was hammered in West Bengal's elections is not a good omen https://t.co/bLjeCKrEHS",
  "data/tweet-economist/2021/5/1391192482940133377.json": "Backers of permitless carry call it “constitutional carry” to make it seem legitimate and to give it a pedigree. Do not be fooled https://t.co/tS2dD12PSy",
  "data/tweet-economist/2021/5/1391347248903172096.json": "Government-run virtual currencies are coming. They are a giant risk—but one that is worth taking. Our cover this week https://t.co/FVQorblQR4 https://t.co/LEvUI9fHwe",
  "data/tweet-economist/2021/5/1391358298000183299.json": "A teacher who drove for 24-hours to deliver oxygen; a couple who sold their jewellery to pay for oxygen cylinders. Across India, ordinary people are doing what the government hasn’t https://t.co/zjELzdKjaO",
  "data/tweet-economist/2021/5/1391373900735467525.json": "“My wife, our two little boys and I are staying put in our nice flat, in a leafy “colony” near the centre of Delhi. Our new rule is strict: we do not go outside for any reason”  https://t.co/L2UQ6lRct0",
  "data/tweet-economist/2021/5/1391389503995224065.json": "From challenges of inequality to problems in the commercial supply chain, oxygen scarcity in hospitals is costing lives https://t.co/J0wBWdK8Jd",
  "data/tweet-economist/2021/5/1391223437910237184.json": "Even where water can be cleaned cheaply in Bangladesh, middlemen end up as distributors, pushing prices up by as much as 250% https://t.co/jXrRqd8rQb",
  "data/tweet-economist/2021/5/1391403338617573376.json": "India's catastrophic second wave has forced Narendra Modi’s government into embarrassing policy reversals https://t.co/cu8eQj1gan",
  "data/tweet-economist/2021/5/1391432547482095618.json": "Technological change is upending finance. Government or central-bank digital currencies are the next step—but they come with a twist https://t.co/shk2MrCDYm",
  "data/tweet-economist/2021/5/1391403602003079170.json": "Some of India’s most populous states, such as Gujarat and Uttar Pradesh, are almost certainly underestimating covid deaths  https://t.co/gQn28UIZRV",
  "data/tweet-economist/2021/5/1391375029078745090.json": "Long-haul air travel will take the longest to rebound; business travel may never fully recover. This will hurt legacy airlines https://t.co/9xXbi1wtxf",
  "data/tweet-economist/2021/5/1391228668614266882.json": "Cutting interest rates is supposed to stimulate lending, not curtail it https://t.co/Dbs8qoakPD",
  "data/tweet-economist/2021/5/1391332384830787585.json": "So long as it is unrecognised, it is hard for Somaliland's government to get aid and loans, and for businesses to sell things abroad https://t.co/ge32DzJIOv",
  "data/tweet-economist/2021/5/1391465268921184256.json": "Covid-19 could enable large-scale migration from high-cost cities to low-cost ones https://t.co/4sAjSMWJHY",
  "data/tweet-economist/2021/5/1391468286576144388.json": "Soon Somaliland will have spent longer as a de facto independent country than it did as part of a united Somalia https://t.co/p27IP2boxY",
  "data/tweet-economist/2021/5/1391475332516024322.json": "Liz Cheney may eventually emerge as a rallying figure for other Republicans ready to resist Donald Trump, if any should appear some day https://t.co/kxvwi9q12A",
  "data/tweet-economist/2021/5/1391480361511759881.json": "The main beneficiary of the French working-class vote is Marine Le Pen’s far-right party: 48% of blue-collar workers told a poll they would back her next year https://t.co/jvPhhQLcYg",
  "data/tweet-economist/2021/5/1391179049603641345.json": "When investors called Buffett-style governance “unique” they used to mean it as a compliment. No longer https://t.co/2DEOg7wi1u",
  "data/tweet-economist/2021/5/1391503763937107968.json": "America’s poor have to wait longer for basic services https://t.co/KwzIQ2cznv",
  "data/tweet-economist/2021/5/1391525409234243587.json": "Australia's defence secretary has warned that a war over Taiwan could not be discounted, and that Australia must defend its waters https://t.co/EYQtgsYyNy",
  "data/tweet-economist/2021/5/1391523134038331397.json": "Governments and financial firms need to prepare for a long-term shift in how money works, as momentous as the leap to metallic coins or payment cards https://t.co/BA3TYajIHJ",
  "data/tweet-economist/2021/5/1391444373720678403.json": "Body donation to medical schools in Britain paused during the pandemic since it was thought that bodies could be infectious https://t.co/XaCUTCcYZm",
  "data/tweet-economist/2021/5/1391544652181000192.json": "A Republican-backed effort to audit a vote in Arizona’s largest county (despite previous audits confirming Joe Biden’s victory) is taking on a whiff of desperation, if not lunacy https://t.co/QZWDm4obfG",
  "data/tweet-economist/2021/5/1391486396423151617.json": "Twitter is trying to beat Substack and Clubhouse at their own game. Soon users will be able to sign up for a newsletter or join an audio room directly from the platform https://t.co/lWw2kYTpbW",
  "data/tweet-economist/2021/5/1391561577573257218.json": "Interest rates have been below zero in Japan and Europe for half a decade. This can cause difficulties for bankers https://t.co/kVLwJLZMex",
  "data/tweet-economist/2021/5/1391557317913681921.json": "SpaceX’s “Starlink” satellite network might aim to capture around 3% of the worldwide internet-access market, worth perhaps $1trn a year https://t.co/gvnGlKv3HP",
  "data/tweet-economist/2021/5/1391301958481350656.json": "If Scotland were to gain independence, could it pave the way for Wales and Northern Ireland to do the same? \nhttps://t.co/2IaDiGQQLH",
  "data/tweet-economist/2021/5/1391599254532153347.json": "Half of all water­ treatment projects, whether set up by the government or an NGO, fail because of limited funding https://t.co/KOTuDM2S9T",
  "data/tweet-economist/2021/5/1391594470857187331.json": "About 40% of Mumbai’s hospital beds are in “jumbo” ﬁeld hospitals built during the ﬁrst wave and wisely kept in a state of readiness after it subsided  https://t.co/QKoFC0p0ne",
  "data/tweet-economist/2021/5/1391613863351758849.json": "State digital currencies are the next great experiment in finance. They are a giant risk—but one that is worth taking https://t.co/pwXMmOl9b3",
  "data/tweet-economist/2021/5/1391617880077316099.json": "A war between China and Australia is not imminent. So, why is the Australian government's line so aggressive? https://t.co/HJnxxA0rf9",
  "data/tweet-economist/2021/5/1391565635751190534.json": "Like Tesla, SpaceX has taken an unloved technology and made drastic improvements, shaking up a complacent industry https://t.co/YvdhJg4hZC",
  "data/tweet-economist/2021/5/1391502253966700551.json": "To pay for its Martian ambitions, SpaceX plans to transform itself into a globe-straddling telecoms giant https://t.co/f3QO99LCoj",
  "data/tweet-economist/2021/5/1391664077114650625.json": "SpaceX’s “Starlink” is building the biggest satellite network ever in order to provide fast internet access worldwide https://t.co/cGoCCbuZlj",
  "data/tweet-economist/2021/5/1391717429819084802.json": "The Republicans’ intolerance for Liz Cheney’s dissent undercuts the party’s claims to disdain cancel culture. Some attacks have been downright sexist https://t.co/oes2enu6d7",
  "data/tweet-economist/2021/5/1391392781269094400.json": "Somalia should be encouraged to grant Somaliland a divorce, with promises of aid and debt relief  https://t.co/P2LY3Ppn12",
  "data/tweet-economist/2021/5/1391585185083367424.json": "For our correspondent in Delhi, “peace of mind is a distant memory” as covid-19 continues to spread rapidly   https://t.co/ebDdcMEVVD",
  "data/tweet-economist/2021/5/1391734285216980998.json": "America is the world leader in gun-ownership, and has a rate of violent gun-deaths perhaps 100 times higher than in Britain. Arguing for permitless carry would drive it further towards an extreme https://t.co/ND1tRsIkgh",
  "data/tweet-economist/2021/5/1391453178386845703.json": "Poor countries, such as India, show that it is possible to make vaccines almost anywhere https://t.co/lAA3E0683h",
  "data/tweet-economist/2021/5/1391838732840538112.json": "Pandora recently became the first big jeweller to announce that it will no longer sell mined diamonds https://t.co/7IZNHjWSbz",
  "data/tweet-economist/2021/5/1391857589370118158.json": "KAL’s cartoon https://t.co/Owe9VOhHlp",
  "data/tweet-economist/2021/5/1391762961035890689.json": "“Do you like pineapple on pizza?” is simultaneously an icebreaker and a dealbreaker. From @1843mag https://t.co/ulkIvRR1MM",
  "data/tweet-economist/2021/5/1391913980734623746.json": "Natural diamonds were formed more than 1bn years ago deep below cratons, the oldest parts of continents https://t.co/IY740Oc1xt",
  "data/tweet-economist/2021/5/1391909707611246592.json": "How the Hawaiian pizza became the world’s most controversial dish. From @1843mag https://t.co/RUf5jceXgq",
  "data/tweet-economist/2021/5/1391962418650177536.json": "A new study has found that plants with blue flowers are heavily over-represented in scientific research https://t.co/ORK3i40Uif",
  "data/tweet-economist/2021/5/1391975408480964611.json": "People in richer countries tend to be slightly warier of covid-19 vaccines than those in poorer parts of the world https://t.co/p2YRctwNwn",
  "data/tweet-economist/2021/5/1391966552325595141.json": "Black Americans spend more of the day being kept waiting https://t.co/cyvmBH1u1a",
  "data/tweet-economist/2021/5/1392001784244277250.json": "The amount paid in Bitcoin ransoms increased by 311% last year compared with 2019 https://t.co/trJ4b8K37g",
  "data/tweet-economist/2021/5/1391668234873671680.json": "A clear preference for large but affordable suburban homes over pricey city-centre flats seems to be emerging https://t.co/O8p6XUr48O",
  "data/tweet-economist/2021/5/1391989121619566593.json": "When considering which foreign languages to study, some people shy away from those that use a different alphabet https://t.co/b0hrC0BGsM",
  "data/tweet-economist/2021/5/1392020389023395841.json": "The costs of long covid are yet to be tallied, but they will be huge https://t.co/tfgnVkHivr",
  "data/tweet-economist/2021/5/1391899621115502593.json": "Legally, China’s digital currency, known as eCNY, would be as real as hard cash https://t.co/Rtku4kzfmn",
  "data/tweet-economist/2021/5/1392054177690439682.json": "Lab-grown diamonds provide a morally acceptable—and cheaper—alternative to mined stones https://t.co/2Xu3PpEDTN",
  "data/tweet-economist/2021/5/1392091359775846403.json": "Historians believe the Black Death made Europeans more adventurous, while the Spanish flu gave way to “increased expressions of risk-taking” https://t.co/BCSKXQopt8",
  "data/tweet-economist/2021/5/1392081624305655810.json": "No region has had a more home-bound year than Latin America, with movement 70% more constrained than in North America https://t.co/mD76mJlsA9",
  "data/tweet-economist/2021/5/1392185001249226758.json": "Researchers have recently found that staring at one’s own image for long stretches on video calls has a particularly negative effect on women https://t.co/gIp9h2jsWp https://t.co/wWXsjBmQYX",
  "data/tweet-economist/2021/5/1392228783063715842.json": "As a classic liberal newspaper, The Economist believes that concentrations of power are dangerous. Government and corporations are growing too close https://t.co/NUhyWGBNxX",
  "data/tweet-economist/2021/5/1391883767321608194.json": "Liz Cheney is a staunch conservative with the voting record to prove it. But suddenly her principles have won her a fan base in the Democratic Party https://t.co/Cha7xEc6JF",
  "data/tweet-economist/2021/5/1392212187595395077.json": "The 1920s were far from roaring, at least at first https://t.co/fJVkia3ZDS",
  "data/tweet-economist/2021/5/1392267026383753216.json": "Israeli and Palestinian officials hoped the end of Ramadan later this week would calm things down in East Jerusalem   https://t.co/fRDjNcq2og",
  "data/tweet-economist/2021/5/1392318789337878528.json": "As America, the European Union and other countries called for de-escalation, Israel mobilised troops to the border with Gaza https://t.co/TC7lOI8YLa",
  "data/tweet-economist/2021/5/1392149064087707653.json": "In 2020 61% of cosmetic-surgery patients in China were aged 16-25, up from 48% two years earlier https://t.co/CJ75gJ9nAO https://t.co/9koHgfRlOn",
  "data/tweet-economist/2021/5/1392349649592324099.json": "Governments and financial firms need to prepare for a long-term shift in how money works, as momentous as the leap to metallic coins or payment cards https://t.co/qHsMFVc1eS",
  "data/tweet-economist/2021/5/1392323393559666691.json": "In the end, the “hard” languages to learn are not those that do what your own language does in a new way https://t.co/c6l6srVEBH",
  "data/tweet-economist/2021/5/1392364204858949632.json": "Roasting coffee and brewing cappuccinos creates more jobs than exporting beans does https://t.co/N9FC9MaCk4",
  "data/tweet-economist/2021/5/1391852321991282690.json": "SpaceX’s “Starlink” satellite network might aim to capture around 3% of the worldwide internet-access market, worth perhaps $1trn a year https://t.co/8AYCaLGdOV",
  "data/tweet-economist/2021/5/1392291428689235968.json": "Despite the growth of renewables, fossil fuels remain the world’s dominant source of energy https://t.co/nDmERQHuIR",
  "data/tweet-economist/2021/5/1392369009522319360.json": "A war between China and Australia is not imminent. So, why is the Australian government's line so aggressive? https://t.co/tk7HnVObnY",
  "data/tweet-economist/2021/5/1392408944350486532.json": "As a classic liberal newspaper, The Economist believes that concentrations of power are dangerous. Government and corporations are growing too close https://t.co/DyHq7acdsH",
  "data/tweet-economist/2021/5/1392453691479834624.json": "Binyamin Netanyahu is tired and distracted. Were he in a stronger position, he might have done more to rein in the police and his far-right supporters  https://t.co/C0W4wF3not",
  "data/tweet-economist/2021/5/1392314034272313346.json": "Armed forces in Myanmar continue to arrest, torture and kill protesters. How should the rest of the world respond? https://t.co/259DxU2Kbi",
  "data/tweet-economist/2021/5/1392206391981510658.json": "Global energy demand tumbled by 4% in 2020. But renewable-energy generation grew at its fastest rate in two decades https://t.co/2t8UPJeqNq",
  "data/tweet-economist/2021/5/1392570038494900224.json": "The Israeli armed forces claim their Iron Dome missile-defence system has a 90-95% rate of interception https://t.co/6gO7BURcJ1",
  "data/tweet-economist/2021/5/1392614581579788291.json": "The pandemic has made us rank the people and things that are important to us. Read about @pameladruck's covid epiphany. From @1843mag https://t.co/xTaeemSBn0",
  "data/tweet-economist/2021/5/1392655238423777280.json": "The fear is that the current aerial battle is the precursor to an all-out war, involving a ground invasion of Gaza by Israeli troops https://t.co/tEN7ihKhyk",
  "data/tweet-economist/2021/5/1392646025718927367.json": "Free to read | Mongolia is currently vaccinating the fastest per head of population. In the past week it has given shots to 39.9% of adults https://t.co/nXNnWITglt",
  "data/tweet-economist/2021/5/1392576333541220354.json": "SpaceX’s “Starlink” satellite network might aim to capture around 3% of the worldwide internet-access market, worth perhaps $1trn a year https://t.co/FqGtPzko31",
  "data/tweet-economist/2021/5/1392683906500026370.json": "In the end, the “hard” languages to learn are not those that do what your own language does in a new way https://t.co/DNZuFp734e",
  "data/tweet-economist/2021/5/1392700640560824322.json": "The “cognitive load” of endless virtual meetings has affected employees everywhere. Research suggests that the condition is more prevalent among women than men https://t.co/Aev7tt1KUq",
  "data/tweet-economist/2021/5/1392710142966304768.json": "SpaceX’s “Starlink” satellite network might aim to capture around 3% of the worldwide internet-access market, worth perhaps $1trn a year https://t.co/Z2u004rfIa",
  "data/tweet-economist/2021/5/1392741027325353987.json": "More than 50 Palestinians, including a senior Hamas commander, have been killed by Israel’s bombing campaign. Israeli deaths remain in single digits https://t.co/Axua6yglYa",
  "data/tweet-economist/2021/5/1392729828219097090.json": "Research suggests long covid could be a persistent viral infection, an autoimmune disorder or a consequence of inflammation during the initial infection with SARS-CoV-2 https://t.co/gpNi2EUVFX",
  "data/tweet-economist/2021/5/1392745984141189121.json": "A boom is beginning. Enjoy it while it lasts—before long there may be a twist in the tale https://t.co/LPhE342n9D",
  "data/tweet-economist/2021/5/1392759359344611330.json": "A new study has found that plants with blue flowers are heavily over-represented in scientific research https://t.co/rQq8bk0Kqi",
  "data/tweet-economist/2021/5/1392773294030573569.json": "The amount paid in Bitcoin ransoms increased by 311% last year compared with 2019 https://t.co/1yYPb7fWFW",
  "data/tweet-economist/2021/5/1392665697084444672.json": "During the pandemic “people all around me people were launching life-changing projects” says @pameladruck. From @1843mag https://t.co/rplv05mJAJ",
  "data/tweet-economist/2021/5/1392479946220650498.json": "India’s official death toll is now over 250,000—although that is assumed to be a massive undercount. Globally, cases and deaths are rising fastest across South Asia https://t.co/b8RfYza5Wq",
  "data/tweet-economist/2021/5/1392823996157251584.json": "Israelis and Palestinians have goaded each other to the brink of war again https://t.co/KgP8g5auI1",
  "data/tweet-economist/2021/5/1392820143693209602.json": "Unless vaccine supplies reach poorer countries, the tragic scenes now unfolding in India risk being repeated elsewhere https://t.co/xJn8y7F8ma",
  "data/tweet-economist/2021/5/1392720141461434369.json": "Even in distinguished company, Kate Winslet’s gestures and expressions stand out. Her latest TV series has two lessons https://t.co/st3zJUhDT2",
  "data/tweet-economist/2021/5/1392837065566474244.json": "Elon Musk said Tesla would stop accepting payment in bitcoin, citing environmental costs. In April, we explained why green campaigners fret over the cryptocurrency https://t.co/1aTy9XftKu",
  "data/tweet-economist/2021/5/1392879596819947523.json": "RT @EconCulture: Making black lives visible—making them count, in every sense—is the overarching plot-line of both Stacey Abrams’s literary…",
  "data/tweet-economist/2021/5/1392841181290274816.json": "Israelis and Palestinians have goaded each other to the brink of war again https://t.co/C0hToLhM84",
  "data/tweet-economist/2021/5/1392889170654281728.json": "The unrest that has spread from Jerusalem to every corner of the land is a reminder that Palestinian grievances will not disappear https://t.co/SEhQIyFq1f",
  "data/tweet-economist/2021/5/1392907262872727554.json": "Our model suggests that covid-19 has already claimed 7.1m-12.7m lives. Our central estimate is that 10m people have died who would otherwise be living https://t.co/dFnZZOFuUj",
  "data/tweet-economist/2021/5/1392902489347870722.json": "This week’s cartoon from KAL: https://t.co/TOnI7WS5Ac https://t.co/s098fZ1uYk",
  "data/tweet-economist/2021/5/1392879712272326664.json": "Our model gives a 95% probability that the covid-19 death toll to date is between 7.1m and 12.7m, with a central estimate of 10.2m https://t.co/yn3xEk68ku",
  "data/tweet-economist/2021/5/1392591679849472010.json": "A boom is beginning. Enjoy it while it lasts—before long there may be a twist in the tale https://t.co/pX6j7SO92A",
  "data/tweet-economist/2021/5/1392913792124821504.json": "Official excess mortality numbers represent, at best, a bit less than half the true death toll of covid-19, and at worst only about a quarter of it https://t.co/gLqUUDMMgy",
  "data/tweet-economist/2021/5/1392947266013573122.json": "Palestinian rockets remain relatively rudimentary and cheap to produce. By contrast, each Israeli interceptor missile is estimated to cost around $40,000 https://t.co/koAkiHbjVj",
  "data/tweet-economist/2021/5/1392967652377829379.json": "Covid-19 has been harder on poor and middle-income countries than anyone knew. The world cannot rest while people perish for want of a jab costing as little as $4 for a two-dose course https://t.co/qYRAvpd4Hn",
  "data/tweet-economist/2021/5/1393019612078428166.json": "Even among Stacey Abrams’s admirers, few may have realised that, in her spare time, she was still writing novels. The secret is out with the publication of “While Justice Sleeps”, a political thriller https://t.co/4pWkbSufVH",
  "data/tweet-economist/2021/5/1393040711084388354.json": "Neither side seems to be running out of rockets, missiles or the desire to fight https://t.co/a8HX9xe2my",
  "data/tweet-economist/2021/5/1393036150474952706.json": "Israeli leaders have warned of civil war https://t.co/zx0hvbUZUx",
  "data/tweet-economist/2021/5/1393059390484369408.json": "Israel and Hamas move closer to war https://t.co/40dXwMMHb5",
  "data/tweet-economist/2021/5/1393073061038067712.json": "KAL’s cartoon https://t.co/bsjEJL4Hd0",
  "data/tweet-economist/2021/5/1393054483496714240.json": "For many of us, escapist plans and pleasures indulged during lockdown mask darker realities https://t.co/ssxuBY4aqv",
  "data/tweet-economist/2021/5/1393095003610693633.json": "The pandemic is increasingly concentrated in developing economies and continuing to grow https://t.co/VCD2Ib2Z4X",
  "data/tweet-economist/2021/5/1393103742799650819.json": "Israel claims Jerusalem as its “eternal and undivided capital”, but its inhabitants are irrevocably split https://t.co/GZ4iUHNgpX",
  "data/tweet-economist/2021/5/1393114383090323460.json": "Both sides have threatened more violence, despite calls for de-­escalation from America, the European Union and Arab countries https://t.co/eVm7XdiFtx",
  "data/tweet-economist/2021/5/1393078007938666496.json": "Official figures suggest that much of the world seemed to get off lightly from covid-19. Our modelling tells another story https://t.co/sVmtQ2qmWB",
  "data/tweet-economist/2021/5/1392987557659660289.json": "Framing is the act of harnessing and choosing between mental models. Those who are adept at it “see the world not as it is, but as it can be” https://t.co/S8lm1Uwi44",
  "data/tweet-economist/2021/5/1392982897452326920.json": "Some people have had genuine psychological or career breakthroughs over lockdown. Have you had a covid epiphany? From @1843mag https://t.co/Tl4X5hkrgg",
  "data/tweet-economist/2021/5/1393132994634915840.json": "\"Forensic musicologists\" are in suddenly in high demand https://t.co/g0tQyw7Ehs",
  "data/tweet-economist/2021/5/1393156999446212609.json": "Our estimate of the true death toll from covid-19 tells the real story of the pandemic. But it also contains an urgent warning. Our cover this week https://t.co/KP89yXjHhy https://t.co/R7IfFe8Xgc",
  "data/tweet-economist/2021/5/1393159430728994818.json": "The UN envoy to the Middle East, Tor Wennesland, warned that fighting was “escalating towards a full­-scale war\" https://t.co/f7v7BJZaMR",
  "data/tweet-economist/2021/5/1393174520635265025.json": "A study found that chronic stress levels were 40% higher in women who were employed and bringing up two children than among their childless counterparts https://t.co/vidadSBOQs",
  "data/tweet-economist/2021/5/1393203466382811139.json": "If enough money to produce vaccines for the entire world had been provided upfront, it would have saved the global economy almost $5trn, according to calculations published in Science https://t.co/OXKwJ6gZOT",
  "data/tweet-economist/2021/5/1393227125847740423.json": "Israeli leaders would rather manage the conflict than try to solve it. Palestinian leaders have made it easy to give up on peace https://t.co/gi2Lna7Gar",
  "data/tweet-economist/2021/5/1393005698691342344.json": "The Chinese men’s ice-­hockey team has qualified for the first time for the Olympics. The team is in danger of suffering a humiliating defeat in Beijing in 2022 https://t.co/fZjnubzeie",
  "data/tweet-economist/2021/5/1393244114213298176.json": "Officially, covid-19 has killed 3m people around the world. But statistical modelling from The Economist suggests the number could be more than three times higher https://t.co/IjKqC8wEFb https://t.co/CzLoCuYmoT",
  "data/tweet-economist/2021/5/1393254803002777603.json": "India is not an outlier. Our figures suggest that, in terms of deaths as a share of population, Peru’s pandemic has been 2.5 times worse https://t.co/YJBBpvIvgI",
  "data/tweet-economist/2021/5/1393248755500077057.json": "India's second wave is worsening the already harsh lot of its poor—some have to borrow money for medicines and then cannot afford the funeral https://t.co/OdwHtDx6kB",
  "data/tweet-economist/2021/5/1393289280655667202.json": "The conflict between Israelis and Palestinians has become the foreign-policy question that most sharply divides Democrats https://t.co/oqAQpiQvbA",
  "data/tweet-economist/2021/5/1393310188862590980.json": "Local Turks cannot buy alcohol during the lockdown or go to the beach, the result of a government ban. Foreigners can drink freely at hotels and can go to the beach as they please   https://t.co/YwmVu2JifB",
  "data/tweet-economist/2021/5/1393285995198570496.json": "As in most countries, hunger in Brazil afflicts some groups more than others. Single black mothers tend to be the worst affected https://t.co/rln3w3VFmL",
  "data/tweet-economist/2021/5/1393352183047991298.json": "The fact that some fish are able to breathe through their bottoms could help humanity  https://t.co/6OGdTg3vBo",
  "data/tweet-economist/2021/5/1393363035960586241.json": "Food insecurity affected over half of homes, or 117m Brazilians, during the first year of the pandemic   https://t.co/j6Oct9lqwG",
  "data/tweet-economist/2021/5/1393362011925385216.json": "The replacement of Liz Cheney indicates the Republican Party’s abandonment of conservative ideology  https://t.co/0u4aZiAVyF",
  "data/tweet-economist/2021/5/1393390958889295876.json": "The Democrats’ ascendant progressive wing has no patience for the party’s traditional bedrock support for Israel, a position long held by Joe Biden https://t.co/sX5MdpAwL5",
  "data/tweet-economist/2021/5/1393383713883492352.json": "For young people across the world, the cinema has been a choice location for a date https://t.co/VqMTL75pde",
  "data/tweet-economist/2021/5/1393411085114429440.json": "Across the region, clusters of covid-19 have been found in places where defences are weakest: hospitals, quarantine facilities and border crossings https://t.co/VTR4ELbR3K",
  "data/tweet-economist/2021/5/1393428858523820032.json": "A Dutch economist and the creator of a popular measure of bitcoin energy use estimated that the cryptocurrency may gobble up as much energy as all the data centres in the world combined https://t.co/Az803c4nYS",
  "data/tweet-economist/2021/5/1393424586004475904.json": "Rather than encouraging Indonesians to help each other, the scheme encourages the richer ones to help themselves https://t.co/bVMwf1UHeO",
  "data/tweet-economist/2021/5/1393444246674452483.json": "“Plunder” traces Napoleon’s systematic gathering of artistic treasures as he conquered Italy, focusing on Paolo Veronese’s “The Wedding Feast at Cana” https://t.co/MH38jcIr86",
  "data/tweet-economist/2021/5/1393436031056285699.json": "How the Hawaiian pizza became the world’s most controversial dish. From @1843mag https://t.co/EBwxcgfqts",
  "data/tweet-economist/2021/5/1393440141327454208.json": "Vertebrates' guts are well supplied with blood vessels, enabling them to absorb digested food. This means they can also, in principle, absorb oxygen  https://t.co/YioDMKclaR",
  "data/tweet-economist/2021/5/1393461877162844160.json": "Covid-19 is one of the most disruptive viruses to have ever swept the globe. The death toll is tragically much higher than widely reported https://t.co/FC12KeKasu https://t.co/gQHLWO3enQ",
  "data/tweet-economist/2021/5/1393448358887534592.json": "Social media is doing for villages what it has already done for the world at large: eroding trust and fanning suspicion. From @1843mag https://t.co/iFi6j6HiEM",
  "data/tweet-economist/2021/5/1393330301154250752.json": "President Joe Biden has proposed waiving intellectual-property claims on covid-19 vaccines. We believe he is wrong to do so https://t.co/4JSmt8oBfm",
  "data/tweet-economist/2021/5/1393461407761506307.json": "Female employees routinely toiling more than 60 hours a week are more than three times likely to develop heart disease, cancer or diabetes than those on a 40­-hour schedule, says a study  https://t.co/SUJgSi4fL7",
  "data/tweet-economist/2021/5/1393461405739798528.json": "Friends say the prince has matured, others say he is a bully who has been chastened  https://t.co/1lhOWVUUJl",
  "data/tweet-economist/2021/5/1393496387875217408.json": "Britain has ordered more than nine covid-19 vaccine doses for each adult, and Canada more than 13. These will be urgently needed elsewhere https://t.co/BV7LkaEXGU",
  "data/tweet-economist/2021/5/1393528350166196225.json": "The fighting in Gaza has sharpened calls from some Democrats to put conditions on aid that America supplies to Israel https://t.co/fs30OCBVCK",
  "data/tweet-economist/2021/5/1393519286677872642.json": "Only 46% of Manhattan’s office workers are expected to return to their desks by September https://t.co/KsSMhElXWv",
  "data/tweet-economist/2021/5/1393491377758031874.json": "Imagining alternative realities is, @staceyabrams says, as much a part of public as literary life: “Politics is about creating the world you want to see” https://t.co/at5pSUYxBu",
  "data/tweet-economist/2021/5/1393532117116768263.json": "Laos, Cambodia and Vietnam blame outsiders for the outbreaks they are currently facing https://t.co/wGA3JoyaGP",
  "data/tweet-economist/2021/5/1393415872727953409.json": "In the wake of last year’s nationwide lockdown, some 230m Indians slipped below a poverty threshold tied to the national minimum wage of around $45 a month, according to one study https://t.co/1cQhel1vhr",
  "data/tweet-economist/2021/5/1393536915266314241.json": "There needs to be a lot more progress in helping the vast majority of women juggle home and work lives, not least by providing affordable child care https://t.co/p5cNjCz9Gd",
  "data/tweet-economist/2021/5/1393567612701974528.json": "The pandemic's global death toll far exceeds offical estimates. Our model suggest that there have been between 7m and 13m excess deaths https://t.co/DXy1Cb1l40 https://t.co/Glhj0pDn76",
  "data/tweet-economist/2021/5/1393616940804026371.json": "Governments have begun to take note of the extremely energy-intensive process it takes to put bitcoin into circulation. Regulations are likely to follow https://t.co/eV7X3Ue6aH",
  "data/tweet-economist/2021/5/1393632289138036740.json": "Covid-19 has not yet run its course. But vaccines have created the chance to save millions of lives. The world must not squander it https://t.co/Aa9BWkDD2n",
  "data/tweet-economist/2021/5/1393624487380365318.json": "The pandemic has thrown into sharp relief the need for better means of medical ventilation. The answer may come from an unexpected place  https://t.co/HTLea4ofH2",
  "data/tweet-economist/2021/5/1393517034487664642.json": "Joe Biden made significant gains with college-educated and suburban whites, which helped propel him to victory in the north https://t.co/AGShT3YJ5q",
  "data/tweet-economist/2021/5/1393649154405109760.json": "Israel is the largest cumulative recipient of American aid, at $146bn, since the second world war https://t.co/1OQtJqHQoP",
  "data/tweet-economist/2021/5/1393476517699670017.json": "Cryptocurrencies like Bitcoin have been billed as a major disruptor to finance. But digital currencies issued by governments might be even more radical—they may even threaten the future of traditional banking https://t.co/QefkjeyyIZ\n\nhttps://t.co/x6B3DU0W3l",
  "data/tweet-economist/2021/5/1393687688469958660.json": "This Chinese success shows off the country’s growing capabilities in space. And it has hardly been concentrating on Mars alone https://t.co/SZNJfW0L7e",
  "data/tweet-economist/2021/5/1393647132238913541.json": "Bitcoin boosters say the digital currency will be instrumental in accelerating the transition to renewables  https://t.co/OlpCXaJmem",
  "data/tweet-economist/2021/5/1393521560846229504.json": "With little hope of a better future, a good number of young Palestinians favour confronting Israel with force https://t.co/ArX2XG7iZy",
  "data/tweet-economist/2021/5/1393712336133890050.json": "South America has the second-highest number of officially-recorded deaths from covid-19, relative to population, of the world’s regions https://t.co/k6sXdIYb9t",
  "data/tweet-economist/2021/5/1393730866908651522.json": "“Do you like pineapple on pizza?” is simultaneously an icebreaker and a dealbreaker. From @1843mag https://t.co/BHqYLxM5Au",
  "data/tweet-economist/2021/5/1393753085294612482.json": "Unless vaccine supplies reach poorer countries, the tragic scenes now unfolding in India risk being repeated elsewhere https://t.co/wIqI1zVUar",
  "data/tweet-economist/2021/5/1393726716510625795.json": "“Do you like pineapple on pizza?” is simultaneously an icebreaker and a dealbreaker. From @1843mag https://t.co/DaWAhfO7fO",
  "data/tweet-economist/2021/5/1393760470885093377.json": "While rectal ventilation sounds uncomfortable, it might actually be easier on the body than the traumatic process of tracheal intubation  https://t.co/L0feamPPaJ",
  "data/tweet-economist/2021/5/1393770197757091840.json": "President Joe Biden has not named a special envoy for Middle East peace, which Barack Obama did on his second full day in office, and he has not yet appointed an ambassador to Israel https://t.co/7h6lCocbCF",
  "data/tweet-economist/2021/5/1393766968012967944.json": "Of Cambodia’s 20,000-odd recorded infections, nearly 90% have occurred since the start of April https://t.co/Xp3oS3K9XG",
  "data/tweet-economist/2021/5/1393484064963825664.json": "How dangerous is B.1.617? Is it more transmissable than other coronavirus variants? Are vaccines effective against it? We explain https://t.co/Va4c2zrT0c",
  "data/tweet-economist/2021/5/1393733209289068546.json": "A former governor of the Federal Reserve worries it will have to raise interest rates to as high as 4.5% to cool the economy https://t.co/C3FncijfqC",
  "data/tweet-economist/2021/5/1393785036525260801.json": "The replacement of Liz Cheney indicates the Republican Party’s abandonment of conservative ideology  https://t.co/hHNaPswRzn",
  "data/tweet-economist/2021/5/1393773958089039875.json": "The biggest shift of any group came among Latino voters, who became much more Republican https://t.co/PcbcFG9lMa",
  "data/tweet-economist/2021/5/1393802756545257475.json": "More Americans died by drug overdose last year than from car crashes and guns combined https://t.co/XsB5Q99wkr",
  "data/tweet-economist/2021/5/1393793862359994368.json": "Money from Saudi Arabia has made its way to Maldivian mosques, and with it a fundamentalist Salafist doctrine https://t.co/OLN8gWOoC9",
  "data/tweet-economist/2021/5/1393798548014215170.json": "Cynthia Saltzman is very good on Napoleon’s justifications for art theft. The French, he said, were doing Europe a favour by rescuing Italian masterpieces from neglect and obscurity https://t.co/L2AFu0xyLq",
  "data/tweet-economist/2021/5/1393722430686998531.json": "The number of daily deaths worldwide has increased in ten out of 15 months. Explore our global excess-death-toll estimates here https://t.co/GN4aHUTJzb",
  "data/tweet-economist/2021/5/1393843934800097280.json": "Our model suggests that covid-19 has already claimed 7.1m-12.7m lives. Our central estimate is that 10m people have died who would otherwise be living https://t.co/ZayLrEldWp",
  "data/tweet-economist/2021/5/1393778483600441345.json": "The Chinese men’s ice-­hockey team has qualified for the first time for the Olympics. The team is in danger of suffering a humiliating defeat in Beijing in 2022 https://t.co/xomeohEqbk",
  "data/tweet-economist/2021/5/1393857776393277441.json": "Mothers who are employed full-­time spend nearly two-­thirds more of their day feeding, bathing and caring for their children (under six) than their employed husbands do https://t.co/BQz07ya6sC",
  "data/tweet-economist/2021/5/1393808460073115649.json": "In an ordinary year one in every 20 Indian families is pushed into poverty by medical expenses https://t.co/a5dhkP7rbZ",
  "data/tweet-economist/2021/5/1393891003350851588.json": "Questions of racial injustice that are dominating America’s domestic political debate appear to have a parallel in Israel’s treatment of Palestinians and of its own Arab citizens https://t.co/k5ogsGqKbT",
  "data/tweet-economist/2021/5/1393894758775414784.json": "Overall, estimates confirm that the electorate is getting less white and much younger. These trends present a problem for the future of the Republican Party https://t.co/3HhzDbZPtI",
  "data/tweet-economist/2021/5/1393761123351113729.json": "The Indonesian government has given the green light for companies to pay for vaccines and inoculate their employees and their families https://t.co/acfxmD5tkh",
  "data/tweet-economist/2021/5/1393604606199013383.json": "Cinema can shape and save individuals, film-makers suggest, and the physical buildings are an integral part of that. With the difficulties that lie ahead, it is now up to audiences to save cinemas https://t.co/s2ub3jzWKT",
  "data/tweet-economist/2021/5/1393906065411133440.json": "When British restaurants and pubs open fully, many will be understaffed. Brexit and low wages are to blame https://t.co/423lESBAZp",
  "data/tweet-economist/2021/5/1393763165394153475.json": "No action gave him so much joy as putting a book that was wanted into someone’s hand     https://t.co/cbJb6onPN8",
  "data/tweet-economist/2021/5/1393954916880814082.json": "As India has shown, the pandemic can shift from an apparent retreat to an unstoppable onslaught in a matter of weeks https://t.co/bmczZ2A0az",
  "data/tweet-economist/2021/5/1393941839204519936.json": "Explore the true death toll of the pandemic country by country, using our interactive model https://t.co/PchkOWwbcy",
  "data/tweet-economist/2021/5/1393989689829470210.json": "In America, far-right extremism is now considered a greater domestic threat than Islamist terrorism https://t.co/Ihg9c6bc1J",
  "data/tweet-economist/2021/5/1393959447781859340.json": "Brexit has accelerated a decades-old trend: people with qualifications tend to vote Labour, those without tend to vote Conservative  https://t.co/QXRedWPXx6",
  "data/tweet-economist/2021/5/1393996445670330369.json": "Republicans have become hooked on Donald Trump’s method of firing up the party’s relatively small and fearful base https://t.co/UI762PkJEC",
  "data/tweet-economist/2021/5/1394010014679961600.json": "Covid-19 has been harder on poor and middle-income countries than anyone knew. The world cannot rest while people perish for want of a jab costing as little as $4 for a two-dose course https://t.co/ru2Qg0s1Fp",
  "data/tweet-economist/2021/5/1394003990384422919.json": "A large number of the most vulnerable unvaccinated people look unlikely to get jabbed soon, increasing the death toll and prolonging the pandemic https://t.co/F9R8Rwc57g",
  "data/tweet-economist/2021/5/1394025884680601600.json": "Roughly 55,000 of those who overdosed last year died from synthetic opioids such as fentanyl https://t.co/KrYypLm0rx",
  "data/tweet-economist/2021/5/1394032420752695296.json": "Our model gives a 95% probability that the covid-19 death toll to date is between 7.1m and 12.7m, with a central estimate of 10.2m https://t.co/jy9EeJdis8",
  "data/tweet-economist/2021/5/1393891515756335106.json": "Our estimate of the true death toll from covid-19 tells the real story of the pandemic. But it also contains an urgent warning. Our cover this week https://t.co/ZR4wnQu0Zc https://t.co/RdMOWEd6cW",
  "data/tweet-economist/2021/5/1394042742167252992.json": "\"Forensic musicologists\" are in suddenly in high demand https://t.co/8Und4laEwJ",
  "data/tweet-economist/2021/5/1394067490460864520.json": "Ten million reasons to vaccinate the world https://t.co/OCdHFmMaDR",
  "data/tweet-economist/2021/5/1394096069051666433.json": "Our statistical models show that the death toll of covid-19 pandemic is much higher than officially reported. Our experts tell us why https://t.co/X1Y0BTrJCy https://t.co/EXBOagOK3e",
  "data/tweet-economist/2021/5/1394104291107946497.json": "While Liz Cheney is motivated more by ideology than power for its own sake, the same cannot be said for many of her peers  https://t.co/HFAhU8Uv3U",
  "data/tweet-economist/2021/5/1394099400620789760.json": "America’s opioid epidemic has entered a dangerous new phase thanks in large part to shifting—and modernising—drug markets https://t.co/SDTc51RoEE",
  "data/tweet-economist/2021/5/1394026131779690498.json": "Our interactive model attempts to calculate the true burden of the pandemic. Explore it here https://t.co/YW8JXrAhap https://t.co/6PUp1hwQHc",
  "data/tweet-economist/2021/5/1394030653369372673.json": "The price of used cars and trucks rose by a staggering 10% in April, contributing to the headline-inflation surprise https://t.co/YeLpjGjodL",
  "data/tweet-economist/2021/5/1394154573342855168.json": "Millions of desperate Indian families have been forced to sell gold, pawn possessions or borrow at usurious rates, often to pay for unnecessary treatments https://t.co/UR8MK8EEUJ",
  "data/tweet-economist/2021/5/1394145866508914690.json": "Intellectual-property rights on covid-19 vaccines are far from the most pressing, or most restrictive, constraint https://t.co/vyxXphMC3y",
  "data/tweet-economist/2021/5/1394159467802120192.json": "Official figures suggest that much of the world seemed to get off lightly from covid-19. Our modelling tells another story https://t.co/gBqVtHyvZN",
  "data/tweet-economist/2021/5/1394173977514414082.json": "The bombardment of Gaza is “continuing with full force” and “will take time”, says Binyamin Netanyahu https://t.co/onpynSZcsW",
  "data/tweet-economist/2021/5/1394167863964020739.json": "The Economist's global excess-death-toll estimates are the first of their kind. Explore the numbers here https://t.co/BZGZ7WeKqA",
  "data/tweet-economist/2021/5/1394112732731957248.json": "The reasons South-East Asian countries lost control of their outbreaks vary, but in most, festivals, foreigners or fornication played a part https://t.co/5iO3n6R8T0",
  "data/tweet-economist/2021/5/1394190415134351360.json": "Brexit has accelerated a decades-old trend: people with qualifications tend to vote Labour, those without tend to vote Conservative  https://t.co/iViSe3HsKn",
  "data/tweet-economist/2021/5/1394201622176321542.json": "What is the carbon cycle, and why does it need to be rebalanced? https://t.co/ICuHC3CBW8 https://t.co/dbD0zlhOi4",
  "data/tweet-economist/2021/5/1394215503812497409.json": "Gaza, by far, has suffered the most. But it is the damage in Israel that makes it hard for Binyamin Netanyahu to agree to a ceasefire https://t.co/a65YvBXQ8U",
  "data/tweet-economist/2021/5/1394221966668836864.json": "Only negotiations can bring lasting peace to Israel and Palestine https://t.co/jH4JKsJuTJ",
  "data/tweet-economist/2021/5/1394198203508088833.json": "The Zhurong rover has a ground-penetrating radar that will be able to look for water ice at depths of up to 100 metres https://t.co/9fqYCkCBk7",
  "data/tweet-economist/2021/5/1394233246213357570.json": "The fighting in Gaza is exacerbating tension in Jerusalem and fuelling violence between Arabs and Jews across Israel https://t.co/ozMwsLjL5D",
  "data/tweet-economist/2021/5/1394150466133577730.json": "Why more young Chinese want to be civil servants https://t.co/uMG3bwQ5NM",
  "data/tweet-economist/2021/5/1394259158820663298.json": "A huge question mark lingers over the two countries where infections are stable or falling, Indonesia and the Philippines https://t.co/OAwYcA9QUa",
  "data/tweet-economist/2021/5/1394132638307323904.json": "Both al-Qaeda and Islamic State have been recruiting in the Maldives https://t.co/7lHaov2JJa",
  "data/tweet-economist/2021/5/1394004744050520074.json": "“It’s no overstatement to say that Becket’s murder was the crime of the century,” says Naomi Speakman, one of the curators of a new exhibition @britishmuseum https://t.co/TyHZV3lD9V",
  "data/tweet-economist/2021/5/1394295714914709504.json": "Behind the scenes, both Israel and Hamas are looking for a way out https://t.co/hYx9con8md",
  "data/tweet-economist/2021/5/1394441426977665026.json": "When things were going well in the fight against the covid-19, Narendra Modi was happy to take the limelight. Now, with thousands dying daily, Indians are finding he has nothing to say https://t.co/tVBv4qLqnb",
  "data/tweet-economist/2021/5/1394429200489238534.json": "Fentanyl’s spread is as much about geopolitics and organised crime as it is about local drug markets https://t.co/hM3vtRcik9",
  "data/tweet-economist/2021/5/1394486527833612289.json": "The spread of fentanyl has changed the demographics of who is dying from opioids https://t.co/IClfRbe9Em",
  "data/tweet-economist/2021/5/1394511290421452801.json": "A worrying new wave of covid-19 is hitting South-East Asia https://t.co/10mJPN6NNC",
  "data/tweet-economist/2021/5/1394123645568655364.json": "An estimated $50bn is needed to cover rent owed—but many tenants are being evicted before the funds are paid out https://t.co/V988HGP5sb",
  "data/tweet-economist/2021/5/1394520538006138883.json": "Instead of signalling solace or hope, in his rare appearances Narendra Modi continues to deliver finger-wagging homilies and boasts of his government’s achievements https://t.co/zzZqu8Eld6",
  "data/tweet-economist/2021/5/1394506659427495938.json": "Pandemic tourism in Turkey https://t.co/UONbKO8wPG",
  "data/tweet-economist/2021/5/1394534919389515779.json": "SpaceX, a Tesla for the skies https://t.co/W5tBlrOIVh",
  "data/tweet-economist/2021/5/1394539638971375616.json": "For the people of Gaza, the simple act of making their daily meal is both a challenge and a symbol of resilience. From the @1843mag archive https://t.co/LybfXuTKvA",
  "data/tweet-economist/2021/5/1394563588543614977.json": "Artificial intelligence is rarely thought of as an artistic tool, but its powers of creativity are growing. What impact could this have on the creative industries? https://t.co/lmmzF5AHln",
  "data/tweet-economist/2021/5/1394558064402046976.json": "China is in danger of being humiliated at the winter Olympics https://t.co/F0yvKb5Gxf",
  "data/tweet-economist/2021/5/1394736204554326019.json": "For the people of Gaza, the simple act of making their daily meal is both a challenge and a symbol of resilience. From the @1843mag archive https://t.co/M5ikchAm5H",
  "data/tweet-economist/2021/5/1394750148211773448.json": "Israel is the largest cumulative recipient of American aid, at $146bn, since the second world war https://t.co/bz9sxn0Qv5",
  "data/tweet-economist/2021/5/1394744879889199108.json": "The official death count to covid-19 is 3.3m. The Economist's excess deaths model finds that the true tally is between 7m and 13mhttps://econ.st/3bSiYof",
  "data/tweet-economist/2021/5/1394491673330298881.json": "President Joe Biden is proposing an ambitious reweaving of the American safety-net, which the White House says will cost $1.8trn  https://t.co/0FQfGiv8h0",
  "data/tweet-economist/2021/5/1394815528162705410.json": "A worrying new wave of covid-19 is hitting South-East Asia https://t.co/s5EvxMrXkt",
  "data/tweet-economist/2021/5/1394861387210428418.json": "China is in danger of being humiliated at the winter Olympics https://t.co/OjsLGTw53j",
  "data/tweet-economist/2021/5/1394878830125408256.json": "While rectal ventilation sounds uncomfortable, it might actually be easier on the body than the traumatic process of tracheal intubation  https://t.co/xGrRvPExj5",
  "data/tweet-economist/2021/5/1394897398439325704.json": "More Americans died by drug overdose last year than from car crashes and guns combined https://t.co/6YKRlUlC96",
  "data/tweet-economist/2021/5/1394887735610068992.json": "Pandemic tourism in Turkey https://t.co/5CbqshK72D",
  "data/tweet-economist/2021/5/1394906250878627843.json": "The Palestinian dead include 96 women and children. With the exception of one soldier, all of the Israeli dead are civilians, too https://t.co/aNefj9aC3I",
  "data/tweet-economist/2021/5/1394920281806880770.json": "SpaceX, a Tesla for the skies https://t.co/kMFLzGnM0k",
  "data/tweet-economist/2021/5/1394433056270917632.json": "Whereas 90% of landlords have legal counsel, only 10% of tenants do. And lawyers make a difference https://t.co/Ic6Xe8aE5h",
  "data/tweet-economist/2021/5/1394839723844292612.json": "The fighting in Jerusalem and Gaza is reminiscent of three previous rounds of war. One difference this time is that violence has spread to Arabs and Jews in Israel’s mixed cities https://t.co/PUQEqim5F7",
  "data/tweet-economist/2021/5/1394951808729165825.json": "A worrying new wave of covid-19 is hitting South-East Asia https://t.co/lSRj9ObPMO",
  "data/tweet-economist/2021/5/1394926398083579906.json": "Aviation is in crisis as a result of covid-19. But technology could deliver a greener future https://t.co/0YGth9f1yA https://t.co/ygkPKUJfMH",
  "data/tweet-economist/2021/5/1394980204452499462.json": "Pro-Beijing business interests are drawing up plans to loosen their grip on land supply, which remains the bedrock of many commercial empires in Hong Kong https://t.co/fs4Ic1Zlyo",
  "data/tweet-economist/2021/5/1395015614570369026.json": "The Economist's model estimates the true death toll of covid-19 could be between 7 and 13m. The official statistics say 3.3m, so how can they be so wrong?⁠ Thread https://t.co/wkerpEW68x",
  "data/tweet-economist/2021/5/1395013538108817416.json": "China is in danger of being humiliated at the winter Olympics https://t.co/skAOotACf7",
  "data/tweet-economist/2021/5/1394762475577430024.json": "The average government spending on benefits such as child allowances, family leave and early education is 2.1% of GDP in the OECD club of mostly rich countries. In America, it is just 0.6%  https://t.co/hG8tLNr4PY",
  "data/tweet-economist/2021/5/1395052151118958593.json": "Between December 9th 1987 and April 30th 2021, the conflict between Israelis and Palestinians claimed 13,969 lives. Fully 87% of the dead were Palestinian https://t.co/ncz9aRwmML",
  "data/tweet-economist/2021/5/1395097485438189571.json": "A year after George Floyd’s death, we examine the role of race in America. Read our special report, which looks at topics such as police brutality and reparations (thread) https://t.co/GnkIK188GF",
  "data/tweet-economist/2021/5/1395125898370850818.json": "A boom is beginning. Enjoy it while it lasts—before long there may be a twist in the tale https://t.co/45xQB9M5Qt",
  "data/tweet-economist/2021/5/1395159867938254854.json": "Academics found that sperm counts had fallen by about 50% in Western countries between 1973 and 2011 https://t.co/iVvy3WuCmT",
  "data/tweet-economist/2021/5/1395190921885532162.json": "Americans rate racism a more important issue than health care, poverty, crime, the environment or national security https://t.co/LZ3Jwo5EvL",
  "data/tweet-economist/2021/5/1395209490971115522.json": "The most likely culprit for falling sperm counts is the proliferation of harmful chemicals such as BPA, most commonly found in household plastic goods https://t.co/F4x28F0uzt",
  "data/tweet-economist/2021/5/1395204811310747656.json": "For many of us, escapist plans and pleasures indulged during lockdown mask darker realities https://t.co/szPN6ISQ28",
  "data/tweet-economist/2021/5/1395232707655999494.json": "A Dutch economist and the creator of a popular measure of bitcoin energy use estimated that the cryptocurrency may gobble up as much energy as all the data centres in the world combined https://t.co/YzFWtacwGn",
  "data/tweet-economist/2021/5/1395223287203045377.json": "China is in danger of being humiliated at the winter Olympics https://t.co/cYOiCZFe8z",
  "data/tweet-economist/2021/5/1395218664719372292.json": "In February, Manhattan district attorney Cyrus Vance obtained eight years of financial records and tax documents from Donald Trump’s accountant, after a long legal battle https://t.co/QKCG72B1t8",
  "data/tweet-economist/2021/5/1395266408309829632.json": "Potential charges facing Donald Trump could include scheming to defraud, falsification of business records, insurance fraud and criminal tax fraud https://t.co/dzI4531d2u",
  "data/tweet-economist/2021/5/1395242709632393217.json": "\"Forensic musicologists\" are in suddenly in high demand https://t.co/HLMh4Jhs5w",
  "data/tweet-economist/2021/5/1395297526706753536.json": "After Napoleon’s defeat in 1815, France returned only half the artworks stolen from Italy https://t.co/L5tA4jsINj",
  "data/tweet-economist/2021/5/1395214123982544904.json": "In 2021 alone, 70 restrictions on abortion have taken effect in 14 states in America  https://t.co/vgRvV7BHPW",
  "data/tweet-economist/2021/5/1395392315146084352.json": "RT @gelliottmorris: New data piece:\n\nA study found peaceful BLM/George Floyd protests last year were correlated with increases in vote shar…",
  "data/tweet-economist/2021/5/1395383551110090758.json": "One study found that sperm counts deteriorated most when air pollution was highest https://t.co/Mo6ptp8h9y",
  "data/tweet-economist/2021/5/1395247482662277120.json": "In the Maldives, an ominous rise in intolerant Islam https://t.co/nbbDbHaFAs",
  "data/tweet-economist/2021/5/1395435435724316674.json": "A generation of Gazans which encompasses half the population has grown up knowing only blockade and war, with little chance of a decent life and little hope for escape https://t.co/mJNNpZhD6v",
  "data/tweet-economist/2021/5/1395417928300961794.json": "At the current pace of social mobility, it could take 11 generations for descendants of a poor Colombian to reach the average Colombian income https://t.co/h0qAHtf93v",
  "data/tweet-economist/2021/5/1395329347884625921.json": "Around a fifth of Israel’s population are Palestinian Arabs, whose existence is very different from those living under occupation in the West Bank or Gaza. @1843mag hears their voices https://t.co/eUz1tmOiqz",
  "data/tweet-economist/2021/5/1395461866042843145.json": "This week’s cartoon from KAL: https://t.co/zOdXMoUXKH https://t.co/RSxHfKeuyE",
  "data/tweet-economist/2021/5/1395435912264257537.json": "In 2019 Abiy Ahmed won the Nobel peace prize for ending a war with Eritrea. Now he is knee-deep in blood, alongside Eritrea's ageing dictator https://t.co/xv7YNAHXG2",
  "data/tweet-economist/2021/5/1395497589924110338.json": "If the trend of falling sperm counts observed in one study continues, it might render half the men of Europe and North America impotent by 2045 https://t.co/BNQQNN1P7A",
  "data/tweet-economist/2021/5/1395562343908708352.json": "Some 47 indigenous languages are spoken in Peru, by 4m people. Around three­-quarters speak Quechua https://t.co/HLnDsxsi1V",
  "data/tweet-economist/2021/5/1395541549904183296.json": "Pfizer has said that people are likely to need a booster dose a year after their initial vaccination; Moderna thinks the same https://t.co/41TqJvP3j2",
  "data/tweet-economist/2021/5/1395523973962768387.json": "The mixing of people from all over the world during the Olympics could allow more variants to enter Japan and more mutations to form     https://t.co/xFZzz6EyZt",
  "data/tweet-economist/2021/5/1395451773163290630.json": "Last year 1,127 people were killed by the police in America. Officers were three times more likely to kill black Americans than white ones https://t.co/k4ZuZ1CXOw",
  "data/tweet-economist/2021/5/1395587555148681220.json": "Along with a criminal investigation into his businesses, Donald Trump is also facing one into his alleged attempt to overturn Georgia’s election result https://t.co/2fONbpOJEs",
  "data/tweet-economist/2021/5/1395387412474441730.json": "A movement to end racial disparities emerged from the murder of George Floyd. How can it succeed? Our cover this week https://t.co/yLRUQ5Lt2x https://t.co/ZcjSQ8cv2o",
  "data/tweet-economist/2021/5/1395600583810330627.json": "As barbecue has grown trendy and its chefs recognised for their skill and artistry, America has failed to recognise “African-American barbecuers and what they’ve contributed to this hallowed culinary tradition” https://t.co/mtmBJ8uTcO",
  "data/tweet-economist/2021/5/1395463359496081412.json": "Eritrean troops, along with those of the Ethiopian government and its militias, are shooting unarmed Tigrayan men and raping Tigrayan women https://t.co/bNT9E6cB9m",
  "data/tweet-economist/2021/5/1395553551238238214.json": "RNA interference has been approved for use against four genetic diseases and is under investigation for the treatment of more than a dozen others. It might also have non-medical uses https://t.co/F2YG0QUvRn",
  "data/tweet-economist/2021/5/1395613997081186304.json": "When he was just 14 Asfaw Yemiru began teaching poor children who would beg outside his school https://t.co/WPkFviQzhv",
  "data/tweet-economist/2021/5/1395609882464866306.json": "The only winner of the bloodshed taking place in Ethiopia's Tigray region is Issaias Afwerki, Eritrea's president and despot https://t.co/Dwczf8mYAw",
  "data/tweet-economist/2021/5/1395696140390125568.json": "The restaurant chain has followed Chipotle and Olive Garden in announcing wage increases https://t.co/sv3SK0hvKV",
  "data/tweet-economist/2021/5/1395673745101103104.json": "Each new outbreak of indiscriminate rocket fire allows Binyamin Netanyahu to insist Israel has no partner for peace among the Palestinians https://t.co/OcwxtbjWZo",
  "data/tweet-economist/2021/5/1395764071006449664.json": "Bogged down in Tigray, threatened by sanctions and facing aid cuts, Issaias Afwerki is playing a dangerous game in his bid for regional dominance https://t.co/6aGz2AmcPc",
  "data/tweet-economist/2021/5/1395762306777223173.json": "Years of illegal, sex­-selective abortions skewed China’s birth ratio. Because China is missing millions of women, lots of young men will never marry https://t.co/g8WN13Pc0K",
  "data/tweet-economist/2021/5/1395808130202804227.json": "Australia and New Zealand cut themselves off from the world to keep covid-19 at bay. They have no plans to lower the drawbridge any time soon https://t.co/H9WIynQb5q",
  "data/tweet-economist/2021/5/1395794285413421056.json": "The Israeli bombardment has pulverised the infrastructure of a place barely fit for human life to begin with https://t.co/jJoc4d6s8t",
  "data/tweet-economist/2021/5/1395816950769594374.json": "Despite recruitment challenges, McDonald's operating margin hit 44.5%, the highest years. They have room to invest in labour https://t.co/uhoDPaIBxz",
  "data/tweet-economist/2021/5/1395832050083586049.json": "Hamas serves as a useful foil for Binyamin Netanyahu. He sees the periodic rounds of violence as a price worth paying for a divided and dysfunctional set of adversaries https://t.co/7JXQvX60dd",
  "data/tweet-economist/2021/5/1395743954969190402.json": "After decades of worshipping foreign trends, many people in China are now turning to classical Chinese traditions and moral lessons https://t.co/LQ4G3e9810",
  "data/tweet-economist/2021/5/1395907530673508358.json": "For all its pretensions as a resistance movement, Hamas has become an organisation focused on preserving its power and with little interest in alleviating misery https://t.co/nZjQD7zULf",
  "data/tweet-economist/2021/5/1395889157118074882.json": "Ask Lao elders, and many will tell you that their lands were once ruled by giants who drank whisky from enormous stone urns https://t.co/p5Xejbd0iY",
  "data/tweet-economist/2021/5/1395832050138198021.json": "Issaias Afwerki's ambitions reach well beyond Tigray's war. He views the bloody conflict as a stepping stone in his bid for mastery in the Horn of Africa https://t.co/1MPC27dZh5",
  "data/tweet-economist/2021/5/1395900727323676677.json": "Some biologists think RNA interference could be used as a precisely aimed, environmentally friendly pesticide https://t.co/68GpcPUOdc",
  "data/tweet-economist/2021/5/1395931191845470211.json": "The violence between Israel and Palestine is an early test of whether Joe Biden will succeed where his predecessors fell short  https://t.co/Iv4XaFpROH",
  "data/tweet-economist/2021/5/1395864754992844802.json": "Many Chinese people are eager to rediscover their heritage, stripped away by decades of Communist rule https://t.co/1Xf0XAknDK",
  "data/tweet-economist/2021/5/1395954150765211648.json": "The Chinese government has launched a system, with a website and hotline, for citizens to snitch on one another for “harmful” political commentary https://t.co/1GEujga7ca",
  "data/tweet-economist/2021/5/1395944016395505669.json": "Antipodeans cannot keep the virus out forever, “unless they want to be isolated from the world until the end of time”, says a former Australian foreign minister https://t.co/tuVshmEmhu",
  "data/tweet-economist/2021/5/1395937504000462852.json": "Tucked away in a military cemetery in the Berlin suburb of Neukölln you will find a small plaque dedicated to “the victims of German colonial rule in Namibia…in particular the colonial war”  https://t.co/g2kbI6Dbxs",
  "data/tweet-economist/2021/5/1395958145466474497.json": "True fluency is valuable, as anyone who has sweated to achieve it will proudly attest https://t.co/0uGAoDLbfd",
  "data/tweet-economist/2021/5/1395805104956231682.json": "Governments are worried. The global microchip shortage is likely to persist for months, if not years https://t.co/RAF4akQpnA",
  "data/tweet-economist/2021/5/1395972975602642951.json": "President Xi Jinping has done more than any other modern Chinese leader to elevate Confucian ideas https://t.co/AWNWDHRR8e",
  "data/tweet-economist/2021/5/1395904960852905985.json": "By 2020 more than 120,000 boys and girls, saved from the street, had passed through Asfaw Yemiru's school in Ethiopia https://t.co/F4epNGIRYu",
  "data/tweet-economist/2021/5/1395869531386560517.json": "In Minneapolis, three-quarters of white families own homes but only a quarter of black families do, the second widest gap in the US \n https://t.co/5UhVzOB0c3",
  "data/tweet-economist/2021/5/1395996639152779264.json": "A study found that female students in China are more likely to come from affluent big­-city families and male students are more likely to hail from poorer, provincial families https://t.co/a9u42zDMAF",
  "data/tweet-economist/2021/5/1395986898406027265.json": "“L’era Del Cinghiale Bianco” (“The Era of the White Boar”) was the first in a series of successes that earned Franco Battiato his nickname, il maestro https://t.co/Q6yqBK7Wly",
  "data/tweet-economist/2021/5/1395981018570665986.json": "On May 13th 1985, the Philadelphia Police Department dropped an explosive onto a house with MOVE members barricaded inside. Eleven people died, including five children https://t.co/k66Wh0L4f6",
  "data/tweet-economist/2021/5/1395991426786369536.json": "After the Brexit vote, the government cut per-acre farm subsidies in England. So the price of good farmland began to drop https://t.co/OaQWr5Z7cV",
  "data/tweet-economist/2021/5/1396028330541993984.json": "The success of Israel’s missile-defence system has drawbacks. The discrepancy between the death tolls on the Israeli and Palestinian sides throws into question whether its response has been proportionate https://t.co/OIRsCBLE6M",
  "data/tweet-economist/2021/5/1395967936322580480.json": "The the N|uu language has but two known surviving fluent speakers, both in their 80s https://t.co/6QXKBOyPPm",
  "data/tweet-economist/2021/5/1396078675452436480.json": "Last year Ren Zhiqiang, a retired property tycoon, published an essay calling Xi Jinping a “clown”. Shortly afterwards, he was sentenced to 18 years in prison for corruption https://t.co/2RJlsE6vmg",
  "data/tweet-economist/2021/5/1396074878504247296.json": "“I don’t think we’re going to spend our lives watching Netflix,” says Sir Howard Panter, whose company has leased London's new theatre https://t.co/253HkBLvov",
  "data/tweet-economist/2021/5/1395949545645907974.json": "More than 2,000 of these vessels, standing up to three metres high and weighing as much as 30 tonnes, can be found scattered across the prosaically named Plain of Jars https://t.co/NaML3PK2My",
  "data/tweet-economist/2021/5/1395779931347488770.json": "One side-effect of all the medical RNA work has been to bring the cost of making the stuff down—a gram of RNA once cost $100,000, now it’s a dollar a gram https://t.co/zAaNlMmbmX",
  "data/tweet-economist/2021/5/1396112131364429831.json": "Israel and Hamas are stuck in a perpetual crisis, trapped by the logic of war, which dictates that they keep going through the same motions  https://t.co/Py7tnv3tpb",
  "data/tweet-economist/2021/5/1396096788193583106.json": "RNA is central to a process that prevents, rather than facilitates, the manufacture of specific proteins https://t.co/TTLaNNEmWK",
  "data/tweet-economist/2021/5/1395847811699249154.json": "“If we cannot name the problems we’re trying to solve, we’re not going to inherit that country that we think we have a right to be.” Kimberlé Crenshaw @sandylocks tells “Checks and Balance” censoring history prevents progress on racial equity https://t.co/oSet8o8YdE https://t.co/KkjT3G2GRA",
  "data/tweet-economist/2021/5/1395883127453724674.json": "In the past a Chinese family without adult sons might recruit a poor but healthy man to join the household as a live-­in son-­in-­law. Social changes are giving this old tradition new life https://t.co/O4gRufYWMa",
  "data/tweet-economist/2021/5/1396144842758033411.json": "At the current pace of social mobility, it could take 11 generations for descendants of a poor Colombian to reach the average Colombian income https://t.co/3OEB8IpwGo",
  "data/tweet-economist/2021/5/1396064807506305025.json": "In 2019 Abiy Ahmed won the Nobel peace prize for ending a war with Eritrea. Now he is knee-deep in blood, alongside Eritrea's ageing dictator https://t.co/yU7Zv6xVR2",
  "data/tweet-economist/2021/5/1396142843257933824.json": "Joe Biden has set his stall out to be the first president since Gerald Ford not to launch a Middle East peace initiative  https://t.co/tpddgInAyg",
  "data/tweet-economist/2021/5/1396073631655006214.json": "Violence between Arabs and Jews within Israel has probably derailed what might have been a breakthrough in political engagement between the two communities https://t.co/TbnfPQhSE4",
  "data/tweet-economist/2021/5/1396163977495957504.json": "At least 75,000 Herero and Nama were killed from 1904-08. It was not until 2015 that the German government accepted the term genocide    https://t.co/3RCc7sJDFF",
  "data/tweet-economist/2021/5/1396179082375835648.json": "That the “Tractatus Logico-Philosophicus” ever made it into print was miraculous https://t.co/8TDC7b3I5b",
  "data/tweet-economist/2021/5/1396028332421095426.json": "Eritrean forces in Tigray have been accused of war crimes including massacres of civilians and mass rape. The destruction wrought reflects more than a desire for revenge https://t.co/1FxjhGmUQF",
  "data/tweet-economist/2021/5/1396148857403289603.json": "In the next 50 years America will be the first rich country where no single racial group, ethnicity or religious denomination will be the majority. The more politicians exploit the tribal fears of some voters, the more turbulent this transition will be  https://t.co/PZQ11h82YV",
  "data/tweet-economist/2021/5/1396068856771366915.json": "“Systemic bias is not rooted only in managers’ minds,” argue Frank Dobbin and Alexandra Kalev. “It is written into every component of our career systems” https://t.co/9g4WOGqrWF",
  "data/tweet-economist/2021/5/1396049712541732867.json": "The only winner of the bloodshed taking place in Ethiopia's Tigray region is Issaias Afwerki, Eritrea's president and despot https://t.co/YVO4t73Qk4",
  "data/tweet-economist/2021/5/1396235708902350860.json": "The Quechua language, spoken by the Inca, has been given a boost by the music of Renata Flores https://t.co/Fld1SLHVjr",
  "data/tweet-economist/2021/5/1396028330806284290.json": "The migrant crisis on Spain's border harkens back to the \"Green March\" of 1975, when Morocco’s king mobilised 350,000 civilians to occupy Western Sahara https://t.co/TohlCFstIl",
  "data/tweet-economist/2021/5/1396275072139251712.json": "RNA interference has been approved for use against four genetic diseases and is under investigation for the treatment of more than a dozen others. It might also have non-medical uses https://t.co/KP8MnHiDIA",
  "data/tweet-economist/2021/5/1396228135423774735.json": "Chinese educators see Confucian morals as a solution to modern social ills, just as some in the West turn to traditional Christian values https://t.co/yvP6T4tgAg",
  "data/tweet-economist/2021/5/1396324034514673665.json": "Australia and New Zealand cut themselves off from the world to keep covid-19 at bay. They have no plans to lower the drawbridge any time soon https://t.co/Cv83jLSwFZ",
  "data/tweet-economist/2021/5/1396312666814222337.json": "Aggravating as it has been to some, the Biden administration considers its quiet diplomacy to be the most practical way to stop further violence https://t.co/pCvYGIPIaP",
  "data/tweet-economist/2021/5/1396303239121940483.json": "Ask Lao elders, and many will tell you that their lands were once ruled by giants who drank whisky from enormous stone urns https://t.co/HXMdxWeUt2",
  "data/tweet-economist/2021/5/1396265968939196417.json": "A special investigation commission in 1986 called the Philadelphia Police Department bombing “reckless, ill-conceived” and “unconscionable” https://t.co/2UqdzXs0tf",
  "data/tweet-economist/2021/5/1396328615537778688.json": "Australia and New Zealand cannot hide from covid-19 forever https://t.co/m8elfGi5ZG",
  "data/tweet-economist/2021/5/1396352966081273857.json": "Better disclosure would show that only a tiny number of firms are investing heavily in renewable energy or breakthrough technologies https://t.co/njWpumdbRv",
  "data/tweet-economist/2021/5/1396315216758157313.json": "Morocco wants Spain to recognise its sovereignty over Western Sahara. This is hard for two reasons https://t.co/oOpW5kzc0e",
  "data/tweet-economist/2021/5/1396384374044692481.json": "Governments are worried. The global microchip shortage is likely to persist for months, if not years https://t.co/dCXV7t2y6e",
  "data/tweet-economist/2021/5/1396375375266164737.json": "Many people in rich countries are against immigration. But if everyone could live where they wanted, the world would be twice as rich https://t.co/66A7FzRNTQ",
  "data/tweet-economist/2021/5/1396405607645814785.json": "Germany will formally acknowledge its culpability for the genocide and Frank­ Walter Steinmeier, the president, will reportedly issue a state apology in the Namibian parliament later this year  https://t.co/3x6DKKIe6j",
  "data/tweet-economist/2021/5/1396388462526410754.json": "Eritrea's troops are deep inside Ethiopian territory and have taken control of parts of its border with Sudan https://t.co/ATsEHMIGqf",
  "data/tweet-economist/2021/5/1396399720172605440.json": "Glossy presentations extolling Greece’s march up various ease-­of­-doing-­business rankings are undermined if the country drops in other rankings   https://t.co/Y9SuhkMQ7n",
  "data/tweet-economist/2021/5/1396412856774664195.json": "Western governments are belatedly waking up to the horrors being perpetrated by Eritrean and Ethiopian forces in Tigray https://t.co/ozURPt2hYZ",
  "data/tweet-economist/2021/5/1396203986273849372.json": "America has the highest incarceration rate in the world, with 643 out of every 100,000 of its residents sitting in jail or prison https://t.co/jhe5lYieah",
  "data/tweet-economist/2021/5/1396470026408976390.json": "Antipodeans cannot keep the virus out forever, “unless they want to be isolated from the world until the end of time”, says a former Australian foreign minister https://t.co/ucAiUuVXFr",
  "data/tweet-economist/2021/5/1396435760824344577.json": "The average African-American family has around one-tenth the wealth of the average white family   https://t.co/8aq02Yr7nc",
  "data/tweet-economist/2021/5/1396481303923642375.json": "In the post-pandemic world, employers at restaurants will need to come up with ways to attract staff https://t.co/WVupksLupG",
  "data/tweet-economist/2021/5/1396534922219827200.json": "One side-effect of all the medical RNA work has been to bring the cost of making the stuff down—a gram of RNA once cost $100,000, now it’s a dollar a gram https://t.co/To86b0AX9z",
  "data/tweet-economist/2021/5/1396496407721283587.json": "The wage hike will only marginally dent the company's profits https://t.co/7Y07SzHMC8",
  "data/tweet-economist/2021/5/1396571658836758528.json": "Funds from Germany will be channelled to education, infrastructure, health care land reform, as a form of compensation not “reparations”    https://t.co/tqu8F0hv8A",
  "data/tweet-economist/2021/5/1396579697602043905.json": "The George Floyd Act requires that federal agencies, in most cases, release any footage showing a death or serious injury in police custody within five days of being requested to do so https://t.co/YYZXDvsVud",
  "data/tweet-economist/2021/5/1396534408795107339.json": "Even if Eritrea’s president, Issaias Afwerki, cannot be persuaded to change his ways, he can be prevented from remaking the Horn of Africa in his own tyrannical image https://t.co/MWuCT8qNz2",
  "data/tweet-economist/2021/5/1396605429799661573.json": "Home schooling has been brutal for many; \"I am clutching at my sanity,\" lamented one parent. Working mothers have suffered disproportionately as a result of the pandemic https://t.co/p5ZuRT3p6U",
  "data/tweet-economist/2021/5/1396560068611563531.json": "Microchips are like America's pork markets of the 1920s: prone to swings between under- and over-supply, and unable to react quickly to changes in demand https://t.co/26YES4f52l",
  "data/tweet-economist/2021/5/1396652423360483330.json": "Ludwig Wittgenstein’s “Tractatus Logico-Philosophicus” was revolutionary in its naivety https://t.co/7FpfKo72oy",
  "data/tweet-economist/2021/5/1396640290178535424.json": "By implementing a policy for vaccinated people without guidance on how to check for vaccination status, the CDC has in essence removed masks for everyone https://t.co/WebIM8GwSR",
  "data/tweet-economist/2021/5/1396594303326109701.json": "Even before the pandemic hit, fully 28% of those between the ages of 20­-24 in Colombia were neither employed nor studying in a school or university https://t.co/BRXW16SZAs",
  "data/tweet-economist/2021/5/1396689222346715139.json": "The pandemic arrived at the worst possible time for the microchip industry. Locked-down workers bought laptops and cloud-computing operators scrambled to add servers https://t.co/vTE8jPUf7i",
  "data/tweet-economist/2021/5/1396684762480365570.json": "Joe Biden’s non-committal approach is guided by the reality that Middle Eastern stability is determined far more by local circumstances than American action https://t.co/DkJVLAAJFr",
  "data/tweet-economist/2021/5/1396702414762299396.json": "In 1967 some two-thirds of Britain's senior civil service came from a “high socioeconomic background”. Today, that figure is 72% https://t.co/MuWKD40At5",
  "data/tweet-economist/2021/5/1396614187560968196.json": "More than 2,000 of these vessels, standing up to three metres high and weighing as much as 30 tonnes, can be found scattered across the prosaically named Plain of Jars https://t.co/2uB6PK2VUf",
  "data/tweet-economist/2021/5/1396732516883632131.json": "World reaction has been hostile: Poland’s prime minister declared that “hijacking a civilian plane is an unprecedented act of state terrorism that cannot go unpunished” https://t.co/vrFmK2jIYU",
  "data/tweet-economist/2021/5/1396707800114475013.json": "The wage battle at McDonald's reflects a broader trend. Restaurants big and small are struggling to attract workers https://t.co/xGD2Lo3ifN",
  "data/tweet-economist/2021/5/1396707800391290884.json": "Why are Eritrean forces in Ethiopia's Tigray region? https://t.co/iLftYnuiIJ",
  "data/tweet-economist/2021/5/1396786568120213506.json": "The Ryanair plane had almost reached its destination in Lithuania when it was turned around, and then had a much longer journey to Minsk—making a mockery of the claim that a bomb threat was the issue https://t.co/3mgMJ0yZ8N",
  "data/tweet-economist/2021/5/1396783084801073153.json": "Germany, has “to a modest extent” begun to wake up to their country’s imperial past in Africa, says Reinhart Kößler of the University of Freiburg    https://t.co/hvKoiXI0Vi",
  "data/tweet-economist/2021/5/1396806212277129218.json": "Body-worn cameras reduce the number of police misconduct complaints by 17%, a study found https://t.co/BwubpabuoB",
  "data/tweet-economist/2021/5/1396771680249339904.json": "The only winner of the bloodshed taking place in Ethiopia's Tigray region is Issaias Afwerki, Eritrea's president and despot https://t.co/2gz83jaPK6",
  "data/tweet-economist/2021/5/1396694100745785344.json": "The biggest factor in parent-child estrangements? The rise of individualism in America  https://t.co/oNQxHPLqGN",
  "data/tweet-economist/2021/5/1396822014808186884.json": "Western governments are belatedly waking up to the horrors being perpetrated by Eritrean and Ethiopian forces in Tigray https://t.co/cyqEGi5lbY",
  "data/tweet-economist/2021/5/1396680270623956994.json": "A team of scientists has used a technique called optically stimulated luminescence to measure when the earth beneath the jars was last exposed to light https://t.co/43BHylPMkM",
  "data/tweet-economist/2021/5/1396903849932304384.json": "In the “Tractatus Logico-Philosophicus” Ludwig Wittgenstein claimed to have found “the final solution of the problems” of philosophy https://t.co/Voay0sPAoG",
  "data/tweet-economist/2021/5/1396888884689215488.json": "“It’s a really archaic method, and it's lovely—but it has real costs.” @sarah_birke tells “The Intelligence” how Costa Rica simply doesn’t have street addresses https://t.co/PxjaFuQlNC https://t.co/U3ctvzuSai",
  "data/tweet-economist/2021/5/1396991173743501313.json": "Neither Jacinda Ardern nor Scott Morrison has much reason to push hard to open up—their economies are faring well and their citizens are happy https://t.co/KOineQ4d89",
  "data/tweet-economist/2021/5/1396850498964164610.json": "In America, critical race theory is “more caricatured than understood”, says Jason Stanley. He argues in The Economist that this is harming “progress towards equality\" https://t.co/ww3t2uxivm",
  "data/tweet-economist/2021/5/1397055102507229187.json": "Funds from Germany will be channelled to education, infrastructure, health care land reform, as a form of compensation not “reparations”    https://t.co/gYI5Unbjj4",
  "data/tweet-economist/2021/5/1397006726621278208.json": "Western statesmen have been competing with each other to express their horror and fury at the arrest of a Belarusian journalist https://t.co/CP00OarQ6j",
  "data/tweet-economist/2021/5/1396964742686781444.json": "Home schooling has been brutal for many; \"I am clutching at my sanity,\" lamented one parent. Working mothers have suffered disproportionately as a result of the pandemic https://t.co/gZfskJoUyA",
  "data/tweet-economist/2021/5/1397085307372281856.json": "Eritrean troops, along with those of the Ethiopian government and its militias, are shooting unarmed Tigrayan men and raping Tigrayan women https://t.co/u8hZ3zMmKk",
  "data/tweet-economist/2021/5/1397049265361391621.json": "Italy could soon get a hard-right government https://t.co/v3BNkopywH",
  "data/tweet-economist/2021/5/1397018578247995393.json": "Across India, almost 9,000 people have been diagnosed with mucormycosis, a fungal infection that in some cases causes parts of the skin to turn black and the face to swell up https://t.co/hs2RWHxGSd",
  "data/tweet-economist/2021/5/1397154795891437574.json": "Millions of African-Americans remain stuck.\n\nThey are poorer, less likely to own homes and more likely to be imprisoned than white people.\n\nThe persistence of deprivation in the same places, generation after generation, reflects the ways cities were settled.\n\nSwipe to read ➡️",
  "data/tweet-economist/2021/5/1397139317068283906.json": "How Greece became Europe’s unlikely model student https://t.co/dCBwwzHODp",
  "data/tweet-economist/2021/5/1397168077406679041.json": "Calls for structural change in America often lead to “moral panic” that “helps maintain the status quo”, says Jason Stanley. Writing in The Economist, he argues for a better understanding of critical race theory https://t.co/knjF7bISOI",
  "data/tweet-economist/2021/5/1397141917444493314.json": "Syria will hold an election on May 26th. Prediction: Bashar al-Assad will be declared the winner https://t.co/BHen86PKIW",
  "data/tweet-economist/2021/5/1396936050988052483.json": "Roman Protasevich, who was detained, is the editor of NEXTA. The channel has long been a thorn in Alexander Lukashenko’s flesh by criticising and mocking the autocrat https://t.co/7FD4u96ZWE",
  "data/tweet-economist/2021/5/1397145689449287690.json": "President Iván Duque has failed to keep his campaign promise to make Colombia safer https://t.co/64jSD9Ai4d",
  "data/tweet-economist/2021/5/1397236297442471940.json": "Australia and New Zealand cut themselves off from the world to keep covid-19 at bay. They have no plans to lower the drawbridge any time soon https://t.co/MyYrslhmsK",
  "data/tweet-economist/2021/5/1397188279083143170.json": "Although all Americans suffer exceptionally high murder rates compared with people in other advanced economies, black Americans fare the worst https://t.co/448TJWhYsK https://t.co/avQsw2WTF4",
  "data/tweet-economist/2021/5/1397183717458731016.json": "According to our interactive poll tracker, just one-in-ten adults think relations have improved between police and minorities since George Floyd was killed by a Minneapolis police officer last May    https://t.co/TNKyMyhDJ4 https://t.co/TBUwFttoc3",
  "data/tweet-economist/2021/5/1397276805707468803.json": "Last year Alexander Lukashenko stole an election and cracked down on the huge protests that followed. How has he ruled Belarus for the past 26 years? https://t.co/UqXU9Jvi9z",
  "data/tweet-economist/2021/5/1397259179765739528.json": "Critical race theory is used to address “the structures, practices, and habits that perpetuate racial inequality” in America, he argues in The Economist https://t.co/iWp9LY7spw",
  "data/tweet-economist/2021/5/1397221949756088320.json": "Issaias Afwerki's ambitions reach well beyond Tigray's war. He views the bloody conflict as a stepping stone in his bid for mastery in the Horn of Africa https://t.co/vgBTHM8Ba0",
  "data/tweet-economist/2021/5/1396949168267186176.json": "As of 2019 African-Americans represented 12% of the American adult population, but 33% of its prison population  https://t.co/oPRApFie7U",
  "data/tweet-economist/2021/5/1397353951192829952.json": "Before George Floyd’s death, police in Minneapolis carried out an average of 39 stops per day of black people, compared with 22 stops per day of white people (even though their population is three times greater) https://t.co/pDHmkVo9A0",
  "data/tweet-economist/2021/5/1397206087250677774.json": "In the current climate even those who support the government can be nervous about mentioning Xi Jinping's name. Instead they use phrases such as “you-know-who” or “big number one” https://t.co/MXmgEpeBFl",
  "data/tweet-economist/2021/5/1397397033263247360.json": "How Israel and Hamas returned to armed conflict https://t.co/PobxnIgk4j",
  "data/tweet-economist/2021/5/1397387288708067328.json": "Even as American cities have grown more diverse and gentrified, at a neighbourhood level black-­white residential segregation is still stuck in the 1970s https://t.co/ZLwsP8TdVS",
  "data/tweet-economist/2021/5/1397286005946912772.json": "RT @_rospearce: Polar charts, which plot data around a circle, make beautiful and memorable #dataviz. But they can also be confusing, or wo…",
  "data/tweet-economist/2021/5/1397428111319441409.json": "Not everyone agrees on exactly how close to Earth the Moon has to be in order to qualify as a supermoon https://t.co/26kr7z01fa",
  "data/tweet-economist/2021/5/1397472201218068484.json": "There is little doubt about what killed George Floyd. Police violence was a part of it, as was poverty—but the real culprit was racism  https://t.co/90d0vCBHrb https://t.co/Fs4LedlYqY",
  "data/tweet-economist/2021/5/1397199967215816707.json": "George Floyd was murdered by a police officer, Derek Chauvin, in Minneapolis a year ago today. Our special coverage looks at how race relations in America are changing \nhttps://t.co/XTB04WfjaT",
  "data/tweet-economist/2021/5/1397545857399001096.json": "Our excess-deaths model estimates that around 1m people have died of covid-19 in India so far in 2021 (not overall, as an earlier tweet implied). This is a much higher death toll than official data show. Here's why\nhttps://t.co/GeRRz0f0Su",
  "data/tweet-economist/2021/5/1397568470762545157.json": "Roasting coffee and brewing cappuccinos creates more jobs than exporting beans does https://t.co/hrPY8nTygO",
  "data/tweet-economist/2021/5/1397544566585184257.json": "Bashar al-Assad has overseen a decade of conflict. Still turnout at today's election in Syria will be high. In March @1843mag profiled his wife, one of Syria's foremost war profiteers https://t.co/APsdVPbR8b",
  "data/tweet-economist/2021/5/1397665857464119301.json": "Between 2014 and 2019, the share of whites who thought the government should spend more money on improving the conditions of African­-Americans increased from 24% to 46% https://t.co/JyOTZ7lB2u",
  "data/tweet-economist/2021/5/1397653310509879297.json": "The prime minster will try to shrug it off—but the testimony was damning https://t.co/dcFutE5hty",
  "data/tweet-economist/2021/5/1397377098742964225.json": "A new university field, Critical Whiteness Studies, has sprung up to examine white guilt, white shame and white “power evasion” https://t.co/M93bhZeLGK",
  "data/tweet-economist/2021/5/1397689524055052289.json": "A boom is beginning. Enjoy it while it lasts—before long there may be a twist in the tale https://t.co/agadvkOG0A",
  "data/tweet-economist/2021/5/1397634648151412739.json": "Alexander Lukashenko forced a passenger flight to land in Minsk to arrest a journalist. The move was shocking—but perhaps not as much as it would have been had any other European ruler tried it https://t.co/ARZvwj0Maq",
  "data/tweet-economist/2021/5/1397657050457518081.json": "At the start of the pandemic the World Health Organisation said that covid-19 was not airborne. Researchers now say otherwise https://t.co/HqDsuZPb4r",
  "data/tweet-economist/2021/5/1397743854183387137.json": "Most documented superspreadings have happened indoors and involved large groups gathered in poorly ventilated spaces https://t.co/cXIHYJlnJ7",
  "data/tweet-economist/2021/5/1397601215341596672.json": "To guard against future pandemics, “the world needs to set aside billions to save trillions”, writes Colombia's former finance minister in The Economist https://t.co/aKHHMn4tdo",
  "data/tweet-economist/2021/5/1397789135453265920.json": "Britain, the EU and America are working on a new set of economic sanctions against Alexander Lukashenko’s regime  https://t.co/MRQaqZmrAc",
  "data/tweet-economist/2021/5/1397779869266857987.json": "The Economist's global excess-death-toll estimates are the first of their kind. Explore the numbers here https://t.co/gCcQXs7KFJ",
  "data/tweet-economist/2021/5/1397728680185630720.json": "A new paper notes that when stay-at-home orders were lifted in America last year, most of the pandemic-induced growth in food-delivery immediately disappeared https://t.co/PQ4d7aYcYg",
  "data/tweet-economist/2021/5/1397719469129179139.json": "Autonomous systems rely on artificial intelligence (AI), which in turn relies on data collected from those systems’ surroundings. But algorithms can be misled, with devastating consequences https://t.co/NQEQItMDXM",
  "data/tweet-economist/2021/5/1397793696196841474.json": "A new paper outlines a powerful genetic-engineering process to exterminate, or at least suppress, mosquitoes carrying diseases https://t.co/VkCYd9Qdxe",
  "data/tweet-economist/2021/5/1397847072662032384.json": "Paying attention to the need for good ventilation will be important in managing the next phase of the pandemic https://t.co/EjsyQTdCBa",
  "data/tweet-economist/2021/5/1397784150904655873.json": "In America in-restaurant dining is now near its pre-pandemic peak. Is this the end of the food-delivery boom? https://t.co/KSoZQILspX",
  "data/tweet-economist/2021/5/1397691790338187264.json": "Writing in The Economist, @MauricioCard proposes investing now in preparations for pandemics and maintaining a pool of capital in reserve to use if a crisis strikes https://t.co/9S9lVT3DxW",
  "data/tweet-economist/2021/5/1397898550500077569.json": "Mexico's president pursues ruinous policies by improper means. Our cover in Latin America this week argues that AMLO is a danger to democracy  https://t.co/2TvJTqYXyK https://t.co/bVBIAGPkYz",
  "data/tweet-economist/2021/5/1397961304548184065.json": "From Caliph Amin's male lover to the decriminalisation of homosexuality by the Ottoman Turks, activists can point to periods when Arab rulers were more liberal about sex https://t.co/dkBxGM7QoR",
  "data/tweet-economist/2021/5/1397959543464804356.json": "In a world plagued by authoritarian populists, Mexico’s president has somehow escaped the limelight. But he is a danger to Mexican democracy https://t.co/bdEae1mFEZ",
  "data/tweet-economist/2021/5/1397943696876843008.json": "Ventilation is the forgotten part of the agenda for improved public health. Covid-19 should lead policymakers to rethink their priorities, albeit belatedly https://t.co/yVUUN0tKqw",
  "data/tweet-economist/2021/5/1397668380111474688.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships? https://t.co/ZMf7LNr8Wu  From @1843mag",
  "data/tweet-economist/2021/5/1397944979524403203.json": "RT @glcarlstrom: It's past time to admit the \"peace process\" is dead. Not only that, it has been unhelpful and counterproductive, granting…",
  "data/tweet-economist/2021/5/1398006119679893511.json": "AMLO's policy of “hugs, not bullets” has failed to reduce Mexico's stratospheric murder rate. And despite his railing against it, corruption is as rife as before https://t.co/ZuzXZvQ0Oc",
  "data/tweet-economist/2021/5/1397932504863158272.json": "The two-state “process” is barring the route to peace between the Israelis and Palestinians. Our cover this week suggests a new way forward https://t.co/tVm37sFEcc https://t.co/TIt03YMFIp",
  "data/tweet-economist/2021/5/1398020510680764416.json": "America needs to pay attention to Andrés Manuel López Obrador. It ought not to turn a blind eye to creeping authoritarianism in its backyard https://t.co/tfyglvrBS3",
  "data/tweet-economist/2021/5/1398019443574415362.json": "With Yuan Longping’s hybrid rice the annual yield was 20­-30% higher, meaning that at least 60m more people could be fed every year https://t.co/T0At9BxBPv",
  "data/tweet-economist/2021/5/1398019709921079298.json": "Evidence points to SARS-CoV-2 being a virus which travels easily through the air, in contradistinction to the early belief that short-range encounters and infected surfaces were the main risks https://t.co/1ThBzBcDzI",
  "data/tweet-economist/2021/5/1398002597169094657.json": "Researchers are testing the idea that genetically tweaking mosquitos to be infertile and then releasing them into the wild could cause populations to reduce dramatically https://t.co/rBIDYhD6dq",
  "data/tweet-economist/2021/5/1398031025427656708.json": "A typical fog-trap yields about 200 litres of water a day, enough to supply around 60 people with drinking water https://t.co/RfJIHtvQCw",
  "data/tweet-economist/2021/5/1397999571536646150.json": "Only 0.3% of rural pupils make it into China’s best universities, compared with 2.8% of urban students https://t.co/3VXIChDP3l",
  "data/tweet-economist/2021/5/1398070603362574337.json": "Mexico's president was woefully slow to respond to covid-19 and spent far too little on cushioning its economic effects. Still, 61% of voters approve of him https://t.co/RAPfCIwk2a",
  "data/tweet-economist/2021/5/1398094786683416580.json": "Many people spend more than 90% of their time indoors. The pandemic has brought a new urgency to what is becoming a public-health priority https://t.co/sS3TBV7D77",
  "data/tweet-economist/2021/5/1398232866249654275.json": "While much classical and Ottoman poetry features male lovers, gay groups are discovering old lesbian poetry, too https://t.co/0rUf2rwLF2",
  "data/tweet-economist/2021/5/1398255000212680708.json": "President López Obrador's ad hoc, lawless approach has not made Mexico less corrupt, but he has highlighted the need for a clean-up https://t.co/4aHSVSO1D2",
  "data/tweet-economist/2021/5/1398130157081305093.json": "In cracking the puzzle of superspreading, researchers have had to re-evaluate their understanding of SARS-CoV-2’s transmission https://t.co/RSRgQACzY0",
  "data/tweet-economist/2021/5/1398269348083609603.json": "The warmth that “Friends” brings to viewers in search of light entertainment after an stressful day has endured. From the archive https://t.co/FgItLVuBrt",
  "data/tweet-economist/2021/5/1397953504656961540.json": "Today, instead of being a pathway to peace, the two-state \"process\" is barring the route. Israel's critics have begun to talk of a \"one-state reality\" https://t.co/KFvCg2NgXy",
  "data/tweet-economist/2021/5/1398341077371924484.json": "Humpback whales have bred prolifically since people stopped butchering them. They may now be as numerous as they were before commercial whaling\nhttps://t.co/JEGzzHYkKm",
  "data/tweet-economist/2021/5/1398322188789354496.json": "RT @robertguest1: I see Mexico's President Lopez Obrador has denounced our cover story in his morning press conference. Read it and decide…",
  "data/tweet-economist/2021/5/1398355651001257989.json": "Few outsiders have noticed how radical Mexico’s president is. Elections on June 6th will determine how deeply he can transform his country https://t.co/edW2Bk1bvX",
  "data/tweet-economist/2021/5/1398376552845426688.json": "America needs to pay attention to Andrés Manuel López Obrador. It ought not to turn a blind eye to creeping authoritarianism in its backyard https://t.co/zmmRrUCsgQ",
  "data/tweet-economist/2021/5/1398187752936648708.json": "Economists traditionally believed that minimum wages actually hurt workers—but recent research has led to a rethink        https://t.co/qAKxtM9b8p https://t.co/QDD71AiCN1",
  "data/tweet-economist/2021/5/1398386129368453120.json": "Canadian butter has become harder because farmers are feeding more palm-oil products to cows  https://t.co/C3uSJtI24J",
  "data/tweet-economist/2021/5/1398401211276070916.json": "Mexico’s president assails institutions including the media and election bodies as eagerly as children thwacking a piñata https://t.co/8SIGz03aha",
  "data/tweet-economist/2021/5/1398322241033719809.json": "RT @gelliottmorris: Our Economist/YouGov poll this week found that 56% of adults approve of the House-passed independent commission to inve…",
  "data/tweet-economist/2021/5/1398428326474260482.json": "AMLO's scorn for rules and disdain for expertise has made Mexico's government far less competent than it should be https://t.co/U7B6lld1py",
  "data/tweet-economist/2021/5/1398444254226272257.json": "Lacking creativity or physically exhausted by mental activity? Executives say they come up with the best ideas while exercising or commuting https://t.co/KpHODUKYyu",
  "data/tweet-economist/2021/5/1398437782918418435.json": "Andrés Manuel López Obrador's goals are good: to raise incomes, improve public services, cut crime and eliminate corruption. It is his methods that are concerning https://t.co/xF5RfdfwoY",
  "data/tweet-economist/2021/5/1398412283810926596.json": "During Mao Zedong’s campaign to collectivise farming there was often little to eat across China. The famine drove Yuan Longping to revolutionise rice production https://t.co/5F3oPDxls0",
  "data/tweet-economist/2021/5/1398497899017867264.json": "Little Island rests on 132 concrete “tulips” of different heights, which create rolling hills and winding footpaths https://t.co/lpe9n2ToSJ",
  "data/tweet-economist/2021/5/1398489338242023426.json": "Crypto kids believe blockchain-based finance is the future. In the opposite corner are the titanosaurs of the fiat world, the central bankers https://t.co/OLr5CwK2bJ",
  "data/tweet-economist/2021/5/1398459852083576843.json": "Jair Bolsonaro has become increasingly weak and Congress, which is known for virus-like opportunism, has used his vulnerability to strengthen itself  https://t.co/6K6LFSQX8Y",
  "data/tweet-economist/2021/5/1398445767635918852.json": "One would be hard-pressed to concoct a clearer demonstration of the arcane senatorial voting procedure and its inadequacies  https://t.co/x5KB0bDpKl",
  "data/tweet-economist/2021/5/1398402488424935436.json": "The paper finds that income and education began diverging as predictors of ideology as early as the 1960s https://t.co/BWeqCUAz1g",
  "data/tweet-economist/2021/5/1398547664225058816.json": "Ventilation is the forgotten part of the agenda for improved public health. Covid-19 should lead policymakers to rethink their priorities, albeit belatedly https://t.co/bmMFV53XDx",
  "data/tweet-economist/2021/5/1398534847052890114.json": "Today more than 440,000 Israelis live in West Bank settlements, a figure that has grown almost fourfold since the Oslo accords were signed. The world has done nothing to halt their growth https://t.co/2BA2JxOKpr",
  "data/tweet-economist/2021/5/1398523875307266048.json": "A remarkable number of people who profess to be animal-lovers behave in ways that suggest the opposite https://t.co/D1mLTaernT",
  "data/tweet-economist/2021/5/1398565048801497095.json": "Abubakar Shekau's relentless killing of civilians and use of child suicide-bombers even turned off Islamic State https://t.co/0FLm7hq5Ko",
  "data/tweet-economist/2021/5/1398603038508650496.json": "AMLO's policy of “hugs, not bullets” has failed to reduce Mexico's stratospheric murder rate. And despite his railing against it, corruption is as rife as before https://t.co/hJtxg356zX",
  "data/tweet-economist/2021/5/1398614105238474756.json": "The paper implies that the votes for Donald Trump and Brexit were not an abrupt departure from precedent, but the consequence of a 60-year-old international trend https://t.co/cdxBl7aGfw",
  "data/tweet-economist/2021/5/1398612847702257665.json": "Most Mexicans are unhappy about the state of the country. Yet the outcome of the election on June 6th hinges on whether the president's personal popularity outweighs his woeful record https://t.co/Bw1cpWgh2O",
  "data/tweet-economist/2021/5/1398612599563075586.json": "Australia is losing mammals faster than any other country, says the World Wildlife Fund. Not many get a comeback like the humpback\nhttps://t.co/3zPd0PxlmD",
  "data/tweet-economist/2021/5/1398596752068984833.json": "The end of the grand fantasy: restaurant dining may never be the same again https://t.co/NHztScg8Xp From @1843mag",
  "data/tweet-economist/2021/5/1398595252823412739.json": "Israel will not grant Palestinians full rights tomorrow. But it must take more responsibility for the suffering in the West Bank and Gaza—and work harder to alleviate it https://t.co/JGxAaNBDbO",
  "data/tweet-economist/2021/5/1398616627768332292.json": "Abortion and \"permitless carry\" were once fringe preoccupations of a few lawmakers. Now they are mainstream among Texas Repulicans https://t.co/doyNm8V5f3",
  "data/tweet-economist/2021/5/1398572364460396549.json": "A new paper argues that it's possible to end the “acute phase” of the pandemic early next year by vaccinating 60% of the population of every country  https://t.co/JAa1NI1fHv",
  "data/tweet-economist/2021/5/1398716052998180869.json": "Activists are examining old legal texts—and finding contradictions https://t.co/EyTFcoEzEc",
  "data/tweet-economist/2021/5/1398707988010090507.json": "In elections on June 6th, Mexican voters have a chance to rein in their president. Opposition parties should work together to restrain him  https://t.co/PiFWaJdmht",
  "data/tweet-economist/2021/5/1398738437163921408.json": "America needs to pay attention to Andrés Manuel López Obrador. It ought not to turn a blind eye to creeping authoritarianism in its backyard https://t.co/aSuCWdGyd9",
  "data/tweet-economist/2021/5/1398719311938793474.json": "Most Mexicans are unhappy about the state of the country. Yet the outcome of the election on June 6th hinges on whether the president's personal popularity outweighs his woeful record https://t.co/GX1NQSR6pe",
  "data/tweet-economist/2021/5/1398670735833550851.json": "Fatah is sclerotic; Hamas tramples the rights of its people. Better Palestinian leaders are a prerequisite for peace https://t.co/w8bVp2xqIX",
  "data/tweet-economist/2021/5/1398751525363752962.json": "A new poll from The Economist and YouGov found that 56% of adults in America approved of an independent commission to investigate the storming of the US Capitol on January 6th  https://t.co/SH986wdozK",
  "data/tweet-economist/2021/5/1398749765345624066.json": "President López Obrador's economic record is dismal. Nor has he made much progress tackling corruption or crime in Mexico https://t.co/VQpq5lGUrA",
  "data/tweet-economist/2021/5/1398765104980762628.json": "Educated voters have shifted their political leaning from right to left. Rich ones remain conservative https://t.co/azaghBDShC",
  "data/tweet-economist/2021/5/1398701440575627264.json": "Most of Brazil’s 30 or so political parties lack ideological platforms; they back presidents in exchange for patronage  https://t.co/2CnUptzrcb",
  "data/tweet-economist/2021/5/1398771894246125568.json": "The blocking of the commission shows the majority of elected Republicans wish not to examine or even discuss the attack on the US Capitol   https://t.co/8jxwXB8zpL",
  "data/tweet-economist/2021/5/1398804098036776964.json": "Philly soul was as smooth, lavish, ornate and expansive as the Motown style had been taut, crisp and succinct https://t.co/1aVF7dcCj1",
  "data/tweet-economist/2021/5/1398774170402557955.json": "Many people spend more than 90% of their time indoors. The pandemic has brought a new urgency to what is becoming a public-health priority https://t.co/AdsB7TXRoo",
  "data/tweet-economist/2021/5/1398659172015673344.json": "“The world cannot afford another economy-crushing pandemic—yet it need not face one if it makes smart decisions today,” argues @MauricioCard in The Economist https://t.co/JYAzyKMCSD",
  "data/tweet-economist/2021/5/1398811668524720130.json": "In Delhi, the hard-hit capital, the share of covid-19 tests proving positive in April reached a frightening 36%. This has since tumbled below 2%\nhttps://t.co/KOTtA0QXZt",
  "data/tweet-economist/2021/5/1398882130097225729.json": "Each hill that Israeli settlers claim in the West Bank, each home they seize in East Jerusalem, makes it harder for Israel to cede the occupied territories in a fi­nal agreement with the Palestinians https://t.co/bIOfHv76XW",
  "data/tweet-economist/2021/5/1398870675360735232.json": "The task of holding the powerful to account seems to have fallen to a mafioso. Sedat Peker's allegations are explosive   https://t.co/iIyVxjXi9E",
  "data/tweet-economist/2021/5/1398861999694659585.json": "Having hijacked a Ryanair plane, Belarus draws closer to Russia https://t.co/68PUDBUNws",
  "data/tweet-economist/2021/5/1398857327739129857.json": "The trend appears in both two-party systems and proportional ones https://t.co/vAkkpmNAOj",
  "data/tweet-economist/2021/5/1398633005288202240.json": "Uniqlo’s clothes have been called basic, bland and boring. Why is it so successful? From @1843mag https://t.co/33vllU5nSN",
  "data/tweet-economist/2021/5/1398908555474968577.json": "AMLO's policy of “hugs, not bullets” has failed to reduce Mexico's stratospheric murder rate. And despite his railing against it, corruption is as rife as before https://t.co/65LNhkTtQ5",
  "data/tweet-economist/2021/5/1398899735570886661.json": "“Do you like pineapple on pizza?” is simultaneously an icebreaker and a dealbreaker. From @1843mag https://t.co/9JuBdtkaaG",
  "data/tweet-economist/2021/5/1398662965163855874.json": "“Nero: the man behind the myth” will certainly make visitors think harder about Nero, and the cruel world he inhabited. It will not make people like the emperor any better https://t.co/WRnnhXwOTT",
  "data/tweet-economist/2021/5/1398912212740317186.json": "Covid-19 is accelerating the adoption of drone technologies. Health systems around the world are looking at drones as a more efficient way to deliver blood, cancer treatments and vaccines https://t.co/aOQ1GPmCsj",
  "data/tweet-economist/2021/5/1398903823226261504.json": "Brazil’s President Jair Bolsonaro is under siege https://t.co/pJMWtAQFoc",
  "data/tweet-economist/2021/5/1398942541396033537.json": "Regimes in the Middle East have alleged that homosexuality is both morally unacceptable and a Western import. But gay activists say homophobia is the Western import https://t.co/YoaaKT0OQp",
  "data/tweet-economist/2021/5/1398934472339333120.json": "Biryani was supposedly invented during the 17th century, when India was part of the Mughal empire. From @1843mag\n https://t.co/eVNLpdMZWm",
  "data/tweet-economist/2021/5/1398724588767490057.json": "China’s two most prestigious universities are in Beijing. Their acceptance rate is around 1% for local students but only a tenth of that for applicants from places outside the capital https://t.co/uqbx5xmTbe",
  "data/tweet-economist/2021/5/1398942542234894356.json": "From taking a shower to going to the coffee shop, there are many ways to recharge your mental batteries https://t.co/dnaVc5eKL1",
  "data/tweet-economist/2021/5/1398990092023312392.json": "Humpbacks are “the rabbits of the ocean”, says Olaf Meynecke of Griffith University. They have bred prolifically since people stopped butchering them\nhttps://t.co/BUhx1xjEGZ",
  "data/tweet-economist/2021/5/1398985811442405381.json": "Indoor-air quality has attracted little government attention. But achieving clean, pathogen-free air in buildings and indoor public spaces is possible https://t.co/UmItx4v6ya",
  "data/tweet-economist/2021/5/1398987834514628614.json": "In Israel, the peace process is no longer a salient political issue. With no pressure to resolve the conflict, most Israeli parties either oppose the two-state solution or ignore it https://t.co/dKZ2ZeOeiS",
  "data/tweet-economist/2021/5/1399048726581231617.json": "Jair Bolsonaro’s approval rating has fallen from 40% to below 30%, and he is currently facing 117 impeachment petitions  https://t.co/9JkELIM2gW",
  "data/tweet-economist/2021/5/1399021555141709825.json": "Schools should be better prepared for remote learning; airports need to know how to quarantine arriving passengers; businesses need to be confident they’d be aided if they were shut down, @MauricioCard writes in The Economist https://t.co/ryw15Wl48X",
  "data/tweet-economist/2021/5/1399002936911466502.json": "ExxonMobil's proxy defeat is significant. The energy titan's loss to green investors is the latest sign that oil businesses is being forced to embrace a low-carbon future https://t.co/uJNlEbLsbW",
  "data/tweet-economist/2021/5/1398886631373934593.json": "Wedding hazing rituals in China used to aim to put newlyweds at ease. Now, they often involve humiliation, binding and beating https://t.co/TGQgA2DV1s",
  "data/tweet-economist/2021/5/1399085725417623555.json": "In elections on June 6th, Mexican voters have a chance to rein in their president. Opposition parties should work together to restrain him  https://t.co/ocPMa1aNJt",
  "data/tweet-economist/2021/5/1399083455837839366.json": "Mexico's president pursues ruinous policies by improper means. Our cover in Latin America this week argues that AMLO is a danger to democracy  https://t.co/gczUTKb8oN https://t.co/gjyKXnkShh",
  "data/tweet-economist/2021/5/1399063284158971904.json": "Artificial intelligence is rarely thought of as an artistic tool, but its powers of creativity are growing. What impact could this have on the creative industries? https://t.co/IGdort7s4M",
  "data/tweet-economist/2021/5/1399063277712429060.json": "Hydrogen technologies may be the best way to fuel greener air travel in the future. Film supported by @Mishcon_de_Reya    https://t.co/UpzHWaqDfl https://t.co/6YhQdinaOv",
  "data/tweet-economist/2021/5/1399055531373907973.json": "Kenny Gamble and Leon Huff had been inspired by Berry Gordy’s Motown company in Detroit. Philadelphia International would go on to rival and then surpass Motown, becoming the preeminent soul label of its era https://t.co/iRsXI8hB6P",
  "data/tweet-economist/2021/5/1398880079065890817.json": "The hidden side to French suburban living https://t.co/NtESvyb9BH",
  "data/tweet-economist/2021/5/1399112153395834889.json": "The populist president's gravest flaw is a disregard for the rule of law. Critics fear he is trying to extend his first term in office https://t.co/xSU9RNqogc",
  "data/tweet-economist/2021/5/1399127758488358912.json": "Every year since the 1960s, the 10% of voters with the most years of schooling gravitated towards left-wing parties, while the remaining 90% slid the other way https://t.co/YH6SNkscF3",
  "data/tweet-economist/2021/5/1399127496428339206.json": "As long as President López Obrador is in charge, there will be two Mexicos. One, a dynamic and integrated part of North America; the other, remote, backward and resentful https://t.co/0pw8ZHifo8",
  "data/tweet-economist/2021/5/1399089496373837827.json": "China enjoys growing leverage over the Taliban’s leaders https://t.co/etiti6y5zo",
  "data/tweet-economist/2021/5/1399184120979333121.json": "183 countries have mass-vaccination programmes underway, and about 1.8bn doses have been administered so far. Our global covid-19 data tracker is updated around the clock with the latest figures https://t.co/lOMZDty1Hl",
  "data/tweet-economist/2021/5/1399164118251233281.json": "National indoor-air-quality standards would help. One way to enforce them could be through ventilation certificates for buildings, similar to food-hygiene assessments https://t.co/woKxJi6oMt",
  "data/tweet-economist/2021/5/1399150385877635072.json": "The Defence Advanced Research Projects Agency has shaped the modern world. This success has spurred imitators https://t.co/LKHHRTSG5p",
  "data/tweet-economist/2021/5/1399137062520041481.json": "During Mao Zedong’s campaign to collectivise farming there was often little to eat across China. The famine drove Yuan Longping to revolutionise rice production https://t.co/iacSCZayjz",
  "data/tweet-economist/2021/5/1399233525648330756.json": "Ventilation is the forgotten part of the agenda for improved public health. Covid-19 should lead policymakers to rethink their priorities, albeit belatedly https://t.co/wLsVUDjbZ4",
  "data/tweet-economist/2021/5/1399210908270931972.json": "Our analysis suggests that excess deaths in the city in the first quarter of 2020 might have been double or triple the government's total https://t.co/2qpsyD2lr8",
  "data/tweet-economist/2021/5/1399206155335962625.json": "Assessing the theory that covid-19 leaked from a Chinese lab https://t.co/U3lGrwnTI6",
  "data/tweet-economist/2021/5/1399201386286522386.json": "From the archive: What has made the popularity of “Friends” so long-lasting? #FriendsReunion https://t.co/jz16TZlBjN",
  "data/tweet-economist/2021/5/1399241937912315904.json": "Improving ventilation will help curb SARS-CoV-2 https://t.co/uPKdfp4rSg",
  "data/tweet-economist/2021/5/1399237457594535936.json": "Swearing spiked on Mumsnet, a British parenting forum, every time there was an announcement about school closures https://t.co/2yamU321xG https://t.co/QL52E8ATC7",
  "data/tweet-economist/2021/5/1399225202240901124.json": "Swearing spiked on Mumsnet, a British parenting forum, every time there was an announcement about school closures https://t.co/TbOrd9F6iU https://t.co/QRytQWSFPz",
  "data/tweet-economist/2021/5/1399140827901923331.json": "The government blames Marxist militants for the killing of 16 people; the local mayor suggests drug traffickers could be responsible",
  "data/tweet-economist/2021/5/1399100072944713728.json": "There have been 3,869 covid-19 deaths in the city of 11m people, according to health statistics. But a country's official toll often fails to capture the full impact of the pandemic https://t.co/v2q2ieCr0g",
  "data/tweet-economist/2021/5/1398996629466890240.json": "Britain's law courts went online during the pandemic. The technology, called the Cloud Video Platform, is probably here to stay https://t.co/nt3FfhtH1p",
  "data/tweet-economist/2021/5/1399259626605056001.json": "Our excess-deaths model gives a 95% probability that the death toll from the covid-19 pandemic is between 7.1m and 12.7m, with a central estimate of 10.2m so far https://t.co/hTeaJ82p3X",
  "data/tweet-economist/2021/5/1399113405009731584.json": "Is the answer to the perpetual question of what to wear actually nothing at all? https://t.co/ySO7vowm7v From @1843mag",
  "data/tweet-economist/2021/5/1399352742259396610.json": "Most Mexicans are unhappy about the state of the country. Yet the outcome of the election on June 6th hinges on whether the president's personal popularity outweighs his woeful record https://t.co/a72mCI6JCF",
  "data/tweet-economist/2021/5/1399372611549814785.json": "Mexico's president is undermining checks on his power. The next three years will determine how much damage he does to Mexico and its democracy https://t.co/N6kTA4sE2p",
  "data/tweet-economist/2021/5/1399353986646528012.json": "As governments across the rich world begin to spend more on research and development, the idea of an agency to invent the future is alluring https://t.co/zeRe5XhY1Q",
  "data/tweet-economist/2021/5/1399253338819018754.json": "“What’s happening in China is no facade. It is very impressive.” On “The Economist Asks”, @RayDalio, the billionaire founder of Bridgewater Associates, on how to think about China's economic growth https://t.co/xFi9XeBqiJ https://t.co/782SaO9RSD",
  "data/tweet-economist/2021/5/1399373617243250689.json": "The main cause of inequality in education in China is the hukou system, which makes it difficult to gain free access to state-provided services outside the place where one’s household is registered https://t.co/ac73KS9Q8G",
  "data/tweet-economist/2021/5/1399327563932110853.json": "Binjamin Netanyahu accused Naftali Bennett of carrying out “the fraud of the century”. He compared the new coalition to Bashar Assad’s regime in Syria and to the rulers of Iran https://t.co/TrdCucDlck",
  "data/tweet-economist/2021/5/1399413138282405894.json": "Joshua Smith of Murdoch University says this rate of growth is “almost biologically implausible”. The creatures may now be as numerous as they were before commercial whaling\nhttps://t.co/0YgujrDhgf",
  "data/tweet-economist/2021/5/1399388472004206593.json": "Whatever the source of the pandemic, Wuhan will forever be remembered as the city where it claimed its first lives. How many people really died there? https://t.co/w8EPaFAtoM",
  "data/tweet-economist/2021/5/1399383934853693447.json": "“Servants and maids, cooks and drivers, breathing the same air, now dying the same deaths.” Rich Indians are confronting their relationships with the servants in their homes. From @1843mag https://t.co/oiZX3huOTk",
  "data/tweet-economist/2021/5/1399365079611572228.json": "The Sedat Peker scandal has revived memories of the 1990s, when the state regularly teamed up with criminal groups to go after opponents, from journalists to Kurdish leaders   https://t.co/ManYkTOt7U",
  "data/tweet-economist/2021/5/1399338135939694593.json": "China has eased its family-planning rules to allow three children—but still won't scrap them entirely. In 2019 we explained how the controlling mindset of officials hurts the country https://t.co/WNFMzUlxEb",
  "data/tweet-economist/2021/5/1399433271826583556.json": "AMLO's policy of “hugs, not bullets” has failed to reduce Mexico's stratospheric murder rate. And despite his railing against it, corruption is as rife as before https://t.co/KHlEXBUdWv",
  "data/tweet-economist/2021/5/1399426181523456000.json": "Artificial intelligence is helping humans make new kinds of art. It is more likely to emerge as a collaborator than a competitor for those working in creative industries.  Film supported by Mishcon de Reya https://t.co/eAUCPKIfkr",
  "data/tweet-economist/2021/5/1399418657764261892.json": "Britain's eagerness to sign free-trade deals fosters a sense of desperation and puts it in a weak bargaining position https://t.co/BF6yjEKZ5O",
  "data/tweet-economist/2021/5/1399410388056301569.json": "European farmers are politically powerful in the same way that the sky is blue: it is a fact so universally acknowledged that it is usually not worth mentioning    https://t.co/LSNifIWeXu",
  "data/tweet-economist/2021/5/1399478313438126080.json": "In a world plagued by authoritarian populists, Mexico’s president has somehow escaped the limelight. But he is a danger to Mexican democracy https://t.co/qyEvKkniSU",
  "data/tweet-economist/2021/5/1399490134043680774.json": "The paper finds that income and education began diverging as predictors of ideology as early as the 1960s https://t.co/OKoR2ePzV8",
  "data/tweet-economist/2021/5/1399510251242668035.json": "Many people spend more than 90% of their time indoors. The pandemic has brought a new urgency to what is becoming a public-health priority https://t.co/siqYGyrGrm",
  "data/tweet-economist/2021/5/1399481327171289088.json": "On paper, it is straightforward. Take enormous, reckless gambles on things so beneficial that only a handful need work to make the whole venture a success. But, inevitably, it is not so simple https://t.co/pARuRFjFnG"
}