{
  "data/tweet-nytimes/2022/5/1520710885911711745.json": "Delta Air Lines diverted a shipment of five million honeybees bound for Alaska to Atlanta and left the bee shipment out on a hot tarmac. Local beekeepers tried to come to the rescue, but very few survived. “This is just such a waste, an absolute tragedy.” https://t.co/Zc3dRi3XkB",
  "data/tweet-nytimes/2022/5/1520658041523351554.json": "Tucker Carlson, the host of the most-watched show on prime-time cable news, uses a simple narrative to instill fear in his viewers. To understand how he promotes extremist ideas and conspiracy theories, we analyzed 1,150 episodes. Here’s what we found. https://t.co/qUVe1jpso4",
  "data/tweet-nytimes/2022/5/1520763740068761600.json": "Nancy Pelosi made an unannounced visit to Ukraine’s capital Saturday, becoming the highest-ranking U.S. official to meet with President Volodymyr Zelensky since the war started. She told him, \"Our commitment is to be there for you until the fight is done.\" https://t.co/qiefJPVPMt https://t.co/ms1jTh5Fdg",
  "data/tweet-nytimes/2022/5/1520775064228143104.json": "Ukrainian soprano Liudmyla Monastyrska sang the title role in “Turandot” at the Metropolitan Opera on Saturday, replacing a Russian diva who was dropped over past support of Vladimir Putin. At curtain calls, Monastyrska emerged wrapped in Ukraine's flag. https://t.co/QRSM8hZPUN https://t.co/rV8DaOlLHT",
  "data/tweet-nytimes/2022/5/1520778838179041281.json": "Tucker Carlson is the champion of the most ardent Donald Trump followers. After 2016, his show focused on the emotional core of Trump’s allure: white panic over an increasingly diverse U.S.\n\nThe shift powered Carlson's rise — and reshaped Fox News. https://t.co/MPDVIOql1p https://t.co/2kA4Da8gvl",
  "data/tweet-nytimes/2022/5/1520816587091161088.json": "Tucker Carlson has weaponized his viewers' fears to create what may be the most racist show in the history of cable news. \n\nA New York Times examination shows how intertwined his rise has been with the transformation of Fox News and U.S. conservatism. https://t.co/176OLUd00R",
  "data/tweet-nytimes/2022/5/1520880084168622082.json": "Régine, who was credited with opening the world's first disco, has died at 92. She built a $500 million empire of 23 clubs in Europe, the Middle East and the Americas, including Régine’s in Manhattan, the most famous nightspot of its era. https://t.co/FMFz5XwWRn https://t.co/w9aTgR0WGX",
  "data/tweet-nytimes/2022/5/1520975151587864576.json": "Oleg Tinkov, one of Russia’s few self-made business tycoons, spoke out against his country’s war in Ukraine. Now he is in hiding.\n\nIn an exclusive interview he said, “I don’t believe in Russia’s future’’ under President Vladimir Putin. https://t.co/fT5ta26ddn",
  "data/tweet-nytimes/2022/5/1520960028609495040.json": "House Speaker Nancy Pelosi traveled to Kyiv over the weekend, leading the second senior American delegation to meet with President Volodymyr Zelensky and declare support for Ukraine's fight against Russia. https://t.co/d2MxIjKfYF",
  "data/tweet-nytimes/2022/5/1520861890137800705.json": "As the presidential election in the Philippines nears, many young voters support Leni Robredo, the vice president. She faces long odds against Ferdinand Marcos Jr., son of a late dictator, as some in an older generation are nostalgic for strongman rule. https://t.co/mR3BtaVp7M",
  "data/tweet-nytimes/2022/5/1521067004517654528.json": "Russia committed about 65% of its ground combat forces to the war in Ukraine, and more than a quarter of those are now likely “combat ineffective,” Britain said. The assessment added to intelligence reports that Russian forces have suffered heavy losses. https://t.co/J2TOBmDRLV",
  "data/tweet-nytimes/2022/5/1520897119820955655.json": "The fact that Kim Kardashian and Pete Davidson chose to make their red carpet debut in Washington was a pretty clear indication of how they wanted to be seen by the world. https://t.co/03mrWFFrMX",
  "data/tweet-nytimes/2022/5/1520965927038337025.json": "\"Two months of darkness.\"\n\nEvacuations are underway for people hiding beneath the Azovstal steel factory in Mariupol, Ukraine. One worker said that she had not seen sunlight in weeks. https://t.co/4FNMCBB91S https://t.co/N1wyvwBfTG",
  "data/tweet-nytimes/2022/5/1521145957299232769.json": "Breaking News: The Supreme Court unanimously ruled that Boston violated the First Amendment when it refused to let a group raise a Christian flag at City Hall. https://t.co/lvPYldWgNb",
  "data/tweet-nytimes/2022/5/1521044360879644677.json": "\"We want a change.\"\n\nMany young Filipinos are aiming to upend a presidential election where the front-runner is Ferdinand Marcos Jr., the son of the late dictator. https://t.co/lsOfAdxQWV",
  "data/tweet-nytimes/2022/5/1521146329287778305.json": "The New York Times analyzed 1,150 episodes of the highest-rated prime-time show in cable news, “Tucker Carlson Tonight.” It revealed how Carlson pushes extremist ideas and conspiracy theories into millions of households every weeknight. https://t.co/KZUBK2UrHQ",
  "data/tweet-nytimes/2022/5/1521185160686882817.json": "Breaking News: A former New York City police officer was found guilty of assaulting a police officer with a metal flagpole during the Capitol riot last year. The Justice Department has won all four of its jury trials connected to the Jan. 6 attack. https://t.co/VOwOX8PaXB",
  "data/tweet-nytimes/2022/5/1520952484885368834.json": "Zhiwen Yan, a Chinese restaurant deliveryman and a beloved figure in his neighborhood in Queens, was shot and killed. No motive was offered, but officials said they were investigating the possibility that he was targeted because of his Asian ethnicity. https://t.co/OFYQshfMlG",
  "data/tweet-nytimes/2022/5/1521168917632364544.json": "Tucker Carlson weaponized his viewers' fears to create what may be the most racist show in the history of cable news. \n\nOur examination shows how intertwined his rise has been with the transformation of Fox News and U.S. conservatism. Some takeaways: https://t.co/esT86zvAqZ",
  "data/tweet-nytimes/2022/5/1520982437014257664.json": "Amid the current crisis, Fiona Hill and other former advisers are connecting President Trump’s pressure campaign on Ukraine to Jan. 6. And they’re ready to talk.\n\nListen to the Sunday Read: https://t.co/MKlnHfAsUd",
  "data/tweet-nytimes/2022/5/1521268332149850114.json": "Riz Ahmed is at the #MetGala in an undone silk shirt and undershirt. “This is an homage to the immigrant workers who kept the Gilded Age going,” he said.\n\nFollow live updates from the red carpet: https://t.co/k9Y1Kcm1Vr https://t.co/FKekTCOov7",
  "data/tweet-nytimes/2022/5/1521260772613050369.json": "Blake Lively, a co-host of tonight's #MetGala, arrived in a full bustle dress with a train silhouette, a tiara and opera gloves.\n\nFollow live updates from the red carpet: https://t.co/z7vu5Jz2BV https://t.co/MLz29hsISa",
  "data/tweet-nytimes/2022/5/1521274631520497671.json": "Architecture is in the air: Alicia Keys arrives at the #MetGala in a Ralph Lauren dress inspired by the Empire State Building. https://t.co/NMl76TMvjN https://t.co/SQIt1CV2tT",
  "data/tweet-nytimes/2022/5/1521273360486916101.json": "Hillary Clinton arrived at the #MetGala in a Joseph Altuzarra dress that is embroidered with the names of American women who inspired her, including Abigail Adams and Harriet Tubman. https://t.co/TJG7ANFamv https://t.co/cwRP0uWrBP",
  "data/tweet-nytimes/2022/5/1521282205473026050.json": "Elon Musk, who dominated headlines recently after his successful bid to buy Twitter for $44 billion, appeared at the #MetGala with his mother, the supermodel Maye Musk. https://t.co/vPNEmqGSxe https://t.co/AZBl7QqRXe",
  "data/tweet-nytimes/2022/5/1521278525822672896.json": "Billie Eilish arrives at the #MetGala in Gucci. https://t.co/B6fO0obWP2 https://t.co/MMz8FIktOO",
  "data/tweet-nytimes/2022/5/1521302366716416001.json": "Breaking News: The Supreme Court has privately voted to strike down Roe v. Wade, according to a leaked draft of its majority opinion published by Politico. https://t.co/DVfKUd6J1l https://t.co/ALWHGErymI",
  "data/tweet-nytimes/2022/5/1521289717194629120.json": "Gigi Hadid arrives at the #MetGala looking incredibly comfortable. https://t.co/0LTlAAjjyt https://t.co/4uTw6UOI5b",
  "data/tweet-nytimes/2022/5/1521280901988167681.json": "Fredrik Robertsson arrives at the #MetGala with his take on the Gilded Glamour theme. https://t.co/tszZfWYfin https://t.co/3fVOhXvrug",
  "data/tweet-nytimes/2022/5/1521266314429571075.json": "Michelle Yeoh arrived at the #MetGala wearing a mint green Prabal Gurung dress. Follow our red carpet updates: https://t.co/w6kvMymd8l https://t.co/rGSCxH9uPW",
  "data/tweet-nytimes/2022/5/1521287225870368768.json": "Jared Leto (the real one, at right) and Gucci’s Alessandro Michele arrived at the #MetGala dressed as identical twins. https://t.co/SBOqVKRmpR https://t.co/lPc8ctmjzs",
  "data/tweet-nytimes/2022/5/1521262035601960960.json": "Janelle Monáe arrived at the #MetGala in a dreamy Ralph Lauren gown. \"A star draped in stars,\" our reporter writes.\n\nFollow live updates from the red carpet: https://t.co/WeY8QINnDO https://t.co/I8C4er25rH",
  "data/tweet-nytimes/2022/5/1521346104662667264.json": "The Supreme Court privately voted to overturn the Roe v. Wade abortion rights decision, a leaked draft opinion shows. Senator Chuck Schumer and Speaker Nancy Pelosi said it could become one of the “most damaging decisions in modern history.”\n\nLive updates: https://t.co/icHcFHoh6s",
  "data/tweet-nytimes/2022/5/1521336282428973057.json": "From December 2021: The typical abortion patient in the U.S. already has a child, is poor, is unmarried and in her late 20s, has some college education and is very early in pregnancy. https://t.co/qedBy7bhKo",
  "data/tweet-nytimes/2022/5/1521155302749519872.json": "Breaking News: A Philadelphia police officer who was fired after he fatally shot a 12-year-old boy in the back in March has been charged with murder in connection with the shooting, the authorities said Monday. https://t.co/iQDD8G3zUS",
  "data/tweet-nytimes/2022/5/1521392890622193664.json": "Protesters flocked to the U.S. Supreme Court after reports emerged that a majority of justices had voted to strike down Roe v. Wade. The mood outside the court was a mix of anger and mourning. Some demonstrators shouted defiant chants; others sat silently.\nhttps://t.co/iGqgpFyiec https://t.co/ZqXsRPSgHr"
}