{
  "data/tweet-economist/2021/12/1466113125611147265.json": "South Africa deserves more than just praise for having informed the world quickly about the new variant https://t.co/dVbYITftvL",
  "data/tweet-economist/2021/12/1465994343018291207.json": "BioNTech said it would examine the Omicron variant for two weeks before deciding whether a new vaccine is required https://t.co/QLxNd0niWa",
  "data/tweet-economist/2021/12/1465980636896927748.json": "Covid-19 and war had combined to create a humanitarian crisis long before the Taliban took over. That crisis is now quickly worsening #WorldAhead https://t.co/KEOc6J826B",
  "data/tweet-economist/2021/12/1465976741558689792.json": "Omicron has been detected across the world. Find out how our data team is tracking covid-19 https://t.co/4CXPoUnFQS",
  "data/tweet-economist/2021/12/1465944454850912261.json": "The French have concluded that Britain cannot be fully trusted, and that the only language it understands is one that involves a show of strength https://t.co/nk9wbwvWMF",
  "data/tweet-economist/2021/12/1465935159530868743.json": "Supply-chain disruptions have pushed up living costs around the world   https://t.co/HkofnZitCg",
  "data/tweet-economist/2021/12/1465924514194284547.json": "That Ukraine had just 6,000 combat-ready troops at the time of Russia’s annexation of Crimea was a legacy of decades of neglect. Now Ukraine is getting its act together https://t.co/cENoI8HUlO",
  "data/tweet-economist/2021/12/1465919846705733632.json": "“The fact that colleagues in South Africa detected this with whole-genome sequencing so early is a real tribute to their capabilities to do genome sequencing.” Sharon Peacock, head of @CovidGenomicsUK, explains, on “Babbage” https://t.co/CuSlmPXodu",
  "data/tweet-economist/2021/12/1465839526501302279.json": "While Jair Bolsonaro remains in power, it seems unlikely that much will change https://t.co/XVwYKw5War",
  "data/tweet-economist/2021/12/1465834128310476801.json": "The 100,000 Russian troops massed near the border are more than mere theatre; Russia is setting up field hospitals and calling up its reserves https://t.co/ezZyEDhv9W",
  "data/tweet-economist/2021/12/1465994513588101123.json": "With so little data about Omicron, much remains unknown. \n\nHowever, initial evidence from South Africa suggests that it may be more transmissible than the Delta variant.\n\nRead more about the spread of the Omicron variant here 👇",
  "data/tweet-economist/2021/12/1466103507191312387.json": "Is Omicron more dangerous than Delta, and will new vaccines need to be developed to tackle it? Our experts answer your questions. \n\nClick to watch 👇",
  "data/tweet-economist/2021/12/1466240361190379523.json": "Ugur Sahin, the co-founder and chief executive of BioNTech, warns that covid-19 will be around for a long time, and that there will be more variants than letters in the Greek alphabet https://t.co/32CYa7Gbnb",
  "data/tweet-economist/2021/12/1466254799041712131.json": "New York remains the costliest American city, in sixth place overall https://t.co/sgLFYngM7b",
  "data/tweet-economist/2021/12/1466382743391121409.json": "RT @_rospearce: Bees practice social distancing when their hive is infected with mites\n\n#dataviz with @AinslieJstone https://t.co/tKF9ovBtO…",
  "data/tweet-economist/2021/12/1466396723346038786.json": "The rich world should supply vaccines to the poor world not out of self-interest, but because they are cheap and save lives https://t.co/zETy3yLtFP",
  "data/tweet-economist/2021/12/1466387868960571397.json": "Omicron amplifies dangers that stalk the global economy—and has delivered a rude reminder that the path out of the pandemic will not be smooth. Our cover this week https://t.co/mftGerEnVa https://t.co/5k4wTUqQb0",
  "data/tweet-economist/2021/12/1466342917954490370.json": "Opinion polls continue to show a steady and worrying erosion of support for democracy in Latin America. Democrats have been warned #WorldAhead https://t.co/ERr8BalLne",
  "data/tweet-economist/2021/12/1466433773885706255.json": "Joe Biden wants to fund a new version of Roosevelt’s Civilian Conservation Corps, aimed at tackling climate change and its effects   https://t.co/ivKaMZgOfs",
  "data/tweet-economist/2021/12/1465993599313747973.json": "The Taliban appear to have a total grip on Afghanistan, but that may prove fleeting https://t.co/WtwVvUU0md",
  "data/tweet-economist/2021/12/1466469610534932487.json": "Jair Bolsonaro’s approval ratings have fallen below 30% as Brazil’s economic outlook becomes increasingly grim https://t.co/NO1dLW4mJW",
  "data/tweet-economist/2021/12/1466431271064809486.json": "When people cook steak, they’re also cooking the planet. How can meat alternatives make the food system more sustainable?\n\nWatch our film, supported by @infosys, to find out 👇",
  "data/tweet-economist/2021/12/1466461913030688768.json": "Tens of thousands of communication satellites could be launched into low orbits by 2030. But if they are too bright, they could change the sky as we know it. \n\nLearn why some astronomers are calling for better regulation 👇",
  "data/tweet-economist/2021/12/1466465687673528321.json": "What do we know about Omicron so far? \n\nWe explain how the new variant differs from other versions of the virus, and how vaccine-developers are reacting 👇",
  "data/tweet-economist/2021/12/1466365917298925576.json": "Nuclear technology is normally in the news because something has gone wrong. But it is one of the safest forms of electricity production https://t.co/wTdpFwiN3O",
  "data/tweet-economist/2021/12/1466482321079644169.json": "Henry Kissinger's new book, “The Age of AI”, is a salutary warning to handle this technology with care and build institutions to control it. Human values and peace must not be taken for granted https://t.co/MXufsn7Gqd",
  "data/tweet-economist/2021/12/1466467348769132561.json": "⚡️ How should the world respond to Omicron?\n\nThe admirable work of South Africa’s scientists and their exemplary openness bought the world time⬇️https://t.co/5hbUKEHdZS",
  "data/tweet-economist/2021/12/1466648391564333058.json": "What do we know about Omicron so far? \n\nWe explain how the new variant differs from other versions of the virus, and how vaccine-developers are reacting 👇",
  "data/tweet-economist/2021/12/1466629147401273349.json": "After Lithuania announced that it would host a representative office using the name Taiwan, China stopped approving exports and downgraded diplomatic relations within the country https://t.co/uiury1XnFo",
  "data/tweet-economist/2021/12/1466499437816074243.json": "This week’s cartoon from KAL: https://t.co/vZOqGlwbJ4 https://t.co/n6CthaTBDb",
  "data/tweet-economist/2021/12/1466778048330715140.json": "Omicron has now been identified in more than 30 countries.\n\nHere’s what we know about the new variant so far ⬇️",
  "data/tweet-economist/2021/12/1466822037461164047.json": "Omicron has now been identified in more than 30 countries.\n\nHere’s what we know about the new variant so far ⬇️",
  "data/tweet-economist/2021/12/1466843798349271041.json": "Omicron is wildly different from any other variant seen to date.\n\nAt the genetic level, it differs from the original Wuhan version in more than 50 places. \n\nHere’s what else we know about Omicron so far👇\nhttps://t.co/a5t3mUWNhM https://t.co/DUXONKReXx",
  "data/tweet-economist/2021/12/1466849232355270658.json": "In the next five years the Democrats propose to give $275bn in benefits. Exactly none of it will go to the bottom 60% of earners. Instead 70% of the gains will go to the top 5% https://t.co/FUtmwVSrTW",
  "data/tweet-economist/2021/12/1466887502019678215.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/I3ROPKQq6x",
  "data/tweet-economist/2021/12/1466847980149956613.json": "In 2022 Brazil will celebrate the 200th anniversary of its independence from Portugal. But the country’s future rests most heavily on the result of the election #WorldAhead https://t.co/Drx2M0zKlO",
  "data/tweet-economist/2021/12/1466927732168683522.json": "What do we know about Omicron so far? \n\nWe explain how the new variant differs from other versions of the virus, and how vaccine-developers are reacting 👇",
  "data/tweet-economist/2021/12/1466615948081872899.json": "Honeybees attacked by parasites segregate activities into specific regions of their hives to stop the spread https://t.co/TCVjXwapBH",
  "data/tweet-economist/2021/12/1467059608674050057.json": "Jair Bolsonaro has started laying the ground to dispute the result. “Only God will remove me,” he said at a rally in September https://t.co/HAhtOrso48",
  "data/tweet-economist/2021/12/1467169604304789511.json": "Xiomara Castro says her government will work for poorer people, such as teachers and farmers, rather than elites  https://t.co/l7qgjMZsb5",
  "data/tweet-economist/2021/12/1467167829795479557.json": "Outside rich democracies, the male kinship group is still the basic unit of many societies https://t.co/EgPA9NpH2q",
  "data/tweet-economist/2021/12/1467144941877051402.json": "An extra shot of the Pfizer-BioNTech vaccine reduced admissions to hospital by 93%, according to a study from Israel https://t.co/AkytqdyeVd",
  "data/tweet-economist/2021/12/1467137572342317056.json": "⚡️ Omicron has now been identified in more than 30 countries.\n\nHere’s what we know about the new variant so far 👇https://t.co/zzD1G7ebar",
  "data/tweet-economist/2021/12/1467123286970703877.json": "The new offence of “stirring up” hatred covers private conversations, even within the home https://t.co/fgHKx3EeQT",
  "data/tweet-economist/2021/12/1467116535844069382.json": "Ugur Sahin, the co-founder and chief executive of BioNTech, warns that covid-19 will be around for a long time, and that there will be more variants than letters in the Greek alphabet https://t.co/cjO9UZzaRg",
  "data/tweet-economist/2021/12/1467113817989652485.json": "Joseph Stalin did his best to wipe out perceived enemies. It might have comforted them to know that their human capital has outlived the gulag by six decades https://t.co/iyzuP8grx9",
  "data/tweet-economist/2021/12/1467054945983733761.json": "Anywhere politicians, journalists, wonks and lobbyists gather tends to produce a surplus of bullshit https://t.co/XTnYl6jTrf",
  "data/tweet-economist/2021/12/1467041027953471493.json": "As civil liberties erode rapidly in Hong Kong, how many more people might relocate? A new study provides the best estimate yet https://t.co/D1FrEKBeOx",
  "data/tweet-economist/2021/12/1466964498338701319.json": "Omicron could trigger more lockdowns in key manufacturing areas such as Vietnam and Malaysia, aggravating global supply glitches https://t.co/ygjO02nGRJ",
  "data/tweet-economist/2021/12/1467222195910975500.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/P9XpYdUyPB",
  "data/tweet-economist/2021/12/1467086331746656258.json": "Africa has more internet users than America, but only as much data-­centre space as Switzerland. This could be about to change  https://t.co/pmksbd9laJ",
  "data/tweet-economist/2021/12/1467154226124046336.json": "What do we know about Omicron so far? \n\nWe explain how the new variant differs from other versions of the virus, and how vaccine-developers are reacting 👇",
  "data/tweet-economist/2021/12/1467137629565108240.json": "Slavery and the last Native American land-grabs are only two lifetimes away; no wonder the politics surrounding them are so intense https://t.co/xQPM8TzHzV",
  "data/tweet-economist/2021/12/1467359089961353216.json": "The leaders of China’s Communist Party have spent a long time waiting for liberal democracy to look as fragile as it does today https://t.co/Rg62H11X47",
  "data/tweet-economist/2021/12/1467355067686739974.json": "India's rising age of marriage has had an impact on birth rates. The proportion of women who have already been married at 18 has halved in 15 years, to 23% https://t.co/L6pz9zuhUA",
  "data/tweet-economist/2021/12/1467319323710656519.json": "Technological change is upending finance. Yet the least noticed disruption on the frontier between technology and finance may end up as the most revolutionary https://t.co/8e0M6FslTW",
  "data/tweet-economist/2021/12/1467376305377316867.json": "Data show that areas near camps that imprisoned lots of educated “enemies of the people” are now unusually rich https://t.co/6BZNWLdPAd",
  "data/tweet-economist/2021/12/1467395427959984136.json": "From “Dune” to “Drive My Car”, “Summer of Soul” to “Supernova”: read about our favourite films of the year https://t.co/1OXj80qWMN",
  "data/tweet-economist/2021/12/1467442401702817796.json": "Angela Merkel once said she wanted to leave politics before she became a “half-dead wreck”. On December 8th she will do just that https://t.co/0yPpR0Mvxt",
  "data/tweet-economist/2021/12/1467442086261710854.json": "⚡️ At the genetic level, Omicron differs from the original Wuhan version in more than 50 places. ⁠\n\nIt has now been identified in more than 30 countries but where and how long this variant has been circulating is not clear https://t.co/zzD1G7ebar",
  "data/tweet-economist/2021/12/1467390405885018114.json": "Bullshit lurks at the heart of the EU’s legitimacy https://t.co/MvnPEG0SjK",
  "data/tweet-economist/2021/12/1467251886025805827.json": "People are quitting America’s workforce in record numbers https://t.co/ZtoVkb8Hli",
  "data/tweet-economist/2021/12/1467509090612039683.json": "In the old days Muslims were quite tolerant of homosexuality https://t.co/pAJtUA4mx1",
  "data/tweet-economist/2021/12/1467521419345117186.json": "Don’t underestimate the danger of left-leaning identity politics https://t.co/E3fhA8wJ4T",
  "data/tweet-economist/2021/12/1467564191770976264.json": "Angela Merkel will step down Germany's chancellor on December 8th after 16 years in power. What is next for her? https://t.co/oD9ceB9ULe",
  "data/tweet-economist/2021/12/1467552876608294920.json": "While governments look to third shots for salvation, the real risk comes from those who refuse even their first https://t.co/XmRkNRT4P4",
  "data/tweet-economist/2021/12/1467636408856764416.json": "Supply-chain problems related to the pandemic have pushed the price of goods up in much of the world https://t.co/gyde7FrXen",
  "data/tweet-economist/2021/12/1467524942862471180.json": "What a 3,200-year-old bowl of rice reveals about identity politics in India today https://t.co/f7WrDq8lv1",
  "data/tweet-economist/2021/12/1467657109290602497.json": "It was only the purest luck that saved the world from nuclear catastrophe on October 27th 1962 https://t.co/DXD7jr6rEe",
  "data/tweet-economist/2021/12/1467688511654531072.json": "America’s patent library is calculated to be worth $2.9trn, compared with China’s collection at $392bn https://t.co/PisQADE6ot",
  "data/tweet-economist/2021/12/1467699828314492928.json": "As China’s human-rights abuses have become more egregious, the reputational risk of keeping quiet has grown  https://t.co/MvgSBqH8zH",
  "data/tweet-economist/2021/12/1467720476827041794.json": "Scandinavian employees benefit from wages and benefits that are among the most generous on the continent. Denmark and its Scandi neighbours manage to be both a worker’s paradise and a capitalist’s dream https://t.co/p9aKGAJoUu",
  "data/tweet-economist/2021/12/1467463768984760320.json": "Those who are considering a relocation are disgruntled about the governance of Hong Kong. They expect to be freer in Britain, rather than more prosperous https://t.co/9BljoOUzji",
  "data/tweet-economist/2021/12/1467814517090443273.json": "Ethiopia's Tigray region is getting only a fraction of the food needed to keep its 6m inhabitants alive, hardly any fuel and no medical supplies at all https://t.co/M9m1qHFhnC",
  "data/tweet-economist/2021/12/1467756126779449344.json": "Japan’s small businesses are often family-run. But families have fewer children than they did in the past, and fewer of them are excited about inheriting the family trade https://t.co/eTJUDvd5Ct",
  "data/tweet-economist/2021/12/1467826158628585474.json": "Tens of thousands of communication satellites could be launched into low orbits by 2030. But if they are too bright, they could change the sky as we know it. \n\nLearn why some astronomers are calling for better regulation 👇",
  "data/tweet-economist/2021/12/1467846878771433474.json": "The free world—meaning, broadly, societies in which governments can lose elections—should not underestimate this Chinese challenge https://t.co/lhFpRycYM8",
  "data/tweet-economist/2021/12/1467958399044366355.json": "The timing of Omicron’s arrival in Europe and America, at the start of the festive (and flu) season, could not be worse https://t.co/t7cK0dzm8d",
  "data/tweet-economist/2021/12/1467643481069957125.json": "Lots of educated prisoners settled near their jails and spawned another educated and rich generation https://t.co/RDFidHvzcj",
  "data/tweet-economist/2021/12/1468058709410684929.json": "Small companies make up a big share of Japan’s economy. The country has some 3.6m small and medium-size enterprises, which employ 70% of workers  https://t.co/4frq0mtmhE",
  "data/tweet-economist/2021/12/1468142042048077824.json": "Scandinavian employees benefit from wages and benefits that are among the most generous on the continent. Denmark and its Scandi neighbours manage to be both a worker’s paradise and a capitalist’s dream https://t.co/DcKfPGcatO",
  "data/tweet-economist/2021/12/1467793913029267456.json": "Angela Merkel has offered few clues as to what she might do after stepping down as Germany's chancellor. What inspiration might she draw from other retired leaders? https://t.co/lEaVqWSHY2",
  "data/tweet-economist/2021/12/1468150832772358150.json": "“The Father”, “The French Dispatch”, “The Green Knight” and “The Power of the Dog” were among the best films of 2021 https://t.co/hWRkHVnItn",
  "data/tweet-economist/2021/12/1468019807664713730.json": "New York remains the costliest American city, in sixth place overall https://t.co/TJTwFQsvhi",
  "data/tweet-economist/2021/12/1468120851505725442.json": "It is possible to build a career on bullshit in Brussels https://t.co/NCu0xoWTaf",
  "data/tweet-economist/2021/12/1468177803543728129.json": "Morocco’s ban on extramarital sex is stifling the domestic market in hotel beds. The risk of a jail sentence certainly adds spice to date nights https://t.co/uBx9fq8Jdt",
  "data/tweet-economist/2021/12/1468401202639613953.json": "Just one month ago, South Africa’s pandemic appeared to be nearing an end. No longer is this the case https://t.co/XnIRxfnVxO",
  "data/tweet-economist/2021/12/1468436012124848133.json": "“Putin is afraid of the young”: meet the 23-year-old Russian activist living under house arrest https://t.co/wX9e9DMMv2",
  "data/tweet-economist/2021/12/1468460830777872385.json": "Electric battery-makers are booming and their share prices are soaring https://t.co/tZ4dywPlIR",
  "data/tweet-economist/2021/12/1468476563318611973.json": "How can Omicron, which has only been confirmed in fewer than 300 cases in South Africa, be responsible for a wave that numbers over 10,000 cases every day? https://t.co/qufrYSqdD8",
  "data/tweet-economist/2021/12/1468630899382173697.json": "The real number of Omicron infections is vastly greater than those confirmed https://t.co/X7HGcMFYtK",
  "data/tweet-economist/2021/12/1468538500010151940.json": "RT @NoahSneider: 🧵 1/ As Japan's Reiwa era begins in earnest, it finds itself on the front line of common challenges.  \n\nMy special report…",
  "data/tweet-economist/2021/12/1468667281421090821.json": "Tokyo boasts punctual public transport, safe neighbourhoods, clean streets and more Michelin star restaurants than anywhere else https://t.co/IMNrOoaepd",
  "data/tweet-economist/2021/12/1468678283894087684.json": "Japan’s gerontological society has called for reclassifying those aged 65-­74 as “pre­-old” https://t.co/ALg7VHlooz",
  "data/tweet-economist/2021/12/1468137972533018625.json": "By pulling out of China, the Women’s Tennis Association faces losses of tens of millions of dollars annually, including sponsorships for its tournaments and fees for online streaming rights https://t.co/JE5ID9Z7J7",
  "data/tweet-economist/2021/12/1468796992314875904.json": "Bolivia has 21m tonnes of reserves of lithium, according to the US Geological Survey. If it could extract more of them, it would noticeably increase the global supply https://t.co/XAS3XMWqAy",
  "data/tweet-economist/2021/12/1468570816094875648.json": "The economy has evolved a level of tolerance to covid-19. \n\nBut with the emergence of Omicron, that may be about to be tested 👇",
  "data/tweet-economist/2021/12/1468651611039973377.json": "Angela Merkel once said she wanted to leave politics before she became a “half-dead wreck”. On December 8th she will do just that https://t.co/NMKTslOc3Y",
  "data/tweet-economist/2021/12/1468937726791663621.json": "President Joe Biden has invited 110 countries to his “Summit for Democracy”, which begins online today. \n\nBut read why the guest list reflects American politics more than democratic values 👇",
  "data/tweet-economist/2021/12/1468928543765712903.json": "A dangerous, unstable world with less America looms. Other democracies must start preparing. Our cover this week https://t.co/cac0gYCJcs https://t.co/wpehrvOkqf",
  "data/tweet-economist/2021/12/1469005131391946772.json": "In South Africa, where Omicron has displaced Delta, cases are rising faster than in earlier waves. \n\nRead why it could pose a serious threat to the unvaccinated ⬇️",
  "data/tweet-economist/2021/12/1469020809096269832.json": "With Omicron now detected in more than 50 countries, the world will soon find out whether it will displace Delta https://t.co/pLIekTQpD7",
  "data/tweet-economist/2021/12/1469070365561339910.json": "Tokyo is the world’s largest city, yet it is also one of the most liveable. Here's how it offers lessons to cities elsewhere https://t.co/knmcGjCZV9",
  "data/tweet-economist/2021/12/1469085464506384388.json": "This week’s cartoon from KAL: https://t.co/MgweRtF7zH https://t.co/qvecQfipxK",
  "data/tweet-economist/2021/12/1469097549097279489.json": "Russia could soon invade Ukraine, China is buzzing Taiwan’s airspace with fighter jets and Iran threatens to get a nuclear bomb. How far would America go to prevent its rivals from overturning the international order? https://t.co/LlL2lSpec2",
  "data/tweet-economist/2021/12/1469053764397060098.json": "Such evidence of arrogance, incompetence and poor judgment would reflect badly on any government. What leaves the prime minister’s supporters despairing is that his promised revolution has stalled on many fronts https://t.co/YdbwLblo3o",
  "data/tweet-economist/2021/12/1469135467383767040.json": "As EVs become more common, the charging problem will become more severe https://t.co/etBqKlMV0n",
  "data/tweet-economist/2021/12/1469173867809849344.json": "The goal in Japan has shifted from increasing life expectancy to enhancing the “healthy, autonomous life expectancy” https://t.co/rUNFqFSaTC",
  "data/tweet-economist/2021/12/1469186848438120448.json": "By 2040 around 60% of all charging will need to take place away from home, requiring a vast public network of charging stations https://t.co/NmiDRnSAdt",
  "data/tweet-economist/2021/12/1469275705800278019.json": "In South Africa, where Omicron has displaced Delta, cases are rising faster than in earlier waves. \n\nRead why it could pose a serious threat to the unvaccinated ⬇️",
  "data/tweet-economist/2021/12/1469458171504865285.json": "China’s one-party system is “a disaster for China’s development and human society,” warns Cai Xia, a former member of the Communist Party https://t.co/oaXoUR2ZXH",
  "data/tweet-economist/2021/12/1469167999571709952.json": "“The absence of liberal democracy—and the values it upholds like laws and rights—is dark”, warns @IlvesToomas https://t.co/MRWusJJ05g",
  "data/tweet-economist/2021/12/1469560954140729344.json": "China’s one-party system is “a disaster for China’s development and human society,” warns Cai Xia, a former member of the Communist Party https://t.co/0R0XE3L6Ap",
  "data/tweet-economist/2021/12/1469486108429926409.json": "Who might install the millions of chargers required—and how should it be done? Governments and businesses will have to work together https://t.co/Y3Uk8oMDyB",
  "data/tweet-economist/2021/12/1469385516646899723.json": "The Dutch are not used to being ranked among the worst in Europe. But that is where they stand in covid booster vaccinations https://t.co/4VjNft5db5",
  "data/tweet-economist/2021/12/1469582291752132611.json": "Such evidence of arrogance, incompetence and poor judgment would reflect badly on any government. What leaves the prime minister’s supporters despairing is that his promised revolution has stalled on many fronts https://t.co/8qoICv9MkU",
  "data/tweet-economist/2021/12/1469608921581113344.json": "Only 4.1% of the Dutch population has had a covid booster jab. The blame lies with the Dutch governing style  https://t.co/LMF4sXTGWF",
  "data/tweet-economist/2021/12/1469515551131291651.json": "All parents have the right to pay to send their child to a religious school but why, Justice Kagan asked, “does the state …have to subsidise the exercise of a right?” https://t.co/pGCx9WDuKB",
  "data/tweet-economist/2021/12/1469690940566786051.json": "In South Africa, where Omicron has displaced Delta, cases are rising faster than in earlier waves. \n\nRead why it could pose a serious threat to the unvaccinated ⬇️",
  "data/tweet-economist/2021/12/1469777525136105474.json": "Russia could soon invade Ukraine, China is buzzing Taiwan’s airspace with fighter jets and Iran threatens to get a nuclear bomb. How far would America go to prevent its rivals from overturning the international order? https://t.co/x0j7ixUbjP",
  "data/tweet-economist/2021/12/1469926298646630401.json": "Ending extreme poverty is not impossible. Hypothetically, it would take $100bn to make sure everyone on earth had more than $1.90 a day. Aid and private philanthropy could cover that sum twice over, with money to spare https://t.co/1O7mdBPrec",
  "data/tweet-economist/2021/12/1469687435223347204.json": "The world’s fertility rate, which stood at 3.5 births per woman in the mid-1980s, fell to just 2.4 in 2019 https://t.co/herNZtJRQz",
  "data/tweet-economist/2021/12/1469944136417566726.json": "Fertility rates are falling at a faster rate than before. Here is a guide to why that might be—and what it could mean for the global economy https://t.co/2NmTfVoZia",
  "data/tweet-economist/2021/12/1469970289186410500.json": "In South Africa, where Omicron has displaced Delta, cases are rising faster than in earlier waves. \n\nRead why it could pose a serious threat to the unvaccinated ⬇️",
  "data/tweet-economist/2021/12/1470021385200320518.json": "In Portugal, bosses who contact employers after hours could be fined more than €9,000. But can legislation help bring working hours down? https://t.co/D5csDF7djL",
  "data/tweet-economist/2021/12/1469732483587575813.json": "In Angela Merkel’s mind, the risk of division trumped fears about democracy. Under Germany's new coalition, a stricter line will emerge https://t.co/Z0BrjspWZv",
  "data/tweet-economist/2021/12/1470009801342177292.json": "The story of Theranos is not just about Elizabeth Holmes’s guilt or innocence. It raises questions about Silicon Valley’s “fake-it-till-you-make it” culture https://t.co/Vf4qam1FHN",
  "data/tweet-economist/2021/12/1470080028226510853.json": "Fertility rates are now below replacement level—at which new births are sufficient to maintain a steady population—in Brazil, Russia, India and China. But the pace of change has happened faster than in the past https://t.co/oBKesG2dhb",
  "data/tweet-economist/2021/12/1470077247574917133.json": "The former budget minister suddenly looks like a credible challenger to Emmanuel Macron https://t.co/YvIWvckimq",
  "data/tweet-economist/2021/12/1470274413576835073.json": "Data show that areas near camps that imprisoned lots of educated “enemies of the people” are now unusually rich https://t.co/tcSXSlzvVm",
  "data/tweet-economist/2021/12/1470184325173948423.json": "Less than 10% of Japan's new legislature members are women; just three out of 21 cabinet ministers are. And only two are under 50 https://t.co/QwUqxV1l5o",
  "data/tweet-economist/2021/12/1470352191584153600.json": "Tokyo is the world’s largest city, with 37m residents in the metropolitan area and 14m in the city proper. Yet it is also one of the world’s most liveable cities https://t.co/e1X5WCzFM2",
  "data/tweet-economist/2021/12/1470140674536312842.json": "As cash falls out of use, central bankers worldwide have begun to ponder whether to replace it with a digital alternative #WorldAhead https://t.co/O1hEZUi7z2",
  "data/tweet-economist/2021/12/1470395089994321929.json": "Over the course of the pandemic she has become one of the most generous philanthropists in history https://t.co/RBNI5EGazA",
  "data/tweet-economist/2021/12/1470318120086786056.json": "The world’s fertility rate, which stood at 3.5 births per woman in the mid-1980s, fell to just 2.4 in 2019 https://t.co/76vbTORhTo",
  "data/tweet-economist/2021/12/1470338472628137988.json": "How Angela Merkel kept the EU together, yet barely left a mark https://t.co/ukWL86FnOZ",
  "data/tweet-economist/2021/12/1470242133307183114.json": "Most African countries are reluctant to rile America by hosting Chinese forces. But the Gulf of Guinea would be a logical place for Beijing to look for a base https://t.co/atiupopVJ4",
  "data/tweet-economist/2021/12/1470592142359859201.json": "Why is Putin so afraid of young people? https://t.co/NFwPytGFAV",
  "data/tweet-economist/2021/12/1470610320502755332.json": "After the second world war, Tokyo was rife with violence and slum­-like living conditions. But now the city champions punctual public transport, safe neighbourhoods and clean streets https://t.co/LWCN6nWUej",
  "data/tweet-economist/2021/12/1470295305782444036.json": "In an age of mass secularism, religion is only one reason why you can’t scrap seasonal festivities https://t.co/0cAa1env41",
  "data/tweet-economist/2021/12/1470587615384588291.json": "Nearly every attempt the Biden administration has made to mitigate the coronavirus has been undermined https://t.co/MBTqP14lIv",
  "data/tweet-economist/2021/12/1470778968785698825.json": "A covid-19 tsunami?\n\nOmicron is spreading around the world and hospitals are bracing for a new wave. \n\nClick below to see how our data tracker is tracking the new variant's spread ⬇️",
  "data/tweet-economist/2021/12/1470782390268272642.json": "The Pandora papers are the latest revelations in a rich history https://t.co/SnWZfqJuov",
  "data/tweet-economist/2021/12/1470731057045684224.json": "Could you imagine a world in which Facebook is owned and operated by its users? It’s closer than you might think, argues @ljin18 https://t.co/QKRQlfsrKr",
  "data/tweet-economist/2021/12/1470974905940389897.json": "Angela Merkel, the invisible European https://t.co/b4m5BGPUtj",
  "data/tweet-economist/2021/12/1470969895487692801.json": "China has imprisoned the most—50 at latest count https://t.co/fuE1CJk4pv",
  "data/tweet-economist/2021/12/1471031880124403712.json": "About 23m out of 38m Afghans face acute hunger. Of those, 8.7m are in a state of emergency, the second-highest category in the World Food Programme’s hierarchy of calamity https://t.co/NSAdljHZdN",
  "data/tweet-economist/2021/12/1471089636265140224.json": "In the absence of alcohol, sweet treats unite the Middle East https://t.co/YLoJs1PHhp",
  "data/tweet-economist/2021/12/1471200277491777536.json": "In an experiment in the 1970s, poor children in Jamaica were given toys and books. The impact on their outcomes in later life was remarkable. Film supported by @Mishcon_de_Reya https://t.co/Bv3ll2on0C",
  "data/tweet-economist/2021/12/1471326985800531978.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/h8NpFJy9X8",
  "data/tweet-economist/2021/12/1471345266267725832.json": "Attitudes have shifted drastically in recent years: some 65% of Japanese approve of same-sex marriage, up from around 40% in 2015 https://t.co/wOjZhb7OXU",
  "data/tweet-economist/2021/12/1470998675988094976.json": "The French Republican nominee could beat Emmanuel Macron https://t.co/sgCEbcJr54",
  "data/tweet-economist/2021/12/1471390987805241344.json": "RT @DSORennie: Quite something to watch an embassy evacuate all its diplomats from China, to ensure their personal safety. But that’s where…",
  "data/tweet-economist/2021/12/1471181615024033804.json": "It is becoming clear that Boris Johnson faces a double crisis, over his fitness to be prime minister and his ability to bring about his promised reforms https://t.co/OkPKyTP1QZ",
  "data/tweet-economist/2021/12/1471383560036753408.json": "A “vaccine-plus” approach is required for any kind of return to normality, says @trishgreenhalgh. “Everyone has to be vaccinated and have their boosters, plus we have to look at ventilating buildings, mask-wearing, tracing contacts, testing—the whole lot.” https://t.co/E7Oq6aQ94n",
  "data/tweet-economist/2021/12/1471466712100974592.json": "We have estimated which countries are best protected against Omicron, and which are particularly vulnerable.\n\nLearn what it will take to fight the new variant 👇",
  "data/tweet-economist/2021/12/1471505670411145217.json": "Over the course of the pandemic she has become one of the most generous philanthropists in history https://t.co/AoexZrQ8uo",
  "data/tweet-economist/2021/12/1471482860926349312.json": "The winner we chose acquired a competent, respected prime minister in 2021. It has a high covid vaccination rate and its economy is recovering more speedily than those of its neighbours https://t.co/zn3rUkZxGc",
  "data/tweet-economist/2021/12/1471533585660354572.json": "RT @gelliottmorris: Here is my piece on our YouGov/Economist data showing a huge dropoff in support for Biden among young people. The decre…",
  "data/tweet-economist/2021/12/1471586950683496458.json": "Gabriel Boric, a 35-year-old former student-protest leader, has a good chance of becoming Chile’s next president on Sunday  https://t.co/sQdw9gVjhC",
  "data/tweet-economist/2021/12/1471578893186486276.json": "In 2001, 40% of Sobral’s eight-year-olds could not read at all. But 14 years later, its primary-school children scored the highest grades in the country for maths and literacy   https://t.co/yU14qdPB86",
  "data/tweet-economist/2021/12/1471267423164805121.json": "For most of 2021, people who had completed a course of covid-19 vaccines were considered to be protected. Omicron is complicating that https://t.co/0Ufxugq7LX",
  "data/tweet-economist/2021/12/1471601038885019663.json": "Some contend that “Die Hard” is in fact the greatest Christmas film of all (take that, “It’s A Wonderful Life”). Our article from 2019 https://t.co/Y4cQa2ziXj",
  "data/tweet-economist/2021/12/1471719888033132545.json": "Agatha Christie’s “Murder on the Orient Express” was a footnote compared to the crime unfolding around her—the dismemberment of the vast railway network that tied the Middle East together https://t.co/nkrd667uKI",
  "data/tweet-economist/2021/12/1471724020034850822.json": "Vaccine effectiveness against symptomatic infection is restored to 75% by a booster dose https://t.co/n0SV3aXNWq",
  "data/tweet-economist/2021/12/1471820738436947976.json": "This week’s cartoon from KAL: https://t.co/xdEhKhyZrE https://t.co/jWroaSn7bu",
  "data/tweet-economist/2021/12/1471607585400934410.json": "Since Facebook changed its name to Meta in October, Google searches for “metaverse” have soared https://t.co/cAvPJkibAh",
  "data/tweet-economist/2021/12/1471782222059524097.json": "We have estimated which countries are best protected against Omicron, and which are particularly vulnerable.\n\nLearn what it will take to fight the new variant 👇",
  "data/tweet-economist/2021/12/1471917882883854338.json": "A recent study found well-fitting FFP2 masks reduced the risk of infection with covid-19 to 0.1% https://t.co/pAwfth1yOV",
  "data/tweet-economist/2021/12/1471840377799905284.json": "Tofu is much older than you might think. It was invented as a sort of “bean cheese” to rival European cheeses in China during the Tang dynasty of 618-907AD https://t.co/9qu7OibkEC",
  "data/tweet-economist/2021/12/1471760085458341898.json": "Our winner this year: Italy https://t.co/CZN9M1nHps",
  "data/tweet-economist/2021/12/1472025334119870465.json": "Gabriel Boric appears to be convincing more voters of his moderation than José Antonio Kast, a conservative Catholic who defends the legacy of Pinochet and opposes abortion and same-sex marriage  https://t.co/sdqwhZwPQ2",
  "data/tweet-economist/2021/12/1472000430750433281.json": "The battle for the metaverse will be fought with reality-bending headsets, blockchains, cryptocurrencies and mind-frazzling amounts of computing power https://t.co/s4syvS2C4S",
  "data/tweet-economist/2021/12/1471953134247460868.json": "To a casual observer, Ringo Starr might appear dispensable. But musically, nothing works without him, and as a team member he softens conflict and bridges divides https://t.co/SvWItsg5BT",
  "data/tweet-economist/2021/12/1472129602818564100.json": "In its prime, from around 1200 to 1550, Great Zimbabwe was home to about 10,000 people. Yet it is far less frequently visited, or understood, than Machu Picchu or Egypt’s pyramids. Why? https://t.co/gmRyTIBpiP",
  "data/tweet-economist/2021/12/1472095831771820036.json": "In Britain a two-dose course of the Pfizer or AstraZeneca vaccine was, at most, 20% effective against infection by Omicron, researchers found. But boosters can make a big difference https://t.co/siq6MSv0mU",
  "data/tweet-economist/2021/12/1471875112559427584.json": "Russia’s president is massing troops on Ukraine’s border—over 70,000 of them, complete with supply lines and ﬁeld hospitals. What can be done to de-escalate the situation? https://t.co/cuvq4lejxZ",
  "data/tweet-economist/2021/12/1471985067425779714.json": "The app has amassed 1bn users faster than its predecessors https://t.co/kIoaSTGnIn",
  "data/tweet-economist/2021/12/1472200498564550669.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/vhI37i3ql5",
  "data/tweet-economist/2021/12/1472229425529991169.json": "We have done some work this year, honestly https://t.co/LNwliH4w1V",
  "data/tweet-economist/2021/12/1472203261872594952.json": "The detrimental effect of virtual schooling was largest in poorer areas https://t.co/C4LmSPxsNA",
  "data/tweet-economist/2021/12/1472220986728763397.json": "Everyone should be grateful for AstraZeneca's gamble  https://t.co/wD5UWLkpQQ",
  "data/tweet-economist/2021/12/1472266420650139651.json": "Gabriel Boric, a 35-year-old former student-protest leader, has a good chance of becoming Chile’s next president on Sunday  https://t.co/x3L8kVfi29",
  "data/tweet-economist/2021/12/1472139345813454853.json": "Sir Keir Starmer is now rated the more capable prime minister, the first time a Labour leader has been ahead on this measure since 2008 https://t.co/SR9jxVgmAc",
  "data/tweet-economist/2021/12/1472332620709216258.json": "As Texas freezes under record snowfall, millions are left without electricity and heat. Ted Cruz flies his family to Cancún in balmy Mexico https://t.co/eNESTEBpOb",
  "data/tweet-economist/2021/12/1472309697281732608.json": "Winter 2025 could, with luck, be normal https://t.co/IBfFBCR47I",
  "data/tweet-economist/2021/12/1472436679369703431.json": "The debate has grown so heated that its Wikipedia page has a section entitled “Status as a Christmas film” https://t.co/q4oKW3V61G",
  "data/tweet-economist/2021/12/1472444834652766209.json": "“Bulgaria is not a poor country,” says Bulgaria’s new finance minister Assen Vassilev. It has until now simply been “brutally plundered”    https://t.co/sNHK6vBwVO",
  "data/tweet-economist/2021/12/1472339417050320902.json": "Tofu is much older than you might think. It was invented as a sort of “bean cheese” to rival European cheeses in China during the Tang dynasty of 618-907AD https://t.co/WlHdx2pQF7",
  "data/tweet-economist/2021/12/1472414060444631045.json": "At the start of the pandemic, FFP2 masks were scarce and costly. They are now cheap and easy to obtain: in Europe they can be bought for less than €1 https://t.co/y0JPZwqy8b",
  "data/tweet-economist/2021/12/1472454173283299329.json": "Nuclear power is greener than fossil fuels, but unpopular. Our “Checks and Balance” podcast asks if climate change will force America to rely more on atomic energy https://t.co/VHOdStolYA https://t.co/mWofUarKOn",
  "data/tweet-economist/2021/12/1472440735328870404.json": "North Korea’s border with China remains closed, tourism is moribund, most foreign diplomats have left and aid organisations are locked out https://t.co/S5aFLyeMXf",
  "data/tweet-economist/2021/12/1472396540140523522.json": "Lighting up is a disgusting, expensive and largely pointless habit, as many smokers will cheerfully admit. But prohibition is a step too far https://t.co/IcEW1tgqfr",
  "data/tweet-economist/2021/12/1472518847689277443.json": "The results are alarming https://t.co/6d83eNvabI",
  "data/tweet-economist/2021/12/1472415658394669058.json": "In much of Asia, 2021 was not a good year for fair, free and open societies. “Democratic recession”, the phrase used by some analysts, does not really do service, especially in so motley a region https://t.co/LG37MfCtLD",
  "data/tweet-economist/2021/12/1472537460932497409.json": "FFP2 masks are in healthy supply, and as the highly transmissible Omicron variant spreads across the world, updating guidance to recommend their wider use could be one way to help reduce transmission https://t.co/JSu9D37nHB",
  "data/tweet-economist/2021/12/1472559347150594049.json": "Covid is not done yet. But by 2023, it will no longer be a life-threatening disease for most people in the developed world https://t.co/vtEeT9UanQ",
  "data/tweet-economist/2021/12/1472490807756304388.json": "In Britain a two-dose course of the Pfizer or AstraZeneca vaccine was, at most, 20% effective against infection by Omicron, researchers found. But boosters can make a big difference https://t.co/L9Pal8EvZP",
  "data/tweet-economist/2021/12/1472391196236468226.json": "After four years as a trans man, Carol became a “detransitioner”: someone who has taken cross-sex hormones or had surgery, or both, before realising this was a mistake. This is her story https://t.co/dISTVC7c6I",
  "data/tweet-economist/2021/12/1472615485258833930.json": "There is talk of cutting Russia oﬀ from SWIFT, an international payments system. This is a big stick, but a bad idea https://t.co/mjWxX8tsOj",
  "data/tweet-economist/2021/12/1472372364675534851.json": "The election on Sunday remains wide open. A quarter of voters are undecided  https://t.co/77B6XOgXCX",
  "data/tweet-economist/2021/12/1472640139339968519.json": "Joe Biden is falling out of favour fastest with the youngest groups  https://t.co/JUSzW9O0ke",
  "data/tweet-economist/2021/12/1472356520520294405.json": "The city of Sobral has a dogged willingness to implement what the evidence says works  https://t.co/xu1ytlwsK9",
  "data/tweet-economist/2021/12/1472684191506653188.json": "Her subtle performance in “Mare of Easttown” illustrates the gulf between superb actors and excellent ones https://t.co/yf2HLxVlPA",
  "data/tweet-economist/2021/12/1472515060933267463.json": "Iran produces over 90% of the world’s supply of saffron. But traders of the spice have been hit hard by American sanctions https://t.co/yYp3EoryVC",
  "data/tweet-economist/2021/12/1472766730405613570.json": "Liberal societies tolerate all sorts of evils on the grounds that the state’s business is to regulate for safety and to minimise harm, not to tell people how to live their lives. Smoking should be no different https://t.co/6GMyv1K1XU",
  "data/tweet-economist/2021/12/1472812231784124418.json": "It will be a long time before such procedures become routine https://t.co/hLJdzXPM7p",
  "data/tweet-economist/2021/12/1472642990783016965.json": "If global temperatures rise 3°C above pre-industrial levels, the results would be catastrophic. It’s an entirely plausible scenario, and this film shows you what it would look like https://t.co/yHYTTcPCrD",
  "data/tweet-economist/2021/12/1472785141550530560.json": "One scholar has made it his life’s work to show how Great Zimbabwe was the foremost example of a pre-colonial sub-Saharan African state https://t.co/vpKtKaidSM",
  "data/tweet-economist/2021/12/1472633344529780743.json": "Salaries have not been paid in six months at one hospital north of Kabul, leaving nurses without even the bus fare to get to work. There is no money for medical supplies or food https://t.co/LFujpd0ngZ",
  "data/tweet-economist/2021/12/1472733547530182657.json": "It is up to eight times more likely than other variants to infect someone who has previously been infected. Urgent action is needed https://t.co/f3TpwwMibD",
  "data/tweet-economist/2021/12/1472821216130088960.json": "After 60 days boosters may be 80-86% effective against severe covid (and need for hospital admission) in an Omicron wave, research suggests. That is encouragingly high but lower than the 97% efficacy for Delta https://t.co/Rz6GGZdz3C",
  "data/tweet-economist/2021/12/1472869416165646336.json": "Some contend that “Die Hard” is in fact the greatest Christmas film of all (take that, “It’s A Wonderful Life”). Our article from 2019 https://t.co/RgeExuKygs",
  "data/tweet-economist/2021/12/1472974843184394254.json": "A decade ago Gabriel Boric was a student leader rallying together one of Chile’s biggest protest movements. He will now become, at 35, the country’s youngest ever head of state https://t.co/sIqTpyqyL1",
  "data/tweet-economist/2021/12/1472923254016851980.json": "Too many modern flats are samey and soulless. A new book celebrates the architects coming up with creative solutions for our overcrowded cities https://t.co/XJukt2Dxpy",
  "data/tweet-economist/2021/12/1473042537938141190.json": "Covid is not done yet. But by 2023, it will no longer be a life-threatening disease for most people in the developed world https://t.co/NWWFnCzuKW",
  "data/tweet-economist/2021/12/1473058649836773377.json": "Today dining out is seen as an indulgence, but it was the cheapest way to eat for most of human history https://t.co/NtlABhw40D",
  "data/tweet-economist/2021/12/1473183506079567879.json": "Oppressing women not only hurts women; it also hurts men https://t.co/v4TufCnOcZ",
  "data/tweet-economist/2021/12/1473124002529005576.json": "The appeal of American institutions and society to people around the world “has been greatly diminished”, he wrote for The Economist in August https://t.co/zWkc3lCQmC",
  "data/tweet-economist/2021/12/1473173552849461249.json": "The Pandora Papers leak is the latest to uncover the offshore dealings of the elite https://t.co/FPFt4Qcxa3",
  "data/tweet-economist/2021/12/1473280102721011718.json": "A recent study found well-fitting FFP2 masks reduced the risk of infection with covid-19 to 0.1% https://t.co/RghuDg2kpu",
  "data/tweet-economist/2021/12/1473386058318557194.json": "Ukraine needs to make itself indigestible for an invading Russian army. The West should supply it with more ﬁnancial aid and defensive weapons https://t.co/rZy9sJsyM4",
  "data/tweet-economist/2021/12/1473449976269361157.json": "The battle for the metaverse will be fought with reality-bending headsets, blockchains, cryptocurrencies and mind-frazzling amounts of computing power https://t.co/ElQlIGZL6Y",
  "data/tweet-economist/2021/12/1473463964717797381.json": "Joe Biden is falling out of favour fastest with the youngest groups  https://t.co/a0dUsB8XXN",
  "data/tweet-economist/2021/12/1473552155827130370.json": "Facing a crisis of his own making, Recep Tayyip Erdogan has taken a dramatic step to save the lira. But his new scheme carries risks https://t.co/VCizLSjYkN",
  "data/tweet-economist/2021/12/1473602096909987840.json": "About 23m out of 38m Afghans face acute hunger. Of those, 8.7m are in a state of emergency, the second-highest category in the World Food Programme’s hierarchy of calamity https://t.co/HfIddvki8b",
  "data/tweet-economist/2021/12/1473675455182028801.json": "A decade ago Gabriel Boric was a student leader rallying together one of Chile’s biggest protest movements. He will now become, at 35, the country’s youngest ever head of state https://t.co/F57mbyPoKX",
  "data/tweet-economist/2021/12/1473570269163921419.json": "The pandemic is like a doorway. Once you pass through, there is no going back https://t.co/iuDdf3lWo9",
  "data/tweet-economist/2021/12/1473769591604191239.json": "In the absence of alcohol, sweet treats unite the Middle East https://t.co/LlyF27AMKT",
  "data/tweet-economist/2021/12/1473729817002586119.json": "Gabriel Boric's victory is part of an anti-incumbent trend in Latin America https://t.co/CvSpabPXew",
  "data/tweet-economist/2021/12/1473730182313881601.json": "In an experiment in the 1970s, poor children in Jamaica were given toys and books. The impact on their outcomes in later life was remarkable. Film supported by @Mishcon_de_Reya https://t.co/y0oMX1FDHE https://t.co/m9ZhORHUgm",
  "data/tweet-economist/2021/12/1473886939845640194.json": "The inoculations are conducted via royal jelly https://t.co/PdaJt99buq",
  "data/tweet-economist/2021/12/1473852627020615680.json": "The monarchy is funded by a mix of government largesse and private assets https://t.co/vbIVyq8NHB",
  "data/tweet-economist/2021/12/1473943385178263555.json": "Analysts expect Turkey’s official inflation rate to reach up to 50% in the first half of 2022. Recep Tayyip Erdogan’s new scheme risks making things worse https://t.co/ODfdf4krba",
  "data/tweet-economist/2021/12/1474021415007498241.json": "New studies from England, Scotland and South Africa all point in the same direction: Omicron appears to be less severe than Delta https://t.co/HVE37RA8p7",
  "data/tweet-economist/2021/12/1474034490871881735.json": "Young people voted for Gabriel Boric in droves. The centre-left lined up behind him. More surprisingly, so did voters in the north https://t.co/VkXFPVqL11",
  "data/tweet-economist/2021/12/1473930956683755524.json": "Can a welfare state be both generous and efficient? https://t.co/fY0hzGuaaF",
  "data/tweet-economist/2021/12/1474090871301845000.json": "A trip down meme-ry lane https://t.co/toPap6tUY2",
  "data/tweet-economist/2021/12/1474038743724171266.json": "Gabriel Boric's victory is part of an anti-incumbent trend in Latin America https://t.co/45pouL6g0K",
  "data/tweet-economist/2021/12/1474013682690572293.json": "“The best way to rein in big tech companies is through competition, not regulation,” argue @cdixon and @packyM https://t.co/ME2SxmRica",
  "data/tweet-economist/2021/12/1474222329328717829.json": "The app has amassed 1bn users faster than its predecessors https://t.co/UhudMBYrO9",
  "data/tweet-economist/2021/12/1474172373410762754.json": "The relationship between the world’s superpower and its Asian challenger has deteriorated in a manner that suggests few are paying heed to history https://t.co/pW8QradZbn",
  "data/tweet-economist/2021/12/1474110114818928651.json": "Some Hong Kong parents are determined to raise their children with ideas the regime considers so dangerous they are punishable with life in prison—it is a risky choice https://t.co/UGSlW0Ot2O",
  "data/tweet-economist/2021/12/1474194905090166788.json": "“The United States has torn itself apart in its counterinsurgent efforts,” he wrote in The Economist in August https://t.co/4XY56fvgh1",
  "data/tweet-economist/2021/12/1474129202324688899.json": "Xi Jinping will mark his first decade as China’s supreme leader in 2022. How much longer does he intend to stay in office? https://t.co/4ahhXznZuF",
  "data/tweet-economist/2021/12/1474391478143229952.json": "Research in England found that people infected with Omicron are 40% less likely to stay overnight at a hospital than those with Delta https://t.co/ESLTf0YXwE",
  "data/tweet-economist/2021/12/1474371079510634496.json": "Several new studies based on early data give reason to be hopeful about the Omicron variant  https://t.co/pRfH6CwdK9",
  "data/tweet-economist/2021/12/1474347833004331012.json": "So long as he is in charge, Russia will remain a danger to its neighbours https://t.co/4jEDcvKkCA",
  "data/tweet-economist/2021/12/1474440702956392452.json": "The debate has grown so heated that its Wikipedia page has a section entitled “Status as a Christmas film” https://t.co/6IU09Kd4Fd",
  "data/tweet-economist/2021/12/1474570681216077826.json": "“Squid Game” has shown that, like love and money, complaints about inequality have no language https://t.co/TusoP0P9Bu",
  "data/tweet-economist/2021/12/1474580221869408258.json": "Until the 18th century elites viewed public spaces as dirty and dangerous, or as an arena of spectacle. That changed when capitalism took off https://t.co/z52Sfc0Llx",
  "data/tweet-economist/2021/12/1474575467864891393.json": "If Gabriel Boric bungles the difficult transition ahead and succumbs to pressures for unsustainable spending, he may end up making history again—and not in the way he hopes\nhttps://t.co/HL93KG3MfS",
  "data/tweet-economist/2021/12/1474628445300838400.json": "In the absence of alcohol, sweet treats unite the Middle East https://t.co/mToJj5KXKD",
  "data/tweet-economist/2021/12/1474510133183004676.json": "After four years as a trans man, Carol became a “detransitioner”: someone who has taken cross-sex hormones or had surgery, or both, before realising this was a mistake. This is her story https://t.co/gmVN4zN2tK",
  "data/tweet-economist/2021/12/1474617812345888768.json": "As the oil age draws to a close, there are signs that the region is rediscovering the value of its old connections https://t.co/3xYIGhioMd",
  "data/tweet-economist/2021/12/1474689364613644292.json": "It is because pronunciation, stress and rhythm are rarely taught well https://t.co/EZIBosWAU4",
  "data/tweet-economist/2021/12/1474636600835551233.json": "Why studying Julius Caesar may help us understand our own age better https://t.co/yz1xrsSSDl",
  "data/tweet-economist/2021/12/1474696524047212546.json": "Like many historical sites, Great Zimbabwe is cloaked in myth. Our interactive allows you to explore one of Africa’s former city-states https://t.co/CgM9UlauWS https://t.co/RRcqS2jsjJ",
  "data/tweet-economist/2021/12/1474755175634149383.json": "We have done some work this year, honestly https://t.co/wrS7xyMD6S",
  "data/tweet-economist/2021/12/1474653468136820738.json": "Meet the people who use charts, planners and performance reviews to manage their love lives https://t.co/9mybrYF5re",
  "data/tweet-economist/2021/12/1474804159513772033.json": "Over the course of the pandemic she has become one of the most generous philanthropists in history https://t.co/sf2XEModbc",
  "data/tweet-economist/2021/12/1474812708503670784.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/MvwtChoVJd",
  "data/tweet-economist/2021/12/1474833773015744512.json": "Three books explain why it matters—and can easily be lost https://t.co/xrbUejFIhQ",
  "data/tweet-economist/2021/12/1474838494765850624.json": "His “Tractatus Logico-Philosophicus” was revolutionary in its naivety https://t.co/8won1xvLxF",
  "data/tweet-economist/2021/12/1474701075047460867.json": "Here’s what our science and technology correspondents are keeping an eye out for next year https://t.co/LY85yytlNG",
  "data/tweet-economist/2021/12/1474855893506342916.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/9jUtJVIWZu",
  "data/tweet-economist/2021/12/1474844404150067213.json": "Touch is the only sense crucial to humans’ survival, as our article from earlier this year explains https://t.co/LlAT2hFkLY",
  "data/tweet-economist/2021/12/1474858503504375821.json": "Her subtle performance in “Mare of Easttown” illustrates the gulf between superb actors and excellent ones https://t.co/5r3hpDnNJv",
  "data/tweet-economist/2021/12/1474863502963662850.json": "You don’t have to like the Roys to love them https://t.co/l6VxS1LgIj",
  "data/tweet-economist/2021/12/1474882829813260296.json": "Stuck for something to watch? Try our recommendations https://t.co/Ld0YrzdwZC",
  "data/tweet-economist/2021/12/1474902043475255299.json": "Why 2022 will be a pivotal year for the world economy https://t.co/wigSqdAz1K",
  "data/tweet-economist/2021/12/1474978348422074369.json": "In the old days Muslims were quite tolerant of homosexuality https://t.co/c4SxgvTyJ6",
  "data/tweet-economist/2021/12/1474991324478808065.json": "Analysts expect Turkey’s official inflation rate to reach up to 50% in the first half of 2022. Recep Tayyip Erdogan’s new scheme risks making things worse https://t.co/tL1kNMkxH1",
  "data/tweet-economist/2021/12/1474964426436530177.json": "Millions of devotees continue to be in thrall to self-professed saints despite their dodgy track records https://t.co/3TMTmScE59",
  "data/tweet-economist/2021/12/1474982564473581570.json": "Liberal societies tolerate all sorts of evils on the grounds that the state’s business is to regulate for safety and to minimise harm, not to tell people how to live their lives. Smoking should be no different https://t.co/eR32BKaKSP",
  "data/tweet-economist/2021/12/1475005983416070147.json": "Too many modern flats are samey and soulless. A new book celebrates the architects coming up with creative solutions for our overcrowded cities https://t.co/K6UNOtLyuH",
  "data/tweet-economist/2021/12/1474969247596040198.json": "A single case can lead to city-wide testing and lockdown in China. But many people there like being covid-free #WorldAhead https://t.co/X5jftVszE4",
  "data/tweet-economist/2021/12/1474974128075689989.json": "And Russians across the country are feeling the heat https://t.co/uTk8FjY14b",
  "data/tweet-economist/2021/12/1475015036234047488.json": "A varied continent with good WiFi and few internal borders https://t.co/KJKn2mK2S2",
  "data/tweet-economist/2021/12/1475079068576108549.json": "Covid is not done yet. But by 2023, it will no longer be a life-threatening disease for most people in the developed world https://t.co/SLMrSY9zSF",
  "data/tweet-economist/2021/12/1475082910654947328.json": "2022 will be a year of new styles of working, democracy v autocracy and travel trouble. Take a look at our predictions for the coming year #WorldAhead https://t.co/XOlf34nqCG",
  "data/tweet-economist/2021/12/1475086744722853890.json": "In much of Asia, 2021 was not a good year for fair, free and open societies. “Democratic recession”, the phrase used by some analysts, does not really do service, especially in so motley a region https://t.co/8ZzmWDtGmT",
  "data/tweet-economist/2021/12/1474381205625782287.json": "Although existing vaccines may be able to suppress the virus, new ones are needed to cut transmission https://t.co/he1KhnxJUb",
  "data/tweet-economist/2021/12/1475117077329502210.json": "When one of the world’s largest container ships got wedged across the Suez canal, a tiny digger was dispatched to excavate it. This became a metaphor for the enormity of the pandemic https://t.co/HQCPqSCDmY",
  "data/tweet-economist/2021/12/1475028491137699844.json": "Great Zimbabwe was central to an African network of trade and knowledge. The remains visible today were the heart of a vibrant city-state \nhttps://t.co/FzscjpkyEW",
  "data/tweet-economist/2021/12/1475155277729128462.json": "A recent study found well-fitting FFP2 masks reduced the risk of infection with covid-19 to 0.1% https://t.co/OV1Kr8B4J7",
  "data/tweet-economist/2021/12/1475161941450661896.json": "We look back at the life of a man who spoke up for the voiceless and preached non-violent resistance against apartheid https://t.co/Wa0YBXRFBo",
  "data/tweet-economist/2021/12/1475170880649150481.json": "That was long before Christopher Columbus set sail https://t.co/9MI1kJnUZH",
  "data/tweet-economist/2021/12/1475273175495852034.json": "He faced constant racial slights while growing up. Yet he learned early on that not everyone was bigoted—and that a man of God could also be a man of action https://t.co/nHkMseAz6l",
  "data/tweet-economist/2021/12/1475189331837034502.json": "Resistance to a female or black 007 mistakes the kind of character that James Bond is https://t.co/67f3Pmfhl5",
  "data/tweet-economist/2021/12/1475292425233084416.json": "One source of inefficiency is the time spent in meetings. The answer is simple: don’t call as many, and keep them short, as our article from June explains https://t.co/vSZixaZXpO",
  "data/tweet-economist/2021/12/1475099462158671876.json": "Expect flying taxis, 3D-printed houses and even virtual influencers #WorldAhead https://t.co/7pi4HycfNV",
  "data/tweet-economist/2021/12/1475175578688970752.json": "Our 51 weekly editions in 2021 have carried a total of 71 cover images. Not surprisingly, covid-19 was often impossible to ignore https://t.co/q1HbigqAEG",
  "data/tweet-economist/2021/12/1475407713895133190.json": "The pandemic has only emboldened authoritarian tendencies in the region. However, parliamentary systems are embedded in enough Asian countries to allow democratic consolidation to reassert itself after strongman rule https://t.co/SXZFAtNEMd",
  "data/tweet-economist/2021/12/1475373376269127683.json": "He spoke up for the voiceless. Even as others picked up weapons, he preached non-violent resistance. This was a hard sell, especially to the angry young men in black townships https://t.co/Ja5OYJjdMu",
  "data/tweet-economist/2021/12/1475368446812643331.json": "Vladimir Putin did not attack Ukraine in order to honour or recreate an empire, whether Russian or Soviet. He attacked it to protect his own rule https://t.co/thjB7jLrMK",
  "data/tweet-economist/2021/12/1475301240724762629.json": "America “will have to devote most of its attention, energy and resources to contesting Chinese power, at the expense of its interests elsewhere”, the political scientist wrote in August https://t.co/8n6nONx3Yi",
  "data/tweet-economist/2021/12/1475240031954558977.json": "Great Zimbabwe was one of Africa’s most vibrant city-states. It carries lessons for the African continent today \n\nhttps://t.co/DubIQCLxAJ",
  "data/tweet-economist/2021/12/1475196947225063427.json": "Winter 2025 could, with luck, be normal https://t.co/cmyOZ1Ca45",
  "data/tweet-economist/2021/12/1475449851940855808.json": "“We believe that in 15 years, one-third of all newly approved drugs will be based on mRNA,” say the founders of @BioNTech_Group in The #WorldAhead 2022 https://t.co/2AGxK0Mh7b",
  "data/tweet-economist/2021/12/1475425557512916992.json": "A new telescope and an upgraded Large Hadron Collider will tackle questions big and small in 2022 https://t.co/qwGe1rO4VT",
  "data/tweet-economist/2021/12/1475491461588209664.json": "America and Europe should present a united front. For starters, Germany should not approve the Nord Stream 2 pipeline https://t.co/Kh4TRmC1z1",
  "data/tweet-economist/2021/12/1475558648113946627.json": "No one could improve on his encapsulation of the anti-apartheid struggle: “All we are asking you to do is to recognise that we are humans, too” https://t.co/rpJZkiZtgL",
  "data/tweet-economist/2021/12/1475632257163476995.json": "America’s extreme dominance in military power is “madness” and “a substantial contribution to environmental destruction”, he wrote for The Economist in September https://t.co/ItX7vGzT8l",
  "data/tweet-economist/2021/12/1475709528142495744.json": "We look back at the life of a man who spoke up for the voiceless and preached non-violent resistance against apartheid https://t.co/X9BcNtpeQJ",
  "data/tweet-economist/2021/12/1475546096608948227.json": "But the difference only emerges when the children are teenagers https://t.co/TKx6Im0r8f",
  "data/tweet-economist/2021/12/1475421420465401856.json": "Horseshoe crabs predate the dinosaurs, but climate change is now threatening the survival of this keystone species. Could satellite-tagging technology help save them? https://t.co/eKr4zoNeGr https://t.co/qWL7PLeiW5",
  "data/tweet-economist/2021/12/1475732206396051456.json": "In 2022 critics will grow “ever more indignant and vocal”, argues author @BarnabyPhillips #WorldAhead https://t.co/8evz6yKT95",
  "data/tweet-economist/2021/12/1475723372239720451.json": "A short history of defeat https://t.co/xKEToyFZDb",
  "data/tweet-economist/2021/12/1475759750310731781.json": "The pandemic is like a doorway. Once you pass through, there is no going back https://t.co/Pco8283aa4",
  "data/tweet-economist/2021/12/1475553770411069446.json": "Our cover labelling AMLO as “Mexico’s false messiah” gave Mexican Twitter room to showcase its “true messiahs”, from Guillermo Del Toro to the not-so-humble taco https://t.co/rw9AI2Gr6L",
  "data/tweet-economist/2021/12/1475542272804638732.json": "While Americans fight to shore up their democracy, Xi Jinping will try to argue that China’s autocracy is more effective. We explore how the rivalry between America and China will play out in 2022. Film supported by @Teneo #WorldAhead https://t.co/zoXMa1CfUE",
  "data/tweet-economist/2021/12/1475827670868975618.json": "Memorial, Russia’s oldest human rights group has been ordered to close by the Supreme Court. Our briefing from November explains how Vladimir Putin’s autocracy has become a dictatorship https://t.co/oeBWqLUMSP",
  "data/tweet-economist/2021/12/1475861655733129219.json": "Male Regent honeyeaters can no longer court females successfully https://t.co/OvFBOyK6xk",
  "data/tweet-economist/2021/12/1475714505397223427.json": "Gurbanguly Berdymukhamedov wins elections with 98% of the vote and ruthlessly suppresses dissent https://t.co/XOhASsQR1u",
  "data/tweet-economist/2021/12/1475947349734219777.json": "He faced constant racial slights while growing up. Yet he learned early on that not everyone was bigoted—and that a man of God could also be a man of action https://t.co/7xQwLjiUum",
  "data/tweet-economist/2021/12/1475989582567071751.json": "They don’t need soil or sunlight https://t.co/vU8K9Mm1R3",
  "data/tweet-economist/2021/12/1476065777988116488.json": "Recep Tayyip Erdogan’s scheme to save Turkey’s currency only heightens the risks https://t.co/UttZoyqYtW",
  "data/tweet-economist/2021/12/1476074329066643456.json": "It is easy for the brain to develop tunnel vision when it is working hard https://t.co/UcfzaPi4k9",
  "data/tweet-economist/2021/12/1475548800626446343.json": "The gulf between China and America has been growing for some time. Here’s why it will yawn shockingly wider in 2022 #WorldAhead https://t.co/5oIpqraUgZ",
  "data/tweet-economist/2021/12/1476219633988427779.json": "Americans fear that their democracy is under threat. Renewal will not happen for as long as Donald Trump remains the Republican leader. But the party can change. Our cover this week https://t.co/iLROqsBqnr https://t.co/N3NHMHYai3",
  "data/tweet-economist/2021/12/1476217078847791104.json": "“The very fact of wearing it made me feel inferior. To leave the house, when I became a teenager about a decade ago, I had to transform myself into a thing,” writes Sultana https://t.co/2aP6NbfVQF",
  "data/tweet-economist/2021/12/1476277605104074752.json": "Sultana, who left Afghanistan five years ago, “hated wearing a burqa”. She shares why she fears for Afghan women under Taliban rule today https://t.co/aPQaG5AHje",
  "data/tweet-economist/2021/12/1476244042035994632.json": "RT @gadyepstein: I went through Xi’s 2014 speeches in Xinjiang and other secret party documents to learn how an authoritarian regime talks…",
  "data/tweet-economist/2021/12/1476271560549974019.json": "KAL’s cartoon https://t.co/lN5ZnD9lsC",
  "data/tweet-economist/2021/12/1476269068558733325.json": "Since September, Recep Tayyip Erdogan has been trying to defy the laws of economics, over which he has no veto https://t.co/S2juNr7JCB",
  "data/tweet-economist/2021/12/1476391950664314880.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/Gz11u9KOFM",
  "data/tweet-economist/2021/12/1476337750240636929.json": "As people in rich countries work longer hours, marry later and spend more time with their children than their friends research suggests loneliness is increasing https://t.co/JzV54NeMea",
  "data/tweet-economist/2021/12/1476479752009617408.json": "This week’s cartoon from KAL: https://t.co/0JrWgLucDq https://t.co/G2eZhciNwS",
  "data/tweet-economist/2021/12/1476368502130937865.json": "Its rate of strokes fell during a period when the country began eating a bit of meat https://t.co/nyXmKYGPzV",
  "data/tweet-economist/2021/12/1476251932033523716.json": "Boris Johnson’s Conservative Party promised that leaving the EU would kickstart a national renewal. After a year outside the EU’s trading arrangements, however, the British government is adrift https://t.co/b79vtL6j4s",
  "data/tweet-economist/2021/12/1476445164361207808.json": "He rebutted the sinister slogans of apartheid with simple truths, plainly expressed. But he was tear-gassed and arrested in the process—and it was not only supporters of apartheid who criticised him https://t.co/nYAJp7gkym",
  "data/tweet-economist/2021/12/1476437218478764033.json": "The biggest carbon emitter added coal-fired capacity in 2020, offsetting declines elsewhere https://t.co/aBYarlZfBs",
  "data/tweet-economist/2021/12/1476504109104742402.json": "The rights of Afghan women are suffering under Taliban rule, she writes: “Female friends tell me that with no school and no future to look forward to, life has been reduced to waiting for death” https://t.co/UV7fXNyQjo",
  "data/tweet-economist/2021/12/1476384911363874821.json": "When Gabriel Boric is inaugurated in March, he will be, at 36, Chile’s youngest president in two centuries https://t.co/SSxwx7SNo7",
  "data/tweet-economist/2021/12/1475969744889077761.json": "Strict quarantine requirements in China may persist for much, if not all, of next year https://t.co/zO775K1f33",
  "data/tweet-economist/2021/12/1476521369378639874.json": "What will 2022 bring? Here are our predictions for the new year 👇 #WorldAhead https://t.co/ZIEtoJyfMg",
  "data/tweet-economist/2021/12/1476543478838571011.json": "In 1990, 55% of American men reported having at least six close friends; today only 27% do, according to a recent survey https://t.co/5gCZb6C9F0",
  "data/tweet-economist/2021/12/1476499167954489346.json": "People spend more, take more risks—and demand more of politicians https://t.co/88LnMV3jL9",
  "data/tweet-economist/2021/12/1476462075962609664.json": "Unless President Erdogan gets the economy back on track, Turks will pay dearly for his s spending spree  https://t.co/CJ84pn1Xi9",
  "data/tweet-economist/2021/12/1476641780871401477.json": "You can find Bernie Sanders on a bench with Forrest Gump, on the flight deck of the starship Enterprise and just behind Jesus at the Last Supper https://t.co/vy0lwz8LS7",
  "data/tweet-economist/2021/12/1476552254262030347.json": "RT @duncanrobinson: Final column. Bye!  https://t.co/33t7r6WSSQ",
  "data/tweet-economist/2021/12/1476539332173484034.json": "Banks, gangsters and the strange resurgence of cash https://t.co/ySoHh3zAvm",
  "data/tweet-economist/2021/12/1476620331397828610.json": "“It feels as if the whole of Afghanistan wears that heavy burqa which I hated so much, and that, underneath it, all Afghan women are choking,” writes Sultana https://t.co/toFWFsfy4C",
  "data/tweet-economist/2021/12/1476766583099904003.json": "South Korea, the United Arab Emirates and Israel are among the countries planning to get in on the action. The most ambitious efforts, though, belong to America  https://t.co/LjsBrhiaxk"
}