{
  "data/tweet-nytimes/2021/9/1432953612683075584.json": "President Biden rejected criticism of his decision to end the U.S.'s war in Afghanistan, hailing what he called the “extraordinary success” of the evacuation of Kabul. He also declared an end to the U.S. using military power “to remake other countries.” https://t.co/TjAord8jUn",
  "data/tweet-nytimes/2021/9/1432946386920775683.json": "At least 180 Covid infections in three states have been traced to an Illinois church camp for teenagers and an affiliated men’s conference that did not require attendees to be vaccinated or tested. https://t.co/gAuYhjhd8M",
  "data/tweet-nytimes/2021/9/1432946740387328001.json": "The Supreme Court did not take action on a request to block a Texas law prohibiting most abortions after about six weeks of pregnancy, allowing the most restrictive abortion law in the U.S. to go into effect. https://t.co/FdaNpIafcx",
  "data/tweet-nytimes/2021/9/1433033181255634950.json": "An arrest warrant was issued for a man who angrily confronted an NBC News reporter covering Hurricane Ida.\n\nBenjamin Eugene Dagley will be charged with simple assault, disturbing the peace and violating an emergency curfew, the police said.\nhttps://t.co/f5J0LFHmOS",
  "data/tweet-nytimes/2021/9/1433014027882483712.json": "President Biden rejected criticism of his decision to end the U.S.'s war in Afghanistan, hailing what he called the “extraordinary success” of the evacuation of Kabul. He also declared an end to the U.S. using military power “to remake other countries.” https://t.co/JyN07VhXop",
  "data/tweet-nytimes/2021/9/1432878392156819463.json": "A Florida real estate developer was arrested for his role in a scheme to bilk $25 million from the family of Representative Matt Gaetz in exchange for a purported presidential pardon that would have ended a sex trafficking investigation into Gaetz. https://t.co/vU3AcHKKzG",
  "data/tweet-nytimes/2021/9/1433079720522944512.json": "Private individuals in Texas can now sue anyone who performs or aids banned abortions, including doctors and even an Uber driver taking a patient to an abortion clinic. Plaintiffs, who need not have any connection to the matter, can win $10,000 in damages. https://t.co/YBmasyF6lR",
  "data/tweet-nytimes/2021/9/1433048265105227792.json": "Before Naomi Osaka became one of the best tennis players in the world, she got her start on the free and inclusive courts in a city park in Jamaica, Queens.\n\nNow she has overseen a refurbishment of the facility to inspire the next generation.\nhttps://t.co/ZWdXgkxmOf https://t.co/VgqjUV5pNs",
  "data/tweet-nytimes/2021/9/1433072165356716039.json": "Piers Morgan was cleared by Britain’s communications regulator after he criticized Meghan, the Duchess of Sussex, after her interview with Oprah Winfrey.\n\nHe was “entitled to say he disbelieved” her accusations against the royal family, the regulator said.\nhttps://t.co/wR5Fj4eJKe",
  "data/tweet-nytimes/2021/9/1433108207933837313.json": "Breaking News: Three police officers and two paramedics will face criminal charges in the 2019 death of Elijah McClain. The young Black man had been walking home when he was stopped by the police, put into a chokehold and injected with an anesthetic. https://t.co/yoE8HaYNbz",
  "data/tweet-nytimes/2021/9/1433087273722130433.json": "The Texas abortion law, known as Senate Bill 8, was drafted to make it difficult to challenge in court. It bars state officials from enforcing it, and instead deputizes private individuals to sue anyone who performs the procedure or “aids and abets” it. https://t.co/fjMlIlZn8y https://t.co/kxpHgvL99H",
  "data/tweet-nytimes/2021/9/1433097402517438464.json": "Arizona banned school mask mandates. Now, only weeks after classes resumed, coronavirus cases are forcing thousands of children and teachers into quarantine. In one suburb, so many drivers are sick that school buses are running 90 minutes late. https://t.co/K5P3L9oaHt",
  "data/tweet-nytimes/2021/9/1433187888867516416.json": "Breaking News: Joe Rogan, the podcasting giant who has been dismissive of Covid vaccines, tested positive for the coronavirus after returning from a series of shows in Florida. https://t.co/N9GkQI1jbh",
  "data/tweet-nytimes/2021/9/1433170053713862661.json": "Breaking News: Purdue Pharma, OxyContin’s maker, was dissolved in a settlement requiring its owners to pay billions while ending a myriad of opioid-related lawsuits. https://t.co/8SPSAcy4x3",
  "data/tweet-nytimes/2021/9/1433205539396325376.json": "Ivermectin, an anti-parasitic drug commonly used for livestock, should not be taken to treat or prevent Covid-19, according to the FDA. https://t.co/ZGCr3LoWMF https://t.co/JfyOzs4W7n",
  "data/tweet-nytimes/2021/9/1433276907794010113.json": "Breaking News: Flooding has all but shut down New York's subway. New Jersey rail service is mostly suspended, and flights are halted at Newark Airport. Here's the latest. https://t.co/F0K3qvwxZS",
  "data/tweet-nytimes/2021/9/1433235753446825985.json": "People who experience breakthrough infections of the coronavirus after being fully vaccinated are about 50% less likely to experience long Covid than are unvaccinated people who catch the virus, researchers said in a large new report on British adults. https://t.co/giH4E9Oafb",
  "data/tweet-nytimes/2021/9/1433136591506128902.json": "News Analysis: Dozens of prominent Republicans who praised Donald Trump’s deal to pull American troops out of Afghanistan have sharply reversed themselves — assailing President Biden even as he keeps a promise that Trump had made. https://t.co/MN6b3vPYeG",
  "data/tweet-nytimes/2021/9/1433284800463261702.json": "Breaking News: The Supreme Court let stand a Texas ban on most abortions after about six weeks of pregnancy. It is the most restrictive abortion law in the U.S. https://t.co/1tJOjq3ppz",
  "data/tweet-nytimes/2021/9/1433346619991334913.json": "Mikis Theodorakis, the renowned Greek composer and Marxist firebrand, has died at 96. He waged a war of words and music against a military junta that banned his work and imprisoned him during its rule of Greece. https://t.co/uo8yZr8oYM",
  "data/tweet-nytimes/2021/9/1433175346141138950.json": "Fighters from Ethiopia’s northern Tigray region destroyed villages and emptied food stores holding U.S. government aid, the top American aid official in the country said, as the ruinous civil war there spreads into new areas and hunger rises. https://t.co/Ilnq0NXHPm",
  "data/tweet-nytimes/2021/9/1433369133270372357.json": "Joe Rogan, the podcasting giant who has been dismissive of Covid vaccines, tested positive for the coronavirus after returning from a series of shows in Florida. https://t.co/iPVgHb0PeA",
  "data/tweet-nytimes/2021/9/1433420713566822401.json": "Flood waters overwhelmed New York City’s transit system on Wednesday, causing widespread disruption after heavy rainfall hit the city.\nhttps://t.co/eyYlg9CriO https://t.co/2F2LhH6Afz",
  "data/tweet-nytimes/2021/9/1433432110996492293.json": "The New York area awoke to a flood-ravaged landscape after the remnants of Hurricane Ida brought record rain, leaving a trail of death and damage across several states.\n\nFollow our updates. https://t.co/qRqb9S4KmB https://t.co/J072BpN7HI",
  "data/tweet-nytimes/2021/9/1433452189284978696.json": "Watch: The New York area was under a state of emergency on Thursday after the remnants of Hurricane Ida led to at least 14 deaths and disrupted subway service. Across the city, New Yorkers documented the scene as flood waters overwhelmed buses and subways. https://t.co/spVsdgF0XX https://t.co/r2vg2aDRVg",
  "data/tweet-nytimes/2021/9/1433394306086227971.json": "House Democrats leading the investigation into the Jan. 6 attack on the Capitol named Rep. Liz Cheney of Wyoming as the committee’s vice chairwoman. She has been a vocal critic of former President Donald Trump’s lies about the 2020 election. https://t.co/dzjOA6vSto",
  "data/tweet-nytimes/2021/9/1433505076992217094.json": "Adult Swim, which turns 20 on Thursday, was built on lo-fi animation techniques that led to out-of-the-box shows such as \"Aqua Teen Hunger Force\" and \"Space Ghost Coast to Coast.\" What started as an ambitious experiment turned into an enduring legacy. https://t.co/0faoxgtlTe",
  "data/tweet-nytimes/2021/9/1433530373003259905.json": "\"Seeing this guy push his bicycle past these people in Mercedes to deliver Chinese food just turned my stomach,\" Johnny Miller, a freelance photographer, said. \"Some of us have the privilege to not work during a disaster and some of us don’t.\" https://t.co/suosyNaqfn",
  "data/tweet-nytimes/2021/9/1433533952913027073.json": "An Ohio man was arrested on Thursday, three days after he angrily confronted an NBC News reporter who was live on TV, covering Hurricane Ida in Gulfport, Mississippi, the police said. https://t.co/rThY6Fkibe",
  "data/tweet-nytimes/2021/9/1433547799359102982.json": "The remnants of Hurricane Ida caused flash flooding in and around New York and left at least 29 people dead. Here's what it looked like around the region. https://t.co/GuQoe40p93 https://t.co/vdUTGKQR7k",
  "data/tweet-nytimes/2021/9/1433433314384351232.json": "More than half of New York City’s subway lines remain suspended or partially disrupted after severe flooding from record rainfall.\nhttps://t.co/ip759qhGsA",
  "data/tweet-nytimes/2021/9/1433595616777711616.json": "At least 11 people were found dead in basements after torrential rains flooded New York City — nearly as many as those killed by Hurricane Ida in Louisiana, where the storm made landfall. https://t.co/xvdTmUUnIG https://t.co/zBQPACVSzA",
  "data/tweet-nytimes/2021/9/1433755425690816514.json": "\"Seeing this guy push his bicycle past these people in Mercedes to deliver Chinese food just turned my stomach,\" Johnny Miller, a freelance photographer, said. \"Some of us have the privilege to not work during a disaster and some of us don’t.\" https://t.co/EcK6RzBbNW",
  "data/tweet-nytimes/2021/9/1433637145793765378.json": "Amtrak employees must be fully vaccinated by Nov. 1 or submit a weekly negative coronavirus test. Amtrak also requires all customers and employees to wear face masks, regardless of vaccination status or state and local laws.\nhttps://t.co/RF67DDunI9",
  "data/tweet-nytimes/2021/9/1433705091136114688.json": "The WHO added the “Mu” coronavirus variant to its list of “variants of interest” because it has the potential to evade immunity from vaccines and antibodies.\n\nThe variant was first identified in Colombia in January and now makes up 39% of all cases there.\nhttps://t.co/Z8KvWrwolV",
  "data/tweet-nytimes/2021/9/1433864883322462220.json": "TikTok users, coders and opponents of Texas' near-total abortion ban have bombarded a website that invites users to inform on people who may have violated the law. The site set up by the state's largest anti-abortion group was overwhelmed with fake tips. https://t.co/crR0zd1nHp",
  "data/tweet-nytimes/2021/9/1433925285590806529.json": "President Biden said an abortion law in Texas that prohibits abortion after six weeks was not in line with American values, adding that he supports a woman’s right to choose. https://t.co/BKANlnaJ9w",
  "data/tweet-nytimes/2021/9/1433893124150071335.json": "By simply existing, Bitcoin, the most popular cryptocurrency, uses astonishing amounts of electricity.\n\nThe Bitcoin network consumes around 91 terawatt-hours of electricity annually, more than the country of Finland. https://t.co/TOVP1cKeNR https://t.co/uySqTREwZ3",
  "data/tweet-nytimes/2021/9/1433680799367409707.json": "Breaking News: Six people were injured in a knife attack at a supermarket in New Zealand. The prime minister, Jacinda Ardern, called it a “terrorist attack” that had been carried out by a “violent extremist” inspired by the Islamic State. https://t.co/s33q3KDro1",
  "data/tweet-nytimes/2021/9/1433894060025163784.json": "Breaking News: President Biden directed federal agencies to declassify documents from the FBI investigation into the Sept. 11 attacks. https://t.co/vQeXaAC9p9",
  "data/tweet-nytimes/2021/9/1434071739135365120.json": "Nania the elephant was alone, dehydrated and tiny — only 2 or 3 months old — when villagers in Burkina Faso first found her. She was raised with around-the-clock care, and now, against all odds, she may be reunited with her mother. https://t.co/JH9Y5lzET6",
  "data/tweet-nytimes/2021/9/1434134179437060097.json": "After being cited for a rip in her jeans on the first day of school, Sophia Trevino has led a protest seeking changes to her district’s dress code, which she says unfairly targets girls. https://t.co/SvUMPpzwPm https://t.co/zl2U2U9XvM",
  "data/tweet-nytimes/2021/9/1434187047846227975.json": "Ivermectin, an anti-parasitic drug commonly used for livestock, should not be taken to treat or prevent Covid-19, according to the FDA. https://t.co/ViuKp5lVaS https://t.co/HZMtGLvNTi",
  "data/tweet-nytimes/2021/9/1434159322955718662.json": "An oil spill with a potential connection to Hurricane Ida has occurred in the Gulf of Mexico, according to an examination of satellite and aerial survey images, ship tracking data and interviews with those involved in the spill response. https://t.co/dJi9k9qkLs",
  "data/tweet-nytimes/2021/9/1434227278632964100.json": "Pete Buttigieg and his husband, Chasten, shared the first photograph of their newborn son and daughter. https://t.co/OGf9PBpDvt",
  "data/tweet-nytimes/2021/9/1433935404139417600.json": "After a video of a food delivery worker in New York walking his bike through waist-deep water to deliver food sparked outrage, advocates for workers’ rights called on the city and delivery apps to increase minimum wages and strengthen safety protections. https://t.co/9CAgQkQKsL",
  "data/tweet-nytimes/2021/9/1434204634164482052.json": "President Biden drew criticism after invoking his son Beau Biden’s memory with the families of fallen U.S. Marines. His behavior, received in various ways by those on the other end, is indicative of his enduring grief after the death of his oldest son. https://t.co/SrTUfWf8bW",
  "data/tweet-nytimes/2021/9/1434280128285192195.json": "Bitcoin’s energy use is close to half-a-percent of all the electricity consumed in the world. This is more than seven times as much electricity as all of Google’s global operations and is similar to Washington State’s consumption. https://t.co/PBVFSf3lhu https://t.co/tfodmnr2pg",
  "data/tweet-nytimes/2021/9/1434380808295485442.json": "Twenty years ago, Cartoon Network executives had a problem they needed to solve. Their solution became Adult Swim, one of TV's most consistent generators of bizarro humor and cult fandom. https://t.co/gbWhOyDcxw",
  "data/tweet-nytimes/2021/9/1434526756896137222.json": "Curtis Flowers, who had murder charges against him dropped after 23 years in prison, is suing the Mississippi D.A. who prosecuted him six times. https://t.co/gaLDKLfovm",
  "data/tweet-nytimes/2021/9/1434405961335197699.json": "Abba previews its first album in 40 years, and 11 other new songs that need to be on your radar. https://t.co/9hsobIY80g",
  "data/tweet-nytimes/2021/9/1434583623588585477.json": "Leaders in Whitefish, Montana, say Richard Spencer, who once ran his National Policy Institute from his mother’s $3 million summer house there, is an outcast in the community. \n\n“He started suffering social consequences for his hatred.”\nhttps://t.co/Li6e4nT9TX",
  "data/tweet-nytimes/2021/9/1434568269550264326.json": "“If you’re going to be inspired by me,\" Paralympian Darlene Hunter said, \"be inspired by the fact that I have four degrees, that I'm 39 and in the best shape of my life and that I am advocating for women in sports.\" https://t.co/mStSrczxJk",
  "data/tweet-nytimes/2021/9/1434617366445543424.json": "The internet’s favorite mollusk is the subject of a new film, \"Marcel the Shell With Shoes On.\" In the process of making it, the actress who voices him, Jenny Slate, realized, “I was doing something that actually was very personal.”\nhttps://t.co/VCtWMchk1B",
  "data/tweet-nytimes/2021/9/1434647291575640067.json": "What is Bernie Sanders doing in Iowa?\n\n“I am chairman of the Senate Budget Committee,” Mr. Sanders said last Sunday. “And I am here to explain what the hell is in the budget for the American people.” https://t.co/0ibhiKXzxb",
  "data/tweet-nytimes/2021/9/1434901742022443008.json": "Surgeons in Israel have separated 1-year-old twins who were conjoined at the head, the first time the surgery was performed in the country.\n\n“They are expecting a full recovery,” a pediatric neurosurgeon at the hospital said. https://t.co/J8Vr3iCHDj",
  "data/tweet-nytimes/2021/9/1434987391983386626.json": "Breaking News: Michael K. Williams, the actor best known for his role as Omar Little in “The Wire,” was found dead in his home, the police said. He was 54. https://t.co/fWBmwNyGZr",
  "data/tweet-nytimes/2021/9/1435060320721047556.json": "These one-year-old twin girls, who were conjoined at the back of their heads, have seen each other for the first time after being separated.\n\nThe surgery lasted over 12 hours and was the first of its kind in Israel. https://t.co/NhOcRXlrYv https://t.co/rK8wrQMFro",
  "data/tweet-nytimes/2021/9/1435051547231203334.json": "Michael K. Williams, who played Omar Little in \"The Wire\" with hard-edge charisma, was found dead in his home in Brooklyn. He was 54. His death is being investigated as a possible drug overdose. New York City’s medical examiner will determine the cause. https://t.co/iDCYKVNBa7",
  "data/tweet-nytimes/2021/9/1435073762341306370.json": "Breaking News: The Human Rights Campaign fired its president, Alphonso David, who helped advise Andrew Cuomo during the former governor’s sexual harassment scandal. https://t.co/5AJ7YwgANl",
  "data/tweet-nytimes/2021/9/1435228895486300161.json": "These one-year-old twin girls, who were conjoined at the back of their heads, have seen each other for the first time after being separated.\n\nThe surgery lasted over 12 hours and was the first of its kind in Israel. https://t.co/4Uo6rNgK7h https://t.co/G6EI6I278G",
  "data/tweet-nytimes/2021/9/1435238944069783554.json": "“How small are the chances of the average vaccinated American contracting Covid?” @DLeonhardt writes in The Morning newsletter. “Probably about one in 5,000 per day.”\n\nRead more about the likelihood of breakthrough infections.\nhttps://t.co/t1S0QifXlV",
  "data/tweet-nytimes/2021/9/1434599905138446338.json": "“If I had the ability to do it right now, we would have a masking order when you are in public and indoors,” Andy Beshear, the Democratic governor of Kentucky, said on Sunday.  https://t.co/hNymOockUR",
  "data/tweet-nytimes/2021/9/1435236431992131584.json": "A man in Vietnam who did not follow quarantine rules after traveling for work was given five years in prison for spreading the coronavirus, state news media reported. https://t.co/wM6mXaW7tt",
  "data/tweet-nytimes/2021/9/1435325568875106306.json": "Breaking News: Mexico’s Supreme Court ruled that making abortion a crime was unconstitutional, setting a landmark legal precedent for the conservative Catholic country. https://t.co/wCMsa65fxM",
  "data/tweet-nytimes/2021/9/1435348678802300930.json": "Mexico’s Supreme Court Votes to Decriminalize Abortion https://t.co/LWyj3HhJA9",
  "data/tweet-nytimes/2021/9/1435341112353435663.json": "Many professors at U.S. universities are finding the return to the classroom a nerve-racking experience. A few have quit — one in the middle of class. https://t.co/cJuyJe0AMV https://t.co/4mAnw2bX89",
  "data/tweet-nytimes/2021/9/1435343412362977282.json": "Mexico’s Supreme Court on Tuesday ruled that making abortion a crime was unconstitutional, setting a precedent for the legalization of abortion nationwide in the conservative Catholic country. https://t.co/Kv5yNaFqZl https://t.co/bswZJTUP7a",
  "data/tweet-nytimes/2021/9/1435423302898667523.json": "Breaking News: Britney Spears’s father has asked a court to consider ending the conservatorship that has long controlled her life and finances. https://t.co/R27ZNNzbPd",
  "data/tweet-nytimes/2021/9/1435431504616771585.json": "Breaking News: A 7.1 magnitude earthquake struck near Acapulco on Mexico’s Pacific coast, shaking Mexico City more than 230 miles away. https://t.co/kfFuxn9uof",
  "data/tweet-nytimes/2021/9/1435505708724801538.json": "Britney Spears’s father has asked a court to consider ending her 13-year conservatorship. Lawyers for James Spears wrote that if the singer “believes that she can handle her own life, Mr. Spears believes that she should get that chance.” https://t.co/prtp1Z1wgx",
  "data/tweet-nytimes/2021/9/1435455366905618434.json": "At least one person has died after a 7.1 magnitude earthquake struck near Acapulco, Mexico, triggering a tsunami alert.\n\nFollow live updates. https://t.co/Be3SovAB5L",
  "data/tweet-nytimes/2021/9/1435566132157685761.json": "Mexico’s Supreme Court ruled on Tuesday that making abortion a crime was unconstitutional, setting a landmark legal precedent for the conservative Catholic country. https://t.co/PrLsUodbFP",
  "data/tweet-nytimes/2021/9/1435593488163299328.json": "Breaking News: The Biden administration will announce a goal of producing almost half the nation’s electricity from the sun by 2050, a major shift in energy policy. https://t.co/zIC7QpH129",
  "data/tweet-nytimes/2021/9/1435442795704197120.json": "Several former supermodels, including Carla Bruni and Paulina Porizkova, are testifying in Paris in support of women who have accused ​​Gérald Marie, who for decades was one of the most powerful men in fashion, of rape and sexual misconduct. https://t.co/C6fNSW9P9J",
  "data/tweet-nytimes/2021/9/1435656747000139778.json": "Steve Burns, the first host of \"Blue's Clues\" who made a sudden departure from the show, addressed his now grown-up viewers almost two decades later in a new video: \"I guess I just wanted to say I never forgot you... ever.\" https://t.co/SQCjAncaQR",
  "data/tweet-nytimes/2021/9/1435651674677334023.json": "The wealthiest 1% of Americans are evading as much as $163 billion a year in taxes, according to a new Treasury Department report.\n\nThe analysis comes as the Biden administration pushes lawmakers to beef up the IRS's enforcement efforts. https://t.co/LMq8CfYZcm",
  "data/tweet-nytimes/2021/9/1435645375608770571.json": "The U.S. could default on its debt sometime in October if Congress does not take action to raise or suspend the debt limit, Treasury Secretary Janet Yellen warned on Wednesday. https://t.co/3JDNpecg27",
  "data/tweet-nytimes/2021/9/1435584969997529089.json": "Hundreds of parents in Mexico are asking for court injunctions to have their children vaccinated against Covid-19 before they return to school. The government has not yet offered shots to 12- to 18-year-olds even though they are authorized to receive it.\nhttps://t.co/RjJ7seCAz9",
  "data/tweet-nytimes/2021/9/1435772460595560457.json": "Los Angeles is poised to become the first major school district in the U.S. to mandate coronavirus vaccines for students 12 and older who are attending class in person. https://t.co/pcRPlVdau3",
  "data/tweet-nytimes/2021/9/1435792587051442184.json": "Michael Constantine, an actor best known for playing the school principal on the TV series “Room 222” and, decades later, the patriarch in the hit film “My Big Fat Greek Wedding,\" has died at 94. \nhttps://t.co/WrNR3BBQEY",
  "data/tweet-nytimes/2021/9/1435812729290362881.json": "Komodo dragons, previously considered a “vulnerable” species, were reclassified last weekend as “endangered” by a top conservation organization. https://t.co/Jo9NdNy4Jd",
  "data/tweet-nytimes/2021/9/1435925967344701440.json": "France will offer free contraceptives for women up to the age of 25 starting next year.\n\nThe aim is to help young women with the financial costs of protecting against pregnancy, a health official said. https://t.co/DmiagqJ18F",
  "data/tweet-nytimes/2021/9/1435384920512385024.json": "A collection of leading health and medical journals this week declared climate change \"the greatest threat to global public health\" and called on governments to respond with the degree of funding and urgency they used to confront the coronavirus pandemic. https://t.co/Km0UiG8TaV",
  "data/tweet-nytimes/2021/9/1435777507026944005.json": "A city in Colorado will pay a $3 million settlement to Karen Garner, a 74-year-old woman with dementia whom police officers threw to the ground last year and handcuffed. https://t.co/s4UndABkDs",
  "data/tweet-nytimes/2021/9/1436043853128257539.json": "Breaking News: The Justice Department sued Texas over its new restrictive abortion law, the first significant step by the Biden administration to confront the ban.\nhttps://t.co/ysWDwWMON9",
  "data/tweet-nytimes/2021/9/1436058857340538883.json": "Breaking News: President Biden will move to require Covid vaccines for millions of Americans, including the vast majority of federal employees. The move is part of a larger plan that officials said would cover two-thirds of all U.S. workers. https://t.co/w8IrgXRehW",
  "data/tweet-nytimes/2021/9/1436061873087078402.json": "President Biden is expected to instruct OSHA to draft a rule mandating that all businesses with 100 or more workers require their employees to get vaccinated or face mandatory testing. The requirement would impact more than 80 million workers.\nhttps://t.co/iSZW0fjRuo",
  "data/tweet-nytimes/2021/9/1436104655923261442.json": "Breaking News: Los Angeles became the first major school district in the U.S. to mandate Covid vaccines for students 12 and older. https://t.co/AwsxPQa8Qe",
  "data/tweet-nytimes/2021/9/1436132342268112897.json": "Qantas will require that all passengers on international flights are vaccinated against the coronavirus when it restarts worldwide operations in December, making it one of the first airlines to require proof of vaccination for everyone on board. https://t.co/ToBIZ7JpIf",
  "data/tweet-nytimes/2021/9/1436155008957943812.json": "Leylah Fernandez, a 19-year-old Canadian, beat the world No. 2 Aryna Sabalenka to advance to the U.S. Open finals. https://t.co/Q3N6LzEetz",
  "data/tweet-nytimes/2021/9/1436099466587672577.json": "\"Get vaccinated.\"\n\nPresident Biden on Thursday unveiled plans for a nationwide vaccine push, while expressing deep frustration with the roughly 80 million Americans who are eligible for the shots but have not been vaccinated. https://t.co/nNVe9s1Yzo https://t.co/vs2u1OgNce",
  "data/tweet-nytimes/2021/9/1436191429546680322.json": "Two unseeded teenagers who toppled seasoned pros are in the U.S. Open women’s final: Emma Raducanu, 18, will face Leylah Fernandez, 19. https://t.co/2TpwCkwpKh",
  "data/tweet-nytimes/2021/9/1436177669981450244.json": "The Biden administration on Thursday took the first steps to begin the process of protecting Alaska’s Bristol Bay, one of the world’s most valuable sockeye salmon fisheries that also sits atop massive copper and gold deposits coveted by mining companies. https://t.co/EPyGgAY90p",
  "data/tweet-nytimes/2021/9/1436021606728536065.json": "More children are being hospitalized for Covid than ever before, led by states with the fewest vaccinations. Some hospitals are stretched.\nhttps://t.co/3Q9zeyMjxo",
  "data/tweet-nytimes/2021/9/1436307225425940482.json": "The makers of the Pfizer-BioNTech Covid vaccine will soon ask regulators to approve its use in children 5 years and over, and are getting ready to make smaller doses of the vaccine for younger children, according to a BioNTech founder. https://t.co/v2NBg1UMgW",
  "data/tweet-nytimes/2021/9/1436305981038866454.json": "The California State Legislature approved a measure that would make it the first state to outlaw stealthing, the act of removing a condom during sex without consent. https://t.co/vNVkjHrmMo",
  "data/tweet-nytimes/2021/9/1436073189885546496.json": "One of Kabul’s largest mansions was abandoned. Now more than 150 Taliban fighters have moved in. Our video goes inside their new home. https://t.co/mT7zALZgFd https://t.co/VT5FQqDWSt",
  "data/tweet-nytimes/2021/9/1436356321574588417.json": "The California State Legislature approved a measure that would make it the first state to outlaw stealthing, the act of removing a condom during sex without consent. If approved by the governor, victims could sue their assailants for damages. https://t.co/CAQ7Q3vSOM",
  "data/tweet-nytimes/2021/9/1436393013115240448.json": "Breaking News: Unvaccinated Americans are 11 times more likely to die of Covid, the CDC reported, among other data showing vaccines’ protection from severe cases. https://t.co/CljUKXa3E3",
  "data/tweet-nytimes/2021/9/1436358818770964490.json": "2,753 lives were lost the day of the Sept. 11 terror attack on the World Trade Center. That toll has likely been eclipsed by deaths from exposure to toxic pollutants in the air in the weeks and months after the collapse — and that number keeps growing. https://t.co/UBh3uoIMrH",
  "data/tweet-nytimes/2021/9/1436360774600085533.json": "Breaking News: Apple can no longer force developers to use its payment system in apps, a judge ruled. The decision could upend the economics of a $100 billion market. https://t.co/1Sn89aSILg",
  "data/tweet-nytimes/2021/9/1436429303986724902.json": "Breaking News: The New York Times obtained footage and witness accounts that cast doubt on the Pentagon’s description of a recent drone strike that killed 10 Afghans. https://t.co/qYx6jEFy8z",
  "data/tweet-nytimes/2021/9/1436409176209645571.json": "The makers of the Pfizer-BioNTech Covid vaccine will soon ask regulators to approve its use in children 5 years and over, and are getting ready to make smaller doses of the vaccine for younger children, according to a BioNTech founder. https://t.co/ny30QkvsDC https://t.co/VqOMLSoLZZ",
  "data/tweet-nytimes/2021/9/1436431806400765975.json": "In Opinion\n\n\"Abortion is a failure for every woman and her unborn child — a failure of love, justice and mercy,\" Karen Swallow Prior writes in a guest essay. \"Texas’ new abortion law is far from perfect, but I hope it can move us closer to these ideals.\" https://t.co/q2CqZRShju",
  "data/tweet-nytimes/2021/9/1436464545288134673.json": "Gov. Gavin Newsom has opened a double-digit lead in recent polls as California's Sept. 14 recall election deadline nears. The shift appears to be driven by growing Democratic engagement.\nhttps://t.co/z7yUyc7dl0",
  "data/tweet-nytimes/2021/9/1436517401080836096.json": "Harvard University announced that it “does not intend” to make any future investments in fossil fuels. The announcement, sent out on Thursday, is a major victory for the climate change movement. https://t.co/IWhETgJkfi",
  "data/tweet-nytimes/2021/9/1436532497907601410.json": "Polling from across the U.S. shows that broad numbers of Americans support tightening vaccine requirements for schools, hospitals and workplaces. https://t.co/mJJ6rtLd2p",
  "data/tweet-nytimes/2021/9/1436287108856041492.json": "Sarah Gilbert, the Oxford professor who led the development of the AstraZeneca Covid vaccine, said a third dose was unnecessary for most people.\n\n\"We need to get vaccines to countries where few of the population have been vaccinated so far,\" she said. https://t.co/gFpolYza5F",
  "data/tweet-nytimes/2021/9/1436670875407986691.json": "Twenty years after Sept. 11, we look at how a single day continues to shape us. https://t.co/vX6BvaGaXW",
  "data/tweet-nytimes/2021/9/1436711167544659972.json": "Though there were not many survivors to find amid the wreckage of the World Trade Center 20 years ago, the devotion of the hundreds of dogs who searched for them is being recognized in two exhibitions in New York. https://t.co/a02zaMs1tI https://t.co/JCETyrwd8V",
  "data/tweet-nytimes/2021/9/1436733791754727424.json": "Former President George W. Bush condemned domestic terrorism in his remarks observing the 20th anniversary of Sept. 11 at the Flight 93 National Memorial in Pennsylvania. https://t.co/LWZPaM4bE7 https://t.co/9Rn9UWY1ro",
  "data/tweet-nytimes/2021/9/1436736347864281090.json": "Nearly 3,000 lives were lost in the Sept. 11 terrorist attacks, but countless others who were shaped by that day have died since.\n\nOn the 20th anniversary of 9/11, here are some of their stories. https://t.co/zqMUFDcvVp",
  "data/tweet-nytimes/2021/9/1436540031213187072.json": "The California State Legislature approved a measure this week that would make the state the first to outlaw stealthing, the act of removing a condom during sex without consent. https://t.co/xow3kRfzaW https://t.co/TtgibSBkLG",
  "data/tweet-nytimes/2021/9/1436815049633542148.json": "Breaking News: Emma Raducanu, an 18-year-old ranked 150th in the world, beat the odds to win the U.S. Open women’s singles title, defeating Leylah Fernandez of Canada. https://t.co/a48ggIGHdA https://t.co/NqwY7ruRKH",
  "data/tweet-nytimes/2021/9/1436764005998157824.json": "New York Times photographers reflect on telling the story of 9/11 and its aftermath in images. https://t.co/jaqNqUrCZu https://t.co/63Jd3nJeRa",
  "data/tweet-nytimes/2021/9/1436743893601636356.json": "Watch: Former President Bush spoke at the Flight 93 National Memorial in Pennsylvania, recalling Sept. 11 and paying tribute to the 40 passengers and crew members who were killed in the Flight 93 hijacking. https://t.co/HzvnLS5cuE https://t.co/NRdoglEMql",
  "data/tweet-nytimes/2021/9/1436801757959557124.json": "It can be hard to remember, but at one point, flying was considered part of a vacation, not just the means to get to it. Today’s flying environment, 20 years after Sept. 11, can be boiled down to one overriding motivation: just get through it. https://t.co/h8ueegEzpx",
  "data/tweet-nytimes/2021/9/1436630624161435650.json": "President Biden’s authority to mandate vaccines for 80 million American workers relies on a first-of-its-kind application of a 51-year-old law that grants the federal government the power to protect employees from “grave dangers” at the workplace. https://t.co/9T7VOzgyoo",
  "data/tweet-nytimes/2021/9/1437026993573400576.json": "Lora Reinbold, a Republican state senator from Alaska, says she has no way to fly to Juneau, the state capital, after she was barred from Alaska Airlines for violating mask policies.\nhttps://t.co/nMr5JKHAfU",
  "data/tweet-nytimes/2021/9/1436760229807640581.json": "Donald Trump was absent from the 9/11 memorial services on Saturday, opting instead to speak at the NYPD’s 17th Precinct station house in East Midtown near Trump Tower, along with additional stops. https://t.co/mmZugMLt5V",
  "data/tweet-nytimes/2021/9/1436962838598258690.json": "Hundreds of women, many wearing head-to-toe coverings, filled the auditorium of a Kabul university on Saturday holding signs in support of the Taliban and its strict interpretation of Islam, including separate education for men and women. https://t.co/sY1LlgN9cY",
  "data/tweet-nytimes/2021/9/1437046001592848394.json": "Nursing homes give antipsychotic drugs to at least 1 in 5 residents, a rate higher than publicly reported and hidden by false diagnoses, a New York Times analysis found. https://t.co/aLKlXu9WRx",
  "data/tweet-nytimes/2021/9/1436937638150299649.json": "\"Muhammad Ali,\" a new four-part documentary series by Ken Burns coming later this month, paints a sweeping portrait of a man whose life intersected with many of modern America’s most profound changes. https://t.co/2DdzFK0K9t",
  "data/tweet-nytimes/2021/9/1437183316055269384.json": "Breaking News: Daniil Medvedev won the U.S. Open Men's singles title in an upset, denying Novak Djokovic the first calendar-year Grand Slam in men’s tennis since 1969. https://t.co/TZwzCoNZG5",
  "data/tweet-nytimes/2021/9/1437250876134019074.json": "Britney Spears is engaged to her longtime boyfriend, Sam Asghari. The singer's announcement comes three months after she told a Los Angeles judge that her conservatorship was robbing her of the ability to make personal decisions. https://t.co/myuVWQBFuc",
  "data/tweet-nytimes/2021/9/1437272342682607618.json": "Lora Reinbold, a Republican state senator from Alaska, says she has no way to fly to Juneau, the state capital, after she was barred from Alaska Airlines for violating mask policies. https://t.co/SdN4XGipXB",
  "data/tweet-nytimes/2021/9/1437362955214102533.json": "Senior House Democrats are coalescing around a draft proposal that could raise as much as $2.9 trillion to pay for most of President Biden’s expansion of the social safety net by increasing taxes on the wealthiest corporations and individuals. https://t.co/GbII9Efjga",
  "data/tweet-nytimes/2021/9/1437453951046127629.json": "Breaking News: The FEC ruled that Twitter’s decision in October to block an unsubstantiated article about President Biden's son, Hunter Biden, did not violate election laws, according to a document obtained by The New York Times. https://t.co/EzFKKvQ7X2",
  "data/tweet-nytimes/2021/9/1437280564847972353.json": "Senior House Democrats are coalescing around a draft proposal that could raise as much as $2.9 trillion to pay for most of President Biden’s expansion of the social safety net by increasing taxes on the wealthiest corporations and individuals. https://t.co/fDjaNFLgqD",
  "data/tweet-nytimes/2021/9/1437479948302835714.json": "With $15 million in private funding, a new company called Colossal is trying to edit elephant DNA to genetically resurrect the woolly mammoth, thousands of years after it went extinct. https://t.co/LKVWpcfzqe",
  "data/tweet-nytimes/2021/9/1437544167744458752.json": "Representative Carolyn Maloney of New York arrived at the Met Gala in a dress with streaming epaulets bearing the message “Equal Rights for Women” and a matching bag advocating for the passage of the Equal Rights Amendment. Follow live updates: https://t.co/3Qv3ZdzRo4 https://t.co/UOIoCc5pBT",
  "data/tweet-nytimes/2021/9/1437550427122319364.json": "Oscar de la Renta's designers spoke with The New York Times about dressing Billie Eilish in a \"risky\" ball gown for the #MetGala — and her condition that the brand stop using fur. https://t.co/rTGVWkd7Jd https://t.co/5uv7SdC5yJ",
  "data/tweet-nytimes/2021/9/1437546662281498625.json": "Amanda Gorman arrived at the #MetGala in a royal blue Vera Wang gown studded with thousands of crystals that is symbolic of a \"reimagined Statue of Liberty.\" She was also carrying a clutch that looked like a book. (The title: \"Give Us Your Tired.\") https://t.co/l9WsrEAk4j https://t.co/lOOsC22ZKZ",
  "data/tweet-nytimes/2021/9/1437555457099452419.json": "Lil Nas X arrived at the #MetGala with not one, not two, but three shimmery gold looks. The singer started with an oversized cape, which he stripped off to reveal gold Versace armor, and then ended with an ornate jumpsuit. Follow live updates: https://t.co/qcDhWmckOX https://t.co/u0Doe8PCoR",
  "data/tweet-nytimes/2021/9/1437560003024588805.json": "Iman made an entrance at the #MetGala with a bristly chandelier dress and statement headpiece. Follow live updates: https://t.co/6jEYzivbDo https://t.co/vDtlNxwavT",
  "data/tweet-nytimes/2021/9/1437580625100300298.json": "Simone Biles's crystal-embellished #MetGala gown? It weighs 98 pounds, the designers told The New York Times. https://t.co/UnDxbgXCPe https://t.co/3zEe6sQLRK",
  "data/tweet-nytimes/2021/9/1437573089030811650.json": "Representative Alexandria Ocasio-Cortez arrived at the #MetGala in a white Brother Vellies dress emblazoned with the words, \"TAX THE RICH\" in bright red letters across the back. \n\nFollow live updates: https://t.co/pgWIImmR7J https://t.co/MydkD42ow6",
  "data/tweet-nytimes/2021/9/1437568093526626311.json": "Megan Rapinoe arrived at the #MetGala carrying a red, white and blue clutch that reads “IN GAY WE TRUST,” matching her pantsuit.\n\nFollow live updates: https://t.co/RorS6d0Lu0 https://t.co/jc8frYVwNb",
  "data/tweet-nytimes/2021/9/1437565644564795394.json": "Russell Westbrook arrived at the #MetGala with star-spangled hair, honoring the theme of American fashion. See more looks from the red carpet: https://t.co/YhCKTdbcHu https://t.co/lUQCfhLpNm",
  "data/tweet-nytimes/2021/9/1437593720443002880.json": "Kim Kardashian arrived at the #MetGala wearing a black shroud over her face. https://t.co/FMtZXzNGy9 https://t.co/du62r7K1d5",
  "data/tweet-nytimes/2021/9/1437506414243614720.json": "Apple issued emergency updates to fix a flaw that allows highly invasive spyware to infect anyone’s iPhone, Apple Watch or Mac computer without so much as a click. https://t.co/rcWZ9bZufZ",
  "data/tweet-nytimes/2021/9/1437577607776776192.json": "Grimes arrived at the #MetGala carrying a sword and wearing a metallic purple horn on her head.\n\nSee more looks from the red carpet: https://t.co/jmDVp6Okau https://t.co/Ev5Xs8yDze",
  "data/tweet-nytimes/2021/9/1437536613664493578.json": "Anna Wintour, honorary chairman of the Met Gala and long-time maestro of the event makes her entrance wearing, she told us earlier this week, \"an homage to my dear friend Oscar de la Renta,\" the designer who passed away in 2014. Follow live updates: https://t.co/xEYF0v4axI https://t.co/vAMR9q0RFn",
  "data/tweet-nytimes/2021/9/1437596220608892932.json": "Ciara wore a lime green sequined Dundas football gown to the #MetGala, with her husband Russell Wilson's Seahawks number on the front, and his Super Bowl ring on her finger. https://t.co/O2jbI6S4Ui https://t.co/SRRTHFz2dB",
  "data/tweet-nytimes/2021/9/1437672466256650240.json": "Albania, one of Europe’s poorest nations, has committed to taking in more Afghan refugees than any other country. Many have been put up in beach resorts. \"We don’t put people in camps. They are dehumanizing,\" Prime Minister Edi Rama said. https://t.co/ib96m0PQvJ",
  "data/tweet-nytimes/2021/9/1437732907699818498.json": "\"TAX THE RICH,\" read a slogan on Representative Alexandria Ocasio-Cortez's dress at the #MetGala. https://t.co/Wen9W3VggX https://t.co/UuHdalEd3h",
  "data/tweet-nytimes/2021/9/1437737905351532548.json": "Dr. Anthony Fauci: “I would support that if you want to get on a plane and travel with other people, that you should be vaccinated.” https://t.co/gLU0kgr2t5",
  "data/tweet-nytimes/2021/9/1437722810504331264.json": "Billie EiIlish only agreed to wear her Oscar de la Renta gown to the #MetGala if the brand stopped using fur. https://t.co/zRodBPPynP",
  "data/tweet-nytimes/2021/9/1437747993600577543.json": "Lil Nas X arrived at the #MetGala on Monday with not one, not two, but three shimmery gold looks. ✨\n\nHe started with an oversized cape, which he stripped off to reveal gold Versace armor, and finished with an ornate jumpsuit. https://t.co/sh7tRvz8E0 https://t.co/KundHOHg8i",
  "data/tweet-nytimes/2021/9/1437745471800369152.json": "Greece introduced new measures banning unvaccinated people from indoor venues, including cafes and restaurants, and requiring unvaccinated workers to take regular Covid tests at their own expense. The regulations will be in effect through March. https://t.co/ZjGSkHqhs9",
  "data/tweet-nytimes/2021/9/1437647310394167299.json": "President Biden will use the upcoming gathering of the UN General Assembly to set new targets for a global Covid vaccination campaign. This will include having 70% of the world’s population fully vaccinated a year from now, White House documents show. https://t.co/J1UruBrVSJ",
  "data/tweet-nytimes/2021/9/1437874055189831685.json": "Norm Macdonald, the comedian familiar to millions as the \"Weekend Update\" anchor on \"Saturday Night Live” in the 1990s, has died at 61. He had a deadpan style honed on the stand-up circuit, first in his native Canada and then in the U.S. https://t.co/9WG7aaEf91 https://t.co/69X7B5YmAC",
  "data/tweet-nytimes/2021/9/1437856191619772423.json": "Democratic lawmakers are preparing to brush aside proposed changes to New York’s political map and use their supermajorities in Albany to draw new districts that might eliminate as many as five Republican-held House seats. https://t.co/HRClm92acJ",
  "data/tweet-nytimes/2021/9/1437815293120745472.json": "Hospitals in the southern U.S. are running dangerously low on space in intensive care units because of a surge in coronavirus cases. One in four hospitals now reports more than 95% of ICU beds are occupied. https://t.co/74EyqYjKzN",
  "data/tweet-nytimes/2021/9/1437725355675168769.json": "The dress that Simone Biles wore to the #MetGala on Monday used more than 17,000 feet of Swarovski glass crystal chains and nearly 200 feet of tulle. It weighed 98 pounds. https://t.co/9GGLDxNhVK https://t.co/Q54Zm6aDup",
  "data/tweet-nytimes/2021/9/1437970928642760713.json": "\"Get a mask and get vaccinated, and come see live theater.\"\n\nWatch Lin-Manuel Miranda, the creator of \"Hamilton,\" lead a singalong of \"New York, New York\" on the streets of Manhattan. https://t.co/hTIlGv09QH https://t.co/1PjjnNFkAq",
  "data/tweet-nytimes/2021/9/1437989589726253058.json": "A Republican-led bid to recall Gov. Gavin Newsom of California ended in defeat late Tuesday, as Democrats in the state closed ranks against a small grass-roots movement that accelerated with the spread of Covid-19. https://t.co/QZ4RWoU2qe https://t.co/n9914vJV43",
  "data/tweet-nytimes/2021/9/1437988083526508544.json": "Breaking News: Gov. Gavin Newsom of California avoided a recall, the AP reported, thwarting conservatives' attempt to seize on the pandemic to drive him out. https://t.co/hD9Nz6k11c",
  "data/tweet-nytimes/2021/9/1437632222736134145.json": "On the eve of California's recall election, Gov. Gavin Newsom's lead in the polls now dwarfs the typical polling error and is large enough to withstand nearly every statewide polling miss in recent memory.\nhttps://t.co/qAcG9S3dYn",
  "data/tweet-nytimes/2021/9/1438001930454847488.json": "\"We said yes to science. We said yes to vaccines. We said yes to ending this pandemic. We said yes to people’s right to vote without fear of fake fraud or voter suppression,\" Gov. Gavin Newsom of California said after defeating an effort to unseat him. https://t.co/q6w8tUrubM",
  "data/tweet-nytimes/2021/9/1437999643682541570.json": "Gov. Gavin Newsom of California defeated a recall effort that he had painted as an attempt at a hostile takeover by far-right extremists and supporters of Donald Trump. https://t.co/ngNNEINzMG https://t.co/fSP3j0hXWI",
  "data/tweet-nytimes/2021/9/1438026260878344198.json": "\"We said yes to science. We said yes to vaccines. We said yes to ending this pandemic. We said yes to people’s right to vote without fear of fake fraud or voter suppression.\"\n\nWatch Gov. Gavin Newsom speak after winning California's recall vote. https://t.co/Tny6Orspx1",
  "data/tweet-nytimes/2021/9/1438015988499374082.json": "Alex Murdaugh, the South Carolina lawyer whose wife and son were shot and killed in June, asked a former client to kill him this month so his other son could collect a $10 million insurance payment but survived being shot in the head, the police said. https://t.co/2W1svngr92",
  "data/tweet-nytimes/2021/9/1438102821933621256.json": "Michelle Wu, an Asian American progressive, earned one of two spots in Boston’s preliminary mayoral election on Tuesday, setting the stage for change in a city that for nearly 200 years has elected only white men. https://t.co/hH8ptf2bP6",
  "data/tweet-nytimes/2021/9/1438012231644499971.json": "Gov. Gavin Newsom of California became the second governor in U.S. history to beat back a recall attempt. The only other person to ever do so was Gov. Scott Walker of Wisconsin in 2012. https://t.co/D3tog2GdeJ",
  "data/tweet-nytimes/2021/9/1437940500430983175.json": "\"Ladies and gentlemen,\" a disembodied voice announced from the stage, bringing the crowd, which had gathered for the reopening of \"Wicked,\" to its feet: \"Kristin Chenoweth.\"\n\nChenoweth originated the role of Glinda when the show opened on Broadway in 2003. https://t.co/PLXNkC79hx",
  "data/tweet-nytimes/2021/9/1438216230725459975.json": "Simone Biles cried as she told a Senate panel on Wednesday how she wanted to protect other young people from suffering at the hands of a pedophile. She and hundreds of girls and women were molested by Larry Nassar, the former U.S. gymnastics team doctor. https://t.co/rSMis25UL9 https://t.co/NYhdQXctQ9",
  "data/tweet-nytimes/2021/9/1438188372539891716.json": "Lin-Manuel Miranda burst out of the front doors of the Richard Rodgers Theater on Broadway with a bullhorn just hours before showtime on Tuesday. Watch him sing \"New York, New York\" to a crowd gathered on Manhattan's West 46th Street. https://t.co/SPsS0dwICI https://t.co/XNJYO3b0ZO",
  "data/tweet-nytimes/2021/9/1438226134865432581.json": "“I have never refused the Eucharist to anyone,” Pope Francis said on Wednesday, when asked about U.S. bishops considering denying Communion to politicians, like President Biden, who support abortion rights. Bishops should be pastors, he said. https://t.co/NfugAw6Z3n",
  "data/tweet-nytimes/2021/9/1438238709191675915.json": "Pope Francis on Wednesday reiterated his belief that coronavirus vaccinations were critical. \"Even in the College of Cardinals, there are some anti-vaxers,\" he said, \"and one of them, poor man, is in hospital with the virus. But life is ironic.\" https://t.co/wKA52NAZXs",
  "data/tweet-nytimes/2021/9/1438252330105905158.json": "Simone Biles and other elite gymnasts told senators that the system \"enabled and perpetrated\" Larry Nassar’s sexual abuse in emotional testimony on Wednesday. The FBI director apologized to the victims for the agency’s mishandling of the case. https://t.co/72lKrTjjsr https://t.co/aUNkO6Qy5G",
  "data/tweet-nytimes/2021/9/1438258858175213569.json": "Norm Macdonald, who died on Tuesday, was one of late-night TV’s funniest and most unpredictable guests. We pulled together clips from some of his most memorable appearances. https://t.co/PQHHrIiOGc",
  "data/tweet-nytimes/2021/9/1438256336958021636.json": "The Biden administration took a major step on Wednesday in challenging China’s territorial claims in the Pacific, announcing that the U.S. and Britain would help Australia to deploy nuclear-powered submarines in the region. https://t.co/4u965V21Xw",
  "data/tweet-nytimes/2021/9/1438272699730640905.json": "Early numbers from California suggest that a late investment in Latino voter outreach, and a late uptick in interest and voting among Latinos, helped Gov. Gavin Newsom defeat the recall effort.\nhttps://t.co/Y7m3FvB4Sm",
  "data/tweet-nytimes/2021/9/1438193437262729216.json": "Halle Berry makes her directorial debut in \"Bruised,\" in which she also stars as a humiliated MMA fighter desperate to stage a comeback. It's her most physically demanding role — at 55, she trained four to six hours a day before switching to director mode. https://t.co/gcrLBhJ8S2",
  "data/tweet-nytimes/2021/9/1438329336705257472.json": "Los Angeles County next month will require proof of coronavirus vaccination to enter bars, nightclubs and other drinking establishments, as it joins the list of places putting pressure on people to get vaccinated, the county authorities said. https://t.co/ejjvMi90ef",
  "data/tweet-nytimes/2021/9/1438271428189696008.json": "Gavin Newsom was elected governor of California in 2018 by a wide margin. Three years later, voters who voted no on a Republican-led recall effort largely mirrored the partisan lines of that race.\n\nSee county-level results from the recall: https://t.co/1Kuuh7suGK https://t.co/lQZMbWOdFW",
  "data/tweet-nytimes/2021/9/1438161963570368522.json": "Norm Macdonald’s greatness wasn't in his TV credits, writes @zinoman. Instead, it was in the comedian's \"you-have-to-see-this moments, the kind that friends tell you about at parties and then send you the clip the next day.\" https://t.co/o3GEpeiYLI",
  "data/tweet-nytimes/2021/9/1438412840763904004.json": "After Nicki Minaj questioned the efficacy of the Covid vaccine this week, the White House confirmed that it had offered her a call with a doctor to answer questions about vaccine safety. https://t.co/Fk5drMKURD",
  "data/tweet-nytimes/2021/9/1438457694768275457.json": "After Nicki Minaj questioned the efficacy of the Covid vaccine this week, the White House confirmed that it had offered her a call with a doctor to answer questions about vaccine safety. https://t.co/8XnEkJTlWV",
  "data/tweet-nytimes/2021/9/1438204749447376902.json": "President Biden will meet on Wednesday with top executives from Microsoft, the Walt Disney Company, Kaiser Permanente and other companies that have endorsed vaccine mandates to rally more business support for the requirements, a White House official said. https://t.co/m5N5WScdyH",
  "data/tweet-nytimes/2021/9/1438503012276715521.json": "President Emmanuel Macron of France said that French military forces had killed the leader of the Islamic State in the Greater Sahara, Adnan Abu Walid al-Sahraoui. https://t.co/sWgdvXP1bv",
  "data/tweet-nytimes/2021/9/1438266398531366916.json": "Researchers in Israel reported that a third dose of the Pfizer-BioNTech Covid vaccine can enhance protection in adults older than 60 for at least 12 days — a result that is unsurprising, experts said, and does not indicate long-term benefit. https://t.co/OKF8OSY1Cr",
  "data/tweet-nytimes/2021/9/1438298353398423556.json": "Breaking News: SpaceX sent into orbit the world’s first spaceflight with no professional astronauts. Follow live updates here. https://t.co/npZYENhV8J",
  "data/tweet-nytimes/2021/9/1438480301479563268.json": "Pope Francis on Wednesday reiterated his belief that coronavirus vaccinations were critical. \"Even in the College of Cardinals, there are some anti-vaxers,\" he said, \"and one of them, poor man, is in hospital with the virus. But life is ironic.\" https://t.co/Di224ViJo8",
  "data/tweet-nytimes/2021/9/1438570133589532673.json": "Breaking News: France canceled a gala in Washington celebrating its U.S. alliance in protest over America’s deal to help Australia deploy nuclear-powered submarines. https://t.co/29qxClj0A7",
  "data/tweet-nytimes/2021/9/1438552054407081989.json": "Ibai Llanos, a 26-year-old Spanish streamer, counts Lionel Messi as an admirer and Gerard Piqué as a business partner. He's interviewed a succession of soccer’s biggest names, including players who habitually distrust the news media. https://t.co/rRoqbSECVR",
  "data/tweet-nytimes/2021/9/1438548266996715525.json": "If you see one of these beautiful bugs, \"squish it, that’s the message,\" the director of horticulture at the Brooklyn Botanic Garden said. https://t.co/XneKBExU7H",
  "data/tweet-nytimes/2021/9/1438616211659579401.json": "Nona Gaprindashvili, a history-making chess champion, was pained to learn that \"The Queen's Gambit\" had erased her many successes against male opponents. Now, she's suing Netflix.\nhttps://t.co/Gau4waZhsH",
  "data/tweet-nytimes/2021/9/1438673071804751874.json": "Breaking News: Anthony Gonzalez, a House Republican who angered his party by backing impeachment, will not run in 2022. He called Donald Trump “a cancer for the country.” https://t.co/9NcmvBDEHK",
  "data/tweet-nytimes/2021/9/1438598592927698958.json": "Italy will require its residents to show a health pass to go to work, the government announced Thursday. It is the first country in Europe to require coronavirus vaccination certificates so widely.\nhttps://t.co/2ZPOZq9mg9",
  "data/tweet-nytimes/2021/9/1438820069631528960.json": "Gov. Jared Polis of Colorado married his longtime partner, Marlon Reis, in a traditional Jewish ceremony. He is the first sitting governor to have a same-sex wedding. https://t.co/zzrqNDIpoS",
  "data/tweet-nytimes/2021/9/1438941957330509832.json": "Breaking News: The Pentagon acknowledged that a U.S. drone strike in Afghanistan on Aug. 29 was a tragic mistake that killed 10 civilians, including seven children, a military official said.\nhttps://t.co/oC6Lnr32hv",
  "data/tweet-nytimes/2021/9/1438804969734422535.json": "“We are all in a trap — trapped by one tyrant.”\n\nAhead of Russia’s parliamentary elections, many say they are fed up with corruption, low pensions and rising prices. But they worry, as one man said, that “if things start to change, there will be blood.” https://t.co/IkiC3F9jJN",
  "data/tweet-nytimes/2021/9/1438955471101104139.json": "Breaking News: France recalled its ambassador to the U.S. in protest over America's deal to help Australia deploy nuclear-powered submarines.\nhttps://t.co/Ht4FGZu4gs",
  "data/tweet-nytimes/2021/9/1438908135763288065.json": "A hostess at an Italian restaurant in Manhattan was assaulted by three tourists from Texas after she asked to see their proof of vaccination on Thursday, the police said, days after enforcement of New York City's vaccine mandate for indoor diners began. https://t.co/sOXtLD2eEE",
  "data/tweet-nytimes/2021/9/1439011299195854848.json": "For almost 60 years, the artist known as Christo dreamed of wrapping the Arc de Triomphe. Now, a little over a year after Christo’s death at the age of 84, “L’Arc de Triomphe, Wrapped” is a reality. https://t.co/d3CntQ0Um7",
  "data/tweet-nytimes/2021/9/1439046531689091076.json": "Hundreds of thousands of white flags planted along the National Mall honor the more than 670,000 people in the U.S. who have died from the coronavirus. https://t.co/tEhjTxlBCq",
  "data/tweet-nytimes/2021/9/1439004126881406977.json": "Breaking News: Robert Durst, the millionaire subject of a documentary probing three killings, was convicted in the execution-style murder of a close friend. https://t.co/OTjxvKxme8",
  "data/tweet-nytimes/2021/9/1438845214660120582.json": "The Empire State Building once symbolized an urban way of working and New York’s resilience. In the pandemic’s second year, that legacy, and the future of the world’s most famous skyscraper, is in doubt.\n\nWe take you inside the iconic landmark. https://t.co/aSHJwALyju",
  "data/tweet-nytimes/2021/9/1438606136400400384.json": "Ibai Llanos no es periodista. No finge serlo ni intenta convertirse en uno. Y por eso consiguió la exclusiva que todos los periodistas anhelaban. https://t.co/B9kc1BSDUi",
  "data/tweet-nytimes/2021/9/1438968495073595396.json": "Breaking News: In a second vote, an FDA panel recommended authorizing a Pfizer booster for those 65 or older or at high risk of Covid. Earlier, the panel voted against recommending that they be authorized for everyone 16 or older.\nhttps://t.co/9bbreFu2KH",
  "data/tweet-nytimes/2021/9/1438904744131678223.json": "Gov. Kathy Hochul of New York signed a measure to release about 200 prisoners from Rikers Island to ease a growing crisis of staff shortages and chaos in the jail. https://t.co/kBTMsrReMN",
  "data/tweet-nytimes/2021/9/1439242832901021696.json": "Vaccine-resistant Americans are turning to monoclonal antibody treatments with a zeal that has, at times, mystified their doctors, chasing down lengthy infusions after rejecting vaccines that cost one-hundredth as much. https://t.co/9HOifuOBpX",
  "data/tweet-nytimes/2021/9/1439192499638132736.json": "New science reveals that much of what we thought we knew about metabolism was wrong. Using previously collected data from more than 6,400 subjects, authors of a new paper found that our metabolism generally goes through four distinct life phases. https://t.co/sztfqrjOxZ",
  "data/tweet-nytimes/2021/9/1438963505210736646.json": "A North Carolina court struck down the state's voter identification law on Friday, citing \"persuasive evidence\" that a Republican-dominated state legislature had rushed it to passage at least in part to make it harder for Black voters to cast ballots.\nhttps://t.co/cafvkJEFlo",
  "data/tweet-nytimes/2021/9/1438921207471132685.json": "\"Two people went on a trip. One person returned. And that person that returned isn't providing us any information,\" the police said Thursday as the search for Gabrielle Petito continues. Petito's fiancé has been declared a \"person of interest\" in the case. https://t.co/Yf8qtUrO5j https://t.co/vqsUZBxeyZ",
  "data/tweet-nytimes/2021/9/1438975073579421701.json": "The authorities are investigating the disappearance of Gabrielle Petito, 22, who left New York in July for what was supposed to be a four-month, cross-country van trip with her fiancé, Brian Laundrie.\n\nHere's a timeline of the case. https://t.co/EMekrVkaBf",
  "data/tweet-nytimes/2021/9/1439272583115968531.json": "Police in North Port, Florida, say they're searching the Carlton Reserve, a 24,565-acre park, for missing Gabrielle Petito's fiancé, Brian Laundrie, with help from the FBI. \n\nLaundrie’s family told police they believe he entered the area earlier this week. https://t.co/VRHNbJcSwd",
  "data/tweet-nytimes/2021/9/1439351085693644805.json": "Watch: The police and reporters far outnumbered attendees at the \"Justice for J6\" rally in Washington, with fewer than 100 people gathering in support of those accused of storming the Capitol on Jan. 6. https://t.co/yMkGvHQssT https://t.co/FY4zsqo6lu",
  "data/tweet-nytimes/2021/9/1439308273652572164.json": "🥳🎂🎉 https://t.co/VMeGYPeBkY",
  "data/tweet-nytimes/2021/9/1439358590276538369.json": "For the first time in Alabama’s known history, the state had more deaths than births in 2020 — a grim milestone that underscores the pandemic’s calamitous toll. https://t.co/iJBrl1yjdZ",
  "data/tweet-nytimes/2021/9/1439202569088389126.json": "The family of a man who has been declared a “person of interest” in the disappearance of his fiancée, #GabbyPetito, told the police they haven’t seen him in days. https://t.co/CMWpOJOws2",
  "data/tweet-nytimes/2021/9/1439237785244905479.json": "Lil Nas X wants to be not just a pop star but a visibly gay one — founded on genuine pride and comfort. After years of hiding himself, he is trying to be a hitmaker, a pop star, an out gay man and a sexual being. Read @jazzedloon's profile. https://t.co/8GWOFbCz09",
  "data/tweet-nytimes/2021/9/1439222691475738625.json": "A herder has unearthed an unconventional weapon against wildfires and the damage they cause — hungry, hungry goats 🐐 https://t.co/4XNLFJsdE8 https://t.co/1sm6GVhiZD",
  "data/tweet-nytimes/2021/9/1439494474816688130.json": "“Buena Vista Social Club,” which was recorded 25 years ago and released in 1997, was the unlikeliest of blockbusters. Critics from The New York Times discuss how the album comes across a generation later. https://t.co/hifyJhHcb6",
  "data/tweet-nytimes/2021/9/1439499539971514369.json": "Two studies suggest the ideal amount of exercise to live longer is around 7,000 to 8,000 daily steps or about 30 to 45 minutes of exercise most days. https://t.co/Tdk1rZVLcV",
  "data/tweet-nytimes/2021/9/1439227794563686404.json": "Pretty much everything you know about hydration is wrong. https://t.co/OkPvqS1t30",
  "data/tweet-nytimes/2021/9/1439619694152011778.json": "Chris Rock tweeted on Sunday that he is sick with Covid-19 and urged people to get vaccinated. https://t.co/yP4nyLURHG",
  "data/tweet-nytimes/2021/9/1439569981201649668.json": "In a provocative opinion essay in The Washington Post, a Texas doctor disclosed that he had performed an abortion in defiance of a new law banning most abortions after six weeks of pregnancy. https://t.co/cPMKE6bAsf",
  "data/tweet-nytimes/2021/9/1439590144063983619.json": "For the first time in Alabama’s known history, the state had more deaths than births in 2020 — a grim milestone that underscores the pandemic’s calamitous toll. https://t.co/Y2510hK7PY",
  "data/tweet-nytimes/2021/9/1439257930243592201.json": "When Iran's top nuclear scientist was assassinated there were conflicting reports about what happened, most of them wrong. https://t.co/c8Ezd1rxL0",
  "data/tweet-nytimes/2021/9/1439718545248690180.json": "Breaking News: Authorities said they've found human remains consistent with the description of missing woman Gabrielle Petito, 22, in Grand Teton National Park in Wyoming. Her fiancé, Brian Laundrie, labeled a “person of interest,” is still missing. https://t.co/bVmi0P3BbP",
  "data/tweet-nytimes/2021/9/1439715953261125633.json": "Senator Joe Manchin, the West Virginia Democrat, raises the most money from the fossil fuel industry of any senator. He personally profits from coal. And he'll decide the fate of President Biden's ambitious climate plan. https://t.co/BAR688lHJO",
  "data/tweet-nytimes/2021/9/1439746144121278465.json": "Beto O’Rourke, the former El Paso congressman who nearly defeated Senator Ted Cruz in 2018, is inching closer to announcing a run for governor of Texas, according to three people who have spoken with him. https://t.co/06Bj7fHJye",
  "data/tweet-nytimes/2021/9/1439767487688675328.json": "Jason Sudeikis wins best actor in a comedy for “Ted Lasso” at the #Emmys. \n\nOn playing the lead character: “What if you played an ignorant guy who was actually curious?” https://t.co/cJL98rQoCL https://t.co/Zg00oTlfxP",
  "data/tweet-nytimes/2021/9/1439759641462943746.json": "John Oliver paid tribute to Norm Macdonald at the #Emmys. The SNL alumnus died earlier this month at 61. https://t.co/WzcDpsaXXK https://t.co/0VeFPlde7C",
  "data/tweet-nytimes/2021/9/1439744753084551170.json": "Brett Goldstein wins best supporting actor in a comedy for “Ted Lasso” at the #Emmys.\n\nFollow along live: https://t.co/g0R6BioNmO https://t.co/J8qPlEafjD",
  "data/tweet-nytimes/2021/9/1439787748001517571.json": "“Ted Lasso” wins best comedy at the #Emmys. https://t.co/5RLNzlreOf https://t.co/HylTxFs3V9",
  "data/tweet-nytimes/2021/9/1439787207229939712.json": "Michaela Coel has made history as the first Black woman to win at the #Emmys for limited series writing. It is her first Emmy win, for \"I May Destroy You.\" https://t.co/PdsiWj8lju https://t.co/g5XAjffyVY",
  "data/tweet-nytimes/2021/9/1439778276772302848.json": "Kate Winslet wins best actress in a limited series or TV movie for “Mare of Easttown” at the #Emmys. \n\nFollow along live: https://t.co/zO6NgLZYvf https://t.co/zsfxORUpHP",
  "data/tweet-nytimes/2021/9/1439632904775163904.json": "Vaccine-resistant Americans are turning to monoclonal antibody treatments with a zeal that has, at times, mystified their doctors, chasing down lengthy infusions after rejecting vaccines that cost one-hundredth as much. https://t.co/GC0hlg8Kai",
  "data/tweet-nytimes/2021/9/1439791459167842305.json": "\"The Crown\" wins best drama at the #Emmys. \n\nFor more #Emmys coverage: https://t.co/4mfgLVFIaP https://t.co/UHVpz1tARA",
  "data/tweet-nytimes/2021/9/1439790178525143044.json": "\"The Queen’s Gambit\" wins best limited series at the #Emmys. \n\n\"The production has a canny combination of retro Rat Pack style, in its décors and music choices, with a creamy texture, in its performances and cinematography,\" our critic writes. https://t.co/wpZzXrcx1a https://t.co/3Sq7jDiUX3",
  "data/tweet-nytimes/2021/9/1439754310754111491.json": "Gillian Anderson wins best supporting actress in a drama for “The Crown” at the #Emmys. Her portrayal of Margaret Thatcher showcases the rigid world of the British class system.. https://t.co/RuoKz67p08 https://t.co/SCx0mM50MZ",
  "data/tweet-nytimes/2021/9/1439784152115654657.json": "Olivia Colman is the second actress to win an Emmy for portraying Queen Elizabeth II in “The Crown.\" https://t.co/yUvpstwfYH",
  "data/tweet-nytimes/2021/9/1439904827480416261.json": "Breaking News: Pfizer said its coronavirus vaccine is safe and effective in young children. With FDA authorization, millions of them may be immunized by Halloween.\nhttps://t.co/APMJ1RKLjV https://t.co/XZ86042ORF",
  "data/tweet-nytimes/2021/9/1439918524701491202.json": "Michaela Coel has made history as the first Black woman to win at the #Emmys for limited series writing. It is her first Emmy win, for \"I May Destroy You.\" https://t.co/I1YE22izv0 https://t.co/bBpd23ETYt",
  "data/tweet-nytimes/2021/9/1439922342155767814.json": "Pfizer’s coronavirus vaccine is safe and highly effective in young children aged 5 to 11, the company said. If FDA authorization goes smoothly, millions of elementary school students could be inoculated before Halloween.\nhttps://t.co/mnVvuGIt4C",
  "data/tweet-nytimes/2021/9/1439960488243253260.json": "Breaking News: The Biden administration will lift restrictions on fully vaccinated international travelers beginning in November, reopening the U.S. to relatives who have been separated from families and employees from businesses.\nhttps://t.co/EP6QnFeNPJ https://t.co/Rdeh3IyQrx",
  "data/tweet-nytimes/2021/9/1439378762748121088.json": "Bennie Pete, a New Orleans tuba player who dedicated himself to preserving the musical traditions of the Big Easy after Hurricane Katrina, has died at 45 from complications of sarcoidosis and Covid-19. https://t.co/GKtxhK4uoa",
  "data/tweet-nytimes/2021/9/1439625337307111428.json": "Dr. Anthony S. Fauci went on three Sunday morning news shows urging vaccinated Americans to wait until they were eligible for an extra shot before getting a booster. https://t.co/jSTAft5l5D",
  "data/tweet-nytimes/2021/9/1439734812055572484.json": "A volcano erupted Sunday on the Spanish island of La Palma, spewing lava and a thick column of smoke and prompting the authorities to evacuate thousands of residents from nearby towns. https://t.co/DrZ78yLuuc",
  "data/tweet-nytimes/2021/9/1440010719735451653.json": "The was the scene as a volcano erupted Sunday on La Palma, one of the Canary Islands in the Atlantic Ocean off the northwestern coast of Africa. The authorities evacuated thousands of residents from nearby towns. https://t.co/FsPZWi5pTY https://t.co/RJHsrWvCn1",
  "data/tweet-nytimes/2021/9/1440039318031003651.json": "A majority of Americans disapproves of the Supreme Court’s decision to allow a ban on most abortions in Texas, according to a new poll. Key aspects of the law, such as allowing private citizens to enforce it, are overwhelmingly unpopular, the poll found. https://t.co/24B5hh9maf",
  "data/tweet-nytimes/2021/9/1440043184147484676.json": "The coronavirus pandemic has reached even the Yamal Peninsula in the Arctic. So vaccination teams are following, and finding ways to inoculate nomadic reindeer herders. https://t.co/gIiDyjhgmP https://t.co/d7cLrRz72w",
  "data/tweet-nytimes/2021/9/1439907662817333257.json": "Breaking News: Paul Rusesabagina, whose story was portrayed in the movie “Hotel Rwanda,” was found guilty of forming a terrorist group in a case that drew global condemnation.\nhttps://t.co/cQVzwwJOEJ",
  "data/tweet-nytimes/2021/9/1440116099727740928.json": "BTS promoted the coronavirus vaccine and lauded young people for their resiliency during a nearly seven-minute speech at the U.N. headquarters on Monday, drawing millions of views on YouTube. https://t.co/BGlkNZmU50",
  "data/tweet-nytimes/2021/9/1440146297760018433.json": "Images and video of U.S. Border Patrol agents on horseback grabbing and chasing down Haitian migrants at the U.S.-Mexico border have prompted the Department of Homeland Security to launch an investigation into the matter, the agency said on Twitter. https://t.co/PU2QXumduH",
  "data/tweet-nytimes/2021/9/1440150100051841033.json": "Breaking News: Justin Trudeau will remain as prime minister, Canadian TV projected, but it is unclear if his Liberal Party will regain a majority. https://t.co/eYkAo0HhqA",
  "data/tweet-nytimes/2021/9/1440079368416477186.json": "The first group of Haitian migrants expected to be deported from Texas has landed in Port-au-Prince. Haitian officials have beseeched the Biden administration to stop returning thousands of people to a country reeling from several crises. https://t.co/zOoNZ2mmr1 https://t.co/XIgtBlkFGj",
  "data/tweet-nytimes/2021/9/1440171459180056578.json": "More than 1 million people were transfixed by the UN on Monday. They were watching BTS.\n\nThe group promoted the Covid vaccine and lauded young people for their resiliency during a nearly seven-minute speech. https://t.co/NNNREcuo2T",
  "data/tweet-nytimes/2021/9/1440219268566552588.json": "\"I believe that every choice we make is the beginning of change, not the end,\" said Kim Nam-joon of BTS.\n\nBTS's seven members used their UN speech to promote vaccines and praise young people's resilience in the face of the pandemic and climate change. https://t.co/SiUee9Q64t https://t.co/EpL0NZTlER",
  "data/tweet-nytimes/2021/9/1440168588011208704.json": "Breaking News: Justin Trudeau’s political gamble failed to pay off when Canadian voters kept him as prime minister but denied him an expanded bloc of power in Parliament. https://t.co/1SnHyc3AKF",
  "data/tweet-nytimes/2021/9/1440277183428132869.json": "More than 1 million people were transfixed by the UN on Monday. They were watching BTS.\n\nThe group promoted the Covid vaccine and lauded young people for their resiliency during a nearly seven-minute speech. https://t.co/McwP8YQjz6",
  "data/tweet-nytimes/2021/9/1440289734337568771.json": "A 20-year-old gas station worker in Germany was shot and killed after he refused to sell beer to an unmasked customer, the authorities said.\n\nMasks have been mandatory in shops in the country since shortly after the pandemic started.\nhttps://t.co/B59h1oVXbt",
  "data/tweet-nytimes/2021/9/1439963855539646468.json": "OkCupid users now have the option to add a “pro-choice” badge to their profiles.\n\nThe feature was created in response to the passage of Senate Bill 8, which has made abortion essentially illegal in Texas.\nhttps://t.co/hHMwMWDYoO",
  "data/tweet-nytimes/2021/9/1440293500872904711.json": "A second dose of Johnson &amp; Johnson’s vaccine substantially increased its protection against the coronavirus, the company said.\n\nIn a clinical trial, two shots delivered 94% efficacy against mild to severe Covid-19, up from 74% for a single dose.\nhttps://t.co/kwrt44Y39D",
  "data/tweet-nytimes/2021/9/1440292285158023168.json": "A New York couple had good health insurance. But after their premature baby died in the hospital, a $257,000 bill showed up.\n\n“For them, it’s just business, but for us it means constantly going through the trauma of reliving our daughter’s death.”\nhttps://t.co/gL32RseRyM",
  "data/tweet-nytimes/2021/9/1440321190254428169.json": "President Jair Bolsonaro of Brazil, who has repeatedly downplayed the pandemic and who himself is unvaccinated, defended the use of unproven Covid drugs in a speech on Tuesday to the UN General Assembly. https://t.co/X2aQMgiK3w",
  "data/tweet-nytimes/2021/9/1440304846318407699.json": "An extra Johnson &amp; Johnson shot boosts protection against Covid, the company announced. In a trial, it raised efficacy to 94% among U.S. volunteers.\nhttps://t.co/ylUvDysn4i",
  "data/tweet-nytimes/2021/9/1440307371201363974.json": "Images and video of U.S. Border Patrol agents on horseback grabbing and chasing down Haitian migrants at the U.S.-Mexico border have prompted the Department of Homeland Security to launch an investigation into the matter, the agency said on Twitter. https://t.co/N0iR11ACiz",
  "data/tweet-nytimes/2021/9/1440308587822137354.json": "Harbin, a city of 10 million people in China, closed gyms, cinemas, mahjong parlors and other leisure venues after a single resident tested positive for Covid.\n\nThe closures are part of the government’s “zero tolerance” approach to virus outbreaks.\nhttps://t.co/jUUubk5ZnT",
  "data/tweet-nytimes/2021/9/1440148835926372355.json": "In Opinion\n\n\"If Joe Manchin wants to actually serve the people of West Virginia, as opposed to pandering to their nostalgia,\" writes Paul Krugman, \"he'll support Biden's progressive agenda — including his climate agenda.\" https://t.co/uBl6rqznks",
  "data/tweet-nytimes/2021/9/1440374499145183255.json": "“I am here to sound the alarm: The world must wake up,” the UN secretary general, António Guterres, said as he opened the General Assembly meeting on Tuesday. He cited war, climate change and the global pandemic as threats that expose glaring inequalities. https://t.co/ya2nhAQBS5 https://t.co/26NHOjiJbZ",
  "data/tweet-nytimes/2021/9/1440378679930998786.json": "Breaking News: The Trump campaign knew days after the 2020 election that wild claims of voting machine tampering — pushed by Sidney Powell and others allied with Donald Trump — were not true, court filings show. Still, they promoted the false theories. https://t.co/aPGpYdS4T9",
  "data/tweet-nytimes/2021/9/1440143775242678273.json": "Veterans who were discharged from the military under the \"don't ask, don’t tell\" policy may be eligible for full benefits from the Department of Veterans Affairs under new guidance issued on Monday, a decade after the policy was repealed. https://t.co/bvamvSoL8m",
  "data/tweet-nytimes/2021/9/1440401719792267268.json": "Yes, a mask will help protect you from the coronavirus even if no one else is wearing one. https://t.co/P4qt2iPYLP",
  "data/tweet-nytimes/2021/9/1440270860518977541.json": "The European Court of Human Rights ruled that Russia was responsible for the 2006 killing of Alexander Litvinenko, who died after drinking tea laced with a rare toxin at a London hotel.\nhttps://t.co/gaVK8jUCXl",
  "data/tweet-nytimes/2021/9/1440429000384409604.json": "Facebook is using its News Feed, the social network's most important digital real estate, to show people positive stories about itself as part of a new initiative approved by Mark Zuckerberg and code-named Project Amplify. https://t.co/iDrzvwenWu",
  "data/tweet-nytimes/2021/9/1440431919762579467.json": "Masks work best when everyone in the room has one on, but you’ll still benefit from masking up even when those around you aren’t. https://t.co/SP4svjM4CX https://t.co/uKMbgoHvjT",
  "data/tweet-nytimes/2021/9/1440422356850118657.json": "The Trump campaign knew days after the 2020 election that wild claims of voting machine tampering — pushed by Sidney Powell and others allied with Donald Trump — were not true, court filings show.\n\nRead the campaign's internal memo: https://t.co/huoeZICXCL",
  "data/tweet-nytimes/2021/9/1440487372215386113.json": "Breaking News: Willie Garson, the actor best known for his role as Carrie Bradshaw’s close friend Stanford Blatch in “Sex and the City,” died. He was 57. https://t.co/Eqt6Hw9p9x",
  "data/tweet-nytimes/2021/9/1440284707313238016.json": "House Democrats are planning to introduce proposed new limits on executive power on Tuesday, beginning a post-Trump push to strengthen checks on the U.S. presidency. https://t.co/WhxVCSUPUT",
  "data/tweet-nytimes/2021/9/1440443249030623240.json": "During a meeting with Prime Minister Boris Johnson of Britain, who hailed the AstraZeneca vaccine, Brazil’s president, Jair Bolsonaro, said he had not been inoculated against Covid-19. https://t.co/jhLSQERg4g https://t.co/09zOypazMR",
  "data/tweet-nytimes/2021/9/1440506161002795016.json": "A team of scientists say they have pinpointed the genetic mutation that may have erased our tails roughly 25 million years ago. https://t.co/vUL3Au7PSo",
  "data/tweet-nytimes/2021/9/1440535451018752002.json": "Footage of Border Patrol agents on horses pushing back Haitian migrants crossing the Rio Grande to try to reach the U.S. have prompted outrage among Democrats. https://t.co/hy3BDw5ZxU",
  "data/tweet-nytimes/2021/9/1440620654697455623.json": "Brazil’s health minister tested positive for the coronavirus on Tuesday in New York, where he was attending the UN General Assembly.\n\nHe accompanied Brazil’s unvaccinated president, Jair Bolsonaro, to the gathering of world leaders.\nhttps://t.co/fLc527oMfb",
  "data/tweet-nytimes/2021/9/1440624435841540098.json": "Willie Garson, whose death was confirmed by his son on Tuesday, was also known for his role as the con man Mozzie in the TV show “White Collar.”\nhttps://t.co/Nb32Qracja https://t.co/h4MwKcZE2A",
  "data/tweet-nytimes/2021/9/1440647148870127622.json": "People with serious conditions are waiting several weeks for non-Covid surgeries as many U.S. hospitals are inundated once again with coronavirus patients.\nhttps://t.co/Mi4oTCnlja",
  "data/tweet-nytimes/2021/9/1440673535328800770.json": "Brazil’s health minister tested positive for the coronavirus on Tuesday in New York, where he was attending the UN General Assembly.\n\nHe accompanied Brazil’s unvaccinated president, Jair Bolsonaro, to the gathering of world leaders.\nhttps://t.co/5e1FSk2GfD",
  "data/tweet-nytimes/2021/9/1440696176991297539.json": "Moderna vs. Pfizer: Both coronavirus vaccines are highly effective, but a series of studies found that Moderna seems to be more protective over the long term. Here’s why. https://t.co/XRo3N1BVLm",
  "data/tweet-nytimes/2021/9/1440707498747461647.json": "Happy 100th birthday to Betty Reid Soskin, the oldest active ranger in the National Park Service. She was described by a colleague as \"sort of like Bette Davis, Angela Davis and Yoda all rolled into one.\" Few stories have been more remarkable than hers. https://t.co/azZbxZpRlt https://t.co/jlVPqhVc31",
  "data/tweet-nytimes/2021/9/1440703719813697539.json": "Dr. Anthony Fauci — arguably the most famous, polarizing doctor in the U.S. — is now a movie star. He discussed a new documentary that tracks his work on two health crises, AIDS and the coronavirus pandemic, and reveals his tender and playful sides. https://t.co/rsRJZxQOUi",
  "data/tweet-nytimes/2021/9/1440434556486647809.json": "Human remains found in a national park in Wyoming were confirmed on Tuesday to be those of Gabrielle Petito, according to the FBI, which also said the death was ruled a homicide. The search continues for her fiancé, Brian Laundrie. https://t.co/rrXYAVLesV",
  "data/tweet-nytimes/2021/9/1440760337955897344.json": "Coverage of Gabby Petito's case has been relentless. But disappearances of people of color don't generate the same coverage, despite occurring at a higher rate, which the journalist Gwen Ifill dubbed \"missing white woman syndrome\" nearly two decades ago. https://t.co/ydmC04KWPJ",
  "data/tweet-nytimes/2021/9/1440670989994508299.json": "Xi Jinping of China told the UN General Assembly that his country would stop building coal-burning power plants overseas.\n\nThe announcement by China, the undisputed king of coal, was cautiously welcomed by climate experts.\nhttps://t.co/axI67QVuB4",
  "data/tweet-nytimes/2021/9/1440772917428555790.json": "Haitian migrants were chased by Border Patrol agents on horseback as they tried to cross the Rio Grande into Texas from Mexico on Saturday. Footage of the incident prompted the Homeland Security Department to launch an investigation. https://t.co/gXdJoCOk6V https://t.co/VFQqizq3GI",
  "data/tweet-nytimes/2021/9/1440821704100438023.json": "Breaking News: The FDA authorized Covid booster shots for Pfizer vaccine recipients who are over 65 or at high risk, including because of job-related exposure. https://t.co/rNJULZwVtw",
  "data/tweet-nytimes/2021/9/1440837073297035275.json": "Late-night shows are teaming up tonight to raise awareness about climate change. Jimmy Fallon, Trevor Noah, James Corden and others will run programs to call attention to the topic.\n\nHere’s a round-up of climate stories you should know about.\nhttps://t.co/nX6Yo9MBI4",
  "data/tweet-nytimes/2021/9/1440778201454632965.json": "Britney Spears supports the prompt and complete termination of the conservatorship that has overseen her finances and life since 2008, her lawyer said in a court filing on Wednesday, but she wants her father removed from the legal arrangement first. https://t.co/FTzCUEuRqi",
  "data/tweet-nytimes/2021/9/1441001932454338567.json": "The Met opened in 1883 and has put on 300 titles. Not one has been by a Black composer. Until now.\n\nTerence Blanchard, best known for scoring Spike Lee films, will reopen the opera house with “Fire Shut Up in My Bones.” https://t.co/wK6WVYOY4H",
  "data/tweet-nytimes/2021/9/1441011669266833410.json": "The EU is seeking to make USB-C connectors the standard charging port for all smartphones, tablets and other electronic devices sold across the bloc. The move would mostly affect Apple, which uses a different port for its iPhones. https://t.co/9MvJKdXPWy",
  "data/tweet-nytimes/2021/9/1441063582423261186.json": "A senior U.S. diplomat to Haiti has quit, citing the Biden administration’s “inhumane” decision to send migrants in Texas back to Haiti. Here's what he said in his resignation letter, dated Wednesday.\nhttps://t.co/udTh7vEX5C https://t.co/eKcRzvDqGD",
  "data/tweet-nytimes/2021/9/1441110650768351233.json": "\"I think this is probably the biggest discovery about the peopling of America in a hundred years.\"\n\nHuman footprints in New Mexico are at least 23,000 years old, a study said, suggesting people may have arrived 10,000 years earlier than scientists thought. https://t.co/A3kGFq3fiD https://t.co/JPOaneboO3",
  "data/tweet-nytimes/2021/9/1441103351920279562.json": "Footprints found in New Mexico date back to the Ice Age, a study found, suggesting humans arrived in the Americas before the glaciers melted. https://t.co/QZ9hGwjuml",
  "data/tweet-nytimes/2021/9/1441032152582443010.json": "The European Union is pushing for all smartphones to have a common charger. The move is a blow to Apple, which has proprietary ports for iPhones.\nhttps://t.co/40Y9YcBPni",
  "data/tweet-nytimes/2021/9/1441036822088462338.json": "Breaking News: A senior U.S. diplomat to Haiti quit, citing the Biden administration’s “inhumane” decision to send migrants in Texas back to Haiti. He had been appointed special envoy to Haiti in July, after the assassination of President Jovenel Moïse.\nhttps://t.co/B3hT6DBtSL",
  "data/tweet-nytimes/2021/9/1440898744413732866.json": "Four years ago, Washington National Cathedral officials removed stained-glass windows honoring Confederate generals. \n\nThey have now chosen Kerry James Marshall, an acclaimed Black artist, to design their replacements. https://t.co/WTjjwj58ba",
  "data/tweet-nytimes/2021/9/1440747756880945154.json": "\"Survivor\" has, remarkably, run for 21 years now, reinventing just often enough to keep devoted viewers guessing and to make consistently electrifying television. Keeping the show’s blood pumping is Jeff Probst himself. \n\nSeason 41 begins today. https://t.co/dqmKVOeEZ3",
  "data/tweet-nytimes/2021/9/1441137827849383936.json": "Breaking News: A gunman opened fire inside a grocery store in Collierville, Tennessee, killing one and injuring at least 12 before he shot and killed himself, the authorities said. https://t.co/xt5F8r14f7",
  "data/tweet-nytimes/2021/9/1441189145418735622.json": "Breaking News: The committee investigating the Jan. 6 attack on the Capitol subpoenaed four of Donald Trump’s closest allies, including Steve Bannon and Mark Meadows. https://t.co/HJNSqeHbin",
  "data/tweet-nytimes/2021/9/1441230948201218048.json": "Delta Air Lines is urging airlines to respond to the extraordinary surge in unruly behavior in the skies by creating a national “no fly” list of barred customers, according to a memo sent to flight attendants on Wednesday.\nhttps://t.co/ySMP0Qae1e",
  "data/tweet-nytimes/2021/9/1441254556847857668.json": "Breaking News: Donald Trump was not cheated of victory in Arizona’s largest county in 2020, a draft of a Republican-ordered review of the election showed. https://t.co/7ZX7Rks5di",
  "data/tweet-nytimes/2021/9/1441318513562382338.json": "\"I think this is probably the biggest discovery about the peopling of America in a hundred years.\"\n\nHuman footprints in New Mexico are at least 23,000 years old, a study said, suggesting people may have arrived 10,000 years earlier than scientists thought. https://t.co/cmjgCCGNo7 https://t.co/D5JHxDT9gb",
  "data/tweet-nytimes/2021/9/1441289281289416704.json": "Breaking News: The CDC director recommended that Pfizer booster shots include people at risk because of their jobs, overruling her own agency’s advisers. https://t.co/MBptaNNKJy",
  "data/tweet-nytimes/2021/9/1441123743728746503.json": "Breaking News: The New York City Council overwhelmingly approved legislation to set minimum pay and working conditions for people employed by food delivery apps like Grubhub, DoorDash and Uber Eats in the city. https://t.co/ZgBIVtVfGv",
  "data/tweet-nytimes/2021/9/1441356787643527168.json": "Donald Trump was not cheated of victory in Arizona’s largest county in 2020, a draft of a Republican-ordered review of the election showed. https://t.co/cWZpsS0MHY",
  "data/tweet-nytimes/2021/9/1441375647356493825.json": "The Gilgamesh Dream Tablet, a 3,500-year-old artifact, is going back to Iraq. Its return marks the end of a 30-year odyssey in which it was stolen from a museum, auctioned to Hobby Lobby and shown in Washington before being seized by Homeland Security.\nhttps://t.co/WHeVYH4fK6",
  "data/tweet-nytimes/2021/9/1441370622278320135.json": "China declared all cryptocurrency transactions illegal and issued a nationwide ban on cryptocurrency mining in an intensifying crackdown.\nhttps://t.co/j8lHxPRbak",
  "data/tweet-nytimes/2021/9/1441341682222460933.json": "In Opinion\n\n\"Now that I think of it … I am ashamed,\" read the subject line of a 2005 email Chris Cuomo \"wrote me, one hour after he sexually harassed me,\" Shelley Ross, a TV journalist, writes. She would \"like to see him journalistically repent.\" https://t.co/dRFh6671PD",
  "data/tweet-nytimes/2021/9/1441373118321381376.json": "Chancellor Angela Merkel of Germany is leaving office after 16 years.\n\nAs Germans head to the polls this weekend, they will face a difficult question: Who can replace her as a leader, for their country and for Europe? Listen to today’s episode of The Daily.https://t.co/kZIseIHG7x",
  "data/tweet-nytimes/2021/9/1441365565122154497.json": "People close to Britney Spears and insiders with firsthand knowledge of her conservatorship reveal how a legal arrangement that she called \"abusive\" has controlled her life. \n\nWatch our new documentary Friday on FX at 10 p.m. ET or stream it on Hulu. https://t.co/3YdBgvlRcH",
  "data/tweet-nytimes/2021/9/1441434532671066112.json": "The Gilgamesh Dream Tablet's return to Iraq marks the end of a 30-year odyssey in which it was stolen from a museum, auctioned to Hobby Lobby and shown in Washington before being seized by Homeland Security.\nhttps://t.co/RyISpIQnVF https://t.co/stefkrDZha",
  "data/tweet-nytimes/2021/9/1441415894698127370.json": "\"Kate Still a Poorly Organized Depression\" was not a subtweet, the National Hurricane Center swears. https://t.co/xfIhsCWl8X",
  "data/tweet-nytimes/2021/9/1441417213672673280.json": "In Opinion\n\n“Theater isn’t just a form of entertainment — at its best it is a collective, spiritual experience,” writes Danny Burstein, a veteran Broadway performer, in a guest essay. “It reminds us how beautiful life can be and how fragile it is as well.”\nhttps://t.co/IIOhbGFZi6",
  "data/tweet-nytimes/2021/9/1441512810727542785.json": "Schools across the U.S. that had mask requirements saw fewer outbreaks of coronavirus, according to new studies from the CDC. In one study, Arizona schools that did not require masks had 3.5 times as many outbreaks as schools that mandated them.\nhttps://t.co/tast5pp2wz",
  "data/tweet-nytimes/2021/9/1441493344518082560.json": "Michael K. Williams, the actor known best for his role in “The Wire,” died earlier this month from a fatal drug overdose involving fentanyl, New York City’s medical examiner said on Friday. https://t.co/N2Fl8VfOyC",
  "data/tweet-nytimes/2021/9/1441589290518171649.json": "Breaking News: Britney Spears’s father hired a security firm that surveilled her and recorded audio from her bedroom, an ex-employee says in a new documentary by The New York Times. https://t.co/UzdgAawU1e",
  "data/tweet-nytimes/2021/9/1441570667237892097.json": "Breaking News: Two Canadians imprisoned in China since 2018 were freed, just hours after the U.S. reached a deal to release the Huawei executive Meng Wanzhou.\nhttps://t.co/Nn5JUClwWR",
  "data/tweet-nytimes/2021/9/1441537966523011072.json": "The House passed a bill to protect abortion rights at the federal level in response to a near total ban in Texas. The bill has little chance of passing the Senate. https://t.co/NYVYu1OTWR https://t.co/IH623jwGaj",
  "data/tweet-nytimes/2021/9/1441608432218411008.json": "On Friday, Matt Amodio, a Ph.D. student in computer science at Yale, won his 28th \"Jeopardy!\" game, amassing over $1 million in winnings. He is only the third contestant to do so in regular-season gameplay, after Ken Jennings and James Holzhauer. https://t.co/6fNlUEGUi5",
  "data/tweet-nytimes/2021/9/1441450569340649480.json": "Breaking News: The U.S. reached an agreement that will allow Huawei Technologies’ chief financial officer, Meng Wanzhou, to return to China in exchange for admitting some wrongdoing in a sanctions violation case. She has been detained in Canada since 2018. https://t.co/yiO8ukFS3G",
  "data/tweet-nytimes/2021/9/1441674599263977477.json": "An estimated several hundred thousand people turned out in more than 400 cities across Germany on Friday to pressure whoever wins the country's national election this weekend to put climate action on top of their agenda. https://t.co/DbhNXLE78k",
  "data/tweet-nytimes/2021/9/1441739288601784336.json": "Two studies, published on Friday by the CDC, provide additional evidence that masks protect children from the coronavirus, even when the contagious Delta variant is circulating.\nhttps://t.co/pBg1yEoaS3 https://t.co/K4T9uSXWXL",
  "data/tweet-nytimes/2021/9/1441744326283890690.json": "As the Proud Boys marched to the Capitol on Jan. 6, a member of the far-right group was texting real-time updates — to his FBI handler.\n\nThe informer gave the bureau an inside view that day, according to confidential records obtained by The New York Times. https://t.co/QkBptydk2Z",
  "data/tweet-nytimes/2021/9/1441628577070567426.json": "A former Oxford lecturer has been accused of selling $7 million in stolen antiquities to Hobby Lobby as part of the the craft chain's plans to build the Museum of the Bible in Washington, D.C. https://t.co/530kY25BXC",
  "data/tweet-nytimes/2021/9/1441563113120280583.json": "\"I do often times cry after most of my shifts.\"\n\nDuring the pandemic, restaurant hosts, many of whom are women, say the job has put them in harm's way as they are tasked with interpreting and enforcing health rules, often without training or support. https://t.co/J300Zv4PhS",
  "data/tweet-nytimes/2021/9/1441749358475714560.json": "Today would have been Christopher Reeve's 69th birthday. Read our 2004 obituary of the beloved Superman actor, who became a vocal advocate for the disabled after a riding accident left him paralyzed from the neck down. https://t.co/Dii6WWWZWa https://t.co/Xec5YoX8K5",
  "data/tweet-nytimes/2021/9/1441944976254914565.json": "Breaking News: “Well over” 50 people were injured and an unspecified number died in an Amtrak train derailment in Montana, an emergency official said. https://t.co/jevmtT5zS4",
  "data/tweet-nytimes/2021/9/1442101672373784580.json": "Thirty years after she testified before the Senate, Anita Hill talks about the experience, sexual harassment and her growing impatience with the slow pace of change. https://t.co/C1YNsgoNrT https://t.co/oM5jpwCP3Y",
  "data/tweet-nytimes/2021/9/1442056359478956032.json": "Sleep should be a welcome respite, but  many of us are left tossing and turning. Studies have shown that exercise can reduce the amount of time it takes to fall asleep.\n\nSwipe through this short routine for right before bedtime → https://t.co/qBAX3mOyve",
  "data/tweet-nytimes/2021/9/1441880210367033348.json": "The Israeli government has held high-level meetings with Palestinian officials and aided the Palestinians economically, a sharp change from the previous administration. https://t.co/cwYigOzEkh",
  "data/tweet-nytimes/2021/9/1442036252170080262.json": "\"I do often times cry after most of my shifts.\"\n\nDuring the pandemic, restaurant hosts, many of whom are women, say the job has put them in harm's way as they are tasked with interpreting and enforcing health rules, often without training or support. https://t.co/gYJ8o9xfJm",
  "data/tweet-nytimes/2021/9/1441532927678959620.json": "Thousands of health care workers in New York are at risk of losing their jobs or being put on unpaid leave after Monday, when the state's vaccine mandate for hospital and nursing home employees takes effect.\nhttps://t.co/yUx3VKEQCq",
  "data/tweet-nytimes/2021/9/1442144444619313154.json": "New Mexico health officials have linked the misuse of ivermectin to two Covid-19 deaths. The two who died — at 38 and 79 years old — had Covid-19 and had taken ivermectin instead of proven treatments like monoclonal antibodies. https://t.co/2UdMyrtYay",
  "data/tweet-nytimes/2021/9/1442187294279028740.json": "In Opinion\n\n\"Almost every article written about Angela Merkel’s tenure as Germany’s chancellor notes that one of her greatest political strengths has been that she is so often underestimated,\" Serge Schmemann writes. https://t.co/980g6E3YFb",
  "data/tweet-nytimes/2021/9/1441824843226234883.json": "Donald Trump was not cheated of victory in Arizona’s largest county in 2020, a draft of a Republican-ordered review of the election showed. https://t.co/OSbhHjMfDC",
  "data/tweet-nytimes/2021/9/1442162061111349255.json": "The NBA has denied the request of Andrew Wiggins, a Golden State Warriors player, for a religious exemption from the coronavirus vaccine, which is required in San Francisco to attend large indoor events, including Warriors home games. https://t.co/pi8BsTy2p9",
  "data/tweet-nytimes/2021/9/1441995979062870016.json": "Tea lovers, these cookies are right up your alley 🍵  https://t.co/M8aDjYlUzT",
  "data/tweet-nytimes/2021/9/1442271299854688260.json": "Lois Smith, 90, is at last a Tony winner. And not just a winner — she is now the oldest performer to win for acting at the #Tonys. https://t.co/LqcrysihBt https://t.co/wsXoAtc4xc",
  "data/tweet-nytimes/2021/9/1442124329966243842.json": "A large iced coffee isn’t breakfast — no matter how many times you tell yourself it is. Try these easy on-the-go breakfasts instead. https://t.co/TJWXXW9RjP",
  "data/tweet-nytimes/2021/9/1442293905932816385.json": "Adrienne Warren has won her first Tony Award. \n\nOn the opening night of \"Tina — The Tina Turner Musical,\" the audience wouldn’t sit down during the mid-show ovation. #Tonys https://t.co/JRhOUms3oa https://t.co/J8GF0OgEAn",
  "data/tweet-nytimes/2021/9/1442291271188422662.json": "Aaron Tveit just won a Tony Award. \n\nThe circumstances were unusual: he was the only nominee in his #Tonys category, best leading actor in a musical. https://t.co/RwFLyXZaKK https://t.co/c91PnoFjNd",
  "data/tweet-nytimes/2021/9/1442243848755814400.json": "\"The Morning Show\" had just begun shooting Season 2 when \"all of a sudden the world is caving in on us,\" Jennifer Aniston said. https://t.co/Y0EDDv2u4k",
  "data/tweet-nytimes/2021/9/1442319037766246402.json": "💃 \"Moulin Rouge! The Musical\" just won best musical at the #TonyAwards. 💃 https://t.co/gNtXJRXCBH https://t.co/33y0ipxrLp",
  "data/tweet-nytimes/2021/9/1442413763588620296.json": "Switzerland overwhelmingly voted on Sunday to legalize same-sex marriage, making the country one of the last in Western Europe to do so.\n\nAn amendment to the country’s marriage law also allows same-sex couples to use sperm banks and to adopt children.\nhttps://t.co/wNHDfA3ov8",
  "data/tweet-nytimes/2021/9/1442265249164447748.json": "Audra McDonald has won more competitive #Tonys than any other performer. Tonight, when she is a nominee for the ninth time, she is hosting the ceremony. https://t.co/xSHZYGTv6q",
  "data/tweet-nytimes/2021/9/1442466603346513930.json": "Lois Smith, 90, is at last a Tony winner. And not just a winner — she is now the oldest performer to win for acting at the #Tonys. https://t.co/lhVPU0EtBN https://t.co/Ftm9cp2ydC",
  "data/tweet-nytimes/2021/9/1442486703344607238.json": "“The political divide over vaccinations is so large that almost every reliably blue state now has a higher vaccination rate than almost every reliably red state,” @DLeonhardt writes in The Morning newsletter.\nhttps://t.co/0QN76RArDi",
  "data/tweet-nytimes/2021/9/1442321372886142983.json": "\"Tell me\nWhat does your silence sound like?\nIs it deafening?\nIs it threatening?\"\n\nDaniel J. Watts, a #TonyAwards nominee for \"Tina,\" performed a spoken-word tribute to the Broadway Advocacy Coalition, which received an award for its work on racial justice. https://t.co/hTPQ8GQSLM",
  "data/tweet-nytimes/2021/9/1442500554588971010.json": "“I was alone throughout the pandemic, and I think that feeling of loneliness followed me, despite being able to go out again.”\n\nFor thousands of young people, the pandemic amplified feelings of social anxiety. Now many are struggling to socialize again.\nhttps://t.co/qDEC6Q2LA5",
  "data/tweet-nytimes/2021/9/1442544585369083908.json": "President Biden, who at 78 is eligible for a coronavirus booster shot, received another dose of the Pfizer-BioNTech vaccine on Monday afternoon. https://t.co/psCRJ9McXY",
  "data/tweet-nytimes/2021/9/1442570163539222530.json": "Breaking News: R. Kelly was found guilty of being the ringleader of a decades-long scheme to recruit women and underage girls for sex. The verdict represents the first criminal consequence for the singer after decades of accusations of sexual abuse. https://t.co/NhoXmER3iK https://t.co/4HLCG5focA",
  "data/tweet-nytimes/2021/9/1442574626182287366.json": "R. Kelly’s conviction represents a major #MeToo moment for Black women. \n\n\"This is the culmination of the movement of so many women who having being trying so long to have their voices heard,\" said Oronike Odeleye, cofounder of a movement to boycott him. https://t.co/WVvXW1dKX5 https://t.co/Lznl2fOhLw",
  "data/tweet-nytimes/2021/9/1442581588663996427.json": "With R. Kelly found guilty, a big question is whether his music will now be removed from major digital platforms like Spotify and Apple Music.\n\nFor decades, accusations of sexual abuse were not enough to derail his music career.\nhttps://t.co/aAgEtgvcHa",
  "data/tweet-nytimes/2021/9/1442212402741878787.json": "In Opinion\n\n\"We ran one of the largest and most sophisticated studies of mask wearing,” write Jason Abaluck, Laura Kwong and Stephen Luby. \"In communities where we promoted surgical mask use, Covid-19 cases dropped by 11 percent.\" https://t.co/8f0ZWgkXjw",
  "data/tweet-nytimes/2021/9/1442612157582135299.json": "Breaking News: New York City's vaccine mandate for nearly all adults working in its public schools can proceed as scheduled, a federal appeals panel ruled. https://t.co/5nCSIeCw29",
  "data/tweet-nytimes/2021/9/1442620836758839296.json": "Breaking News: Senate Republicans blocked a bill to avert a government shutdown and a debt default in an effort to undercut President Biden and Democrats. https://t.co/bypwKPknHp",
  "data/tweet-nytimes/2021/9/1442627645552971780.json": "Ford will spend billions of dollars to build four U.S. factories for batteries and electric trucks, creating 11,000 jobs over the next four years. https://t.co/79737BLoW0",
  "data/tweet-nytimes/2021/9/1442647775322251264.json": "Michelle Bolsonaro, the wife of Jair Bolsonaro, Brazil's proudly unvaccinated president, opted to get vaccinated last week during their visit to New York for the UN General Assembly. https://t.co/QBAxaQG8ok",
  "data/tweet-nytimes/2021/9/1442602482937520129.json": "Tightening the Taliban’s restrictions on women, the group’s new chancellor for Kabul University announced on Monday that women would be indefinitely banned from the institution either as instructors or students. https://t.co/gIAkKB5Gkq",
  "data/tweet-nytimes/2021/9/1442640218138501122.json": "\"Justice was finally served.\"\n\nFederal prosecutors thanked the witnesses who testified against R. Kelly and commended the bravery of his victims after the singer was found guilty of running a decades-long scheme to recruit women and underage girls for sex. https://t.co/Ux9NznlCcz https://t.co/R0jBdrOnQo",
  "data/tweet-nytimes/2021/9/1442676697342558208.json": "A man in Washington State who posed as a teenager online and blackmailed girls as young as 12 across the country to send him sexually explicit photos and videos was sentenced on Monday to 20 years in prison, the federal authorities said. https://t.co/e0HZEAwcoT",
  "data/tweet-nytimes/2021/9/1442806338233454592.json": "Michelle Bolsonaro, the wife of Jair Bolsonaro, Brazil's proudly unvaccinated president, opted to get vaccinated last week during their visit to New York for the UN General Assembly. https://t.co/1Y7TC7pZsh",
  "data/tweet-nytimes/2021/9/1442685523156426758.json": "School officials in a Missouri city stocked up on frozen pizzas and hot dogs. A Kansas school district ran out of vegetables last month. Another in Minnesota has an emergency supply of frozen grilled cheese sandwiches, in case it runs out of other food. https://t.co/WYoNQo2TGh",
  "data/tweet-nytimes/2021/9/1442837921464209416.json": "Breaking News: Donald Trump has lost an effort to enforce a nondisclosure agreement against Omarosa Manigault Newman, a former White House aide and a star on “The Apprentice” who wrote a tell-all book about serving in his administration.\nhttps://t.co/Qwuyc38fmC",
  "data/tweet-nytimes/2021/9/1442730821530517504.json": "Canada has doubled to 40,000 the number of Afghans fleeing the Taliban that it plans to take in, fulfilling a campaign pledge made by Prime Minister Justin Trudeau. https://t.co/wLNzcePK24",
  "data/tweet-nytimes/2021/9/1442850355054776327.json": "Pfizer and BioNTech will submit a formal request to the U.S. regulators to allow a pediatric dose of their coronavirus vaccine to be administered to children ages 5 to 11, the companies said on Tuesday.  https://t.co/tIzFK2KV6Q",
  "data/tweet-nytimes/2021/9/1442825192443625473.json": "An influential and divisive shaman in Sri Lanka, who claimed to be able to cure coronavirus patients with holy water, died last week after being infected with the virus, officials said.\nhttps://t.co/uJgkjklBjm",
  "data/tweet-nytimes/2021/9/1442904499094376448.json": "Gen. Mark Milley told senators on Tuesday that calls to his Chinese counterpart and a meeting in which he told generals to alert him if Donald Trump tried to launch a nuclear weapon were part of his duties as the country’s most senior military officer. https://t.co/MlXbsTvOgk https://t.co/rGfRmzXxGK",
  "data/tweet-nytimes/2021/9/1442901960915505160.json": "This year’s 25 winners of the MacArthur Fellowship include Ibram X. Kendi, who wrote \"How to Be an Antiracist,\" the poet Hanif Abdurraqib and the writer and curator Nicole Fleetwood. https://t.co/VxHzMMzhh7",
  "data/tweet-nytimes/2021/9/1442915791364497409.json": "Gen. Mark Milley on Tuesday defended calls he made to China at the end of Donald Trump’s term as president, saying top administration officials were aware of them. https://t.co/iRPnv9U2Ea https://t.co/fP9C3ST7Xw",
  "data/tweet-nytimes/2021/9/1442881854651125772.json": "Donald Trump's former press secretary, Stephanie Grisham, accuses the former president of abusing his staff, placating President Vladimir Putin of Russia and making sexual comments about a White House aide. \n\nHere are more details from her new book: https://t.co/vtzzdiwprs",
  "data/tweet-nytimes/2021/9/1442894389160800258.json": "Top U.S. military officers on Tuesday acknowledged publicly for the first time that they had advised President Biden not to withdraw all American forces from Afghanistan ahead of the chaotic evacuation during which 13 U.S. service members were killed. https://t.co/mP11QpXjM5",
  "data/tweet-nytimes/2021/9/1442876762182995970.json": "At the now-vegan Eleven Madison Park, one dish involves a beet \"doing things no root vegetable should be asked to do,\" @pete_wells writes. \"The ingredients look normal until you take a bite and realize you’ve entered the plant kingdom’s uncanny valley.\" https://t.co/iszd7IApA2",
  "data/tweet-nytimes/2021/9/1442992551703678981.json": "More than four years after leaving office, Barack Obama broke ground on Tuesday on his presidential center on the South Side of Chicago. https://t.co/KhvbDTUVFP",
  "data/tweet-nytimes/2021/9/1442967372407574539.json": "Top U.S. military officers on Tuesday acknowledged publicly for the first time that they had advised President Biden not to withdraw all American troops from Afghanistan ahead of the evacuation. https://t.co/kmQuHjbzH7 https://t.co/8Ui0UDhTkl",
  "data/tweet-nytimes/2021/9/1442681742658310149.json": "During the pandemic, teenage girls took on more caregiving at home, extra shifts at work and the burden of organizing racial justice protests. In many instances, it upended their lives. https://t.co/H8aXmOWvK0",
  "data/tweet-nytimes/2021/9/1442959833888542720.json": "LeBron James said Tuesday that he had been vaccinated against the coronavirus, after evading questions about his status last season. But he added that he would not use his platform to publicly encourage others to be vaccinated. https://t.co/sBFD8qVK6z",
  "data/tweet-nytimes/2021/9/1442953523117711367.json": "More than 3.5 billion people worldwide have received a dose of a Covid-19 vaccine, equal to about 45% of the world population. But ten months after mass vaccination campaigns began, the global rollout remains unequal. https://t.co/RogWclttO6",
  "data/tweet-nytimes/2021/9/1443022750176661505.json": "In a tiny village on the outskirts of Nacajuca, Mexico, builders are creating new homes for those living in poverty using a novel tool: an oversize 3-D printer. https://t.co/JlFGMWWC4Y https://t.co/cM1Z2nIT5c",
  "data/tweet-nytimes/2021/9/1442821460637138956.json": "Canada has doubled to 40,000 the number of Afghans fleeing the Taliban that it plans to take in, fulfilling a campaign pledge made by Prime Minister Justin Trudeau. https://t.co/EBj85UVExf",
  "data/tweet-nytimes/2021/9/1443210228825214979.json": "United Airlines is terminating about 600 employees for refusing to comply with its vaccination requirement, the company announced.\nhttps://t.co/j3HF96c5GY",
  "data/tweet-nytimes/2021/9/1443010150810456066.json": "From the classroom to writing one of the fall's most anticipated books, Jocelyn Nicole Johnson is 50 and just getting started. https://t.co/zI0Sm16JXW",
  "data/tweet-nytimes/2021/9/1443217403920502792.json": "Breaking News: YouTube is banning several prominent anti-vaccine activists as part of an effort to remove all vaccine misinformation from its platform.\nhttps://t.co/fBAy4aLxLN",
  "data/tweet-nytimes/2021/9/1443255529313345537.json": "Daniel Craig will leave his role as Ian Fleming's secret agent James Bond after \"No Time to Die\" and return to Broadway where he'll play Shakespeare's Scottish King in \"Macbeth.\" https://t.co/u4fRxrPeUl",
  "data/tweet-nytimes/2021/9/1443234278863671309.json": "A new generation has become engrossed by \"The Sopranos,\" the early 2000s hit. Its creator, David Chase, told @willystaley about how it captured a country in decline — where things had become so selfish and narcissistic, that even the mob couldn’t take it. https://t.co/TYb5kF2UWc",
  "data/tweet-nytimes/2021/9/1443260560116703236.json": "Hundreds of thousands of acres of land in northeast Australia, including the world-famous Daintree Rainforest, were returned on Wednesday to Aboriginal people who have lived in the region for more than 50,000 years. https://t.co/Y8CVXbnW2j",
  "data/tweet-nytimes/2021/9/1443236642643402752.json": "United Airlines, which had said employees would have to show proof of vaccination against the coronavirus, said it is firing about 600 people, or less than 1% of its U.S. work force of 67,000, for not complying with the requirement. https://t.co/p2j79JaC1V",
  "data/tweet-nytimes/2021/9/1443300826890612739.json": "One person has the power to decide whether Britney Spears will remain in the conservatorship controlled by her father: Los Angeles Superior Court Judge Brenda Penny. https://t.co/CJPqt7SRIY",
  "data/tweet-nytimes/2021/9/1443271885412868097.json": "To live longer and healthier, it's more important to exercise than it is to lose weight, according to a new review of studies on the relationships between fitness, weight, heart health and longevity. https://t.co/5H6Bru5547",
  "data/tweet-nytimes/2021/9/1442923347931664386.json": "Americans who received a third Covid vaccine dose in recent weeks reported similar side effects as their second shots and at roughly the same rate, the CDC said on Tuesday, a reassuring sign as more people prepare to receive booster shots. https://t.co/u3P0hkHw5M",
  "data/tweet-nytimes/2021/9/1443339827525701632.json": "Breaking News: A judge suspended Britney Spears's father from her conservatorship, creating a path to end his legal authority over her finances. https://t.co/Wz4f8iB0od https://t.co/hBPKa4XL1g",
  "data/tweet-nytimes/2021/9/1443281945476141060.json": "Fat Bear Week, an annual contest to crown a champion among hundreds of hefty bears in Alaska's Katmai National Park and Preserve, has returned. Here’s what to know. https://t.co/jDbcWIwaxT",
  "data/tweet-nytimes/2021/9/1443332780306403329.json": "The Biden administration on Wednesday restored protections for migratory birds, repealing a Trump-era rule that protected oil, construction and other industries from liability if they killed or injured birds while doing business. https://t.co/e5eloim4S8",
  "data/tweet-nytimes/2021/9/1443380104168624128.json": "For the first time since 2008, Britney Spears will be without her father’s oversight, a Los Angeles judge has ruled, as the singer moves toward terminating her conservatorship altogether. https://t.co/10mdgixcAE",
  "data/tweet-nytimes/2021/9/1442851635517181972.json": "Veterinarians, ranchers and farmers say they are struggling with the effects of the surging demand for the animal deworming drug ivermectin, as misinformation that it is effective at treating Covid-19 runs rampant.\nhttps://t.co/6HriqpNF3h https://t.co/UBlKku9aoi",
  "data/tweet-nytimes/2021/9/1443367507205758976.json": "In Opinion\n\nWorkers \"have every right not to get vaccinated — but they don’t have the right to keep jobs in which they needlessly endanger those around them,\" writes @MaraGay.\nhttps://t.co/h2ytNC0fkj",
  "data/tweet-nytimes/2021/9/1443440546576429066.json": "Fat Bear Week, an annual contest to crown a champion among hundreds of hefty bears in Alaska's Katmai National Park and Preserve, has returned. Here’s what to know. https://t.co/BCZqO9Fh46",
  "data/tweet-nytimes/2021/9/1443523548488818694.json": "\"Whoever does it, good luck to them,\" Daniel Craig said of the next James Bond.\n\nWith “No Time to Die,” the actor bids farewell to the spy he’s played since 2006. “Maybe I’ll be remembered as the Grumpy Bond,” he said. “But I’m quite satisfied with that.” https://t.co/l8HrPBxvOs",
  "data/tweet-nytimes/2021/9/1443177297469755393.json": "U.S. officials declared more than 20 extinctions amid a global environmental crisis. A million more species are at risk, many within decades.\nhttps://t.co/OQ0JpNcfbI",
  "data/tweet-nytimes/2021/9/1443074068211720195.json": "The ivory-billed woodpecker.\nThe Bachman’s warbler.\nThe song of the Kauai O’o, a Hawaiian forest bird.\n\nThese are just three of the 22 animals that should be declared extinct, U.S. wildlife officials plan to announce. https://t.co/KVabMMKfOL",
  "data/tweet-nytimes/2021/9/1443560189857312773.json": "Britney Spears will be without her father’s oversight for the first time since 2008, a Los Angeles judge ruled, as the singer moves toward terminating her conservatorship altogether. https://t.co/tw37kb6eRu",
  "data/tweet-nytimes/2021/9/1443511659218231296.json": "A French court convicted Nicolas Sarkozy, the former president, on charges that he illegally financed his failed 2012 re-election campaign by wildly exceeding France’s strict electoral spending limits. https://t.co/gII8IkItap",
  "data/tweet-nytimes/2021/9/1443572614102806537.json": "“I will never vote for her again.\"\n\nSenator Kyrsten Sinema is facing a growing political revolt at home from the voters who once counted themselves among her most devoted supporters.\nhttps://t.co/ex88whZFhY",
  "data/tweet-nytimes/2021/9/1443570096958541826.json": "91% of the workforce at Tyson Foods is fully vaccinated against the coronavirus, the company said. Two months ago, Tyson announced a vaccine mandate for all 120,000 of its U.S. employees, including frontline workers.\nhttps://t.co/VKsUv9OvHy",
  "data/tweet-nytimes/2021/9/1443615022924632064.json": "California’s requirement that all health care workers be vaccinated against the coronavirus by Thursday appears to have compelled tens of thousands of unvaccinated employees to get shots in recent weeks.\n\nHere's what the data shows. https://t.co/zGyYnYNZ47",
  "data/tweet-nytimes/2021/9/1443642968666263561.json": "\"Whoever does it, good luck to them,\" Daniel Craig said of the next James Bond. With \"No Time to Die,\" the actor bids farewell to the spy he’s played since 2006. https://t.co/o9PXqgcuID https://t.co/AoWctDkmwT",
  "data/tweet-nytimes/2021/9/1443420354693763074.json": "AT&amp;T announced on Wednesday that it was extending its coronavirus vaccination requirement to tens of thousands of employees who are members of the Communications Workers of America union.\nhttps://t.co/Kat3Wt0TEm",
  "data/tweet-nytimes/2021/9/1443349889426001925.json": "A House committee scrutinizing the Jan. 6 attack issued 11 more subpoenas, targeting Trump allies who helped organize the rally that fueled mob violence. https://t.co/5gfy8bNtEx",
  "data/tweet-nytimes/2021/9/1443677059423907845.json": "The man who opened fire in a synagogue north of San Diego in 2019, killing a 60-year-old woman and injuring three others during the Jewish holiday of Passover, was sentenced on Thursday to life in prison without the possibility of parole. https://t.co/mDQFV4yIcP",
  "data/tweet-nytimes/2021/9/1443651935723298818.json": "They're bears. They're big. And they spent all summer preparing (eating) to get ready for this very week. Fat Bear Week is back. https://t.co/ouHGyDaQFS",
  "data/tweet-nytimes/2021/9/1443705736110952453.json": "Breaking News: U.S. police killings were undercounted by more than 17,000 over the past 40 years, a new study found, raising questions about the racial bias of medical examiners and their role in obscuring the real extent of police violence. https://t.co/C4lMqSDYei https://t.co/R0UiW9kFHJ",
  "data/tweet-nytimes/2021/9/1443612870231592964.json": "The city of San Jose, California, apologized this week to Chinese immigrants and their descendants, acknowledging its role in nearly a century of violence and discrimination, including the dismantling and destruction of the city’s Chinatowns. https://t.co/4wMtGwEYYm",
  "data/tweet-nytimes/2021/9/1443540000604364807.json": "Breaking News: Wayne Couzens, the police officer who pleaded guilty to the abduction, rape and murder of Sarah Everard — a 33-year-old London woman whose death prompted calls to address violence against women — was sentenced to life in prison. https://t.co/4WfE00uO17",
  "data/tweet-nytimes/2021/9/1443719834324377603.json": "Representatives Cori Bush, Pramila Jayapal and Barbara Lee spoke to a House committee about their personal decisions to seek an abortion. https://t.co/ipRzrE00YC https://t.co/5WAk52EVIh",
  "data/tweet-nytimes/2021/9/1443596528929677315.json": "\"Maybe I’ll be remembered as the Grumpy Bond,\" Daniel Craig told us as he bids farewell to the superspy. \"But I’m quite satisfied with that.\" https://t.co/VzJyHCAVZM"
}