{
  "data/tweet-economist/2022/2/1488323986983317504.json": "When Russia attacked Ukraine in 2014, it deployed about half a dozen battalion tactical groups. Now at least 56 BTGs are on Ukraine’s border https://t.co/3giODLc2xt",
  "data/tweet-economist/2022/2/1488411924979228673.json": "Russia’s build-up today is larger than America’s in Europe ahead of the first Gulf war in 1991 or the NATO air campaign against Serbia in 1999 https://t.co/9v6db7mXv7",
  "data/tweet-economist/2022/2/1488523158722420747.json": "This is probably the largest accretion of firepower seen in Europe for 40 years https://t.co/s367PCboiv",
  "data/tweet-economist/2022/2/1488381681711128576.json": "In his new book, “Davos Man”, @petersgoodman argues that the mega-rich’s pursuit of wealth has undermined society’s capacity to deal with crises and left the world in its present troubled state https://t.co/BsdpO9tNcr",
  "data/tweet-economist/2022/2/1488446211795431424.json": "Russians have an increasingly positive attitude towards Ukraine. A war in which Ukrainians and young Russians die in their thousands would be massively unpopular https://t.co/ZRHjFNqwcU",
  "data/tweet-economist/2022/2/1488796391187091458.json": "RT @PedderSophie: For the past few months our data team has been building a model to calculate the probability of victory at the 🇫🇷 preside…",
  "data/tweet-economist/2022/2/1488811307642101760.json": "Save the rhino, save the plant https://t.co/fkuowtzv9c",
  "data/tweet-economist/2022/2/1488835527017127937.json": "Emmanuel Macron has a four-in-five chance of re-election, according to our new forecast https://t.co/w1HaqJlBWo",
  "data/tweet-economist/2022/2/1488845831335776260.json": "No French president has been re-elected for 20 years. Emmanuel Macron looks set to break that pattern https://t.co/QGIESCU22e",
  "data/tweet-economist/2022/2/1489083656056545280.json": "As a matter of principle, Joe Rogan should be able to speak—even if he is wrong https://t.co/DWdAcuk6JB",
  "data/tweet-economist/2022/2/1489162825058693123.json": "Sensible policy on psychedelic drugs is growing more common https://t.co/k341E15Yjr",
  "data/tweet-economist/2022/2/1489191707463856139.json": "Turkey's annual inflation rate rose to 48.7% in January, from 36.1% in December. But its president refuses to raise interest rates. What is he thinking?\nhttps://t.co/fOUWXv0Crt",
  "data/tweet-economist/2022/2/1489204287435644929.json": "We invented this tool in 1986 as a lighthearted guide to whether currencies are at their “correct” level. Here is the latest update https://t.co/ywFDwvQgRL",
  "data/tweet-economist/2022/2/1489235444139278346.json": "How high will interest rates go? They may have to rise sharply to fight inflation, but our cover story explains why the low-rate era is unlikely to end permanently https://t.co/7XJLekP3XO https://t.co/9YyxIBCcGR",
  "data/tweet-economist/2022/2/1489277018575450127.json": "Tucker Carlson of Trump-loving Fox News has been pushing an “America First” cocktail of disdainful isolationism, paranoid anti-elitism and Vladimir Putin fandom. Most Americans disagree with him https://t.co/br8DSjTVW2",
  "data/tweet-economist/2022/2/1489183684402028547.json": "Psychedelic therapy shows great promise. More states should legalise it https://t.co/PEOfxapUWg",
  "data/tweet-economist/2022/2/1489377374114390020.json": "What did Apple actually do, and why was it so costly? https://t.co/l7XfxyRE7J",
  "data/tweet-economist/2022/2/1489446016722034689.json": "Last year, citing privacy concerns, Apple forced apps to ask users if they want to be tracked. It seems most do not https://t.co/Mhw4I4qb1Z",
  "data/tweet-economist/2022/2/1489311746175254530.json": "This week’s cartoon from KAL: https://t.co/M2THiLChkq https://t.co/Zz1pmkSa65",
  "data/tweet-economist/2022/2/1489333297389973505.json": "Only two French presidents have won re-election since Charles de Gaulle. Our forecast gives Emmanuel Macron a high chance of becoming the third https://t.co/QqCjdqj5e1",
  "data/tweet-economist/2022/2/1489522422068002819.json": "Emmanuel Macron is highly likely to be re-elected as France’s president https://t.co/DRrdltDFEi",
  "data/tweet-economist/2022/2/1489630591704309762.json": "Companies based in rich countries often facilitate corruption abroad https://t.co/POx3rdNCHg",
  "data/tweet-economist/2022/2/1489752146631344129.json": "London has long been a playground for oligarchs. An anti-corruption group has identified £1.5bn ($2bn) of Russian money in property, most of it controlled by shell companies https://t.co/Zti5rIgbKM",
  "data/tweet-economist/2022/2/1489785611812757504.json": "Leaky oil-and-gas infrastructure is responsible for 22% of all man-made methane emissions. Patching up these leaks is a cheap way to slow the pace of global warming in the near term https://t.co/Z0pKNcQZPl",
  "data/tweet-economist/2022/2/1489783094014099456.json": "The financial impact on ad-sellers like Meta has been painful https://t.co/EQxWr7jfxh",
  "data/tweet-economist/2022/2/1489830706217992198.json": "NGOs are “like vultures”, complains a journalist and activist: they live off disasters, but do little to improve things. It is a common view https://t.co/7sJeVAd3Z1",
  "data/tweet-economist/2022/2/1489859758559485959.json": "A hospital in Congo has treated 103 raped children aged five or younger in the past three years. That is about one child every ten days https://t.co/P4Pu6O5Uyi",
  "data/tweet-economist/2022/2/1489877573521887233.json": "According to our French election model, Emmanuel Macron stands a good chance of winning a second term in April https://t.co/iWHHoeWOae https://t.co/Vw4LmvDXNz",
  "data/tweet-economist/2022/2/1489902386617462794.json": "In his new book, “Davos Man”, Peter Goodman says the World Economic Forum functions like billionaire therapy: a place where the very rich go to reassure themselves that they are the solution to social ills rather than the problem https://t.co/GrLAprLCL7",
  "data/tweet-economist/2022/2/1489928598706429961.json": "To understand the Roman empire, read Pliny the Younger https://t.co/23nEON2hZv",
  "data/tweet-economist/2022/2/1489864976261173250.json": "Despite the reproaches hurled his way by French voters, Emmanuel Macron is looking well-placed to keep his job https://t.co/nULuP64unW https://t.co/xO2UrhBLVO",
  "data/tweet-economist/2022/2/1489992217703981059.json": "“Magic mushrooms” will soon be used in Oregon to treat certain mental-health disorders.\n\n👉 Swipe to learn how psychedelic therapy shows tremendous promise, then read why other states should follow Oregon’s lead👇",
  "data/tweet-economist/2022/2/1489973097398734852.json": "As long as bitcoin and its ilk are decentralised, the ability of far-right groups to use them will remain https://t.co/1Df0tvSpR5",
  "data/tweet-economist/2022/2/1490035019393515520.json": "Between third and sixth grade, the children who attended preschool did worse on standardised tests, had lower school attendance, racked up more disciplinary infractions and needed more special-education services https://t.co/dGADRbLugL",
  "data/tweet-economist/2022/2/1489894752887705603.json": "Only two French presidents have won re-election since Charles de Gaulle. Our forecast gives Emmanuel Macron a high chance of becoming the third https://t.co/NxWXBahtVc",
  "data/tweet-economist/2022/2/1490178522664652800.json": "What Spotify data show about the decline of English https://t.co/4VkHftMMwH https://t.co/gT94DYkgHi",
  "data/tweet-economist/2022/2/1490264764886528004.json": "In his new book, “Davos Man”, Peter Goodman says the World Economic Forum functions like billionaire therapy: a place where the very rich go to reassure themselves that they are the solution to social ills rather than the problem https://t.co/WgXUqsU8g2",
  "data/tweet-economist/2022/2/1490014887984123912.json": "Emmanuel Macron remains a divisive figure in France. But his management of the economy and the pandemic should prove in his favour https://t.co/21EXn2QGeT https://t.co/S7Z0cydZtq",
  "data/tweet-economist/2022/2/1490295222013775878.json": "Employers offering low wages or poor conditions are struggling to fill positions: unfilled vacancies, at 30m across the rich world, have never been so high https://t.co/JEpTtZgOnK",
  "data/tweet-economist/2022/2/1490060420241149958.json": "Emmanuel Macron has a four-in-five chance of re-election, according to our new forecast https://t.co/oC4Z5Glqss",
  "data/tweet-economist/2022/2/1490398148514230279.json": "A number of papers have found that the economic benefits of child-care or pre-K programmes vastly outweigh the costs https://t.co/Z0XRqLY0TQ",
  "data/tweet-economist/2022/2/1490427856060567559.json": "The British pound is 17% undervalued against the US dollar, according to our latest calculations https://t.co/r0qsPerDEv",
  "data/tweet-economist/2022/2/1490223492914163715.json": "These findings support arguments made by advocates of “open science”, who say that new scientific results should be made available to other researchers and the public freely and quickly https://t.co/7DOnIaL9ML",
  "data/tweet-economist/2022/2/1490404524250517506.json": "Together, Russia and Ukraine account for 30% of global wheat exports https://t.co/IhjNLafkGu",
  "data/tweet-economist/2022/2/1490627171479658499.json": "Companies based in rich countries often facilitate corruption abroad https://t.co/Ff2AUgdJKg",
  "data/tweet-economist/2022/2/1490302015825752066.json": "Emmanuel Macron has a four-in-five chance of re-election, according to our new forecast https://t.co/mOdTxQ5GXu",
  "data/tweet-economist/2022/2/1490510302357635073.json": "The global gap between life expectancy and healthy life expectancy, a measure of how long a person lives without chronic health problems, is nearly ten years https://t.co/rC5a837PPj",
  "data/tweet-economist/2022/2/1490981976458895361.json": "Poor countries tend to do worse than rich ones, partly because poverty makes corruption worse and partly because corruption makes poverty worse https://t.co/xoOjj004os",
  "data/tweet-economist/2022/2/1490862525654900736.json": "During the worst fighting of the Russia-Ukraine war, in 2015, Russia sent no more than a dozen battalion tactical groups. By February 4th it had 83 in place near the border, with 14 more in transit https://t.co/rNUsVPlfpU",
  "data/tweet-economist/2022/2/1490953182708645888.json": "The data show that the hegemony of English is in decline https://t.co/efM4gN2OV5 https://t.co/3eMMOJAeuT",
  "data/tweet-economist/2022/2/1491053257418022917.json": "Save the rhino, save the plant https://t.co/C0FyngF510",
  "data/tweet-economist/2022/2/1490991423105212419.json": "America is uniting against Vladimir Putin https://t.co/u5DW0JD2kE",
  "data/tweet-economist/2022/2/1490470634794725376.json": "The data-rich environment of the metaverse could be an authoritarian’s dream https://t.co/UuMFxVKXQM",
  "data/tweet-economist/2022/2/1491156559388360704.json": "Where possible, they should be removed or redesigned https://t.co/xk4YhUTr8G",
  "data/tweet-economist/2022/2/1491240544449843200.json": "Living longer is of little use if the extra years are spent in bed https://t.co/HB3LU6fz8J",
  "data/tweet-economist/2022/2/1491312334756790280.json": "Rhinos were the only recorded dispersers of 35% of the large-fruited species found in the regions where data were available https://t.co/Z6SANM7tCW",
  "data/tweet-economist/2022/2/1491384663117639685.json": "The device worked well enough that all three users in the trial were able to stand up and take a few steps almost immediately after they had recovered from the surgery to have it implanted https://t.co/mMsmVb7YIv",
  "data/tweet-economist/2022/2/1491378104434110470.json": "A new study finds preschool can be detrimental to children https://t.co/iRcA7vV8My",
  "data/tweet-economist/2022/2/1490904038266884097.json": "A number of papers have found that the economic benefits of child-care or pre-K programmes vastly outweigh the costs https://t.co/En2cIfs00q",
  "data/tweet-economist/2022/2/1491562823205404679.json": "More than a third of the world’s population live under authoritarian rule while just 6.4% live in a full democracy, according to @TheEIU’s Democracy Index https://t.co/oeML3zYeek",
  "data/tweet-economist/2022/2/1491588995360432128.json": "Researchers have released 59 megajoules of energy—enough to run a 60-watt light bulb for 11 days—from nuclear fusion, the reaction that powers the sun. That is a new record https://t.co/88XBwh8wsl",
  "data/tweet-economist/2022/2/1491661270231273474.json": "For the second year in a row, the pandemic was the biggest source of strain on democratic freedom around the world https://t.co/pt9aBtFuUR",
  "data/tweet-economist/2022/2/1491738382493523972.json": "Which region recorded the steepest decline in democracy in 2021? https://t.co/59e0xsUosb",
  "data/tweet-economist/2022/2/1491750989996646401.json": "The financial system is in better shape than it was in 2008. But make no mistake: it faces a stern test. Our cover this week https://t.co/erceNK3uVm https://t.co/rd9fFXgrxL",
  "data/tweet-economist/2022/2/1491845201446543365.json": "This week’s cartoon from KAL: https://t.co/ZBv25ez7OA https://t.co/MRtlddBJp0",
  "data/tweet-economist/2022/2/1491971267502743552.json": "“Can humans change the way they behave, or does history repeat itself endlessly, with humans forever condemned to reenact past tragedies without changing anything except the décor?” asks the historian @harari_yuval  https://t.co/NpIXk1aMbs",
  "data/tweet-economist/2022/2/1492005419073613854.json": "The biggest challenge to the Western model of democracy over the coming years will come from China https://t.co/xW2pn3i895",
  "data/tweet-economist/2022/2/1491987673548038144.json": "It has always been assumed that noise is a problem unique to animals. But plants suffer too https://t.co/IoXwSIXEDY",
  "data/tweet-economist/2022/2/1492130759603331081.json": "What is the secret to a living a longer, healthier life? The world’s oldest country is searching for the answer 👇 https://t.co/eZBQzUpd13 https://t.co/adymUqJaFr",
  "data/tweet-economist/2022/2/1492101095551864838.json": "“I love Ukraine but I will not die for it.” Liza, a 26-year-old Ukrainian, on why she is preparing to leave https://t.co/eRgxJqZW0t",
  "data/tweet-economist/2022/2/1492237024052629510.json": "How did “Finlandisation”—a reference to Finland’s officially neutral status during the cold war—work in practice, and how might a similar status be applied to Ukraine? https://t.co/orECu8BQSk",
  "data/tweet-economist/2022/2/1492297176998887425.json": "In practice, the price of Finnish independence was that the Soviet Union would exert significant influence on the country’s politics https://t.co/TIpl99T8vC",
  "data/tweet-economist/2022/2/1492362865159942144.json": "A record 43% of India’s MPs who won seats in the 2019 general election had been charged with a crime, with 29% booked for grave offences such as rape and murder https://t.co/4D9U1t4Org",
  "data/tweet-economist/2022/2/1492388531125293058.json": "A fundamental question about the nature of history and of humanity lies “at the heart of the Ukraine crisis”, writes Yuval Noah Harari, the historian and author of “Sapiens”, in a commentary for The Economist. “Is change possible?”  https://t.co/qt7tKHGVY7",
  "data/tweet-economist/2022/2/1492377932098154497.json": "Omicron is unlikely to be the last variant of concern. Researchers have tried to map where the next one is most likely to emerge. \n\nRead our analysis of the study 👇",
  "data/tweet-economist/2022/2/1492402848751050754.json": "For Ukrainians nervously pondering their fate, “Finlandisation” does not seem appealing https://t.co/aX6BQatsGr",
  "data/tweet-economist/2022/2/1492312268087992323.json": "“If it again becomes normative for powerful countries to wolf down their weaker neighbours, it would affect the way people all over the world feel and behave,” says @harari_yuval. He explains what’s at stake in Ukraine with the threat of a Russian invasion https://t.co/eEoJ5AtAMO",
  "data/tweet-economist/2022/2/1492419719919542272.json": "Patients in the trial were not only able to stand and walk, but eventually also to swim and cycle https://t.co/NXGQZXzMTD",
  "data/tweet-economist/2022/2/1492398323747205122.json": "Allegations that Pegasus was used to spy on Israeli activists, politicians and businessmen have shifted public opinion about the software https://t.co/an7iCPoAqM",
  "data/tweet-economist/2022/2/1492453945264029697.json": "“I love Ukraine but I will not die for it.” Liza, a 26-year-old Ukrainian, on why she is preparing to leave https://t.co/aAyIjHJyaX",
  "data/tweet-economist/2022/2/1492434058239959040.json": "This week’s cartoon from KAL: https://t.co/LAtkMReYRG https://t.co/Mm8jD1l7YQ",
  "data/tweet-economist/2022/2/1492147930446368769.json": "The device worked well enough that all three users in the trial were able to stand up and take a few steps almost immediately after they had recovered from the surgery to have it implanted https://t.co/GQTR7Wm8PR",
  "data/tweet-economist/2022/2/1492417966964674568.json": "Ukraine has bought dozens of Turkey’s TB2 drone in recent years. Unfortunately for Ukraine, they are no match for Russia’s army https://t.co/GiAqplgp8d",
  "data/tweet-economist/2022/2/1492508564031774724.json": "“Finlandisation” might allow Ukraine to avoid an invasion—but the country would be firmly in Moscow’s grip https://t.co/ossfr7yLIm",
  "data/tweet-economist/2022/2/1492447150013304832.json": "Ukraine has forced America and its allies to bond. But the country’s future is still uncertain  https://t.co/HdT3fOyY58",
  "data/tweet-economist/2022/2/1492567435366604801.json": "Global democracy scores have never been this low, according to @TheEIU https://t.co/8BHjhJAWa5",
  "data/tweet-economist/2022/2/1492570727236710401.json": "The impact of the device on the lives of those in the small Swiss trial has already been dramatic https://t.co/32GPrObnJU",
  "data/tweet-economist/2022/2/1492578521927065600.json": "China and Russia are calling on @NATO to stop admitting new members—but this is “a blatant attempt to deny sovereign nations the right to make their own choices”, argues the organisation’s chief  https://t.co/6RMNkygXJV",
  "data/tweet-economist/2022/2/1492599423049814016.json": "Ethiopia has used Turkish drones against rebels in Tigray. Evidence suggests that one such air strike killed at least 58 civilians in January https://t.co/8AJKp0wyQ6",
  "data/tweet-economist/2022/2/1492375181943349256.json": "Despite its strengths, the Biden administration is turning out to be error-prone in an unerringly consistent fashion https://t.co/28sjF1cMpv",
  "data/tweet-economist/2022/2/1492647481368354818.json": "Russia is engaged in the largest military build-up in Europe since the cold war. Our interactive guide uses satellite images to show where its troops have massed https://t.co/0hy9k38wPB",
  "data/tweet-economist/2022/2/1492587334100996099.json": "Prosciutto, gorgonzola and tiramisu earn a red mark. Even olive oil should be consumed in moderation, suggests the EU’s Nutri-Score https://t.co/O5Cl8P2U4N",
  "data/tweet-economist/2022/2/1492705102834114561.json": "A treaty signed with the Soviet Union in 1948 became the basis for “Finlandisation” https://t.co/ce57Y3HCRT",
  "data/tweet-economist/2022/2/1492652530333061123.json": "Today “Columbo” oﬀers a welcome dose of familiarity to veteran viewers and reassur­ance all round, like the comedies of P.G. Wodehouse or the mysteries of Agatha Christie https://t.co/u21GD9lb7d",
  "data/tweet-economist/2022/2/1492589849714565121.json": "Emmanuel Macron may have an approval rating of below 40% but our French election model predicts that he stands the highest chance of winning https://t.co/WFYOpq73TD",
  "data/tweet-economist/2022/2/1492750646105284609.json": "Turkish drones have knocked out Russian-made tanks in Nagorno-Karabakh, Syria and Libya. They may do so again in Ukraine https://t.co/Eem5KPxcts",
  "data/tweet-economist/2022/2/1492763401059196928.json": "Around 100 Russian battalion tactical groups—troops, air defence, artillery and logistics—have gathered on Ukraine’s borders with Russia and Belarus. Satellite images have tracked their movement https://t.co/qFPEMtpgFk",
  "data/tweet-economist/2022/2/1492564180519591938.json": "“In the past few generations, for the first time in history the world became dominated by elites who see war as both evil and avoidable,” writes @harari_yuval. The historian argues that the decline of war “resulted from humans making better choices”  https://t.co/cohBTn2oXE",
  "data/tweet-economist/2022/2/1492807535086157829.json": "Emmanuel Macron remains a divisive figure in France. But his management of the economy and the pandemic should prove in his favour https://t.co/Gc2GhlPBl6 https://t.co/LeCjJbT98l",
  "data/tweet-economist/2022/2/1492697906691948546.json": "Last year South Korea’s arms exports exceeded imports for the first time https://t.co/frFeyRm8G6",
  "data/tweet-economist/2022/2/1492834716340400128.json": "Vladimir Putin's interpretation of the Minsk agreement from 2015 is a Trojan horse that would bring chaos to Ukraine https://t.co/KCmAMPdxMb",
  "data/tweet-economist/2022/2/1492841760569139207.json": "No French president has been re-elected for 20 years. Emmanuel Macron looks to be in prime position to break that pattern https://t.co/6gcF5fHdXp",
  "data/tweet-economist/2022/2/1492782361267871745.json": "The new device will need approval from medical regulators before it can be used in clinics https://t.co/xuafOfbsQz",
  "data/tweet-economist/2022/2/1492856858847195136.json": "This week’s cartoon from KAL: https://t.co/XwVqGeGyQp https://t.co/WgZEDqmM7n",
  "data/tweet-economist/2022/2/1492869191455674371.json": "Investors should question the idea that the best way to make polluters pollute less is to dump their shares. Instead, they should hold on to them and work with managers to reduce emissions https://t.co/L5YpXGIaSv",
  "data/tweet-economist/2022/2/1492702845308743687.json": "More reporters are missing—presumed kidnapped—in Mexico than anywhere else in the world. Even so, the events of recent weeks have shocked many  https://t.co/vmY4hICdej",
  "data/tweet-economist/2022/2/1492636149285806083.json": "The Brazilian modernist tradition proved extraordinarily fertile  https://t.co/JpFxeK5PfP",
  "data/tweet-economist/2022/2/1492916500709191681.json": "A poll found that more than a third of Africans either think the African Union is useless or have no opinion of it at all https://t.co/LBF6uqoufk",
  "data/tweet-economist/2022/2/1492919257969184771.json": "These satellite images show exactly how Ukraine is now ringed by Russian forces to its north, east and south https://t.co/gJ4JoXw5Ou",
  "data/tweet-economist/2022/2/1492996010863431697.json": "Last month South Korea's president agreed to a $3.5bn contract to sell a home-grown missile system to the UAE. It is the biggest deal in the history of the country’s defence industry https://t.co/La9WK0ZdNR",
  "data/tweet-economist/2022/2/1493037035627630592.json": "A majority of Democrats (67%) and Republicans (50%) want the Supreme Court to smack down partisan gerrymanders https://t.co/FT6pzta1ry",
  "data/tweet-economist/2022/2/1493056678660612100.json": "More reporters are missing—presumed kidnapped—in Mexico than anywhere else in the world. Even so, the events of recent weeks have shocked many  https://t.co/NUQcWNhzEV",
  "data/tweet-economist/2022/2/1493269850655014914.json": "Will Vladimir Putin launch his war in Ukraine? We explain why Russia’s military build-up has entered a more dangerous phase ⬇️ https://t.co/81wNh0Ac51\n\n📷: @Maxar https://t.co/Z475CqOVKz",
  "data/tweet-economist/2022/2/1493048468142792704.json": "The device worked well enough that all three users in the trial were able to stand up and take a few steps almost immediately after they had recovered from the surgery to have it implanted https://t.co/xxTtLVuKuT",
  "data/tweet-economist/2022/2/1493359682655866880.json": "Many pro-Russians decided that they neither wanted to die for Russia nor see their city racked by conflict. The vast majority of younger Odessans are proud to be Ukrainian https://t.co/9L9kjWNXQf",
  "data/tweet-economist/2022/2/1493333508378574849.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships? https://t.co/REbZWiO21p",
  "data/tweet-economist/2022/2/1493145826037805056.json": "Whether the end is war or detente, today's suspense can surely not be sustained for long https://t.co/NwHQnIc9eu",
  "data/tweet-economist/2022/2/1493481977604984836.json": "Women are disproportionately likely to publish in fields related to health and psychology; they remain less likely to publish in maths, physics and engineering https://t.co/SymTzjmqYy",
  "data/tweet-economist/2022/2/1493412271892144133.json": "White power, dark money https://t.co/zXUJKDA2lk",
  "data/tweet-economist/2022/2/1493558488689164290.json": "Journalists are flocking to Ukraine to arrive in time for a war that the Americans are now suggesting could begin as soon as February 16th https://t.co/GmB5bXA6eP",
  "data/tweet-economist/2022/2/1493570567487774724.json": "Alexei Navalny displays the extraordinary bravery of an ordinary man. Read about the making of Russia’s political prisoner number one \nhttps://t.co/2u6yNofLa9",
  "data/tweet-economist/2022/2/1493653440177782784.json": "Why can’t Russia leave Ukraine alone?\n\nVladimir Putin has already annexed Crimea and plunged Donbas into war. Now, he has amassed 100,000 troops at the Ukrainian border https://t.co/XmS25MbUAD",
  "data/tweet-economist/2022/2/1493707198702174209.json": "Why do these regions matter? And how might Russian recognition of their independence alter the crisis? https://t.co/vh2i6YTn4t",
  "data/tweet-economist/2022/2/1493756409883865088.json": "“In the past few generations, for the first time in history the world became dominated by elites who see war as both evil and avoidable,” writes @harari_yuval. The historian argues that the decline of war “resulted from humans making better choices”  https://t.co/lCymvIyUpi",
  "data/tweet-economist/2022/2/1493737156883460098.json": "If Russia were now to formally recognise the two breakaway republics in south-eastern Ukraine as independent entities it would amount to something just short of annexation https://t.co/x9fHdVcLwb",
  "data/tweet-economist/2022/2/1493534689629511680.json": "No French president has been re-elected for 20 years. Emmanuel Macron looks to be in prime position to break that pattern https://t.co/7UnIl1cHIn",
  "data/tweet-economist/2022/2/1493529860093972481.json": "“In the past few generations, for the first time in history the world became dominated by elites who see war as both evil and avoidable,” writes @harari_yuval. The historian argues that the decline of war “resulted from humans making better choices”  https://t.co/EFPsG2BzBL",
  "data/tweet-economist/2022/2/1493884089031663618.json": "Russia and Ukraine share a history dating back to medieval times, but since the dissolution of the Soviet Union in 1991 their relationship has been increasingly fraught. \n\nWhy can’t Russia accept its neighbour’s independence? https://t.co/ZvBMBKx1nj",
  "data/tweet-economist/2022/2/1493954564340523010.json": "Why is Putin so afraid of young people? https://t.co/crBnnjB4Rp",
  "data/tweet-economist/2022/2/1493890338217472000.json": "Uyghurs in London often shun public events: “There are many Chinese spies. If I go there, the next day my family will disappear\" https://t.co/oD47KX8Rip",
  "data/tweet-economist/2022/2/1494042178565324808.json": "Better than you might think https://t.co/1aqSktcny7",
  "data/tweet-economist/2022/2/1494061796008857600.json": "The truckers are wrong about the vaccine mandate at the border. But they have every right to express their disagreement https://t.co/pEfwntzhXx",
  "data/tweet-economist/2022/2/1493821008826019842.json": "Canada once seemed immune to the raucous populism that in 2016 helped bring about Donald Trump’s election and Britain’s vote for Brexit. Now it seems to have become a superspreader https://t.co/kOGFXlhrzk",
  "data/tweet-economist/2022/2/1494100306656960522.json": "However powerful the villain, the scruffy detective always outwits them https://t.co/s2v925LNZl",
  "data/tweet-economist/2022/2/1494108363285745665.json": "“Can humans change the way they behave, or does history repeat itself endlessly, with humans forever condemned to reenact past tragedies without changing anything except the décor?” asks the historian @harari_yuval  https://t.co/oV0N1sXPhF",
  "data/tweet-economist/2022/2/1494182583923625984.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/xn08n6ISp0",
  "data/tweet-economist/2022/2/1494190792864325632.json": "A record 43% of India’s MPs who won seats in the 2019 general election had been charged with a crime, with 29% booked for grave offences such as rape and murder https://t.co/9PDHD0Om2Y",
  "data/tweet-economist/2022/2/1494186626364448775.json": "Ukraine and the West would object loudly to the redrawing of international borders by force. Whether that would raise or lower the risk of a wider war is uncertain https://t.co/jbcTeNawdo",
  "data/tweet-economist/2022/2/1494269668672122885.json": "“Putin is afraid of the young”: meet the 23-year-old Russian activist living under house arrest https://t.co/48zm1JkMt9",
  "data/tweet-economist/2022/2/1494288551768428549.json": "Canada is not yet a rancorous or bitterly divided society. If Justin Trudeau wants to keep it that way, he should stop trying to police Canadians’ thoughts https://t.co/9PTJyqaPe4",
  "data/tweet-economist/2022/2/1494296259871621128.json": "Vladimir Putin is stuck in a corner. Whether he invades Ukraine or backs down, the autocratic president has damaged Russia. Our cover this week https://t.co/4wU3EoWnrW https://t.co/xXizt6LCj0",
  "data/tweet-economist/2022/2/1494309171126276101.json": "Italy has one of the lowest adult obesity rates in the rich world. So why do proposed EU ratings categorise much of its food as unhealthy? https://t.co/P86y4qSjsh",
  "data/tweet-economist/2022/2/1494346186957938690.json": "Russia and Ukraine share a history dating back to medieval times, but since the dissolution of the Soviet Union in 1991 their relationship has been increasingly fraught. \n\nWhy can’t Russia accept its neighbour’s independence? https://t.co/p7pcolENtC",
  "data/tweet-economist/2022/2/1494371092235960329.json": "In 2007, Vladimir Putin rattled Angela Merkel by introducing her to his labrador, despite Ms Merkel's well-known phobia of dogs https://t.co/saT7ppTbGc",
  "data/tweet-economist/2022/2/1494396486863441925.json": "Alexei Navalny displays the extraordinary bravery of an ordinary man. Read about the making of Russia’s political prisoner number one \nhttps://t.co/eXnSkucPPv",
  "data/tweet-economist/2022/2/1494373089064501254.json": "Women fared worse than men https://t.co/oIDYFVKjqt",
  "data/tweet-economist/2022/2/1494372835309113350.json": "The gains that Vladimir Putin has made—such as making himself the centre of global attention—are tactical. Even as he has won them, in a longer-lasting and more strategic sense, he has lost ground https://t.co/UvmybwSPts",
  "data/tweet-economist/2022/2/1494319233580339203.json": "War or no war, Vladimir Putin has damaged Russia by engineering this crisis https://t.co/Z4rs75Gn44",
  "data/tweet-economist/2022/2/1494455631897632770.json": "Having marched its troops to the border, Russia now seems to be taken aback by the strength of the information weapon being used against it https://t.co/CC7yaimUSW",
  "data/tweet-economist/2022/2/1494547886335569921.json": "The firm plans to send its containerised mRNA factories—which it calls Biontainers—to parts of the world which lack their own vaccine-manufacturing capabilities https://t.co/IeaXGz0e3K",
  "data/tweet-economist/2022/2/1494535413523963906.json": "Between 2007 and 2020 Chinese development banks provided $23bn for African infrastructure, compared with $9.1bn from all other development banks https://t.co/0ON3VGGi4p",
  "data/tweet-economist/2022/2/1494564644731736093.json": "Most potatoes can be traced to a single Chilean island https://t.co/tyHGI6mEHE",
  "data/tweet-economist/2022/2/1494576589857828875.json": "After 12 years in power, Britain’s Conservative MPs have become careless of the law and addicted to protest and rebellion. Instead of governing, they posture and grandstand https://t.co/dJHwc5fDFO",
  "data/tweet-economist/2022/2/1494363684080164865.json": "RT @duncanrobinson: This week's column: the British state is getting more costly and providing less https://t.co/m0rXNU1Pxx",
  "data/tweet-economist/2022/2/1494658771603316740.json": "The EU still takes 27% of all Russian exports; China about half that. Russia can either live with this interdependency or turn further towards China https://t.co/jSDHROQz0g",
  "data/tweet-economist/2022/2/1494506614816133133.json": "Faced with this ruckus, Canada’s government should have drawn a clear distinction between harmful acts and obnoxious or foolish words https://t.co/qt6mo2Hpyc",
  "data/tweet-economist/2022/2/1494636258907369475.json": "Businesspeople, diplomats and officials in Moscow say that a war in Ukraine would be unfathomably ruinous for Russia https://t.co/fPSX7yYCLH",
  "data/tweet-economist/2022/2/1494706889959092240.json": "Russia and Ukraine share a history dating back to medieval times, but since the dissolution of the Soviet Union in 1991 their relationship has been increasingly fraught. \n\nWhy can’t Russia accept its neighbour’s independence? https://t.co/hk0UHktxBd",
  "data/tweet-economist/2022/2/1494415867681329154.json": "Vladimir Putin is enjoying escalation dominance: he can attack, he can pull back or, for a while at least, he can stay put, commanding the world’s attention https://t.co/ehqFBLQqIC",
  "data/tweet-economist/2022/2/1494695211590733830.json": "If Vladimir Putin takes Russia to war, his wealthy cronies stand to lose much, if not all, of what they have gained https://t.co/RIcG57SZxS",
  "data/tweet-economist/2022/2/1494763650527252480.json": "Russia has been increasing its military presence around Ukraine for weeks. \n\nRead how open-source intelligence has made it possible to observe this in more detail than ever before 👇",
  "data/tweet-economist/2022/2/1494705030821289984.json": "African countries have learnt how to game the African Union. Few are better at this than Ethiopia  https://t.co/gUccC3kSu3",
  "data/tweet-economist/2022/2/1494454639445561350.json": "“Can humans change the way they behave, or does history repeat itself endlessly, with humans forever condemned to reenact past tragedies without changing anything except the décor?” asks the historian @harari_yuval  https://t.co/vFaVOG8AC9",
  "data/tweet-economist/2022/2/1494724664203034624.json": "Mexican voters were fed up with the racketeering that had marred previous governments. As a result, Andrés Manuel López Obrador has made personal austerity a symbol https://t.co/nOo95bFyY2",
  "data/tweet-economist/2022/2/1494826833514307584.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/9imURAFGMo",
  "data/tweet-economist/2022/2/1494818524426088452.json": "Vladimir Putin is stuck in a corner. He could lash out—yet a retreat now may only lead to an attack later. By standing up to the threat he poses, the West has the best chance of deterring that fateful choice https://t.co/KaQl1LRbds",
  "data/tweet-economist/2022/2/1494479176476278787.json": "The Economist has used open-source intelligence to monitor the Russian build-up in Ukraine over recent weeks https://t.co/iUYCkd40kT",
  "data/tweet-economist/2022/2/1494860550383312897.json": "Andrés Manuel López Obrador clearly senses danger https://t.co/A52na2mwJL",
  "data/tweet-economist/2022/2/1494739689013710850.json": "Vladimir Putin’s next move is anyone’s guess. We are following developments closely. \n\nJoin us here ⬇️",
  "data/tweet-economist/2022/2/1494858796086218754.json": "Some 60% of Afghanistan is at risk of acute hunger. Already some families have been reduced to eating dry flour. People are selling body parts and children https://t.co/995arDdnST",
  "data/tweet-economist/2022/2/1494828845266083841.json": "Female officials tend to have fewer opportunities to take bribes or improperly wield connections, according to new research https://t.co/ViXoeZUQZQ",
  "data/tweet-economist/2022/2/1494756123357945860.json": "In lazy hands, a genre is a shortcut or a comfort blanket; in talented ones, it is a challenge. Jane Campion rises to it triumphantly in “The Power of the Dog” https://t.co/lgn0RRfxmn",
  "data/tweet-economist/2022/2/1494915848175329280.json": "War would do far greater harm to Russia than the threat of war. It would galvanise the West and make Vladimir Putin a pariah. Russia would be blighted, first by sanctions and later by still deeper autarky and repression https://t.co/IJx4JfSIoI",
  "data/tweet-economist/2022/2/1494934815677759488.json": "Female politicians may avoid corruption because they are more severely punished for it https://t.co/UxWsOT6LC5",
  "data/tweet-economist/2022/2/1495015080571846662.json": "War or no war, Vladimir Putin has damaged Russia by engineering this crisis https://t.co/aVMVGrLAj0",
  "data/tweet-economist/2022/2/1494995031085699079.json": "PayPal holds a unique position in Silicon Valley mythology. A startling number of its co­founders and honchos have gone on to corporate greatness https://t.co/2to34FLAhm",
  "data/tweet-economist/2022/2/1495005242953400320.json": "Russia has been increasing its military presence around Ukraine for weeks. \n\nRead how open-source intelligence has made it possible to observe this in more detail than ever before 👇",
  "data/tweet-economist/2022/2/1495020605237833733.json": "In many cases Chinese firms are scooping up work because they have no competition—many Western firms stay away because they think Africa is too risky https://t.co/wFM3RH63mt",
  "data/tweet-economist/2022/2/1495026889186070532.json": "Since the news broke last month, at his hours-long morning news conferences he has followed the populist textbook of distracting attention by inventing enemies of the people https://t.co/FEm3yWiTNO",
  "data/tweet-economist/2022/2/1495008833147703298.json": "Vladimir Putin’s next move is anyone’s guess. We are following developments closely. \n\nJoin us here ⬇️",
  "data/tweet-economist/2022/2/1495047039905902598.json": "Russia has consistently denied that it plans to attack Ukraine. But Western security officials say that they have had insight into Vladimir Putin’s war plans for months https://t.co/h6OzBbLUn7",
  "data/tweet-economist/2022/2/1494950785767116800.json": "Vladimir Putin's brinkmanship may bring him short-term gains. But it will make Russia weaker, and Russians more resentful of his rule https://t.co/PQY8Vjxss1",
  "data/tweet-economist/2022/2/1495083779949477895.json": "Canada is not yet a rancorous or bitterly divided society. If Justin Trudeau wants to keep it that way, he should stop trying to police Canadians’ thoughts https://t.co/livDnY6txI",
  "data/tweet-economist/2022/2/1495107924636712964.json": "After 12 years in power, Britain’s Conservative MPs have become careless of the law and addicted to protest and rebellion. Instead of governing, they posture and grandstand https://t.co/2cRThcGwEN",
  "data/tweet-economist/2022/2/1495115730026733569.json": "Almost the entire population of Afghanistan could be living in abject poverty—under $1.90 a day—by the middle of the year https://t.co/YWBRgn1qzP",
  "data/tweet-economist/2022/2/1495075460690104327.json": "The gains that Vladimir Putin has made—such as making himself the centre of global attention—are tactical. Even as he has won them, in a longer-lasting and more strategic sense, he has lost ground https://t.co/rsAh9dAPIa",
  "data/tweet-economist/2022/2/1494941581291536389.json": "If Britain is to have the government it needs, getting rid of Boris Johnson will not be enough https://t.co/wfIO3Kr9it",
  "data/tweet-economist/2022/2/1495114983948099591.json": "Diplomacy still has a chance, but time is running out https://t.co/iTejmC1bMW",
  "data/tweet-economist/2022/2/1495253393744478209.json": "More than a third of the world’s population live under authoritarian rule while just 6.4% enjoy a full democracy https://t.co/8ulgVSJqFL",
  "data/tweet-economist/2022/2/1495101893902848003.json": "If every person on Earth consumed at the rate of the average American, carbon emissions would increase greatly—about three-fold https://t.co/pcAKqEgBvR",
  "data/tweet-economist/2022/2/1495255903393783809.json": "Officially, China does not recognise dual nationality. But if there is any flexibility, it seems to apply mainly to ethnic-Chinese foreigners with a shot at gold https://t.co/1MTI7T4Tfk",
  "data/tweet-economist/2022/2/1495286862902177803.json": "The bonds forged between Ukraine and the West in crisis will not suddenly dissolve if Russia pulls back. That is the opposite of what Vladimir Putin wanted https://t.co/o6zdVSo5Qr",
  "data/tweet-economist/2022/2/1495270599773536259.json": "Faced with this ruckus, Canada’s government should have drawn a clear distinction between harmful acts and obnoxious or foolish words https://t.co/HyXdcfgaSM",
  "data/tweet-economist/2022/2/1495323467394297857.json": "Italy has one of the lowest adult obesity rates in the rich world. So why do proposed EU ratings categorise much of its food as unhealthy? https://t.co/bnrunhYNX3",
  "data/tweet-economist/2022/2/1495217409933946881.json": "Canada once seemed immune to the raucous populism that in 2016 helped bring about Donald Trump’s election and Britain’s vote for Brexit. Now it seems to have become a superspreader https://t.co/4GM9TkBvbi",
  "data/tweet-economist/2022/2/1495133349681192971.json": "Most Russians want what is good for them more than what is bad for the West. They do not want the perpetual prospect of war https://t.co/3OSxE31ZF4",
  "data/tweet-economist/2022/2/1495360617129168904.json": "“Can humans change the way they behave, or does history repeat itself endlessly, with humans forever condemned to reenact past tragedies without changing anything except the décor?” asks the historian @harari_yuval  https://t.co/7WTjMhX5E1",
  "data/tweet-economist/2022/2/1495377458891313155.json": "Vladimir Putin has bolstered Ukraine’s relationship with the West and put Europe’s security on the agenda. But his most intriguing loss is at home https://t.co/Evnv0sVDn4",
  "data/tweet-economist/2022/2/1495052728384512008.json": "If Germany can get this phase of its green energy transition right, it could prove a model for other industrialised democracies https://t.co/vCUwhe99PQ",
  "data/tweet-economist/2022/2/1495360118661292039.json": "The story of PayPal’s birth, as described in “The Founders”, is gripping. The company was born during the internet boom of the late 1990s, when money poured into Silicon Valley https://t.co/Cb3sWixUNB",
  "data/tweet-economist/2022/2/1495152497094279168.json": "If war comes to Europe, open-source intelligence means that it will be visible as never before https://t.co/RE3sDDGsvk",
  "data/tweet-economist/2022/2/1495445908078710792.json": "The truckers are wrong about the vaccine mandate at the border. But they have every right to express their disagreement https://t.co/QXESp2mrM8",
  "data/tweet-economist/2022/2/1495444698592387072.json": "Russia is widely recognised as the world leader in digital warfare. We explain what could unfold if a cyber invasion happens https://t.co/FT3sGtLIjF",
  "data/tweet-economist/2022/2/1495345384822124548.json": "Diplomacy still has a chance, but time is running out https://t.co/PItUloavkU",
  "data/tweet-economist/2022/2/1495455227159494656.json": "The Conservatives pride themselves on being the natural party of government. It is a tragedy for Britain that they are now so poor at governing https://t.co/vxVmyYjfAu",
  "data/tweet-economist/2022/2/1495515127885578247.json": "America and its NATO allies have long spied on Russian military deployments. Now technology allows civilians to see what's going on, too https://t.co/uk39q9TVYn",
  "data/tweet-economist/2022/2/1495244184462274561.json": "Despite the ravages of urbanisation, China has much left to protect—it is home to 10% of the world’s plant species, 14% of animal ones and 20% of fish https://t.co/ad38qORLNQ",
  "data/tweet-economist/2022/2/1495581808787865605.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/D5pwsgSh0v",
  "data/tweet-economist/2022/2/1495398113489657865.json": "Chinese firms can usually deliver a big project within a single election cycle, thereby handing Africa's incumbent leaders a ribbon-cutting photo opportunity shortly before their people vote https://t.co/MtbM6HwvpF",
  "data/tweet-economist/2022/2/1495569223766183938.json": "Are women really less corrupt than men? https://t.co/ztNjDUtLyL",
  "data/tweet-economist/2022/2/1495543809895186438.json": "The EU still takes 27% of all Russian exports; China about half that. Russia can either live with this interdependency or turn further towards China https://t.co/Q6R00jIbdQ",
  "data/tweet-economist/2022/2/1495741544841850881.json": "Are women really less corrupt than men? https://t.co/TFIaBy0LfB",
  "data/tweet-economist/2022/2/1495755199817961472.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/S7kj7GUeMj",
  "data/tweet-economist/2022/2/1495775918677237760.json": "Canada is not yet a rancorous or bitterly divided society. If Justin Trudeau wants to keep it that way, he should stop trying to police Canadians’ thoughts https://t.co/a3kRtDWxtm",
  "data/tweet-economist/2022/2/1495496025158692866.json": "He has changed how the world sees Russia: it is the sort of country that might launch a large-scale war of aggression https://t.co/IFKxoxGICK",
  "data/tweet-economist/2022/2/1495732796907827208.json": "The truckers are wrong about the vaccine mandate at the border. But they have every right to express their disagreement https://t.co/0UjfJAFUu7",
  "data/tweet-economist/2022/2/1495608220819226624.json": "China is likely to be the bigger loser from the technological and economic decoupling from America that is under way https://t.co/al07bTcoON",
  "data/tweet-economist/2022/2/1495458964460523521.json": "Vladimir Putin’s next move is anyone’s guess. We are following developments closely. \n\nJoin us here ⬇️",
  "data/tweet-economist/2022/2/1495854607716823046.json": "Russia’s parliament wants to formally recognise the independence of the two self-proclaimed republics https://t.co/A3JJnevzGW",
  "data/tweet-economist/2022/2/1495859646464155655.json": "Humanity’s greatest political achievement has been the decline of war. That is now in jeopardy https://t.co/kCgpqXYVBB",
  "data/tweet-economist/2022/2/1495872470401830913.json": "It is the biggest concentration of firepower in Europe since the cold war https://t.co/AVDICuI9Yw",
  "data/tweet-economist/2022/2/1495867283960479750.json": "Russia’s parliament wants to formally recognise the independence of the two self-proclaimed republics  https://t.co/UxJpLbOhCO",
  "data/tweet-economist/2022/2/1495867188275814403.json": "Better than you might think https://t.co/BCDhacZDha",
  "data/tweet-economist/2022/2/1495894444117274626.json": "Why do these regions matter? And how might Russian recognition of their independence alter the course of the crisis?  https://t.co/bAvoPwtYub",
  "data/tweet-economist/2022/2/1495907622276448256.json": "The move makes diplomacy much harder and increases the chance of war  https://t.co/iNgrt4pYf1",
  "data/tweet-economist/2022/2/1495917775147212803.json": "Vladimir Putin is courting disaster for Russia’s neighbour—and himself https://t.co/1FTf3mBS37",
  "data/tweet-economist/2022/2/1495931276964020226.json": "In a move that seemed to take Europe to the brink of war, Vladimir Putin officially recognised the breakaway “people’s republics” of Donetsk and Luhansk in eastern Ukraine, and said he would deploy Russian troops to them  https://t.co/qd8veuYLU1",
  "data/tweet-economist/2022/2/1495911628503760906.json": "Human suffering, economic shock and a geopolitical realignment https://t.co/YrClZu2A5P",
  "data/tweet-economist/2022/2/1495948214079561737.json": "Shelling along the line of control has increased dramatically this month. Leaders of the breakaway regions have begun moving civilians to Russia  https://t.co/96OXxooGPA",
  "data/tweet-economist/2022/2/1495964315253366784.json": "In a long and threatening speech Russia’s president questioned the legitimacy of Ukraine’s independence and accused NATO of using it as a base from which to threaten his country  https://t.co/OtZhgOdHJJ",
  "data/tweet-economist/2022/2/1495629403421822985.json": "A greater reliance on China would condemn Russia to being the junior partner of an unsentimental regime which sees it as a diplomatic sidekick and a backward source of cheap commodities https://t.co/5nr2faU3uN",
  "data/tweet-economist/2022/2/1496003587507429377.json": "The mayor is ready for anything https://t.co/l6Rcxifsxb",
  "data/tweet-economist/2022/2/1496043350713065479.json": "Vladimir Putin’s speech, filled with anger and resentment, provided the ideological foundations for further military action, should Russia’s president decide on it https://t.co/SAOeboUqNZ",
  "data/tweet-economist/2022/2/1496051849564241927.json": "Humanity’s greatest political achievement has been the decline of war. That is now in jeopardy https://t.co/wH8Tl02odb",
  "data/tweet-economist/2022/2/1496048008819089408.json": "Better than you might think https://t.co/j68rJUOpVd",
  "data/tweet-economist/2022/2/1496064478353534978.json": "Russia’s parliament wants to formally recognise the independence of the two self-proclaimed republics https://t.co/5YpPOHNhxW",
  "data/tweet-economist/2022/2/1496092300472197122.json": "Olaf Scholz, Germany’s chancellor, says he will not allow Nord Stream 2 to operate. It is the biggest in a raft of sanctions imposed against Russia by Western countries. We explain why the gas pipeline is so controversial https://t.co/PljaV8F8mH",
  "data/tweet-economist/2022/2/1496094263989387274.json": "♦️ Olaf Scholz halts the Nord Stream 2 gas pipeline.\n\n♦️ Russia’s parliament ratifies Vladimir Putin’s decrees to recognise Donetsk and Luhansk.\n\n♦️ President Volodymyr Zelensky considers severing diplomatic ties with Russia. \n\nStay up to date on the crisis in Ukraine ⬇️",
  "data/tweet-economist/2022/2/1496108799215783936.json": "Olaf Scholz’s decision that Nord Stream 2 should not operate is the biggest in a raft of sanctions imposed against Russia by Western countries https://t.co/BdXLDqniHz",
  "data/tweet-economist/2022/2/1496130901968887812.json": "It is the biggest concentration of firepower in Europe since the cold war https://t.co/5cR53y0V4C",
  "data/tweet-economist/2022/2/1496192584993157129.json": "Most of what Russia’s president said was utter nonsense, but the implication that something terrible is soon to happen may not be https://t.co/BabMfVHYsO",
  "data/tweet-economist/2022/2/1496203033935740928.json": "More than a third of the world’s population live under authoritarian rule while just 6.4% enjoy a full democracy https://t.co/JcxymtivHg",
  "data/tweet-economist/2022/2/1496216237554155528.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/hEMqyMv214",
  "data/tweet-economist/2022/2/1496268832851247110.json": "White power, dark money https://t.co/Y4HwGsfFTw",
  "data/tweet-economist/2022/2/1496392395889557505.json": "Vladimir Putin has alleged that Ukraine is committing “genocide” against Russian-speaking citizens of the Donbas. But all the evidence points to Russian-backed escalation of hostilities https://t.co/dhg8VTLW40",
  "data/tweet-economist/2022/2/1496399240599420932.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/LtJvGTGfdi",
  "data/tweet-economist/2022/2/1496417812738416640.json": "They show tremendous potential in treating certain mental-health disorders https://t.co/9Cv66jIRbw",
  "data/tweet-economist/2022/2/1496424869365436421.json": "It is the biggest concentration of firepower in Europe since the cold war https://t.co/BUcTeZ5HvX",
  "data/tweet-economist/2022/2/1495999459917979656.json": "The show’s creator, Steven Knight, says he wanted to offer a more nuanced depiction of the working class compared with other period dramas https://t.co/7KoTmZc7pN",
  "data/tweet-economist/2022/2/1496480816821645318.json": "Humanity’s greatest political achievement has been the decline of war. That is now in jeopardy https://t.co/KIRh580rhF",
  "data/tweet-economist/2022/2/1496522757475086340.json": "More than a third of the world’s population live under authoritarian rule while just 6.4% enjoy a full democracy https://t.co/ljmIHZ6Nt9",
  "data/tweet-economist/2022/2/1496539237038137352.json": "A wise government would listen and respond politely, taking protesters’ complaints seriously and patiently explaining why covid restrictions are necessary for the time being. Justin Trudeau has done the opposite https://t.co/h4njMHEby0",
  "data/tweet-economist/2022/2/1496362426878545920.json": "An unpleasant cold-war arrangement is contemplated for Ukraine https://t.co/G5wSuBs8Ra",
  "data/tweet-economist/2022/2/1496541137917685767.json": "Italy has one of the lowest adult obesity rates in the rich world. So why do proposed EU ratings categorise much of its food as unhealthy? https://t.co/e5tCmHauIa",
  "data/tweet-economist/2022/2/1496587053148033027.json": "If Russia invades Ukraine, there is “no doubt” that the country “should pay a significant price”, says Dmitri Alperovitch. “But immediately slapping Russia with the full range of economic penalties risks leading to a spiralling situation” https://t.co/CC0VP762xJ",
  "data/tweet-economist/2022/2/1496694085238804480.json": "BREAKING: Vladimir Putin goes to war, after announcing a “special military operation” with the aim of demilitarising and “denazifying” Ukraine https://t.co/qBLMHY5FW8",
  "data/tweet-economist/2022/2/1496699582792806402.json": "Shortly after the declaration there were reports of explosions in Kyiv and several other cities around Ukraine, including Kharkiv, Kramatorsk, Odessa and Mariupol. There were also unconfirmed reports of firing around Kyiv airport https://t.co/nGgQcSCPX7",
  "data/tweet-economist/2022/2/1496702608681095172.json": "The Russian elite has long believed that the dire consequences made a war of choice unthinkable for a calculating man like the president. But, as we wrote recently, the growing prospect of war left them deeply unnerved https://t.co/gyZU7peUrW",
  "data/tweet-economist/2022/2/1496715592203522050.json": "Our coverage explains what’s at stake, what lies behind Vladimir Putin’s thinking and what might happen next https://t.co/8xbSn0h0LW",
  "data/tweet-economist/2022/2/1496717010801147909.json": "Russia was not threatened by NATO or Ukraine. Its invasion of the sovereign state next door is a war of choice, conjured out of nothing by Vladimir Putin. History will judge him harshly https://t.co/2xfOKB5uWh",
  "data/tweet-economist/2022/2/1496712019025793028.json": "America and its allies will respond “in a united and decisive wave”, Joe Biden says, after explosions are reported in cities around Ukraine. Follow the latest updates https://t.co/35TC6QqeBg",
  "data/tweet-economist/2022/2/1496731373952184326.json": "Last year we explained how Russia’s president had been silencing his opponents https://t.co/fjPBFHnDsi",
  "data/tweet-economist/2022/2/1496727641684340738.json": "Invading Ukraine could ultimately prove Vladimir Putin’s undoing, we wrote in a recent article, if it turns into a bloody quagmire or makes Russians poorer, angrier and more eager for change https://t.co/TjXeUnAw7s",
  "data/tweet-economist/2022/2/1496734921389674500.json": "Russia has never accepted Ukrainian independence. We explain the history of the forced brotherhood between the two countries https://t.co/1j5slnKJWZ",
  "data/tweet-economist/2022/2/1496654060333801478.json": "How bad could a modern cyberwar be, and will other countries be affected?  https://t.co/4vr9CxicDP",
  "data/tweet-economist/2022/2/1496738752873795587.json": "Now that hostilities are breaking out, the most immediate question is how far Russia is prepared to go to subdue its neighbour https://t.co/8lCF3p4nLR",
  "data/tweet-economist/2022/2/1496750402926227457.json": "Vladimir Putin has gone to war in Ukraine. President Joe Biden has promised that America and its allies would respond “in a united and decisive way”.\n\nCatch up quickly on the latest updates ⬇️",
  "data/tweet-economist/2022/2/1496750261314134017.json": "NATO will not fight for Ukraine. Instead America and Europe have mustered a three-pronged response https://t.co/Ip9wFM6DDa",
  "data/tweet-economist/2022/2/1496746225802309632.json": "Russia’s military build-up around the Ukraine border was detected through open-source intelligence such as images and other data from commercial satellites https://t.co/GK2fXgWIWt",
  "data/tweet-economist/2022/2/1496752768237056005.json": "The origins of the crisis lie in 2014, when an uprising toppled Viktor Yanukovych, Ukraine’s then president. Since then, as Ukraine’s government turned to the West for political and military support, Vladimir Putin has grown more hostile https://t.co/QX4DbIr0xW",
  "data/tweet-economist/2022/2/1496758671950426116.json": "Why can’t Russia accept Ukraine’s independence?\n\nOur film explains. Watch here ⬇️",
  "data/tweet-economist/2022/2/1496762089784115204.json": "Since the cold war, western European countries have tended to shrug off this nasty side of Gazprom. Instead they have become overdependent on its gas https://t.co/xtjycbEhLQ",
  "data/tweet-economist/2022/2/1496768625344389124.json": "The threat of war in Ukraine has been evoking long-standing fears across the region, as we explained recently https://t.co/yXtdTQsLCT",
  "data/tweet-economist/2022/2/1496767045563731969.json": "Vladimir Putin has declared war on Ukraine. We are following the conflict closely.\n\nLearn what’s at stake and what might happen next ⬇️",
  "data/tweet-economist/2022/2/1496773160943128576.json": "Anxious messages in group chats and families divided: not all Ukrainians have been feeling the same way about the threat of war https://t.co/bQZAm1HIwu",
  "data/tweet-economist/2022/2/1496771842178228224.json": "Video evidence appears to show Russian troops crossing the border into Ukraine from both Crimea in the south and Belarus in the north.\n\nCatch up with the latest developments 👇",
  "data/tweet-economist/2022/2/1496786237142999040.json": "Donetsk and Luhansk, part of the Donbas region dominated by Russian-speakers, have since 2014 been controlled by separatists and so, in effect, by Russia. We explain why these regions matter https://t.co/uDcUomv2x0",
  "data/tweet-economist/2022/2/1496782961936842752.json": "A war that many thought unthinkable has begun. It will reshape European security https://t.co/DwSw5HvBsk",
  "data/tweet-economist/2022/2/1496779188225048576.json": "Ensuring that any contact points with Ukraine and Russia are not a vulnerability for the rest of their operations is the first of many steps that firms should take https://t.co/GluT6baJFR",
  "data/tweet-economist/2022/2/1496800736352559107.json": "Ukrainians have woken up to the worst news imaginable. We report on the mood in Kyiv https://t.co/vF0RvFDq22",
  "data/tweet-economist/2022/2/1496806129023787009.json": "“A lot of my friends have left this morning.” The routes out of Kyiv are closing. The government has shut down Ukrainian airspace. We report from the capital https://t.co/npWHr46hgq",
  "data/tweet-economist/2022/2/1496805613388578820.json": "In parts of Ukraine, people woke to the sound of sirens and took to their basements; elsewhere some knelt on the streets to pray. People rushed to withdraw cash as huge traffic jams formed on the roads out of Kyiv https://t.co/DXfa4C4dT4",
  "data/tweet-economist/2022/2/1496801589612400645.json": "Wars unfold in unpredictable ways. Recently we explained why Russia’s aim would probably be to hurt Ukraine, not occupy it https://t.co/vESQYNsK0A",
  "data/tweet-economist/2022/2/1496818823135121409.json": "Russia was not threatened by NATO or Ukraine. Its invasion of the sovereign state next door is a war of choice, conjured out of nothing by Vladimir Putin. History will judge him harshly https://t.co/tbB1Rzrj2h",
  "data/tweet-economist/2022/2/1496825338592206854.json": "Nothing about the war in Ukraine was inevitable. It is a conflict entirely of Vladimir Putin’s own making. Our cover story explains why, and how, the world must inflict a heavy price for his aggression https://t.co/qvYmymAfFA https://t.co/hwCZjB74oY",
  "data/tweet-economist/2022/2/1496822742259310596.json": "Invading Ukraine could ultimately prove Vladimir Putin’s undoing, we wrote in a recent article, if it turns into a bloody quagmire or makes Russians poorer, angrier and more eager for change https://t.co/DjvtkDvSaN",
  "data/tweet-economist/2022/2/1496829273306722304.json": "Russia has never accepted Ukrainian independence. We explain the history of the forced brotherhood between the two countries https://t.co/pyBaHAfBBh",
  "data/tweet-economist/2022/2/1496834312913625089.json": "Oil is above $100 a barrel. Wheat is up 20% since the start of this year. Natural gas rose 30% in early trading. Prices have leapt as Russia goes to war https://t.co/GJLh9q7rW5",
  "data/tweet-economist/2022/2/1496831801117257728.json": "People are gathering to watch the latest updates. Many have huddled in one of the deepest underground transit systems in the world. Others are stocking up on supplies. Meanwhile the routes out of Kyiv are closing https://t.co/gNmJmiKBW6",
  "data/tweet-economist/2022/2/1496842359467757568.json": "Nothing about this war was inevitable. It is a conflict entirely of Vladimir Putin’s own making https://t.co/3SJGZDdXaw",
  "data/tweet-economist/2022/2/1496848027310559234.json": "Within minutes of Vladimir Putin declaring war on Ukraine, explosions were heard near Kyiv’s main airport, as well as in many other cities. This map details them.\n\nWe explain what led to the conflict, and what could happen next  ⬇️",
  "data/tweet-economist/2022/2/1496845737530851330.json": "RT @shashj: Stephen Hadley, Bush's former NSA, told us about his concerns around Kaliningrad: “If Putin succeeds in Ukraine, he might decid…",
  "data/tweet-economist/2022/2/1496832940692676612.json": "♦️ The West considers how far Russia will go to subdue Ukraine.\n\n♦️ Ukrainians flee for safety. Poland and Germany prepare to receive refugees.\n\n♦️ NATO chief Jens Stoltenberg says Russia has “shattered” peace in Europe. \n\nCatch up with the latest developments 👇",
  "data/tweet-economist/2022/2/1496858836317126666.json": "Where will he stop? https://t.co/0ajdp9mguH",
  "data/tweet-economist/2022/2/1496861493090033668.json": "The economic consequences of the war in Ukraine https://t.co/NFpE9zIL5E",
  "data/tweet-economist/2022/2/1496845129197387776.json": "“The mood is split between those who want to get out and those who will offer a fight.” As Russia’s invasion begins, @olliecarroll talks to “The Intelligence” from Ukraine https://t.co/tnqNQmptpk",
  "data/tweet-economist/2022/2/1496869799112155136.json": "In the fighting and the misery that is to come, much Ukrainian and Russian blood will be spilled. Every drop of it will be splattered on Vladimir Putin’s hands https://t.co/6vzMBBfM0R",
  "data/tweet-economist/2022/2/1496865524256587783.json": "Fear and defiance grip the citizens of Ukraine’s capital as Russia’s attack begins https://t.co/FBWkpjZpLc",
  "data/tweet-economist/2022/2/1496879661237821441.json": "The war will result in the isolation of the world’s 11th-largest economy and one of its largest commodity producers https://t.co/8Vpth98D1A",
  "data/tweet-economist/2022/2/1496875333366259715.json": "Chillingly, Vladimir Putin all but threatened nuclear escalation against the West after America and its allies sent additional troops to reinforce the eastern flank of NATO https://t.co/ODV0h0CyqI",
  "data/tweet-economist/2022/2/1496875036988395520.json": "The war in Ukraine will shake Vladimir Putin’s regime to its foundations and shatter assumptions about European security https://t.co/hkbAOECQyJ",
  "data/tweet-economist/2022/2/1496591447797248008.json": "Republicans are playing a more constructive role in the Ukraine crisis than Donald Trump must like https://t.co/fEFDy1mMEX",
  "data/tweet-economist/2022/2/1496884882403901444.json": "♦️ Volodymyr Zelensky said Russian troops were trying to seize the former Chernobyl power plant.\n\n♦️ The EU plans sanctions against Russian banks and tech.\n\n♦️ Lithuania declared a state of emergency; Moldova’s government called for one.\n\nStay up to date on the war in Ukraine👇",
  "data/tweet-economist/2022/2/1496883506227597315.json": "We’ve mapped where Russian strikes have been reported, and where troops have crossed into Ukraine https://t.co/iqRXTCu5Cv",
  "data/tweet-economist/2022/2/1496885899459760129.json": "Russia’s presence in mining has sent metal prices skyward. Palladium, nickel, aluminium and copper, all of which it produces, have leapt this year https://t.co/5VZCrCrjFu",
  "data/tweet-economist/2022/2/1496652418175676421.json": "RT @DAlperovitch: My latest in the @TheEconomist on the risk of escalation in the Russia-Ukraine war\n\nhttps://t.co/CTaHFYxDyu",
  "data/tweet-economist/2022/2/1496900990905241603.json": "Missiles have struck across the country, and troops have poured in from the north, east and south https://t.co/Y3BbSrHAKB",
  "data/tweet-economist/2022/2/1496897900458164229.json": "For months as Vladimir Putin amassed troops on Ukraine’s borders the question had been: what does he want? Now it is: where will he stop? https://t.co/qXcRmAXXCP",
  "data/tweet-economist/2022/2/1496837837047611394.json": "Our coverage explains what’s at stake, what lies behind Vladimir Putin’s thinking and what might happen next https://t.co/oI8FsLfyJW",
  "data/tweet-economist/2022/2/1496916593430913024.json": "Volodymyr Zelensky, Ukraine’s president, has declared martial law and promised to give weapons to any citizen willing to defend the country https://t.co/mA3M0bYw2Q",
  "data/tweet-economist/2022/2/1496920784681545733.json": "♦️ Ukrainian officials say Russia has seized the former Chernobyl power plant.\n\n♦️ Russia carried out more than 200 attacks on Thursday, Ukraine said.\n\n♦️ Officials in Ukraine called for Russia to be cut off from the SWIFT payment system.\n\nCatch up on the latest developments👇",
  "data/tweet-economist/2022/2/1496929179119538176.json": "China drew closer to Russia on the eve of war. Will President Xi Jinping come to regret it? https://t.co/0FhPt54odA",
  "data/tweet-economist/2022/2/1496925542691618821.json": "Few countries are watching the war with Ukraine as anxiously as Turkey. President Recep Tayyip Erdogan is eager to preserve a recent rapprochement with Russia https://t.co/6dCcTwTv9u",
  "data/tweet-economist/2022/2/1496909612179722246.json": "Since the cold war, western European countries have tended to shrug off this nasty side of Gazprom. Instead they have become overdependent on its gas https://t.co/Et7Qk5IR7L",
  "data/tweet-economist/2022/2/1496933226937470976.json": "There had been speculation that the president might be satisfied with control over Donetsk and Luhansk, two small, Russian-backed enclaves of Ukraine. All that has crumpled in the face of a vast assault https://t.co/mS9BFSeIVT",
  "data/tweet-economist/2022/2/1496947090462814208.json": "Vladimir Putin seemingly covets all of Ukraine, just as British and American intelligence reports claimed all along https://t.co/z1s9oq71k5",
  "data/tweet-economist/2022/2/1496957617759043599.json": "The war in Ukraine will test Turkey’s relationship with Russia, possibly to destruction https://t.co/aHAHpMbfxm",
  "data/tweet-economist/2022/2/1496955608146354187.json": "The war in Ukraine will test Turkey’s relationship with Russia, possibly to destruction https://t.co/OEorKc0Qq5",
  "data/tweet-economist/2022/2/1496902814097977344.json": "RT @AlexSelbyB: Reported Russian strikes in Ukraine - 16:00 GMT\nhttps://t.co/l26BsB8gWe https://t.co/hajCzbxtP9",
  "data/tweet-economist/2022/2/1496975503718289411.json": "Japan’s prime minister, Kishida Fumio, recently implied that Vladimir Putin’s aggression towards Ukraine could embolden Xi Jinping over Taiwan  https://t.co/J0ea3zYNQp",
  "data/tweet-economist/2022/2/1496970218819702786.json": "Russia is one of the world’s largest oil producers and a key supplier of industrial metals such as nickel, aluminium and palladium. Prices are now likely to rise further https://t.co/COLwq7HwyL",
  "data/tweet-economist/2022/2/1496978516788883456.json": "The president has set aside the everyday calculus of political risks and benefits. Instead he is driven by the dangerous, delusional idea that he has an appointment with history https://t.co/V0bMYIlrcz",
  "data/tweet-economist/2022/2/1496995619566727170.json": "Japan’s prime minister, Kishida Fumio, recently implied that Vladimir Putin’s aggression towards Ukraine could embolden Xi Jinping over Taiwan https://t.co/iSNYuZRWIH"
}