{
  "data/tweet-economist/2022/5/1520627634685853697.json": "Rather than fixing the economy, it very much looks as though President Erdogan has decided to step up repression https://t.co/iAJvSPltpY",
  "data/tweet-economist/2022/5/1520574235097415680.json": "The central bank had the tools to stop it but failed to use them in time https://t.co/pbMmHdHb8y",
  "data/tweet-economist/2022/5/1520646829678989312.json": "El Salvador’s president has locked up 19,000 people in a month https://t.co/1tteAX8EV7",
  "data/tweet-economist/2022/5/1520681435652366336.json": "Filtration was used in the aftermath of the second world war and during the Chechen wars of the 1990s. We explain why the camps have reappeared after Vladimir Putin’s invasion of Ukraine https://t.co/cLGzZICgcD",
  "data/tweet-economist/2022/5/1520728276515315712.json": "Friedrich Flick was a magnate who grew rich off Hitler’s regime. He was convicted of war crimes but, after his release from prison, went on to become West Germany’s richest person https://t.co/da93BeUlYP",
  "data/tweet-economist/2022/5/1520698018932170753.json": "To attempt such daunting co-ordination in Ukraine with sullen teenagers, press-ganged into service, fed expired rations and equipped with badly maintained vehicles was the height of optimism \nhttps://t.co/IQrM2xY6OF",
  "data/tweet-economist/2022/5/1520641975455821826.json": "Why Gerhard Schröder won’t unfriend Vladimir Putin https://t.co/afCHx3bp70",
  "data/tweet-economist/2022/5/1520791170301014016.json": "If Elon Musk’s talent for shaking up industries can help cut the Gordian knot of online speech, everyone will benefit  https://t.co/cZfDukY5fd",
  "data/tweet-economist/2022/5/1520816325706321920.json": "Since Vladimir Putin’s war of aggression in Ukraine began, hundreds of thousands of people have been forcibly deported to Russia by occupying forces https://t.co/prZeG9cr9n",
  "data/tweet-economist/2022/5/1520860619045588999.json": "“Many German business dynasties continue to sidestep a complete reckoning with the dark history that stains their fortunes,” writes David de Jong in “Nazi Billionaires” https://t.co/itUAVf2BEA",
  "data/tweet-economist/2022/5/1520845682856411138.json": "Before Russia’s invasion, Elon Musk had intended to provide internet to people living in rural areas unreachable by cables and cell towers. The war has become another testing ground https://t.co/uk6xPqoYlf"
}