{
  "data/tweet-crypto/2022/1/1479118366837149697.json": "Het interview met @100trillionUSD  gaat nu in premiere! 🚀🚨\nOver:\n- het S2F-model\n- het falen van modellen\n- zijn controversiële tweets\n- blocks op Twitter\n- de economische oorlog\n- nieuwe welvaart\n- het verlaten van Nederland.\n\nCheck hem hier 👉🏻 https://t.co/nWRrUDuGNl https://t.co/YgMZlFjOLN",
  "data/tweet-crypto/2022/1/1479116640566476803.json": "Bio security surveillance regime, Dutch edition 2022.  https://t.co/tcXIgIJznV",
  "data/tweet-crypto/2022/1/1479094775475179520.json": "💠French Pres. Macron: 5 million fellow unvaccinated citizens are \"non-citizens.\" \n💠Canadian PM Trudeau: the unvaxxed are “misogynistic &amp; racist” extremists\n💠Pres. Biden: the epidemic is a pandemic of the unvaccinated\n\nDoes progressive leadership require demonizing the other?",
  "data/tweet-crypto/2022/1/1479205638223933446.json": "1.6.22: UK infection rates among fully vaxxed now HIGHER &amp; RISING FASTER than among unvaxxed in ALL adult cohorts. Vaxxed &amp; unvaxxed of all ages continue to get infected &amp; spread - and in most age groups, the vaxxed much more so - rendering vaxx passports &amp; mandates pointless. https://t.co/wLXWLkurlf",
  "data/tweet-crypto/2022/1/1479446791678566403.json": "Report is concerning.  What new potentially fatal exposure was offered, then encouraged, then finally mandated and effectively forced upon people this age? https://t.co/n97mkA1i4H",
  "data/tweet-crypto/2022/1/1479776410923417605.json": "NEW - Dutch government withholds excess mortality data: Scientists are now criticizing the government's continued failure to release the data for an independent investigation.",
  "data/tweet-crypto/2022/1/1480118398826827779.json": "Ok, ID-10t, I’m going to school you again, not because it’s going to be of use for you, since you’re just getting paid to attack #Bitcoin and defend fiat, but because the people deserve to know you are a fraud. https://t.co/BbDGGnyjuu",
  "data/tweet-crypto/2022/1/1480274960673300480.json": "I know some people have lost faith in this #bitcoin bull market. However we are only halfway into the cycle (2020-2024). And although BTC experiences some turbulence at $1T, the yellow gold cluster at S2F60/$10T (small black dots are 2009-2021 gold data)  is still the target IMO. https://t.co/xWFQKKnndP",
  "data/tweet-crypto/2022/1/1480466233413844993.json": "Hansen et al Department of Infectious Disease Epidemiology and Prevention, Statens Serum Institut, Copenhagen, Denmark, market leaders have close to zero efficacy after a brief two months.  Spike protein sufficiently mutated to render these first generation products obsolete. https://t.co/pQlTVw15Q9",
  "data/tweet-crypto/2022/1/1480465692776402950.json": "NEW - Director Walensky says CDC will provide data on \"how many of the 836,000 deaths in the U.S. linked to Covid are from Covid or how many are with Covid,\" and adds \"Omicron has just been with us for a few weeks.\"\n\nhttps://t.co/Htf1hrfX0F",
  "data/tweet-crypto/2022/1/1480463033759854592.json": "1/14\n\nIn some respects, what happened in bond markets last week was epic, something we might be talking about for many years.\n\nA thread to explain",
  "data/tweet-crypto/2022/1/1480469788463935489.json": "OOPS! US 10y yields jump &gt;1.80% for 1st time since Jan2020. US #inflation data out on Wed will be keenly watched as concerns grow the Fed is behind the curve in tackling elevated price pressures. US CPI may have accelerated to 7% in Dec. https://t.co/3uWeCz2QwM",
  "data/tweet-crypto/2022/1/1480498127627067397.json": "It is a lot better to walk alone than with a crowd going in the wrong direction.",
  "data/tweet-crypto/2022/1/1480552858969858048.json": "If you get 3-4 shots of the same thing in 1 year, and you still get infected and transmit the pathogen, then please don’t call it a vaccine. Call it whatever you like, but don’t call it a vaccine.",
  "data/tweet-crypto/2022/1/1480633716875710482.json": "NEW - Director Walensky says CDC will provide data on \"how many of the 836,000 deaths in the U.S. linked to Covid are from Covid or how many are with Covid,\" and adds \"Omicron has just been with us for a few weeks.\"\n\nhttps://t.co/Htf1hrfX0F",
  "data/tweet-crypto/2022/1/1480617969390653450.json": "“What the vaccines can't do anymore is prevent transmission.\"\n\nCDC Director Walensky\n\nhttps://t.co/s3BjMVBOub",
  "data/tweet-crypto/2022/1/1480617724631998467.json": "The CDC director just said over 75% of “covid deaths” occurred in people with at least four comorbidities. Since Biden can’t shut down covid, suddenly all this data is getting shared publicly. https://t.co/NKvproy3lx",
  "data/tweet-crypto/2022/1/1480670415605448707.json": "This single machine is earning more than the average Jamaicans salary.\n\nYes, its just plugged into a dryer outlet. https://t.co/cqr54GqQQd",
  "data/tweet-crypto/2022/1/1480847935726407687.json": "I want my career earnings to last generations. The average NFL career is 3 years and inflation is real.\nSaving and preserving money over time is hard, no matter who you are.\nIn today’s world: How do we save?\nThis is why I believe in #bitcoin\nAlmost all professional athletes make"
}