{
  "data/tweet-wsj/2022/4/1509685737498755081.json": "A former coal company executive from Knoxville, Tenn., was arrested Thursday for his role in an alleged scheme to bribe government officials in Egypt in exchange for contracts with a state-owned company, U.S. prosecutors said https://t.co/zEtAQIoz9E",
  "data/tweet-wsj/2022/4/1509682054476222466.json": "Before The Weeknd became famous, he rented a one-bedroom with friends. Now he owns a portfolio of properties, including a swanky Bel-Air mansion he purchased for $69 million last year. https://t.co/Pdcnad31zS",
  "data/tweet-wsj/2022/4/1509723497962123276.json": "Day after day, Russian forces bombed the city of Mariupol. Hundreds of Ukrainians hid inside a theater where one couple took charge of keeping everyone alive. https://t.co/wxQiiAvNYx",
  "data/tweet-wsj/2022/4/1509708409154772994.json": "Political freedoms and the rule of law have continued to deteriorate in Hong Kong over the past year, threatening American interests and Hong Kong’s autonomy, a State Department report says https://t.co/Khq78QATZn",
  "data/tweet-wsj/2022/4/1509700868832116736.json": "“Party on the bottom, business on the top.”  Employees returning to the office are coming up with new dress codes. https://t.co/vVOw6fiuNo",
  "data/tweet-wsj/2022/4/1509697127877853191.json": "From @WSJopinion: There is hope amid the heartbreaking carnage in Ukraine that one nation’s valiant struggle for survival may bring a rules-based world order closer to realization, writes @JoshuaMuravchik\nhttps://t.co/xpRCp0O4lA",
  "data/tweet-wsj/2022/4/1509712188948287493.json": "The Razzie Awards, a satirical awards organization that recognizes actors and movies for subpar work, rescinded a worst-performance award it gave to Bruce Willis after the actor’s family said he suffers from aphasia https://t.co/uLSSQ6Xejm",
  "data/tweet-wsj/2022/4/1509740152666697744.json": "A Ukrainian mother fled Syria's war with her baby boy in her arms. A decade later, her 11-year-old son escaped Ukraine alone: “I had already given up on myself, but I wanted him to live.” https://t.co/TOBLhaKIGU",
  "data/tweet-wsj/2022/4/1509743636338122752.json": "Washington Gov. Jay Inslee has signed a bill creating the country's first statewide alert system for missing indigenous people https://t.co/JtIlkmXtyU",
  "data/tweet-wsj/2022/4/1509821638451380267.json": "Ukrainian attack helicopters executed a low-flying predawn raid on Russian territory, a Russian official said, signaling Kyiv’s ability to broaden the field of the war https://t.co/PAIBaH5BwV",
  "data/tweet-wsj/2022/4/1509855623697125384.json": "Russia’s army has suffered serious losses amid fierce Ukrainian resistance. A less visible failure to supply its troops has hobbled Moscow’s invasion plans, according to Western intelligence. https://t.co/TLXPDdVD4q",
  "data/tweet-wsj/2022/4/1509869475130232838.json": "Pope Francis asked forgiveness for the abuse of Canadian indigenous children at Catholic Church-run residential schools over more than a century. The is part of an extraordinarily elaborate gesture of penitence by the pope. https://t.co/p2CmSSlGL1",
  "data/tweet-wsj/2022/4/1509897155837898774.json": "Ukrainian President Volodymyr Zelensky stripped two generals of their rank for what he said was their failure to live up to their oath of allegiance. “I do not have time to deal with all the traitors. But gradually they will all be punished.” https://t.co/0OHoc1XjAj",
  "data/tweet-wsj/2022/4/1509836739942273026.json": "Russia’s factories cut production and jobs in March after the U.S. and its allies adopted economic sanctions over Moscow’s invasion of Ukraine  https://t.co/33ys35Go2s",
  "data/tweet-wsj/2022/4/1509900928266219549.json": "From @WSJopinion: Only Russians can remove Putin from power. That is why, in addition to supplying arms to Ukraine, the U.S. needs to take steps to reach the Russian people, writes @DavidSatter. https://t.co/GWYOq29jlV",
  "data/tweet-wsj/2022/4/1509916266051612673.json": "Moscow’s pivot from focusing on Kyiv and cities in the north to seizing parts of the country’s east is an indication of the effectiveness of Ukraine’s resistance and signals a Kremlin decision to pursue what is likely to become a prolonged war of attrition https://t.co/rhoHj56mQJ",
  "data/tweet-wsj/2022/4/1509934891353395205.json": "Amazon workers in New York voted to form a union. It's the first successful unionization effort by U.S. workers at the tech giant. https://t.co/OrH9t7xmlG",
  "data/tweet-wsj/2022/4/1509946351693484041.json": "Essay: Vladimir Putin made no secret of his obsession with Ukraine. It took decades for the West to realize how serious he was. https://t.co/gbINrvEaLk",
  "data/tweet-wsj/2022/4/1509987745585901571.json": "From @WSJopinion: Now is the time to help Ukraine take the offensive. The U.S. is still not providing all of the weapons it needs to retake territory from Vladimir Putin. https://t.co/KBiWUIasAo",
  "data/tweet-wsj/2022/4/1509931126130941954.json": "Roman Abramovich has become a back channel between Ukraine and the Kremlin. That is helping Ukrainian negotiators—and it may end up helping the Russian oligarch as well. https://t.co/ZoVJnAIAvx",
  "data/tweet-wsj/2022/4/1510039468434198540.json": "Will Smith resigned from the motion-picture academy in the wake of his Oscar-night slap of comedian Chris Rock. “I betrayed the trust of the academy.\" https://t.co/HzMcckfV1c",
  "data/tweet-wsj/2022/4/1510074555951419397.json": "Ukrainian President Volodymyr Zelensky stripped two generals of their rank for what he said was their failure to live up to their oath of allegiance. “I do not have time to deal with all the traitors. But gradually they will all be punished.” https://t.co/ccQjAhvfT2",
  "data/tweet-wsj/2022/4/1510070770088751109.json": "Amazon workers in New York voted to form a union. It's the first successful unionization effort by U.S. workers at the tech giant. https://t.co/kWQNPqIAkc",
  "data/tweet-wsj/2022/4/1510021734476525575.json": "Essay: Vladimir Putin made no secret of his obsession with Ukraine. It took decades for the West to realize how serious he was. https://t.co/pTei6FtL31",
  "data/tweet-wsj/2022/4/1510016682168881160.json": "A federal judge on Friday rejected convicted sex-trafficker Ghislaine Maxwell’s request for a new trial, ruling that a juror’s lack of truthfulness on a jury-screening questionnaire didn’t justify throwing out the guilty verdict https://t.co/YFx0FWaDbE",
  "data/tweet-wsj/2022/4/1510067028215877633.json": "The Ukrainian soccer club Dynamo Kyiv will hold a series of fund-raising matches against big-name European squads in the next several months, including AC Milan, Barcelona and Paris Saint-Germain, the Ukrainian team said https://t.co/S4iIElRfzY",
  "data/tweet-wsj/2022/4/1510055681377943552.json": "Saudi Arabia and Iran-backed Houthi fighters agreed on Friday to a two-month truce, bringing a temporary halt to a seven-year-old war in Yemen that could create new momentum for a diplomatic end to the conflict https://t.co/5mF8FxGnSk",
  "data/tweet-wsj/2022/4/1510116084497764354.json": "“You go because your child is there.” A Ukrainian woman working in Poland journeys into areas under fire to retrieve her 12-year-old son. https://t.co/Rm6cHWBPj7",
  "data/tweet-wsj/2022/4/1510112306323234818.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/eJ6HIM4A1X https://t.co/Nf3JM1DaPK",
  "data/tweet-wsj/2022/4/1510157611219537920.json": "Essay: Vladimir Putin made no secret of his obsession with Ukraine. It took decades for the West to realize how serious he was. https://t.co/f9wXJOaX4b",
  "data/tweet-wsj/2022/4/1509715944146407431.json": "U.S. officials are probing a meeting between Activision's CEO and a trader who bought options on the firm days before its Microsoft merger, people familiar with the matter say https://t.co/0EGctpRq1H",
  "data/tweet-wsj/2022/4/1510217985146900492.json": "Russia enriches more uranium than any other country. Now, soaring prices amid the war in Ukraine have triggered proposals to revive production of the critical fuel for nuclear plants in the U.S. #WSJWhatsNow https://t.co/6o27h5WXMi https://t.co/7XQIzpb47x",
  "data/tweet-wsj/2022/4/1510248195900723203.json": "TikTok brain is real, researchers say, and it’s affecting kids’ brain development. \"We’ve made kids live in a candy store.\" https://t.co/wMpvNVoMF8",
  "data/tweet-wsj/2022/4/1510180276135247874.json": "Microsoft was once an antitrust pariah but is now widely seen by regulators as the friendly party among today’s top tech companies. Its rivals say that comes at their expense. https://t.co/gGClyNcKfI",
  "data/tweet-wsj/2022/4/1510251966273884163.json": "From @WSJopinion: We trust judges to behave professionally and with integrity when it comes to recusal decisions, and Justice Clarence Thomas has earned our trust, writes @jasonrileywsj https://t.co/lk0xjatnIO",
  "data/tweet-wsj/2022/4/1510263327481606159.json": "What is the difference between 5G and 6G? True global ubiquity https://t.co/dytY2mKYtZ",
  "data/tweet-wsj/2022/4/1510289727894994946.json": "Pro-Ukraine signs dot one of the largest Russian and Ukrainian communities in the U.S.—Brighton Beach, Brooklyn https://t.co/hbtOYzy4UT",
  "data/tweet-wsj/2022/4/1510259531569377291.json": "A once quiet military base on Romania’s Black Sea coast is suddenly on the front line of NATO’s defense against Russia https://t.co/wMZliJiEHO",
  "data/tweet-wsj/2022/4/1510187818080944130.json": "Take a look at the front page of today's Wall Street Journal https://t.co/YdxB77g42E https://t.co/eQ2E7AKmoz",
  "data/tweet-wsj/2022/4/1510425628771815427.json": "Human Rights Watch said it has interviewed a woman who witnessed Russian troops round up five men and shoot one of them in the back of the head, killing him. https://t.co/0ODphWslOY",
  "data/tweet-wsj/2022/4/1510457323113918466.json": "North Carolina spoiled Duke coach Mike Krzyzewski’s retirement party, beating the Blue Devils 81-77. They will play Kansas on Monday for the national title. https://t.co/KkVoFAJ3AV",
  "data/tweet-wsj/2022/4/1510206678163152903.json": "Ukrainian forces were clearing mines and counting the dead around Kyiv following Russian troop withdrawals in recent days, as Moscow shifted military operations to the country’s east https://t.co/GRe2RME76P",
  "data/tweet-wsj/2022/4/1510512478739910659.json": "European Union and Chinese leaders clashed over the conflict in Ukraine, with Europe pressing Beijing to work actively to end the war and not to support Russia economically or militarily https://t.co/r6fRyXLDaq",
  "data/tweet-wsj/2022/4/1510467170643419137.json": "The palatial and ornate Manhattan mansions depicted on the hit HBO series \"The Gilded Age\" once existed, but have almost all been demolished. Take a closer look at the vanished mansions of Gilded Age New York, and some of the rare structures that remain. https://t.co/qBjIkn2Mjd",
  "data/tweet-wsj/2022/4/1510520000490135555.json": "Pro-Russia cybercriminals chatted online about a plan to attack hospitals with ransomware, saying, “There will be panic.” The inner workings of the gang were revealed by a Ukrainian. https://t.co/mJYKVxXz9Y",
  "data/tweet-wsj/2022/4/1510548176578752517.json": "Prime Minister Imran Khan blocked a no-confidence vote against him in Pakistan’s Parliament and called for fresh elections, turning a battle with the opposition into a constitutional crisis https://t.co/3oyOESx39P",
  "data/tweet-wsj/2022/4/1510527535016206338.json": "Russian oligarchs like Alisher Usmanov have been sanctioned by the U.S. So why was his company able to ship 53,000 tons of pig iron into Alabama? https://t.co/nqcRJh0hKc",
  "data/tweet-wsj/2022/4/1510576371638095880.json": "Russia's retreat near Kyiv has revealed mounting evidence of war crimes, officials and rights watchdogs say. Nearly 300 civilians were buried in mass graves in Bucha. https://t.co/WxWjLJ2QhX",
  "data/tweet-wsj/2022/4/1510581647061700612.json": "From @WSJopinion: I do not see how the U.S. and its allies can resume normal relations with Russia while Putin’s army enforces a de facto partition of Ukraine, writes @BillGalston. Putin cannot be rewarded for naked aggression. https://t.co/K3xJ2HU4CH",
  "data/tweet-wsj/2022/4/1510487817234927616.json": "One woman says she hadn’t seen her 2½-year-old daughter for days after her child was sent to a quarantine facility that appeared crammed with children in video footage. The hospital says the crowding is temporary, as it responds to an infection surge https://t.co/zXknJc6gdX",
  "data/tweet-wsj/2022/4/1510603052423733251.json": "“We’re brothers and sisters. We’re all Orthodox,” says the pastor of the Holy Virgin Russian Orthodox Church. The day after the invasion, he put up signs supporting Ukraine. https://t.co/MeY1gqD3Rm",
  "data/tweet-wsj/2022/4/1510591712468647939.json": "Hedge funds are betting against a cryptocurrency whose price shouldn’t move. Tether says the short sellers are part of a \"clever scheme to raise capital from those less knowledgeable.\" https://t.co/2oqW8SfVF2",
  "data/tweet-wsj/2022/4/1510618147820290055.json": "A Ukrainian mother fled Syria's war with her baby boy in her arms. A decade later, her 11-year-old son escaped Ukraine alone: “I had already given up on myself, but I wanted him to live.” https://t.co/2rNcxATTpn",
  "data/tweet-wsj/2022/4/1510652118566379521.json": "More than 100 civilians have been buried in mass graves by local authorities in a suburb of Kyiv since Russian troops withdrew last week, one of several regions where Ukrainian officials say they are uncovering evidence of war crimes https://t.co/9WAuXWEq7t",
  "data/tweet-wsj/2022/4/1510457062043627525.json": "The executives said air travel will still be safe even if not everyone is masked, citing air filtration systems in plane cabins and the availability of high quality masks for people who still want to wear them. https://t.co/HUMNSXENmp",
  "data/tweet-wsj/2022/4/1510682298815033352.json": "The Senate may have entered an era “where the only way to confirm a Supreme Court nominee is the party of the president has to be in control of the Senate,” one senator said. “And I’m pretty certain that the founders didn’t have that in mind.” https://t.co/byxjxefXez",
  "data/tweet-wsj/2022/4/1510671007014608900.json": "From @WSJopinion: Biden pivots left again, with a 20% tax on unrealized asset gains. A tax increase of this magnitude is never desirable, but the timing now is especially bad. https://t.co/Ah6GcJoryw",
  "data/tweet-wsj/2022/4/1510704223465488385.json": "Estelle Harris, best known for playing the sharp-tongued mother of George Costanza on 'Seinfeld,' has died at 93 years old https://t.co/zlNPudk4hJ",
  "data/tweet-wsj/2022/4/1510711299591839745.json": "Essay: Vladimir Putin made no secret of his obsession with Ukraine. It took decades for the West to realize how serious he was. https://t.co/bFAx9j1gik",
  "data/tweet-wsj/2022/4/1510712515201847296.json": "The Taliban officially banned the cultivation of poppy, which provides the raw material for heroin and other opiates, as the group strives to be recognized as Afghanistan’s legitimate government https://t.co/dp86jLUkN8",
  "data/tweet-wsj/2022/4/1510697414008709130.json": "Prime Minister Imran Khan blocked a no-confidence vote against him in Pakistan’s Parliament and called for fresh elections, turning a battle with the opposition into a constitutional crisis https://t.co/23ucAy8zEF",
  "data/tweet-wsj/2022/4/1510708772930560010.json": "Cancún and the Riviera Maya, Mexico’s top tourism spots, are fighting a wave of violent crime. The problem is demand for drugs by tourists. https://t.co/PbBBm2MlDI",
  "data/tweet-wsj/2022/4/1510706206293344266.json": "Median pay rose to $14.2 million last year for U.S. CEOs—on pace for a record as companies grapple with worker shortages and inflation https://t.co/VJSPjptwq6",
  "data/tweet-wsj/2022/4/1510757825345167364.json": "Hungarian Prime Minister Viktor Orban won a fifth term in power in an election that became a referendum on his promise to block support for Ukraine in its war with Russia. https://t.co/PaQ5nWlUY2",
  "data/tweet-wsj/2022/4/1510710095872724997.json": "A once quiet military base on Romania’s Black Sea coast is suddenly on the front line of NATO’s defense against Russia https://t.co/jJGguHy7Bp"
}