{
  "data/tweet-crypto/2022/7/1543956113292410882.json": "My on-chain indicator (purple) flipped from bearish to bullish in June. Not saying this is it, and it would be nice if RSI would confirm, but I watch it like a hawk. Be ready. https://t.co/O57BdN7J1y",
  "data/tweet-crypto/2022/7/1545331451306049537.json": "Probably the most astounding interview I've seen in a while.\n\n\"You didn't answer his important question... Who is advising the president on shockingly naive price theory over a gallon of gas?\"\n\n\"Is this just central planning now? Where is this White House going?\" https://t.co/ckmiDxnibY https://t.co/kKtNUjxcat",
  "data/tweet-crypto/2022/7/1545397597648691200.json": "#bitcoin nicely bounced back to 200WMA and Realized Price levels (both at ~$22K). Let's see if it holds. Btw BTC $24.8K would flip RSI back at 45.🤞 https://t.co/62yU8wJtuP",
  "data/tweet-crypto/2022/7/1545758689402945536.json": "This chart shows why #Euro crashed to near parity w/Dollar this week. Eurozone's trade surpluses have been completely wiped out b/c of energy crisis. #Germany has slipped into trade deficit for 1st time in 31yrs, shortfalls in trade were also observed in France &amp; other countries. https://t.co/hRO5Rq62fL",
  "data/tweet-crypto/2022/7/1546839973248356352.json": "#BTC below realized price, short term holder price (5M) and 2Y holder price.  I guess we need patience: in 2011 it took 2 months, in 2014 9 months, in 2018 5 months. https://t.co/LmcCVRBmHJ",
  "data/tweet-crypto/2022/7/1546833832531443712.json": "Leaked Hillary Clinton Emails Revealed NATO Killed Gaddafi to Stop the formation of a United States of Africa. https://t.co/93D1lGUY9J",
  "data/tweet-crypto/2022/7/1547143649397538817.json": "Failure to stack sats is not an option! Don't be left behind! https://t.co/vwv4qVES37",
  "data/tweet-crypto/2022/7/1547198480787165185.json": "Failure to stack sats is not an option! Don't be left behind! https://t.co/vwv4qVES37",
  "data/tweet-crypto/2022/7/1547225326429868032.json": "you don't care what node others run. you know what #bitcoin is and so do millions of other users. this is not a vote, not a democracy, it's a unilateral veto by self-sovereign individuals. bitcoin is bitcoin. economic full-nodes create an impenetrable force field of validation."
}