{
  "data/tweet-nytimes/2022/2/1488346383618875392.json": "Breaking News: Pfizer and its partner BioNTech are expected to ask the FDA as soon as Tuesday to authorize its Covid vaccine for children 6 months to 4 years old as a two-dose regimen. https://t.co/Kok4Ff81cx",
  "data/tweet-nytimes/2022/2/1488357725964840960.json": "Breaking News: Donald Trump was more involved than previously known in proposals to seize voting machines over baseless claims of fraud in 2020, new accounts show. https://t.co/kYBJk1PKcZ",
  "data/tweet-nytimes/2022/2/1488479758522404870.json": "Donald Trump was more involved than previously known in proposals to seize voting machines over baseless claims of election fraud in 2020, new accounts show. The plans explored using national security agencies to take control of the machines. https://t.co/vTXEd15rKi",
  "data/tweet-nytimes/2022/2/1488526960544387080.json": "Breaking News: Tom Brady announced his retirement from the NFL, ending an unparalleled 22-year career with seven Super Bowl titles and three MVP awards.\nhttps://t.co/RWWRoil6ZL https://t.co/WxaZ48cZ0q",
  "data/tweet-nytimes/2022/2/1488585464554610696.json": "Amy Schneider's winning streak set a record for women on \"Jeopardy!\" She also became a fan favorite, and to some, a new transgender icon. @Jeopardamy discusses her life, the show and what’s next with @shaneisland. Join us Wednesday at 5:30 p.m. ET. \n\nhttps://t.co/Qf5ZzS4qT5",
  "data/tweet-nytimes/2022/2/1488588066616922122.json": "Feral pigs in the San Francisco Bay Area are tearing up lawns, threatening the drinking water and disturbing vineyard harvests. They're part of what one federal official called a \"feral swine bomb\" — and many people want them dead. https://t.co/smZ4xQ8hi1",
  "data/tweet-nytimes/2022/2/1488667264933150723.json": "The U.S. has a far higher Covid death rate than other wealthy nations, reflecting lagging vaccinations and other weaknesses. https://t.co/fM9jkv4vxM",
  "data/tweet-nytimes/2022/2/1488746542030807044.json": "“Death rates are so high in the States — eye-wateringly high,” a global public health expert said. Despite having one of the world’s most powerful arsenals of vaccines, the U.S. has failed to inoculate as much of its population as other wealthy nations. https://t.co/wj5vcBTi9w",
  "data/tweet-nytimes/2022/2/1488908024068648964.json": "Breaking News: Jeff Zucker resigned as the president of CNN, writing in a memo that he had failed to disclose a romantic relationship with another senior executive at the company. The relationship came up during the network’s investigation into Chris Cuomo.https://t.co/ksaYyL7SwX",
  "data/tweet-nytimes/2022/2/1488912651975630849.json": "Amy Schneider's winning streak set a record for women on \"Jeopardy!\" She also became a fan favorite, and to some, a new transgender icon. @Jeopardamy discusses her life, the show and what’s next with @shaneisland. Join us Wednesday at 5:30 p.m. ET. \n\nhttps://t.co/S3VB5VYARe",
  "data/tweet-nytimes/2022/2/1489051026187558914.json": "A senior House Democrat called on Wednesday for the resignation of Louis DeJoy, the postmaster general, saying he flouted President Biden’s plan to electrify the federal fleet by placing a multibillion-dollar order for mostly gasoline-powered vehicles. https://t.co/Qt2ymyq1RH",
  "data/tweet-nytimes/2022/2/1488980572923904001.json": "U.S. soldiers who have not yet been vaccinated against the coronavirus will be immediately discharged, the Army said on Wednesday, joining other military branches that have already begun doing so. A vast majority of troops are inoculated, the Army said. https://t.co/z2xy4yHrhP",
  "data/tweet-nytimes/2022/2/1489008902335307777.json": "Two years into the pandemic, the coronavirus is killing Americans at far higher rates than people in other wealthy nations.\n\nThe ballooning death toll has defied the hopes that the less severe Omicron variant would spare the U.S. the pain of past waves. https://t.co/Ie4YT3jLlI https://t.co/dQNEz06px3",
  "data/tweet-nytimes/2022/2/1489086275667828738.json": "All seven House Republicans who voted to impeach Donald Trump and are seeking re-election have out-raised their primary opponents, many of whom have received Trump’s backing, according to campaign disclosures filed with the Federal Election Commission. https://t.co/z0Ob4T5DYt",
  "data/tweet-nytimes/2022/2/1488940333509627904.json": "Thousands of police officers lined the sides of Fifth Avenue in New York City, standing at attention a dozen rows deep as bagpipe players, police vehicles and emergency trucks accompanied the hearse carrying Officer Wilbert Mora's casket. https://t.co/0AD7PW38e9 https://t.co/pSU7FYuE5m",
  "data/tweet-nytimes/2022/2/1489224822538309641.json": "Breaking News: U.S. forces killed the leader of ISIS, Abu Ibrahim al-Hashimi al-Qurayshi, in a raid in northwest Syria, President Biden said.\n\nFollow our updates.\nhttps://t.co/tCwm3hwRd5",
  "data/tweet-nytimes/2022/2/1489071167487066113.json": "In a lawsuit, Alexander Vindman accused Donald Trump Jr., Rudy Giuliani, and two other top Trump White House aides of running a coordinated intimidation and retaliation campaign to stop him from testifying in Donald Trump’s first impeachment trial. https://t.co/ThNWh5kTQq",
  "data/tweet-nytimes/2022/2/1489295137142411265.json": "The U.S. has exposed what it says is a Russian plan to use a fake video to create a pretext to invade Ukraine, senior officials said. https://t.co/S9aMp4lAYH",
  "data/tweet-nytimes/2022/2/1488896253673062407.json": "President Biden will set out a “moonshot” plan to cut the U.S. death rate from cancer by at least 50% over the next 25 years. The president will also announce a campaign to urge people to undergo screenings that were missed during the pandemic.\nhttps://t.co/94MvT13Avs",
  "data/tweet-nytimes/2022/2/1489263685008715777.json": "A Biden administration official said the ISIS leader Abu Ibrahim al-Hashimi al-Qurayshi died at the start of a U.S. raid in Syria when he blew himself up with an explosive that also took out members of his family. At least 13 were killed in the operation. https://t.co/uT4WXE6m0v",
  "data/tweet-nytimes/2022/2/1489398331008761856.json": "A teacher at a New York Jewish school was asked last summer about a blog post she had written criticizing Israel. \n\nThe teacher, who is Jewish, told her boss she would not discuss politics in class, and he praised her. A week later, she was fired. https://t.co/jNKRsns2hn",
  "data/tweet-nytimes/2022/2/1489413412916539393.json": "Tech giants are feeling the effects of Apple making it harder to track people online. This week, Meta said those changes cost it billions this year. Then its stock price fell more than 26% on Thursday, wiping more than $230 billion off its market value. https://t.co/Zndm95xB7H",
  "data/tweet-nytimes/2022/2/1489310226583109642.json": "A Florida teenager said that Elon Musk offered him $5,000 to stop tracking his private jet and posting its location on Twitter. He countered: How about $50,000? Or a Tesla Model 3? Or an internship?\n\nThe exchange went silent after Jan. 23. https://t.co/hdgk43YdD3 https://t.co/FRlb5RY3sg",
  "data/tweet-nytimes/2022/2/1489471520317616130.json": "Pita Taufatofua, the Tongan athlete and famed flag bearer, will not compete in the #Beijing2022 Winter Olympics — instead, he is focusing on the disaster response to the volcanic eruption and tsunami that struck his native island nation. https://t.co/QTHpnO6vvx",
  "data/tweet-nytimes/2022/2/1489579478779109380.json": "The Olympic Parade of Nations began, as always, with Greece.\n\nThe other teams at the #Beijing2022 opening ceremony will enter based on their order in the Chinese language. The U.S. will be the 56th to enter the stadium.\n\nFollow our updates.\nhttps://t.co/WblMarrKyh https://t.co/IsJbWl5yZV",
  "data/tweet-nytimes/2022/2/1489670105768370177.json": "Breaking News: The Republican Party officially declared the Jan. 6 attack on the Capitol “legitimate political discourse” and censured two of its own members, Representatives Liz Cheney and Adam Kinzinger, for investigating it. https://t.co/h05eFfHvs1",
  "data/tweet-nytimes/2022/2/1489590085360230405.json": "Team USA entered the National Stadium in Beijing for the #OpeningCeremony of the 2022 Winter Olympics.\n\nBrittany Bowe was one of the flag-bearers, replacing the bobsledder Elana Meyers Taylor, who tested positive for Covid.\nhttps://t.co/xVHK270hJ0 https://t.co/seULnOB7mU",
  "data/tweet-nytimes/2022/2/1489676220363157508.json": "The Republican Party has officially declared the Jan. 6 attack \"legitimate political discourse.\" It is the party's most forceful effort yet to minimize the riot as well as the attempt by Donald Trump and his allies to invalidate the 2020 election. https://t.co/xxJNTOKAmH https://t.co/k4m8hRfSl1",
  "data/tweet-nytimes/2022/2/1489691823744462854.json": "Breaking News: Michael Avenatti was convicted of wire fraud and identity theft for stealing nearly $300,000 from his former client Stormy Daniels. https://t.co/nVdF8q6xXl",
  "data/tweet-nytimes/2022/2/1489702647959638021.json": "Breaking News: Former Vice President Mike Pence rejected Donald Trump's false claim that Pence had the right to overturn the 2020 election. “President Trump is wrong,” he said to the Federalist Society, a conservative legal organization. https://t.co/oGJpUB9nky",
  "data/tweet-nytimes/2022/2/1489733029379588097.json": "Former Vice President Mike Pence on Friday rejected Donald Trump's false claim that Pence had the right to overturn the 2020 election. https://t.co/pcrFih7sqB https://t.co/JOpfRpyLBg",
  "data/tweet-nytimes/2022/2/1489750772342530053.json": "Breaking News: North Carolina’s Supreme Court said the state’s political maps were illegally skewed to favor Republicans, requiring lawmakers to make new ones. https://t.co/9hKKZKXwRy",
  "data/tweet-nytimes/2022/2/1489721041320652808.json": "Breaking News: More than 2,600 people in the U.S. are dying from Covid-19 each day, an alarming death rate that has climbed by 30% in the last two weeks. Across the nation, the pandemic has now claimed about 900,000 lives. https://t.co/LfN3ExdX61",
  "data/tweet-nytimes/2022/2/1489716672298721286.json": "The Ukrainian military is training civilians to help defend against a possible Russian invasion and occupation. Our cameras went inside a training center in the southeastern city of Mariupol. https://t.co/aIDPRS996S https://t.co/e1Bv7X5z5H",
  "data/tweet-nytimes/2022/2/1489783347228430336.json": "The chief executive of Delta Air Lines wants the U.S. government to put unruly passengers on a federal no-fly list that would bar them from commercial flights.\nhttps://t.co/E62pcKbfCm",
  "data/tweet-nytimes/2022/2/1489780844738891779.json": "The speaker of the Republican-controlled Arizona House — who supported Donald Trump in 2020 — just torpedoed a bill that would have let lawmakers reject the results of an election. https://t.co/3yMKIhCNC4",
  "data/tweet-nytimes/2022/2/1489768255367651330.json": "More than 2,600 Americans are dying from Covid-19 each day, an alarming rate that has climbed by 30% in the past two weeks. Across the U.S., the coronavirus pandemic has now claimed more than 900,000 lives.\nhttps://t.co/Q998VOjNp4 https://t.co/d6eV4RTaYN"
}