{
  "data/tweet-nytimes/2022/6/1531807477095972866.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/fCeia4GPZo",
  "data/tweet-nytimes/2022/6/1531790145955020806.json": "Rafael Nadal beat Novak Djokovic in four sets to reach the French Open semifinals in a thrilling addition to their long rivalry. https://t.co/qgwhrhBA8X",
  "data/tweet-nytimes/2022/6/1531788134341541889.json": "In Opinion\n\n\"America’s goal is straightforward,\" President Biden writes in a guest essay. \"We want to see a democratic, independent, sovereign and prosperous Ukraine with the means to deter and defend itself against further aggression.\" https://t.co/c2AM54y140",
  "data/tweet-nytimes/2022/6/1531832958994227201.json": "The Russian military, demoralized after three months of war, is still facing morale and other problems, seven weeks after the Kremlin sent a new commander to oversee a refocused invasion, American officials say. https://t.co/WICddQYBem",
  "data/tweet-nytimes/2022/6/1531945422129926145.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/4Jx0iqVPHE",
  "data/tweet-nytimes/2022/6/1531893389314121729.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/wTtbsQd3X4",
  "data/tweet-nytimes/2022/6/1532044326733328384.json": "Elon Musk told SpaceX and Tesla employees that they were required to “spend a minimum of 40 hours in the office per week.” Those who did not do so would be fired, he wrote in a memo. https://t.co/eOwVV5UIGp https://t.co/pHzcnIDHm1",
  "data/tweet-nytimes/2022/6/1532021676677922818.json": "The Russian journalist Dmitri Muratov — whose paper suspended publication in late March, saying Russia’s press laws made it impossible to truthfully cover the war in Ukraine — will be auctioning his Nobel Peace Prize medal to benefit Ukrainian refugees. https://t.co/VZCVkZxmz1",
  "data/tweet-nytimes/2022/6/1532055902555099138.json": "Breaking News: The verdict in the Johnny Depp-Amber Heard trial is expected to be announced soon. Follow our live coverage. https://t.co/p4jBMSQyXF",
  "data/tweet-nytimes/2022/6/1532059477066731520.json": "After winning the Nobel Peace Prize, the journalist Dmitri Muratov said he thought the honor should have gone to a different Russian: the jailed opposition leader Aleksei Navalny. Now, he will auction it to help children who are refugees from Ukraine.\nhttps://t.co/JMgo2mtnNm https://t.co/FtdmydqjwK",
  "data/tweet-nytimes/2022/6/1532086163078631436.json": "Breaking News: A jury found Johnny Depp was defamed by his ex-wife, Amber Heard, in a Washington Post essay in which she described herself as a “public figure representing domestic abuse.” Heard was defamed by one of Depp’s lawyers, the jury found. https://t.co/0hFmUqNVCF",
  "data/tweet-nytimes/2022/6/1532097935563005952.json": "A jury found that Johnny Depp was defamed by Amber Heard when she described herself in a Washington Post essay as a “public figure representing domestic abuse,” but also found that she had been defamed by one of his lawyers. Read the latest: https://t.co/Ri0SE1vBiT https://t.co/2G4m0iPIYP",
  "data/tweet-nytimes/2022/6/1532103478369300484.json": "Johnny Depp said the jury “gave me my life back.” Amber Heard said she’s “heartbroken.”\n\nGet the latest following the verdict, in which a jury found that Depp was defamed by Heard but also that she'd been defamed by one of his lawyers. https://t.co/vumYhF2P3M https://t.co/3rOeNa2KY8",
  "data/tweet-nytimes/2022/6/1532088674317484034.json": "Breaking News: Sheryl Sandberg, the chief operating officer of Meta and the second in command to Mark Zuckerberg, said she was stepping down after 14 years. https://t.co/XlAL6zpeWe",
  "data/tweet-nytimes/2022/6/1532134961339412480.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/zfs5ayvggf https://t.co/IIWD3S54gl",
  "data/tweet-nytimes/2022/6/1532093536631496709.json": "Breaking News: The man accused of the racist shooting at a Buffalo supermarket that left 10 Black residents dead was charged with a 25-count indictment, including murder charges as hate crimes and domestic terrorism. https://t.co/xGqoFpC7Jj",
  "data/tweet-nytimes/2022/6/1532140570461851648.json": "Breaking News: Multiple people were shot and some were killed at a medical building in Tulsa, Oklahoma, the police said. The gunman is also dead. https://t.co/FdK5vhHOFS",
  "data/tweet-nytimes/2022/6/1532150130241044481.json": "Breaking News: In its largest student loan forgiveness action ever, the U.S. Education Dept. will cancel $5.8 billion owed by students of Corinthian Colleges. https://t.co/S5MKUs6KIB",
  "data/tweet-nytimes/2022/6/1531995262935355392.json": "A woman who approached a bison at Yellowstone National Park was gored by the animal on Monday, according to park officials. Her condition was not released, and it was unclear whether she had survived. https://t.co/bHlV2l41zW",
  "data/tweet-nytimes/2022/6/1532202883818704896.json": "Beto O’Rourke renewed his criticism of Gov. Greg Abbott over gun laws in Texas. “Not only did he not take action to save the lives of our kids,” O’Rourke said, “he took action to make it more certain that we would lose the lives of our kids.” https://t.co/RpkYJgQyAR",
  "data/tweet-nytimes/2022/6/1532197837894823941.json": "The Ukrainian national soccer team defeated Scotland, 3-1, on Wednesday, bringing Ukraine within reach of its second World Cup appearance. https://t.co/VNwVAQI0Wq",
  "data/tweet-nytimes/2022/6/1532195311300620294.json": "For six weeks, the defamation case that the actor Johnny Depp filed against his ex-wife Amber Heard offered a rare instance of high-profile #MeToo charges and countercharges being hashed out in the public spotlight of a courtroom. https://t.co/ItJXGvuXZ0",
  "data/tweet-nytimes/2022/6/1532124854899572736.json": "A 150-mile leisurely bike ride from Trieste, Italy, through Slovenia, to the ancient city of Pula, Croatia, brims with ancient traditions, sublime food and perched-village photo ops. https://t.co/jOeFDUHQX5 https://t.co/9sX6biHURi",
  "data/tweet-nytimes/2022/6/1532014220425961473.json": "In Opinion\n\n“I thought Vladimir Putin had invaded Ukraine. I was wrong. Putin had invaded Europe,” Thomas Friedman writes. “He shouldn’t have done that. This could be the biggest act of folly in a European war since Hitler invaded Russia in 1941.”\nhttps://t.co/mjvMBuMOeU",
  "data/tweet-nytimes/2022/6/1532255733387083782.json": "Queen Elizabeth II is celebrating 70 years on the British throne — her Platinum Jubilee. \n\nThe festivities will begin with a military parade, a flyover, a gun salute and the royal family’s appearance on the balcony of Buckingham Palace. Follow along live. https://t.co/7V2qH8J3Kg",
  "data/tweet-nytimes/2022/6/1532301015009177603.json": "Breaking News: Doctors successfully transplanted a 3-D printed ear made of living human cells, a major milestone in bioengineering. https://t.co/CdeAdCdoUx",
  "data/tweet-nytimes/2022/6/1532289697883496449.json": "The Ukrainian national soccer team defeated Scotland, 3-1, on Wednesday, bringing Ukraine within reach of its second World Cup appearance. https://t.co/Zt4c9G7CkA https://t.co/8h8ga5yjfz",
  "data/tweet-nytimes/2022/6/1532229292192681984.json": "The Natalie Medical Building, where a gunman opened fire and killed four people, is part of the campus of the Saint Francis Hospital in Tulsa.\n\nIt is home to ambulatory and breast cancer surgery centers, the hospital’s website says. https://t.co/oLv04nJ5M6",
  "data/tweet-nytimes/2022/6/1532275862892167168.json": "Queen Elizabeth II's seven decades on the throne: in photos. 👑\n\nHer long reign has made her a witness to cultural upheavals from the Beatles to Brexit, and political leaders from Winston Churchill to Boris Johnson. #PlatinumJubilee https://t.co/tIXJDxjXrm https://t.co/moYZNbyFPu",
  "data/tweet-nytimes/2022/6/1532311849160560645.json": "Prince George, Prince Louis and Princess Charlotte waved from the lead carriage during the Trooping the Color parade.\n\nQueen Elizabeth II is not attending this part of the #PlatinumJubilee events, but younger royals are featuring prominently. Watch live. https://t.co/sYscQ5uVhr https://t.co/jEeluoH3KQ",
  "data/tweet-nytimes/2022/6/1532299284489674753.json": "Barack Obama paid tribute to Queen Elizabeth II in a video message in which he said they had formed their own “special relationship.”\n\nFollow live updates on the #PlatinumJubilee celebrations. https://t.co/r2LBd7leXh https://t.co/Evum96FfL7",
  "data/tweet-nytimes/2022/6/1532304674560278528.json": "Crowds erupted in applause as Prince George, Princess Charlotte, Prince Louis and other members of the British royal family rode down the Mall in carriages and on horseback.\n\nWatch Queen Elizabeth II's #PlatinumJubilee celebrations live. https://t.co/cXViIsjfM6 https://t.co/tBSsrCo2ZG",
  "data/tweet-nytimes/2022/6/1532327606410006528.json": "In what was almost certain to be the emotional highlight of the #PlatinumJubilee, Queen Elizabeth II stepped out onto the balcony of Buckingham Palace. \n\nWatch the celebrations live. https://t.co/v5whDCyP1Z https://t.co/MeY00gcqb0",
  "data/tweet-nytimes/2022/6/1532112279692509185.json": "The Biden administration said on Wednesday it would cut in half the amount it charges companies to build wind and solar projects on federal lands, a move designed to encourage development of renewable energy. https://t.co/9VwIC8h7Jc",
  "data/tweet-nytimes/2022/6/1532316180349845505.json": "Johnny Depp has been the face of Dior’s Sauvage men’s scent since 2015. The verdict is still out on whether Depp’s defamation case against Amber Heard hurt or helped sales, writes our fashion critic, Vanessa Friedman. https://t.co/UCsvuWstx9",
  "data/tweet-nytimes/2022/6/1532167637890899970.json": "Frightened students. Phone calls. Memorials and stuffed animals. From the University of Texas in 1966, to Columbine in 1999 and now Uvalde, the images of school shootings across America reveal hauntingly similar scenes. https://t.co/ofQrdQuwhG https://t.co/AwW2OJiPhP",
  "data/tweet-nytimes/2022/6/1532190287434481665.json": "They oversee the flow of billions of dollars from Putin-connected Russians to companies involved in superyachts and villas. Now they’ve drawn the attention of a U.S. task force that is trying to disrupt the Russian war machine. https://t.co/KNKQ4fUuI1",
  "data/tweet-nytimes/2022/6/1532373732567687168.json": "Prince Louis didn’t appear to enjoy the military flyover for Queen Elizabeth II’s #PlatinumJubilee. The 4-year-old is the fifth in line to the British throne.\nhttps://t.co/dby2Q541ak https://t.co/UlQRmkwFwz",
  "data/tweet-nytimes/2022/6/1532369023903666178.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/55ehLTgbUZ",
  "data/tweet-nytimes/2022/6/1532022940883116036.json": "In Opinion\n\n\"We are not encouraging or enabling Ukraine to strike beyond its borders,\" President Biden writes in a guest essay. \"We do not want to prolong the war just to inflict pain on Russia.\" https://t.co/xU3nGxXFtY https://t.co/Sn8BA9uzkW",
  "data/tweet-nytimes/2022/6/1532180236925812739.json": "In the final moments of her life, Eva Mireles, a teacher at Robb Elementary School, was on the phone with her husband, a school district police officer. The call was among the new details that have added to the shifting portrait of the shooting in Uvalde. https://t.co/SOpZwt6ytX",
  "data/tweet-nytimes/2022/6/1532385063198916608.json": "Breaking News: A New York appeals court upheld Harvey Weinstein’s 2020 sex-crimes conviction, raising the likelihood he'll serve most of his 23-year sentence. https://t.co/qkRorc2iWl",
  "data/tweet-nytimes/2022/6/1532350075137138689.json": "Queen Elizabeth II was joined on the Buckingham Palace balcony by four generations of Britain’s royal family for her #PlatinumJubilee.\n\nIt was a smaller group than in previous jubilee years, with Prince Andrew and Prince Harry missing from the lineup.\nhttps://t.co/p9eVu3C8DU",
  "data/tweet-nytimes/2022/6/1532392879200559105.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/HK4DC61b3g",
  "data/tweet-nytimes/2022/6/1532319897564372996.json": "Ukraine accused Russia of forcibly deporting hundreds of thousands of Ukrainians from occupied territories. President Volodymyr Zelensky called the campaign “one of Russia’s most heinous war crimes.”\nhttps://t.co/nNReJBRSxw",
  "data/tweet-nytimes/2022/6/1532410185221799942.json": "Breaking News: The gunman who killed four people at a Tulsa medical building underwent back surgery last month and the doctor who performed it was one of the victims, police said. His weapons included an AR-15-style rifle he bought hours before the attack. https://t.co/lddrAIQxdj",
  "data/tweet-nytimes/2022/6/1531938636417073156.json": "The U.S. will send Ukraine advanced rocket systems and munitions as part of a new $700 million package of military aid intended to help Ukrainians fight back against Russia, President Biden said on Tuesday. https://t.co/Sjvc44IRsp",
  "data/tweet-nytimes/2022/6/1532431882448666625.json": "Doctors successfully transplanted a 3-D printed ear made of living human cells. The new ear, transplanted in March, will continue to regenerate cartilage tissue, giving it the look and feel of a natural ear, said the biotech company that made the implant. https://t.co/gCmmBnOsKF https://t.co/DZbke2sNUN",
  "data/tweet-nytimes/2022/6/1532205391265898496.json": "Having something to look forward to can boost your mood and lower your stress, studies suggest. Whether it's something small or large, like trying a new book or planning a trip, here are ways to incorporate the power of anticipation into everyday life. https://t.co/53fSJN7WaT",
  "data/tweet-nytimes/2022/6/1532454033667112975.json": "Breaking News: President Biden plans to travel to Saudi Arabia this month to rebuild relations in an effort to lower gas prices in the U.S. and isolate Russia. https://t.co/N2roZNSZbS",
  "data/tweet-nytimes/2022/6/1532346340201713664.json": "After he heard two loud noises he recognized as gunfire, Gannon Gill, a physician assistant, led his patient to safety at the Tulsa medical center that was the site of a mass shooting. https://t.co/sHhCA81Bst",
  "data/tweet-nytimes/2022/6/1532462077163585536.json": "“We value the comfort and self-regard of men, especially famous ones, more than we value the safety and dignity of women, even famous ones,” our critic @aoscott writes on the Johnny Depp-Amber Heard trial verdict. https://t.co/EOt3nrQCKr",
  "data/tweet-nytimes/2022/6/1532457042471952384.json": "The gunman who killed four people at a Tulsa medical building underwent back surgery last month and the doctor who performed it was one of the victims, police said. His weapons included an AR-15-style rifle he bought hours before the attack. https://t.co/IoqGq6jHjL https://t.co/byUy3Sk2sd",
  "data/tweet-nytimes/2022/6/1532515933834575901.json": "Breaking News: In a speech, President Biden urged Congress to ban assault-style weapons, expand background checks and pass “red flag” laws. https://t.co/jzZ8Q3Tfvt https://t.co/mJ6zqFAXvA",
  "data/tweet-nytimes/2022/6/1532540282050383872.json": "Breaking News: New York lawmakers passed a set of gun bills to raise the minimum age to buy a semiautomatic rifle to 21 and revise the state’s “red flag” laws.\nhttps://t.co/0ZIxXejuXX",
  "data/tweet-nytimes/2022/6/1532440701962797062.json": "Glittery butterflies. TikTok. Superman. Encanto. These are just a few of the details that families of the victims of the Uvalde mass shooting provided about their children to the team creating customized caskets for their funeral services. https://t.co/gkIUN2Y3TY https://t.co/maNlcjase2",
  "data/tweet-nytimes/2022/6/1532517192041898009.json": "Zaila Avant-garde was 14 last year when she became the first Black American to win the Scripps National Spelling Bee. Her ambitions do not stop there. She wants to play for the WNBA, work at NASA and develop a way for humans to survive longer in space. https://t.co/b1k5h3ym5s https://t.co/hu3euykPGW",
  "data/tweet-nytimes/2022/6/1532399184644546561.json": "At least a half-dozen current and former Proud Boys, the far-right nationalist group that was at the forefront of Jan. 6 Capitol riot, have secured seats on the Miami-Dade Republican Executive Committee, seeking to influence local politics from the inside. https://t.co/O7lyLahPur",
  "data/tweet-nytimes/2022/6/1532538833815879689.json": "“This is not about taking away anyone’s guns,” President Biden said in a speech calling on Congress to pass new federal gun legislation, including stopping the sale of assault-style weapons, expanding background checks and passing “red flag” laws. https://t.co/lW6DP428ML https://t.co/C400givGlO",
  "data/tweet-nytimes/2022/6/1532563421971025934.json": "Harini Logan, 14, won the Scripps National #SpellingBee, claiming victory in a blistering, first-of-its-kind spell-off that capped a marathon duel. The eighth-grader from San Antonio, Texas, was reinstated earlier in the final round. https://t.co/G3j9QFgQUQ https://t.co/UCY0g2ICKp",
  "data/tweet-nytimes/2022/6/1532487242320695314.json": "Queen Elizabeth II celebrated 70 years on the throne Thursday, as the first day of the Platinum Jubilee celebrations kicked off in London. The festivities included a military parade, a 41-gun salute and a 70-aircraft flyover. https://t.co/HOWsRNQmJp"
}