{
  "data/tweet-economist/2022/3/1498456772327137288.json": "Unlike Vladminir Putin, Volodymyr Zelensky is fighting for his country not in the name of a dark imperial fantasy, but out of the conviction that Ukraine is sovereign and independent https://t.co/s7hcMAQVXK",
  "data/tweet-economist/2022/3/1498479063937257472.json": "We found anti-war posts coming from Russia’s 50 largest cities, across all 11 time zones and in 83 out of 85 federal subjects https://t.co/BWsMCcF3OV",
  "data/tweet-economist/2022/3/1498474876939780097.json": "As a member of NATO, Poland now seems like a safe haven for Ukrainians. Any attack on it by Russia would trigger the alliance’s mutual-defence provisions https://t.co/4vBdMjsAgZ",
  "data/tweet-economist/2022/3/1498473605008695296.json": "Some half a million people have already left Ukraine since the war began, according to the UN https://t.co/dNcd0X12Ve",
  "data/tweet-economist/2022/3/1498469094508613637.json": "Russia’s immense armed forces have yet to win control of a single major urban area. Ukrainians have defended their homeland ferociously. Our reporters sum up day five of the conflict https://t.co/nc9Ag3SWuZ",
  "data/tweet-economist/2022/3/1498464111763640326.json": "The Russian war machine is struggling. The question is whether these troubles are temporary or indicate a deeper rot that Ukraine can exploit https://t.co/zzP5UpzETq",
  "data/tweet-economist/2022/3/1498487713611366400.json": "If Vladimir Putin has to destroy cities like Kyiv and Kharkiv in order to impose a puppet government on Ukraine, he will in an important sense have already lost the war  https://t.co/421emTzYGB",
  "data/tweet-economist/2022/3/1498491226839990278.json": "But a flood of support for Ukraine from around the world is breaking through propaganda barriers https://t.co/53toRskiYc",
  "data/tweet-economist/2022/3/1498499527271190529.json": "Standing to attention in a way that would make any sergeant major weep with frustration, new recruits to Ukraine’s Territorial Defence force lined up. “Glory to the heroes!” they roared https://t.co/MMIu14yeHM",
  "data/tweet-economist/2022/3/1498510870497927170.json": "Russia’s biggest problem appears to be logistics https://t.co/XT1HxbWI3s",
  "data/tweet-economist/2022/3/1498510868740517888.json": "Outside of Russia, the hashtag was found in 91 other countries including Ukraine, Belarus, America and China https://t.co/ZHfNFb1z6b",
  "data/tweet-economist/2022/3/1498517154110623748.json": "In the third year of his presidency and on the third day of the invasion, this actor-turned-politician is fast becoming a hero https://t.co/7UASy7HuHR",
  "data/tweet-economist/2022/3/1498531933349097475.json": "Russia’s propaganda machine has been struggling to keep reality at bay. Actors, businessfolk and even some politicians are starting to speak out https://t.co/IoTHQVbmgS",
  "data/tweet-economist/2022/3/1498528053915488257.json": "The cost of war on civilians is becoming apparent. Our reporters on the ground in Ukraine show how https://t.co/QVMwc3GZOC",
  "data/tweet-economist/2022/3/1498540271465906181.json": "There are signs of poor morale in some Russian units. Video footage shows at least one tank column hurriedly reversing after being confronted by unarmed civilians https://t.co/Xxu3quiEUu",
  "data/tweet-economist/2022/3/1498535905652617217.json": "Few expect the bloodshed to end soon. This map shows the parts of the north, east and south of Ukraine where a force of 150,000 troops is advancing https://t.co/9arduIYfvV",
  "data/tweet-economist/2022/3/1498556401374965760.json": "Those joining the online movement have ranged from the country’s leading chess and tennis players to the daughter of Vladimir Putin’s own spokesman, Dmitry Peskov https://t.co/n6QyxLHqQr",
  "data/tweet-economist/2022/3/1498555593736474626.json": "The war may be entering an “uglier stage”, in which Russia may not work as hard at avoiding civilian casualties https://t.co/z8mU5ORpn9",
  "data/tweet-economist/2022/3/1498567977989509121.json": "The bulk of Russian forces are within 25km of Kyiv. They may try to encircle it within days. This map shows how troops have advanced https://t.co/al0OtVwoob",
  "data/tweet-economist/2022/3/1498574885756579841.json": "The Russian invasion of Ukraine is not going to plan. The president has made three key mistakes  https://t.co/zEFomIpP3u",
  "data/tweet-economist/2022/3/1498564470360186882.json": "Ukrainian men aged 18-60 are subject to conscription and banned from leaving the country. Such rules create heartbreaking scenes at the border, where mainly women and children are crossing https://t.co/ZL59Q1HMBf",
  "data/tweet-economist/2022/3/1498587423684636674.json": "Vladimir Putin claims Russia is not conducting a war, but a nearly bloodless military operation to free its Ukrainian brothers. But the truth is breaking through https://t.co/xJi3b25Zua",
  "data/tweet-economist/2022/3/1498600877984264199.json": "If Vladimir Putin’s aim was to cause panic and demoralise his enemy as cease-fire talks began in Belarus, he failed https://t.co/tig5VsHWYA",
  "data/tweet-economist/2022/3/1498604690740846595.json": "On both sides of the Atlantic foreign-policy analysts expressed astonishment at the swiftness and severity of the international response https://t.co/yfmDQ1WQag",
  "data/tweet-economist/2022/3/1498592076291784704.json": "Rockets and cluster munitions have begun targeting residential areas in Kharkiv, causing widespread damage to entire blocks of flats. Images show corpses littering the street https://t.co/wE3b5xWWdN",
  "data/tweet-economist/2022/3/1498616249491808260.json": "♦️ A Russian missile struck the government district in Kharkiv.\n\n♦️ Alexander Lukashenko insisted that Belarusian forces would not take part in the fighting.\n\n♦️ YouTube banned RT and Sputnik, two Russian state-owned media organisations, across Europe.\n\nStay up to date👇",
  "data/tweet-economist/2022/3/1498625312162209795.json": "Vladimir Putin’s gamble on a quick war has failed—now he appears set on a grim one https://t.co/LnLAyzzWmi",
  "data/tweet-economist/2022/3/1498626733024727040.json": "RT @Sondreus: Where in Russia do people oppose the war? I tracked the use of protest hashtag #нетвойнеI (\"no war\"), and found opposition in…",
  "data/tweet-economist/2022/3/1498637010206138372.json": "Within and outside Russia, people are joining the online protest against war in Ukraine, using the hashtag #нетвойне, which means “no war”. \n\nRead how Russian authorities have responded by tightening their grip on the internet ⬇️",
  "data/tweet-economist/2022/3/1498634871547305989.json": "Almost all Ukrainians say they wish to return to their homeland and rebuild it when the war ends. But no one knows when or how that will happen https://t.co/aYsitMZvZt",
  "data/tweet-economist/2022/3/1498630071636144128.json": "Ukrainian refugees are more to the Polish government’s liking than Syrians and Afghans. It began building a fence along its border to keep them out in 2015 https://t.co/Xrbun97E7x",
  "data/tweet-economist/2022/3/1498655769750917121.json": "But the truth is breaking through https://t.co/CTVurOjmz6",
  "data/tweet-economist/2022/3/1498641053053763585.json": "For young people in Russia, opposition has long been met with intimidation. 1843 magazine met some of them last year https://t.co/Yckc6VIfHN",
  "data/tweet-economist/2022/3/1498673257712693254.json": "Russian state-owned media organisations have been banned or restricted in many countries. But inside Russia, how is its propaganda machine talking about the war in Ukraine? We explain ⬇️  https://t.co/38JErSF03T",
  "data/tweet-economist/2022/3/1498694989748088837.json": "The Russian authorities have responded by tightening their grip on the internet https://t.co/J11NkN3YVO",
  "data/tweet-economist/2022/3/1498676660467556361.json": "“We all help one another and try to comfort each other.” Since Russia’s invasion of Ukraine began “The Intelligence” has been speaking daily to a resident of Kharkiv https://t.co/DzE1HiWr7h",
  "data/tweet-economist/2022/3/1498722766488543232.json": "But many are heading the other way. Scores of Ukrainians, most of them without military experience, are heading home to enlist https://t.co/DoNJwKTgpu",
  "data/tweet-economist/2022/3/1498731955642376199.json": "After images of Russia’s attack began to circulate on social media, the share of Britons in favour of sending weapons to Ukraine rose from 46% to 60% https://t.co/sujpg4dhxI",
  "data/tweet-economist/2022/3/1498754214813700102.json": "The Russian authorities have responded by tightening their grip on the internet https://t.co/31MNZAPCRX",
  "data/tweet-economist/2022/3/1498764655124271115.json": "Volodymyr Zelensky said that the missiles that recently fell on Kharkiv were deliberately targeted at civilians and described the attack as a war crime  https://t.co/JfESC9js1d",
  "data/tweet-economist/2022/3/1498762519657295875.json": "Ukraine’s capital is not yet surrounded, but may soon be  https://t.co/hM3UxXsVTw",
  "data/tweet-economist/2022/3/1498760752227889152.json": "The goal may be to spread terror  https://t.co/3hYaS5jtzH",
  "data/tweet-economist/2022/3/1498779015657709570.json": "Kyiv has the deepest metro station in the world. Now it’s being used as a bomb shelter. From @1843mag https://t.co/yDEkdyDuuu",
  "data/tweet-economist/2022/3/1498504066036609026.json": "The EU’s borders, which have been closed ever more tightly to most refugees since a big influx from Syria and Afghanistan in 2015-16, are opening up for Ukrainians https://t.co/zxzQJD1Yzj",
  "data/tweet-economist/2022/3/1498799466467495940.json": "On the morning of March 1st President Volodymyr Zelensky announced he was putting an experienced soldier in charge of governing the capital  https://t.co/pJ7ZZqOiQG",
  "data/tweet-economist/2022/3/1498815110764183553.json": "There is no serious doubt that Russia has broken international law in Ukraine https://t.co/hh92XqWnz7",
  "data/tweet-economist/2022/3/1498812847744237568.json": "Russia’s recent strikes in Kharkiv and other cities show little sign of any effort to identify enemy forces  https://t.co/JwdfWmXae7",
  "data/tweet-economist/2022/3/1498873488811216905.json": "There is prima facie evidence that Russia has committed at least three of the four main crimes prosecuted by the International Criminal Court https://t.co/UMKCqzjQpE",
  "data/tweet-economist/2022/3/1498853620024020992.json": "China and Russia agree that big countries should run the world https://t.co/KWC1Wgkmju",
  "data/tweet-economist/2022/3/1498899010131832838.json": "It is one thing to think Russia is in breach of international laws, quite another to bring any Russian, let alone its head of state, to the world court https://t.co/N3LeDySkaz",
  "data/tweet-economist/2022/3/1498935709809446914.json": "“It’s not the fault of the Russian citizens,” said Vova, looking up from his phone, “it’s the fault of Putin.” @wendell23's dispatch from Ukraine in @1843mag https://t.co/Cvu5NkinfL",
  "data/tweet-economist/2022/3/1498945576385363970.json": "Volodymyr Zelensky is an avid user of social media—his Instagram following is the fifth-biggest of any world leader. Now other Ukrainian officials have followed his lead https://t.co/VvOTCxbsbO",
  "data/tweet-economist/2022/3/1498959027161681922.json": "Russia has not recognised the International Criminal Court since 2016, when the court classified its annexation of Crimea as an occupation https://t.co/nEFwDLRg6J",
  "data/tweet-economist/2022/3/1498913648504356869.json": "Even with sophisticated methods at its disposal, Russia has “very different” targeting principles from those of NATO countries, says an analyst at the Royal United Services Institute https://t.co/pVf20u31nX",
  "data/tweet-economist/2022/3/1498974433263955973.json": "Vladimir Putin’s nuclear threat shows how much is going wrong for him in Ukraine. Why won't Russia leave its neighbour alone? \n\nRead our latest analysis on the invasion: https://t.co/Ku48sueqh2 https://t.co/yDCDgXLqFT",
  "data/tweet-economist/2022/3/1498963102469177345.json": "Three-quarters of Ukrainians aged over 13 are active on social media. They are the ones filming the videos of war that catch the world’s attention https://t.co/fzgbmNCtG1",
  "data/tweet-economist/2022/3/1498977516509351937.json": "Half a century after China blasted the Soviet invasion of Czechoslovakia, the world order is turned upside-down https://t.co/sANt1zmHp9",
  "data/tweet-economist/2022/3/1499007952329527300.json": "After images of Russia’s attack began to circulate on social media, the share of Britons in favour of sending weapons to Ukraine rose from 46% to 60% https://t.co/nxdiq8ebD7",
  "data/tweet-economist/2022/3/1498994396271890438.json": "China is treading a very fine line on Ukraine, @gadyepstein—one of our China specialists—tells “The Intelligence” https://t.co/obJ53RC602",
  "data/tweet-economist/2022/3/1499021475604578305.json": "Volodymyr Zelensky has requested that the West “impose a no-fly zone over significant parts of Ukraine”. We explain what the measure is, and why it comes at a cost https://t.co/qmbAc6N4fU",
  "data/tweet-economist/2022/3/1498989558624620548.json": "♦️ Russia’s defence ministry claims that its forces have taken control of the port city of Kherson. Local authorities deny this. \n\n♦️ Ukrainian officials say airborne Russian troops have landed in Kharkiv.\n\n♦️ Putin must “pay a price”, Biden warns.\n\nCatch up on Ukraine ⬇️",
  "data/tweet-economist/2022/3/1499017205215809538.json": "After a little more than one year in office, the president is in a slump. His answers to America’s domestic ailments were unsatisfying https://t.co/RNTmMFzSvx",
  "data/tweet-economist/2022/3/1499037859688468482.json": "As Ukrainians flee the country, guns and missiles are entering. But delivering arms is hazardous. We explain how it is being done https://t.co/RlhB2RQ0go",
  "data/tweet-economist/2022/3/1499032310833991684.json": "Joe Biden is as unpopular as Donald Trump had become at this point in his presidency. He was in especially poor form, stumbling through both scripted lines and ad libs https://t.co/kK56kGdwa1",
  "data/tweet-economist/2022/3/1499003255828975623.json": "\"We stand with you, this is not your fault\"—Malala Yousafzai sends a message to young people in Ukraine.\n\nTo mark #IWD2022, @Malala and @zannymb discuss how to improve the lives of women and girls everywhere.\n\nSubscribers can sign up to watch here: https://t.co/Cg6G1x8syd https://t.co/LVYMJyICAn",
  "data/tweet-economist/2022/3/1499074008330944512.json": "NATO countries say that a no-fly zone is too risky. But Ukraine’s former defence minister disagrees—and believes that it “could avert a humanitarian disaster” https://t.co/zlonplNvtG",
  "data/tweet-economist/2022/3/1499087910372524034.json": "The prospect of facing legal charges might possibly deter some of Vladimir Putin’s lieutenants from following orders to commit war crimes https://t.co/7LunhvEDM3",
  "data/tweet-economist/2022/3/1499092666298126337.json": "Xi Jinping and his government maintain a pose of pseudo-neutrality towards the conflict in Ukraine, but nobody doubts China’s pro-Russian lean https://t.co/FcVuILsVxH",
  "data/tweet-economist/2022/3/1499107790157197319.json": "Countries arming Ukraine “cannot fail to understand the degree of danger” they are flirting with, says Russia’s foreign ministry. Suppliers seem undaunted https://t.co/xjcKWIlZ8x",
  "data/tweet-economist/2022/3/1499121221081911302.json": "A no fly-zone would “essentially mean the US military would be shooting down…Russian planes”, warned the White House https://t.co/wxGGJABSjS",
  "data/tweet-economist/2022/3/1499130181478400002.json": "Ukraine’s president, Volodymyr Zelensky, has become cooler than St Petersburg grime with his defiant social media videos https://t.co/fSzWWLmfam",
  "data/tweet-economist/2022/3/1499125825878343680.json": "If they believed President Putin’s goal was a modern economy that he would not jeopardise by invading Ukraine, they were wrong https://t.co/o3qkOFSUoL",
  "data/tweet-economist/2022/3/1499140662968696834.json": "“Western politicians danced with Vladimir Putin (some of them literally) and retired to chair the boards of Russian companies,” writes Ingrida Simonyte. “These firms funded the Kremlin’s arms race and diverted billions to Mr Putin’s entourage”  https://t.co/p6wwNbOqDc",
  "data/tweet-economist/2022/3/1499127445840089089.json": "A no-fly zone “will stop Russia from launching devastating missile strikes, dropping bombs or undertaking large-scale air assault operations,” writes Ukraine’s former defence minister in a guest commentary  https://t.co/V3oOHJSyGn",
  "data/tweet-economist/2022/3/1499149016944320516.json": "The Russian invasion of Ukraine is not going to plan. The president has made three key mistakes  https://t.co/xFUI1wa56d",
  "data/tweet-economist/2022/3/1499141784970084353.json": "Civilians went to bed in a Ukrainian city and woke up in a Russian-controlled one. We report on the fall of Kherson  https://t.co/h8rtF0ZQla",
  "data/tweet-economist/2022/3/1499174217602023429.json": "“Everybody must see now that President Putin will not be stopped with persuasion or sanctions,” writes Ukraine’s former defence minister. “The time has come to take the first really effective step and to impose a no-fly zone” https://t.co/EgEtMw1jqT",
  "data/tweet-economist/2022/3/1499170720831709187.json": "Since it gained independence in 1991, Ukraine has struggled to find heroes around whom to build a national myth. But the past days have produced dozens  https://t.co/bHkRbfS6nX",
  "data/tweet-economist/2022/3/1499168703459508233.json": "After one week of a war that has killed more than 2,000 Ukrainian civilians, according to the Ukrainian government, Vladimir Putin now has a territorial trophy to show for it  https://t.co/KBaQnfJMM4",
  "data/tweet-economist/2022/3/1499200396279042048.json": "Ukraine has spent centuries trying to find a national hero. The past days have produced dozens, writes @akurkov for @1843mag https://t.co/HoVpNWX1Nj",
  "data/tweet-economist/2022/3/1499192590868094977.json": "If Vladimir Putin has to destroy cities like Kyiv and Kharkiv in order to impose a puppet government on Ukraine, he will in an important sense have already lost the war  https://t.co/kh8tkyfrAE",
  "data/tweet-economist/2022/3/1499212432408985600.json": "When Vladimir Putin invaded Ukraine he miscalculated. Now that he is wielding the threat of nuclear war, the world must make clear that his actions are unacceptable. He must not miscalculate again  https://t.co/Knrqg3U8Wn",
  "data/tweet-economist/2022/3/1499231402277183497.json": "Vladimir Putin’s unprovoked invasion of a sovereign state has shocked some European countries into breaking old pacifist taboos https://t.co/e4fogx8wXO",
  "data/tweet-economist/2022/3/1499253009561309190.json": "Before the war Ukrainian teenagers liked to text each other photos of Russian rappers. Now the image circulating on their phones is of the so-called “ghost of Kyiv” https://t.co/3nxZkziAr0",
  "data/tweet-economist/2022/3/1499266462766309376.json": "Russia’s economy is clearly in turmoil. Vladimir Putin’s actions in Ukraine might end up choking his own citizens https://t.co/Yka3G9wK0u",
  "data/tweet-economist/2022/3/1499261663656222727.json": "A world run by big countries appeals to Chinese nationalists, who have filled social media with praise for Vladimir Putin https://t.co/yKveGSoN9Q",
  "data/tweet-economist/2022/3/1499297597751803904.json": "The West has used crushing sanctions on Russia. The implications are huge  https://t.co/y6TfUvWehU",
  "data/tweet-economist/2022/3/1499343745694769152.json": "As Russian troops advance towards Kyiv, Ukrainian forces are preparing to fight back. Our correspondent reports with the latest from Kyiv  https://t.co/3QqI3ayO3I https://t.co/es9s9JN9Rz",
  "data/tweet-economist/2022/3/1499350366596571138.json": "From the start, Vladimir Putin has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him. Our cover this week https://t.co/iWvQNzeN4u https://t.co/gMiFJrNbmV",
  "data/tweet-economist/2022/3/1499355491692158976.json": "RT @timjudah1: I can’t tell you what is happening where there is fighting but my local supermarket has reopened after being closed for a we…",
  "data/tweet-economist/2022/3/1499361723811348485.json": "If he prevails in Ukraine today, his next fix will be in Georgia, Moldova or the Baltic states. He will not stop until he is stopped. The world must stand up to him https://t.co/ZCNhu45Dd4",
  "data/tweet-economist/2022/3/1499355197151367173.json": "The West’s measures have triggered chaos in Russia’s $1.6trn economy. This will cause alarm around the world, not least in China, which will recalculate the costs of a war over Taiwan https://t.co/mMCU8gmcEi",
  "data/tweet-economist/2022/3/1499374834387718147.json": "From the start, he has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him https://t.co/zWe925mRvP",
  "data/tweet-economist/2022/3/1499378053872562176.json": "Thirty-nine governments—a record number—appealed to the ICC to open an investigation into possible war crimes committed by Russia in Ukraine  https://t.co/nwGnEdHRcJ",
  "data/tweet-economist/2022/3/1499371518572343298.json": "Is Vladimir Putin a war criminal? And if so, is it possible to charge him? A thread 👇 https://t.co/9cHiSCusFX https://t.co/FvBfgozUzy",
  "data/tweet-economist/2022/3/1499202975453089798.json": "“If it escalates…it could be the biggest war in Europe since the second world war with all of the consequences you’d expect.” @shashj on how Vladimir Putin’s attacks on Ukraine could escalate https://t.co/KF5Mu8IRko",
  "data/tweet-economist/2022/3/1499388521944993793.json": "He insists that the world back off while he sharpens his knife and sets about his slaughter. Other countries must stand up to him https://t.co/HB15yMbp6u",
  "data/tweet-economist/2022/3/1499379183042056193.json": "Videos of cluster bombs in Kharkiv and even an attack on a kindergarten in Okhtyrka offer evidence of indiscriminate attacks on civilians https://t.co/5kIx7gRX9w",
  "data/tweet-economist/2022/3/1499399204162064394.json": "“They are ready to fight.” Our correspondent reports with the latest from Kyiv.\n\nClick to watch ⬇️",
  "data/tweet-economist/2022/3/1499410046287069184.json": "“The crisis is not in Ukraine,” writes @IngridaSimonyte. “It is in Russia, and it has been deepening for decades. Russia’s aggression began long ago”  https://t.co/VbljNzyj5E",
  "data/tweet-economist/2022/3/1499419860635369477.json": "It took more than 30 years for BP, a British energy company, to build its Russian business. It took less than four days to decide to dismantle it https://t.co/703tCyk1QH",
  "data/tweet-economist/2022/3/1499415069641297931.json": "The idea that Vladimir Putin would carry out his threat to use battlefield nuclear weapon is surely unlikely. Unfortunately, it is not impossible: he has just invaded his neighbour https://t.co/LGCtztiJGY",
  "data/tweet-economist/2022/3/1499426582976516100.json": "One goal of Russia’s advance in Ukraine is to create a “land bridge” that connects the Russian-speaking Donbas, and Russia itself, with Crimea, which it annexed in 2014. \n\nTo achieve its aims, Russia will need to hold its new turf. Can it do that?",
  "data/tweet-economist/2022/3/1499423970159955973.json": "Russia rejects the jurisdiction of the ICC. But there is no serious doubt that Russia has broken international law https://t.co/jWU6Ymbtwr",
  "data/tweet-economist/2022/3/1499442205714526213.json": "The world must be willing to bleed Vladimir Putin’s regime of the resources that enable him to wage war and abuse his own people even if that imposes costs on Western economies https://t.co/orDctaCFLo",
  "data/tweet-economist/2022/3/1499444754991439872.json": "In a country fast turning totalitarian, there is plenty of room for bravery. More than 1m people in Russia have signed a petition against the war https://t.co/x17mWaaHzl",
  "data/tweet-economist/2022/3/1499448561238478851.json": "After invading Ukraine nearly a week ago, Vladimir Putin has ordered Russia’s nuclear forces to be on high alert. \n\nWhat might he do next, and how should NATO respond? @shashj, The Economist’s defence editor, gives his take. \n\nRead our latest analysis: https://t.co/Ku48sueqh2 https://t.co/CjMMsgokGw",
  "data/tweet-economist/2022/3/1499462970207784970.json": "From the start, Vladimir Putin has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him. Our cover this week https://t.co/RuaETMqc9z https://t.co/2uzypdsMy2",
  "data/tweet-economist/2022/3/1499448729904066567.json": "Some instances of violence in Ukraine that might meet the criteria have been captured on phones https://t.co/7vLsbxPK0p",
  "data/tweet-economist/2022/3/1499469169116553217.json": "Our French election forecasting model puts Emmanuel Macron’s chances of re-election at 88% https://t.co/14SMEwBM4u",
  "data/tweet-economist/2022/3/1499468412455632903.json": "Emmanuel Macron has confirmed he will run for re-election. Our forecast suggests he has an 88% chance of winning https://t.co/QI0R4jMYCP",
  "data/tweet-economist/2022/3/1499476209247432720.json": "More than the people of any other country in Asia, people in Taiwan are stirred by the plight of Ukraine https://t.co/lnRdkZkMGm",
  "data/tweet-economist/2022/3/1499486803103039499.json": "“Western politicians danced with Vladimir Putin (some of them literally) and retired to chair the boards of Russian companies,” writes Ingrida Simonyte. “These firms funded the Kremlin’s arms race and diverted billions to Mr Putin’s entourage”  https://t.co/4uJ2jnqR7W",
  "data/tweet-economist/2022/3/1499478731311693838.json": "No major economy in the modern world has ever been hit so hard by sanctions https://t.co/vDK0G2Tjtc",
  "data/tweet-economist/2022/3/1499489801665490957.json": "“If there is anything in Russia you can be proud of right now, it is those people who have been detained,” Alexei Navalny, Russia’s jailed opposition leader, wrote in a statement https://t.co/WMOZuPHoVX",
  "data/tweet-economist/2022/3/1499172491222208515.json": "Remarkably stable politics is among the reasons why Uruguay has done so well https://t.co/Q8ZbE5jcB9",
  "data/tweet-economist/2022/3/1499498116504035333.json": "Thirty-nine governments—a record number—appealed to the ICC to open an investigation into possible war crimes committed by Russia in Ukraine https://t.co/OrezvYPzUr",
  "data/tweet-economist/2022/3/1499497377417375746.json": "All neighbouring EU countries have pledged to accept Ukrainians, in contrast to previous refugee crises https://t.co/NKrmChUVo4",
  "data/tweet-economist/2022/3/1499496878056083456.json": "Unloved he may be, but Emmanuel Macron now gets grudging respect in France. Fully 58% think he has “risen to the challenge” over Ukraine  https://t.co/WCn4hZN8od",
  "data/tweet-economist/2022/3/1499505664942555137.json": "He is committing war crimes in Ukraine. At home, he is subjecting his people to the harshest state terror since Stalin. And to the West, he is issuing threats of nuclear war. The world must stand up to him https://t.co/ntcLutE5d2",
  "data/tweet-economist/2022/3/1499495847624687619.json": "France is the eurozone’s second-biggest economy and the EU’s only serious military power. The outcome of the French election matters more than most https://t.co/D75GFwcg2D",
  "data/tweet-economist/2022/3/1499517253263495168.json": "Its central bank holds about $600bn in currency reserves. But around $400bn of this war chest could now be subject to sanctions https://t.co/Cl9L3QJiNz",
  "data/tweet-economist/2022/3/1499551213196619778.json": "The Ukrainian people have discovered they are ready to die for the idea that they should choose their own destiny. To a cynical dictator that must be incomprehensible. To the rest of humanity it is an inspiration https://t.co/OpbBDyphDD",
  "data/tweet-economist/2022/3/1499535358693941248.json": "Most Russians had no idea that their country was going to war until just before it did so, in part because the idea made no sense, in part because they were lied to https://t.co/gl1xzMLqj8",
  "data/tweet-economist/2022/3/1499515230082191369.json": "\"This is my plea, from a humble farmer in Ukraine to the people of the world: please ask your governments to stop this reckless war\" https://t.co/jQRwNcBW1e",
  "data/tweet-economist/2022/3/1499512449854226432.json": "The military build-up around Ukraine is the biggest concentration of firepower in Europe since the cold war https://t.co/mHFjOkwomI",
  "data/tweet-economist/2022/3/1499568593427648512.json": "Vladimir Putin’s latest aggression may at last shake Europe out of its energy complacency https://t.co/EW5z6kh3Uu",
  "data/tweet-economist/2022/3/1499563546732023818.json": "Normally one nurse looks after each baby who is critically ill. Maryna is caring for ten sick babies on her own. Stories from a Kyiv hospital by @timjudah1 and @ronhaviv https://t.co/uNZlDrjoYI",
  "data/tweet-economist/2022/3/1499580663829348352.json": "Ukrainian air defences have been persistent, but the Russians were also poorly prepared for the amount of resistence they have encountered https://t.co/9wDw6Xh5hq",
  "data/tweet-economist/2022/3/1499591262856486916.json": "Despite Vladimir Putin’s railing against the West’s “empire of lies”, plenty in Russia see his war for what it is: a conflict entirely of his own making https://t.co/wvng6fczQh",
  "data/tweet-economist/2022/3/1499595216768188422.json": "To Taiwanese people, the parallels between what Vladimir Putin is doing to Ukraine and what Xi Jinping might do to Taiwan are glaring https://t.co/J5NACOF6xV",
  "data/tweet-economist/2022/3/1499606069718528001.json": "\"Vladimir Putin’s propaganda machine cannot explain away all of this with ravings about neo-Nazis and NATO threats to Mother Russia\" https://t.co/luYesHCxlU",
  "data/tweet-economist/2022/3/1499599197242224644.json": "Not all of those leaving are Ukrainians, and some non-white refugees are receiving a hostile welcome https://t.co/33M1SDxi8T",
  "data/tweet-economist/2022/3/1499586079799787520.json": "So far, China has said it will continue trading with Russia as normal. However, access to the yuan may be of little use to Russia’s faltering economy https://t.co/h2NEE6QTov",
  "data/tweet-economist/2022/3/1499578136618487833.json": "China wants a sphere of influence in Asia in which its writ goes unchallenged by America. As a result, it has made its peace with Russian imperialism https://t.co/yQS20YY64K",
  "data/tweet-economist/2022/3/1499620632497119234.json": "Ukrainians are trusting strangers as they never have before. Armies of civilian volunteers are importing military kit from other parts of Europe and helping to organise evacuations https://t.co/UvzjWRxSEZ",
  "data/tweet-economist/2022/3/1499634914781810688.json": "Ukraine’s largest paediatric unit is reeling from the Russian invasion. Yet to a surprising extent it is still working, as these photos show https://t.co/kmTdMIX5z2",
  "data/tweet-economist/2022/3/1499643329239298049.json": "Germany has announced it would spend an extra €100bn ($111bn) on defence in 2022, tripling its defence budget for the year https://t.co/BF5TfR9FbC",
  "data/tweet-economist/2022/3/1499648374965952514.json": "The UN’s refugee agency reckons up to 4m people—almost a tenth of Ukraine’s population—might flee in the coming weeks https://t.co/YLGtacqqdJ",
  "data/tweet-economist/2022/3/1499656154384932867.json": "Many fear that Kyiv could share the fate of Grozny, the capital of Chechnya, much of which was left in ruins after an artillery pounding in 1994 killed 20,000 civilians. \n\nIt is a memory which should frighten the Russians, too https://t.co/qTiqWcRUSF\"",
  "data/tweet-economist/2022/3/1499680552848437248.json": "Our French election forecasting model puts Emmanuel Macron’s chances of re-election at 88% https://t.co/mcU74cCUS5",
  "data/tweet-economist/2022/3/1499696703020183555.json": "He insists that the world back off while he sharpens his knife and sets about his slaughter. Other countries must stand up to him https://t.co/T4OA37kxtU",
  "data/tweet-economist/2022/3/1499684335351472132.json": "What might Vladimir Putin do next, and how should NATO respond? @shashj, The Economist’s defence editor, gives his take. \n\nRead our latest analysis: https://t.co/Ku48sueqh2 https://t.co/iXnyxSY6O5",
  "data/tweet-economist/2022/3/1499705480243036161.json": "The sight of Russia’s central bank being hit so hard by sanctions no one expected will lead China to increase its efforts to establish the yuan as a reserve currency https://t.co/Q2fWuj8a9w",
  "data/tweet-economist/2022/3/1499713980843048967.json": "“He’s gone from coercion...to now punishment. I think he thinks, at this point, if he can’t get Ukraine, he’s pretty much going to destroy it.” Foreign-affairs specialist Fiona Hill assesses Vladimir Putin’s motivations in Ukraine, on “The Economist Asks” https://t.co/3d3tEnLD1i https://t.co/NOA2lAE8Tq",
  "data/tweet-economist/2022/3/1499725367396995079.json": "Ukraine’s offence was to be an independent country. Lithuania’s was to give Taiwan an opportunity to hint that it is https://t.co/MvVhDY8Z34",
  "data/tweet-economist/2022/3/1499705733063102464.json": "♦️ Russian forces take control of the Zaporizhzhia nuclear power plant. \n\n♦️ Volodymyr Zelensky says that meeting Vladimir Putin is “the only way to stop this war”.\n\n♦️ Foreign ministers meet to discuss the war, including requests for NATO to impose a no-fly zone.\n\nCatch up👇",
  "data/tweet-economist/2022/3/1499701725955035143.json": "Tweets from Ukraine’s defence ministry tell citizens which parts of a tank are most vulnerable to Molotov cocktails. Ordinary people risk their lives by standing in front of armoured vehicles https://t.co/VRjSdsePeg",
  "data/tweet-economist/2022/3/1499739813188100096.json": "Russia’s attack on Zaporizhzhia, a nuclear plant in Ukraine, is unprecedented. Operational nuclear reactors have never been in the firing line like this https://t.co/shH928C1ws",
  "data/tweet-economist/2022/3/1499689755398844416.json": "What is happening in Ukraine? We explain in maps by illustrating Russian advances, the build-up of troops and opposition to the war https://t.co/mylLphFFIF",
  "data/tweet-economist/2022/3/1499758335087812615.json": "Vladimir Putin's economic fortress is crumbling https://t.co/wPMMfoTE4r",
  "data/tweet-economist/2022/3/1499746996361519106.json": "Volodymyr Zelensky’s charisma and acting background have suited him perfectly to a war immersed in social media https://t.co/sCv2kRXa0R",
  "data/tweet-economist/2022/3/1499772423540989952.json": "China’s secret police wished to send a chilling message when they detained a Japanese diplomat for some hours on February 21st, trampling the legal principle of diplomatic immunity https://t.co/EvcCeRgMDe",
  "data/tweet-economist/2022/3/1499778726715875339.json": "The war has started consolidating Europe’s belief in itself and its ideals, and may increase its willingness to fight for them https://t.co/WLPabFuA13",
  "data/tweet-economist/2022/3/1499777713212735492.json": "The idea that Vladimir Putin would carry out his threat to use battlefield nuclear weapon is surely unlikely. Unfortunately, it is not impossible: he has just invaded his neighbour https://t.co/StfG8O1WOa",
  "data/tweet-economist/2022/3/1499779684212658186.json": "“There's nothing special about me. The only thing that’s different in my story is that my father did not stop me.”\n\nTo mark #IWD2022, @Malala and @zannymb discuss how to improve the lives of girls everywhere. \n\nSubscribers can sign up to watch here: https://t.co/Cg6G1x8syd https://t.co/Uzv8spLrau",
  "data/tweet-economist/2022/3/1499749023334420481.json": "Defence spending will now rise more rapidly and that 2% of GDP will become a de facto minimum across NATO, reckons Citigroup https://t.co/RZNLnuSSw2",
  "data/tweet-economist/2022/3/1499795476547354625.json": "NATO has rejected Ukraine’s demand for no-fly zones. What sounds like a humanitarian measure is also an act of war. We explain why https://t.co/RTEiXHbWz5",
  "data/tweet-economist/2022/3/1499791836684111886.json": "Russia may be using control of Ukraine’s nuclear power plants to “leverage terror over Europe”, says an energy lawyer formerly in Kyiv https://t.co/tpIeJnt2hl",
  "data/tweet-economist/2022/3/1499824795252371462.json": "From the start, Vladimir Putin has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1499817220989501443.json": "One nurse is caring for ten sick babies on her own. Her colleagues have either fled or can’t get to work. @1843mag steps inside Ukraine’s largest paediatric unit https://t.co/aOowcei5mt",
  "data/tweet-economist/2022/3/1499660172423270402.json": "The more powerful sanctions are, the greater the risk of collateral damage, particularly when targeted regimes are indifferent to the suffering of citizens https://t.co/frqTjb4LXM",
  "data/tweet-economist/2022/3/1499475232888963084.json": "France, and its influence over the EU, matters more than it has for a long time. The election is worth watching closely. To keep up with the race, bookmark our hub on the French election https://t.co/X8PZZxDEQU https://t.co/toe6T7ox3s",
  "data/tweet-economist/2022/3/1499835835436445696.json": "One nurse is caring for ten sick babies on her own. Her colleagues have either fled or can’t get to work. @1843mag steps inside Ukraine’s largest paediatric unit https://t.co/N4xcY9PdqU",
  "data/tweet-economist/2022/3/1499830554715373574.json": "Just one of six reactors at Zaporizhzhia nuclear plant is running at 60% capacity. Energy shortages have the potential to cause great suffering in Ukraine https://t.co/xKvixbrzuD",
  "data/tweet-economist/2022/3/1499837855710994433.json": "Kyiv looks likely to be encircled and then presumably besieged https://t.co/76sgGu3uE5",
  "data/tweet-economist/2022/3/1499823752766537730.json": "Since late last year, Lithuania has become the target of the most sweeping sanctions any country has faced for upsetting China’s Communist Party https://t.co/DyU9wI2MwL",
  "data/tweet-economist/2022/3/1499737597786177543.json": "It has been more than a week since Russia invaded Ukraine. We recap the war so far 👇 https://t.co/w89HmcBBzB https://t.co/oGVL6dgpjl",
  "data/tweet-economist/2022/3/1499838613374201856.json": "A Russian military convoy, no less than 60km long, has been moving at snail’s pace towards the capital. It epitomises Russia’s plodding approach to the war so far https://t.co/djkwGpno4r",
  "data/tweet-economist/2022/3/1499853210797944841.json": "The world must be willing to bleed Vladimir Putin’s regime of the resources that enable him to wage war and abuse his own people even if that imposes costs on Western economies https://t.co/6DZXuLTqyY",
  "data/tweet-economist/2022/3/1499770916242341889.json": "Russia may have tried to build a “fortress economy”, but it is the West that currently looks financially secure https://t.co/pfXWeTWn4J",
  "data/tweet-economist/2022/3/1499863001238753286.json": "A Russian military convoy, no less than 60km long, has been moving at snail’s pace towards the capital. It epitomises Russia’s plodding approach to the war so far. Read why ⬇️",
  "data/tweet-economist/2022/3/1499859832719003649.json": "“If you look at people who’ve been in power for as long as Putin has...going into an election is pretty slim—the chances are more like he gets toppled by a protest.” Russia expert Fiona Hill examines Vladimir Putin’s future, on “The Economist Asks” https://t.co/5QdorpMTxY https://t.co/uWTWr3QrWn",
  "data/tweet-economist/2022/3/1499868555256508417.json": "Vladimir Putin, so intent on bringing Ukraine under his control, is neglecting the problems facing Russians at home https://t.co/ZvGStFDhGf",
  "data/tweet-economist/2022/3/1499883164642295808.json": "Russia, one economist says, is sliding back into the dark post­-So­viet 1990s, the dismal period which Vladimir Putin says was forced on it by the West and from which he liberated it https://t.co/OgQKwiCe7i",
  "data/tweet-economist/2022/3/1499914612673851393.json": "Xi Jinping faces a dilemma. Though he does not want Vladimir Putin to fail, helping him means being spattered by his carnage https://t.co/C15FyLA9zt",
  "data/tweet-economist/2022/3/1499900273220898816.json": "The defence industry looks set for bigger business https://t.co/zToES4JBHO",
  "data/tweet-economist/2022/3/1499928963895934976.json": "He is committing war crimes in Ukraine. At home, he is subjecting his people to the harshest state terror since Stalin. And to the West, he is issuing threats of nuclear war. The world must stand up to him https://t.co/s3epgLN17g",
  "data/tweet-economist/2022/3/1499923157347676165.json": "Dozens of Nobel laureates voice “their support for the Ukrainian people and the free and independent state of Ukraine as it faces Russian aggression”  https://t.co/Iwa6H9p4IG",
  "data/tweet-economist/2022/3/1499917886353297414.json": "Ever since Donald Trump rose to the top of the Republican primaries in 2016, conservative talking-heads have praised the Russian leader’s vigour and acuity https://t.co/Rj0KNhUXVh",
  "data/tweet-economist/2022/3/1499915609177477122.json": "“The West never dared to question Vladimir Putin’s legitimacy out loud. Democracies die in silence, they say. In silence, too, dictatorships grow.” Lithuania’s prime minister @IngridaSimonyte explains why the invasion was “bound to happen” \n https://t.co/ZhfWs7ygtz",
  "data/tweet-economist/2022/3/1499928443827404803.json": "Watching a prolonged and bloody siege of Kyiv would further enrage public opin­ion in large parts of the world, and could thus lead to even harsher sanctions on Russia https://t.co/abqI8rjh3C",
  "data/tweet-economist/2022/3/1499929195459264514.json": "Western sanctions have created an economic storm. Many Russians will soon struggle to afford what they need to survive https://t.co/FyttKh2bTI",
  "data/tweet-economist/2022/3/1499932982966210562.json": "Venezuela’s government, far from trying to stop environmental plunder, is encouraging it https://t.co/Rc8s5sisyY",
  "data/tweet-economist/2022/3/1499943287561539588.json": "The fog of war remains thick. Russia may have chosen to slow down its movement in order to synchronise its various advances on Kyiv https://t.co/KQS42Et0rK",
  "data/tweet-economist/2022/3/1499977021010497537.json": "Viral videos of defiant Ukrainians have changed how many Taiwanese see their future selves. A slogan coursing through Taiwanese social media is “Ukraine today, Taiwan tomorrow!”  https://t.co/T8VCQG3NqP",
  "data/tweet-economist/2022/3/1499981799207976960.json": "In a country fast turning totalitarian, there is plenty of room for bravery. More than 1m people in Russia have signed a petition against the war https://t.co/oik3LlLdTO",
  "data/tweet-economist/2022/3/1499978282728673282.json": "Fox News is still airing pro-Putin commentary, and Donald Trump still praises the Russian leader https://t.co/xwI51i8P1t",
  "data/tweet-economist/2022/3/1499972234403799041.json": "The 23 short stories in “My Pen is the Wing of a Bird” were written by 18 Afghan women and translated from the original Dari and Pashto by other Afghans https://t.co/OZgGUAazKy",
  "data/tweet-economist/2022/3/1499998162911739905.json": "No major economy in the modern world has ever been hit so hard by sanctions https://t.co/nfzDfWRaFs",
  "data/tweet-economist/2022/3/1499993124927684609.json": "In recent years attitudes in Lithuania towards China have been hardening. China’s refusal to condemn Russia for invading Ukraine has not helped https://t.co/NcjkKQWSRP",
  "data/tweet-economist/2022/3/1499973739139809281.json": "Russian fuel, engineering and other supply units have struggled to keep up with frontline forces, leaving vehicles stranded on the road https://t.co/8NDsEQpMvn",
  "data/tweet-economist/2022/3/1499995647021363206.json": "“He’s been absolutely phenomenal in raising national morale. There’s admiration for what he’s done and is achieving.” General Sir Nick Carter assesses President Volodymyr Zelensky’s leadership during the war in Ukraine, on “The Economist Asks” https://t.co/gCQE25bmkH https://t.co/p2nbjNbjJU",
  "data/tweet-economist/2022/3/1500005454516211717.json": "The military difficulties the Russians are having may lead China to rethink the feasibility of an invasion across the Taiwan strait https://t.co/coCAfTtX03",
  "data/tweet-economist/2022/3/1500003948635340800.json": "The level of Ukrainian resistance has shocked Russian commanders https://t.co/qYAosq2Ns9",
  "data/tweet-economist/2022/3/1500006455516311554.json": "“It does not make me happy that countries in my region were right to warn others of the Russian threat,” writes Lithuania’s prime minister @IngridaSimonyte. “I wish we had been proven wrong instead”  https://t.co/163X2qZ9lW",
  "data/tweet-economist/2022/3/1500015515154198564.json": "The West’s measures have triggered chaos in Russia’s $1.6trn economy. This will cause alarm around the world, not least in China, which will recalculate the costs of a war over Taiwan https://t.co/TeBEUKiTJo",
  "data/tweet-economist/2022/3/1500013765311569922.json": "Nobel laureates have called upon the Russian government to stop its invasion of Ukraine and withdraw its military forces  https://t.co/mRukuP20II",
  "data/tweet-economist/2022/3/1499848167810027522.json": "Rome’s new mayor managed to locate tens of millions of unspent euros in the city’s accounts—money he spent on fixing the ravaged streets https://t.co/NxOAHSDKSV",
  "data/tweet-economist/2022/3/1500036831857065984.json": "“If there is anything in Russia you can be proud of right now, it is those people who have been detained,” Alexei Navalny, Russia’s jailed opposition leader, wrote in a statement https://t.co/6RmxdAgLEM",
  "data/tweet-economist/2022/3/1500033383082205187.json": "From the start, Vladimir Putin has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1500018357952782339.json": "Joe Biden and his foreign policy team should “take the credit for this impressive and united NATO response to Putin’s agressions”. Hear more from @JamesMAstill on our “Checks and Balance” podcast https://t.co/kBemLPAsbv https://t.co/1pczvCByUw",
  "data/tweet-economist/2022/3/1500040956728459266.json": "“If you start an operation on flawed assumptions, inevitably, your planning is inadequate—your command and control won’t work.” General Sir Nick Carter joins “The Economist Asks” to explain how Vladimir Putin’s invasion of Ukraine has not gone to plan https://t.co/cs9z41wW0o",
  "data/tweet-economist/2022/3/1500051506799824896.json": "This week's cartoon from KAL: https://t.co/ATHqTKQTeG https://t.co/R4Bx3Vv9M2",
  "data/tweet-economist/2022/3/1500026593703571457.json": "Germany may have no choice but to take on the big role the EU needs it to play https://t.co/jDI21Y0dD0",
  "data/tweet-economist/2022/3/1500055640215101441.json": "“As a child of the second world war, even in my nightmares I could not imagine Russian missiles aimed at Ukrainian towns and villages” Lev Dodin writes in an open letter https://t.co/hezfJKrdJk",
  "data/tweet-economist/2022/3/1500026848079659011.json": "Nuclear plants are designed to remain safe if hit by an aeroplane, or a terrorist attack. The reactors at Zaporizhzhia may start up again once it is safe to do so https://t.co/DAqXOpDPwx",
  "data/tweet-economist/2022/3/1500065104641024001.json": "More Russians are asking Google “how to leave Russia” than have done so in 18 years since such data became public https://t.co/E1LeH5t6yO",
  "data/tweet-economist/2022/3/1500064852571734017.json": "If he prevails in Ukraine today, his next fix will be in Georgia, Moldova or the Baltic states. He will not stop until he is stopped. The world must stand up to him https://t.co/cDsYyPuOXk",
  "data/tweet-economist/2022/3/1500067131588755458.json": "NATO has rejected Ukraine’s demand for no-fly zones. What sounds like a humanitarian measure is also an act of war. We explain why https://t.co/DT1yS8Ml8a",
  "data/tweet-economist/2022/3/1500079696398241796.json": "Video footage shows Ukrainian tractors gleefully towing away what are purported to be abandoned Russian air-defence systems and armoured vehicles https://t.co/h8fySBYPaM",
  "data/tweet-economist/2022/3/1500097317206208518.json": "After days of criticism, the British government has promised to crack down on “dirty money” and “corrupt elites” in light of Russia’s invasion of Ukraine https://t.co/i8cmClfHaa",
  "data/tweet-economist/2022/3/1500102609809686530.json": "From the start, he has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him https://t.co/myFZGgcfM1",
  "data/tweet-economist/2022/3/1500102605363687427.json": "Most Russians had no idea that their country was going to war until just before it did so, in part because the idea made no sense, in part because they were lied to https://t.co/ZKD5JGDO3p",
  "data/tweet-economist/2022/3/1499999405071646720.json": "“[Angela] Merkel deserves praise” for keeping the EU from falling apart, writes Wolfgang Ischinger, but she “failed to take advantage of the various crises and challenges confronting Europe to push Germany into a new role, and into a new era”  https://t.co/zB1xOkn6Xz",
  "data/tweet-economist/2022/3/1500109905587494917.json": "In some cases, Russian soldiers have even punched holes in their fuel tanks to avoid facing combat https://t.co/GL9OZR5Ekp",
  "data/tweet-economist/2022/3/1500102350006063106.json": "France is the eurozone’s second-biggest economy and the EU’s only serious military power. The outcome of the French election matters more than most https://t.co/ycsFBJViC4",
  "data/tweet-economist/2022/3/1500100849506390017.json": "A new fibre-optic cable beneath the Red Sea represents a diplomatic thaw between Israel and Saudi Arabia. The two will be connected for the first time https://t.co/DdaKhjAexn",
  "data/tweet-economist/2022/3/1500135816940687361.json": "He insists that the world back off while he sharpens his knife and sets about his slaughter. Other countries must stand up to him https://t.co/cMgICDn8aZ",
  "data/tweet-economist/2022/3/1500132295382028293.json": "The EU budget will be used to fund the purchase of weapons for the first time and Scandinavian countries have overcome their own pacifism to arm Ukraine https://t.co/nCEaCCMB5q",
  "data/tweet-economist/2022/3/1500103871221452803.json": "Many residents of Brighton Beach speak only Russian. Everyone seems to be against the invasion  https://t.co/0AAiiD0lcV",
  "data/tweet-economist/2022/3/1499920651456495618.json": "By far the largest single source of emissions is the family vehicle. One car of average fuel efficiency driven 14,000 miles (22,500km) spews out 7 tonnes of carbon https://t.co/LpPWQ0cnuj",
  "data/tweet-economist/2022/3/1500147895630278660.json": "The EU budget will be used to fund the purchase of weapons for the first time and Scandinavian countries have overcome their own pacifism to arm Ukraine https://t.co/4AVe9NrSLD",
  "data/tweet-economist/2022/3/1500147195848368128.json": "Vladimir Putin’s invasion of Ukraine has prompted an unprecedented response from the West: economic warfare. Can sanctions stop Russia? https://t.co/QtX9c8K3vK https://t.co/VwLBpQUdw4",
  "data/tweet-economist/2022/3/1499901546544381956.json": "If Europe is to shake off its reliance on Russian gas, sacrifices on cost and climate may be unavoidable https://t.co/Np6TkpK59b",
  "data/tweet-economist/2022/3/1500157462393020418.json": "Vladimir Putin is a “pathological liar”, writes Lithuania’s prime minister @IngridaSimonyte. The West was too delusional in its negotiations with him, and “Russian money smelled too good”  https://t.co/DScTXSg0XX",
  "data/tweet-economist/2022/3/1500162989315571712.json": "Ukrainian air defences have been persistent, but the Russians were also poorly prepared for the amount of resistence they have encountered https://t.co/CS95YcwMkY",
  "data/tweet-economist/2022/3/1500169272076619778.json": "Data from Google Trends shows that more Russians are asking “how to leave Russia” than have done so in 18 years since such data became public",
  "data/tweet-economist/2022/3/1500167833115893760.json": "“Ukrainians have a Russian-speaking president who has Jewish origins. When Russia’s president Vladimir Putin calls such people ‘Nazis’, he shows his own bigotry,” writes @yermolenko_v in a guest commentary for The Economist https://t.co/VhnyEWNZXr",
  "data/tweet-economist/2022/3/1500163253258932229.json": "The fear is that Russia will now resume its offensive, without regard for the safety of the hundreds of thousands of civilians still trapped https://t.co/sRRAXnlekF",
  "data/tweet-economist/2022/3/1500162240070180867.json": "Russia remains enmeshed in the supply chain of Western ideas and technologies, and remains dependent on foreign investors https://t.co/wPC0hv4CQs",
  "data/tweet-economist/2022/3/1500072643529170944.json": "A wooden plank was found in Holland dated to the winter of 42AD, just months before the Romans made Britain part of the empire https://t.co/0PJXaA17oj",
  "data/tweet-economist/2022/3/1500174826350203014.json": "Republican voters, who felt warmly towards Vladimir Putin under Donald Trump, have swung hard towards Ukraine https://t.co/zQpsTp5Es6",
  "data/tweet-economist/2022/3/1500096054586482694.json": "The war’s reverberations sound most strongly in Europe. The invasion has upended the idea of a continent “whole, free and at peace” https://t.co/438VQfomLO",
  "data/tweet-economist/2022/3/1500188198043009029.json": "The idea that Vladimir Putin would carry out his threat to use battlefield nuclear weapon is surely unlikely. Unfortunately, it is not impossible: he has just invaded his neighbour https://t.co/Xzb5IpeOCk",
  "data/tweet-economist/2022/3/1500201238666878984.json": "Russians—who have been queuing to take their money out of the banks—have been banned from leaving the country with more than $10,000 in cash https://t.co/9HMkkeFQfv",
  "data/tweet-economist/2022/3/1500194469659959299.json": "In Brighton Beach, New York’s “Russian” neighbourhood, residents call Vladimir Putin a devil, a madman and a would-be czar https://t.co/AVT45NPDWP",
  "data/tweet-economist/2022/3/1499898511785136130.json": "It was not by chance that London became the go-to destination for those who earned their cash in unorthodox ways. It was, and remains, the business model https://t.co/PEjgQjwLia",
  "data/tweet-economist/2022/3/1500187916903067651.json": "“When Vladimir Putin says that Ukrainians and Russians are the same people he is not just wrong,” says Volodymyr Yermolenko, a Ukrainian philosopher. “He is going beyond what Soviet propagandists claimed” https://t.co/iL3r9VhIvi",
  "data/tweet-economist/2022/3/1500064591442808832.json": "Anyone expecting Britain to clean up its act post-Londongrad is mistaken. Lack of enforcement is central to a lax attitude to funny money https://t.co/DQ26ldGQGq",
  "data/tweet-economist/2022/3/1500238991672725519.json": "The world must be willing to bleed Vladimir Putin’s regime of the resources that enable him to wage war and abuse his own people even if that imposes costs on Western economies https://t.co/zjSRu9ZmFO",
  "data/tweet-economist/2022/3/1500118966424977410.json": "The most potent financial sanctions have been aimed not at Russia’s commercial banks but at its central bank https://t.co/UP9t1BUmvx",
  "data/tweet-economist/2022/3/1500250318722023429.json": "The right’s Putin fandom was always more about posturing than substance. Its cheer-leaders were the ultranationalist, isolationist fringe that Donald Trump elevated https://t.co/fvs6jU4kVF",
  "data/tweet-economist/2022/3/1500255352209686536.json": "“This invasion will stain the international reputation of the Russian state for decades. Why raise this fence between Russia and the world now?”—Nobel laureates call on Russia to stop its invasion of Ukraine   https://t.co/jM9Et0pULw",
  "data/tweet-economist/2022/3/1500268931730313223.json": "Tweets from Ukraine’s defence ministry tell citizens which parts of a tank are most vulnerable to Molotov cocktails. Ordinary people risk their lives by standing in front of armoured vehicles https://t.co/j6BQk0YXwP",
  "data/tweet-economist/2022/3/1500239992953708547.json": "The more powerful sanctions are, the greater the risk of collateral damage, particularly when targeted regimes are indifferent to the suffering of citizens https://t.co/8qUiVgoRgW",
  "data/tweet-economist/2022/3/1500230431374987264.json": "Volunteers at Razom, a non-profit organisation, have raised $5m to help Ukraine and its refugees https://t.co/nJW0PHqy1U",
  "data/tweet-economist/2022/3/1500109400257835014.json": "More than 125,000 people of Ukrainian descent call New York City home. They came to America in four waves https://t.co/A8779w5yLy",
  "data/tweet-economist/2022/3/1500272904138805249.json": "Vladimir Putin has rattled his nuclear sabre three times in as many weeks. It seems likely he will behave in a similar way in conflicts and stand-offs to come https://t.co/7ZIs0P6KoN",
  "data/tweet-economist/2022/3/1500304541002121221.json": "“The West allowed [Vladimir] Putin’s people to keep their fortunes in Western banks and spend them on Western education for their kids”, as well as on “villas and penthouses in Western resorts,” writes Lithuania’s prime minister  https://t.co/Nasi7Cyipo",
  "data/tweet-economist/2022/3/1500300395737980930.json": "The sight of Russia’s central bank being hit so hard by sanctions no one expected will lead China to increase its efforts to establish the yuan as a reserve currency https://t.co/98UajDHVmf",
  "data/tweet-economist/2022/3/1500312734919012355.json": "“He’s gone from coercion...to punishment. I think he thinks, at this point now, if he can’t get Ukraine, he’s pretty much going to destroy it.” Foreign-affairs specialist Fiona Hill assesses Vladimir Putin’s motivations in Ukraine, on “The Economist Asks” https://t.co/UnOuRbZIAb https://t.co/292xPIbpBs",
  "data/tweet-economist/2022/3/1500320269835153408.json": "He is committing war crimes in Ukraine. At home, he is subjecting his people to the harshest state terror since Stalin. And to the West, he is issuing threats of nuclear war. The world must stand up to him https://t.co/SQPOu4l17w",
  "data/tweet-economist/2022/3/1500326758024990722.json": "Volodymyr Zelensky’s charisma and acting background have suited him perfectly to a war immersed in social media https://t.co/EIXyGGZOQ9",
  "data/tweet-economist/2022/3/1500339412248539137.json": "Even more emphatically than Vladimir Putin claims Ukraine, China’s rulers insist that Taiwan is part of the motherland and reserve the right to use force to compel its return https://t.co/fxWJ0wwavg",
  "data/tweet-economist/2022/3/1500354169592504324.json": "“It is important that the world understands one thing: Ukraine is resisting and will continue to do so,” writes Volodymyr Yermolenko, a Ukrainian philosopher https://t.co/oDZJCq1YmD",
  "data/tweet-economist/2022/3/1500367444422049795.json": "As Vladimir Putin harangues subordinates in gilded halls, Volodymyr Zelensky posts selfies with his team and urges his fellow citizens to be strong https://t.co/ku70kXiFmu",
  "data/tweet-economist/2022/3/1500344082228518913.json": "Sanctions can push countries they target into each other’s arms. Russia and China are enjoying their friendliest relations for decades https://t.co/HbzuVLmbJZ",
  "data/tweet-economist/2022/3/1500371500821532676.json": "Rome’s new mayor managed to locate tens of millions of unspent euros in the city’s accounts—money he spent on fixing the ravaged streets https://t.co/teTAHV2Ee1",
  "data/tweet-economist/2022/3/1500385410400362496.json": "Western sanctions have sent shockwaves across the Russian economy. Are they enough to stop Vladimir Putin? https://t.co/9hNgmPapVh https://t.co/FaD5aI76uK",
  "data/tweet-economist/2022/3/1500408785097183237.json": "“The crisis is not in Ukraine,” writes @IngridaSimonyte. “It is in Russia, and it has been deepening for decades. Russia’s aggression began long ago”  https://t.co/GngrLgjhPk",
  "data/tweet-economist/2022/3/1500403361954385922.json": "“If you look at people who’ve been in power for as long as Putin has...going into an election is pretty slim—the chances are more like he gets toppled by a protest.” Russia expert Fiona Hill examines Vladimir Putin’s future, on “The Economist Asks” https://t.co/MZnHsHV069 https://t.co/CWCEyAs4jr",
  "data/tweet-economist/2022/3/1500363279499243524.json": "Under Islam Karimov, Uzbekistan’s strongman president until his death in 2016, the country had one of the world’s largest state-orchestrated forced-labour systems https://t.co/36nvaUDn4c",
  "data/tweet-economist/2022/3/1500430669066944512.json": "If he prevails in Ukraine today, his next fix will be in Georgia, Moldova or the Baltic states. He will not stop until he is stopped. The world must stand up to him https://t.co/VB2TI5MeAp",
  "data/tweet-economist/2022/3/1500441061604220931.json": "From the start, Vladimir Putin has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1500404081491337219.json": "Vladimir Putin’s horrific war in Ukraine has exposed the contradictions of some of Emmanuel Macron’s chief opponents: Eric Zemmour, a far-right polemicist, Marine Le Pen, and Jean-Luc Mélenchon, a hard-left firebrand  https://t.co/jATI8vNVq6",
  "data/tweet-economist/2022/3/1500278518944567297.json": "In Moscow, diplomats often suffer harassment and break­-ins by Russian security services. But China generally dislikes being seen as a rogue state https://t.co/fyKA9dtTOe",
  "data/tweet-economist/2022/3/1500450130796978176.json": "Vladimir Putin is wrecking two countries https://t.co/1oVqDWduIF",
  "data/tweet-economist/2022/3/1500297134129754117.json": "Researchers for one paper analysed nearly 800 almost-complete viral genomes from samples taken before February 14th 2020 to identify the most likely evolutionary paths taken by the virus https://t.co/Y4dU8l6TSA",
  "data/tweet-economist/2022/3/1500456160943644676.json": "Russia’s financial woes are not yet as severe as in 1998, when the rouble plunged by 70%",
  "data/tweet-economist/2022/3/1500441109687902221.json": "“The mission of art and culture has always been, especially after all the horrors of the 20th century, to teach people to perceive other people’s pain as their own,” Lev Dodin writes. “To understand that no idea...is worth a human life” https://t.co/1edtGbCR4y",
  "data/tweet-economist/2022/3/1500458710103113728.json": "The war has started consolidating Europe’s belief in itself and its ideals, and may increase its willingness to fight for them https://t.co/p4sAAIx068",
  "data/tweet-economist/2022/3/1500458708089847808.json": "Vladimir Putin and Xi Jinping share a desire to undercut America as a global leader as well as a horror at what happened to the Soviet Union in 1991 https://t.co/cJa5wrmuFu",
  "data/tweet-economist/2022/3/1500431745329553412.json": "RT @Sondreus: More Russians are asking Google “how to leave Russia” than have done so in the last 18 years since such data became public. W…",
  "data/tweet-economist/2022/3/1500192688460734472.json": "In French eyes, the war in Ukraine exposes the need for Europe to reinforce its strategic capacity. Meanwhile three of Emmanuel Macron’s rivals want to pull France out of NATO’s integrated military command https://t.co/iZdBphmYMc",
  "data/tweet-economist/2022/3/1500486089420812306.json": "Shakespeare knew that a dishonest war, waged for territory and self-aggrandisement, is just murder in uniform https://t.co/DiBV8l6OSg",
  "data/tweet-economist/2022/3/1500177829560041476.json": "The evacuation lasted all of 45 minutes. It was cancelled after the resumption of shelling in and around Mariupol https://t.co/3eEO0rtgQU",
  "data/tweet-economist/2022/3/1500512304122802179.json": "“We respect the calm and the strength of the Ukrainian people. We are with you”—Nobel laureates’ open letter in support of Ukraine  https://t.co/NnJaefrd3h",
  "data/tweet-economist/2022/3/1500507265740251137.json": "“If the goal of the West’s economic war is to end [Vladimir] Putin’s war of aggression in Ukraine, then historical experience suggests different measures will be needed,” argues Nicholas Mulder, an assistant history professor who studies sanctions https://t.co/RAlKmucuij",
  "data/tweet-economist/2022/3/1500516649845379074.json": "“He’s been absolutely phenomenal in raising national morale. There’s admiration for what he’s done and is achieving.” General Sir Nick Carter assesses President Volodymyr Zelensky’s leadership during the war in Ukraine, on “The Economist Asks” https://t.co/tjVn70ZQzT https://t.co/iLHPNiBMZs",
  "data/tweet-economist/2022/3/1500518344411209735.json": "From the start, he has made clear that this is a war of escalation. He threatens to be more destructive even if that means resorting to a nuclear weapon. The world must stand up to him https://t.co/nGIovkaKWK",
  "data/tweet-economist/2022/3/1500475273476771842.json": "Europe is grinding through gears it did not know it had. Later it will ask itself where it went wrong, what mistakes landed Europe in the terrible crisis that is suddenly changing everything https://t.co/kYzPxu5MYa",
  "data/tweet-economist/2022/3/1500524636324470792.json": "Russia always assumed that it would be able to access foreign exchange to defend the rouble. Being shut out of the SWIFT financial-transfer system will hurt trade. The question is whether Vladimir Putin cares https://t.co/DpQq9w4fkx",
  "data/tweet-economist/2022/3/1500538978986074116.json": "Joe Biden and his foreign policy team should “take the credit for this impressive and united NATO response to Putin’s agressions”. Hear more from @JamesMAstill on our “Checks and Balance” podcast https://t.co/j8geYqtYJe https://t.co/kKe1w8C516",
  "data/tweet-economist/2022/3/1500530172113694721.json": "Ukraine has “an incredible spirit of independence”, says @yermolenko_v.  “This spirit has been there for centuries but is showing itself now in full strength. Freedom is the key trait of Ukraine’s identity as a political nation” https://t.co/6InsLy4IIt",
  "data/tweet-economist/2022/3/1500567669011013636.json": "After a prolonged isolationist funk, Republicans have rejoined the internationalist mainstream on this issue. And in doing so they have turned from Donald Trump https://t.co/sCIgYdvNf5",
  "data/tweet-economist/2022/3/1500571171091365888.json": "Kyiv looks likely to be encircled and then presumably besieged https://t.co/FmnYnUqCcC",
  "data/tweet-economist/2022/3/1500549302237728778.json": "China and Russia have undoubtedly been moving closer together both strategically and, as Vladimir Putin pushes Russia deeper into dictatorship, politically https://t.co/reKMOdOZZ7",
  "data/tweet-economist/2022/3/1500578727415144449.json": "He insists that the world back off while he sharpens his knife and sets about his slaughter. Other countries must stand up to him https://t.co/9dKM5oV1IA",
  "data/tweet-economist/2022/3/1500598110631997444.json": "Each time we took something away from the design, it became stronger. All that was left was the suffering https://t.co/pgPHEUTBCg",
  "data/tweet-economist/2022/3/1500542250962595842.json": "The most obvious way to inflict more economic pain would be to target Russia’s oil and gas exports. But the costs that would impose on Europe make sanctions a double-edged sword https://t.co/lcfjtU4mPK",
  "data/tweet-economist/2022/3/1500376434493300743.json": "Last year almost half of all those killed by terrorists globally were in sub-Saharan Africa, according to the Global Terrorism Index https://t.co/QsGNFamDvs",
  "data/tweet-economist/2022/3/1500524363757543426.json": "British people appear to want extremely harsh asylum rules by default, but generous exceptions for groups that have captured their sympathy https://t.co/Ilya46W2TU",
  "data/tweet-economist/2022/3/1500610683586678785.json": "“Western politicians danced with Vladimir Putin (some of them literally) and retired to chair the boards of Russian companies,” writes Ingrida Simonyte. “These firms funded the Kremlin’s arms race and diverted billions to Mr Putin’s entourage”  https://t.co/cVlaJfur2S",
  "data/tweet-economist/2022/3/1500607216981839872.json": "“If you start an operation on flawed assumptions, inevitably, your planning is inadequate—your command and control won’t work.” General Sir Nick Carter joins “The Economist Asks” to explain how Vladimir Putin’s invasion of Ukraine has not gone to plan https://t.co/hsMxdYAwAP",
  "data/tweet-economist/2022/3/1500631578011226118.json": "Russia, one economist says, is sliding back into the dark post­-So­viet 1990s, the dismal period which Vladimir Putin says was forced on it by the West and from which he liberated it https://t.co/gJqDGoVa4F",
  "data/tweet-economist/2022/3/1500623329568436232.json": "The idea that Vladimir Putin would carry out his threat to use battlefield nuclear weapon is surely unlikely. Unfortunately, it is not impossible: he has just invaded his neighbour https://t.co/t3r6lAIw5O",
  "data/tweet-economist/2022/3/1500398674073079808.json": "Any Russian economic response to sanctions must be met by more damaging measures by the West that make that act of retaliation irrational https://t.co/VHj0nrxPa5",
  "data/tweet-economist/2022/3/1500639882724753409.json": "American officials think the relationship between Russia and China will allow them to fuse their alliances in Europe and Asia into a stronger whole https://t.co/gjk9GaKFXT",
  "data/tweet-economist/2022/3/1500598365565947905.json": "Cults have hierarchical structures, their own jargon and are stuffed with weirdos. Sound familiar? https://t.co/XamuoK5hse",
  "data/tweet-economist/2022/3/1500675126727262211.json": "“Any messenger bringing bad information would certainly be facing the ‘shoot-the-messenger’ principle.” Foreign-affairs specialist Fiona Hill describes Vladimir Putin’s silencing of opposition within his inner circle, on “The Economist Asks” podcast https://t.co/rG9unuH1Sk",
  "data/tweet-economist/2022/3/1500688682440876032.json": "Watching a prolonged and bloody siege of Kyiv would further enrage public opin­ion in large parts of the world, and could thus lead to even harsher sanctions on Russia https://t.co/bd1pxQmsrl",
  "data/tweet-economist/2022/3/1500680597035012096.json": "There is a world of difference between diplomatic and logistical support for Ukraine and outright combat with Russia https://t.co/GY93JSrWaC",
  "data/tweet-economist/2022/3/1500595848635375629.json": "The closer you look, the clearer it is that a no-fly zone would not only fail to bring about the defeat of Vladimir Putin's armies, but would also court catastrophe https://t.co/QXMRYhyVnW",
  "data/tweet-economist/2022/3/1500705824590680067.json": "Russia faces a deep recession. But rather than relent, Vladimir Putin may double down on his attempts to cut the country off from the outside world https://t.co/8dOAIOvIA8",
  "data/tweet-economist/2022/3/1500695007744962560.json": "The West has deployed an economic weapon that was until recently unthinkable. It must be used wisely https://t.co/4zlShQ2Qun",
  "data/tweet-economist/2022/3/1500728277480185859.json": "The world must be willing to bleed Vladimir Putin’s regime of the resources that enable him to wage war and abuse his own people even if that imposes costs on Western economies https://t.co/EkCvY3QilB",
  "data/tweet-economist/2022/3/1500723433168162816.json": "No major economy in the modern world has ever been hit so hard by sanctions https://t.co/E78v6VXx2f",
  "data/tweet-economist/2022/3/1500730733576527873.json": "Xi Jinping faces a dilemma. Though he does not want Vladimir Putin to fail, helping him means being spattered by his carnage https://t.co/CNPn7zq08z",
  "data/tweet-economist/2022/3/1500737023732297729.json": "Europe is going through a watershed moment  https://t.co/sI7qgkwaeM",
  "data/tweet-economist/2022/3/1500488856239550464.json": "How do Western countries hope to influence Russia’s behaviour by wielding sanctions against its economy? https://t.co/NytCWKrPDt https://t.co/urHdrQz0PU",
  "data/tweet-economist/2022/3/1500734256938631168.json": "From war photography to the Ukrainian flag, we walk you through how we chose this week’s cover image https://t.co/rIEDW4sHEu",
  "data/tweet-economist/2022/3/1500791503895080969.json": "The military difficulties the Russians are having may lead China to rethink the feasibility of an invasion across the Taiwan strait https://t.co/rGcA1aE6ao",
  "data/tweet-economist/2022/3/1500778065240240129.json": "“There's nothing special about me. The only thing that’s different in my story is that my father did not stop me.”\n\nTo mark #IWD2022, @Malala and @zannymb discuss how to improve the lives of girls everywhere. \n\nSubscribers can sign up to watch here: https://t.co/Cg6G1x8syd https://t.co/S6leRxz0Jo",
  "data/tweet-economist/2022/3/1500788601759617025.json": "Vladimir Putin’s invasion of Ukraine is driving its people to the country’s western borders. So far the majority have headed to Poland, which is opening its arms to the newcomers https://t.co/BD872Lub60 https://t.co/yCy3fKLxKI",
  "data/tweet-economist/2022/3/1500490977487822848.json": "“Everywhere that women start to get educated and start to get options the age of marriage goes up,” says Stephanie Coontz, an author on the subject https://t.co/e0eHaxHNpW",
  "data/tweet-economist/2022/3/1500811024940912643.json": "“He’s gone from coercion...to punishment. I think he thinks, at this point now, if he can’t get Ukraine, he’s pretty much going to destroy it.” Foreign-affairs specialist Fiona Hill assesses Vladimir Putin’s motivations in Ukraine, on “The Economist Asks” https://t.co/IsWOwImgLS https://t.co/B3xFzxBxpw",
  "data/tweet-economist/2022/3/1500800187324895239.json": "NATO can and should do more to support Ukraine. But imposing a no-fly zone would be wrong-headed  https://t.co/HJ1wgnBHfp",
  "data/tweet-economist/2022/3/1500421195484831745.json": "The sanctions sword is double-edged: it encourages those who fear them to develop alternative financial and technological infrastructures https://t.co/DheAeGs1qB",
  "data/tweet-economist/2022/3/1500847713520336897.json": "Vladimir Putin claims that his “special military operation” is going “to plan”. It isn't. Why won't Russia leave its neighbour alone?\n\nRead our latest analysis on the invasion: https://t.co/Ku48sueqh2 https://t.co/AKN9hFx2Jk",
  "data/tweet-economist/2022/3/1500795836892172295.json": "Russia’s financial woes are not yet as severe as in 1998, when the rouble plunged by 70%. But another debt default could be similarly devastating https://t.co/lfcPUBpyp0",
  "data/tweet-economist/2022/3/1500864809193164801.json": "A Russian military convoy, no less than 60km long, has been moving at snail’s pace towards Kyiv thanks to botched logistics and fierce Ukrainian resistance. \n\nBut read why the respite could be temporary ⬇️",
  "data/tweet-economist/2022/3/1500889129042776070.json": "The level of Ukrainian resistance has shocked Russian commanders https://t.co/puWt2bUtr0",
  "data/tweet-economist/2022/3/1500891799946207233.json": "A huge Russian military convoy has stalled outside Kyiv. We explain why 👇https://t.co/CF1Lj5c8yF",
  "data/tweet-economist/2022/3/1500887318219083779.json": "A Russian military convoy, no less than 60km long, has been moving at snail’s pace towards Ukraine’s capital https://t.co/0rcgW2Yqhi https://t.co/lDNC8KukFQ",
  "data/tweet-economist/2022/3/1500908843412299779.json": "“There's nothing special about me. The only thing that’s different in my story is that my father did not stop me.”\n\nTo mark #IWD2022, @Malala and @zannymb discuss how to improve the lives of girls everywhere. \n\nSubscribers can watch here: https://t.co/Xavks1mHcg https://t.co/Gpg94dQJVA",
  "data/tweet-economist/2022/3/1500913479770943491.json": "One nurse is caring for ten sick babies on her own. Her colleagues have either fled or can’t get to work. @1843mag steps inside Ukraine’s largest paediatric unit https://t.co/oGMgLqn630",
  "data/tweet-economist/2022/3/1500931080664326147.json": "Poland is fast becoming the lynchpin of the Western effort to defend Ukraine and deter Russia https://t.co/BuM8zIV1nk",
  "data/tweet-economist/2022/3/1500940521396707332.json": "If he prevails in Ukraine today, his next fix will be in Georgia, Moldova or the Baltic states. He will not stop until he is stopped. The world must stand up to him https://t.co/wd2vgNWgJv",
  "data/tweet-economist/2022/3/1500884559507902465.json": "Normally one nurse looks after each baby who is critically ill. Maryna is caring for ten sick babies on her own. Stories from a Kyiv hospital by @timjudah1 and @ronhaviv https://t.co/7OlwmrY563",
  "data/tweet-economist/2022/3/1500918232324128769.json": "The Venezuelan president’s regime is cash-strapped and corrupt. From the Amazon to the Caribbean, he has allowed an unrestrained scramble for minerals https://t.co/RUxP5AR2dI",
  "data/tweet-economist/2022/3/1500970144851443714.json": "Fox News is still airing pro-Putin commentary, and Donald Trump still praises the Russian leader https://t.co/gqUv3mhX7K",
  "data/tweet-economist/2022/3/1500965284227788807.json": "“If all the activists leave, only the apathetic will be left.\" Meet one of the young Russians standing their ground against Putin” https://t.co/pf9XNCdjIM",
  "data/tweet-economist/2022/3/1500955031402692612.json": "Were Kyiv to fall to the Russians, which is still far from guaranteed, Ukrainian troops and volunteers would most likely regroup in the west of the country. This would further raise Poland’s importance for Ukraine https://t.co/desmf0WwFa",
  "data/tweet-economist/2022/3/1500756918897418240.json": "“When Vladimir Putin says that Ukrainians and Russians are the same people he is not just wrong,” says Volodymyr Yermolenko, a Ukrainian philosopher. “He is going beyond what Soviet propagandists claimed” https://t.co/0KKJ6bUfN9",
  "data/tweet-economist/2022/3/1500955973627826180.json": "The mercenaries, who have also reportedly fought in both northern and sub-Saharan Africa, have been accused of torture, rape and extrajudicial killings https://t.co/vwCwqbz7CZ",
  "data/tweet-economist/2022/3/1500998892078473221.json": "The war, and Poland’s impressive handling of its refugees, offer the country a chance to patch things up with its Western allies https://t.co/A4HUlkYdKK",
  "data/tweet-economist/2022/3/1501020295469150213.json": "He has carried himself with dignity, strength and a dash of humour https://t.co/IopIKuiAaK",
  "data/tweet-economist/2022/3/1501037555487318026.json": "“He’s been absolutely phenomenal in raising national morale. There’s admiration for what he’s done and is achieving.” General Sir Nick Carter assesses President Volodymyr Zelensky’s leadership during the war in Ukraine, on “The Economist Asks” https://t.co/8C477YdvGd https://t.co/qXTriU6UsA",
  "data/tweet-economist/2022/3/1501047848821006340.json": "Using mercenaries instead of its own troops allows Russia to downplay its casualties. It also removes a layer of accountability https://t.co/PU6CH86Op7",
  "data/tweet-economist/2022/3/1501065245074366464.json": "The level of Ukrainian resistance has shocked Russian commanders https://t.co/WjPkuQGVub",
  "data/tweet-economist/2022/3/1501069511205785600.json": "The longer the war lasts, the more desperate Russia will be to destroy outside supply lines to Ukraine. Russian cyberattacks in Poland could be a concern https://t.co/MAf7ZNb8Cf",
  "data/tweet-economist/2022/3/1501082826292224000.json": "“If you start an operation on flawed assumptions, inevitably, your planning is inadequate—your command and control won’t work.” General Sir Nick Carter joins “The Economist Asks” to explain how Vladimir Putin’s invasion of Ukraine has not gone to plan https://t.co/Qjs5DADAVv",
  "data/tweet-economist/2022/3/1501107813426380801.json": "If he prevails in Ukraine today, his next fix will be in Georgia, Moldova or the Baltic states. He will not stop until he is stopped. The world must stand up to him https://t.co/FZFDOyz750",
  "data/tweet-economist/2022/3/1501091069097820162.json": "Since Vladimir Putin began massing forces on Ukraine’s border, the rouble has lost 33% of its value against the dollar https://t.co/7h7XhzxSxR",
  "data/tweet-economist/2022/3/1501103866573688840.json": "One nurse is caring for ten sick babies on her own. Her colleagues have either fled or can’t get to work. @1843mag steps inside Ukraine’s largest paediatric unit https://t.co/dUmSKgBzmM",
  "data/tweet-economist/2022/3/1501125536394977281.json": "Lithuania sees threats from two big powers: Russia and China https://t.co/0xGKswsFQF",
  "data/tweet-economist/2022/3/1501090342791172102.json": "“Despite the odds, we are trying our best. Will you?”\n\n@Malala’s series on girls’ education for The Economist is free to read for a limited time. Discover more here #IWD2022 ⬇️",
  "data/tweet-economist/2022/3/1501142341259825152.json": "“When young women speak up, we’re brave. When we succeed, we’re inspiring. Yet our voices, though louder and more lauded than ever, remain sidelined.”\n\nOn #IWD2022, read @Malala’s guest essay for The Economist  👇 https://t.co/26tipgArfd https://t.co/iPV1YxRQrA",
  "data/tweet-economist/2022/3/1501157249980510212.json": "“When young women speak up, we’re brave. When we succeed, we’re inspiring. Yet our voices, though louder and more lauded than ever, remain sidelined.”\n\nOn #IWD2022, read @Malala’s guest essay for The Economist  👇 \nhttps://t.co/H7hununIf4",
  "data/tweet-economist/2022/3/1501086995942154240.json": "Odessa’s heroic struggle against Nazi barbarism—the city lived through a siege, occupation and the mass murder of its Jews—has become a galvanising memory https://t.co/o4z5ap4eH9",
  "data/tweet-economist/2022/3/1501161498097463297.json": "For Poland and NATO, the only risk bigger than that of Russian retaliation is the risk of Western inaction https://t.co/wMxOADYql5",
  "data/tweet-economist/2022/3/1501178540716441605.json": "Poland will play an outsized role in Western efforts to assist Ukraine https://t.co/vtPhhu4cY7",
  "data/tweet-economist/2022/3/1501172646456832003.json": "A huge Russian military convoy has stalled outside Kyiv. We explain why 👇 https://t.co/g2lxWQNnZI",
  "data/tweet-economist/2022/3/1501206534575034370.json": "He has carried himself with dignity, strength and a dash of humour https://t.co/lNOUxuxkFo",
  "data/tweet-economist/2022/3/1501199139148861443.json": "Four Nordic countries—Sweden, Iceland, Finland and Norway—top the glass-ceiling index as the best places for working women. \n\nRead our annual measure of the role and influence of women in the workforce 👇",
  "data/tweet-economist/2022/3/1501210645177450503.json": ".@Malala introduces her guest series on girls’ education, which is free to read for a limited time #IWD2022 https://t.co/9U26yB46JA",
  "data/tweet-economist/2022/3/1501233912361725955.json": "RT @Malala: In honour of #IWD2022, I worked with @TheEconomist to invite four women to each contribute a guest essay on four issues deeply…",
  "data/tweet-economist/2022/3/1501179441514528769.json": "“My generation is passionate about protecting our planet, but many of us aren’t equipped with adequate knowledge or skills to handle the problems we’ll soon inherit.” @vanessa_vash explains why “gender-equal climate education” is part of the solution https://t.co/1v87PTPRUr",
  "data/tweet-economist/2022/3/1501177041391132681.json": "“When young women speak up, we’re brave. When we succeed, we’re inspiring. Yet our voices, though louder and more lauded than ever, remain sidelined.”\n\nOn #IWD2022, read @Malala’s guest essay for The Economist  👇https://t.co/H7hununIf4",
  "data/tweet-economist/2022/3/1501144234958667777.json": "“Despite the odds, we are trying our best. Will you?” On #IWD2022, discover @Malala’s guest series on girls’ education, which is free to read for a limited time https://t.co/Ga0jghxan0",
  "data/tweet-economist/2022/3/1501120883477331969.json": "KAL’s cartoon https://t.co/f8SjChaWvG",
  "data/tweet-economist/2022/3/1501268395244859395.json": "The last letter of the Latin alphabet has become the symbol of support for Russia’s war in Ukraine. Why? https://t.co/zczstogTyh https://t.co/tz11P6lOK1",
  "data/tweet-economist/2022/3/1501248883984416777.json": "Four Nordic countries—Sweden, Iceland, Finland and Norway—top the glass-ceiling index as the best places for working women. \n\nRead our annual measure of the role and influence of women in the workforce 👇",
  "data/tweet-economist/2022/3/1501304777824690180.json": "Many liberal or middle-class citizens have been leaving Russia. The exodus of its brightest is probably the fastest in the country’s history https://t.co/p2WP27AwFd",
  "data/tweet-economist/2022/3/1501301244136243200.json": "“Young women know all too well how the world fails them”. In a guest essay for The Economist, @Malala argues that leaders “must find a way to ensure every girl can complete 12 years of free, safe and quality education” #IWD2022  https://t.co/HBue5NF1R7",
  "data/tweet-economist/2022/3/1501202101984284673.json": "“Realising every girl’s right to education is vital to the future of Afghanistan,” writes @FreshtaKarim. The international community must do more to secure the future of Afghanistan’s women, says the children’s rights activist #IWD2022  https://t.co/p52FqcNiU2",
  "data/tweet-economist/2022/3/1501320497333739523.json": "Russia is now in its fourth financial crisis in 25 years https://t.co/o6cdJnHDf2",
  "data/tweet-economist/2022/3/1501240847987261440.json": "“Nearly 130m girls are out of school, and I fear we are moving further away from a solution.” @Malala brings attention to the “emergency” facing girls’ education, and explains how to solve it #IWD2022 https://t.co/MfyA0bo2GT",
  "data/tweet-economist/2022/3/1501274165474697240.json": "These granddads are defending Ukraine against Russia’s mighty army https://t.co/70eOvtDtPv",
  "data/tweet-economist/2022/3/1501295687908179968.json": "This year’s International Women’s Day is marked by thousands fleeing war in Ukraine.\n\nThe Economist’s editor-in-chief, Zanny Minton Beddoes, meets @Malala to discuss what world leaders can do to protect girls’ education in times of conflict.\n\nRead more: https://t.co/J3h3Cd05n5 https://t.co/d5SQGJCdot",
  "data/tweet-economist/2022/3/1501184007681228802.json": "Ukraine’s largest paediatric unit is reeling from the Russian invasion. Yet to a surprising extent it is still working, as these photos show https://t.co/iAGQrelQ1Z",
  "data/tweet-economist/2022/3/1501325226340229126.json": "There is a particular irony to making a Latin letter the symbol of a war that Vladimir Putin has justified in part by spurious claims that the Russian language was under threat in Ukraine https://t.co/8ij8S5qSfk",
  "data/tweet-economist/2022/3/1501346810576654339.json": "“Stop filming us! The Russians will know where to bomb us! You’ll get us all killed!” Tension is running high in Kyiv. @FrancescaEbel and @IKoshiw report for @1843mag https://t.co/0h53T8YorW",
  "data/tweet-economist/2022/3/1501408465432072194.json": "Ukraine has changed how Taiwanese see themselves https://t.co/Fe2yb73MZd",
  "data/tweet-economist/2022/3/1501427097109159937.json": "Vladimir Putin is an imperialist, but China does not care https://t.co/DiCZaC3uGc",
  "data/tweet-economist/2022/3/1501365689688465410.json": "“Educating a girl will provide her with a brighter future. Empowering young women will provide us all with a lifeline.” @vanessa_vash explains how education can help tackle the climate crisis #IWD2022 https://t.co/AJQjKA51JR",
  "data/tweet-economist/2022/3/1501450364016631809.json": "Russia’s financial woes are not yet as severe as in 1998, when the rouble plunged by 70%. But another debt default could be similarly devastating https://t.co/lK5diqVqeE",
  "data/tweet-economist/2022/3/1501422548373880833.json": "“He’s gone from coercion...to punishment. I think he thinks, at this point now, if he can’t get Ukraine, he’s pretty much going to destroy it.” Foreign-affairs specialist Fiona Hill assesses Vladimir Putin’s motivations in Ukraine, on “The Economist Asks” https://t.co/9Xja5UrjnM https://t.co/8E7AfefOC3",
  "data/tweet-economist/2022/3/1501412498389536769.json": "Vladimir Putin has imposed military-style censorship without formally declaring a state of emergency https://t.co/2A59S9nW0W",
  "data/tweet-economist/2022/3/1501481953324904451.json": "RT @shashj: We look at why Russia's air force has played more limited role than expected (though perhaps now growing). Air activity hard to…",
  "data/tweet-economist/2022/3/1501431921078935552.json": "The Z has never been associated with Vladimir Putin’s regime before, and has none of the long-cultivated symbolism of other notorious icons https://t.co/B3KR1tO3XW",
  "data/tweet-economist/2022/3/1501464513740255232.json": "“Young Afghans are not going to be able to help create a future that is peaceful, democratic and sustainable without quality education.” Read @Malala’s guest essay for The Economist  https://t.co/LyfTkWjyiW",
  "data/tweet-economist/2022/3/1501292691908448258.json": "Since the fighting began, Russia’s state propaganda machine has turned the letter Z into the operation’s unofficial logo https://t.co/AvGapEyfuO",
  "data/tweet-economist/2022/3/1501499479396077568.json": "Ukraine has a glorious cuisine that is all its own https://t.co/o25nRRzZal",
  "data/tweet-economist/2022/3/1501381761292505096.json": "“When young women speak up, we’re brave. When we succeed, we’re inspiring. Yet our voices, though louder and more lauded than ever, remain sidelined”. On #IWD2022, read @Malala’s guest essay for The Economist  https://t.co/nJRu7zy06b",
  "data/tweet-economist/2022/3/1501549001409245192.json": "But the truth is breaking through https://t.co/pqEdb9le6r",
  "data/tweet-economist/2022/3/1501526819018846213.json": "“I don’t want my children to suffer like those in the Donetsk and Luhansk regions.” Ukraine’s grandads are preparing to defend their country https://t.co/Lp795HFB6e",
  "data/tweet-economist/2022/3/1501353130423816193.json": "On #IWD2022, discover @Malala’s guest series on girls’ education with essays from Freshta Karim, Kiara Nirghin, Tigidankay “TK” Saccoh and Vanessa Nakate. These are free to read for a limited time https://t.co/jirmyz6Dnd",
  "data/tweet-economist/2022/3/1501602484179156995.json": "When asked to choose sides, India sits on the fence. To some, it seems that Narendra Modi favours Russia https://t.co/lpauKPnuC0",
  "data/tweet-economist/2022/3/1501522092839292929.json": "A law passed on March 4th bans dissemination of any information about the war other than the official version, and threatens a prison sentence of up to 15 years for those who flout it https://t.co/02pG1erzcS",
  "data/tweet-economist/2022/3/1501578341064876037.json": "Costly wheat will blow up budgets in the Middle East, perhaps forcing subsidy cuts that leave citizens hungry https://t.co/dLjSHr28ss",
  "data/tweet-economist/2022/3/1501585616265482251.json": "Air strikes on Ukraine may have increased in both number and complexity in recent days, but it is clear the Russian air force has held back its full capabilities https://t.co/bRyUp2c6SC",
  "data/tweet-economist/2022/3/1501639944900689922.json": "Wedding day for two Moscow activists: they exchanged their vows, then joined the first protest against the war in Ukraine. From @1843mag https://t.co/w7mCOGFIRz",
  "data/tweet-economist/2022/3/1501645193283518464.json": "Vladimir Putin claims Russia is not conducting a war, but a nearly bloodless military operation to free its Ukrainian brothers. But the truth is breaking through https://t.co/IskfsqvxsT",
  "data/tweet-economist/2022/3/1501608599222632456.json": "Shakespeare knew that a dishonest war, waged for territory and self-aggrandisement, is just murder in uniform https://t.co/J85U91Mt2q",
  "data/tweet-economist/2022/3/1501688272984154112.json": "To Taiwanese people, the parallels between what Vladimir Putin is doing to Ukraine and what Xi Jinping might do to Taiwan are glaring https://t.co/ELAL1rX3Lq",
  "data/tweet-economist/2022/3/1501683070310699012.json": "She was a star chemistry student; he was a classical violinist. Now they’re activists in Moscow, protesting against Vladimir Putin’s war  https://t.co/ASwr0Vb2y6",
  "data/tweet-economist/2022/3/1501539549436166147.json": "Vladimir Putin has spent years preparing for a financial stand-off with the West. Since 2015 the value of Russia’s central-bank reserves has risen by 71% https://t.co/mN9eqbSvcT",
  "data/tweet-economist/2022/3/1501544353931698178.json": "Four Nordic countries—Sweden, Iceland, Finland and Norway—top our index as the best places for working women, as they have done consistently for the past five years https://t.co/8DpI2WUr1U",
  "data/tweet-economist/2022/3/1501710946963763204.json": "Vladimir Putin is wrecking two countries https://t.co/OG9k5lNV7u",
  "data/tweet-economist/2022/3/1501702653583233028.json": "“Ukrainians have a Russian-speaking president who has Jewish origins. When Russia’s president Vladimir Putin calls such people ‘Nazis’, he shows his own bigotry,” writes @yermolenko_v in a guest commentary for The Economist https://t.co/g3D2LjvznA",
  "data/tweet-economist/2022/3/1501672251409764356.json": "The level of Ukrainian resistance has shocked Russian commanders https://t.co/zURKJahbMt",
  "data/tweet-economist/2022/3/1501714493977640961.json": "Also known as “vacuum bombs”, they are fearsomely destructive when used indiscriminately  https://t.co/zebbDYmqYT",
  "data/tweet-economist/2022/3/1501771833657409548.json": "There is no evidence of Vladimir Putin’s soldiers being welcomed anywhere. The invading Russians appear ill-prepared for this https://t.co/EWmdgkjLgV",
  "data/tweet-economist/2022/3/1501743159600107530.json": "In the past two years the number of people who are acutely food-insecure has nearly doubled from 150m to 283m https://t.co/zuYOJ4iWqv",
  "data/tweet-economist/2022/3/1501726042347683853.json": "The Z has never been associated with Vladimir Putin’s regime before, and has none of the long-cultivated symbolism of other notorious icons https://t.co/k9moTblBJC",
  "data/tweet-economist/2022/3/1501731115488493568.json": "After a prolonged isolationist funk, Republicans have rejoined the internationalist mainstream on this issue. And in doing so they have turned from Donald Trump https://t.co/qj1ptO72h0",
  "data/tweet-economist/2022/3/1501795883326877698.json": "Unless it receives urgent help, Moldova faces a catastrophe from the influx of refugees from Ukraine  https://t.co/WltPUL9YkM",
  "data/tweet-economist/2022/3/1501861688924069893.json": "In some cases, Russian soldiers have even punched holes in their fuel tanks to avoid facing combat https://t.co/HIqCBsr8yS",
  "data/tweet-economist/2022/3/1501880244365582338.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia at home. Our cover this week https://t.co/hjbSofY2U4 https://t.co/dhqEnX2ZLq",
  "data/tweet-economist/2022/3/1501885614215548931.json": "When Vladimir Putin ordered the invasion of Ukraine, he dreamed of restoring the glory of the Russian empire. He has ended up restoring the terror of Josef Stalin https://t.co/IDawF2ev93",
  "data/tweet-economist/2022/3/1501875805982498816.json": "To Taiwanese people, the parallels between what Vladimir Putin is doing to Ukraine and what Xi Jinping might do to Taiwan are glaring https://t.co/Ur4FoxlBz2",
  "data/tweet-economist/2022/3/1501892646616375296.json": "Its treatment of Ukrainian refugees has combined foot-dragging, hard-heartedness, ineptitude and dishonesty. It is not the first time this has happened https://t.co/HFDHwAkkN8",
  "data/tweet-economist/2022/3/1501905476027621378.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia. Think what Russia might become once freed from him https://t.co/mFNtahTQKl",
  "data/tweet-economist/2022/3/1501890780901920773.json": "Vladimir Putin is wrecking two countries https://t.co/uDmSuIGmaT",
  "data/tweet-economist/2022/3/1501914964977668101.json": "Also know as “vacuum bombs”, these horrifying weapons can suck the air out of victims’ lungs https://t.co/APZfhnvcBG",
  "data/tweet-economist/2022/3/1501922019276955652.json": "Xi Jinping faces a dilemma. Though he does not want Vladimir Putin to fail, helping him means being spattered by his carnage https://t.co/KjM20SpPEd",
  "data/tweet-economist/2022/3/1501933151022567430.json": "By insisting that Vladimir Putin’s military “operation” is de-Nazifying Ukraine, state television is re-Stalinising Russia https://t.co/X2oF0Pu8Qo",
  "data/tweet-economist/2022/3/1501939446618353670.json": "War in Ukraine will affect the food security not only of those in besieged towns, but also in countries that depend on Russia’s and Ukraine’s agricultural exports https://t.co/qdrc5816aR",
  "data/tweet-economist/2022/3/1501951572636487690.json": "The truth is sinking in that, by attacking Ukraine, Vladimir Putin has committed a catastrophic error. As the scale of his failure becomes clear, Russia will enter the most dangerous moment in this conflict https://t.co/GuY25u950b",
  "data/tweet-economist/2022/3/1501946734007578628.json": "Vladimir Putin has plunged Russia not only into war but also economic chaos. \n\nLearn why the country’s dependence on energy exports makes it vulnerable ⬇️",
  "data/tweet-economist/2022/3/1501879307874017283.json": "India’s abstentions on Russia are shaped by past habits and current priorities https://t.co/UHJCGkcQ8B",
  "data/tweet-economist/2022/3/1501988276185583632.json": "Ihor has two MacBooks: “One I use for work and the other for attacking Russian websites” https://t.co/XRBtXBR5CJ",
  "data/tweet-economist/2022/3/1501996890690404355.json": "China won’t endorse Russia’s war in Ukraine, but it also won’t condemn it. Whose side is China really on? Our expert discusses China’s stance on the conflict https://t.co/aKLwOgvpWF https://t.co/QCUxyb3lP9",
  "data/tweet-economist/2022/3/1501992808382709764.json": "Russia’s invasion of Ukraine is unleashing the biggest commodity shock since the 1970s, and one of the worst disruptions to wheat supplies since the first world war https://t.co/z22lME0m2s",
  "data/tweet-economist/2022/3/1501998243454111755.json": "When hostilities began, Russia sent a volley of cruise and ballistic missiles towards Ukraine’s air bases in an attempt to ground its planes and air-defence systems. That effort failed https://t.co/ER0F1GK12z",
  "data/tweet-economist/2022/3/1501927880716173313.json": "Several Russian banks have said that they will move to UnionPay, China’s state-owned bank-card firm, which already has a significant presence in the country https://t.co/BpzfxP0BQc",
  "data/tweet-economist/2022/3/1502018477816745987.json": "China wants to see Russia survive these sanctions, to teach America and allies that they are not a magic weapon, but is anxious to limit collateral damage to Chinese interests https://t.co/eqKXWKfejf",
  "data/tweet-economist/2022/3/1502019483522772993.json": "His hit-list includes everything from the central bank to the Kremlin. Meet the cyber-warrior taking down Russian websites https://t.co/KhO2VPcgfP",
  "data/tweet-economist/2022/3/1502003119668047876.json": "As the world looks on, it should set out to limit the danger ahead. It must puncture Vladimir Putin’s lies by fostering the truth https://t.co/B6Bf3sl591",
  "data/tweet-economist/2022/3/1502020738802503689.json": "On March 9th Britain’s defence ministry said that Russia had confirmed it is using the weapons in Ukraine https://t.co/x0PQjqFHEP",
  "data/tweet-economist/2022/3/1502031052428226565.json": "In political and social terms it may be necessary to go back almost a century to find a parallel: to 1929, when Stalin liquidated the entrepreneurial class to consolidate his power https://t.co/wrprFDwLof",
  "data/tweet-economist/2022/3/1501934914928709645.json": "Young women “have the most to lose from worsening climate impacts”, says @vanessa_vash. Writing for The Economist at the invitation of @Malala, she explains why girls’ education must be part of the solution #IWD2022 https://t.co/jptJqgVGpl",
  "data/tweet-economist/2022/3/1501676468606226438.json": "Now the newly wed climate activist feels fatalistic – for himself, his wife and for Ukrainians. The only thing left to hope for is “a miracle”, he says to @padochka https://t.co/i7mj9iyzgE",
  "data/tweet-economist/2022/3/1502048922067472385.json": "The truth is sinking in that, by attacking Ukraine, Vladimir Putin has committed a catastrophic error. As the scale of his failure becomes clear, Russia will enter the most dangerous moment in this conflict https://t.co/jTTz9pddGc",
  "data/tweet-economist/2022/3/1502048422286831619.json": "As Russia sinks, the contrast with the president next door is glaring. Volodymyr Zelensky is Vladimir Putin’s antithesis—and perhaps his nemesis https://t.co/4uRLmuFLGK",
  "data/tweet-economist/2022/3/1502032062810923018.json": "It is not the first time that Britain has cold-shouldered desperate people while promising to help them. With Ukraine, it is the only country following a paperwork-first policy https://t.co/5p7DCoOnW2",
  "data/tweet-economist/2022/3/1502034585227612163.json": "On March 8th the first three apps Russia's most popular list in the Apple store were tools aimed at disguising the user’s location, using ruses such as virtual private networks (VPNs)  https://t.co/NAGj458CKi",
  "data/tweet-economist/2022/3/1502063775398121473.json": "All told, Sino-Russian financial links appear weaker than Russia might hope https://t.co/iMU8OxZ78w",
  "data/tweet-economist/2022/3/1501935923692392454.json": "“Young women know all too well how the world fails them”. In a guest essay for The Economist, @Malala argues that leaders “must find a way to ensure every girl can complete 12 years of free, safe and quality education” #IWD2022  https://t.co/rRnZqQuXYV",
  "data/tweet-economist/2022/3/1502092457936314371.json": "Two weeks ago, many of the tens of thousands of men now on Kyiv's barricades were leading mundane civilian lives  https://t.co/F8O6Y9I2Sn",
  "data/tweet-economist/2022/3/1502085153446895619.json": "Russian planes are now barred from skies above America, Britain, Canada, the EU and several other places. Western carriers, meanwhile, are no longer welcome in Russian airspace https://t.co/2qcd1jzog6",
  "data/tweet-economist/2022/3/1502022390821363723.json": "Five years on, Emmanuel Macron remains a mystery: a leader who came from nowhere, belongs to no traditional party and defies ideological labels, says @PedderSophie https://t.co/PyS6DvCXla",
  "data/tweet-economist/2022/3/1501923355372363776.json": "A drop in maize shipments from Ukraine, the world’s fourth-largest exporter, could hurt Egypt, which gets 26% of its maize imports from there https://t.co/bjR2hDaByL",
  "data/tweet-economist/2022/3/1502139277920161794.json": "The Russian conflict is laying bare some of China’s financial vulnerabilities. That may make the relationship less amicable https://t.co/6Ex0JSxdcw",
  "data/tweet-economist/2022/3/1502106793413120002.json": "The last time Russia experienced such rapid, destructive change, according to many, was in the aftermath of the Soviet Union’s collapse https://t.co/SMiDfOjany",
  "data/tweet-economist/2022/3/1502143563957559299.json": "In Kyiv, generosity and a blitz-like spirit prevails. When our correspondent said he had found no bread, the lady in a pharmacy queue next to him tried to give him a loaf  https://t.co/r7zSY82Aer",
  "data/tweet-economist/2022/3/1502150344372981762.json": "In Kherson unabashed pro-Ukrainian rallies have continued daily. One attendee said that the violence of the Russian army had galvanised people https://t.co/33JLL9lf3q",
  "data/tweet-economist/2022/3/1502169479593160708.json": "When Vladimir Putin ordered the invasion of Ukraine, he dreamed of restoring the glory of the Russian empire. He has ended up restoring the terror of Josef Stalin https://t.co/72PP0FuzIM",
  "data/tweet-economist/2022/3/1501981348030038017.json": "RT @shashj: .@ArkadyOstrovsky &amp; me with one of this week's cover briefings in @TheEconomist: on the course of the Russia-Ukraine war and Ru…",
  "data/tweet-economist/2022/3/1502180791803166720.json": "Protesters in Kherson are nervous. But they are even more fearful of the repression and poverty that Vladimir Putin has imposed on the nearby regions of Donetsk and Luhansk https://t.co/aJ421HOVhb",
  "data/tweet-economist/2022/3/1502182797506662400.json": "It is hard for Russian propaganda to pass the economy off as normal. Most global brands have quit the country; the stockmarket has crashed https://t.co/Sa1dwLr6LV",
  "data/tweet-economist/2022/3/1502208477145583617.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia. Think what Russia might become once freed from him https://t.co/eLNb836OxB",
  "data/tweet-economist/2022/3/1502187333013188611.json": "In managing both immigration and crime, the Home Office tends to view immigrants as criminals. It should be cut in two. Neither arm should be run by the incompetent Priti Patel https://t.co/wyyPsspETq",
  "data/tweet-economist/2022/3/1502026773206290435.json": "“When young women speak up, we’re brave. When we succeed, we’re inspiring. Yet our voices, though louder and more lauded than ever, remain sidelined”. Read @Malala’s guest essay for The Economist  https://t.co/eSQlOthNf1",
  "data/tweet-economist/2022/3/1501980765445308423.json": "RT @rosenthal_jon: How much support does Russia have in Africa for its invasion of Ukraine? This was a question we tried to answer in @TheE…",
  "data/tweet-economist/2022/3/1501845373354233857.json": "“Nearly 130m girls are out of school, and I fear we are moving further away from a solution.” @Malala brings attention to the “emergency” facing girls’ education, and explains how to solve it #IWD2022 https://t.co/cXERneURrh",
  "data/tweet-economist/2022/3/1502238624800477185.json": "Vladimir Putin’s war against Ukraine is devastating the country and its people. How far will he go? Our experts discuss the threat of escalation, from the use of nuclear weapons to attacks beyond Ukraine https://t.co/HCcbI08Rud https://t.co/Pbyz5KDbo3",
  "data/tweet-economist/2022/3/1502154375463985156.json": "China’s aim is to shield its financial system by improving its payments system and diversifying its $3.2trn of reserve holdings https://t.co/iJcisQQo55",
  "data/tweet-economist/2022/3/1502087438746931212.json": "Russia and Ukraine together account for 29% of international annual wheat sales https://t.co/6GqEg7fUZE",
  "data/tweet-economist/2022/3/1502262320289959937.json": "These weapons can destroy delicate lung tissue or force air into the bloodstream, causing a massive embolism without leaving external signs of injury https://t.co/8MTLErJoRe",
  "data/tweet-economist/2022/3/1502279692145078277.json": "When hackers succeed in crashing a site, the line of code is replaced by a now-famous battle cry: “Russian warship go fuck yourself!”  https://t.co/WnBjE6cxJr",
  "data/tweet-economist/2022/3/1502291402046193671.json": "In the first two weeks of combat, Russia’s air force has played a minimal role. \n\nBillions of dollars have been poured into their warplanes in the past decade. So where are they? A thread 👇 https://t.co/BrgbxmVomx \n\n📹 Ukrainian defence ministry⁠ https://t.co/AbMqAEYbXF",
  "data/tweet-economist/2022/3/1502302100000317445.json": "The response to Ukrainian resistance is turning nasty. There have been reports of tanks being deliberately rammed into houses, hostage-taking and sexual violence https://t.co/lynBixK6T5",
  "data/tweet-economist/2022/3/1502312106179416066.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia at home. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1502210487068639232.json": "The idea is to disrupt everyday life in Russia so much that it feels like nothing is working “and creates a kind of panic in the country” https://t.co/7UtT3lDk2R",
  "data/tweet-economist/2022/3/1502335551520874507.json": "The truth is sinking in that, by attacking Ukraine, Vladimir Putin has committed a catastrophic error. As the scale of his failure becomes clear, Russia will enter the most dangerous moment in this conflict https://t.co/DeAgPEnRMu",
  "data/tweet-economist/2022/3/1502202893369282561.json": "Russian airlines are flying on borrowed time. In just a few months, they could grind to a halt https://t.co/GboDG0eehT",
  "data/tweet-economist/2022/3/1502029056447062020.json": "Russian state media heralded the fall of Kherson as the campaign’s first “liberation”. Kherson’s citizens were having none of it https://t.co/piHDbOqxrU",
  "data/tweet-economist/2022/3/1502332058475151367.json": "To have an operational nuclear plant seized by force is unprecedented. \n\nFind out why Ukraine’s reactors pose a serious risk:  ⬇️",
  "data/tweet-economist/2022/3/1502325754318794752.json": "To stop Russia’s invasion “we need to win the info war”, one Ukrainian hacker tells @1843mag https://t.co/DIM1qjj3Uj",
  "data/tweet-economist/2022/3/1502275175089377285.json": "By insisting that Vladimir Putin’s military “operation” is de-Nazifying Ukraine, state television is re-Stalinising Russia https://t.co/ovJxLUXs5j",
  "data/tweet-economist/2022/3/1502304361116012546.json": "The Territorial Defence forces that have fanned out across the city are supported by a volunteer network that grew out of the revolution of 2014  https://t.co/UXzXqeCUnd",
  "data/tweet-economist/2022/3/1502368277372227588.json": "Russia used such weapons against civilian targets in Grozny, Chechnya’s capital, in 1999 and in Syria, in 2018 https://t.co/QMZzBNp0mI",
  "data/tweet-economist/2022/3/1502313669606129675.json": "“The world puts a lot of pressure on young women’s shoulders,” writes @Malala. “We put pressure on ourselves to fight for our futures, too. Right now it feels like no one else will. But it is not girls’ sole responsibility to do so” #IWD2022 https://t.co/8qDG2Fdve4",
  "data/tweet-economist/2022/3/1502170227211075587.json": "In Ukrainian cities like Mariupol, where days of shelling have left the place without electricity, battery-powered radios still work when the internet and television do not https://t.co/QzUtcloBzp",
  "data/tweet-economist/2022/3/1502380853145522182.json": "As the world looks on, it should set out to limit the danger ahead. It must puncture Vladimir Putin’s lies by fostering the truth https://t.co/rYACE7V1cP",
  "data/tweet-economist/2022/3/1502378852458418190.json": "Poland is now at the centre of the Western effort to defend Ukraine and deter Russia, a task as important as it is dangerous https://t.co/slu5Ewwerg",
  "data/tweet-economist/2022/3/1502372062047969283.json": "Passengers on Russia airlines may have to board planes that have missed maintenance, are fitted with suspect spares and are uninsured https://t.co/uNfIQj5UGF",
  "data/tweet-economist/2022/3/1502295052873252873.json": "That Chile succeeds matters to Latin America as a whole. Gabriel Boric should aim to provide a path that combines social justice, economic growth and democratic freedoms https://t.co/aCsdlUrwx1",
  "data/tweet-economist/2022/3/1502400009064624133.json": "The Biden administration’s response to Vladimir Putin’s invasion of Ukraine has been prompter, bolder and more effective than many expected https://t.co/TI4nMEjUpL",
  "data/tweet-economist/2022/3/1502370787994570761.json": "The war “not only threatens to destroy Ukraine” warns the political scientist in a guest essay for The Economist. But it also has “the potential to escalate into a nuclear war between Russia and NATO”  https://t.co/G3fafaPDEc",
  "data/tweet-economist/2022/3/1502408037113511939.json": "European intelligence officials say that the Russian intelligence service has drafted plans for public executions to break the morale of Ukrainian protesters https://t.co/CgZ2DOlMqa",
  "data/tweet-economist/2022/3/1502325992651640841.json": "In Beijing, scholars and high­-ranking government advisers predict that today’s shows of Western unity will fade sooner or later https://t.co/MDCxb8GXM5",
  "data/tweet-economist/2022/3/1502410049339412481.json": "Two weeks after Vladimir Putin invaded Ukraine, its capital remains braced for attack, defiant but nervous  https://t.co/TijWU78XI5",
  "data/tweet-economist/2022/3/1502460760265568257.json": "Locals in Kherson report the occupiers to be hungry, looting and “out of control” https://t.co/zZTtB0TiG6",
  "data/tweet-economist/2022/3/1502481264833667073.json": "Instagram is the latest platform to be banned in Russia https://t.co/ONOrEBmCDA",
  "data/tweet-economist/2022/3/1502433954120491008.json": "In online debate in China about the war, by far the most common voices are of anti-Western backers of Vladimir Putin https://t.co/FjpJsKIFdI",
  "data/tweet-economist/2022/3/1502486802015342600.json": "According to the government 20,000 people from 52 countries have volunteered https://t.co/jo3kgADHxl",
  "data/tweet-economist/2022/3/1502381875180023809.json": "With Russian troops massing near Kyiv, ground-based internet links are unlikely to last. Elon Musk’s Starlink satellite dishes may be able to replace them https://t.co/FOcBTRte92",
  "data/tweet-economist/2022/3/1502184814170054659.json": "Breweries are whipping up molotov cocktails and caltrops instead of beers https://t.co/p7tnLxTSNw",
  "data/tweet-economist/2022/3/1502532341209591811.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia at home. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1502534868982509569.json": "History will judge Vladimir Putin harshly for his war  https://t.co/mYzhQX1Wi3",
  "data/tweet-economist/2022/3/1502545516474814466.json": "If Vladimir Putin is committing war crimes against the fellow Slavs he eulogised in his writings, he is ready to inflict slaughter at home https://t.co/CdkOqUznDD",
  "data/tweet-economist/2022/3/1502415576794288131.json": "Ukraine is relying on pensioners to help repel one of the world’s most powerful armies https://t.co/xURY6vm9Da",
  "data/tweet-economist/2022/3/1502548200019972101.json": "Software that hides a user’s location has soared in popularity in Russia since the invasion  https://t.co/6cT2vUbxXi",
  "data/tweet-economist/2022/3/1502569136513241091.json": "The war in Ukraine is a great leap backward for Russia. \n\nWe recap the second week of the invasion ⬇️ https://t.co/j07QiekBc4 https://t.co/R3blPp2APE",
  "data/tweet-economist/2022/3/1502592005666488321.json": "Polish leaders have long pushed their partners in NATO and the EU to forge closer ties with Ukraine, warning of the risk of Russian aggression. Russia’s murderous and unprovoked invasion has proven them entirely right https://t.co/vMl6ZmSI8k",
  "data/tweet-economist/2022/3/1502580614846980101.json": "Indian officials calculate, probably correctly, that their country will suffer few consequences from the West because of its stance on the war in Ukraine https://t.co/WJ06KKAxQx",
  "data/tweet-economist/2022/3/1502593242243768322.json": "Support for Russia on Weibo, China’s Twitter-­like service, is amplified by censors whose eagle eyes and algorithms help suppress other views https://t.co/JjEmPPOlcA",
  "data/tweet-economist/2022/3/1502607612801695749.json": "When Vladimir Putin ordered the invasion of Ukraine, he dreamed of restoring the glory of the Russian empire. He has ended up restoring the terror of Josef Stalin https://t.co/6qlt3u38oy",
  "data/tweet-economist/2022/3/1502605851319799810.json": "“Western politicians danced with Vladimir Putin (some of them literally) and retired to chair the boards of Russian companies,” writes Ingrida Simonyte. “These firms funded the Kremlin’s arms race and diverted billions to Mr Putin’s entourage”  https://t.co/yTkdbnmFMy",
  "data/tweet-economist/2022/3/1502601317285609472.json": "Even as they sleep, tech-savvy Ukrainians are helping the war effort. From @1843mag https://t.co/FOvFFxcdHn",
  "data/tweet-economist/2022/3/1502547466134204416.json": "Foreign fighters that wish to take on the Russians must show proof of previous combat experience and receive approval from the defence attaché of the local Ukrainian embassy https://t.co/55fxYAfhaL",
  "data/tweet-economist/2022/3/1502597799988404225.json": "The bride wore a blue dress and carried yellow roses; the groom scrawled “Fuck the War” on the back of his shirt  https://t.co/CYRiJuBxT1",
  "data/tweet-economist/2022/3/1502396223898234884.json": "Despite the reluctance of Western governments to join in combat, it seems likely that their citizens will do so https://t.co/3ASlJ8dxZw",
  "data/tweet-economist/2022/3/1502662969112633352.json": "To stop Russia’s invasion “we need to win the info war”, one Ukrainian hacker tells @1843mag https://t.co/B2NMzDrA8n",
  "data/tweet-economist/2022/3/1502656940131983364.json": "Even in discordant Washington, DC, there is strong support for Joe Biden’s diplomatic approach  https://t.co/n42rZczOv3",
  "data/tweet-economist/2022/3/1502668005255303171.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia. Think what Russia might become once freed from him https://t.co/P6lO3MrJaD",
  "data/tweet-economist/2022/3/1502667256366604291.json": "Academics say tentacles of the Chinese state that reach into Britain try to choke off discussion of sensitive topics such as Tiananmen, Tibet and Taiwan https://t.co/KZgrKKr4nY",
  "data/tweet-economist/2022/3/1502559537991192577.json": "Incredulous Conservative Party backbenchers have called the response “robotic”. However, that is unfair on robots, which are at least efficient https://t.co/qy4WPP0U2t",
  "data/tweet-economist/2022/3/1502687876231929860.json": "“We are in an extremely dangerous situation, and Western policy is exacerbating these risks,” warns the political scientist in a guest essay for The Economist https://t.co/tVgRs3eJwq",
  "data/tweet-economist/2022/3/1502668764113997829.json": "Some 70% of the 120 Russian billionaires, who together hold 80% of its billionaire wealth, fall within our crony-capitalist definition https://t.co/ynQdnNxrYA",
  "data/tweet-economist/2022/3/1502605591889551361.json": "Over 2m people have fled Ukraine since Russia invaded. It is likely to become the biggest surge of refugees in Europe since the second world war https://t.co/CQEAZR6iuU",
  "data/tweet-economist/2022/3/1502711537257095168.json": "The leader of Turkey’s main opposition party is preparing to take on the president in next year’s election. Recep Tayyip Erdogan and his party look vulnerable https://t.co/A87NCGAY2x",
  "data/tweet-economist/2022/3/1502454349947187207.json": "The conflict will have an alarming effect on agriculture across the world  https://t.co/Ga0vPwhYw1",
  "data/tweet-economist/2022/3/1502747267022958602.json": "It is not the first time that Britain has cold-shouldered desperate people while promising to help them. With Ukraine, it is the only country following a paperwork-first policy https://t.co/odGjZsmW8S",
  "data/tweet-economist/2022/3/1502797100291170305.json": "Poland is nearer the eye of the storm than any other NATO member. It wants to do as much as possible, but there are incalculable risks https://t.co/otzNurI8Vr",
  "data/tweet-economist/2022/3/1502815536287211524.json": "As the world looks on, it should set out to limit the danger ahead. It must puncture Vladimir Putin’s lies by fostering the truth https://t.co/AH8USqv9Po",
  "data/tweet-economist/2022/3/1502808674129096704.json": "Russia’s invasion of Ukraine is unleashing the biggest commodity shock since the 1970s, and one of the worst disruptions to wheat supplies since the first world war https://t.co/2BpeyhlIvI",
  "data/tweet-economist/2022/3/1502832079909924866.json": "To stop Russia’s invasion “we need to win the info war”, one Ukrainian hacker tells @1843mag https://t.co/BXn8rXGQuN",
  "data/tweet-economist/2022/3/1502845633601933314.json": "The heinousness of the Russian threat to Europe has underlined the indispensability and relative benignity of the American counterweight https://t.co/nCf0MntMbA",
  "data/tweet-economist/2022/3/1502786795444097030.json": "Wheat prices are set to climb as a result of the war in Ukraine. But the damage to global food supply will extend far beyond the grain—and last longer than the war itself https://t.co/QDeXLQcANi",
  "data/tweet-economist/2022/3/1502866533445509127.json": "The International Criminal Court is now looking into it  https://t.co/5cfa1JUXrY",
  "data/tweet-economist/2022/3/1502721120046362630.json": "His hit-list includes everything from the central bank to the Kremlin. Meet the cyber-warrior taking down Russian websites https://t.co/4NL8EtqMyE",
  "data/tweet-economist/2022/3/1502868821639667718.json": "Iran has used the years since Donald Trump’s withdrawal from a deal to bring itself closer to nuclear-threshold status. If Vladimir Putin sinks the Joint Comprehensive Plan of Action, Iran will remain frighteningly close https://t.co/qPyHudDXxC",
  "data/tweet-economist/2022/3/1502736698622545928.json": "“Young women know all too well how the world fails them”. In a guest essay for The Economist, @Malala argues that leaders “must find a way to ensure every girl can complete 12 years of free, safe and quality education” #IWD2022  https://t.co/E7dr35NPOi",
  "data/tweet-economist/2022/3/1502849457339215877.json": "“I know how crucial education has been in my life, and I know it can be empowering…not only those girls are missing out but the world is missing out on those opportunities.” On “The Economist Asks” @Malala explains why it’s crucial to keep girls in school https://t.co/fgfeoGSSf7",
  "data/tweet-economist/2022/3/1502827305500094468.json": "“When young women speak up, we’re brave. When we succeed, we’re inspiring. Yet our voices, though louder and more lauded than ever, remain sidelined”. Read @Malala’s guest essay for The Economist  https://t.co/z9BkSxEdkx",
  "data/tweet-economist/2022/3/1502913647751876613.json": "A man who used to entertain the nation has become its voice  https://t.co/99Oa9fOXvd",
  "data/tweet-economist/2022/3/1502809936471990272.json": "Airlines, airport operators, travel websites, planemakers, other suppliers and aircraft lessors have lost nearly $120bn in combined market value so far this year  https://t.co/Ykivz0Me59",
  "data/tweet-economist/2022/3/1502509726478831621.json": "In a country with normal opposition politics, the mistakes by China’s president, Xi Jinping, would be dangerously\nill­-timed https://t.co/U9PBfyaLd4",
  "data/tweet-economist/2022/3/1502909863004934144.json": "As Russia sinks, the contrast with the president next door is glaring. Volodymyr Zelensky is Vladimir Putin’s antithesis—and perhaps his nemesis https://t.co/QtOgebq9Fq",
  "data/tweet-economist/2022/3/1502932484144705536.json": "Vladimir Putin has plunged Russia not only into war but also economic chaos. \n\nLearn why the country’s dependence on energy exports makes it vulnerable ⬇️",
  "data/tweet-economist/2022/3/1502947578459136001.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia at home. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1502953141280595974.json": "Grinding and mudbound as Russia’s advance may be, an advance it is. But every day Ukraine keeps fighting, Vladimir Putin loses https://t.co/Co4AVV3GEa",
  "data/tweet-economist/2022/3/1502982079725854721.json": "Many Ukrainians with pro-Russian sympathies used to think that a relationship between the two countries was possible. That idea has quickly faded https://t.co/5eFHVHgrtv",
  "data/tweet-economist/2022/3/1502974033079508995.json": "On politically sensitive topics, many dissenters do not even try to speak, fearful of being kicked off social media, vilified by trolls or confronted (in person) by the police https://t.co/YuEki3VN8y",
  "data/tweet-economist/2022/3/1502991384759918592.json": "Russian planes are now barred from skies above America, Britain, Canada, the EU and several other places. Western carriers, meanwhile, are no longer welcome in Russian airspace https://t.co/MGiah2FBGb",
  "data/tweet-economist/2022/3/1502998187342188545.json": "Polish leaders have long pushed their partners in NATO and the EU to forge closer ties with Ukraine, warning of the risk of Russian aggression. Russia’s murderous and unprovoked invasion has proven them entirely right https://t.co/36UdYplnSj",
  "data/tweet-economist/2022/3/1502996687983452171.json": "“I worry that if Putin conquers Ukraine, he will turn to Lithuania next, so I’m here fighting for my own country as much as I am for Ukraine.” Why foreigners are flocking to a war zone https://t.co/IkTzKi1yw2",
  "data/tweet-economist/2022/3/1503000466535374850.json": "If Vladimir Putin is committing war crimes against the fellow Slavs he eulogised in his writings, he is ready to inflict slaughter at home https://t.co/aZjARRRlTI",
  "data/tweet-economist/2022/3/1502997162145288192.json": "To outsiders, it is obvious that embracing Russia is harming China’s reputation. So why does China's president, Xi Jinping, seem unperturbed? https://t.co/NMylbSgmUN",
  "data/tweet-economist/2022/3/1503005224713297924.json": "The political scientist believes the reckless expansion of NATO provoked Russia. Writing in a guest essay for The Economist, he explains why https://t.co/yj0p5LOEmw",
  "data/tweet-economist/2022/3/1502989894356021251.json": "“Stop filming us! The Russians will know where to bomb us! You’ll get us all killed!” Tension is running high in Kyiv. @FrancescaEbel and @IKoshiw report for @1843mag https://t.co/CbH241s9Mw",
  "data/tweet-economist/2022/3/1502942300414038016.json": "In managing both immigration and crime, the Home Office tends to view immigrants as criminals. It should be cut in two. Neither arm should be run by the incompetent Priti Patel https://t.co/fzlgqyGQrI",
  "data/tweet-economist/2022/3/1503028879308558344.json": "Russians of military age had relatively little attachment to the country even before the war. Now they are desperately googling ways out. Some are protesting, despite the increasing danger of doing so https://t.co/hXGsV5u43R",
  "data/tweet-economist/2022/3/1503023857195704324.json": "Were Kyiv to fall to the Russians, Ukrainian forces would probably regroup in or around Lviv in the west, only 80km from the Polish border https://t.co/ucBstd26Br",
  "data/tweet-economist/2022/3/1503045725105659907.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia at home. \n\nOur cover this week ⬇️",
  "data/tweet-economist/2022/3/1503043721717293059.json": "Relative to other food sources, beef is uniquely carbon-intensive. It emits 31 times more CO₂ per calorie of food than tofu does https://t.co/ajM6a7C1tZ",
  "data/tweet-economist/2022/3/1503001080631803907.json": "♦️ At least 35 people were killed by Russian missiles near Ukraine’s border with Poland. \n\n♦️ The mayor of Dniprorudne was abducted by Russian forces, Ukrainie’s foreign minister says.\n\n♦️ Russian troops continue to move towards Kyiv.\n\nCatch up on the latest developments ⬇️",
  "data/tweet-economist/2022/3/1503060853356118026.json": "When Vladimir Putin ordered the invasion of Ukraine, he dreamed of restoring the glory of the Russian empire. He has ended up restoring the terror of Josef Stalin https://t.co/6DvrJzDCiG",
  "data/tweet-economist/2022/3/1502733177739268106.json": "If rich countries are worried about shortages, poor ones are in worse trouble. The West must strengthen the global financial safety-net https://t.co/o4DmYxJdmt",
  "data/tweet-economist/2022/3/1503064868680785936.json": "The administration’s diplomacy has in three ways looked impressive by any measure https://t.co/NMoG9o0SJY",
  "data/tweet-economist/2022/3/1503002705333268483.json": "In the future, the country could have too few workers to keep factories, offices and public services running, permanently depressing the economy and resulting in too few young adults to look after retired people https://t.co/IhycYcGXmD",
  "data/tweet-economist/2022/3/1503078197725904900.json": "These weapons can be used in indiscriminate and highly destructive ways https://t.co/ScFozj2j44",
  "data/tweet-economist/2022/3/1503042709556183045.json": "“Stop filming us! The Russians will know where to bomb us! You’ll get us all killed!” Tension is running high in Kyiv. @FrancescaEbel and @IKoshiw report for @1843mag https://t.co/xlVCBKhJU0",
  "data/tweet-economist/2022/3/1502804643356753923.json": "Russian oligarchs will be all too aware of the fact that billionaires in autocratic countries remain vulnerable to the whims of their leaders https://t.co/49ZQ3FgydV",
  "data/tweet-economist/2022/3/1502709530668548098.json": "Wedding day for two Moscow activists: they exchanged their vows, then joined the first protest against the war in Ukraine. From @1843mag https://t.co/eCVW89PzUd",
  "data/tweet-economist/2022/3/1503086002923003907.json": "The idea is to disrupt everyday life in Russia so much that it feels like nothing is working “and creates a kind of panic in the country” https://t.co/UumPcMNBDJ",
  "data/tweet-economist/2022/3/1503099336074399744.json": "Mariupol has suffered more than anywhere in Ukraine from Russia’s nihilist brand of warfare https://t.co/S16jO375ns",
  "data/tweet-economist/2022/3/1503062612547973123.json": "Suleiman the Magnificent established Islam’s place in Europe. In the five centuries since, his personality and achievements have never ceased to puzzle and fascinate https://t.co/nRWaHzx7Rj",
  "data/tweet-economist/2022/3/1503121251631616001.json": "Vladimir Putin is isolated and morally dead. He is turning himself into a 21st-century Stalin, resorting as never before to lies, violence and paranoia. Think what Russia might become once freed from him https://t.co/pa1w0sG29h",
  "data/tweet-economist/2022/3/1503134569930936324.json": "Even if Vladimir Putin were to pull back and pretend that he has won, he would still be dangerous both to the outside world and at home, where he would inflict more deadly repressions https://t.co/Pepa9v7a9b",
  "data/tweet-economist/2022/3/1503055068836282373.json": "Foreign fighters have the potential to turn the conflict into a strange kind of world war, with Russian and Western troops shooting at each other with nary a declaration of war from any government https://t.co/PfOVDnyh5I",
  "data/tweet-economist/2022/3/1503164074036707334.json": "“The West allowed [Vladimir] Putin’s people to keep their fortunes in Western banks and spend them on Western education for their kids”, as well as on “villas and penthouses in Western resorts,” writes Lithuania’s prime minister https://t.co/2es6lmst1C",
  "data/tweet-economist/2022/3/1503038326177214468.json": "“Becoming a refugee is no-one’s first choice. It’s always the last.” Nobel peace-prize laureate @Malala discusses the impact of war on education, on “The Economist Asks” https://t.co/mrJeMGCqOx",
  "data/tweet-economist/2022/3/1503193875350970377.json": "Poland is now home to the second-largest refugee population in Europe. It has coped remarkably well, but its resources are stretched https://t.co/bJGgF67cs2",
  "data/tweet-economist/2022/3/1503181634316689411.json": "By insisting that Vladimir Putin’s military “operation” is de-Nazifying Ukraine, state television is re-Stalinising Russia https://t.co/pyuiS8ce1L",
  "data/tweet-economist/2022/3/1502847177793712128.json": "The fallout from the war will be felt by global food markets in three ways https://t.co/dyjJ2NzWil",
  "data/tweet-economist/2022/3/1503060601127550981.json": "America has the highest death rate from covid-19 among rich countries: nearly double the average https://t.co/qlzAMFfvQE",
  "data/tweet-economist/2022/3/1503220652781748231.json": "Cheers for Russia are amplified by censors whose eagle eyes and algorithms help to suppress other views https://t.co/J4HLqQXVjV",
  "data/tweet-economist/2022/3/1503230020017393664.json": "The truth is sinking in that, by attacking Ukraine, Vladimir Putin has committed a catastrophic error. As the scale of his failure becomes clear, Russia will enter the most dangerous moment in this conflict https://t.co/SRIDLpmvvh",
  "data/tweet-economist/2022/3/1503189609852903431.json": "There is no outcome in Ukraine that will stop the outrages that take place within Russia at the hands of Vladimir Putin’s regime https://t.co/sBgqDZojiu",
  "data/tweet-economist/2022/3/1502887572766445568.json": "Some 50,000 people in New South Wales have recently been forced to evacuate after a dam spilled over https://t.co/9Xf7bD7yeT",
  "data/tweet-economist/2022/3/1503291986559787009.json": "Vladimir Putin is a “pathological liar”, writes Lithuania’s prime minister @IngridaSimonyte. The West was too delusional in its negotiations with him, and “Russian money smelled too good”  https://t.co/KSzFfGxDiQ",
  "data/tweet-economist/2022/3/1503080228905795593.json": "Unable to fly equipment in, Ukraine’s allies must send it across the same borders that refugees are struggling to cross \n https://t.co/3umj0chfpm",
  "data/tweet-economist/2022/3/1503007233285709830.json": "“My generation is passionate about protecting our planet, but many of us aren’t equipped with adequate knowledge or skills to handle the problems we’ll soon inherit.” @vanessa_vash explains why “gender-equal climate education” is part of the solution https://t.co/lbOvF3JiJi",
  "data/tweet-economist/2022/3/1503404835546308609.json": "They cause air to be sucked towards the point of explosion, hence the grim moniker of “vacuum bomb” https://t.co/WuZvtM0ccx",
  "data/tweet-economist/2022/3/1503359667052941312.json": "For China, it is always about Chinese interests. Such self­-absorption is good for domestic morale. It is a perilous way to calculate risks https://t.co/zKpIkGgx36"
}