{
  "data/tweet-stocks/2021/8/1422280238206275586.json": "HODLing is so easy you literally have to do nothing",
  "data/tweet-stocks/2021/8/1422280303922532354.json": "My brain when I think about buying more crypto… https://t.co/vCqnUasYHr",
  "data/tweet-stocks/2021/8/1423608873139777543.json": "The China Crackdown and the Index-Fund-Manager Conundrum✨\n\n(ft the $FRDM index) 🧵 https://t.co/8TFuko9Slc",
  "data/tweet-stocks/2021/8/1423782105721540608.json": "https://t.co/dp5nFZSNAB",
  "data/tweet-stocks/2021/8/1424736805467865094.json": "Me after HODLing my #Bitcoin for the last several months https://t.co/Mjp2isppU5",
  "data/tweet-stocks/2021/8/1426715900686839816.json": "1. \nLets do a battlefield assessment of the battle for Kabul. \nIt is an extremely deadly situation for the Americans particularly &amp; their embassy staff. They know the war has been lost &amp; now they only need a day to evacuate their staff &amp; troops....but do they have that ONE day?",
  "data/tweet-stocks/2021/8/1426911822007914501.json": "#BREAKING: Taliban in a fresh statement says it has decided to enter Kabul even after deciding this morning that they shall wait for transition of power. Says decision taken so that abusers/thieves don’t get mixed and harass common people. Taliban asks common people not to fear. https://t.co/9RwjarXe80",
  "data/tweet-stocks/2021/8/1427028849649504256.json": "NEW: The US military has flown at least 500 Embassy personnel out of Afghanistan on military aircraft, defense officials tell @ckubeNBC.\nThey're working to take 5,000/day, but won’t have that capability for a couple days.",
  "data/tweet-stocks/2021/8/1427155181754519552.json": "Lots of bursts of gunfire near Kabul airport this am. The Taliban have set up many checkpoints in the area.  Reports they are taking potshots at aircraft.  Aggressive posture from Taliban. Chaos",
  "data/tweet-stocks/2021/8/1427161712130764801.json": "Apache now flying over area of what sounds like a gunfight near airport in Kabul.",
  "data/tweet-stocks/2021/8/1427269144815210497.json": "Kabul airport. From  @AFP https://t.co/Qw8cC05VRV",
  "data/tweet-stocks/2021/8/1427289908968837122.json": "CNN reporter outside Kabul embassy:\n\n“They’re just chanting ‘Death to America’ but they seem friendly at the same time.” \n https://t.co/xiaj1GjcKJ",
  "data/tweet-stocks/2021/8/1427287942121377796.json": "I will be addressing the nation on Afghanistan at 3:45 PM ET today.",
  "data/tweet-stocks/2021/8/1427278889529786378.json": "JUST IN - Trump slams Biden over Afghanistan again, \"Can anyone even imagine taking out our Military before evacuating civilians and others who have been good to our Country and who should be allowed to seek refuge?\"",
  "data/tweet-stocks/2021/8/1427308872625180678.json": "Transgender USAF veteran trapped in Taliban takeover of Kabul https://t.co/HXYtCjC8Kc",
  "data/tweet-stocks/2021/8/1427365695487156226.json": "We went in to Afghanistan with clear goals? We were not there for nation-building? \n\nThis speech is already not going well.",
  "data/tweet-stocks/2021/8/1427389395880095746.json": "JUST IN: Taliban spokesman tells @AymanMSNBC live on air they told the US they would not attack Americans. Says won't block anyone who wants to leave. \"We will not punish them.. will not pose arrest to them, their property, or their life... they are welcome (to go)...\"",
  "data/tweet-stocks/2021/8/1427415460878950400.json": "“We can’t leave these people,” the official, now openly emotional, “This is awful,” referring to efforts on safely removing 88,000 Afghan SIVs,  including interpreters. The official worried the situation could further deteriorate.  “We now have the biggest targets on our backs.”",
  "data/tweet-stocks/2021/8/1427415392708857864.json": "#Afghanishtan US official tells @cbsnews @finnygo many US staff involved in these operations were disheartened by the administration’s response on Afghanistan. The official described the situation in Kabul as “worse than Saigon, and worse than Benghazi, at a civilian level” +",
  "data/tweet-stocks/2021/8/1428125768685694976.json": "Top Google Engineer Abandons Company, Reveals Big Tech Rewrote Algos To Target Trump https://t.co/Fu6hS1gH6o",
  "data/tweet-stocks/2021/8/1428896606506586113.json": "CNN’s @clarissaward in Kabul: “I'm sitting here for 12 hours in the airport, 8 hours on the airfield and I haven't seen a single US plane take off. How on Earth are you going to evacuate 50,000 people in the next two weeks? It just, it can’t happen.”",
  "data/tweet-stocks/2021/8/1429211372018098181.json": "JUST IN - Biden admin has issued a \"warning order\" to U.S. carriers. White House prepares to activate Civil Reserve Air Fleet for #Kabul airlift out of Afghanistan.",
  "data/tweet-stocks/2021/8/1429289902777249800.json": "Intel:\ntaliban have sent massive battalion from kunduz to recapture Baghlan. Although they are superior in number/artillery we’ll fight to the last man &amp; make a stand here. If I die, then I die as a free man &amp; not a slave of pakistan Might be my last tweet Allhumdulilah الحمد لله https://t.co/cFPApfoPLy",
  "data/tweet-stocks/2021/8/1429565579975876610.json": "#BREAKING \n\nThe #Resistance continues \n\n1.Doshakh Bridge in #NorthSalang was blown up by the People's Resistance Forces, and the Taliban supply route was cut off from the center. \n\n2:The Taliban were ambushed by Jabal Siraj before entering #Panjshir.",
  "data/tweet-stocks/2021/8/1429598007893364736.json": "\"Ivermectin is likely to be an equitable, acceptable, and feasible global intervention against COVID-19. Health professionals should strongly consider its use, in both treatment and prophylaxis.\"\nhttps://t.co/pLIE8sZ4Pr",
  "data/tweet-stocks/2021/8/1429962955916038148.json": "FDA APPROVAL requires Pfizer to submit study results analyzing risk of myocarditis and pericarditis, and risk to long-term infant development in pregnant women.\n\nStudy results reports will be submitted to the FDA for review on Oct 31, 2025 and May 31, 2027 respectively.",
  "data/tweet-stocks/2021/8/1430157912706621440.json": "MicroStrategy has purchased an additional 3,907 bitcoins for ~$177 million in cash at an average price of ~$45,294 per #bitcoin. As of 8/23/21 we #hodl ~108,992 bitcoins acquired for ~$2.918 billion at an average price of ~$26,769 per bitcoin.  $MSTR\nhttps://t.co/8jUlJImJbO",
  "data/tweet-stocks/2021/8/1430303141979906051.json": "US embassy issues last alert for US citizens to leave afghanistan or they’re on their own, then recalls it 30 mins later.",
  "data/tweet-stocks/2021/8/1430692770709184513.json": "How it really be rn https://t.co/cR5JLQcTIJ",
  "data/tweet-stocks/2021/8/1430742748018130946.json": "It is deeply depressing to watch what could be among the final Afghans loaded up and flying out of their country.  Afghans had hope. Now millions live in fear. A humiliating end for the US in Afghanistan. https://t.co/cy126AQTwX",
  "data/tweet-stocks/2021/8/1430741924407824385.json": "This is the desperation right now in Kabul at just one airport gate. https://t.co/BzQrpB2Nw1",
  "data/tweet-stocks/2021/8/1430931885438509060.json": "BREAKING: BBC presenter Lisa Shaw died due to complications from the AstraZeneca Covid vaccine, a coroner has found.\n\nThe healthy mother of one developed headaches a week after her first dose of the vaccine and suffered blood clots in the brain which ultimately led to her death. https://t.co/RS4jeqxSdw",
  "data/tweet-stocks/2021/8/1430988149744967683.json": "JUST IN - Taliban spokesperson: \"Several explosions have been heard tonight in Kabul, they were controlled detonations carried out by US troops who are destroying their assets at #Kabul airport.\" https://t.co/40E0fDTFJO",
  "data/tweet-stocks/2021/8/1430988735294881793.json": "This was my tweet 2 years ago in August 20 19.\n\nThe terror &amp; carnage you saw in Kabul today was being prepared for past many years...\n\nI had clearly written that US would leave behind ISIS. \n\nUS knew of today's bomb attacks. Imagine that.\n\n#Kabulairport \n#BidenMustResign https://t.co/MlewKMwoLO",
  "data/tweet-stocks/2021/8/1431098022155403265.json": "BIDEN: \"Ladies &amp; Gentlemen, they gave me a list here. The first person I was instructed to call on was Kelly O'Donnell of NBC.\" https://t.co/I68jF1Em0r",
  "data/tweet-stocks/2021/8/1430988743243141129.json": "2019 tweets.....☹️\nWe knew exactly what CIA was doing.... https://t.co/ZJO8qBTrf9",
  "data/tweet-stocks/2021/8/1431664646646292484.json": "So the US Government knew so little about what was happening in Afghanistan that they had no idea the Afghan Security Forces would evaporate and the Taliban immediately take over, but they were able to find within 24 hours the precise ISIS-K \"planner\" to kill? OK.",
  "data/tweet-stocks/2021/8/1431700096891117571.json": "\"despite &gt;5bn vaccines, societies &amp; economies remain hostage to the pandemic, allowing Wall St to discount endless stimulus to the benefit of asset prices; the “end” of the pandemic will be very negative for Wall St, but few think it “ends” soon.\" - BofA",
  "data/tweet-stocks/2021/8/1432039677977141248.json": "OK, so how about we go down the Wikipedia rabbit hole for a moment?  This will show how messed up this system is.  Who is Robert Malone?\nhttps://t.co/HmYWV4hiwS",
  "data/tweet-stocks/2021/8/1432407221359595532.json": "RE: Vaccine enhanced infection/disease/replication  \n1) ADE is one of many possible mechanisms. \n2) Absence of proof is not proof of absence.\n3) Something odd is going on with the vaccine breakthroughs.\n4) FDA and Fauci both cationed about this risk.\n5) Pharma did not study this."
}