{
  "data/tweet-nytimes/2021/12/1466146124738306053.json": "Breaking News: Stacey Abrams announced that she would run for governor of Georgia in 2022, aiming to unseat Gov. Brian Kemp in a rematch of the contentious 2018 election. https://t.co/DgWbCvihK0 https://t.co/J59ksFV6pE",
  "data/tweet-nytimes/2021/12/1466132511260659722.json": "Breaking News: The women’s professional tennis tour said it was immediately suspending all tournaments in China in response to Peng Shuai’s disappearance. Shuai said last month that she was sexually assaulted by a top member of the Chinese government. https://t.co/yFnvMKf2jW",
  "data/tweet-nytimes/2021/12/1466120839674351629.json": "Breaking News: The first U.S. case of the Omicron variant has been detected in California. Over 20 other nations now have cases of the Omicron variant, as questions about its impact remain. Track its spread here. https://t.co/o06X5GOLTj",
  "data/tweet-nytimes/2021/12/1466108480796958734.json": "Breaking News: Donald Trump tested positive for Covid days before facing Joe Biden in their first debate, and before he told the public, two ex-officials said. https://t.co/WR8gzY6eq9",
  "data/tweet-nytimes/2021/12/1466077157793452036.json": "Justice Sonia Sotomayor said that \"15 justices over 30 years since Casey have reaffirmed that basic viability line,\" referring to Planned Parenthood vs. Casey which said that states could not impose an undue burden on the right to abortion. https://t.co/moRhmrL5dZ https://t.co/JWpl0A2qSV",
  "data/tweet-nytimes/2021/12/1466074448109391873.json": "Julie Rikelman, now arguing against Mississippi's law, is the litigation director at the Center for Reproductive Rights. She argued successfully before the Supreme Court in 2020 against a Louisiana law, a significant victory for abortion rights supporters. https://t.co/GjGLibbN4r",
  "data/tweet-nytimes/2021/12/1466067563172016134.json": "Justice Sonia Sotomayor, a consistent supporter of abortion rights, grilled Mississippi's solicitor general, asking whether the institution of the Supreme Court would \"survive the stench\" of overturning Roe in what would appear to be a political act. https://t.co/sbHcIObnjQ",
  "data/tweet-nytimes/2021/12/1466006685823156228.json": "How do you pronounce \"Omicron\" anyway? There is no single, agreed-on English pronunciation, experts say. https://t.co/uIYUXE5TZW https://t.co/2Oc93s4HSB",
  "data/tweet-nytimes/2021/12/1465878338333990916.json": "How do you pronounce \"Omicron\" anyway? There is no single, agreed-on English pronunciation, experts say. https://t.co/PwypHPfQGC https://t.co/exm4AiNna3",
  "data/tweet-nytimes/2021/12/1465860707954659331.json": "In 1911, someone checked out a copy of the book \"New Chronicles of Rebecca\" from a library in Boise, Idaho.\n\nAfter 110 years, the volume mysteriously turned up this month at the city's main library in immaculate condition. https://t.co/vXUKRiD3CJ",
  "data/tweet-nytimes/2021/12/1466063169189777411.json": "Breaking News: Gov. Charlie Baker of Massachusetts, a moderate Republican who defied Donald Trump during his two terms, said he would not seek re-election next year. He faced a Trump-backed primary challenge and a potentially difficult general election.\nhttps://t.co/kciT4EoQ3T",
  "data/tweet-nytimes/2021/12/1465867016611540996.json": "\"I think this is every parent's worst nightmare,\" Gov. Gretchen Whitmer of Michigan said after a fatal shooting at Oxford High School on Tuesday. \"No one should be afraid to go to school, work, a house of worship, or even their own home,\" she added. https://t.co/wfK8MUJSww",
  "data/tweet-nytimes/2021/12/1466099799673950211.json": "Breaking News: The Supreme Court seems poised to uphold Mississippi's law, which bans abortion after 15 weeks of pregnancy, after hearing arguments on Wednesday. But the court's conservative majority appeared split about overruling Roe v. Wade entirely. https://t.co/Cj9TYacIp6 https://t.co/v2JiwBPMg3",
  "data/tweet-nytimes/2021/12/1466167753354719233.json": "The UN secretary general expressed strong criticism of the international response to the Omicron variant, saying that the rush to close borders has especially penalized African nations where the variant was first detected and vaccines were slow to arrive. https://t.co/Y1aMlbZ8US https://t.co/EGfmQbyHd6",
  "data/tweet-nytimes/2021/12/1465923640378150914.json": "The Tucson Police Department moved to fire a police officer after he was captured on video fatally shooting a man in a wheelchair who was suspected of stealing a toolbox from a Walmart and flashing a knife. https://t.co/4DlQIPRzcc",
  "data/tweet-nytimes/2021/12/1466137540889559043.json": "Alec Baldwin said in an upcoming television interview that he did not pull the trigger of the gun that fired a live round on the set of the film \"Rust,\" killing the film’s cinematographer and wounding its director. https://t.co/tKSzUS9HCA",
  "data/tweet-nytimes/2021/12/1466127592952668164.json": "Justice Clarence Thomas asked if there's a constitutional right to abortion, saying it's not spelled out the way the Second Amendment is.\n\n\"It's liberty, your honor,\" Julie Rikelman, the litigation director at the Center for Reproductive Rights, replied.https://t.co/SfiUn06cz1 https://t.co/VBhFTUALjI",
  "data/tweet-nytimes/2021/12/1466210548652068872.json": "Marcus Lamb, a Christian broadcaster in Dallas who had been dismissive of Covid-19 vaccinations, died on Tuesday after contracting the coronavirus, his family said. https://t.co/lxwS1q6n4A",
  "data/tweet-nytimes/2021/12/1466216742791823369.json": "Breaking News: President Biden will extend a mask mandate for travelers on airplanes, trains and buses, a person familiar with the decision said. https://t.co/Jx3Ccaf0ea",
  "data/tweet-nytimes/2021/12/1466131693874520066.json": "Breaking News: A 15-year-old boy was charged with terrorism and first-degree murder in connection with the Michigan school shooting that left at least four students dead on Tuesday. Officials are considering charges against his parents. https://t.co/qymSqjcQHf",
  "data/tweet-nytimes/2021/12/1466082324873895939.json": "During his 2018 confirmation hearing, Justice Brett Kavanaugh declared that he considered Roe to be settled law, winning him the crucial support of Senator Susan Collins. A reversal by him would be politically explosive, says @hillhulse.\n\nListen live: https://t.co/dPjpquzIgH",
  "data/tweet-nytimes/2021/12/1466101074759143431.json": "The Supreme Court's six-member conservative majority appears divided about whether to overrule Roe v. Wade entirely. If they were to do so, at least 20 of the 50 U.S. states will immediately or in short order make almost all abortions unlawful. https://t.co/I5p3mVgXVX",
  "data/tweet-nytimes/2021/12/1466365306071556097.json": "The first Israeli to test positive for the Omicron variant interacted with dozens of people. Only one has tested positive since.\n\nThe results have given some experts cautious hope that triple-vaccinated people may not be as vulnerable as was first feared. https://t.co/b1tSv6Ny63",
  "data/tweet-nytimes/2021/12/1466375536939343875.json": "Breaking News: President Biden is expected to unveil a winter Covid plan today that includes insurance reimbursement for at-home tests and new travel protocols. https://t.co/z4nw6HSrEW",
  "data/tweet-nytimes/2021/12/1466432025183899654.json": "Meghan, the Duchess of Sussex, won a decisive victory in her long-running legal feud with The Mail on Sunday on Thursday, in her claim that the British tabloid violated her privacy by publishing a letter she sent to her estranged father. https://t.co/2JowRUJYjq",
  "data/tweet-nytimes/2021/12/1466374108552351750.json": "China’s censors have begun scrubbing references to Peng Shuai and the sexual assault allegations she made against a former vice premier from the internet. But her supporters are still finding ways to talk about her. https://t.co/zJScFxtmVL",
  "data/tweet-nytimes/2021/12/1466437051205791748.json": "Two Georgia election workers who were falsely accused of manipulating ballots during the 2020 election are suing The Gateway Pundit, one of the nation’s leading sources of pro-Trump misinformation for defamation. https://t.co/2U1y5ka5IR",
  "data/tweet-nytimes/2021/12/1466447078486380544.json": "A Democratic pollster issued a warning to his party ahead of the 2022 elections after holding focus groups with Virginia voters.\n\n\"We’ve got a national branding problem that is probably deeper than a lot of people suspect.\" https://t.co/BVCC8owAmh",
  "data/tweet-nytimes/2021/12/1466530136677826563.json": "Germany announced new rules to prevent unvaccinated people from going to bars and restaurants, or shop anywhere but places like pharmacies or grocery stores to break a soaring fourth wave of Covid and prevent the spread of the Omicron variant. https://t.co/skOiu1CkZC",
  "data/tweet-nytimes/2021/12/1466453420706050053.json": "A former Ohio sheriff’s deputy has been charged with murder in the death of Casey Goodson Jr. last year. Goodson, a 23-year-old Black man, was shot several times in the back during an operation that had nothing to do with him, according to an indictment. https://t.co/U5voTep3UQ",
  "data/tweet-nytimes/2021/12/1466518093518225410.json": "Breaking News: New York City will require employees at yeshivas, Catholic schools and other private schools to be vaccinated against the coronavirus. The new directive is expected to affect roughly 930 schools and 56,000 employees, city officials said. https://t.co/77HWJFfBeD",
  "data/tweet-nytimes/2021/12/1466565400230039555.json": "The most-used emojis of 2021 are in. What's your favorite emoji? Tell us in the comments. https://t.co/jsAwdYGSiT https://t.co/ZR907iTPBa",
  "data/tweet-nytimes/2021/12/1466557835135885314.json": "The NFL on Thursday suspended the Tampa Bay Buccaneers star receiver Antonio Brown and cornerback Mike Edwards without pay for the next three games for misrepresenting their vaccination status. https://t.co/pTJexz3GaZ",
  "data/tweet-nytimes/2021/12/1466552270682738699.json": "Breaking News: Many mix-and-match combinations of booster shots are likely to provide strong protection against the coronavirus, a large study found. https://t.co/hVcwkPFGFY",
  "data/tweet-nytimes/2021/12/1466485125462515720.json": "The Democrats’ social policy bill, or Build Back Better, if passed by the Senate, would be the biggest step toward universal coverage since the passage of the Affordable Care Act. Here are some of the programs and people the bill would affect. https://t.co/56BRchQiZK https://t.co/Ecx86yaTnP",
  "data/tweet-nytimes/2021/12/1466742793502605317.json": "Marcus Lamb, a Christian broadcaster in Dallas who had been dismissive of Covid-19 vaccinations, died on Tuesday after contracting the coronavirus, his family said. https://t.co/ZyfRQONa8R",
  "data/tweet-nytimes/2021/12/1466481055440027664.json": "The largest media organizations in the U.S. — including ABC, CBS, CNN, Dow Jones, NBC, The New York Times and The Washington Post — filed a brief on Tuesday asking a court not to bar Steve Bannon from releasing documents related to the Jan. 6 Capitol riot. https://t.co/eqinOHUxyk",
  "data/tweet-nytimes/2021/12/1466701282513723398.json": "A commercial featuring Santa holding a vaccine passport has been cleared by British ad regulators, after viewers submitted a near-record number of complaints, saying it promoted vaccination. The ad \"doesn't break our rules,\" a spokesman said. https://t.co/pWf6v7L2Hu",
  "data/tweet-nytimes/2021/12/1466764185312940036.json": "On her third day out with a metal detector, Milly Hardwick, a 13-year-old in England, found an ax from 3,000 years ago along with a hoard of other Bronze Age artifacts.\n\n“I was just shocked,” she said. “We were just laughing our heads off.” https://t.co/lhYqb9PBAN",
  "data/tweet-nytimes/2021/12/1466819882583040010.json": "Breaking News: The parents of the Michigan school shooting suspect were charged with involuntary manslaughter, a rare step in prosecuting school shootings. https://t.co/i2YsealQkA https://t.co/L5zzjIiXrq",
  "data/tweet-nytimes/2021/12/1466786842624331786.json": "In Opinion\n\n“The right likes to suggest that abortion is a traumatic experience for women,” writes Elizabeth Spiers, who was adopted as an infant, in a guest essay. “But adoption is often just as traumatic as the right thinks abortion is, if not more so.” https://t.co/jMizWAXvva",
  "data/tweet-nytimes/2021/12/1466848488688390148.json": "These are the best TV shows of 2021, according to our critics. https://t.co/rM0JR5SGGi https://t.co/MP6xVSFbRb",
  "data/tweet-nytimes/2021/12/1466874950493650951.json": "As a nurse in Biella, Italy, prepared to administer a Covid vaccine on Thursday, she noticed the patient's arm was pinker than his face — then, she touched the arm.\n\n\"It was made of rubber foam,\" she said.\nhttps://t.co/8PHg1SEZh5",
  "data/tweet-nytimes/2021/12/1466855937466109955.json": "Breaking News: The Omicron variant appears to be spreading more than twice as fast as Delta in South Africa, scientists said. How vaccines affect it — or  whether Omicron causes more severe disease than other variants — remains unclear. https://t.co/p9yeVmEzHz",
  "data/tweet-nytimes/2021/12/1466520066816630789.json": "Data supporting the effectiveness of mask mandates in Missouri was kept private for a month until state public health officials released it this week in response to a public records request. https://t.co/ZOQtJzGDeO",
  "data/tweet-nytimes/2021/12/1466805696188583936.json": "Some of the first cases of the Omicron variant of the coronavirus to be detected in Botswana — which were among the first known in the world — were in foreign diplomats who had traveled to the country from Europe, Botswana's president said on Thursday. https://t.co/nsK8enIif2",
  "data/tweet-nytimes/2021/12/1466920216751968256.json": "International television got a big boost in the American consciousness this year. These are the best international shows of 2021, according to our critics. https://t.co/mgaLCunBr8 https://t.co/uiKyo7d1HF",
  "data/tweet-nytimes/2021/12/1467136651298226180.json": "Buried under volcanic ash for weeks, thousands of honeybees in the Canary Islands managed to stay alive, a reminder of the species toughness, scientists said. https://t.co/G8eiIUhDf1",
  "data/tweet-nytimes/2021/12/1467126563690979331.json": "Susan Rosenblatt, along with her husband and law partner, Stanley, took on Big Tobacco in a Florida case that resulted in a record $144.8 billion jury award in favor of people sickened by cigarettes. She died last month at 70.\nhttps://t.co/YRBGK2mC6b",
  "data/tweet-nytimes/2021/12/1467056155356712960.json": "On her third day out with a metal detector, Milly Hardwick, a 13-year-old in England, found an ax from 3,000 years ago along with a hoard of other Bronze Age artifacts.\n\n“I was just shocked,” she said. “We were just laughing our heads off.” https://t.co/iVn4XQkJTV",
  "data/tweet-nytimes/2021/12/1467025927322406915.json": "As a nurse in Biella, Italy, prepared to administer a Covid vaccine on Thursday, she noticed the patient's arm was pinker than his face — then, she touched the arm.\n\n\"It was made of rubber foam,\" she said.\nhttps://t.co/zVWY0doJYs",
  "data/tweet-nytimes/2021/12/1466950415262564353.json": "Seven years ago, the Houston megachurch led by Joel Osteen reported that $200,000 in cash and $400,000 in checks had been stolen from a church safe. \n\nLast month, the money may have been discovered by a plumber fixing a toilet inside a church bathroom. https://t.co/SndUvoMYwB",
  "data/tweet-nytimes/2021/12/1467150470733041665.json": "Our greatest fear is here — we’re running out of schmear. \nhttps://t.co/fKjZquEe1y",
  "data/tweet-nytimes/2021/12/1467256367065059338.json": "Breaking News: CNN has fired Chris Cuomo on Saturday following the network’s investigation into his efforts to help his brother, Andrew Cuomo, fight off multiple sexual harassment allegations. https://t.co/0QISk1LUr7",
  "data/tweet-nytimes/2021/12/1467142931098353672.json": "“I transitioned in place. And the community came along with me.” Stu Rasmussen, who was believed to be the first openly transgender mayor in America, served in various elected offices in Silverton, Oregon, died last month at 73.\nhttps://t.co/tofVAFEuFt https://t.co/rTk3UHjgDX",
  "data/tweet-nytimes/2021/12/1467325368059236359.json": "The push to rewrite the Electoral Count Act of 1887 has taken on new urgency as more details have emerged about the extent of former President Trump’s plot to exploit its provisions to cling to power.\nhttps://t.co/ubWaXE6ccI",
  "data/tweet-nytimes/2021/12/1467134591412621316.json": "The parents of a Michigan teenager who fatally shot four students were arrested early Saturday in Detroit, the police said. They face manslaughter charges.  https://t.co/EW73ENEG9U",
  "data/tweet-nytimes/2021/12/1467538241918230531.json": "Breaking News: Bob Dole is dead at 98. He overcame grievous war wounds to become Senate majority leader, spending decades on the national stage. https://t.co/CNGrngGQck",
  "data/tweet-nytimes/2021/12/1467554376436826120.json": "Bob Dole, who overcame grievous war wounds to become one of the longest-serving Republican leaders, died on Sunday at 98. He was the last of the World War II generation to win his party’s nomination for president. https://t.co/azfYozAVMm https://t.co/10x2yO7c5d",
  "data/tweet-nytimes/2021/12/1467582054313472000.json": "How does Denzel Washington maintain an air of mystery in this oversharing era?\n\n“If they see you free all week, they won’t pay to see you on the weekend,” the star told @maureendowd . “I don’t tweet. I don’t have Instagram. I embrace my inner analog.” https://t.co/fytrJQ7qLv",
  "data/tweet-nytimes/2021/12/1467524185178181635.json": "Nathaniel Woods never touched the gun used to kill three Birmingham police officers in 2004. Alabama still sentenced him to die for his role in the murders. https://t.co/9OScOPZIxp",
  "data/tweet-nytimes/2021/12/1467544330143420426.json": "The U.S. is close to having more than 200 million people fully vaccinated against the coronavirus.\n\n198 million residents — almost 60% of the population — were fully vaccinated as of Saturday, according to the CDC. https://t.co/03hmZgXHEx",
  "data/tweet-nytimes/2021/12/1467584678425206801.json": "Breaking News: David Perdue, a former U.S. senator and an ally of Donald Trump, is expected to challenge Gov. Brian Kemp in the Republican primary for governor of Georgia. https://t.co/jfGg9NLMHH",
  "data/tweet-nytimes/2021/12/1467740672774086656.json": "Breaking News: A court in Myanmar sentenced Aung San Suu Kyi, the ousted civilian leader, to four years on the first of several charges against her. https://t.co/8AsViaU9Q6",
  "data/tweet-nytimes/2021/12/1467491469019820033.json": "These cookies will also please brownie lovers, and they capture the spirit of the holiday season with a crown of crushed peppermints. https://t.co/XFNvHslcHq",
  "data/tweet-nytimes/2021/12/1467682974812364810.json": "Without Roe v. Wade, abortion would almost certainly stay legal in most states, but not in a wide swath of the Midwest and the South. https://t.co/b7XAbjfnR8",
  "data/tweet-nytimes/2021/12/1467857655721046017.json": "Breaking News: New York City will implement a sweeping vaccine mandate for all private employers that will take effect Dec. 27, Mayor Bill de Blasio said, calling it the first mandate of its kind in the U.S.\nhttps://t.co/7Wyl6fENt2",
  "data/tweet-nytimes/2021/12/1467713282760970241.json": "Officials and tribal entities agreed that 900 bison from Yellowstone National Park will be slaughtered, shot by hunters or relocated to address overgrazing. The bison have been roaming into Montana, where farmers fear they could spread disease to cattle. https://t.co/7OKrAFmS6q",
  "data/tweet-nytimes/2021/12/1467889080331812864.json": "New York City will implement a sweeping vaccine mandate for all private employers that will take effect Dec. 27, Mayor Bill de Blasio said, calling it the first mandate of its kind in the U.S.\nhttps://t.co/JtIEFLEFg7 https://t.co/4ihCNclIov",
  "data/tweet-nytimes/2021/12/1467942236570755075.json": "Breaking News: The Justice Department sued Texas on Monday over the state's plan to redraw its voting districts, saying the new map would discriminate against Black and Latino voters, essentially making their votes count for less than fellow citizens'. https://t.co/YIb0lbjnH9",
  "data/tweet-nytimes/2021/12/1467909227415019523.json": "Insufficient sleep can have widespread damaging effects on physical and mental health, including increased risk of developing heart disease, high blood pressure, stroke and Type 2 diabetes, a growing body of evidence suggests. https://t.co/7t4kkTu9K5",
  "data/tweet-nytimes/2021/12/1467694244018241538.json": "A court in Myanmar is expected to deliver the first verdicts against the country’s ousted civilian leader, Daw Aung San Suu Kyi. She is facing a series of rulings that could keep her locked up for the rest of her life.\n\nFollow live updates. https://t.co/whyi8BbmrP",
  "data/tweet-nytimes/2021/12/1467884885666893825.json": "As Elon Musk pushed his vision for self-driving cars at Tesla, he overrode safety concerns and may have misled drivers, former employees say. https://t.co/aNUJCIFmWQ",
  "data/tweet-nytimes/2021/12/1468062729181216771.json": "Michael Steinhardt, the billionaire hedge fund pioneer and one of New York's most prolific antiquities collectors, has surrendered 180 stolen objects valued at $70 million and been barred for life from acquiring any other relics, officials said Monday. https://t.co/Kgt2K8LkVc",
  "data/tweet-nytimes/2021/12/1468011153238511616.json": "Drake's withdrawal from the 2022 Grammy Awards is the latest complication for the Recording Academy, which has struggled to prevent an exodus among artists who have complained about a poor win record for Black artists in the most prestigious categories. https://t.co/ztoFMfyX4n https://t.co/T5CzU9WRrf",
  "data/tweet-nytimes/2021/12/1468030011785596934.json": "Female doctors make $2 million less over a 40-year career than their male counterparts, new research estimates. More men become surgeons and women have been shown to spend more time with their patients, leading to fewer services that can be billed for. https://t.co/Ra0Xf91AQQ https://t.co/WNkDtaZXp3",
  "data/tweet-nytimes/2021/12/1467901695342653444.json": "For the first time in 16 years, Germany will be run by a man. But the incoming cabinet will have more women than ever before. https://t.co/VSI5yUJDzS",
  "data/tweet-nytimes/2021/12/1468265582147551236.json": "Chile became the 31st nation to legalize same-sex marriage on Tuesday, a landmark victory for gay rights activists that underscores how profoundly the country’s politics and society have shifted in the past decade. https://t.co/MCMiBI19SV",
  "data/tweet-nytimes/2021/12/1468207444136452096.json": "Female doctors make $2 million less over a 40-year career than their male counterparts, new research estimates. More men become surgeons and women have been shown to spend more time with their patients, leading to fewer services that can be billed for. https://t.co/q8ApaGYheI",
  "data/tweet-nytimes/2021/12/1468267838699941894.json": "Merck and Pfizer will soon debut prescription pills to treat Covid-19 that are expected to work against all versions of the virus. And more drugs are on the way. https://t.co/jOX6Md08gx",
  "data/tweet-nytimes/2021/12/1468290483785019399.json": "Charlottesville's Robert E. Lee statue, which was the focus of a deadly white nationalist rally in 2017, will be donated to an African American heritage center that plans to melt it down and create \"art that will reflect racial justice and inclusion.\" https://t.co/j2bmy7frSl",
  "data/tweet-nytimes/2021/12/1468313129008439308.json": "Charlottesville's Robert E. Lee statue, which was the focus of a deadly white nationalist rally in 2017, will be donated to an African American heritage center that plans to melt it down and create \"art that will reflect racial justice and inclusion.\" https://t.co/vhDc43INJr https://t.co/lgj8mSlkQO",
  "data/tweet-nytimes/2021/12/1468319465628655624.json": "The U.S. surgeon general warned on Tuesday that young people are facing \"devastating\" mental health effects as a result of the challenges experienced by their generation, including the pandemic. https://t.co/ZLXK5YzIAN https://t.co/MU3O4fwuIJ",
  "data/tweet-nytimes/2021/12/1468326242109820942.json": "Saule Omarova, a Cornell Law professor whom President Biden picked for a key banking regulator job, is withdrawing from consideration for the post. Bank lobbyists and Republicans painted her as a communist because she was born in the Soviet Union. https://t.co/90ShBjM5WX",
  "data/tweet-nytimes/2021/12/1467917192020774920.json": "Ghislaine Maxwell has called the Metropolitan Detention Center \"a living hell,\" but the judge overseeing her trial on sex trafficking and conspiracy charges has denied bail her four times, saying Maxwell poses \"a substantial actual risk of flight.\" https://t.co/F0BdgOlHLi",
  "data/tweet-nytimes/2021/12/1468399951067688960.json": "As manatee deaths spike and Florida rescue centers fill up with malnourished manatees, federal and state wildlife officials are taking an unprecedented step: They will provide food for hundreds of manatees in an urgent effort to get them through the winter.https://t.co/F39H7tODNA",
  "data/tweet-nytimes/2021/12/1468490565843050497.json": "A dominant era of German politics is ending today as Angela Merkel hands over the chancellery to Olaf Scholz, a Social Democrat with ambitions to revive progressive politics across Europe.\n\nFollow live updates. https://t.co/Jv8lOvchGq",
  "data/tweet-nytimes/2021/12/1468415053993025546.json": "The U.S. surgeon general on Tuesday warned that young people are facing “devastating” mental health effects as a result of the challenges experienced by their generation, including the coronavirus pandemic.\nhttps://t.co/82JnA4Gc7G",
  "data/tweet-nytimes/2021/12/1468583676845998081.json": "The T. rex at London’s Natural History Museum is a ferocious-looking beast. It’s now wearing a cozy Christmas sweater.\n\n“There is nothing more funny than a jumper fitted for a dinosaur that has the tiniest arms in the world,” one employee said.\nhttps://t.co/leHawmXrjZ https://t.co/z1VNUJlZVi",
  "data/tweet-nytimes/2021/12/1468569829594607617.json": "Three doses of Pfizer-BioNTech’s Covid vaccine give significant protection against Omicron, the companies said, but two doses alone “may not be sufficient to protect against infection” by the fast-spreading variant.\nhttps://t.co/EsNTB7Jhu4 https://t.co/VAjT2vK5he",
  "data/tweet-nytimes/2021/12/1468271674936242176.json": "A book by Billie Eilish cost her publisher well over $1 million. But it sold only about 64,000 hardcover copies since it came out in May, highlighting the difficulty in predicting how well a book will sell. https://t.co/a3XGSx7XbH",
  "data/tweet-nytimes/2021/12/1468593735785234457.json": "Olaf Scholz’s swearing in as Germany’s chancellor made one change to a well-practiced protocol: He omitted the final four words — “so help me God” — of the traditional oath, a first for a postwar chancellor.\nhttps://t.co/xFUIyGw6BO",
  "data/tweet-nytimes/2021/12/1468524773911244801.json": "Behold the fearsome Tyrannosaurus rex — all swaddled in a cozy Christmas sweater. 🦖\nhttps://t.co/dORyq1oVLh",
  "data/tweet-nytimes/2021/12/1468606326976692230.json": "When Angela Merkel became chancellor 16 years ago, George W. Bush was in the White House and Tony Blair was prime minister of Britain. There was no Twitter and no iPhone.\n\nHere is a look back at pictures from her time at the helm.\nhttps://t.co/FdBHqMDCPI",
  "data/tweet-nytimes/2021/12/1468558249125363712.json": "A 50-foot-tall Christmas tree outside the Fox News headquarters in New York City went up in flames. One man has been arrested, the police said. https://t.co/dYeIAvMA5A",
  "data/tweet-nytimes/2021/12/1468184779644456965.json": "The assault of a French soccer player made headlines, with masked men, a metal bar and a teammate arrested.\n\nBut as details emerge about infidelity, accusations against other players and reports of menacing phone calls, no one is sure what to believe.\nhttps://t.co/MPTEgWidEw",
  "data/tweet-nytimes/2021/12/1468673038795395077.json": "Breaking News: President Biden ordered that federal vehicles and buildings begin transitioning to renewable energy, with the goal of making the government carbon neutral by 2050. https://t.co/4BZlMI2b2F",
  "data/tweet-nytimes/2021/12/1468634035308085250.json": "The bride walked down the aisle. The groom's buddy made a toast. There was dancing at the reception. And it all happened in the metaverse.\nhttps://t.co/QytfKWqZoh https://t.co/zZevD7vD6g",
  "data/tweet-nytimes/2021/12/1468732132600254464.json": "The coronavirus can infect body fat, scientists said. The research may explain why people who are overweight or obese face greater risk of severe illness and death from Covid. https://t.co/43d6OO2SAz",
  "data/tweet-nytimes/2021/12/1468691886760247298.json": "President Biden unveiled a plan on Wednesday to make the federal government carbon neutral by 2050, ordering federal agencies to buy electric vehicles, to power facilities with wind, solar and nuclear energy, and to use sustainable building materials. https://t.co/piSpwkMtJ9 https://t.co/0NLNXkVCkt",
  "data/tweet-nytimes/2021/12/1468742204453789708.json": "Active shooter drills in schools may harm the mental health of students while doing little to prevent mass shootings, some experts say. https://t.co/4YwuncCHJH",
  "data/tweet-nytimes/2021/12/1468802604843126787.json": "Your reading list just got a lot longer — here are the 10 Best Books of 2021, selected by editors at The New York Times Book Review. https://t.co/RPIixIOQfw https://t.co/WF6AOTRZJE",
  "data/tweet-nytimes/2021/12/1468800094396948486.json": "Hillary Clinton read her discarded victory speech from the 2016 election aloud for her offering on MasterClass, a site featuring lessons from prominent figures in the arts, business and other fields. https://t.co/WeOL1VISnq",
  "data/tweet-nytimes/2021/12/1468894475762249730.json": "New Zealand unveiled a plan to eventually ban all sales of cigarettes in the country. Starting in 2023, anyone under age 15 would be barred for life from buying cigarettes. https://t.co/PWZEb7hevb",
  "data/tweet-nytimes/2021/12/1468630243355369481.json": "In Opinion\n\n“With every shift, I see the strain people sick with Covid-19 put on my hospital,” writes Rob Davidson, an emergency physician in a rural area of West Michigan, in a guest essay. “Their choice to not get vaccinated is not personal.”\nhttps://t.co/Hcc0lBAi93",
  "data/tweet-nytimes/2021/12/1468757304346562561.json": "\"I was seeing intimate, long-lost footage of the world’s most famous band preparing for its final performance,\" writes @amandahess of \"The Beatles: Get Back.\"\n\n\"And I couldn’t stop watching Yoko Ono sitting around, doing nothing.\" https://t.co/vhg7YCDPVL",
  "data/tweet-nytimes/2021/12/1468883158011891712.json": "\"In this lesson, I’m going to face one of my most public defeats head-on by sharing with you the speech I had hoped to deliver if I had won the 2016 election,\" Hillary Clinton said in a MasterClass video. \"I’ve never shared this with anybody.\" https://t.co/TfigRB6rTl",
  "data/tweet-nytimes/2021/12/1468980147621711874.json": "Breaking News: New York’s attorney general subpoenaed Donald Trump to testify in a civil fraud inquiry into his business practices. https://t.co/WDVJ2iqhx2",
  "data/tweet-nytimes/2021/12/1468943580114960392.json": "New Zealand plans to eventually ban all cigarette sales, gradually raising the smoking age until it covers its entire population.\nhttps://t.co/9bPGRgQqf8",
  "data/tweet-nytimes/2021/12/1468997557812711427.json": "Breaking News: The Metropolitan Museum of Art announced that the Sackler name would be removed from seven exhibition spaces over the family’s ties to the opioid crisis. https://t.co/NFV3dHv4kO",
  "data/tweet-nytimes/2021/12/1468995879994630150.json": "Birds Aren’t Real is a parody social movement with a purpose, its creators say — and Gen Z’s attempt to fight and poke fun at misinformation. \"My favorite way to describe the organization is fighting lunacy with lunacy,\" one organizer said. https://t.co/FkGjBxwwNc https://t.co/ALeuTHT2f8",
  "data/tweet-nytimes/2021/12/1468987583535501317.json": "Breaking News: The FDA authorized Pfizer boosters for 16- and 17-year-olds, clearing the way for several million teenagers to get an additional shot. https://t.co/wDpzzHOQlN https://t.co/iiz0hZRAEb",
  "data/tweet-nytimes/2021/12/1469008968521601024.json": "Josh Duggar, a onetime star of the TLC reality show \"19 Kids and Counting,\" was convicted on Thursday on federal charges of downloading child sexual abuse imagery. He faces a maximum penalty of 40 years in prison and $500,000 in fines. https://t.co/3Jqj2EBvXk",
  "data/tweet-nytimes/2021/12/1469019980565987332.json": "Breaking News: Starbucks workers at a store in Buffalo voted to unionize, making it the only company-owned store in the U.S. with a union. Votes at two other Buffalo-area stores will be counted later on Thursday. https://t.co/cjMYJHpuwc",
  "data/tweet-nytimes/2021/12/1469026634120548356.json": "Prolonged grief disorder has been added to the Diagnostic and Statistical Manual of Mental Disorders, as experts predict a wave of severe bereavement because of the pandemic. It affects around 7% of those in mourning, preliminary studies suggest. https://t.co/7mnEm5SQfw https://t.co/Y72Ld6FrMg",
  "data/tweet-nytimes/2021/12/1469092801237471235.json": "Breaking News: New York passed a bill allowing noncitizens who are legally in the country to vote in local elections, becoming the largest U.S. city to do so. https://t.co/PoDiftizHg",
  "data/tweet-nytimes/2021/12/1469075548139884545.json": "Breaking News: An appeals court ruled that Congress may see White House records of Donald Trump’s communications and movements related to the Jan. 6 attack on the Capitol. https://t.co/jsRdpxL00L",
  "data/tweet-nytimes/2021/12/1469114655683624960.json": "Your reading list just got a lot longer — here are the 10 Best Books of 2021, selected by editors at The New York Times Book Review. https://t.co/q64VjYqj4v https://t.co/5TlR6Yoyl9",
  "data/tweet-nytimes/2021/12/1469049280711245825.json": "The finding is \"another wake-up call for the medical profession and public health to look more deeply into the issues of overweight and obese individuals, and the treatments and vaccines we’re giving them,\" said one professor of nutrition. https://t.co/iEckimA4WQ https://t.co/SNAI3S1htS",
  "data/tweet-nytimes/2021/12/1468934468236890127.json": "Although Congress has allocated trillions of dollars to combat the pandemic, no initiatives exist specifically to help the tens of thousands of children who have lost parents or caregivers.\n\nA bipartisan group is urging White House officials to do more. https://t.co/3zV1UBVoEh",
  "data/tweet-nytimes/2021/12/1469185142086197249.json": "A steel vault, known as Earth’s Black Box, will be put in a remote part of Australia. It will create an archive that could be critical to piecing together the missteps, its creators say, should humanity be destroyed by climate change. https://t.co/9K4kcISthc",
  "data/tweet-nytimes/2021/12/1469091010764582916.json": "Birds Aren’t Real is a parody social movement with a purpose, its creators say — and Gen Z’s attempt to fight and poke fun at misinformation. \"My favorite way to describe the organization is fighting lunacy with lunacy,\" one organizer said. https://t.co/aHJ7d65e4g",
  "data/tweet-nytimes/2021/12/1469294593938272261.json": "Demaryius Thomas, a former star wide receiver for the Denver Broncos who played for the NFL for 10 seasons before retiring in June, died at his home in Georgia on Thursday. He was 33.\nhttps://t.co/pMKprmJPOC",
  "data/tweet-nytimes/2021/12/1469154948621516800.json": "A Texas judge found that the approach unconstitutionally granted standing to those who were not injured, denied due process and represented an \"unlawful delegation of enforcement power to a private person.\" https://t.co/I8C2X403wD",
  "data/tweet-nytimes/2021/12/1469011496621457417.json": "\"Our Santa was Black, but to young me he wasn’t Black Santa. He was simply Santa, no adjective required,\" writes the author Nancy Redd.\nhttps://t.co/P6T04GXzMH https://t.co/wJMVvoxxZs",
  "data/tweet-nytimes/2021/12/1469261374782066689.json": "Breaking News: A British court ruled that Julian Assange can be extradited to the U.S. to face espionage charges. The WikiLeaks founder can appeal the verdict.\nhttps://t.co/cA8V8Ck9ho",
  "data/tweet-nytimes/2021/12/1469298629164900362.json": "Planet earth is getting its own 'black box.' It will create an archive that could be critical to piecing together the missteps, its creators say, should humanity be destroyed by climate change. https://t.co/vdHNLzj5d1",
  "data/tweet-nytimes/2021/12/1469372622723035141.json": "Michael Nesmith, the contemplative, wool-cap-wearing member of the Monkees, has died at 78. He made one of the rock era's first music videos and won the first Grammy Award for video. https://t.co/Ed2OuEMfqr https://t.co/8PssCI3xfu",
  "data/tweet-nytimes/2021/12/1469377650686939144.json": "A YouTuber who investigates cold cases found the car of two Tennessee teenagers who went missing 21 years ago submerged in a river. It's at least the fourth discovery by amateur investigators in two months. https://t.co/A5XCWh8kqf",
  "data/tweet-nytimes/2021/12/1469353745809035268.json": "Only about one in 10 Americans say that receiving the Covid-19 vaccine would violate their religious beliefs, while about 60% say that too many people are using religion as an excuse to avoid vaccine mandates, a new survey found. https://t.co/AsOdWUsF8L",
  "data/tweet-nytimes/2021/12/1469329838939213829.json": "Maria Ressa and Dmitri Muratov, the journalists awarded the 2021 Nobel Peace Prize, used their acceptance speeches to issue dire warnings about the threats to democracies and call for greater accountability for social media companies.\nhttps://t.co/3IdgVd8VIT https://t.co/1GUcKLi2ES",
  "data/tweet-nytimes/2021/12/1469351211690348546.json": "Masks will be required in all indoor public spaces in New York State that do not require proof of Covid vaccination for entry, Gov. Kathy Hochul announced. The new requirement, which takes effect on Monday, comes amid a spike in cases. https://t.co/B2KA74M6w5",
  "data/tweet-nytimes/2021/12/1469332358461542400.json": "Breaking News: The Supreme Court ruled that abortion providers could challenge a Texas law banning abortion after six weeks, but kept the law in effect for now. The decision was both a victory for and disappointment to abortion rights supporters. https://t.co/HzHUgq2FIt https://t.co/jZdKelVdXw",
  "data/tweet-nytimes/2021/12/1469321078736666625.json": "11.2 million oysters have been added to the Hudson River off the coast of Lower Manhattan in the past six months.\n\nThe bivalves are helping to filter the polluted water and create new habitats for other marine life.\nhttps://t.co/zYZHcKJ7je",
  "data/tweet-nytimes/2021/12/1469472027476213762.json": "A former member of the Proud Boys from Texas who traveled to Portland, Oregon, to confront protesters there last year was sentenced on Friday to 10 years in prison. \nhttps://t.co/tVleAliEOO",
  "data/tweet-nytimes/2021/12/1469382675165335553.json": "Of 43 Covid-19 Omicron variant cases reported in 22 states, so far only one patient required hospitalization, and there have been no deaths, the C.D.C. said. https://t.co/vSzOi3rmBT",
  "data/tweet-nytimes/2021/12/1469616024790212609.json": "Breaking News: At least 50 people were feared dead in tornadoes in Kentucky, the governor said, after a string of powerful storms tore through several states. https://t.co/HTusERmBBo",
  "data/tweet-nytimes/2021/12/1469684668077428743.json": "A former member of the Proud Boys from Texas who traveled to Portland, Oregon, to confront protesters there last year was sentenced on Friday to 10 years in prison. \nhttps://t.co/6zQLTvqtsK",
  "data/tweet-nytimes/2021/12/1469669563780505602.json": "The 38-page PowerPoint document with extreme plans to overturn the election that Mark Meadows provided to the 1/6 committee was circulated on Capitol Hill by Phil Waldron, a retired colonel who describes his background as involving “information warfare.\" https://t.co/TZCA8gLixn",
  "data/tweet-nytimes/2021/12/1469086761909428230.json": "Breaking News: Jussie Smollett was found guilty of falsely reporting to the police that he was the victim of a racist and homophobic assault in 2019. https://t.co/ANBiAgMKWv",
  "data/tweet-nytimes/2021/12/1469299332470001669.json": "Breaking News: U.S. inflation hit the highest rate in a generation last month. Consumer prices rose nearly 7%, driven by supply chain woes, demand and housing costs. https://t.co/blqcPdkQIS",
  "data/tweet-nytimes/2021/12/1469672546266193922.json": "Search-and-rescue operations were continuing on Saturday morning after a tornado struck an Amazon warehouse in Edwardsville, Illinois, late Friday. https://t.co/4oJA1P9oGi",
  "data/tweet-nytimes/2021/12/1469750289183956994.json": "Some of the worst destruction from the Kentucky tornado was centered in Mayfield, a town of nearly 10,000 people. At least 110 people were huddled inside a candle factory in the area when a tornado ripped through. https://t.co/1VRJZXLBWw https://t.co/Mh3i3oEzZa",
  "data/tweet-nytimes/2021/12/1469761417154863104.json": "A YouTuber who investigates cold cases found the car of two Tennessee teenagers who went missing 21 years ago submerged in a river. It's at least the fourth discovery by amateur investigators in two months. https://t.co/ShvYA6ENUq",
  "data/tweet-nytimes/2021/12/1469438039101517827.json": "President Biden on Friday said he was \"deeply troubled\" by Kellogg's plan to replace 1,400 employees who have been on strike since October. Biden called the move \"an existential attack on the union and its members' jobs and livelihoods.\" https://t.co/GfFWXSNWzl",
  "data/tweet-nytimes/2021/12/1469698539223756802.json": "Karen McDonald, who, in an unusual move, charged Ethan Crumbley’s parents with involuntary manslaughter, said doing so was gut judgment. Despite pushback from some of her staff members, McDonald said she’s not afraid to lose. https://t.co/9zJJ2t1POT https://t.co/rPlYTlxDas",
  "data/tweet-nytimes/2021/12/1469736267244048390.json": "President Biden directed that federal resources “be surged immediately” to the areas most affected by the tornadoes that swept across five states overnight, according to a statement from the White House. https://t.co/luBCqfCA3L",
  "data/tweet-nytimes/2021/12/1469678366466969604.json": "Mental health has become its own pandemic during Covid, with soaring rates of anxiety, depression and burnout. Psychologists say both resilience and the ability to grow from adversity can be cultivated. Here are four ways to get started. https://t.co/0e6BF03HkF",
  "data/tweet-nytimes/2021/12/1469818505210040327.json": "Breaking News: Over 100 are feared dead in Kentucky, and at least 6 died at an Amazon warehouse in Illinois, after tornadoes struck several states. \n\nhttps://t.co/6Dm7bNFBb3",
  "data/tweet-nytimes/2021/12/1469810503342080006.json": "President Biden pledged to aid the six states that were struck by tornadoes and said federal search-and-rescue teams had been deployed to the affected areas. https://t.co/J8JQ3EmSrM https://t.co/Mj7RMk6CzS",
  "data/tweet-nytimes/2021/12/1469976590926983178.json": "Insufficient sleep can have widespread damaging effects on physical and mental health, including increased risk of developing heart disease, high blood pressure, stroke and Type 2 diabetes, a growing body of evidence suggests. https://t.co/TngMpvgj9w",
  "data/tweet-nytimes/2021/12/1469313224097075205.json": "A Texas law constricts teachers when it comes to race and history. Now the fierce battle over what can be taught has become something broader, an effort to curtail and even ban books, including classics of American literature.\nhttps://t.co/NVjPkGnCLc",
  "data/tweet-nytimes/2021/12/1470023015522000910.json": "The prolific writer Anne Rice has died at 80. The Gothic novelist was famous for “Interview With the Vampire,” which was made into a hit movie. https://t.co/SvqnWLnL27",
  "data/tweet-nytimes/2021/12/1470031947837714434.json": "Late Saturday night, Gov. Gavin Newsom of California accused Texas of insulating its abortion law from the courts, and then called on lawmakers to use a similar strategy to go after the gun industry. https://t.co/j9CFqAWY9v",
  "data/tweet-nytimes/2021/12/1470043602956992514.json": "Max Verstappen, the Dutch racecar driver who won the Formula 1 championship, said in October, “I know that if my car is fast enough until the end of the season, I will win the championship, but if it’s not, then we probably won’t win it.” https://t.co/oWexlPQcAs",
  "data/tweet-nytimes/2021/12/1469689368218644482.json": "Officials said that there were “confirmed fatalities” after a roof collapsed at an Amazon warehouse in Illinois, leaving workers trapped. https://t.co/NknfF9rS37 https://t.co/IhbmlT3ytF",
  "data/tweet-nytimes/2021/12/1470076412027625478.json": "A top secret U.S. strike cell known as Talon Anvil played an outsized role in the air war against ISIS. But in the rush to destroy enemies, it ignored military safeguards and repeatedly killed civilians, according to current and former officials. https://t.co/xa2LhfKmNV",
  "data/tweet-nytimes/2021/12/1470056172828999681.json": "Breaking News: The “Fox News Sunday” host Chris Wallace said that he would leave Fox News after 18 years at the network. https://t.co/uO04dXcuLz",
  "data/tweet-nytimes/2021/12/1470082314776555528.json": "CNN announced that Chris Wallace would have an interview program on its new streaming service after Mr. Wallace said he was leaving Fox News after 18 years with the network. https://t.co/M6JFwK0YtM",
  "data/tweet-nytimes/2021/12/1470053982592815112.json": "In the months before his assassination, President Jovenel Moïse of Haiti was about to destroy crime syndicates and name names. https://t.co/Qzt18fsfcQ",
  "data/tweet-nytimes/2021/12/1470145211624001546.json": "Insufficient sleep can have widespread damaging effects on physical and mental health, including increased risk of developing heart disease, high blood pressure, stroke and Type 2 diabetes, a growing body of evidence suggests. https://t.co/gMgY0ZK3oE",
  "data/tweet-nytimes/2021/12/1470124689028792320.json": "Anne Rice’s novels resonated not only with fans of gothic romance, but with readers who found a spiritual element in them or those who identified with their themes of isolation and alienation. She died on Saturday at 80. https://t.co/bXuUY4afAY",
  "data/tweet-nytimes/2021/12/1470173816118730753.json": "Vicente Fernández, known as “El Rey,” the king of traditional ranchera music, has died at 81. Fernández was known for his operatic range and marathon performances, delivered in a signature charro outfit and intricately embroidered sombrero. https://t.co/besuECr6Yl",
  "data/tweet-nytimes/2021/12/1469875928520081408.json": "Rare footage — which includes scenes of police officers directing traffic and horse-drawn carts piled high with wicker lobster pots — shows life in Ireland in the early years of its independence from Britain. https://t.co/INrg65xwjy",
  "data/tweet-nytimes/2021/12/1470106275010723854.json": "A thoughtfully chosen housewarming gift can help a new house become a home. @wirecutter found more than two dozen gifts that are useful and imaginative. https://t.co/lQHe9AOIAi https://t.co/eXexN2p66n",
  "data/tweet-nytimes/2021/12/1470362934496923650.json": "Thea-Mai Baumann's Instagram handle was @metaverse. “You are now a millionaire,” one person messaged her when Facebook announced it was changing its name. \"Fb isn’t gonna buy it, they’re gonna take it,” said another.\n\nAnd that's exactly what happened. https://t.co/FJ8fEF2qFI https://t.co/xjp3bLzphl",
  "data/tweet-nytimes/2021/12/1470242129129742336.json": "The House committee investigating the attack on the Capitol laid out its case for a contempt of Congress charge against Mark Meadows, former President Trump's chief of staff, showing evidence of his deep involvement in the effort to overturn the election. https://t.co/VXUDsMnoJw",
  "data/tweet-nytimes/2021/12/1470272306798862338.json": "Thea-Mai Baumann's Instagram handle was @metaverse. “You are now a millionaire,” one person messaged her when Facebook announced it was changing its name. \"Fb isn’t gonna buy it, they’re gonna take it,” said another.\n\nAnd that's exactly what happened. https://t.co/Zk7Petbkk4",
  "data/tweet-nytimes/2021/12/1470388053298622466.json": "In Opinion\n\nCities blanketed in dust. Graveyards swallowed by the sea. For years, scientists have sounded the alarm. Now it’s here.\n\nThis is “Postcards From a World on Fire,” a look at climate change in 193 countries. https://t.co/atGmk2ax7G https://t.co/0qlWF9sNRg",
  "data/tweet-nytimes/2021/12/1469743855281049609.json": "Galvanized by Donald Trump’s 2020 election lies, a new class of political activists have begun seeking offices supervising the election systems that they believe robbed Trump of a second term. https://t.co/kwHV7XdU1b",
  "data/tweet-nytimes/2021/12/1470464298916978688.json": "Breaking News: Hundreds of gymnasts who were abused by former national team doctor Larry Nassar reached a $380 million settlement with U.S. gymnastics and Olympics organizations. The settlement is among the largest ever for a sexual abuse case. https://t.co/QxId7iYIOs",
  "data/tweet-nytimes/2021/12/1470493775172710406.json": "Philadelphia will require proof of vaccination to eat or drink indoors starting Jan. 3, city officials announced on Monday. Covid cases have been rising rapidly in the city. https://t.co/t2fFsPa24w",
  "data/tweet-nytimes/2021/12/1470504337663311879.json": "The Supreme Court on Monday refused to block New York's statewide requirement that health care workers be vaccinated against the coronavirus even when they cite religious objections. https://t.co/gkwEK7tkFK https://t.co/XPV2qFOdTz",
  "data/tweet-nytimes/2021/12/1470521440931913736.json": "Breaking News: California is reinstating a statewide indoor mask mandate, as the Omicron variant rapidly spreads and Covid cases rise. The mandate will go into effect on Wednesday and will remain until at least Jan. 15, state officials said on Monday. https://t.co/8FRzHNpilf",
  "data/tweet-nytimes/2021/12/1470450472200908803.json": "Breaking News: No U.S. troops will be punished for the botched strike in Afghanistan that killed 10 civilians, including children, a Pentagon official said. The military initially defended the strike but ultimately called it a tragic mistake. https://t.co/UIdrjeiFgu https://t.co/DKRSsVx5o2",
  "data/tweet-nytimes/2021/12/1470559943006822405.json": "Breaking News: The Jan. 6 panel recommended that Mark Meadows, the former White House chief of staff, be charged with criminal contempt of Congress.\nhttps://t.co/dEHcdsMdey",
  "data/tweet-nytimes/2021/12/1470559210647789569.json": "\"It just seems insulting and absurd to have teachers doing an event like this to raise a few hundred dollars for their classrooms,\" a South Dakota state senator said. \"What other profession would be asked to fund-raise this way?\" https://t.co/tmNDP8CpLq",
  "data/tweet-nytimes/2021/12/1470500082550288424.json": "Breaking News: The Supreme Court refused to block New York's vaccine mandate for health care workers, which allows medical, but not religious, exemptions. https://t.co/7jpYulRyfa",
  "data/tweet-nytimes/2021/12/1470487464993333264.json": "Black women are more likely than white women to develop uterine fibroids, noncancerous tumors that grow in the uterus. The symptoms often make them feel fearful and alone.\n\n“I felt like no one truly listened,” said one woman who was at first misdiagnosed. https://t.co/NtVLEFnpzg",
  "data/tweet-nytimes/2021/12/1470722616273088514.json": "Breaking News: Pfizer said trials of its Covid pill confirmed that it helped stave off severe disease. A lab study found it worked against Omicron.\nhttps://t.co/QypDRIuHAo",
  "data/tweet-nytimes/2021/12/1470502560293400581.json": "Denmark's former immigration minister, Inger Stojberg, was sentenced to two months in prison after being found guilty of illegally ordering the separation of underage couples seeking asylum. https://t.co/apQGwuOCdD",
  "data/tweet-nytimes/2021/12/1470744143349653513.json": "Masayuki Uemura, who developed the Nintendo Entertainment System, which helped start a global revolution in home gaming and laid the foundation for today’s video game industry, died on Dec. 9. He was 78.\nhttps://t.co/2JlWyuwkpe",
  "data/tweet-nytimes/2021/12/1470506359053561857.json": "Vicente Fernández, the ranchera singer who died on Sunday, may be emblematic of a type of dated machismo, but for many, he was the ideal of what it means to be hard-working, hard-loving Mexican man. https://t.co/ySSauNkn9o https://t.co/bMXQAlZw6a",
  "data/tweet-nytimes/2021/12/1470766814636486676.json": "Philadelphia will require proof of vaccination to eat or drink indoors starting Jan. 3, city officials announced on Monday. Covid cases have been rising rapidly in the city. https://t.co/Io8mCxSNoJ",
  "data/tweet-nytimes/2021/12/1470747942688641031.json": "“The Lord of the Rings: The Fellowship of the Ring” is among the 25 movies selected for preservation on the Library of Congress’s National Film Registry.\n\n“Return of the Jedi,” “Selena,” “Wall-E” and “A Nightmare on Elm Street” also made this year’s list.\nhttps://t.co/xxVziet32y",
  "data/tweet-nytimes/2021/12/1470740412914614278.json": "\"It just seems insulting and absurd to have teachers doing an event like this to raise a few hundred dollars for their classrooms,\" a South Dakota state senator said. \"What other profession would be asked to fund-raise this way?\" https://t.co/cq3BFlvxGl",
  "data/tweet-nytimes/2021/12/1470828067438350338.json": "Breaking News: Former Gov. Andrew Cuomo was ordered to turn over about $5.1 million in proceeds from his 2020 pandemic memoir to the state attorney general by a New York ethics board. https://t.co/9AuW3jf3oI",
  "data/tweet-nytimes/2021/12/1470857392262897665.json": "With the future of Roe v. Wade in the hands of the Supreme Court, we took a look at the current state of abortion in America. The abortion rate has fallen in recent decades, but the procedure is still common. Here’s what the typical patient looks like. https://t.co/KsFbQpJFoY https://t.co/VOVMm5rNtk",
  "data/tweet-nytimes/2021/12/1470863678396317710.json": "New prescription eye drops can help users see up close without affecting their long-range vision — and may mean they can ditch their reading glasses for a few hours. https://t.co/w5B2HkjOe7",
  "data/tweet-nytimes/2021/12/1470627123006214148.json": "Joshua Bellamy, a former New York Jets player who fraudulently obtained more than $1.2 million in Covid relief money and spent tens of thousands of dollars of it on luxury items, has been sentenced to about three years in prison. https://t.co/hcfaMvme3s",
  "data/tweet-nytimes/2021/12/1470861170202578945.json": "The Jan. 6 panel recommended on Monday that Mark Meadows, the last White House chief of staff for Donald Trump, be charged with criminal contempt of Congress for defying its subpoena. The House was poised to do the same on Tuesday. https://t.co/EKglg5Ri9A https://t.co/qQbn3XY9t2",
  "data/tweet-nytimes/2021/12/1470818390763782157.json": "The posthumous brain examination of Phillip Adams, a retired NFL player who shot and killed six people in April before fatally shooting himself, revealed that he had an \"unusually severe\" form of CTE, a brain disease linked with repeated hits to the head. https://t.co/S2zJpLejcG",
  "data/tweet-nytimes/2021/12/1470926596433403910.json": "Breaking News: Keechant Sewell will be the first woman to lead the New York Police Department, taking over the largest police force in the U.S. at a key moment. https://t.co/bB4SQbWY8r",
  "data/tweet-nytimes/2021/12/1470929124537548806.json": "Keechant Sewell, the Nassau County chief of detectives, will become New York City's first female police commissioner. Her appointment was seen as one of the most important decisions for Eric Adams, the incoming mayor, as he fills out his administration. https://t.co/geRlhpYUlN https://t.co/zUZuI4wZti",
  "data/tweet-nytimes/2021/12/1470917370571116554.json": "Breaking News: Stephen Curry made his 2,974th 3-pointer, breaking the NBA career record held by Ray Allen. https://t.co/g4nH81bql7",
  "data/tweet-nytimes/2021/12/1470851102971207686.json": "Cornell University moved finals exams to an online format, closed libraries and gyms, barred visitors from campus and took other restrictive measures after the school’s Covid testing lab found evidence of the Omicron variant in a number of students’ tests. https://t.co/sgKmhbwULN",
  "data/tweet-nytimes/2021/12/1470823481180839936.json": "The HPV vaccine, which only works when administered before people become infected by the virus, can prevent as many as 90% of six potentially lethal cancers. Yet, it's being met with rising resistance from parents. https://t.co/C3QHMOwqhz",
  "data/tweet-nytimes/2021/12/1470785865836376070.json": "Pfizer announced that its Covid pill helped stave off severe disease in lab studies against the Omicron variant, which is surging in South Africa and Europe and is expected to dominate U.S. cases in the weeks ahead. https://t.co/7cVhOd6Ueq https://t.co/8DWqXeyhmf",
  "data/tweet-nytimes/2021/12/1470808366758903812.json": "At least two drugmakers want to ask the FDA to switch their birth-control pills from prescription to over-the-counter, but after more than five years of prolonged trial processes and dialogue, they still haven't yet been able to apply. https://t.co/Oka9i2S3TR https://t.co/nBAWiWjjRU",
  "data/tweet-nytimes/2021/12/1470919045495111686.json": "Stephen Curry on Tuesday set a new NBA career record for 3-pointers, surpassing Ray Allen, who finished his career with 2,973 made 3-pointers and held the record for 10 years. https://t.co/E2vT3bRdBe https://t.co/TgbI3NG2qr",
  "data/tweet-nytimes/2021/12/1470847497949962240.json": "Around Antarctica, a vast current acts as the world's climate engine. New science is revealing the power it holds over the future, and researchers are alarmed at what they’re learning as ice shelves retreat. https://t.co/SVAM19gX6d https://t.co/xytcRDgvbf",
  "data/tweet-nytimes/2021/12/1470903250710896646.json": "Breaking News: A federal judge dismissed a lawsuit by Donald Trump that sought to block Congress from obtaining his tax returns. https://t.co/KbfddXUeRk",
  "data/tweet-nytimes/2021/12/1470657344065445892.json": "Meet China’s newest propaganda tool: Foreign YouTubers who speak up for Beijing and reap rewards in money or clicks.\n\nTheir videos might look casual, but they are part of the Communist Party's efforts to shape the global conversation about China.  https://t.co/mgzvc6JhDm",
  "data/tweet-nytimes/2021/12/1470934152258244611.json": "A new eye drop could make misplaced reading glasses less of an inconvenience for many of the 128 million Americans who suffer from age-related deficits in near vision. https://t.co/MUyPHH1SkZ",
  "data/tweet-nytimes/2021/12/1471146330470899718.json": "Breaking News: Derek Chauvin pleaded guilty to using his position as a police officer to violate George Floyd’s constitutional rights. The move will likely lengthen Chauvin’s time in prison for murdering Floyd. https://t.co/WxYjv9mWKD",
  "data/tweet-nytimes/2021/12/1471083904106967042.json": "North Korea has publicly executed at least seven people in the past decade for watching or distributing K-pop videos, as it cracks down on what its leader, Kim Jong-un, calls a “vicious cancer,” according to a human rights report.\nhttps://t.co/oYKz2y9QUr",
  "data/tweet-nytimes/2021/12/1471159386533990402.json": "Kroger, the U.S. supermarket operator, has eliminated paid Covid-19 leave for unvaccinated employees and will charge salaried employees who are enrolled in a company health care plan $50 a month if they remain unvaccinated, a spokeswoman said. https://t.co/UCtSB9Pmsr",
  "data/tweet-nytimes/2021/12/1470977194738466817.json": "First breakups. Final goodbyes. For generations, Vicente Fernández, the Mexican ranchera superstar who died on Sunday at 81, sung often sorrowful songs that have served as a balm for the heartbroken. https://t.co/sq7BZwjIgK",
  "data/tweet-nytimes/2021/12/1470971128516694018.json": "Breaking News: The House recommended criminal contempt charges for Mark Meadows, Donald Trump’s ex-chief of staff, for stonewalling the Jan. 6 inquiry. https://t.co/kLc9vF8XeV",
  "data/tweet-nytimes/2021/12/1471175945507815429.json": "Breaking News: Booster doses of the Moderna and Pfizer Covid vaccines are likely to offer a substantial increase in protection against the Omicron variant, Dr. Anthony Fauci said. https://t.co/HxbFldlSNg",
  "data/tweet-nytimes/2021/12/1471197133164453901.json": "A man returned to his Kentucky home to find that it had been largely demolished by a tornado, but that his piano was still intact. Listen as he plays the Christian worship song \"There’s Something About That Name.\" https://t.co/qZrWIyetOY https://t.co/TTjQAP1EUJ",
  "data/tweet-nytimes/2021/12/1471178260671311879.json": "Malta became the first country in the E.U. to agree to legalize marijuana for recreational purposes, allowing people to carry up to seven grams of marijuana, grow up to four plants in their apartments and keep up to 50 grams of dried cannabis at home. https://t.co/JmncYxjsbp https://t.co/6DE8F1lpAn",
  "data/tweet-nytimes/2021/12/1470949243934416904.json": "Steph Curry on Tuesday set a new NBA career record for 3-pointers, surpassing Ray Allen, who finished his career with 2,973 made 3-pointers and held the record for 10 years. https://t.co/YzNpTmqJrc https://t.co/PzDr2nEjt2",
  "data/tweet-nytimes/2021/12/1471233629913292815.json": "bell hooks, whose incisive, wide-ranging writing on gender and race helped push feminism beyond its white, middle-class worldview to include the voices of Black and working-class women, died on Wednesday. She was 69. https://t.co/uT7qoRZbV7 https://t.co/hW0CeOyfZ2",
  "data/tweet-nytimes/2021/12/1471240221681500162.json": "Breaking News: Covid deaths in the U.S. surpassed 800,000, the highest known number of any country in the world. https://t.co/NZjAnVZSyo https://t.co/KBieNaUAwK",
  "data/tweet-nytimes/2021/12/1471278909354385415.json": "bell hooks, whose incisive, wide-ranging writing on gender and race helped push feminism beyond its white, middle-class worldview to include the voices of Black and working-class women, died on Wednesday. She was 69. https://t.co/TUrsklsxAe https://t.co/Rhylcf0nwQ",
  "data/tweet-nytimes/2021/12/1471256283340812301.json": "Chicago's City Council approved a $2.9 million settlement on Wednesday for Anjanette Young, a medical social worker who was forced to stand naked in front of a dozen police officers who burst into her home to execute a search warrant in 2019. https://t.co/lGvOxtTSvs",
  "data/tweet-nytimes/2021/12/1471242448986939401.json": "Turkey's bakers say they can't afford to keep making bread because of price controls and rising inflation. And their customers can't afford to buy it anyway. https://t.co/eAkJChhEPf https://t.co/0lUzziU4Hj",
  "data/tweet-nytimes/2021/12/1471307862328680449.json": "Jordan Baize saw that the roof of his house in Kentucky had blown away during a tornado. But his Yamaha piano was still intact. \n\nUnder an overcast sky, Baize sat alone in his living room and started to play a song that had been stuck in his head for days. https://t.co/s7HZIl751f https://t.co/MR2q5FfhAF",
  "data/tweet-nytimes/2021/12/1471324222089834500.json": "Kroger, the U.S. supermarket operator, has eliminated paid Covid-19 leave for unvaccinated employees and will charge salaried employees who are enrolled in a company health care plan $50 a month if they remain unvaccinated, a spokeswoman said. https://t.co/7P6htEoEiY",
  "data/tweet-nytimes/2021/12/1471065043445891072.json": "A group of people handcuffed a principal in northern Greece and took him to the police, suggesting that officers arrest him for enforcing Covid measures at a school.\n\nInstead, the group was detained and now faces abduction charges.\nhttps://t.co/ys0eE5LWOv",
  "data/tweet-nytimes/2021/12/1471087712329424905.json": "Keechant Sewell, the Nassau County chief of detectives, will become New York City’s first female police commissioner. https://t.co/mMCrZVJYEw",
  "data/tweet-nytimes/2021/12/1471332348310474757.json": "Breaking News: Bruce Springsteen sold his music rights to Sony in a deal that may exceed $500 million in value, people briefed on the matter said. https://t.co/93GV2zDeO0",
  "data/tweet-nytimes/2021/12/1471268873508900872.json": "While visiting Kentucky, President Biden praised the communities affected by the deadly tornadoes last weekend for how they’ve come together to handle the severe devastation.\nhttps://t.co/yu9heYfOwL https://t.co/SiNaDr50TL",
  "data/tweet-nytimes/2021/12/1471419843794587651.json": "bell hooks, whose incisive, wide-ranging writing on gender and race helped push feminism beyond its white, middle-class worldview to include the voices of Black and working-class women, died on Wednesday. She was 69. https://t.co/9JNRSGKsoj https://t.co/nmjhFMJ1LP",
  "data/tweet-nytimes/2021/12/1471472731413749763.json": "Turkey's bakers say they can't afford to keep making bread because of price controls and rising inflation. And their customers can't afford to buy it anyway. https://t.co/Kw9IFREzPc https://t.co/23xF9ZyKpi",
  "data/tweet-nytimes/2021/12/1471596185412681746.json": "Breaking News: Women can get abortion pills by mail for pregnancies up to 10 weeks without seeing a doctor in person, the FDA ruled. The decision comes as the Supreme Court considers whether to roll back abortion rights or even overturn Roe v. Wade. https://t.co/hutMjelRXU",
  "data/tweet-nytimes/2021/12/1471597786810523651.json": "Breaking News: Women can get abortion pills by mail for pregnancies up to 10 weeks without seeing a doctor in person, the FDA ruled. The decision comes as the Supreme Court considers whether to roll back abortion rights or even overturn Roe v. Wade. https://t.co/Oc8jDUpHJl https://t.co/4ZY84CtzAH",
  "data/tweet-nytimes/2021/12/1471652388142469127.json": "Breaking News: A federal judge overturned Purdue Pharma’s opioid settlement, ruling that the Sackler family could not receive protection from civil lawsuits. https://t.co/fAQnifIw69",
  "data/tweet-nytimes/2021/12/1471641302320168964.json": "Nearly all active-duty members of the Army and Navy — 98% — are vaccinated against Covid-19. The service members who still refuse shots will be dismissed, the military said. Thousands of troops requested religious exemptions, but none have been granted. https://t.co/icQ2yqcmLO",
  "data/tweet-nytimes/2021/12/1471588451850014730.json": "Breaking News: A CDC panel recommended other Covid vaccines over Johnson &amp; Johnson’s, citing the link to a rare but potentially fatal blood clotting disorder. https://t.co/nOXnjjEMnT",
  "data/tweet-nytimes/2021/12/1471684136452694018.json": "Harvard will not require SAT or ACT scores for admission through the next four years, extending a policy adopted during the coronavirus pandemic and adding fuel to the movement to permanently eliminate standardized test scores for admission. https://t.co/5r5IC1IpuI",
  "data/tweet-nytimes/2021/12/1471544425855729672.json": "Super Typhoon Rai brought heavy rain and flooding to the southeastern part of the Philippines on Thursday, displacing thousands over a large area. https://t.co/HQErmPRTtJ https://t.co/NTxyOPl6NI",
  "data/tweet-nytimes/2021/12/1471808412719714305.json": "Harvard will not require SAT or ACT scores for admission through the next four years, extending a policy adopted during the coronavirus pandemic and adding fuel to the movement to permanently eliminate standardized test scores for admission. https://t.co/mdKaveBpNs",
  "data/tweet-nytimes/2021/12/1471694170293215232.json": "A former defense contractor from South Dakota was arrested on espionage-related charges after an undercover FBI operation in which he tried to provide classified national defense information to someone he believed to be a Russian agent, prosecutors said. https://t.co/OsMd0IY7rz",
  "data/tweet-nytimes/2021/12/1471631244710629376.json": "When the story appeared on a local news site, the mayor’s spokesman denied it. Then the spokesman acknowledged it was true: Mayor Dave Bronson of Anchorage, Alaska, went to a city water treatment plant and shut off the fluoride in the city’s water system. https://t.co/3sk9Mv51w2",
  "data/tweet-nytimes/2021/12/1471480270217961474.json": "For over a year, prominent women in India, including journalists, were reeled into a labyrinthine online scam, offering jobs and opportunities with Harvard University.\n\nWho targeted them, and why, is a mystery. https://t.co/LJoJuG1qtM",
  "data/tweet-nytimes/2021/12/1471551983739887627.json": "At least a dozen restaurants and bars in New York City temporarily closed this week as workers test positive for Covid. The reported number of new cases in the city has risen to an average of 3,554 a day, an increase of 135% from the average two weeks ago. https://t.co/RFCod5Rzr6",
  "data/tweet-nytimes/2021/12/1471812455844229121.json": "A federal judge overturned Purdue Pharma’s opioid settlement, ruling that the Sackler family could not receive protection from civil lawsuits. https://t.co/TsCoM8ys0o",
  "data/tweet-nytimes/2021/12/1471835108344741895.json": "One of them plunged into a burning truck to save others. One made a shield with his body to allow an evacuating helicopter to fly away. One ran toward a breach in the wall of his base to stop an insurgent attack.\n\nThey were all awarded medals of honor. https://t.co/sieyJAyOqa",
  "data/tweet-nytimes/2021/12/1471916413220757506.json": "Breaking News: Pfizer said its two-shot vaccine didn’t perform adequately in children 2 to 5, and it will test a three-dose series for official authorization. https://t.co/G8NhvNAhz8",
  "data/tweet-nytimes/2021/12/1471686623796645893.json": "Fires in California, hurricanes on the East Coast, a deadly snowstorm in Texas, tornadoes in the Southern U.S. and melting ice in Canada.\n\nLook back at some of the destruction brought about by climate change in 2021 through our #YearInPictures. https://t.co/yTKWUvYXuH",
  "data/tweet-nytimes/2021/12/1471973913160736770.json": "Breaking News: A Florida man who threw a fire extinguisher at the police on Jan. 6 was sentenced to more than five years in prison, the longest sentence handed to any of the more than 700 people charged in the Capitol attack so far. https://t.co/bMciNvXhZP",
  "data/tweet-nytimes/2021/12/1471940808798523393.json": "The CEO of Southwest Airlines, Gary Kelly, tested positive for the coronavirus after appearing at a Senate hearing on Wednesday, the company said. Kelly tested negative several times before the hearing and is fully vaccinated with a booster shot. https://t.co/YnAsPKWKOH",
  "data/tweet-nytimes/2021/12/1471646364396404740.json": "Without a basement, Clara Lutz of Barnsley, Kentucky, sheltered her infant grandsons in the bathtub for safety. A powerful tornado pulled the tub from her grip and sent the babies flying. https://t.co/tUn8nJU4ib https://t.co/q5OHAnxVlr",
  "data/tweet-nytimes/2021/12/1471993640058867714.json": "One of the easiest ways to upgrade your mask protection is to wear two at the same time, health experts say. Here are answers to common questions about double masking. https://t.co/Qp4OycZG16 https://t.co/R2dSYu6oMP",
  "data/tweet-nytimes/2021/12/1472028598127271942.json": "Breaking News: A federal appeals court reinstated a Biden administration rule requiring that many large companies mandate vaccines or weekly Covid testing. https://t.co/ems4j9o9Dv",
  "data/tweet-nytimes/2021/12/1472008756183683074.json": "Breaking News: New York State officials reported 21,027 new coronavirus cases on Friday, the highest in a single day since testing became widespread. https://t.co/ODckaoWbfU",
  "data/tweet-nytimes/2021/12/1472033902495731712.json": "Masks work best when everyone in the room has one on, but you’ll still benefit from masking up even when those around you aren’t. Here's what the evidence shows. https://t.co/ILuj0LdBJq",
  "data/tweet-nytimes/2021/12/1471925693609033730.json": "Elijah Wood kept a pair of hairy hobbit feet in the same box they were given to him in for over 20 years, reminding him of his time in \"The Lord of the Rings\" trilogy. As he reflects on his career, he knows that to some fans, he will always be Frodo. https://t.co/jHL67WGB13",
  "data/tweet-nytimes/2021/12/1472131531053408257.json": "France announced plans to tighten restrictions on the unvaccinated in the new year. If the new law is approved, only vaccinated people will be eligible for a French health pass, which is required to be in public spaces like restaurants, museums and trains. https://t.co/o5OVjtw8wR",
  "data/tweet-nytimes/2021/12/1471846419682185220.json": "Neal Moore, 50, crossed the U.S. by canoe “to see the country up close and personal.”\n\nHe began in the Columbia River in Oregon, crossed several northern states and traveled to the Gulf Coast. After 22 months, he paddled into New York Harbor this week.\nhttps://t.co/AxmkzfMMRZ",
  "data/tweet-nytimes/2021/12/1471874088452952064.json": "\"Unvaccinated Americans — who are disproportionately Republican — are now in even more danger than a few weeks ago,\" @DLeonhardt writes in The Morning newsletter. He says a clear message from conservative pundits, many of whom are vaccinated, could help. https://t.co/jKaEECAaah",
  "data/tweet-nytimes/2021/12/1472224647747883019.json": "A growing number of Black elected officials across the U.S. have been drawn out of their districts or placed in newly competitive districts. Almost all of the affected lawmakers are Democrats, and most of the mapmakers are white Republicans. https://t.co/YvbSS8nhLu",
  "data/tweet-nytimes/2021/12/1472270450705285135.json": "A 5-year New York Times investigation into hidden Pentagon records shows that a pattern of failures in U.S. airstrikes in the Middle East has killed thousands of civilians, many of them children. None of these records show findings of wrongdoing. https://t.co/6VCYUtSZXf",
  "data/tweet-nytimes/2021/12/1472298892398051328.json": "Breaking News: The Netherlands ordered a full lockdown until mid-January in Europe's strongest reaction to the Omicron variant so far. https://t.co/uSsO32fS50",
  "data/tweet-nytimes/2021/12/1472337646588506117.json": "President Biden saw more of his judicial nominees confirmed in his first year than any president in the last 40 years. The Senate confirmed 18 federal judges in Donald Trump’s first year. https://t.co/IWfPQouWJN",
  "data/tweet-nytimes/2021/12/1472331100974419968.json": "Breaking News: “Saturday Night Live” announced, just hours before its final show of 2021, that there would be no live audience “out of an abundance of caution” amid the surge of coronavirus cases in New York tied to the Omicron variant. https://t.co/SDtfMN3GF5",
  "data/tweet-nytimes/2021/12/1472333623475019780.json": "One of the easiest ways to upgrade your mask protection is to wear two at the same time, health experts say. Here are answers to common questions about double masking. https://t.co/lF3GyEKs65",
  "data/tweet-nytimes/2021/12/1472289339841425408.json": "We are making public hundreds of the Pentagon’s confidential assessments of reports of civilian casualties resulting from airstrikes. The documents lay bare how flawed intelligence has killed thousands of innocent civilians, many of them children. https://t.co/D1vE9aEDYh",
  "data/tweet-nytimes/2021/12/1472038949484961799.json": "The coronavirus testing capacity in the U.S. is facing enormous new pressure, with holiday travelers waiting in long lines to be tested, overworked laboratories struggling to keep up and rapid at-home diagnostics flying off pharmacy shelves. https://t.co/23JHHJ9nTt",
  "data/tweet-nytimes/2021/12/1472373885874098178.json": "Shirley Zussman, a sex therapist who was trained by the researchers who demystified the mechanics of sex, and who continued seeing patients until she was 105, died on Dec. 4. She was 107. https://t.co/xUj74tKDjc",
  "data/tweet-nytimes/2021/12/1471934341282476032.json": "Breaking News: Pfizer said its two-shot vaccine didn’t perform adequately in children 2 to 5, and it will test a three-dose series for official authorization. Follow live updates here. https://t.co/FvLr3H1orj https://t.co/q0sJY8e9kl",
  "data/tweet-nytimes/2021/12/1472381696209264643.json": "Erin Schaff, a New York Times photographer, was covering the certification of electoral votes on Capitol Hill on Jan. 6 when she instead found herself photographing an attempted insurrection. Look back at her images of the Capitol riot. #YearInPictures https://t.co/lE3pFBbLtu https://t.co/aYwchB1VIw",
  "data/tweet-nytimes/2021/12/1472282269813559306.json": "A hidden Pentagon archive revealed that, since 2014, the American air war in the Middle East has been plagued by deeply flawed intelligence that has killed thousands of civilians, many of them children. Read the takeaways of our investigation. https://t.co/0nt2sP9g3m",
  "data/tweet-nytimes/2021/12/1472514056955342852.json": "Neal Moore, 50, crossed the U.S. by canoe “to see the country up close and personal.” He began in the Columbia River in Oregon, crossed several northern states and traveled to the Gulf Coast. After 22 months, he paddled into New York Harbor this week. https://t.co/qtr7MwHH3K",
  "data/tweet-nytimes/2021/12/1472573873493266437.json": "A professor at the University of Tennessee at Chattanooga wanted to test whether his students closely read the class syllabus and included clues to $50 cash prize hidden in a locker. By semester's end, none of his more than 70 students had claimed it. https://t.co/avlpBsI2VS",
  "data/tweet-nytimes/2021/12/1472593840506904582.json": "A professor at the University of Tennessee at Chattanooga wanted to test whether his students closely read the class syllabus and included clues to a $50 cash prize hidden in a locker. By semester's end, none of his more than 70 students had claimed it. https://t.co/fWv8m5uKQe",
  "data/tweet-nytimes/2021/12/1472586290944262144.json": "State Senator Doug Ericksen, a Republican who had led opposition to Washington State’s Covid-19 emergency orders and vaccine mandates, has died after he said he tested positive for the coronavirus after traveling to El Salvador. He was 52. https://t.co/5SbKMDLQ16",
  "data/tweet-nytimes/2021/12/1472620268547940352.json": "Louise Taylor's firm helped to manage Britney Spears’s affairs during a conservatorship that Spears has called abusive. \n\nNow Taylor faces questions from Spears's lawyers and others about how much she made and whether she improperly enriched herself.  https://t.co/BeETW0pvMq",
  "data/tweet-nytimes/2021/12/1472477054708944897.json": "“The Lord of the Rings: The Fellowship of the Ring” is among the 25 movies selected for preservation on the Library of Congress’s National Film Registry.\n\n“Return of the Jedi,” “Selena,” “Wall-E” and “A Nightmare on Elm Street” also made this year’s list.\nhttps://t.co/okD6ELpZps",
  "data/tweet-nytimes/2021/12/1472703335530704897.json": "Gabriel Boric was elected president of Chile on Sunday, making the 35-year-old leftist lawmaker the country's youngest leader. He'll take office as Chile, roiled by social upheaval, completes the drafting a new Constitution. https://t.co/3Alh2anyPG",
  "data/tweet-nytimes/2021/12/1472691992132206594.json": "Masks work best when everyone in the room has one on, but you’ll still benefit from masking up even when those around you aren’t. Here's what the evidence shows. https://t.co/1yZB9QP5p6",
  "data/tweet-nytimes/2021/12/1472733538248282113.json": "By withholding his support from President Biden’s $2.2 trillion Build Back Better bill, Senator Joe Manchin has significantly dimmed the prospects for climate action that scientists say the U.S. must take to keep the planet from dangerously overheating. https://t.co/MkLHRaSMvV",
  "data/tweet-nytimes/2021/12/1472650479180132359.json": "A hidden Pentagon archive revealed that, since 2014, the American air war in the Middle East has been plagued by deeply flawed intelligence that has killed thousands of civilians, many of them children. Read the takeaways of our investigation. https://t.co/b2abXRtzrS",
  "data/tweet-nytimes/2021/12/1472710876398604290.json": "Senator Elizabeth Warren tested positive on Sunday with a breakthrough case of the coronavirus. She wrote on Twitter that she's \"grateful for the protection provided against serious illness that comes from being vaccinated &amp; boosted.” https://t.co/N0pQnSVGdV",
  "data/tweet-nytimes/2021/12/1472646680386453509.json": "“This virus is extraordinary,” Dr. Anthony Fauci said on Sunday in reference to the Omicron variant. As Americans wrestle with whether to curtail holiday plans, Fauci said that vaccines, boosters and masks in congregate settings should protect most people. https://t.co/IEFgiEN6Ls",
  "data/tweet-nytimes/2021/12/1472688221155106816.json": "Omicron couldn’t stop Spidey. “Spider-Man: No Way Home\" had the highest opening-weekend box office of any of the franchise's live-action films and the third-highest ever for an opening weekend, making an estimated $253 million in the U.S. and Canada. https://t.co/irOh3TiWU2",
  "data/tweet-nytimes/2021/12/1472574983801090056.json": "A 5-year New York Times investigation into hidden Pentagon records shows that a pattern of errors in U.S. airstrikes in the Middle East has killed thousands of civilians, many of them children. None of these killings resulted in a finding of wrongdoing. https://t.co/EtYzxLos3f",
  "data/tweet-nytimes/2021/12/1472871344140341250.json": "Breaking News: Moderna said lab tests of its booster vaccine show it significantly raises the level of antibodies that can thwart the Omicron variant.\nhttps://t.co/Vj8LAY93YC",
  "data/tweet-nytimes/2021/12/1472584016519905289.json": "Breaking News: Senator Joe Manchin, Democrat of West Virginia, said that he could not support President Biden’s social policy bill, all but dooming Democrats' drive to pass it as written. https://t.co/pqytIYt9nj",
  "data/tweet-nytimes/2021/12/1472839234985902086.json": "For a certain subset of Millennial women, the “Lord of the Rings” film trilogy — with tender male relationships and fearless female characters — has become a treasured part of the comfort-watch genre. https://t.co/5Z0meGRCg5",
  "data/tweet-nytimes/2021/12/1472903378325975047.json": "Moderna said lab tests of its booster vaccine show it significantly raises the level of antibodies that can thwart the Omicron variant. The news comes as the variant rapidly advances across the world.\nhttps://t.co/YsUj66G2kT https://t.co/aojwGlcqh3",
  "data/tweet-nytimes/2021/12/1472527896262713344.json": "Richard Rogers, the Pritzker Prize-winning architect of the landmark Pompidou Center, whose inviting, colorful modernism forever altered the cityscapes of Paris and London, died on Saturday. He was 88. https://t.co/pnhJos16Dm",
  "data/tweet-nytimes/2021/12/1472943896523124748.json": "Breaking News: Donald Trump sued the New York State attorney general, Letitia James, seeking to halt her long-running investigation into his business practices.\nhttps://t.co/mnlub740TR",
  "data/tweet-nytimes/2021/12/1472778817496358921.json": "A New York Times investigation examines how Britney Spears’s business manager, Louise Taylor, profited from the conservatorship that Spears regarded as captivity. https://t.co/JzEfAqP0yn",
  "data/tweet-nytimes/2021/12/1472997758097408000.json": "\"I will be a president who cares for democracy and does not risk it,\" Gabriel Boric said after he was elected to be the youngest president in Chile's history. The 35-year-old is the most liberal since President Salvador Allende in the early 70s. https://t.co/DEW4g8aNab https://t.co/bijxRztHoZ",
  "data/tweet-nytimes/2021/12/1472928540513509378.json": "Airstrikes allowed America to wage war with minimal risk to its troops. But for civilians on the ground, they brought terror and tragedy. Read Part 2 of the Civilian Casualty Files in @NYTMag. \nhttps://t.co/fzB6h3TqwQ https://t.co/KuMjqBrchc",
  "data/tweet-nytimes/2021/12/1473009078867800075.json": "Tech executives and engineers are quitting Google, Meta, Amazon and other large companies for what they say is a once-in-generation opportunity with crypto. https://t.co/apksOZ5sJG",
  "data/tweet-nytimes/2021/12/1472960012402282506.json": "Feminist groups spent years defying the law in Mexico, helping thousands of women get abortions. Now that abortions are legal in Mexico, these activists are bringing their mission to the U.S. https://t.co/f9caIzU7Lp",
  "data/tweet-nytimes/2021/12/1473100947157098501.json": "Donald Trump was booed at an event in Houston after saying publicly for the first time that he had received a booster shot. He falsely claimed vaccines were dangerous for years and declined to be seen getting vaccinated against Covid-19 while in office.  https://t.co/1AjWfGl8cf",
  "data/tweet-nytimes/2021/12/1473095914365632516.json": "The Jan. 6 panel is examining whether there is enough evidence to recommend criminal referrals against Donald Trump and some of his aides. https://t.co/syUU9BEuJG",
  "data/tweet-nytimes/2021/12/1472952463821094924.json": "Pope Francis said that there was something \"almost satanic\" about the high number of women who had been victims of domestic violence. He has repeatedly called on society to protect vulnerable women at risk. https://t.co/quVwbePTi6",
  "data/tweet-nytimes/2021/12/1473080815110262797.json": "Fox Corporation, the owner of Fox News, told employees in New York City they will have to show proof that they had at least one dose of a Covid vaccine by Dec. 27, removing a weekly testing option. The policy was in keeping with the city's vaccine rule. https://t.co/d8hlmlOJR3",
  "data/tweet-nytimes/2021/12/1473121063953473536.json": "\"It was the most humiliating experience of my life.\" Haitian migrants pursued by Border Patrol agents on horseback in September have filed a lawsuit accusing the U.S. government of physical and verbal abuse, inhumane treatment and denial of due process. https://t.co/WORzF6s6jX",
  "data/tweet-nytimes/2021/12/1473143399817654284.json": "Breaking News: The N.H.L. will pause its season, postponing all games until next week due to Covid, the first North American league to do so as Omicron rises. https://t.co/rRhFQZwAX3",
  "data/tweet-nytimes/2021/12/1473143712498737152.json": "The Pentagon on Monday issued new guidelines meant to root out extremism in the U.S. military, warning that \"liking\" white nationalist and extremist content on social media and similar activities could result in disciplinary action. https://t.co/RQIwPKRT2e",
  "data/tweet-nytimes/2021/12/1473054377015455752.json": "Ethiopia’s prime minister has credited recent battlefield gains to his \"heroic\" troops. In reality, the reason for the gains was hovering in the skies above: a fleet of combat drones, recently acquired from allies in the Persian Gulf region. https://t.co/4jUynjV9Py",
  "data/tweet-nytimes/2021/12/1473148756245856256.json": "At least 132 employees at SpaceX’s Southern California headquarters tested positive for Covid, according to information posted on a Los Angeles County website. It was the highest number of cases currently reported among private companies in the county. https://t.co/vtwQPxIBbc",
  "data/tweet-nytimes/2021/12/1473284657009541124.json": "A box full of $50 and $100 bills, totaling $180,000, was sent to the physics department at City College of New York. An enclosed note from the mysterious donor asked the school to use the cash to fund scholarships for needy students.\nhttps://t.co/nrGF0GLiyk",
  "data/tweet-nytimes/2021/12/1473273314961408004.json": "“Nobody can do it for a dollar a slice anymore.”\n\nAs food prices rise at their fastest pace in decades, New York City’s dollar-slice pizza businesses are facing an existential crisis.\nhttps://t.co/G5ZQLXLG3q https://t.co/Jp5TrMb0uD",
  "data/tweet-nytimes/2021/12/1473237438290182147.json": "Breaking News: President Biden is set to unveil new steps to fight Omicron, including deploying federal vaccinators and giving out millions of free rapid tests.\nhttps://t.co/s4jh80tjSo",
  "data/tweet-nytimes/2021/12/1473333727480713226.json": "About 1,400 striking Kellogg workers have ratified a new contract, their union said Tuesday, ending a strike that began in early October and affected four of the company’s U.S. cereal plants. https://t.co/Z6UQaZTC3q",
  "data/tweet-nytimes/2021/12/1473393098361380865.json": "A box full of $50 and $100 bills, totaling $180,000, was sent to the physics department at City College of New York. An enclosed note from the mysterious donor asked the school to use the cash to fund scholarships for needy students. https://t.co/LwFKlKLJz7 https://t.co/laBQFOU07u",
  "data/tweet-nytimes/2021/12/1472899618790948865.json": "Gabriel Boric was elected president of Chile on Sunday, making the 35-year-old leftist lawmaker the country's youngest leader. He'll take office as Chile, roiled by social upheaval, completes the drafting a new Constitution. https://t.co/ZRS6QPR6Bx",
  "data/tweet-nytimes/2021/12/1473453250997374980.json": "It's still too early to know exactly how, or if, symptoms of Omicron differ from Delta, experts say. Here's what we know so far. https://t.co/GNJBhfySeY https://t.co/5JckhDKZd2",
  "data/tweet-nytimes/2021/12/1473395368171823104.json": "A billionaire from Utah, Jeff Green, said he was resigning from the Church of Jesus Christ of Latter-day Saints in an unusually high-profile rebuke of the church’s wealth and position on social issues such as LGBTQ rights and racial equality. https://t.co/ubQtIvts7F",
  "data/tweet-nytimes/2021/12/1473480931705032713.json": "Gabriel Boric rose to prominence in Chile ten years ago as a student leading rallies for free quality public education. After winning the presidency on Sunday, he is poised to oversee what may be the country's biggest overhaul in decades. https://t.co/m9N0Y5qxeI",
  "data/tweet-nytimes/2021/12/1473624402118033412.json": "A billionaire from Utah, Jeff Green, said he was resigning from the Church of Jesus Christ of Latter-day Saints in an unusually high-profile rebuke of the church’s wealth and position on social issues such as LGBTQ rights and racial equality. https://t.co/0BrZbZLpsO",
  "data/tweet-nytimes/2021/12/1473386564285874183.json": "A California man who pleaded guilty to threatening dozens of people, including members of Congress and journalists, for saying that Donald Trump had lost the 2020 election was sentenced on Monday to three years in prison. https://t.co/3yg9Gkdl10",
  "data/tweet-nytimes/2021/12/1473390344079302659.json": "Breaking News: In a White House address on Tuesday, President Biden tried to calm fears of lockdowns, outlined his Omicron plan and urged more people to get vaccinated. \"This is not March of 2020,\" he said. https://t.co/HT7l4Fg3Jd",
  "data/tweet-nytimes/2021/12/1473706447762599946.json": "Breaking News: The FDA has cleared Pfizer’s Covid pill, the first of its kind, for high-risk people 12 and over. It was found to protect against severe illness after infection. https://t.co/1JQ3XHSKD8",
  "data/tweet-nytimes/2021/12/1473710991192039432.json": "Breaking News: The Biden administration has extended the pause on student loan payments to May 1. They had been set to resume in February after being effectively frozen for nearly two years during the pandemic. https://t.co/RfX3TJv0BQ",
  "data/tweet-nytimes/2021/12/1473669662793682951.json": "The FBI set up extensive surveillance operations inside Portland’s racial justice protest movement, a New York Times investigation found. Agents stood shoulder to shoulder with activists, guiding the police toward arrests and recording clandestine video.\nhttps://t.co/nO84DCtLgZ",
  "data/tweet-nytimes/2021/12/1473735122914525191.json": "Under Democratic pressure, the White House extended a pause on student loan payments by 90 days. President Biden has resisted delivering on a campaign promise to wipe $10,000 per person and been reluctant to use executive action on sweeping forgiveness. https://t.co/jub3ae4P6c https://t.co/0OL2zl5gNY",
  "data/tweet-nytimes/2021/12/1473743927232634889.json": "Breaking News: Omicron cases seem less severe compared with previous variants, two studies suggest. But experts warned that hospitals could still be flooded because the variant is so transmissible. https://t.co/cqtd25KV1j",
  "data/tweet-nytimes/2021/12/1473805601130098697.json": "See 2021 in pictures. https://t.co/UTwdIYtBLC https://t.co/PbQL45ElOM",
  "data/tweet-nytimes/2021/12/1473714998937636875.json": "Tens of millions of Americans will be eligible for Pfizer's Covid pill if they get infected with the virus, though the federal government's supply will be limited at first. Pfizer’s studies indicate that it is likely to work against the Omicron variant. https://t.co/ojlatInkY9 https://t.co/MZ0dUsPxcN",
  "data/tweet-nytimes/2021/12/1473798063139479566.json": "We interviewed Carrie-Anne Moss, who played Trinity in \"The Matrix,\" about returning to the role years later for the new sequel: \"It was important to me that I let go of any construct in my mind that I needed to look like I did when I was 30.\" https://t.co/ysMTZKSa73",
  "data/tweet-nytimes/2021/12/1473786701743108098.json": "The House committee investigating the Capitol attack wants to interview Rep. Jim Jordan, a Republican congressman from Ohio. Jordan was deeply involved in Donald Trump's effort to fight the 2020 election results. https://t.co/2CRwOgMFOj",
  "data/tweet-nytimes/2021/12/1473801810645245959.json": "Active, physically fit men and women are more than twice as likely to be moderate or heavy drinkers as people who are out of shape, a new study found. https://t.co/xkoLk7IZ4Y",
  "data/tweet-nytimes/2021/12/1474061807258066947.json": "Breaking News: Joan Didion has died at age 87. Her sharp dispatches on California and tough, terse novels forged a distinct new voice in American writing. https://t.co/Y7Yiv18CS9 https://t.co/flsrs0cChn",
  "data/tweet-nytimes/2021/12/1474005652083204101.json": "The authorities in Hong Kong removed a statue, known as the “Pillar of Shame,” that memorialized those killed in the 1989 Tiananmen massacre. The removal of the statue, a symbol of the territory’s pro-democracy movement, is the latest crackdown on dissent.\nhttps://t.co/m1mOh3Ijfa",
  "data/tweet-nytimes/2021/12/1473990546783981574.json": "“I’ve been targeted by public security,” Li Tiantian, an outspoken teacher in rural China, told a friend in a text message before she disappeared.\n\nChinese social media has echoed for days with a question: Where is Li Tiantian?\nhttps://t.co/v6Gvz7KCzi",
  "data/tweet-nytimes/2021/12/1474066038639804424.json": "For half a century, Joan Didion, who died on Thursday, was the grand diagnostician of American disorder in essays of strong, unmistakable cadence. She wrote her first story at age 5, after her mother told her to stop whining and to write down her thoughts.https://t.co/2vf0igpboO",
  "data/tweet-nytimes/2021/12/1473771615892774925.json": "Holiday travel is happening, despite Omicron. If you want to travel responsibly, here are some strategies you can follow. https://t.co/WA0K0KeKhC https://t.co/gdpX98yRbb",
  "data/tweet-nytimes/2021/12/1474089948743622659.json": "Joan Didion was a prolific writer of stylish essays, novels, screenplays and memoirs. Here is an overview of some of her works, as reviewed in The New York Times. https://t.co/YxRUvt1CLI",
  "data/tweet-nytimes/2021/12/1474102652954894342.json": "Breaking News: Kimberly Potter, the former police officer who killed Daunte Wright after drawing her gun instead of her Taser during a traffic stop, was convicted of manslaughter. https://t.co/JqKyVqPEsr",
  "data/tweet-nytimes/2021/12/1474107598362271747.json": "Joan Didion was a generation-defining writer. \"She could not tire of telling her reader, telling herself, that luck runs out — perhaps because she never really believed it, not when there was more life to be lived,\" writes Parul Sehgal. https://t.co/huEzeSeQNx https://t.co/W31qEGrMfe",
  "data/tweet-nytimes/2021/12/1474128953380114439.json": "Kimberly Potter, the former police officer who fatally shot Daunte Wright after seeming to mistake her gun for her Taser, was convicted of two counts of manslaughter on Thursday. A judge will sentence Potter at a hearing scheduled for February. https://t.co/BzgG17WVcV https://t.co/4NE4c44BaL",
  "data/tweet-nytimes/2021/12/1473813138604793860.json": "The flu virus, which all but disappeared in early 2020, has re-emerged in the U.S. as the Omicron variant has driven up coronavirus infections and travel is expected to increase over the holidays. https://t.co/ED6CJUz23N https://t.co/prqBj3njrm",
  "data/tweet-nytimes/2021/12/1474120141030014978.json": "Joan Didion, the author of \"The Year of Magical Thinking,\" \"Slouching Towards Bethlehem\" and \"The White Album,\" to name a few, died on Thursday. She was also a prolific writer for The New York Times. https://t.co/jW5jY5WYie",
  "data/tweet-nytimes/2021/12/1474232146500161536.json": "Canada will compensate Indigenous people for the decades that many have lived with contaminated drinking water. \n\nThe government will also commit to spend at least 6 billion Canadian dollars to fund clean-up efforts on hundreds of Indigenous reserves. https://t.co/OfdmJ63uSg",
  "data/tweet-nytimes/2021/12/1473964145737445379.json": "An Australian landowner and two companies have been hit with hundreds of animal cruelty charges after a land-clearing operation last year led to the deaths of 70 koalas, an episode that one lawmaker described as a “massacre.” https://t.co/X8s4VE52qN",
  "data/tweet-nytimes/2021/12/1474115123505684484.json": "The Elf on a Shelf is not, several privacy organizations were careful to say, the biggest threat the world faces. But they fear he teaches children to passively accept constantly being watched by an unseen authority figure. https://t.co/tGWQAV9yqd",
  "data/tweet-nytimes/2021/12/1474206962455924737.json": "A Los Angeles police officer opened fire on a man who was involved in an assault at a clothing store on Thursday, and one of the shots pierced a wall, killing a 14-year-old girl in a dressing room, the police said. https://t.co/PslsmVPXXT",
  "data/tweet-nytimes/2021/12/1473854639724548097.json": "Peter Dinklage is happy to upend 100 years of clichés by playing the romantic lead. The four-time Emmy winner spoke to us about the new movie musical “Cyrano\" and life after \"Game of Thrones.\" https://t.co/zteRagLLQU",
  "data/tweet-nytimes/2021/12/1474456355163488268.json": "Hundreds of right-wing Hindu activists and monks at a conference took an oath to harm Muslims if necessary to make “a Hindu-only nation,” the most blatant and alarming example of rising anti-Muslim sentiment across India. https://t.co/uFEvcLNdqg",
  "data/tweet-nytimes/2021/12/1474484484254875662.json": "High schoolers across the U.S. have reported some of the most alarming mental health declines, evidenced by depression and suicide attempts. Adolescents have failed classes critical to their futures at higher rates than in previous years. https://t.co/oyQCKZ29By https://t.co/Q1nvy2Ebug",
  "data/tweet-nytimes/2021/12/1474450166723788803.json": "South Africa’s government, buoyed by data showing that infections from the Omicron variant aren’t as severe, has dropped quarantine restrictions for all but symptomatic people. https://t.co/gMCan4W1eo",
  "data/tweet-nytimes/2021/12/1474534119879155721.json": "Denzel Washington and Frances McDormand play a toxic power couple in Joel Coen’s crackling adaptation of \"Macbeth.\" The film is an NYT Critic's Pick. \"Every scene is a mini-master class in the craft of acting.\" https://t.co/bQV12ZRv18",
  "data/tweet-nytimes/2021/12/1474516745666928641.json": "ပြင်ပကမ္ဘာအတွက်ဆိုလျှင် ဗမာ-အိုင်ယာလန် ကပြားမိသားစုသည် မြန်မာနိုင်ငံပြုပြင်ပြောင်းလဲရေးကို  လိုလားသော အထက်တန်းစားများအဖြစ် သိကြပါမည်။ သို့သော် ထိုမိသားစုသည် ရက်စက်ကြမ်းကြုတ်သော စစ်တပ်ကို တိတ်တဆိတ် လက်နက်တပ်ဆင်ထားသည်။ https://t.co/V9DW8BrDGz",
  "data/tweet-nytimes/2021/12/1474598302838665217.json": "A wealthy family in Myanmar known for its charity work has secretly helped equip the country's brutal military and evaded Western scrutiny, an investigation by The New York Times has found. https://t.co/gNCMvItaUx",
  "data/tweet-nytimes/2021/12/1474718787656110089.json": "Breaking News: The Webb telescope, the biggest space observatory ever built, launched on its million-mile journey to the morning of time. https://t.co/1BKxlAxdt6",
  "data/tweet-nytimes/2021/12/1474749302350176256.json": "The Webb telescope, the most powerful space observatory ever built, lifted off Christmas morning. It will be orbiting the sun at a point beyond the moon, a million miles from Earth, which is way out of the reach of astronaut help. https://t.co/48NIDE89He https://t.co/fP2mcfb4qM",
  "data/tweet-nytimes/2021/12/1474409583175254017.json": "George Floyd’s murder set in motion shock waves that touched almost every aspect of American society. But on the core issues of police violence and accountability, very little has changed. https://t.co/tHx4doxW4I",
  "data/tweet-nytimes/2021/12/1474726682426810368.json": "Should birth-control pills be made available over the counter rather than requiring a prescription? This is the heart of a debate now playing out in the pharmaceutical industry and at the FDA. https://t.co/SRKQRkGgIZ",
  "data/tweet-nytimes/2021/12/1474775701576466438.json": "“Although it’s a time of great happiness and good cheer for many, Christmas can be hard for those who have lost loved ones,” Queen Elizabeth II said in her first Christmas address since the death of her husband. “This year, especially, I understand why.” https://t.co/VBgwj8SFvT",
  "data/tweet-nytimes/2021/12/1474764416084332546.json": "High schoolers across the U.S. have reported some of the most alarming mental health declines, evidenced by depression and suicide attempts. Adolescents have failed classes critical to their futures at higher rates than in previous years. https://t.co/qAHy2ab728",
  "data/tweet-nytimes/2021/12/1474787042324275210.json": "Individually, books are frequently useful or delightful, but it is when books are displayed en masse that they really work wonders. Covering the walls of a room and exuding the breath of generations, they nourish the senses, slay boredom and relieve stress.https://t.co/qp7nW8hpGX",
  "data/tweet-nytimes/2021/12/1474812197947719680.json": "An Italian factory worker was dealing with a lifelong impairment that made it hard to work, but he wasn’t in a position to retire. Then his co-workers gave him 20 months’ worth of vacation days. https://t.co/KRf4DPaUN2",
  "data/tweet-nytimes/2021/12/1474820506109059080.json": "The James Webb Space Telescope, the dreams and work of a generation of astronomers, headed for an orbit around the sun on Christmas Day. Astronomers jubilantly watched the launch remotely from all over the world, many Zooming together in their pajamas. https://t.co/mQ8RMFHDY4",
  "data/tweet-nytimes/2021/12/1474807180499034114.json": "Some unvaccinated American adults said that Omicron’s ability to infect vaccinated people only reaffirmed their decision to not get the shot. Others say the virus’s changing nature has stiffened their resolve not to get it. https://t.co/JF4OqwB6Zo https://t.co/OiFBa2G1Cf",
  "data/tweet-nytimes/2021/12/1474828564843274240.json": "A U.S. Navy ship is stranded in the port at Guantánamo Bay, Cuba, with a coronavirus outbreak among its fully vaccinated crew. https://t.co/mbDlxKXbgi",
  "data/tweet-nytimes/2021/12/1474930485432360962.json": "A new eye drop could make misplaced reading glasses less of an inconvenience for many of the 128 million Americans who suffer from age-related deficits in near vision. https://t.co/1YbaE8XksS",
  "data/tweet-nytimes/2021/12/1474938060173361154.json": "The Chinese authorities have declared war on content deemed to be \"flaunting wealth.\" Online posts by users showing off their receipts, over-ordering food or scattering money have been deemed vulgar. https://t.co/55islSlUIg",
  "data/tweet-nytimes/2021/12/1474790806737334284.json": "Instead of taking holiday vacations this weekend, hospitals workers across the U.S. are working 16-hour shifts. Some have been on the job every day for weeks. \n\n“This is the worst I’ve ever seen it,” said Maureen May, a nurse with 37 years of experience.  https://t.co/A8N5O1tlcd",
  "data/tweet-nytimes/2021/12/1475017826943574016.json": "Breaking News: Desmond Tutu has died at 90. The archbishop, whose powerful voice helped slay apartheid in South Africa, earned a Nobel Peace Prize in 1984.\nhttps://t.co/I1HjXsP5oE",
  "data/tweet-nytimes/2021/12/1474834842466537482.json": "The New York State Department of Health is urging parents to get all children who are 5 and older vaccinated, citing a jump in pediatric hospitalizations associated with the coronavirus. https://t.co/kZNu1etSUj",
  "data/tweet-nytimes/2021/12/1475114453024874497.json": "Desmond Tutu, the Nobel Peace Prize-winning archbishop and chairman of the Truth and Reconciliation Commission who helped bring down apartheid in South Africa, has died at 90. https://t.co/G06dBduqyG",
  "data/tweet-nytimes/2021/12/1475117964944941066.json": "Desmond Tutu’s legacy, many said, was one of unity and service, built on a life of campaigning for dignity for people everywhere and helping bridge divides. https://t.co/DnpUTEbxQB",
  "data/tweet-nytimes/2021/12/1475081475003502594.json": "Elijah Wood kept a pair of hairy hobbit feet in the same box they were given to him in for over 20 years, reminding him of his time in \"The Lord of the Rings\" trilogy. As he reflects on his career, he knows that to some fans, he will always be Frodo. https://t.co/FpKx688sI4",
  "data/tweet-nytimes/2021/12/1475149599207796736.json": "See 2021 in pictures: https://t.co/YdhXyxTAUQ https://t.co/PsW5qlYAn6",
  "data/tweet-nytimes/2021/12/1475198509020241924.json": "Dr. Fauci said the nation’s low vaccination rate — only 62 percent of Americans are fully vaccinated — would likely dilute the benefits of Omicron’s reduced virulence. https://t.co/lod0ZxF6cX",
  "data/tweet-nytimes/2021/12/1475164565902176261.json": "We interviewed Carrie-Anne Moss, who played Trinity in \"The Matrix,\" about returning to the role years later for the new sequel: \"It was important to me that I let go of any construct in my mind that I needed to look like I did when I was 30.\" https://t.co/wgKoaLfL4j",
  "data/tweet-nytimes/2021/12/1475182143177433092.json": "Breaking News: Wayne Thiebaud, the California-based painter known for his lush, dreamy landscapes and luminous pictures of hot dogs, deli counters, marching band majorettes and other charmed relics of midcentury Americana, has died at 101. https://t.co/sf1ab7Rssy",
  "data/tweet-nytimes/2021/12/1475204899759665153.json": "Though Desmond Tutu formally retired from public life in 2010 — promising to quietly sip tea with his wife and visit his grandchildren — he continued to advocate for what he saw as just and fair, serving as a moral compass for South Africa.  https://t.co/pEk4WCoRaO",
  "data/tweet-nytimes/2021/12/1475277784545124353.json": "Feminist groups spent years defying the law in Mexico, helping thousands of women get abortions. Now that abortions are legal in Mexico, these activists are bringing their mission to the U.S. https://t.co/YnLJ55l5iT",
  "data/tweet-nytimes/2021/12/1475367024553566210.json": "Breaking News: Jean-Marc Vallée, the Oscar-nominated director known for the critically acclaimed “Dallas Buyers Club” and TV’s “Big Little Lies,” is dead at 58. \nhttps://t.co/wLMo9wuVIr",
  "data/tweet-nytimes/2021/12/1475460720171130882.json": "Edward O. Wilson, a biologist and author who conducted pioneering work on biodiversity, insects and human nature, has died at 92. https://t.co/o0cRtnu62F",
  "data/tweet-nytimes/2021/12/1475391028693807108.json": "One of the easiest ways to upgrade your mask protection is to wear two at the same time, health experts say. Here are answers to common questions about double masking. https://t.co/M3lmTZ19qc",
  "data/tweet-nytimes/2021/12/1475360826878005249.json": "Active, physically fit men and women are more than twice as likely to be moderate or heavy drinkers as people who are out of shape, a new study found. https://t.co/q4Fbwcqipw",
  "data/tweet-nytimes/2021/12/1475330631768936448.json": "Peter Dinklage is happy to upend 100 years of clichés by playing the romantic lead. The four-time Emmy winner spoke to us about the new movie musical “Cyrano\" and life after \"Game of Thrones.\" https://t.co/4OnW9Mm3op",
  "data/tweet-nytimes/2021/12/1475251347591254018.json": "Witnessing Desmond Tutu get singled out for a body search at the airport in 1986, our reporter saw his singular resilience, and humor. https://t.co/QyrERYy6ZF",
  "data/tweet-nytimes/2021/12/1475514327084023815.json": "A Harvard professor for 46 years, Edward O. Wilson, was an expert on insects and explored how natural selection and other forces could influence animal behavior. He then applied his research to humans and pioneered new fields of research. https://t.co/EXINE3hWBj https://t.co/j08LE3tks8",
  "data/tweet-nytimes/2021/12/1475535725072465924.json": "Thousands more flights were canceled on Monday as Omicron surged. Dr. Anthony Fauci said a vaccine mandate for air travel should be considered. https://t.co/QgL8wR6jjf",
  "data/tweet-nytimes/2021/12/1475592315603410945.json": "Breaking News: The CDC halved the recommended coronavirus isolation period to five days, saying that infected Americans without symptoms could safely resume mixing with others with masks five days after their positive test results. https://t.co/hSIOxCGET7",
  "data/tweet-nytimes/2021/12/1475632635619811330.json": "Sarah Weddington was just 26 years old when she successfully argued Roe v. Wade before the Supreme Court, leading to the legalization of abortion throughout the U.S.\n\nShe died on Sunday at her home in Austin, at age 76. https://t.co/CnRUe4iofP",
  "data/tweet-nytimes/2021/12/1475652731415187458.json": "A federal judge on Monday ordered New York City officials to install over 9,000 signal devices at intersections to help visually impaired pedestrians more safely cross streets, marking a significant advancement for disability rights. https://t.co/iBDPMnsXTl",
  "data/tweet-nytimes/2021/12/1475642679610458123.json": "Crews removing the pedestal of a Robert E. Lee statue in Richmond, Virginia, on Monday found what appeared to be a time capsule that may contain rare memorabilia buried in 1887. https://t.co/SFxotD3KfK",
  "data/tweet-nytimes/2021/12/1475597391176900608.json": "The new CDC guidance was announced as the highly transmissible Omicron variant is sending daily caseloads higher, worsening a labor shortage and forcing airlines to cancel thousands of flights. https://t.co/NEDsa0eOpb https://t.co/ww2skGhZdu",
  "data/tweet-nytimes/2021/12/1475506780230885377.json": "A Carnival Cruise Line ship returned to Miami on Sunday after multiple people onboard tested positive for the coronavirus, the cruise line said. It was the latest Florida-based cruise to be disrupted as the Omicron variant drives up cases. https://t.co/c1poqDbaiF",
  "data/tweet-nytimes/2021/12/1475768558944755713.json": "\"Marriage requires amnesia, a mute button, a filter on the lens, a damper, some blinders, some bumpers, some ear plugs, a nap,\" writes Heather Havrilesky for @NYTStyles. https://t.co/Et6EitZgh2",
  "data/tweet-nytimes/2021/12/1475557132481224715.json": "Davyon Johnson, 11, has been honored for his Dec. 9 interventions but says he doesn’t understand the attention he’s drawn. It was “the right thing to do,” he said. https://t.co/qwMqb9jYMi",
  "data/tweet-nytimes/2021/12/1475657788441387009.json": "President Biden signed a nearly $770 billion defense bill on Monday, $24 billion more than he had requested, in a setback for liberals whose efforts to expand social spending have been blocked by Democratic moderates in the name of fiscal responsibility. https://t.co/iMan12FXP1",
  "data/tweet-nytimes/2021/12/1475856624447365121.json": "The CDC decision to cut the number of days that infected Americans should remain isolated from 10 to five was welcomed by business representatives. But a union leader warned that workers may feel pressure to return to their jobs too soon. https://t.co/X6EfrBIaLN https://t.co/yGs6bPUg1J",
  "data/tweet-nytimes/2021/12/1475854072993484801.json": "An Australian teenager who kept partying at a nightclub despite being notified that he had tested positive for the coronavirus faces a maximum penalty of two years in jail or a fine of about $14,500. More than 100 people at the club were forced to isolate. https://t.co/5mRlprID7J",
  "data/tweet-nytimes/2021/12/1475921576117915654.json": "Breaking News: The CDC has lowered its estimate of Omicron’s prevalence in the U.S. — Delta, not Omicron, was the dominant variant during the week ending in Dec. 18. The update shows how poorly the agency has communicated its uncertainty, experts say. https://t.co/lRfmHC8MSJ",
  "data/tweet-nytimes/2021/12/1475864141164429314.json": "A tax break intended for small businesses has been contorted into the latest tax dodge by Silicon Valley’s ultrawealthy. Early investors in companies have each been able to avoid taxes on at least $10 million in profits.\nhttps://t.co/MMjzFAH56q",
  "data/tweet-nytimes/2021/12/1475869169501544448.json": "Nearly a quarter million people in the U.S. have died from Covid in the past eight months. Covid is responsible for a higher share of deaths from all causes for younger Americans and white Americans than it was before all adults were eligible for vaccines. https://t.co/aHWaNEjkiS",
  "data/tweet-nytimes/2021/12/1475852478897872901.json": "Breaking News: New York City will eliminate its current policy of quarantining entire classrooms exposed to Covid, and will instead use a ramped-up testing program to allow asymptomatic students who test negative for the coronavirus to remain in school. https://t.co/qMyxM2d4NK",
  "data/tweet-nytimes/2021/12/1475988046466142211.json": "Breaking News: John Madden, the Hall of Fame football coach who became one of the most recognized ambassadors of the sport, died on Tuesday. He was 85. https://t.co/uBbon2nKip",
  "data/tweet-nytimes/2021/12/1475972379335614464.json": "The death of 17-year-old Cedric Lofton, who lost consciousness after he was handcuffed while lying facedown at a county juvenile center in Kansas, was ruled a homicide by a medical examiner. https://t.co/eirXZxjEq5",
  "data/tweet-nytimes/2021/12/1476003062825238528.json": "Breaking News: Harry Reid, the Democrat from Nevada who helped steer the Affordable Care Act to passage as Senate majority leader, died on Tuesday. He was 82. https://t.co/MTzW28MSB8",
  "data/tweet-nytimes/2021/12/1475937122519560194.json": "The coronavirus is now responsible for a higher share of deaths from all causes for younger Americans and white Americans than it was before all adults were eligible for vaccines. Here’s why death rates are rising for some groups. https://t.co/t5DuOMhNXE",
  "data/tweet-nytimes/2021/12/1475909439194607619.json": "How do you rewrite a constitution for the climate change era? Chile is the world’s first country to try. https://t.co/hqamgTziOE",
  "data/tweet-nytimes/2021/12/1475983691444887552.json": "People who have recovered from an infection with the Omicron variant may be able to fend off later infections from the Delta variant, a new study suggests. If further experiments confirm the findings, they could suggest a less dire future for the pandemic. https://t.co/iUuZlNwuaq",
  "data/tweet-nytimes/2021/12/1476070551580037123.json": "John Madden, the legendary Hall of Fame coach, prolific broadcaster and NFL ambassador, died on Tuesday. He was 85. https://t.co/oEgi5ji8pS https://t.co/w1Qb2wwD4O",
  "data/tweet-nytimes/2021/12/1475992470173503499.json": "A new study of a cluster of Covid cases in one household in early December suggests that Omicron may have a shorter incubation period than previous variants: about 72 hours. https://t.co/0GEgHEAotE",
  "data/tweet-nytimes/2021/12/1475934650312843274.json": "Masks work best when everyone in the room has one on, but you’ll still benefit from masking up even when those around you aren’t. Here's what the evidence shows. https://t.co/WRkEjVpeOz",
  "data/tweet-nytimes/2021/12/1476028972291002369.json": "The Hong Kong police on Wednesday arrested six current or former senior staff members of Stand News, an outspoken pro-democracy news website. They were arrested on suspicion of conspiring to publish seditious material, the police said. https://t.co/lpIhEidI9D",
  "data/tweet-nytimes/2021/12/1476130902220677124.json": "How do you rewrite a constitution for the climate change era? Chile is the first country in the world to try. https://t.co/i56ZhHFvHA https://t.co/3wIKaN0K2Q",
  "data/tweet-nytimes/2021/12/1476161106750185477.json": "Alaska recorded a temperature of 67-degrees Fahrenheit the day after Christmas. It was a statewide record for December. https://t.co/CRn47213JK",
  "data/tweet-nytimes/2021/12/1476172404556718081.json": "Hundreds of Hong Kong police officers arrested seven people connected to Stand News, a pro-democracy news site, and raided their headquarters in yet another crackdown on the city’s independent press. https://t.co/kahZqjzuVz",
  "data/tweet-nytimes/2021/12/1476168375004975105.json": "During a recent session in the House, two Republican lawmakers from Georgia, Marjorie Taylor Greene and Andrew Clyde, sat in full view of TV cameras. Neither was wearing a mask.\n\nTo date, the two have incurred more than $100,000 combined in fines. https://t.co/u85Yr3MGy9",
  "data/tweet-nytimes/2021/12/1476010127870283780.json": "How do you rewrite a constitution for the climate change era? Chile is the world’s first country to try. https://t.co/rUx8SHZAq4",
  "data/tweet-nytimes/2021/12/1476315639627370507.json": "Breaking News: Ghislaine Maxwell was convicted on all but one charge of helping to recruit, groom and sexually abuse underage girls for Jeffrey Epstein. https://t.co/ByPayop4dj",
  "data/tweet-nytimes/2021/12/1476321754519851012.json": "Ghislaine Maxwell was convicted on all but one charge of helping to recruit, groom and sexually abuse underage girls for Jeffrey Epstein. https://t.co/sUX6aQoN3J https://t.co/Dw2qJdKBOJ",
  "data/tweet-nytimes/2021/12/1476332219312574464.json": "Ghislaine Maxwell, who is 60 years old, now faces decades in prison. The most serious count on which she was convicted was sex trafficking of a minor, which carries a maximum sentence of up to 40 years in jail. https://t.co/t0C23PqENS",
  "data/tweet-nytimes/2021/12/1476021963080491013.json": "Breaking News: The U.S. is averaging 267,000 daily coronavirus cases, according to a New York Times database. The record comes as two highly contagious variants — Delta and Omicron — converge and threaten to overwhelm hospitals. https://t.co/8TVaNChvof",
  "data/tweet-nytimes/2021/12/1476357395689488389.json": "One of the most gerrymandered political maps in the country has suddenly been replaced by one of the fairest. Here’s how Michigan did it. https://t.co/TqeUcnvZiR",
  "data/tweet-nytimes/2021/12/1476422810595737601.json": "Alaska recorded a temperature of 67-degrees Fahrenheit the day after Christmas. It was a statewide record for December. https://t.co/O0aJmGEDhJ",
  "data/tweet-nytimes/2021/12/1476465524913717249.json": "Ghislaine Maxwell, who is 60 years old, now faces decades in prison. The most serious count on which she was convicted was sex trafficking of a minor, which carries a maximum sentence of up to 40 years in jail. https://t.co/9nAsbq90g5",
  "data/tweet-nytimes/2021/12/1476414011004624900.json": "A man who worked for a cleaning service at the Naples Zoo in Florida was seriously injured Wednesday when a tiger bit his arm after he went into a restricted area and reached into the animal’s enclosure, the authorities said. The tiger was shot and killed. https://t.co/sqB8Lnl4am",
  "data/tweet-nytimes/2021/12/1476561274574098433.json": "Surprise medical bills, issued by a doctor that a patient did not choose and who did not accept the patient's insurance, will be made illegal by a law that goes into effect on Saturday. https://t.co/JV2BFWU1vF",
  "data/tweet-nytimes/2021/12/1476062954344824837.json": "The CDC's decision to cut the isolation period for people infected with the coronavirus from 10 days to five has worried some experts who say without a testing requirement, the guidelines may mean infected people leave isolation while still contagious. https://t.co/KYYWLGmmzq",
  "data/tweet-nytimes/2021/12/1476504254676455424.json": "Breaking News: Johnson &amp; Johnson’s booster shot offered strong protection against Omicron and reduced the risk of hospitalization, a clinical trial found. https://t.co/LdGPoPHfXV",
  "data/tweet-nytimes/2021/12/1476595347271081990.json": "Breaking News: The FDA is expected on Monday to allow boosters of Pfizer’s Covid vaccine for 12- to 15-year-olds, according to people familiar with the U.S. health agency's deliberations. https://t.co/fBegYkGuvD",
  "data/tweet-nytimes/2021/12/1476404274229878785.json": "The number of coronavirus cases recorded in the U.S. may still fall short of describing the true destruction caused by the Delta and Omicron variants because testing has slowed over the holidays. https://t.co/b5CWJkZNZy https://t.co/3lq9vxC6dg",
  "data/tweet-nytimes/2021/12/1476165129662345218.json": "Hundreds of thousands of New Yorkers from a myriad of faiths use part of their home as a sacred space.\n\nSome practice their religion. Some meditate. Some simply offer thanks for a new day. https://t.co/Qgs086Gq93 https://t.co/fjktSha5yo",
  "data/tweet-nytimes/2021/12/1476352597330169857.json": "Health officials are considering redefining what it means to be “fully vaccinated” as Omicron spreads and the need for boosters rises. https://t.co/MSbn1pixia",
  "data/tweet-nytimes/2021/12/1476642500341374985.json": "Breaking News: The CDC raised its Covid warning for cruise ships to the highest level and added a blunt warning: Don’t board one. https://t.co/ljWwUOuEGl",
  "data/tweet-nytimes/2021/12/1476612901213515776.json": "Breaking News: A jury on Thursday found an opioid manufacturer and distributor liable for inundating New York with pills that killed thousands of people. The case was the first of its kind, targeting every point of the prescription opioid supply chain. https://t.co/CVkxo77gBW",
  "data/tweet-nytimes/2021/12/1476676232007802887.json": "Breaking News: South Africa said health data suggested its Omicron peak had passed with no major spike in deaths, offering cautious hope to other countries. https://t.co/rCto7nPHg8",
  "data/tweet-nytimes/2021/12/1476651839357689860.json": "When Alan Dershowtiz appeared in a BBC segment about the Ghislaine Maxwell verdict, it was not made clear that Dershowitz helped defend Jeffrey Epstein and has himself been accused of abuse by one of Epstein’s accusers — an accusation he denies. https://t.co/hC4AqtbIxw",
  "data/tweet-nytimes/2021/12/1476644283218341888.json": "A Pennsylvania state trooper has fatally shot four people in separate incidents since 2007, an extraordinary tally for an officer responsible for patrolling largely rural areas with low rates of violent crime. Trooper Jay Splain remains on duty. https://t.co/fjHIwqXwVS",
  "data/tweet-nytimes/2021/12/1476708448700190729.json": "When Amy Schneider was an eighth grader, her fellow students voted her most likely to appear on “Jeopardy!” They underestimated her. On Wednesday, she won her 21st “Jeopardy!” game in a row, bringing her total earnings to $806,000. https://t.co/W4zgmAxRZS",
  "data/tweet-nytimes/2021/12/1476661893725048840.json": "AirTags, the small location-tracking discs, may be abetting a new form of stalking, posing a \"uniquely harmful\" threat given the ubiquity of Apple’s products. Privacy groups warned against this concern when Apple introduced the devices in April. https://t.co/PjMtDXXnY2 https://t.co/yRb9bKQM0X",
  "data/tweet-nytimes/2021/12/1476523532393889800.json": "The James Webb Space Telescope tells a story of international cooperation rarely heard these days. It's a tale of nations coming together for a common ambition: to reach the most distant stars and galaxies. https://t.co/T0YOVVNf9P",
  "data/tweet-nytimes/2021/12/1476761297861718018.json": "Ben McFall was the longest-tenured bookseller in the history of the Strand, New York’s renowned bookstore. He has died at age 73. https://t.co/T1NpDJtdHN"
}