{
  "data/tweet-economist/2022/2/1488796391187091458.json": "For the past few months our data team has been building a model to calculate the probability of victory at the 🇫🇷 presidential election. It went live today. 🚨these are not polls! \nResults Feb 2:\n\nMacron 79%\nPécresse 11%\nLe Pen 8%\nZemmour 1%\nMélenchon 1%\n\nhttps://t.co/U5c1wyxQxM",
  "data/tweet-economist/2022/2/1494363684080164865.json": "This week's column: the British state is getting more costly and providing less https://t.co/m0rXNU1Pxx",
  "data/tweet-economist/2022/2/1496845737530851330.json": "Stephen Hadley, Bush's former NSA, told us about his concerns around Kaliningrad: “If Putin succeeds in Ukraine, he might decide that he needs a land bridge to link Kaliningrad to Belarus and then Russia...through Lithuania or Poland”. https://t.co/2CklcX56eL",
  "data/tweet-economist/2022/2/1496652418175676421.json": "My latest in the @TheEconomist on the risk of escalation in the Russia-Ukraine war\n\nhttps://t.co/CTaHFYxDyu",
  "data/tweet-economist/2022/2/1496902814097977344.json": "Reported Russian strikes in Ukraine - 16:00 GMT\nhttps://t.co/l26BsB8gWe https://t.co/hajCzbxtP9",
  "data/tweet-economist/2022/2/1497089477545762817.json": "The Biden administration accurately predicted Putin's bloody invasion of Ukraine and the bogus pretexts he would offer for it months ago. Its effort to preempt and counter Russian disinformation has been excellent. My column: https://t.co/0cJlC7WoeD",
  "data/tweet-economist/2022/2/1497835840864759812.json": "My thoughts on day three, with a focus on the urban warfare that likely lies ahead. \"The scale of fighting in Kyiv could compare to Grozny, warns @antbruceking, referring to the terrible damage that befell the Chechen capital—a far smaller city than Kyiv\" https://t.co/qtHeVabbjc",
  "data/tweet-economist/2022/2/1498019563946102788.json": "“The West’s deployment of this economic weapon will also be watched with slack-jawed shock in China, which has $3.4trn of reserves and which will now be rethinking how to resist Western pressure in the event of a war over Taiwan.” https://t.co/A82N4wZ3V5",
  "data/tweet-economist/2022/2/1498045256633401349.json": "My piece on Putin's order to move nuclear forces to a \"special mode of combat duty\". In peacetime Russia's command system can't transmit launch orders. Raising alert is \"connecting the wires, so if a launch order is issued it can go through”—@russianforces https://t.co/nT6NXiHOyQ"
}