{
  "data/tweet-stocks/2022/3/1498453260788813829.json": "69/ New satellite imagery shows that the Russian convoy heading toward Kyiv (ref. tweets 60, 62 and 64) is actually 40 miles long, stretching from Prybirsk to Antonov Airport.\n\nSome homes near Ivankiv along the convoy route are shown burning.\n\n📸: @Maxar https://t.co/3tpZlgHsr7",
  "data/tweet-stocks/2022/3/1498527194355847169.json": "Russian commercial cargo aircraft seemed to violate the EU airspace closure. Landing in Slovakia now. https://t.co/0yckAE5lYt",
  "data/tweet-stocks/2022/3/1498526718658809858.json": "This is Very Unusual a Ilyushin Il-76TD “VI5956” Operated by Volga-Dnepr Airlines a Russian Cargo Transport Company that is Currently banned from EU Airspace is currently Cruising over Poland from Moscow heading South, there are Unconfirmed Reports she has been intercepted. https://t.co/KONAKzBMPG",
  "data/tweet-stocks/2022/3/1498687867895361539.json": "The new NLAW and Javelin systems arrived in #Ukraine. Thank you! https://t.co/gAnT6a07ZG https://t.co/zKLbfSXxjV",
  "data/tweet-stocks/2022/3/1498687459340791809.json": "Lukashenko, addressing his security council, points to a map of Ukraine that shows what look like planned troop movements, infrastructure targets, and the country divided into four parts https://t.co/O81hpIvZM3",
  "data/tweet-stocks/2022/3/1498579798402158596.json": "Maersk, one of largest transport companies, temprarily suspends Russia bookings. Company controls 17% of world’s container fleet.",
  "data/tweet-stocks/2022/3/1498752669879619589.json": "UKRAINE PRESIDENT SAYS BIDEN TOLD ME IT WASN'T TIME YET TO INTRODUCE NO FLY ZONE",
  "data/tweet-stocks/2022/3/1498914881243918339.json": "A Russian helicopter violated our territorial airspace over Nemuro Peninsula this morning.",
  "data/tweet-stocks/2022/3/1499154183307595778.json": "I am now finally a part of the Ukrainian foreign legion. From Finnish reservist Lt. to UA recruit. People from all over the world have come here to help to defend Ukraine. My bunkmates are Norwegian and American. There is still plenty of room for more!\n#Ukraine #StandWithUkraine https://t.co/kYh46gH4Mv",
  "data/tweet-stocks/2022/3/1499234135998672897.json": "Финляндия и Швеция, не входящие в НАТО, получили письма Кремля с требованием предоставить РФ гарантии безопасности"
}