{
  "data/tweet-economist/2021/3/1366203699694100483.json": "A recent report suggested that, owing to the spread of a more transmissible variant of the virus, immediately relaxing social distancing in America could cause a vicious surge in cases https://t.co/7NZjrfZbCk",
  "data/tweet-economist/2021/3/1366234934197772291.json": "Although America’s decentralised system has in some ways helped it through the pandemic, the sprawling education system has been exposed by it https://t.co/4NTHQ9zhc9",
  "data/tweet-economist/2021/3/1366256025859407872.json": "McKinsey’s partners see themselves as missionaries. Yet they are also mercenaries— “guns for hire” https://t.co/w4zLWWp2R1",
  "data/tweet-economist/2021/3/1366287943451697154.json": "While in limbo over Brexit, British pig firms are still waiting for certification in China. Meanwhile the pigs are growing porkier, and less valuable, by the day https://t.co/cHW0qcPZnm",
  "data/tweet-economist/2021/3/1366327355350859776.json": "Indoor \"vertical\" farms could provide fresh food to millions of people. https://t.co/Mrd4Dufyjz https://t.co/67gpnA3Fun",
  "data/tweet-economist/2021/3/1366300090575556609.json": "South-East Asia is home to 700m people. Its economy, if it were a single country, would be the fourth-biggest in the world https://t.co/xahhkBIZcL",
  "data/tweet-economist/2021/3/1366328349619064835.json": "RT @ItsRachelDobbs: There’s a concerted push to make “ecocide”—the destruction of the environment—punishable by the International Criminal…",
  "data/tweet-economist/2021/3/1366376443576520704.json": "Four crimes are punishable by the International Criminal Court. There is a push to make  “ecocide” the fifth https://t.co/olPfLIhEIP",
  "data/tweet-economist/2021/3/1366272641892515848.json": "“The World for Sale” asks how so few firms, owned by a tiny number of people, were able to grab such a hold on global commodity-trading with so little oversight https://t.co/YTrhoYG68d",
  "data/tweet-economist/2021/3/1366403365744365573.json": "In all, 174 people, including 16 politicians, were found guilty, and 26bn reais ($5bn) was recovered for public coffers https://t.co/DAquqJSIAI",
  "data/tweet-economist/2021/3/1366252239120183297.json": "Hydrogen goop is unlikely to upend the clean-car industry. But Marcus Vogt's invention may find other niches https://t.co/6lbxX7VfB9",
  "data/tweet-economist/2021/3/1366437159184568321.json": "A group of international lawyers including Philippe Sands will publish a draft definition of ecocide in June https://t.co/XPT50nqC4n",
  "data/tweet-economist/2021/3/1366335238318809088.json": "Grammar-checking computers illustrate not how bad humans are with language, but just how good https://t.co/cdFuhUQEsb",
  "data/tweet-economist/2021/3/1366412434815283201.json": "Some marine biologists wonder if the killer whale's arrival in great white territory is a consequence of human activity https://t.co/j2lDpVjeKo",
  "data/tweet-economist/2021/3/1366513642276089856.json": "A court in Paris has found Nicolas Sarkozy, a former centre-right French president, guilty of corruption and influence-peddling https://t.co/xbDSdvXLSf",
  "data/tweet-economist/2021/3/1366527456337940480.json": "If ecocide becomes an international crime, it will mark a turning-point in how the relationship between humans and the natural world is understood https://t.co/I1VEVGLUGx",
  "data/tweet-economist/2021/3/1366545680882368513.json": "Adam Kinzinger is in his political prime with everything to lose, making his criticism of Donald Trump even more remarkable  https://t.co/Bb2YZdMoJe",
  "data/tweet-economist/2021/3/1366260215512002561.json": "China’s high-speed railways are a spectacular economic achievement. Their impact on society may prove as dramatic https://t.co/Op3k1lefsv",
  "data/tweet-economist/2021/3/1366558495550676993.json": "Wonder where the vanilla in your ice cream comes from? Last year @1843mag went to Madagascar and found the bitter truth https://t.co/Xe8WhK4f52",
  "data/tweet-economist/2021/3/1366589924061904899.json": "How Britain decarbonised faster than any other rich country https://t.co/l3fykuik9T",
  "data/tweet-economist/2021/3/1366608769346592768.json": "Adam Kinzinger says he regrets voting for Donald Trump, is glad Joe Biden won and advocates sweeping Republican reform https://t.co/Dpkx26sWA6",
  "data/tweet-economist/2021/3/1366604185626681344.json": "McKinsey’s partners see themselves as missionaries. Yet they are also mercenaries— “guns for hire” https://t.co/vRWtgssbKe",
  "data/tweet-economist/2021/3/1366618290165067780.json": "Ecocide could be defined by the need to protect ecosystems as an end in themselves, regardless of how they interact with humans  https://t.co/Wm0qClAfRD",
  "data/tweet-economist/2021/3/1366613327582027776.json": "Nicolas Sarkozy was sentenced to three years in prison, two of them suspended, for corruption and influence-peddling  https://t.co/2gCWWco69c",
  "data/tweet-economist/2021/3/1366626604458389505.json": "Over a century ago, Nikola Tesla tried and failed to make his vision of wireless power transmission a reality. Now, the idea is making a comeback https://t.co/AI90cacxlx",
  "data/tweet-economist/2021/3/1366636335994437641.json": "New research could shed light on why some countries or populations appear to have been hit harder by covid-19 than others https://t.co/6qOzJviZux",
  "data/tweet-economist/2021/3/1366622746784980992.json": "America’s creaking infrastructure is partly to blame for the recent surge in blackouts https://t.co/VT8TRlU0I7",
  "data/tweet-economist/2021/3/1366645298106421248.json": "White evangelicals are the bedrock of the Republican Party in America https://t.co/fpKT9nCuMQ",
  "data/tweet-economist/2021/3/1366585812754829313.json": "Madonna made music history in 2005 by releasing her single “Hung Up” as a ringtone before it was aired on the radio. But what happened to the lucrative ringtone market? @1843mag investigates https://t.co/ZS5QmPLjR1",
  "data/tweet-economist/2021/3/1366706550446956546.json": "Even if the definition of ecocide is adopted by the International Criminal Court, it will not prevent it occurring. But it could help set norms for acceptable behaviour https://t.co/QSGedaKxqu",
  "data/tweet-economist/2021/3/1366735065397477380.json": "As news from Ethiopia’s Tigray region emerges, claims of war crimes are mounting. On “The Intelligence” @TomGardner18 unpicks an increasingly complex civil war https://t.co/lR3rcNtdBp",
  "data/tweet-economist/2021/3/1366711400144510988.json": "America’s energy infrastructure is ageing—some 70% of large power transformers and transmission lines are at least 25 years old and 60% of circuit breakers are 30 years or older https://t.co/eyD0lztzGw",
  "data/tweet-economist/2021/3/1366822873449574403.json": "Kim Jong Un brought a portable toilet to a North Korea-US summit, apparently to prevent his faeces being collected and analysed by a rival intelligence service https://t.co/2roo6lgsFx",
  "data/tweet-economist/2021/3/1366744612463915013.json": "“The United States is not Russia's geopolitical enemy,” Fiona Hill tells @AnneMcElvoy. So why does Russia continue to see America as a threat? Listen to “The Economist Asks” https://t.co/X443iROI30",
  "data/tweet-economist/2021/3/1366826436435263501.json": "In its battle against corruption Latin America is almost back to square one https://t.co/BdUjaIG4r2",
  "data/tweet-economist/2021/3/1366810623909191686.json": "As news from Ethiopia’s Tigray region emerges, claims of war crimes are mounting. On “The Intelligence” @TomGardner18 unpicks an increasingly complex civil war https://t.co/EBPmDmzs4g",
  "data/tweet-economist/2021/3/1366820387766550536.json": "The EU may introduce a vaccine passport called a Digital Green Pass which would allow inoculated citizens to travel more freely. Our Special report looks at how travel will resume after the pandemic https://t.co/5hr7Urcmcs",
  "data/tweet-economist/2021/3/1366599741794971648.json": "Eugen Sandow was the Victorian who figured out how to make fitness appealing. His celebrity fans included King George V and Arthur Conan Doyle https://t.co/xGGHqnn00e",
  "data/tweet-economist/2021/3/1366934328714924035.json": "Encouraging results from UBI trials could lend support to policies with similar features, such as universality, or a relaxed approach to work incentives https://t.co/8k2ftXEs7O",
  "data/tweet-economist/2021/3/1366896956417708036.json": "Automated grammar-checkers struggle with sentences that are difficult to analyse, precisely because they are ungrammatical https://t.co/DfL4MylcqW",
  "data/tweet-economist/2021/3/1366815557312479238.json": "Between 2015 and 2020 the number of far-right attacks around the world more than tripled, according to a UN report https://t.co/bU92v4PrOc",
  "data/tweet-economist/2021/3/1367037579011440644.json": "The great inflation mystery: why has it remained stubbornly low? https://t.co/fLNBwK2l90 https://t.co/QPo19CubH6",
  "data/tweet-economist/2021/3/1366939657989218305.json": "Some argue that the term “evangelical” has changed from a theological term to a sociological and political one  https://t.co/tANiTtwgKP",
  "data/tweet-economist/2021/3/1367097461693644801.json": "Four crimes are punishable by the International Criminal Court. There is a push to make “ecocide” the fifth https://t.co/st8gNpUWnl",
  "data/tweet-economist/2021/3/1366944878668754945.json": "When it comes to artificial intelligence, spy agencies have been at it longer than most https://t.co/fMnt6NwH6w",
  "data/tweet-economist/2021/3/1367113297686913028.json": "Lava Jato showed that there are effective ways to take on grand corruption. But this progress hasn't been consolidated into greater judicial independence https://t.co/ssOrKNWVNL",
  "data/tweet-economist/2021/3/1367011280050147328.json": "The homes of high-income workers are often big enough to feature home offices, making the switch to remote work minimally onerous  https://t.co/OBq3xq9anK",
  "data/tweet-economist/2021/3/1367150464253521920.json": "Remote work allows firms to push real-estate costs onto their employees https://t.co/1zHuvTaORp",
  "data/tweet-economist/2021/3/1367245659238109184.json": "A recent paper estimates that firms would have to pay low-income remote workers an extra 10-15% to compensate them for their increased housing costs https://t.co/10NbPBNFFm",
  "data/tweet-economist/2021/3/1367287925688393733.json": "El Salvador's millennial president is incredibly popular. But his unprecedented power worries critics https://t.co/61kt7ytdi4",
  "data/tweet-economist/2021/3/1367346956339675136.json": "The testimonies in “Billie” make clear that singing was a balm for Holiday as she grappled with the effects of childhood trauma https://t.co/uwahaiwYqP",
  "data/tweet-economist/2021/3/1367399458284175362.json": "Corruption costs the world nearly $3 trillion every year and blights the lives of hundreds of millions of people. What can be done to tackle it? Supported by @EYnews https://t.co/7BuEqbx0qI",
  "data/tweet-economist/2021/3/1367422403941384194.json": "Immediately after the US Capitol was invaded, German extremist chatter was full of calls to storm the Reichstag  https://t.co/kRn4Wu8tuy",
  "data/tweet-economist/2021/3/1367448582962438151.json": "Eight minutes after successfully returning to its landing pad, SN10 blew up. But the Starship programme is making real progress towards creating a fully reusable launch system https://t.co/hTvwuZGnDA",
  "data/tweet-economist/2021/3/1367453546120159233.json": "Where is the best place to be a working woman? Our latest glass-ceiling index has the answer https://t.co/41Re8nczO8",
  "data/tweet-economist/2021/3/1366678631439880192.json": "The life and lies of an unrepentant double-agent https://t.co/oTqkW3bJBQ",
  "data/tweet-economist/2021/3/1367496587275075589.json": "The lesson of Fukushima is not to eschew nuclear power, it is to use it wisely https://t.co/heTWAJcDON",
  "data/tweet-economist/2021/3/1367494309625417729.json": "Out of 29 countries, South Korea is the worst place to be a working woman, according to the latest glass-ceiling index from The Economist  https://t.co/oZeQD3f6sx",
  "data/tweet-economist/2021/3/1367491733764898819.json": "Nuclear power is an essential weapon in the fight against climate change. The lesson of Fukushima is not to eschew nuclear power, it is to use it wisely. Our cover in Asia this week https://t.co/eCwRMfUMmz https://t.co/wn23y1Lunh",
  "data/tweet-economist/2021/3/1367535329973047301.json": "After the Fukushima disaster, talk of a \"nuclear renaissance\" fell silent. But nuclear power is an essential weapon in the fight against climate change https://t.co/94mFL6alsq",
  "data/tweet-economist/2021/3/1367471669665792000.json": "Governments have a chance to create a new social safety net for the post-covid world—they must seize it. Our cover this week https://t.co/vaXnyQDoVG https://t.co/YIuGks5AGo",
  "data/tweet-economist/2021/3/1367586667037614081.json": "\"Do your best\", she always said. Love what you do. Be constantly curious. And learn that it is not dumb to ask a question. Our obituary for the mathematician from 2020 #IWD2021 https://t.co/KkHf6vklDh",
  "data/tweet-economist/2021/3/1367468123515936770.json": "As usual, Nordic countries performed best overall in the latest glass-ceiling index from The Economist, with Sweden, Iceland, Finland and Norway taking the top four spots https://t.co/crrctBlbtW",
  "data/tweet-economist/2021/3/1367632234900041728.json": "Safe and productive nuclear power plants are being closed across the world. But to hasten their decline is to wilfully hobble the world in the greatest environmental struggle of all https://t.co/KVrD69A75j",
  "data/tweet-economist/2021/3/1367428238700593153.json": "Machine learning is good at spotting patterns but poor at predicting individual behaviour, especially when data is scarce—such as in counter-terrorism   https://t.co/9KJ6Gaivfe",
  "data/tweet-economist/2021/3/1367694274809262085.json": "Western governments wanting to tackle the climate crisis should give more thought to nuclear power  https://t.co/K11WwLF06Q",
  "data/tweet-economist/2021/3/1367725782953582593.json": "Why spaghetti bolognese doesn’t exist in Italy https://t.co/uIEscmJZHf From @1843mag",
  "data/tweet-economist/2021/3/1367568296783073292.json": "We're hiring for two paid fellowships in America. Successful applicants will write articles about politics and policy in the United States https://t.co/eohg72Q9J5",
  "data/tweet-economist/2021/3/1367766294997708802.json": "Nuclear power cannot simply be wished away. It has a vital role to play in the fight for a stable climate https://t.co/A5Buk6FHrW",
  "data/tweet-economist/2021/3/1367656798665248772.json": "The pope is heading for Iraq, where Christians remain afraid https://t.co/G5ceY3mq18",
  "data/tweet-economist/2021/3/1367768364999933952.json": "People can fall in love with artificial intelligence. But can AI fall in love with humans in return? Nobel laureate Sir Kazuo Ishiguro talks to Anne McElvoy about his new novel #KlaraandtheSun on “The Economist Asks” https://t.co/cFKINwCALn",
  "data/tweet-economist/2021/3/1367774615947386882.json": "A new wave of activism is spreading in Uganda, rippling through WhatsApp groups and Twitter hashtags, as young women push back against harassment and unequal treatment #IWD2021 https://t.co/i6AqWk6WSt",
  "data/tweet-economist/2021/3/1367798398221496320.json": "Hawa Abdi guided the growth of her village from a one-room rural maternity clinic, into a 400-bed hospital with three operating theatres, a school for 850 children and seven feeding centres. Our obituary from last year #IWD2021 https://t.co/qdD2EcIzFN",
  "data/tweet-economist/2021/3/1367833285418758146.json": "The African Union made bulk pre­-purchases of vaccine. But Latin America’s lack of regional co­ordination meant that countries raced against each other https://t.co/g0MSr3Bygh",
  "data/tweet-economist/2021/3/1367844900243443712.json": "This week’s cartoon from KAL: https://t.co/7wnP3jzgns https://t.co/RlPjurLz2o",
  "data/tweet-economist/2021/3/1367862973688119297.json": "Chile's swift and orderly vaccine programme, on track to cover 80% of its 19m people by June, contrasts with the rest of Latin America https://t.co/pF2ujtcXeJ",
  "data/tweet-economist/2021/3/1367909801796247576.json": "Chile's swift and orderly vaccine programme, on track to cover 80% of its 19m people by June, contrasts with the rest of Latin America https://t.co/RXIQl4XvUk",
  "data/tweet-economist/2021/3/1367915340282363912.json": "Several studies show that, even if face-mask wearers do get covid-19, their disease is milder. Now researchers think they may have worked out why https://t.co/wTmCkknfGK",
  "data/tweet-economist/2021/3/1367928431455920136.json": "Several studies show that, even if face-mask wearers do get covid-19, their disease is milder. Now researchers think they may have worked out why https://t.co/SD057Lj8ht",
  "data/tweet-economist/2021/3/1367806109239672833.json": "China has travelled far from its command-economy roots, but its policy-planning system, an inheritance from the Soviet Union, persists https://t.co/qlneBlQBtE",
  "data/tweet-economist/2021/3/1367950581319544834.json": "To some, Napoleon was a military genius, strategic mastermind and visionary leader. To others he was a tyrant and a butcher https://t.co/p7IAFD5tMT",
  "data/tweet-economist/2021/3/1367984041950068740.json": "Chile agreed to host vaccine trials and its immunisation database is digitised. Other governments in Latin America are still struggling to procure jabs https://t.co/xQtDHqHQlR",
  "data/tweet-economist/2021/3/1367980526661943300.json": "After the Fukushima disaster, talk of a \"nuclear renaissance\" fell silent. But nuclear power is an essential weapon in the fight against climate change https://t.co/vJ1Bt9RCqw",
  "data/tweet-economist/2021/3/1367973972525080576.json": "Along with mangrove swamps and tidal marshes, seagrass meadows are particularly good at taking CO2 from the air and converting it into plant matter https://t.co/9OqBpfkK4J",
  "data/tweet-economist/2021/3/1367761834900652034.json": "Africa could one day rival China. How the continent manages the next few decades will be crucial https://t.co/sr3HbSREjD",
  "data/tweet-economist/2021/3/1367960118172729350.json": "Students of sign languages are compiling databases, known as corpora, full of examples of how the languages are used. Programmers are trying to turn them into useful products https://t.co/iR1C9TNkwp",
  "data/tweet-economist/2021/3/1368008620831617026.json": "On March 3rd, the bloodiest day so far, at least 38 people were killed, according to a UN official https://t.co/aKNjNhp8je",
  "data/tweet-economist/2021/3/1368032530214100995.json": "In a now rare act of defiance, hundreds of people gathered to protest against the charging of 47 activists under Hong Kong's new security law https://t.co/hfkfs8KfCX",
  "data/tweet-economist/2021/3/1368056290652602368.json": "Nuclear power has a lot of drawbacks. But when well regulated, it is safe—and it is necessary to fight the climate crisis https://t.co/sc7f6Yx1T6",
  "data/tweet-economist/2021/3/1367877334804668418.json": "Defiance came naturally to Cicely Tyson, as a black woman in a world where black misery was largely ignored and black beauty dismissed https://t.co/tB7HrQ6npX",
  "data/tweet-economist/2021/3/1368073280511442946.json": "The army is using surveillance drones and shutting off the internet between 1am and 9am https://t.co/hVs5SD70Ry",
  "data/tweet-economist/2021/3/1367988053571215361.json": "Homophobia remains deeply entrenched across Africa. Persecution is rife, even in more accepting countries such as South Africa https://t.co/ZgQdHL6fJy",
  "data/tweet-economist/2021/3/1368081178276859905.json": "Computers are slow learners, and must be told explicitly what each sign means https://t.co/gSPVT1L8LX",
  "data/tweet-economist/2021/3/1368136276101259266.json": "The African Union made bulk pre­-purchases of vaccine. But Latin America’s lack of regional co­ordination meant that countries raced against each other https://t.co/DEvEiJhteO",
  "data/tweet-economist/2021/3/1368124739064111106.json": "What is the carbon cycle, and why does it need to be rebalanced? https://t.co/iFdiJATRht https://t.co/4q1PtaSLWL",
  "data/tweet-economist/2021/3/1368198312126517248.json": "“What are human emotions? How do they work?... Does she have empathy? Or is she just observing human emotions and simulating them within herself?” Nobel laureate Sir Kazuo Ishiguro talks about his new novel #KlaraandtheSun on “The Economist Asks” https://t.co/XA1Oni4oP4",
  "data/tweet-economist/2021/3/1368194406315130883.json": "Many activists marched, but Cicely Tyson's civil-rights statement was her face on stage and screen https://t.co/N3nNUq2yNB",
  "data/tweet-economist/2021/3/1368221100610621440.json": "The NASA mathematician just did her job, enjoying every minute. The struggles of being both black and a woman were shrugged away. Our obituary from 2020 #IWD2021 https://t.co/SFbYbHghK4",
  "data/tweet-economist/2021/3/1368207275328954371.json": "Safe and productive nuclear power plants are being closed across the world. But to hasten their decline is to wilfully hobble the world in the greatest environmental struggle of all https://t.co/hbxy2ImMtY",
  "data/tweet-economist/2021/3/1368064552508813315.json": "In total around 33bn tonnes of carbon dioxide are locked away in the ocean's carbon sinks https://t.co/vdvALSN9MD",
  "data/tweet-economist/2021/3/1367888406295044104.json": "The purge will involve, say Chinese officials, \"turning the knife-blade inward” to gouge out those deemed corrupt or insuﬃciently loyal https://t.co/V0ayCXhL5m",
  "data/tweet-economist/2021/3/1368245770705645571.json": "Research has shown that one hectare of seagrass can soak up as much carbon dioxide each year as 15 hectares of rainforest https://t.co/AHzVsDmpl7",
  "data/tweet-economist/2021/3/1368229898318413826.json": "Colombia, Ecuador and Venezuela have barely started covid-19 vaccinations. In Brazil vaccination trails behind the new P.1 variant of the virus https://t.co/rkikkWOWtQ",
  "data/tweet-economist/2021/3/1368260594743316482.json": "Lower humidity tends to dry out the respiratory tract, meaning upper-respiratory viruses flourish. But face masks increase the humidity of inspired air, giving the immune system a boost https://t.co/ugiiXcW5eX",
  "data/tweet-economist/2021/3/1368218833325064192.json": "China has come a long way since the Maoist era, but the desire for self-reliance remains https://t.co/Jk1BjgQwfy",
  "data/tweet-economist/2021/3/1368194928795344903.json": "The Tatmadaw, Myanmar's army, hopes that firing live ammunition into the crowds of demonstrators will persuade them to go home https://t.co/s3kVZME1aT",
  "data/tweet-economist/2021/3/1368275358370455567.json": "Models suggest that a global temperature rise of 2ºC could wipe out 56% of the world's existing wine-growing regions. Supported by @Mishcon_de_Reya    https://t.co/zn2un5gPs5 https://t.co/HVsJKYoguY",
  "data/tweet-economist/2021/3/1368282507515420676.json": "Several studies show that, even if face-mask wearers do get covid-19, their disease is milder. Now researchers think they may have worked out why https://t.co/SqRFTzkPyC",
  "data/tweet-economist/2021/3/1368309433982451712.json": "“Political change is nothing if there’s no social change in the way men perceive women,” says Rosebell Kagumire, the editor of African Feminism #IWD2021 https://t.co/4OWw4XOpMN",
  "data/tweet-economist/2021/3/1368316225957269504.json": "Chile agreed to host vaccine trials and its immunisation database is digitised. Other governments in Latin America are still struggling to procure jabs https://t.co/e2pawiAyFr",
  "data/tweet-economist/2021/3/1368315233396199428.json": "Cicely Tyson was the first black woman to win an Emmy as a lead actress, and the first to receive an honorary Oscar, in 2018 https://t.co/0ro4s2LAF0",
  "data/tweet-economist/2021/3/1368297863768326151.json": "Western governments wanting to tackle the climate crisis should give more thought to nuclear power  https://t.co/YjzL0jBhI8",
  "data/tweet-economist/2021/3/1368381912797036546.json": "Blue-carbon ecosystems are vulnerable to disasters. But evidence from the Mekong Delta, which was damaged during the Vietnam war, shows they can be restored https://t.co/lLhkxQw9bS",
  "data/tweet-economist/2021/3/1368381400383119360.json": "Researchers speculated that masks help keep things damp, which could be handing a mask-wearer's immune system a significant advantage https://t.co/9I9rOqN5BL",
  "data/tweet-economist/2021/3/1368377605045555200.json": "Years of anti-Christian violence across Iraq has reduced the country's Christian population from 1.2 million to around 250,000. Iraqis hope the pope's visit can help rebuild trust between the country's faiths https://t.co/zoiwHwqsIP",
  "data/tweet-economist/2021/3/1368388477616857092.json": "Nuclear power cannot simply be wished away. It has a vital role to play in the fight for a stable climate https://t.co/2qqVmqT8cy",
  "data/tweet-economist/2021/3/1368388467294625793.json": "Nuclear power is an essential weapon in the fight against climate change. The lesson of Fukushima is not to eschew nuclear power, it is to use it wisely. Our cover in Asia this week https://t.co/1ejTJ3kWmS https://t.co/AsxzVDI5gE",
  "data/tweet-economist/2021/3/1368282774021541890.json": "Muhammad bin Salman has long denied any involvement in the murder, but he cannot shake the spectre—if not of Jamal Khashoggi, then of accountability https://t.co/t2ZTeZeBsi",
  "data/tweet-economist/2021/3/1368402531609612291.json": "The army is using surveillance drones and shutting off the internet between 1am and 9am https://t.co/lFPAcud5Vn",
  "data/tweet-economist/2021/3/1368425737208950785.json": "Napoleon created the French legal code, the Bank of France, the administrative system of préfets, high school lycées, the légion d'honneur and much more  https://t.co/m5BCl0UP1f",
  "data/tweet-economist/2021/3/1368419511259521025.json": "Slow vaccine roll-outs may soon turn Asian countries from champions to laggards in the fight against the virus https://t.co/swVyXohdht",
  "data/tweet-economist/2021/3/1368285521970159617.json": "To meet the Paris climate target, more big cuts to global emissions will be needed for the rest of the decade https://t.co/T4zAl9VsH1",
  "data/tweet-economist/2021/3/1368266641591701511.json": "What exactly are China’s five-year plans and what can we expect from the new one? https://t.co/yhIdxT7zZ9",
  "data/tweet-economist/2021/3/1368185366029754368.json": "Images from the Capitol riot—activists waving flags with Christian messages, praying in the name of Jesus inside the Senate chamber—have left many evangelicals angry and confused https://t.co/qmVI3dv2md",
  "data/tweet-economist/2021/3/1368225884596011013.json": "All social-media ﬁrms and online publishers will be obliged to remove content promptly at the Indian government’s request, and to reveal the source of any post https://t.co/D12Anp16h3",
  "data/tweet-economist/2021/3/1368442503721058304.json": "A fifth of British students would have been richer ten years after leaving university if they had skipped it https://t.co/DJoj2bQLIn",
  "data/tweet-economist/2021/3/1368447272401448961.json": "She was 12 when her grandparents were swept away by the tsunami. Ten years on she still can’t escape the past https://t.co/beVOiGme2a From @1843mag",
  "data/tweet-economist/2021/3/1368464452727750657.json": "Ten years ago the world looked aghast at Japan after an earthquake caused a crisis at the Fukushima Dai-ichi nuclear power plant. The lesson is not to eschew nuclear power, but to use it wisely https://t.co/C0dMUkxLpM",
  "data/tweet-economist/2021/3/1368312183684296704.json": "What kept Hawa Abdi going was a dream of her village as Somalia in miniature: a string of jewels along the Indian Ocean. Our obituary from 2020 #IWD2021 https://t.co/Oa4yJfMwRh",
  "data/tweet-economist/2021/3/1368451357926121475.json": "Forty-seven activists, including Leung Kwok-hung, Lester Shum, Benny Tai and Joshua Wong, have been charged with plotting to overthrow Hong Kong’s government https://t.co/KYfTXHk57R",
  "data/tweet-economist/2021/3/1368305416447352847.json": "The struggles of women who have dropped out of the workforce to care for children have become impossible to ignore https://t.co/rsG5RI7xz4",
  "data/tweet-economist/2021/3/1368540695011680256.json": "At the current pace America would take another 25 months to reattain its pre-covid level of jobs. But the economic recovery is getting back on track https://t.co/GG8lwRrTs6",
  "data/tweet-economist/2021/3/1368585244413136897.json": "The lesson of Fukushima is not to eschew nuclear power, it is to use it wisely https://t.co/94lUQptpCO",
  "data/tweet-economist/2021/3/1368583493656141826.json": "The attention from the film \"Hidden Figures\" was all the more surprising because, for Ms Johnson, the work had been its own reward. Read our obituary from last year this #IWD2021 https://t.co/CZEmNWCM6O",
  "data/tweet-economist/2021/3/1368579897896169477.json": "A drop in covid-19 hospital admissions and deaths in America, as well as more stimulus cash, has allowed some economic activity to restart https://t.co/N49sjxQCAD",
  "data/tweet-economist/2021/3/1368486728470831105.json": "Climate change could cost 215 big global companies a collective $1trn — much of it over the next five years. Film supported by @Mishcon_de_Reya https://t.co/tASQeLF58s https://t.co/tvkIjCXiz1",
  "data/tweet-economist/2021/3/1368370692677369857.json": "The outside world only dimly understands Xi Jinping's political world https://t.co/SUpNPhD7jU",
  "data/tweet-economist/2021/3/1368614435938574339.json": "To some, Napoleon was a military genius, strategic mastermind and visionary leader. To others he was a tyrant and a butcher https://t.co/b4hT6cYvxQ",
  "data/tweet-economist/2021/3/1368396513441968135.json": "Constructing a house miles away and then fitting the pieces together on-site like a puzzle allows builders to avoid high costs and a patchwork of local and state requirements https://t.co/hkLxJuUk6o",
  "data/tweet-economist/2021/3/1368607408822640640.json": "The diaries provide more evidence of the vital role Winston Churchill played in saving Britain from the pro-Hitler sympathies of the upper classes https://t.co/1cZiFsXpWe",
  "data/tweet-economist/2021/3/1368575682016641027.json": "Barack Obama and Donald Trump reportedly spent $1.5m and $1.75m respectively to refurbish the White House out of their own pockets. Boris Johnson is unlikely to follow suit in Number 10 https://t.co/UGnHe9SY9m",
  "data/tweet-economist/2021/3/1368560336425660418.json": "“What are human emotions? How do they work?... Does she have empathy? Or is she just observing human emotions and simulating them within herself?” Nobel laureate Sir Kazuo Ishiguro talks about his new novel #KlaraandtheSun on “The Economist Asks” https://t.co/t6sDSahgf2",
  "data/tweet-economist/2021/3/1368297348129034249.json": "Journalists from around the world came to see her in her jeans, cami-top and Ethiopian hat, a symbol of integration for all of Italy. Read our obituary of Agita Gudeta from earlier this year #IWD2021 https://t.co/bLVrgBei9W",
  "data/tweet-economist/2021/3/1368674326434750476.json": "How parents treat their daughters, and how those daughters respond, is perhaps the thing which most clearly sets this generation of girls apart from those who came before #IWD2021 https://t.co/cjQ0kR5a0y",
  "data/tweet-economist/2021/3/1368691221204500486.json": "After the Fukushima disaster, talk of a \"nuclear renaissance\" fell silent. But nuclear power is an essential weapon in the fight against climate change https://t.co/ngrWKIfNdv",
  "data/tweet-economist/2021/3/1368696224233177091.json": "“This is the best thing that has ever happened to me, because no one ever opens my office door,” admits one American executive to @1843mag's columnist  https://t.co/1dTPIRNycB",
  "data/tweet-economist/2021/3/1368705812718366730.json": "Although covid-19 has made life harder for campaigners, many women in poor countries including Rwanda, Ghana and Bangladesh are working to reduce violence against women https://t.co/VJ8QNNZITW",
  "data/tweet-economist/2021/3/1368759649525186561.json": "Nuclear power has a lot of drawbacks. But when well regulated, it is safe—and it is necessary to fight the climate crisis https://t.co/pe8mLfr1zB",
  "data/tweet-economist/2021/3/1368768647674609669.json": "Cash transfers and teaching about non-sexist attitudes have been shown to reduce violence against women in poor countries https://t.co/gaTJ0IpJFp",
  "data/tweet-economist/2021/3/1368781368705114115.json": "One 17-year-old protester says she became \"a little afraid\" after her friend was tear-gassed. Despite the danger, she insists she will continue https://t.co/f2jTWmThBD",
  "data/tweet-economist/2021/3/1368798712831610882.json": "CRISPR editing has let a new generation of would-be billionaires explore ideas that range from systematising the search for the proteins targeted by drugs, to breeding pigs that might act as organ donors for transplants https://t.co/nCeKQdU6md",
  "data/tweet-economist/2021/3/1368810693965791233.json": "If the AstraZeneca vaccine matches Pfizer’s efficacy, which now appears likely, it could play a leading role in ending the pandemic https://t.co/uFitBkmseN",
  "data/tweet-economist/2021/3/1368806869893062656.json": "Not a single Democrat voted against the stimulus bill; not a single Republican supported it. Neither party has an incentive to compromise https://t.co/grzQTkJAuF",
  "data/tweet-economist/2021/3/1368830606616969216.json": "The notion that women should obey men or tolerate violence is no longer socially acceptable in most rich liberal democracies, but many forget how recent that change is https://t.co/IdQ2I8yVfF",
  "data/tweet-economist/2021/3/1368687674970812416.json": "Adolescence is a crucial juncture for girls. It is when many health problems emerge or are averted; and many social ones, too #IWD2021 https://t.co/4Yw91fW59I",
  "data/tweet-economist/2021/3/1368849527755730947.json": "Only 6.3% of all international leaders are women. What can be done to redress the balance? #IWD2021 https://t.co/miDM5G79Ra",
  "data/tweet-economist/2021/3/1368763745099464710.json": "Modern evangelical culture has become intensely entwined with Republican power in America  https://t.co/tJisRtwYb0",
  "data/tweet-economist/2021/3/1368873906275254278.json": "A new wave of activism is spreading in Uganda, rippling through WhatsApp groups and Twitter hashtags, as young women push back against harassment and unequal treatment #IWD2021 https://t.co/UuE2njf2Qs",
  "data/tweet-economist/2021/3/1368819007416074240.json": "Besides filtering out at least some of the viral particles floating about in the air, masks help keep a person's snot levels healthily high https://t.co/dCERL6rRic",
  "data/tweet-economist/2021/3/1368890003472932865.json": "The African Union made bulk pre­-purchases of vaccine. But Latin America’s lack of regional co­ordination meant that countries raced against each other https://t.co/PZo22RvwCz",
  "data/tweet-economist/2021/3/1368900828178903043.json": "How parents treat their daughters, and how those daughters respond, is perhaps the thing which most clearly sets this generation of girls apart from those who came before #IWD2021 https://t.co/tLLhJEtpq9",
  "data/tweet-economist/2021/3/1368919464973135872.json": "Cicely Tyson believed black characters were never given their full, true humanity on screen. She longed to see black sisters portrayed as they really were https://t.co/0REXLMY0Eb",
  "data/tweet-economist/2021/3/1368926747694149637.json": "Where is the best place to be a working woman? Our latest glass-ceiling index has the answer #IWD2021 https://t.co/MwnJEheXHv",
  "data/tweet-economist/2021/3/1368919695898853377.json": "What does it mean to be a girl today? #IWD2021 https://t.co/MGe65loKfo https://t.co/u29pCUxZBK",
  "data/tweet-economist/2021/3/1368872393863749632.json": "In sub-Saharan African countries about 45% of women on average say wife-beating is sometimes justified. In India about the same share of women agree https://t.co/FiGp9zlKZf",
  "data/tweet-economist/2021/3/1368967762832408578.json": "The interview represents a burning of bridges. For Meghan Markle, there will be no going back https://t.co/PSXBo4ejXE",
  "data/tweet-economist/2021/3/1368729461043134467.json": "Not a single Democrat voted against the stimulus bill; not a single Republican supported it. Neither party has an incentive to compromise https://t.co/FMbc49ICo0",
  "data/tweet-economist/2021/3/1368961733696557062.json": "As usual, Nordic countries performed best overall in the latest glass-ceiling index from The Economist, with Sweden, Iceland, Finland and Norway taking the top four spots #IWD2021 https://t.co/gjWBBc49hL",
  "data/tweet-economist/2021/3/1368950409281290240.json": "Colombia, Ecuador and Venezuela have barely started covid-19 vaccinations. In Brazil vaccination trails behind the new P.1 variant of the virus https://t.co/O1jxjOOh11",
  "data/tweet-economist/2021/3/1368902838747869191.json": "Activists are campaigning for stronger laws to punish the perpetrators of violence against women and to ensure survivors can get help. But the biggest challenge is preventing violence in the first place https://t.co/VrpPamtH2m",
  "data/tweet-economist/2021/3/1368993433382174723.json": "Women in sub-Saharan Africa who attended school are more likely to experience violence than those with no education. The same goes for women who work  https://t.co/WO6ZyeWtUt",
  "data/tweet-economist/2021/3/1368870878109446148.json": "Hawa Abdi guided the growth of her village from a one-room rural maternity clinic, into a 400-bed hospital with three operating theatres, a school for 850 children and seven feeding centres. Our obituary from last year #IWD2021 https://t.co/mqNrNdCpdO",
  "data/tweet-economist/2021/3/1369021862618009607.json": "The drama highlights a fundamental problem. Being a royal is about serving the institution. It does not work for those seeking individual attention  https://t.co/AzeKYCNbZy",
  "data/tweet-economist/2021/3/1369021384949645315.json": "\"Do your best\", she always said. Love what you do. Be constantly curious. And learn that it is not dumb to ask a question. Our obituary for the mathematician from 2020 #IWD2021 https://t.co/GXRzMy4qEp",
  "data/tweet-economist/2021/3/1369000743387226115.json": "Out of 29 countries, South Korea is the worst place to be a working woman, according to the latest glass-ceiling index from The Economist #IWD2021 https://t.co/FMSnKDcq27",
  "data/tweet-economist/2021/3/1368992014491123713.json": "Many hoped that Harry &amp; Meghan's marriage would shore up the monarchy. Read @1843mag's piece from the archive  https://t.co/6E8v3ONYFs",
  "data/tweet-economist/2021/3/1369047293111005189.json": "Meghan Markle did the interview on her own terms. It may do the couple some good; it may do the monarchy some harm, but probably not much https://t.co/AWq7cuG6Yc",
  "data/tweet-economist/2021/3/1369049060821368833.json": "Two species of sea slug are capable of discarding their bodies and rebuilding them from scratch, a paper in Current Biology reports https://t.co/Mix6OCOxNZ",
  "data/tweet-economist/2021/3/1368952662415310848.json": "The meltdown at a nuclear power station in Fukushima, Japan, ten years ago stoked anxieties about nuclear energy. But nuclear energy is safe, reasonably reliable and efficient https://t.co/X7qvMaUIR4",
  "data/tweet-economist/2021/3/1369111300064870400.json": "Last month a court in China ordered a man to pay his wife $7,700 for housework during their five-year marriage https://t.co/80sE2HBB0x",
  "data/tweet-economist/2021/3/1369068423184084997.json": "Women who live in violent countries such as Honduras and El Salvador are more likely to be murdered than women almost anywhere else https://t.co/NwORGt6DJ3",
  "data/tweet-economist/2021/3/1369131167744729089.json": "Finding reliable data about violence inflicted upon women in poor countries is extremely hard. Women are often too scared to report assaults to the police or know that it is futile https://t.co/D0eETMwBUB",
  "data/tweet-economist/2021/3/1369121376678932489.json": "Why spaghetti bolognese doesn’t exist in Italy https://t.co/NQE4NJpwON From @1843mag",
  "data/tweet-economist/2021/3/1369148032969752581.json": "Face-masks can give the immune system a helpful hand https://t.co/vmYBV3hoab",
  "data/tweet-economist/2021/3/1369152871229456386.json": "Pope Francis is the first-ever pontiff to visit Iraq. He arrives at a terrible time for Christian communities shattered by years of war and misery https://t.co/1v8Kdnr1rL",
  "data/tweet-economist/2021/3/1369201179960500224.json": "Seagrasses and mangroves can suck carbon from the air https://t.co/ocFs0a5Qds",
  "data/tweet-economist/2021/3/1369205798954483712.json": "Nuclear power must be well regulated, not ditched https://t.co/q5QftIZNIp",
  "data/tweet-economist/2021/3/1369187020677988352.json": "Soldiers on horseback wore high heels in tenth-century Persia https://t.co/xng8Zm7LOQ From @1843mag",
  "data/tweet-economist/2021/3/1369177705627975680.json": "As well as intimate partner violence, women are also assaulted for political reasons in Africa, parts of Asia and the Middle East https://t.co/BUwPPiejj0",
  "data/tweet-economist/2021/3/1369038933758246914.json": "“Artificial intelligence will produce a different kind of creativity,” argues Nobel prize-winning author Sir Kazuo Ishiguro on “The Economist Asks” podcast https://t.co/xr2L3oT0KG",
  "data/tweet-economist/2021/3/1369233294680858627.json": "The interview represents a burning of bridges. For Meghan Markle, there will be no going back https://t.co/GH2E8Jowqg",
  "data/tweet-economist/2021/3/1369270015699136512.json": "Meghan Markle did the interview on her own terms. It may do the couple some good; it may do the monarchy some harm, but probably not much https://t.co/7EkLhCQKuR",
  "data/tweet-economist/2021/3/1369309067538276356.json": "RT @shashj: My piece on the Pacific Deterrence Initiative, which could reach $4.7bn in 2021-22 &amp; $22.7bn in 2022-27. A quarter would go to…",
  "data/tweet-economist/2021/3/1368935416548712448.json": "RT @MarieSegger: Women and especially mothers have been hit hard by the economic impact of the pandemic. On #InternationalWomensDay I've wr…",
  "data/tweet-economist/2021/3/1369321348783345674.json": "Britain and America should look to Denmark. It spends large sums—1.9% of GDP in 2018—on retraining and advising the jobless https://t.co/BlfEw13EQ5",
  "data/tweet-economist/2021/3/1369347331250851841.json": "Napoleon created the French legal code, the Bank of France, the administrative system of préfets, high school lycées, the légion d'honneur and much more  https://t.co/sx86hoCc2j",
  "data/tweet-economist/2021/3/1369351237188063236.json": "McKinsey’s partners see themselves as missionaries. Yet they are also mercenaries— “guns for hire” https://t.co/dzbNTIxZsu",
  "data/tweet-economist/2021/3/1369173124349059074.json": "“They're taking CRISPR and using it to disable one by one almost every gene in hundreds of different cancer cell lines.”\n\n@tcross81 tells @kncukier how @CancerDepMap is improving the understanding of cancer genomes and treatment, on “Babbage” https://t.co/AZtN2xsSaD https://t.co/1AM6xV5mtd",
  "data/tweet-economist/2021/3/1369444886395711492.json": "“Biggie: I Got A Story To Tell”, a documentary made with the co-operation of the rapper’s estate, is illuminating and tragic https://t.co/7833O7BvSh",
  "data/tweet-economist/2021/3/1369440747641049091.json": "Brazil’s former president Luiz Inácio Lula da Silva served 18 months of a 12-year term for corruption and money-laundering before being released. He is now free to run for president again in 2022 https://t.co/0bO9c6tcCN",
  "data/tweet-economist/2021/3/1369285101100691456.json": "“What are human emotions? How do they work?... Does she have empathy? Or is she just observing human emotions and simulating them within herself?” Nobel laureate Sir Kazuo Ishiguro talks about his new novel #KlaraandtheSun on “The Economist Asks” https://t.co/FFFFt0Kqc9",
  "data/tweet-economist/2021/3/1369382255001542656.json": "Oxygen is the most abundant element on Earth, yet its scarcity in hospitals is causing thousands of preventable deaths https://t.co/ARmzLL5fbN",
  "data/tweet-economist/2021/3/1369476210347085831.json": "What CRISPR and its successors will mean for humanity over the next few decades is anybody’s guess. At minimum, better health and more abundant food https://t.co/zQZDYkeGJT",
  "data/tweet-economist/2021/3/1369495648777744386.json": "Demand for oxygen is outstripping supply, so a trade in cylinders of the gas is flourishing in mostly poor countries—importing one from China costs around $400 https://t.co/lGXpZMsoam",
  "data/tweet-economist/2021/3/1369500238713675776.json": "A woman in Pakistan who was raped by two men in front of her children last September was blamed for the abuse she experienced by Omar Sheikh, Lahore’s police chief https://t.co/pwOQEeiLym",
  "data/tweet-economist/2021/3/1369510265574879233.json": "Education has become a global battle and tutors are a secret weapon https://t.co/ah9yzWEVS2 From @1843mag",
  "data/tweet-economist/2021/3/1369515236752035843.json": "A growing fondness for tortillas among Hispanic and non-Hispanic Americans alike has given new life to a Mexican industry https://t.co/D42B1l5Zom",
  "data/tweet-economist/2021/3/1369569350257176579.json": "After the second world war ended, a consumer-led boom ensued. Could the same happen after the pandemic? https://t.co/KWn2iLiXTi",
  "data/tweet-economist/2021/3/1369589098546085890.json": "Napoleon created the French legal code, the Bank of France, the administrative system of préfets, high school lycées, the légion d'honneur and much more  https://t.co/kg04vGAckb",
  "data/tweet-economist/2021/3/1369388544003895298.json": "Women’s participation in America's labour force has not been this low since 1987 https://t.co/u1XA8K5FgQ",
  "data/tweet-economist/2021/3/1369593103208886276.json": "A slug that can rebuild its body from scratch is a drastic reconstructive ability, to say the least. How did this trick evolve in the first place? https://t.co/bZKIt4t1Wy",
  "data/tweet-economist/2021/3/1369575344487997442.json": "Buckingham Palace issued a neutral, conciliatory response, saying that “the issues raised, particularly of race, are concerning...they will be addressed by the family privately” https://t.co/kOloXRNouI",
  "data/tweet-economist/2021/3/1369620777851621379.json": "Lava Jato pioneered new techniques and a new boldness in tackling corruption and the traditional impunity enjoyed by the powerful in Latin America https://t.co/Uxbaw2jL3B",
  "data/tweet-economist/2021/3/1369182184700055554.json": "Britons who care about this row side, by more than two to one, with the palace. That may have a lot to do with the queen's popularity  https://t.co/MyCcSXiBO2",
  "data/tweet-economist/2021/3/1369766256518311950.json": "In a recent poll, 50% of Brazilians said they could vote for Lula. Only 38% said they could vote for Jair Bolsonaro https://t.co/cE0tpDRkIT",
  "data/tweet-economist/2021/3/1369807305399623683.json": "The lesson of Fukushima is not to eschew nuclear power, it is to use it wisely https://t.co/8CRXZs2rqs",
  "data/tweet-economist/2021/3/1369849920706994179.json": "Ten years ago the world looked aghast at Japan after an earthquake caused a crisis at the Fukushima Dai-ichi nuclear power plant. The lesson is not to eschew nuclear power, but to use it wisely https://t.co/KCLP9gjoJf",
  "data/tweet-economist/2021/3/1369845040277815296.json": "Ten years ago the world looked aghast at Japan after an earthquake caused a crisis at the Fukushima Dai-ichi nuclear power plant. The lesson is not to eschew nuclear power, but to use it wisely https://t.co/RSDmzC9FEP",
  "data/tweet-economist/2021/3/1369898278515523586.json": "After the Fukushima disaster, talk of a \"nuclear renaissance\" fell silent. But nuclear power is an essential weapon in the fight against climate change https://t.co/eExUBXxDTy",
  "data/tweet-economist/2021/3/1369861427578740741.json": "She grew up in London, married the president of Syria, then an uprising started. @1843mag charts the extraordinary rise of Asma Assad https://t.co/YdQVQ7E7I5",
  "data/tweet-economist/2021/3/1369907016668487681.json": "Half a million Syrians have died in the country's war. But for Asma Assad, the president’s British-born wife, the turmoil has provided a business opportunity https://t.co/e8Ykrl5D0l From @1843mag",
  "data/tweet-economist/2021/3/1369741366444650499.json": "The lasting lesson from Lava Jato is the vital importance of insulating Brazil’s judiciary from politicisation https://t.co/iyhAqBiWeW",
  "data/tweet-economist/2021/3/1369973128995147776.json": "Napoleon created the French legal code, the Bank of France, the administrative system of préfets, high school lycées, the légion d'honneur and much more  https://t.co/RZu0At3gM5",
  "data/tweet-economist/2021/3/1369959342053732354.json": "McKinsey’s partners see themselves as missionaries. Yet they are also mercenaries— “guns for hire” https://t.co/cxV51lWfNk",
  "data/tweet-economist/2021/3/1369941442462896129.json": "The meltdown at a nuclear power station in Fukushima, Japan, ten years ago stoked anxieties about nuclear energy. But nuclear energy is safe, reasonably reliable and efficient https://t.co/IdfGKfpiMe",
  "data/tweet-economist/2021/3/1369995036465713154.json": "Freedom House's latest report findings show that the world has suffered its 15th consecutive year of democratic decline https://t.co/Te26N7rI72",
  "data/tweet-economist/2021/3/1369984716447776778.json": "The lesson of Fukushima is not to eschew nuclear power, it is to use it wisely https://t.co/Wx86oFUmoH",
  "data/tweet-economist/2021/3/1370034669689901057.json": "How a volcanic eruption led to the birth of the bicycle https://t.co/bYV46VaK5O From @1843mag",
  "data/tweet-economist/2021/3/1370065260468654099.json": "Why is democracy in retreat? The rise of authoritarian leaders is partly to blame, as autocrats use the pandemic as cover https://t.co/jnL8aYw2d3",
  "data/tweet-economist/2021/3/1369891594812456961.json": "Through sickness, wealth and war, Asma Assad has outmaneuvered her rivals to rise to the top of Syria's power politics. It has come at a terrible cost for the Syrian people https://t.co/kiie3OPDe1",
  "data/tweet-economist/2021/3/1370079606833881092.json": "The cheapest and greenest providers of power will no longer get priority in selling to Mexico's grid. Instead it will go to the state electricity company https://t.co/3zBLO9rhtR",
  "data/tweet-economist/2021/3/1370076113897189376.json": "The Sussexes are funding their life in California through media deals with Spotify and Netflix. Will it prove as lucrative as the royal engagements the couple left behind? https://t.co/Qyk42K3gw4",
  "data/tweet-economist/2021/3/1370014414330531849.json": "Joe Biden’s stimulus bill will add fiscal rocket fuel to an already fiery economic-policy mix. It's a gamble for America and the world. Our cover this week https://t.co/wQg5hmuono https://t.co/9tc3zNWe0J",
  "data/tweet-economist/2021/3/1370087248293720076.json": "Videos can now be manipulated or faked with ease. “Deepfakes”, as they are known, pose a risk to democracies. Supported by @Mishcon_de_Reya https://t.co/U7PihHz8rj https://t.co/tJq26Bhgeo",
  "data/tweet-economist/2021/3/1370117435643289604.json": "This week’s cartoon from KAL: https://t.co/ioNSNzrb2V https://t.co/vRYt8ZRaVv",
  "data/tweet-economist/2021/3/1369679214258118656.json": "What is behind the refusal in America to adopt basic covid-19 precautions, from social distancing to face masks? New York University's @profgalloway explains in The Economist https://t.co/Q6Kr6UXGsm",
  "data/tweet-economist/2021/3/1370140743738785796.json": "America is classified by Freedom House as “free” but is no longer near the top of the class. Since 2016 the country has dropped 6 points https://t.co/4zhpU0urol",
  "data/tweet-economist/2021/3/1370155350624731143.json": "Investment in Mexico is now the lowest it has been as a percentage of GDP since 1995. AMLO's new law may depress it further https://t.co/6d1nuOMgdm",
  "data/tweet-economist/2021/3/1370180281253117953.json": "American democracy has long been in decline. One cog at the heart of the rotten engine is the filibuster. It's time for it to go https://t.co/16uNqtisWJ",
  "data/tweet-economist/2021/3/1370214569629585408.json": "Mexico's national energy provider is the only big customer for the fuel oil produced by Pemex, the state oil company that AMLO wants to boost https://t.co/NLiQQ2T5Wh",
  "data/tweet-economist/2021/3/1370227674279477251.json": "India, the world’s most populous democracy, was downgraded from “free” to “partly free” in Freedom House's latest report  https://t.co/w2j1g9NiAC",
  "data/tweet-economist/2021/3/1370241655761203202.json": "“Biggie: I Got A Story To Tell” shows a rap battle on the street in Brooklyn, with the pre-fame B.I.G. trouncing his rival. It is thrilling—and proof that his gifts were genuinely remarkable https://t.co/fq7gNclxke",
  "data/tweet-economist/2021/3/1370291155489935361.json": "RT @charlie_mccann: The generals wanted to wind the clock back a decade, says @thantmyintu. But by repressing the protests with such brutal…",
  "data/tweet-economist/2021/3/1370285902942048257.json": "Ten years of war have broken Syria into pieces https://t.co/rwFGJUlgfw",
  "data/tweet-economist/2021/3/1370277078264864772.json": "Are only boring people bored, or is boredom the origin of creativity? https://t.co/xkymFPfALW From @1843mag",
  "data/tweet-economist/2021/3/1370290232516616196.json": "The crown estate's profits—£345m last year—go to the government. Some of this money is then given back to the royal household https://t.co/dj0jXbragP",
  "data/tweet-economist/2021/3/1370332479333269504.json": "Britain’s new trading relationship with the EU will lead to the economy being around 4% smaller than it otherwise would have been https://t.co/RMSRUFb28g",
  "data/tweet-economist/2021/3/1370205649796280320.json": "President Joe Biden’s $1.9trn stimulus bill will add fiscal rocket fuel to an already fiery economic-policy mix https://t.co/6b8iRsHO0y",
  "data/tweet-economist/2021/3/1370382359917432836.json": "Some Mexicans treat their dogs like babies. It has inspired a portmanteau word, perrhijo, a fusion of the Spanish for “dog” and “child” https://t.co/2CpdGsbFx2",
  "data/tweet-economist/2021/3/1370371761674539011.json": "Ideally, America would scrap the filibuster completely. Ideally, Congress would pass a voting-reform bill, too  https://t.co/XuL4B7uN8G",
  "data/tweet-economist/2021/3/1370257076132458506.json": "Free to read | How do cancer, diabetes or heart conditions affect the impact of covid-19 on the body? Explore our interactive model to find out https://t.co/BHsJV5ksDK",
  "data/tweet-economist/2021/3/1370201830521716736.json": "As incomes and education have improved in Mexico, families have shrunk. All the more space for a puppy https://t.co/6nfWfu8Hal",
  "data/tweet-economist/2021/3/1370427140735401987.json": "Electricity in Mexico is about to become more expensive, dirtier and less reliable. Despite this, AMLO remains popular https://t.co/wlh9XykNhe",
  "data/tweet-economist/2021/3/1370423378075648008.json": "Brazil's left-wing Workers’ Party has moved further left in recent years, but Lula could move the party back towards the centre https://t.co/S0z8EodCHi",
  "data/tweet-economist/2021/3/1370375304938655747.json": "Asma Assad has become one of Syria's foremost war profiteers and ruthlessly cemented herself as one of the country's key economic and political brokers. @1843mag charts her rise https://t.co/nW2Psho3mN",
  "data/tweet-economist/2021/3/1370438461086433286.json": "Since 2012, the royal family has received a “sovereign grant\". It is currently set at 25% of the crown estate’s annual profits and last year paid out £82.4m ($114m) https://t.co/Hv3UzXJ5QP",
  "data/tweet-economist/2021/3/1370472195961581573.json": "Footage of Christopher Wallace recording his first demo aged 14, based around a sample of Toto’s “Africa”, suggests his interest in melody, as well as beats and rapping, developed early https://t.co/aMpHSe5R0r",
  "data/tweet-economist/2021/3/1370468404084232199.json": "Britain’s new trading relationship with the EU will lead to the economy being around 4% smaller than it otherwise would have been https://t.co/eqYfFbKhgQ",
  "data/tweet-economist/2021/3/1370487923733319694.json": "“The nature of democracy is that you have to keep doing the work.” On “Checks and Balance” @RepKatiePorter says #HR1 voting rights reforms will pass the Senate https://t.co/a609Tc26fX https://t.co/Rz1YSawYGZ",
  "data/tweet-economist/2021/3/1370430145165672451.json": "The army is increasingly willing to spill blood. Soldiers have shot and killed some 60 civilians in recent days https://t.co/AqEKSMWYmB",
  "data/tweet-economist/2021/3/1370474436768497670.json": "The costs of Britain's departure from the EU are adding up. Filling the long-term Brexit-shaped hole in growth will be hard https://t.co/xNAf6Sixnq",
  "data/tweet-economist/2021/3/1370253044156358656.json": "Israel's experiment with vaccination \"green passes\" is being watched around the world https://t.co/l0diHOLJHG",
  "data/tweet-economist/2021/3/1370513961171435536.json": "Salty, stodgy and delicious, pierogi are the ultimate comfort food https://t.co/vEjhTob5Ti From @1843mag",
  "data/tweet-economist/2021/3/1370536860884332549.json": "If vaccine passports are to work they must be trustworthy. Researchers who examined Israel's \"green pass\" app found several flaws https://t.co/qhTC5YjrUL",
  "data/tweet-economist/2021/3/1370569092890046466.json": "More than one woman in four will be beaten or sexually abused by a partner over her lifetime. Yet such violence is not inevitable, and attitudes can be changed  https://t.co/2ai8wuv5L8",
  "data/tweet-economist/2021/3/1370321118163300354.json": "For too long, the disastrous consequences of violence against women have been downplayed, ignored or denied. It is time for counter-­measures that match the scale of the problem  https://t.co/wxBrLvfQys",
  "data/tweet-economist/2021/3/1370601636880650243.json": "At the dawn of the digital age, Bill Clinton predicted that the internet might liberalise China. His vision was bold, uplifting and wrong https://t.co/461ClTq7bE",
  "data/tweet-economist/2021/3/1370618847070412801.json": "The regime has never even admitted that the prison camps exist. Information from escaped prisoners is vital https://t.co/wrGuKZrZrB",
  "data/tweet-economist/2021/3/1370626654654054400.json": "Continental Europe is the only big, rich region that has few vaccines and lots of new covid-19 cases. It is an unexpected outcome for the EU    https://t.co/aI2mCssMyq",
  "data/tweet-economist/2021/3/1370393177392345097.json": "Madonna made music history in 2005 by releasing her single “Hung Up” as a ringtone before it was aired on the radio. But what happened to the lucrative ringtone market? @1843mag investigates https://t.co/6I0iuMmg6a",
  "data/tweet-economist/2021/3/1370639489270493184.json": "She grew up in London, married the president of Syria, then an uprising started. @1843mag charts the extraordinary rise of Asma Assad https://t.co/XllvZu0HuM",
  "data/tweet-economist/2021/3/1370643889086984193.json": "Incompetence and the potential for snooping at citizens' personal data could taint the whole idea of vaccine passports https://t.co/U68nqgKBd5",
  "data/tweet-economist/2021/3/1370670726399856642.json": "Exports of goods to the European Union fell by 40% between January and December, while imports dropped by almost 30%. Much of this reflects the new post-Brexit reality https://t.co/G2I9ATbbTv",
  "data/tweet-economist/2021/3/1370652644444925954.json": "The Tatmadaw has already gone to grotesque lengths to justify its actions such as killing young protesters. This could just be the beginning https://t.co/53l9CDUEDz",
  "data/tweet-economist/2021/3/1370695659737780224.json": "Why spaghetti bolognese doesn’t exist in Italy https://t.co/pIZ1R1IcWI From @1843mag",
  "data/tweet-economist/2021/3/1370708731248451588.json": "If passed, HR 1, a voting-reform bill, would stop most Republican efforts to change rules for federal elections https://t.co/o1K2ZZYF3q",
  "data/tweet-economist/2021/3/1370614107481722882.json": "Joe Biden’s stimulus is a high-stakes gamble for America and the world https://t.co/fSMoiDMoCU",
  "data/tweet-economist/2021/3/1370716032839598085.json": "Neither convincing data nor medical evidence have yet been produced to explain why the disease's impact has been relatively light in India https://t.co/VVJRMWUu0e",
  "data/tweet-economist/2021/3/1370740713294606339.json": "Last year the assets of the duchies inherited by the queen and Prince Charles made profits of around £47m between them https://t.co/LXinQHt7G8",
  "data/tweet-economist/2021/3/1370756052380229635.json": "No Zoom call can replace the “chemistry of the unexpected” that you get in person. Humans need offices https://t.co/fp4txMkSIt One of @1843mag’s most popular stories of the year",
  "data/tweet-economist/2021/3/1370742700450938880.json": "The virus can cause people great harm even if it does not kill them. Existing illnesses sharply raise young people’s chances of hospital admissions https://t.co/2Y28Hl6T0A",
  "data/tweet-economist/2021/3/1370740711352582145.json": "“This is the best thing that has ever happened to me, because no one ever opens my office door,” admits one American executive to @1843mag's columnist  https://t.co/J5zCn3Titc",
  "data/tweet-economist/2021/3/1370720570757775360.json": "Schools and nurseries have been shut in Mexico for a year. Doggy day care however is booming https://t.co/myFSQD12fB",
  "data/tweet-economist/2021/3/1370771148431106053.json": "How many children should you have? https://t.co/sYtzfSaA4V From @1843mag",
  "data/tweet-economist/2021/3/1370761330651717632.json": "\"Individualism is embedded in America’s cultural identity, but it is a sign of national character to act together as a community,\" writes Scott Galloway in The Economist https://t.co/jA7UhIiaXX",
  "data/tweet-economist/2021/3/1370660953520488457.json": "Euroscepticism in its hardest form has gone out of fashion for a few reasons. One is that leaving the EU has never a particularly popular idea outside Britain   https://t.co/l0FYfxUEgx",
  "data/tweet-economist/2021/3/1370795560597393410.json": "Electricity in Mexico is about to become more expensive, dirtier and less reliable. Despite this, AMLO remains popular https://t.co/8fNnaF5a9k",
  "data/tweet-economist/2021/3/1370746486359724033.json": "The costs of Britain's departure from the EU are adding up. Filling the long-term Brexit-shaped hole in growth will be hard https://t.co/WWem64mW2S",
  "data/tweet-economist/2021/3/1370846641167736835.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/y3HwOolT3s  From @1843mag",
  "data/tweet-economist/2021/3/1370885899110776834.json": "The study found that those receiving the extra cash were more likely to have found full-­time work in the first year of the experiment than those in the control group https://t.co/KnGZ1ohDXN",
  "data/tweet-economist/2021/3/1370884393892470786.json": "Passports raise the prospect that vaccinated pensioners will be allowed to roam freely, while the young remain under lockdown https://t.co/j6HGBEjXvJ",
  "data/tweet-economist/2021/3/1370899698798706695.json": "Urban Kenyans who were told to work from home—but instead chose to work from a beach house—have thrown Kenya’s tourism industry a lifeline  https://t.co/UUWGpuFphK",
  "data/tweet-economist/2021/3/1370710500225523716.json": "Free to read | Our risk model estimates the chances of death and hospital admissions from groups of people, based on age, sex and medical history https://t.co/aywoUUtBH2",
  "data/tweet-economist/2021/3/1370691141054705669.json": "Poverty makes it even harder for women to escape from an abusive relationship. It is more difficult for a mother to leave her husband if she fears the loss of his income   https://t.co/gUxUMvIh8p",
  "data/tweet-economist/2021/3/1370523007685431303.json": "For the past two years, 125 residents of Stockton, a small city in California’s Central Valley, have found themselves $500­ a­ month richer https://t.co/MnhufNRSHs",
  "data/tweet-economist/2021/3/1370826272406962182.json": "Mexico's puppies are probably enjoying the pandemic more than the country's school-deprived children  https://t.co/keju7ecrm7",
  "data/tweet-economist/2021/3/1370945664625094656.json": "The southern state of Kerala seems to have weathered the pandemic remarkably well https://t.co/Kl5cHS4wuG",
  "data/tweet-economist/2021/3/1370931220700405761.json": "One question is what to do with those who cannot or will not be vaccinated. Those who are not risk becoming less employable https://t.co/UFl8oYLeth",
  "data/tweet-economist/2021/3/1370954821138841600.json": "The rest of the world will not match Uncle Sam’s breakneck recovery. From April to September America is likely to outgrow even China https://t.co/xpfJ94CbzM",
  "data/tweet-economist/2021/3/1370995696808173568.json": "China's new five-year plan identifies technologies such as quantum computing, semiconductors and AI as being vital to development and national security https://t.co/CX6tkprogR",
  "data/tweet-economist/2021/3/1370991689557508096.json": "Coronaspeck is the helpful German word for the fat deposited by weeks of stay-at-home grazing https://t.co/ZRhUoxChTP From @1843mag",
  "data/tweet-economist/2021/3/1370940982921953288.json": "By repressing the protests so violently, Myanmar's generals have made the country a pariah again https://t.co/sKQhYacHEv",
  "data/tweet-economist/2021/3/1371004303192821760.json": "The costs of Britain's departure from the EU are adding up. Filling the long-term Brexit-shaped hole in growth will be hard https://t.co/r1h6ic6Ynt",
  "data/tweet-economist/2021/3/1371017730577604608.json": "The most fundamental criticism of vaccine passports is that it remains unclear whether they will even do the job they are supposed to https://t.co/OKxcZDCclJ",
  "data/tweet-economist/2021/3/1371029748508471296.json": "Britain has paid a “fantastically high” price for an autonomy it won’t use, says Philip Hammond, a former Conservative chancellor https://t.co/FocwkNqqBE",
  "data/tweet-economist/2021/3/1371057792774242306.json": "Prince Charles spent £5.6m in the year to March 2020 funding the Sussexes and the Cambridges. Princess Diana left her estate, worth around £13m after tax, to her sons https://t.co/I9FJTdJ7EE",
  "data/tweet-economist/2021/3/1371109373930520579.json": "Chile's swift and orderly vaccine programme, on track to cover 80% of its 19m people by June, contrasts with the rest of Latin America https://t.co/knLiCFEI4Q",
  "data/tweet-economist/2021/3/1371104597939523592.json": "Evidence is growing that covid-­19 attacks the body broadly, and is most exacerbated by illnesses that cause inflammation or affect the circulatory system, such as kidney, liver or heart problems https://t.co/gakhs43VP7",
  "data/tweet-economist/2021/3/1371071374215811072.json": "The warming of the Arctic, and the development of ice-strengthened tankers, now make it possible to ship gas and other materials year-round https://t.co/OGoCEw6hg7",
  "data/tweet-economist/2021/3/1371104106341863425.json": "Many brands don’t have a history. So now they’re inventing them https://t.co/rGXosO0HN2 From @1843mag",
  "data/tweet-economist/2021/3/1371127752292712448.json": "Mexico's national energy provider is the only big customer for the fuel oil produced by Pemex, the state oil company that AMLO wants to boost https://t.co/G8bEhJ5wwd",
  "data/tweet-economist/2021/3/1371124730460315658.json": "Through big data and artificial intelligence, many businesses in China have revolutionised the way they produce products for customers. The West is lagging behind https://t.co/NsS7WV2rv9",
  "data/tweet-economist/2021/3/1371146533278728196.json": "The vigil for Sarah Everard was a peaceful expression of grief. Heavy policing of the event could be a sign of things to come https://t.co/Drhm4RxNwG",
  "data/tweet-economist/2021/3/1371094284162768900.json": "The very nature of the modern Chinese internet, a hyper-commercial place patrolled by thin-skinned bullies, is helping censors succeed https://t.co/8NXacGdjKc",
  "data/tweet-economist/2021/3/1371188907132518404.json": "Some Mexicans treat their dogs like babies. It has inspired a portmanteau word, perrhijo, a fusion of the Spanish for “dog” and “child” https://t.co/3YynBRucFn",
  "data/tweet-economist/2021/3/1371188150450675715.json": "Investment in Mexico is now the lowest it has been as a percentage of GDP since 1995. AMLO's new law may depress it further https://t.co/nF4JG3xY4f",
  "data/tweet-economist/2021/3/1371179590488571908.json": "She was 12 when her grandparents were swept away by the tsunami. Ten years on she still can’t escape the past https://t.co/RnrNqVoxfw From @1843mag",
  "data/tweet-economist/2021/3/1370983093025267713.json": "The rampant competition in China’s retail market suggests no platform can expect fully to dominate it. In Europe and America, the view is that the game has been won by Amazon https://t.co/K4BIiFmVMf",
  "data/tweet-economist/2021/3/1371196946497556485.json": "Only 34% of white families prefer fully remote school, compared with 58% of Hispanic, 59% of black, and 66% of Asian families, according to a survey https://t.co/OLa08TNZ54",
  "data/tweet-economist/2021/3/1371197465198784519.json": "Vaccine passports have their uses, especially in international travel. At home they might not be as helpful as their supporters imagine https://t.co/49bLXdZKL3",
  "data/tweet-economist/2021/3/1371204506730569728.json": "The Syrian economy is in worse shape than at any time in the past decade https://t.co/2rbchZKmyd",
  "data/tweet-economist/2021/3/1371138318122024968.json": "Free to read | By comparing age, sex and illnesses, our model shows how covid-19 risk levels compare for different groups https://t.co/ARHuiV7M1h",
  "data/tweet-economist/2021/3/1371219614642884609.json": "Many worry that the disproportionate police response to a peaceful vigil is just a foretaste of what will happen if a new criminal-justice bill is enacted  https://t.co/5ahJnGgeTb",
  "data/tweet-economist/2021/3/1371265596118171654.json": "Political manipulation has hamstrung covid-19 vaccination programmes in Brazil and Mexico. Elsewhere, ministers have jumped vaccine queues https://t.co/YxvJsu30Dg",
  "data/tweet-economist/2021/3/1371240246441033735.json": "Can we escape from information overload? Ask the man who spent a month living in in the dark https://t.co/bVhAgcyPE7 From @1843mag",
  "data/tweet-economist/2021/3/1371278266510807044.json": "Whether Mexico's Supreme Court strikes down the new energy law will be a test of its independence https://t.co/Ft9chIprwp",
  "data/tweet-economist/2021/3/1371269385709613060.json": "Britain plans to have all adults vaccinated by July; America and Europe could follow soon after. A sweeping vaccine-passport system may not be worth the cost or the hassle https://t.co/NTJLxqMeyj",
  "data/tweet-economist/2021/3/1371118525390151680.json": "Online grocery shopping from supermarket chains has blossomed during covid-19. But it is still not a profitable long-term enterprise. East Asia has shown it can be https://t.co/3zxlULWfbz",
  "data/tweet-economist/2021/3/1371119189566558208.json": "Is the answer to the perpetual question of what to wear actually nothing at all? https://t.co/xd19mxISLS From @1843mag",
  "data/tweet-economist/2021/3/1371283254104502273.json": "To crush democracy, China is changing Hong Kong’s political rules https://t.co/5GrOC17jGf",
  "data/tweet-economist/2021/3/1371356865301508096.json": "Vaccination will take longer in poor countries, and verification will will be harder. Incentives to cheat will be high https://t.co/gqyqYBkF0k",
  "data/tweet-economist/2021/3/1371344159139901443.json": "Asma Assad has become one of Syria's foremost war profiteers and ruthlessly cemented herself as one of the country's key economic and political brokers. @1843mag charts her rise https://t.co/A0BVS86i9A",
  "data/tweet-economist/2021/3/1371361266988630019.json": "Pre-lockdown Britain was enjoying a protest renaissance. But rules designed to limit the spread of covid-19 have allowed police to crack down on protests https://t.co/ksOJScyW76",
  "data/tweet-economist/2021/3/1371397573534224386.json": "The fighting has declined in Syria. But the country is now divided into enclaves, each with a foreign protector https://t.co/BH8HQUkfq5",
  "data/tweet-economist/2021/3/1371393560579346433.json": "Knowing the source of the family’s wealth does little to answer thornier questions over the monarchy’s value https://t.co/d2QlSWKfgV",
  "data/tweet-economist/2021/3/1371400788195512322.json": "Is tree planting the best way to tackle climate change? https://t.co/x1dW39KIvZ https://t.co/dppRIcF4J9",
  "data/tweet-economist/2021/3/1371424293289144323.json": "“Indians have been exposed to a lot of pathogens, so there is probably some cross-immunity at play here,” a Keralan doctor notes https://t.co/tTcNdfcqWh",
  "data/tweet-economist/2021/3/1371595600786034689.json": "Germany and Italy are the latest in a growing list of European countries to announce they are temporarily halting the use of a covid-19 vaccine made by AstraZeneca https://t.co/XUduFjO7mi",
  "data/tweet-economist/2021/3/1371574297064509443.json": "Beijingers woke up on Monday morning to hazy orange skies that looked almost dystopian  https://t.co/jagM6VZCN2",
  "data/tweet-economist/2021/3/1371637080334462977.json": "Political manipulation has hamstrung covid-19 vaccination programmes in Brazil and Mexico. Elsewhere, ministers have jumped vaccine queues https://t.co/0ZFCipKUGS",
  "data/tweet-economist/2021/3/1371612425745793030.json": "What is the carbon cycle, and why does it need to be rebalanced? https://t.co/iFdiJATRht https://t.co/qVVCFy5K9A",
  "data/tweet-economist/2021/3/1371655628024909828.json": "The World Health Organisation and the European Medicines Agency (EMA) have said they have no reason to believe the AstraZeneca jab is unsafe https://t.co/kYqnfjwj97",
  "data/tweet-economist/2021/3/1371664689000767489.json": "Demand for oxygen is outstripping supply, so a trade in cylinders of the gas is flourishing in mostly poor countries—importing one from China costs around $400 https://t.co/VyQJdm6VYJ",
  "data/tweet-economist/2021/3/1371678589180067841.json": "Women who live in violent countries such as Honduras and El Salvador are more likely to be murdered than women almost anywhere else https://t.co/iSXpdhBcub",
  "data/tweet-economist/2021/3/1371673897259655169.json": "People might not heed a doctor’s advice – but might they listen to their hairdresser? One of them is converting vaccine sceptics  https://t.co/r4yof1mtSr",
  "data/tweet-economist/2021/3/1371737712668065795.json": "Why the internet has not freed China https://t.co/0Vwyi1cRXg",
  "data/tweet-economist/2021/3/1371755912965279746.json": "In sub-Saharan African countries about 45% of women on average say wife-beating is sometimes justified. In India about the same share of women agree https://t.co/OTkklAR1uM",
  "data/tweet-economist/2021/3/1371847136946614275.json": "Uniqlo’s clothes have been called basic, bland and boring. Why is it so successful? https://t.co/jkGf88Knrg",
  "data/tweet-economist/2021/3/1371873286058078209.json": "The World Health Organisation and the European Medicines Agency (EMA) have said they have no reason to believe the AstraZeneca jab is unsafe https://t.co/qB66FnstsT",
  "data/tweet-economist/2021/3/1371894617516474370.json": "Political manipulation has hamstrung covid-19 vaccination programmes in Brazil and Mexico. Elsewhere, ministers have jumped vaccine queues https://t.co/kw6XeqVE9V",
  "data/tweet-economist/2021/3/1371784485553995779.json": "RT @martgnz: Over the past months we have built a statistical model that estimates the likelihood of dying or being hospitalized from covid…",
  "data/tweet-economist/2021/3/1371931386974724098.json": "Britney Spears’s concert residency in Las Vegas from 2013 to 2017 earned $138m in ticket sales—but she has no say over her share https://t.co/qsHVm7Op8n",
  "data/tweet-economist/2021/3/1372007550141538304.json": "Writing in The Economist, Martin Chavez argues that big tech firms \"should have to pay the equivalent of a carbon tax...if they pollute the infosphere with falsehoods\" https://t.co/iqlGcZ9x71",
  "data/tweet-economist/2021/3/1371976358704861190.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/HRYEtgYWDp  From @1843mag",
  "data/tweet-economist/2021/3/1371999001680154625.json": "The main reasons America’s sperm banks are booming? The legalisation of gay marriage and the rising number of single women choosing to become mothers https://t.co/FzYEwmnvuz",
  "data/tweet-economist/2021/3/1371986409981157376.json": "The Biden administration expects border crossings to hit levels not seen in America for 20 years https://t.co/59uGGueOra",
  "data/tweet-economist/2021/3/1372047745125650440.json": "How a volcanic eruption led to the birth of the bicycle https://t.co/DEAVnd8yAG From @1843mag",
  "data/tweet-economist/2021/3/1372052488656977920.json": "As the economy roars back in China, air pollution is returning to pre-covid levels https://t.co/brRQHWuacF",
  "data/tweet-economist/2021/3/1372037035477905409.json": "America’s government has projected that there could be a record 120,000 unaccompanied minors arriving at the border this year (54% more than the previous peak in 2019) https://t.co/ZqTLz3Zrf9",
  "data/tweet-economist/2021/3/1371899229837332486.json": "Hydrogen technologies may be the best way to fuel greener air travel in the future. Film supported by @Mishcon_de_Reya https://t.co/GY0ugRSxWP https://t.co/jbVRBCyXjE",
  "data/tweet-economist/2021/3/1372092527227117568.json": "Britain’s new trading relationship with the EU will lead to the economy being around 4% smaller than it otherwise would have been https://t.co/xtkFIIp4zV",
  "data/tweet-economist/2021/3/1372125888582717452.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships https://t.co/4z3SPa6kDU  From @1843mag",
  "data/tweet-economist/2021/3/1372130108086104066.json": "Having scrambled to secure the AstraZeneca vaccine in January, large parts of Europe are now left with stockpiles that are not being used https://t.co/fqyoUC2Le8",
  "data/tweet-economist/2021/3/1372160517134032906.json": "Demand for oxygen is outstripping supply, so a trade in cylinders of the gas is flourishing in mostly poor countries—importing one from China costs around $400 https://t.co/Hy376KWu7h https://t.co/MjZFV894jF",
  "data/tweet-economist/2021/3/1372097098762616833.json": "Women’s participation in America's labour force has not been this low since 1987 https://t.co/1GRtV2p9CS",
  "data/tweet-economist/2021/3/1372207850555113474.json": "The World Health Organisation and the European Medicines Agency (EMA) have said they have no reason to believe the AstraZeneca jab is unsafe https://t.co/PFhLsIyHi9",
  "data/tweet-economist/2021/3/1372235770157797377.json": "The interview represents a burning of bridges. For Meghan Markle, there will be no going back https://t.co/sYgoyQ9lYR https://t.co/omW0CMiAYp",
  "data/tweet-economist/2021/3/1372270530343145478.json": "Countries that have suspended the use of AstraZeneca jabs say it shows they take safety seriously. Unfortunately, their caution is likely to result in more deaths https://t.co/zLnrW9dykp",
  "data/tweet-economist/2021/3/1372300484480962563.json": "In Xinjiang, a million or more people have been put in camps. Uyghurs who live abroad still fear the Chinese authorities https://t.co/YM3YcyaNmb",
  "data/tweet-economist/2021/3/1372297671776567312.json": "In a handbrake turn, Uber has announced that its 70,000 drivers in Britain will be paid at least the minimum wage, get a pension and receive holiday pay\nhttps://t.co/WsLfxTe0dE",
  "data/tweet-economist/2021/3/1372316835320885251.json": "A 25-year-old American with a university degree can expect to live a decade longer than a contemporary who dropped out of high school https://t.co/zE8nEE4duV",
  "data/tweet-economist/2021/3/1372341531986780161.json": "The filibuster is an oddity that harms American democracy https://t.co/m6QE74Em1F",
  "data/tweet-economist/2021/3/1372402289240064000.json": "A quarter of people around the world are under 14 years old. Until they are vaccinated, stemming the spread of covid-19 entirely will be impossible https://t.co/wSXHFYkR3L",
  "data/tweet-economist/2021/3/1372382274675691521.json": "Gen Z’s earnings from stocks and bonds will be significantly lower than those of previous generations and inflation is making matters worse    https://t.co/TSmfQCTMeg https://t.co/VztH4MOZZC",
  "data/tweet-economist/2021/3/1372433864988241921.json": "Meghan Markle did the interview on her own terms. It may do the couple some good; it may do the monarchy some harm, but probably not much https://t.co/YoWDvzuVNu https://t.co/UoN6vS1a7I",
  "data/tweet-economist/2021/3/1372424914368655361.json": "Despite ongoing surveillance and fear for their safety, Uyghurs are trying to keep their identity alive, thousands of miles from China https://t.co/mqzE49pQGE",
  "data/tweet-economist/2021/3/1372439135638654980.json": "Whatever the true cause, John Magufuli's death will almost certainly not be listed among Tanzania's covid-19 statistics https://t.co/ykLEpDZjr2",
  "data/tweet-economist/2021/3/1372469356974780417.json": "Demand for oxygen is outstripping supply, so a trade in cylinders of the gas is flourishing in mostly poor countries—importing one from China costs around $400 https://t.co/g5z8Xyh2Dv https://t.co/28soBtph4r",
  "data/tweet-economist/2021/3/1372476633114873857.json": "After almost 20 years of war with America, the Taliban control ever more territory in Afghanistan. Why has America failed to defeat them? https://t.co/I6ErLoGzgw https://t.co/CltCuBQMw1",
  "data/tweet-economist/2021/3/1372329436532649985.json": "An abundance of dollars is causing a headache for banks and investors https://t.co/aExVVW1hJu",
  "data/tweet-economist/2021/3/1372542308353196036.json": "Even if the AstraZeneca jab were to shown to increase the risk of clots, that risk would likely be many, many times lower than the dangers of catching covid-19 https://t.co/pmqz2PQIOk",
  "data/tweet-economist/2021/3/1372478139142668290.json": "John Magufuli will probably be remembered best for his stance on the coronavirus, but history should judge him as harshly for the damage he inflicted on Tanzania’s fledgling democracy https://t.co/EN6czaIjPP",
  "data/tweet-economist/2021/3/1372580789783834626.json": "In dealing with China, an epoch-defining global contest between autocracy and liberal values lies ahead. Our cover this week https://t.co/KqbCRtWgBM https://t.co/i70D9o2X7R",
  "data/tweet-economist/2021/3/1372631436818276354.json": "This week’s cartoon from KAL: https://t.co/ctZmG4UjHQ https://t.co/qDj27iVyZZ",
  "data/tweet-economist/2021/3/1372626894517059584.json": "The totemic pledge that Chinese sovereignty over Hong Kong would be guided by the principle of “one country, two systems” lies in ruins https://t.co/iy0Ckx6Y3P",
  "data/tweet-economist/2021/3/1372702368052228100.json": "Children as young as six will be asked to memorise offences criminalised by the national-security law, including subversion, secession, terrorism and collusion with foreign powers https://t.co/yiu0HI6Bta",
  "data/tweet-economist/2021/3/1372756126555545601.json": "China will subject liberal values to their greatest test since the early days of the cold war https://t.co/0PpLFS2rat",
  "data/tweet-economist/2021/3/1372715273384566784.json": "The pandemic has set a dangerous precedent for the suppression of civil liberties https://t.co/7kB7W7qZ0o",
  "data/tweet-economist/2021/3/1372778403087052807.json": "What is the link between schooling and longevity? Some argue that better-educated people develop healthier lifestyles https://t.co/zxZKi9zoIS",
  "data/tweet-economist/2021/3/1372787985553362944.json": "These newly discovered single-celled organisms provide a snapshot of the process by which mitochondria themselves formed https://t.co/M03VV7BheU",
  "data/tweet-economist/2021/3/1372410463347212290.json": "Whereas the average American’s expected span has been flat in recent years, that of those with a bachelor’s degree has continued to lengthen https://t.co/zGR5hbep2t",
  "data/tweet-economist/2021/3/1372812821680037888.json": "The sooner children get a vaccine, the greater the chances of taming the virus. Here's why https://t.co/4tjUcTX8O7",
  "data/tweet-economist/2021/3/1372837784550060035.json": "The Mediterranean is the most overfished sea in the world. This man has a plan to revive it—and it seems to be working. Film supported by @Blancpain1735 https://t.co/aM7LhZ0Pw6",
  "data/tweet-economist/2021/3/1372817313607606272.json": "By 2035, there will be more young people joining the workforces in Africa than in the rest of the world combined. The continent's industrial revolution need not be a pipe dream https://t.co/hwRpT2lvso",
  "data/tweet-economist/2021/3/1372769592636964874.json": "Xi Jinping's China still wants to preserve Hong Kong as a global financial centre, but party chiefs have little interest in the city's access to Western know-how https://t.co/u0NRJkEPkV",
  "data/tweet-economist/2021/3/1372871482834096130.json": "Human beings are not alone in having invented vaccination. In fact, a new paper confirms that honeybees got there first https://t.co/nnD0e1tNhB",
  "data/tweet-economist/2021/3/1372880647027580934.json": "Several studies show that, even if face-mask wearers do get covid-19, their disease is milder. Now researchers think they may have worked out why https://t.co/BhJvfCXp3G",
  "data/tweet-economist/2021/3/1372903964090499082.json": "China’s “real” growth may not be as real as it claims to be https://t.co/tdevMPFUbG",
  "data/tweet-economist/2021/3/1372914021226192899.json": "China is increasingly confident that its model of techno-authoritarian state capitalism is superior to what it sees in the democratic West https://t.co/Ev2E0MWLi0",
  "data/tweet-economist/2021/3/1372848081637629953.json": "A new book by Minouche Shaﬁk, director of the London School of Economics, examines the role of the social contract https://t.co/bbyqJHbezM",
  "data/tweet-economist/2021/3/1372724569878970374.json": "America’s overburdened immigration-court system has 1.3m cases, about two-and-a-half times the number when Donald Trump assumed office https://t.co/EadtESbeBU",
  "data/tweet-economist/2021/3/1372966359672483848.json": "This is perhaps the first time that a major bilateral relationship has focused on trees https://t.co/FMG4ovB8qf",
  "data/tweet-economist/2021/3/1372910757717901314.json": "As news from Ethiopia’s Tigray region emerges, claims of war crimes are mounting. On “The Intelligence” @TomGardner18 unpicks an increasingly complex civil war https://t.co/TKin16aBiT",
  "data/tweet-economist/2021/3/1373016448306704388.json": "Despite a high risk of famine in Tigray, Ethiopia’s government is still slowing the movement of aid workers, perhaps because officials do not want them to expose atrocities  https://t.co/E3bHIht6bM",
  "data/tweet-economist/2021/3/1372971148326150145.json": "Credible reports of atrocities and war crimes are emerging in Tigray. Many involve troops from neighbouring Eritrea, who are fighting alongside Ethiopian forces  https://t.co/81ueYcag8w",
  "data/tweet-economist/2021/3/1373081465018277892.json": "Male Regent honeyeaters struggle to learn the songs required to court females. Researchers studying the endangered birds reckon this may result in extinction https://t.co/hZaIH2y2hb",
  "data/tweet-economist/2021/3/1373069314362855430.json": "In only a few months as Turkey’s central­-bank governor, Naci Agbal, has breathed new life into his country’s currency and bolstered the bank’s reputation   https://t.co/mIzwAEkoTF",
  "data/tweet-economist/2021/3/1373104622148145152.json": "When global firms talk to shareholders about China, they gloss over the country's brutal reality. They should act against enormities by, say, excluding forced labour from their supply chains https://t.co/imMYv2AV54",
  "data/tweet-economist/2021/3/1373099368392359942.json": "You might think the death of liberalism in Asia’s financial centre would trigger panic, capital flight and a business exodus. In fact, Hong Kong is enjoying a boom https://t.co/HHdY4tLcCk",
  "data/tweet-economist/2021/3/1372946613820403713.json": "In the Kashmir Valley schools have not just been closed for the pandemic, but for all but a handful of days over the past two years https://t.co/FrcDloBBq1",
  "data/tweet-economist/2021/3/1373134937642110977.json": "Monet’s work reveals the rewards of repeated attention, which shifts and refracts with the season or the time of day https://t.co/hw0LhfWl9h",
  "data/tweet-economist/2021/3/1373126382927147009.json": "Neither the constitution nor any laws explicitly ban same-sex marriages. But the government deprives same-sex couples of certain benefits of marriage https://t.co/zT4dpd2Qme",
  "data/tweet-economist/2021/3/1373172724617609216.json": "A bill that clamps down on protest in England and Wales went through Britain's Parliament just days after the vigil for Sarah Everard. The timing turned it into the centre of a controversy https://t.co/WZ9ms24YW4",
  "data/tweet-economist/2021/3/1373193360970776578.json": "His death means Tanzania now has a chance of renewing its democracy—and of trying to fight back against covid-19 https://t.co/386lnQpzVy",
  "data/tweet-economist/2021/3/1373091426955886593.json": "“Zack Snyder’s Justice League” must be the most expensive and extensive salvage job in cinema history https://t.co/noi1EbFzBw",
  "data/tweet-economist/2021/3/1373227961172770818.json": "For the British government, the pain of leaving the EU must be seen to be worth it. This is easier to claim if the EU fails to become a beacon of transnational bliss  https://t.co/XhyrV5J7c3",
  "data/tweet-economist/2021/3/1373248968113717248.json": "Free to read | Enter an age, a sex and underlying medical conditions into our interactive model to see the likely impact of covid-19 on those who have not been vaccinated https://t.co/PodN7MtXmw",
  "data/tweet-economist/2021/3/1373267360757510147.json": "A third wave of infections is sweeping through Europe, forcing many governments to tighten or reimpose lockdowns https://t.co/7STTzEf6HX",
  "data/tweet-economist/2021/3/1373263817556246533.json": "Turkey’s central bank governor imposed a much needed rate hike on Thursday. Two days later, he was gone  https://t.co/Txq4VPrKT1",
  "data/tweet-economist/2021/3/1372999330240548872.json": "If Chile does the constitutional convention well, it will once again be a model for the region https://t.co/CZ3IFLRbY6",
  "data/tweet-economist/2021/3/1373253512247832579.json": "Generation Z's earnings from stocks and bonds will be significantly lower than those of previous generations, according to a recent report https://t.co/sr3m7ufWuv",
  "data/tweet-economist/2021/3/1373282128058847238.json": "Zack Snyder’s insistence on depicting superheroes as awe-inspiring demi-gods will always be divisive, but this is a more cohesive film than the one that was cobbled together in 2017 https://t.co/JXUxZFF95R",
  "data/tweet-economist/2021/3/1373295910957023233.json": "The curbs on protest in England and Wales are aimed at movements such as Extinction Rebellion and Black Lives Matter which the government abhors https://t.co/PlV6MxgbFf",
  "data/tweet-economist/2021/3/1373308904831074311.json": "Japan is the only G7 member that does not recognise same-sex unions https://t.co/EUz1RFkE80",
  "data/tweet-economist/2021/3/1373301069820870663.json": "If talks with Jair Bolsonaro fail, the Biden administration could work directly with states in the Amazon instead https://t.co/TL4X2AfNe5",
  "data/tweet-economist/2021/3/1373218790654287875.json": "British politics is being deconstructed by competing national identities https://t.co/LaRpJJj5Ek",
  "data/tweet-economist/2021/3/1373324218398560259.json": "President Tayyip Recep Erdogan has dismissed Naci Agbal, his third central-bank governor in under two years  https://t.co/TxzKFLVgPg",
  "data/tweet-economist/2021/3/1373242956728131584.json": "In dealing with China, an epoch-defining global contest between autocracy and liberal values lies ahead. Our cover this week https://t.co/o9krHx2F0W https://t.co/uzJ0GvvMdC",
  "data/tweet-economist/2021/3/1373351416144785412.json": "When religion was added to Britain's census in 2001, 400,000 people identified as “Jedi” https://t.co/oucazcvbLr",
  "data/tweet-economist/2021/3/1373354666340331535.json": "Honeybees are at constant risk of diseases sweeping through their hives. So, queen bees vaccinate their unlaid eggs with fragments of proteins from disease-causing pathogens https://t.co/AoVhVFbnKN",
  "data/tweet-economist/2021/3/1373328260675801099.json": "One potential reason for the increase in warheads is that Britain is worried about future improvements in Russian or Chinese missile defences    https://t.co/9uMuuzu1H0",
  "data/tweet-economist/2021/3/1373365231410368513.json": "Protests by a single person in England and Wales can be subject to restrictions https://t.co/mWV0QhR8L4",
  "data/tweet-economist/2021/3/1373354930887614466.json": "Classic English nationalism was moderate and self­-deprecating. Today’s nationalism is radical and angry https://t.co/EQ2SOknUqU",
  "data/tweet-economist/2021/3/1373426391060987906.json": "Attempts over the years to turn the capital into the 51st state have repeatedly failed, but recent events are giving the cause new momentum https://t.co/wAMDYGWiCp",
  "data/tweet-economist/2021/3/1373392163766214663.json": "On April 10th and 11th, Chileans will elect a convention to write a new constitution https://t.co/B2PkgRhCoz",
  "data/tweet-economist/2021/3/1373460383034408964.json": "A recent discovery made in the depths of Lake Zug, in Switzerland, sheds light on the make-up of the first cells that eventually led to humans https://t.co/Qyew53ZZpS",
  "data/tweet-economist/2021/3/1373465037331906560.json": "The most effective way to boost conservation in the Amazon would be to get farmers on board. So far they have not joined the call for sustainability  https://t.co/jzzwQ5azOz",
  "data/tweet-economist/2021/3/1373413310775844866.json": "Perhaps half of the munitions have not exploded, according to a paper based on satellite images and local reports https://t.co/WXQYiysCJ7",
  "data/tweet-economist/2021/3/1373435808930205698.json": "Jibes flew between Anthony Blinken, America’s secretary of state, and Yang Jiechi, Xi Jinping’s most senior envoy at the conference in Alaska https://t.co/qreoYKaNnb",
  "data/tweet-economist/2021/3/1373501363204800512.json": "Child psychiatrists say many pupils are struggling to cope with attending school at all, having lost social skills and the ability to concentrate https://t.co/gnfjA36bxV",
  "data/tweet-economist/2021/3/1373489339909296131.json": "More favourable rulings like this one could pressure Japan's parliament to act. Polls suggest most voters would welcome that https://t.co/igeCGdeXGz",
  "data/tweet-economist/2021/3/1373516730253901825.json": "China's authoritarian rule in Hong Kong, repression of Uyghurs and alleged cyber-attacks in the US are some of the actions that America has criticised https://t.co/MlqvMdJgSQ",
  "data/tweet-economist/2021/3/1373496341133938693.json": "The annualised returns for Gen Z are estimated to be a mere 2% on a 70:30 portfolio of stocks and bonds—not even a third of the historical return of the baby boomers https://t.co/LpvxN3PKMt",
  "data/tweet-economist/2021/3/1373520756844417026.json": "Turkey’s central bank governor imposed a much needed rate hike on Thursday. Two days later, he was gone\nhttps://t.co/3oX86ptQng",
  "data/tweet-economist/2021/3/1373532129787793410.json": "The recent rise in global cases is worrying. They fell by half between January 11th and February 20th, but have since risen by 30% from that low point https://t.co/z9SrUnj3qT",
  "data/tweet-economist/2021/3/1373485422584692736.json": "Fewer people have died from the virus in South Dakota than in most states, but when adjusted for population, it ranks eighth for most deaths from the disease https://t.co/8S191JM98G",
  "data/tweet-economist/2021/3/1373301324939472896.json": "The Tatmadaw has long been involved in illicit money-making schemes such as the smuggling of gems and protection of drugs gangs https://t.co/XZ6QdXczj2",
  "data/tweet-economist/2021/3/1373550892650274816.json": "When they are looking after larvae, nurse bees transfer fragments from pathogens they consume from food into the royal jelly they produce https://t.co/I1uZZarhXX",
  "data/tweet-economist/2021/3/1373562215849201667.json": "Monet painted the Rouen Cathedral repeatedly, working on as many as 14 different versions at once. Looking at them together you can track the change in the light and the angle of his perspective https://t.co/vFXhkpD4eQ",
  "data/tweet-economist/2021/3/1373512709082320899.json": "Myanmar's army is not even above extorting money from its own members https://t.co/QKBCi8t4sq",
  "data/tweet-economist/2021/3/1373557540676644865.json": "Since 2011 the number of people who describe themselves as exclusively or mainly English rather than British has grown https://t.co/rsgWVzf13g",
  "data/tweet-economist/2021/3/1373591990923886592.json": "Many Conservative MPs have defended freedom of speech. They are more ambivalent about freedom of assembly—and so are their voters https://t.co/DOdj1uFn6A",
  "data/tweet-economist/2021/3/1373623448413569030.json": "When religion was added to Britain's census in 2001, 400,000 people identified as “Jedi” https://t.co/ALkTMumP6x",
  "data/tweet-economist/2021/3/1373619914473345024.json": "The British government wants the country to be recognised as a “science and technology superpower” by 2030 and plans to raise investment in research and development  https://t.co/TJyWkKgjmV",
  "data/tweet-economist/2021/3/1373605354240684032.json": "China's pattern of political oppression and commercial effervescence poses a problem for the West https://t.co/h6SkUK7Lt4",
  "data/tweet-economist/2021/3/1373627997870260228.json": "It is easy to assume that the extroverts are most likely to go far in business, but is that true? https://t.co/kvw9sC0iol",
  "data/tweet-economist/2021/3/1373639043020419079.json": "Beijing's ultimate target in Hong Kong is the city’s laissez-faire, low-tax economic model https://t.co/B3lzNdma2Y",
  "data/tweet-economist/2021/3/1373683982852878343.json": "Close encounters between male and female Regent honeyeaters are rare. But the success of those encounters depends on the male singing to the female’s satisfaction https://t.co/FKyffbSJAK",
  "data/tweet-economist/2021/3/1373677758887428102.json": "Ronald Reagan passed the last and only immigration amnesty in 1986. Our “Checks and Balance” podcast looks at the lessons for Joe Biden https://t.co/vsfe92NGy8 https://t.co/OU8Bu8sR1y",
  "data/tweet-economist/2021/3/1373667728352018440.json": "China accused America of meddling and criticised its human-rights abuses at home, including what Yang Jiechi, Xi Jinping's most senior envoy, called the “slaughter” of black Americans https://t.co/GYQEBfyN4f",
  "data/tweet-economist/2021/3/1373705481294917633.json": "Cases are currently highest in Europe. They are also rising in Latin America https://t.co/FDlavbGWLJ",
  "data/tweet-economist/2021/3/1373691515868971010.json": "In response to the bill, 99 branches of Extinction Rebellion, Black Lives Matter and other groups pledged to “continue to unite and fight” against the government   https://t.co/HprqcnBbv4",
  "data/tweet-economist/2021/3/1373756342985441280.json": "Boris Johnson led Britain out of the EU, into a loose and shallow free­-trade deal with it. He sees Europe as a sovereign rival, and his diplomats follow his lead  https://t.co/fMmOIOtA6g",
  "data/tweet-economist/2021/3/1373795372204765189.json": "Should Brazil fail to meet its environmental targets, Joe Biden has few diplomatic sticks with which to whack Jair Bolsonaro https://t.co/W5togerk3N",
  "data/tweet-economist/2021/3/1373777200713973761.json": "Disinformation has flourished on the internet, but the tactic has been around since Ancient Rome. From @1843mag https://t.co/RhLAUypyzJ",
  "data/tweet-economist/2021/3/1373648604754235392.json": "What is the solution to a society that is becoming more selfish? Mark Carney and Minouche Shaﬁk weigh in  https://t.co/hu3ydiNayA",
  "data/tweet-economist/2021/3/1373820249393483776.json": "Beijing officials are betting that new patriotic school lessons will produce a new generation of youngsters in Hong Kong who love China https://t.co/i3G4B5uTEr",
  "data/tweet-economist/2021/3/1373847995490385922.json": "It can be hard to tell what’s fact and what’s fake. Time to learn the techniques – and language – of disinformation. From @1843mag https://t.co/jxE3r2KS2t",
  "data/tweet-economist/2021/3/1373838722525958148.json": "Such direct confrontation in public is highly unusual in the history of face-to-face diplomacy between China and America https://t.co/Xm5yQdTNPN",
  "data/tweet-economist/2021/3/1373865150084743175.json": "The Tatmadaw has repeatedly run Myanmar's economy into the ground. Doing so again will just remind Burmese of another reason why they so dislike military rule https://t.co/hWi7rypiIM",
  "data/tweet-economist/2021/3/1373843680004612097.json": "Japan's ruling party, known for its old-fashioned views on matters of sexual equality, remains opposed to gay marriage  https://t.co/H5yfrsL80t",
  "data/tweet-economist/2021/3/1373890374343725057.json": "The traditional method of kintsugi binds flawed or smashed crockery with lacquer and covers the joins with powdered gold or silver https://t.co/J3sa8mZUOa",
  "data/tweet-economist/2021/3/1373886269172936706.json": "Private deliberation is out, public confrontation is in. For Britain, Brussels is there to be bashed, especially when it does outrageous things like threaten to block vaccine exports  https://t.co/vRY5tlRK9K",
  "data/tweet-economist/2021/3/1373882150844502017.json": "Compared with those from previous decades, the songs of today's male Regent honeyeaters are sorely wanting. That is bad news for the species https://t.co/M9KnUjH0hy",
  "data/tweet-economist/2021/3/1373652131111182338.json": "Free to read | By comparing age, sex and illnesses, our model shows how covid-19 risk levels compare for different groups https://t.co/G47G1w5GRT",
  "data/tweet-economist/2021/3/1373899038446256131.json": "As vaccine programmes have rolled out, people may have let down their guard. But more contagious variants are a more likely explanation for the uptick in cases https://t.co/GEqsGsBY60",
  "data/tweet-economist/2021/3/1373903010187841538.json": "Nearly half of Britain's adult population have received their first covid-19 jab. Will the government be able to sustain this pace? https://t.co/lZ6jIXm1BD",
  "data/tweet-economist/2021/3/1373860996922609666.json": "Australia's parliament has been called a \"boys' club\" but women are becoming more willing to denounce abuses https://t.co/6lH95n2stj",
  "data/tweet-economist/2021/3/1373775209791098886.json": "Young Japanese want better pay, flexible conditions and jobs that are less boring https://t.co/VBpvDJy2I5",
  "data/tweet-economist/2021/3/1373950379839397896.json": "America dropped an estimated 1.8m tonnes of explosives on Cambodia. Many did not detonate and present a risk to farmers today https://t.co/bMuzrZxWJi",
  "data/tweet-economist/2021/3/1373944662667444224.json": "The curbs on protest in England and Wales are aimed at movements such as Extinction Rebellion and Black Lives Matter which the government abhors https://t.co/XBH8OYn09l",
  "data/tweet-economist/2021/3/1373799218045984772.json": "Mr Magufuli's authoritarianism and covid denialism have badly damaged Tanzania https://t.co/Vp7KKyrluV",
  "data/tweet-economist/2021/3/1373803100092428288.json": "Washingtonians could not vote in presidential elections until 1964. Here's a guide to why they have been stateless for so long https://t.co/3y5raRlKcR",
  "data/tweet-economist/2021/3/1374048066735587331.json": "New findings suggest that, via their royal jelly, nurse bees are passing antigens to the queen bee for inoculation into her eggs https://t.co/fraTeeTMsF",
  "data/tweet-economist/2021/3/1374067859916169220.json": "Countries that have succeeded in rolling out vaccines quickly have, for now, avoided surges in new cases https://t.co/KNPN0JHrJO",
  "data/tweet-economist/2021/3/1374077886064435205.json": "Naci Agbal offered a glimmer of hope that Turkey's central bank was something other than an extension of President Erdogan’s government. That hope is now gone https://t.co/6iTtwURXF0",
  "data/tweet-economist/2021/3/1374109913304154114.json": "Pfizer and Moderna, which developed the same type of vaccine, announced efficacy rates of 94-95%. AstraZeneca says its vaccine was 79% effective at preventing symptomatic covid-19 https://t.co/AbK0eO4WYl",
  "data/tweet-economist/2021/3/1374023334925627400.json": "This is perhaps the first time that a major bilateral relationship has focused on trees https://t.co/qG07b56sYL",
  "data/tweet-economist/2021/3/1374181574015643648.json": "Britain is adding nukes for the first time since the cold war https://t.co/pdCQM2pfio",
  "data/tweet-economist/2021/3/1374171706303115265.json": "How the British became the new Turks https://t.co/6Nxb5ikumv",
  "data/tweet-economist/2021/3/1374235190961311744.json": "China is not just shackling Hong Kong, it is remaking it https://t.co/lkbryG3g9q",
  "data/tweet-economist/2021/3/1374276229524824073.json": "Boris Johnson wants to restrict the right to protest https://t.co/XPw23F1CiJ",
  "data/tweet-economist/2021/3/1374249431814520834.json": "Joe Biden and Jair Bolsonaro square off over the Amazon https://t.co/1ichPSnPNX",
  "data/tweet-economist/2021/3/1374312768359239680.json": "The Japanese art of repair https://t.co/mCO7H5U9Wv",
  "data/tweet-economist/2021/3/1374317515875172355.json": "The link between personality and success https://t.co/4fl7suSaKO",
  "data/tweet-economist/2021/3/1374257824679727104.json": "The Turkish lira is back on the ropes and the stockmarket is tumbling. The brutal reaction to Naci Agbal's ousting may give Recep Tayyip Erdogan some pause for thought https://t.co/UwvDMNDZnz",
  "data/tweet-economist/2021/3/1374435971404492801.json": "How this tree can help tackle climate change. Film supported by @Blancpain1735 https://t.co/XNZkvPlumh https://t.co/fMuIadn1Hq",
  "data/tweet-economist/2021/3/1374516843885465605.json": "How the British became the new Turks https://t.co/IRnVOZUKEX",
  "data/tweet-economist/2021/3/1374511905251885057.json": "A third wave of infections is sweeping through Europe, forcing many governments to tighten or reimpose lockdowns https://t.co/lFMpBIpvzm",
  "data/tweet-economist/2021/3/1374538675929939974.json": "Several studies show that, even if face-mask wearers do get covid-19, their disease is milder. Now researchers think they may have worked out why https://t.co/y4q1zn09d1",
  "data/tweet-economist/2021/3/1374534744629780480.json": "Cases are currently highest in Europe. They are also rising in Latin America https://t.co/xuPjRN5k6a",
  "data/tweet-economist/2021/3/1374503487828942854.json": "AstraZeneca has promised to publish more data about the vaccine’s safety and efficacy within 48 hours https://t.co/REyjRlRMNM",
  "data/tweet-economist/2021/3/1374542500854169600.json": "Kintsugi not only repairs a damaged treasure but leaves it lovelier, and more valuable https://t.co/gVWYUjmYN4",
  "data/tweet-economist/2021/3/1374555521328504834.json": "Polls suggest that Asian-Americans are the targets of a growing number of racist incidents https://t.co/X75kec8ifX",
  "data/tweet-economist/2021/3/1374511528938938379.json": "The malaria parasite is not visible to the naked eye. But it has profoundly shaped the course of human history https://t.co/9C7SE8lDtO https://t.co/kcqUsI9PKI",
  "data/tweet-economist/2021/3/1374499219344482309.json": "The American West has endured multiple prolonged periods of drought since 2000, which have made it impossible for the country’s biggest reservoirs to fully recover  https://t.co/dHzXiZeM6P",
  "data/tweet-economist/2021/3/1374398915844263944.json": "Free societies now need to muster a response to China, and to prepare their defences for the long struggle ahead https://t.co/ArWTjGeRl2",
  "data/tweet-economist/2021/3/1374578235653115909.json": "Donald Trump’s presidency kicked off with a lie about the size of the crowd at his inauguration and degenerated into a four­-year extravaganza of flim­-flam. Cass Sunstein's book examines rampant dishonesty https://t.co/GiN7arUO7E",
  "data/tweet-economist/2021/3/1374595529632591875.json": "The link between personality and success https://t.co/K4ql6kRM1i",
  "data/tweet-economist/2021/3/1374609601430179843.json": "Human beings are not alone in having invented vaccination. In fact, a new paper confirms that honeybees got there first https://t.co/Mb7AFxO90W",
  "data/tweet-economist/2021/3/1374614142838050819.json": "“Zack Snyder’s Justice League” must be the most expensive and extensive salvage job in cinema history https://t.co/kTe5yY5Z65",
  "data/tweet-economist/2021/3/1374628378259623938.json": "The Japanese art of repair https://t.co/fGmAROIg0r",
  "data/tweet-economist/2021/3/1374641855040733185.json": "It can be hard to tell what’s fact and what’s fake. Time to learn the techniques – and language – of disinformation. From @1843mag https://t.co/CuTv2Nyugq",
  "data/tweet-economist/2021/3/1374653658147790853.json": "China’s rulers believe they have found a way to marry brutality with commercial predictability. How should free societies respond? https://t.co/QiMGZ2neXx",
  "data/tweet-economist/2021/3/1374723958990381064.json": "Southerners like their pho sweet and spicy, northerners prefer it crisp and pure — the dish still draws a boundary through Vietnam https://t.co/evFnqttZC2",
  "data/tweet-economist/2021/3/1374716399956983823.json": "In post-election Uganda, supporters of Bobi Wine's National Unity Platform are being kidnapped and tortured. Some have disappeared altogether https://t.co/1E2f0hJIIC",
  "data/tweet-economist/2021/3/1374780576738250768.json": "The AstraZeneca jab is cheaper to produce and easier to store and distribute than the vaccines currently being administered across Europe https://t.co/8USbZTsubp",
  "data/tweet-economist/2021/3/1374840249927491585.json": "A traffic jam of ships has formed along one of the world’s most important sea-lanes, creating a problem for global shipping  https://t.co/lQN1TqssSw",
  "data/tweet-economist/2021/3/1374885767068184578.json": "How the British became the new Turks https://t.co/DB2YU817NK",
  "data/tweet-economist/2021/3/1374912984179478533.json": "A third wave of infections is sweeping through Europe, forcing many governments to tighten or reimpose lockdowns https://t.co/0SWNgXNgje",
  "data/tweet-economist/2021/3/1374923120977588225.json": "When religion was added to Britain's census in 2001, 400,000 people identified as “Jedi” https://t.co/eNuMooIgaj",
  "data/tweet-economist/2021/3/1374930812903260160.json": "Last year nearly 19,000 vessels traversed the Suez Canal. When news of the accident broke, the price of crude oil shot up by 5% https://t.co/buCsBFVoxk",
  "data/tweet-economist/2021/3/1374953060846473219.json": "China will subject liberal values to their greatest test since the early days of the cold war https://t.co/WboYJZt3jk",
  "data/tweet-economist/2021/3/1374944088819167232.json": "We explore when #MilkTeaAlliance was first used, and explain why it is so significant to activists in South-East Asia https://t.co/OjOv1SV6Zb",
  "data/tweet-economist/2021/3/1374969692058755076.json": "A recent discovery made in the depths of Lake Zug, in Switzerland, sheds light on the make-up of the first cells that eventually led to humans https://t.co/NPr0N4ObHT",
  "data/tweet-economist/2021/3/1374961254079590400.json": "An abundance of dollars is causing a headache for banks and investors https://t.co/6O1Puaqg4d",
  "data/tweet-economist/2021/3/1374828966310215682.json": "President Biden has called for stricter gun-control laws after mass shootings in Boulder and Atlanta. In 2020, we asked leading campaigners against gun violence what should be done to stop it https://t.co/kShQ7VXrwe",
  "data/tweet-economist/2021/3/1375009620775862274.json": "Nuclear power is one of the safest, most reliable and sustainable forms of energy, and decarbonising will be much more difficult without it https://t.co/BTPMBrRSi0",
  "data/tweet-economist/2021/3/1374985809389096961.json": "Even a short closure of the bottleneck threatens severe disruption https://t.co/x1UZSP1SCL",
  "data/tweet-economist/2021/3/1375050137970610177.json": "A third wave of covid-19 is spreading across the world. Our data journalists have been tracking the rise in cases. Thread https://t.co/fY0GSClDMZ",
  "data/tweet-economist/2021/3/1374895601385668609.json": "Britney Spears’s concert residency in Las Vegas from 2013 to 2017 earned $138m in ticket sales—but she has no say over her share https://t.co/Rj5YWfCfYB",
  "data/tweet-economist/2021/3/1375139203508502539.json": "Brazil’s mismanagement of covid-19 threatens the world https://t.co/V9JTGUfMTz",
  "data/tweet-economist/2021/3/1375144724697395201.json": "It took ten years of work to decipher the genome of a virus for the first time, in 1976. The SARS-CoV-2 genome was published weeks after the virus was discovered and became the basis for the vaccines in use today https://t.co/L37QVDoST5",
  "data/tweet-economist/2021/3/1375156043441917953.json": "How the British became the new Turks https://t.co/t5zyaYS928",
  "data/tweet-economist/2021/3/1375165095219724296.json": "Boris Johnson wants to restrict the right to protest https://t.co/FRDGxUAnLn",
  "data/tweet-economist/2021/3/1375149749934915598.json": "A traffic jam of ships has formed along one of the world’s most important sea-lanes, creating a problem for global shipping  https://t.co/dERBJDSuOy",
  "data/tweet-economist/2021/3/1375170899637366787.json": "Several studies show that, even if face-mask wearers do get covid-19, their disease is milder. Now researchers think they may have worked out why https://t.co/mDRkRPqZkr",
  "data/tweet-economist/2021/3/1375175734533177349.json": "This week’s cartoon from KAL: https://t.co/iptXYhcME2 https://t.co/AD0LmRl3v8",
  "data/tweet-economist/2021/3/1374939856070131713.json": "Why the internet has not freed China https://t.co/aD7rgHBhBO",
  "data/tweet-economist/2021/3/1375183232862412809.json": "People with learning difficulties, intellectual disabilities and autism are all over­represented in prisons. They deserve more help  https://t.co/6ioX6uamHu",
  "data/tweet-economist/2021/3/1374927525223227399.json": "China’s “real” growth may not be as real as it claims to be https://t.co/JAQsbOdOSX",
  "data/tweet-economist/2021/3/1375098124683857925.json": "Covid-19 has brought together biomedical technologies that will transform human health. The world must use them wisely. Our cover this week https://t.co/69u5mzGpG9 https://t.co/P3J88p3l2N",
  "data/tweet-economist/2021/3/1375105719863758848.json": "“Quantum mechanics should have an influence on culture, I believe, like the Copernican revolution did.” @carlorovelli explains why the intellectual revolution of quantum theory is a game-changer. Listen to “Babbage” https://t.co/ZnFMxEaW6N https://t.co/ATWeD1elnr",
  "data/tweet-economist/2021/3/1375259277041012742.json": "It is striking that offenders with attention-­deficit hyperactivity disorder who take their medication are a third less likely to reoffend than those who do not  https://t.co/0VPDXjasl2",
  "data/tweet-economist/2021/3/1375243719117582339.json": "The Japanese art of repair https://t.co/XM6ltIDF7Z",
  "data/tweet-economist/2021/3/1375280029454770176.json": "The vaccination technology rapidly developed by Moderna and BioNTech builds on years of patient and often unsung work on RNA https://t.co/GNAZ4JWMO1",
  "data/tweet-economist/2021/3/1375308558380761089.json": "Honeybees are at constant risk of diseases sweeping through their hives. So, queen bees vaccinate their unlaid eggs with fragments of proteins from disease-causing pathogens https://t.co/w5KXLDTrYx",
  "data/tweet-economist/2021/3/1375300501839998983.json": "“Quantum mechanics should have an influence on culture, I believe, like the Copernican revolution did.” @carlorovelli explains why the intellectual revolution of quantum theory is a game-changer. Listen to “Babbage” https://t.co/h8c57QWzpx https://t.co/yMh18Gajvb",
  "data/tweet-economist/2021/3/1375221985597345794.json": "Kintsugi, as two books indicate, is a glue for scattered ideas. But its core story, of repair that dignifies the fractures and scars of the past, is as simple as it is seductive https://t.co/OYpjhnn0Or",
  "data/tweet-economist/2021/3/1375330573582020613.json": "Boris Johnson wants to restrict the right to protest https://t.co/cMWLDQ32NQ",
  "data/tweet-economist/2021/3/1375334700257001474.json": "Sexual selection occurs when one sex chooses another on the basis of a distinctive genetically derived characteris­tic. For example, a peacock's tail https://t.co/nd3mpWf3Xi",
  "data/tweet-economist/2021/3/1375343355689717761.json": "Why the internet has not freed China https://t.co/1sN4J3l7Cr",
  "data/tweet-economist/2021/3/1375187613448089606.json": "Opponents to President Museveni are going missing. The state has given few answers in response to allegations of state-sponsored kidnap and torture https://t.co/g4vOyoCCeS",
  "data/tweet-economist/2021/3/1375378254807322635.json": "One of the world's largest container ships is wedged across the Suez Canal. It has created a headache for global shipping and trade https://t.co/UDz1k7eLof",
  "data/tweet-economist/2021/3/1375166859302031365.json": "In 1972 GDP per person was almost 40% lower in Bangladesh than in Pakistan. Now it is more than 40% higher. This is no thanks to the country's leadership https://t.co/fBTeFXWDnh",
  "data/tweet-economist/2021/3/1375405844578308101.json": "British jails will soon have to screen all inmates who have experienced domestic violence for brain injuries. Such checks should be extended to all prisoners https://t.co/7SN6s55E0f",
  "data/tweet-economist/2021/3/1375374501408563201.json": "The techniques used to make a SARS-CoV-2 vaccine could one day help tackle malaria, some cancers and many other diseases https://t.co/xx9wqzd6bQ",
  "data/tweet-economist/2021/3/1375365014270382080.json": "Families have been trekking between prisons, barracks and police stations in a desperate search for their loved ones. Hundreds have disappeared in post-election Uganda https://t.co/PzZwtQ1hyM",
  "data/tweet-economist/2021/3/1375348256658575362.json": "Covid-19 vaccines have alerted the world to the power of RNA therapies https://t.co/gYrQ1XSCs8",
  "data/tweet-economist/2021/3/1375399637713092609.json": "An abundance of dollars is causing a headache for banks and investors https://t.co/p3ovP6x01X",
  "data/tweet-economist/2021/3/1375499567760879625.json": "Brazil's recorded covid-19 death toll is a quarter of the world’s total. The country has less than 3% of the global population https://t.co/VVhn0ojNEs",
  "data/tweet-economist/2021/3/1375177524779573251.json": "RT @gadyepstein: I wrote about growing pressure on corporate sponsors and political leaders over the 2022 Olympics in Beijing. As you can i…",
  "data/tweet-economist/2021/3/1375546868550270988.json": "Around 10% of the world's oil and 12% of global trade goes up and down the Suez Canal. Even a short closure of the bottleneck threatens severe disruption https://t.co/7NxxE4mSir",
  "data/tweet-economist/2021/3/1375513408116695040.json": "Bangladeshis are not just vastly wealthier than in 1971, but healthier and better educated too https://t.co/pLFYqaU7Xu",
  "data/tweet-economist/2021/3/1375569022905909251.json": "Aerial aircraft-carriers capable of launching and recover­ing uncrewed drones in flight would allow seaborne carriers to be kept well out of harm's way https://t.co/TxgIRapzHd",
  "data/tweet-economist/2021/3/1375590941118070785.json": "In 25 of Brazil's 27 states, more than 80% of intensive ­care beds are occupied. The shock of the second wave is now changing people’s behaviour https://t.co/RK80x3dIEW",
  "data/tweet-economist/2021/3/1375607180636917762.json": "More people claim to have “no religion” in America than to be Catholic or evangelical Christian, yet the country is not becoming less devotional  https://t.co/7IzALvAjZM",
  "data/tweet-economist/2021/3/1375595698406707200.json": "The potential construction of 6,000 flats in the city of Vancouver would be the largest private indigenous development in Canada https://t.co/lVRtBJPCWQ",
  "data/tweet-economist/2021/3/1375609025862250496.json": "So far no country appears likely to refuse to send athletes, and corporate sponsors have not budged. But as the games draw closer, calls for boycotts will get louder https://t.co/OlgKJaOwjO",
  "data/tweet-economist/2021/3/1375567272010522630.json": "It still needs to be approved by President Andrés Manuel López Obrador, but a bill that would legalise recreational marijuana use in Mexico is expected to pass https://t.co/PDQj0pXrVf",
  "data/tweet-economist/2021/3/1375639991670472704.json": "Vaccines made of RNA have given millions of people protection against covid-19. Now these are being considered for all sorts of other diseases https://t.co/kcXsssF9B5",
  "data/tweet-economist/2021/3/1375679103014162435.json": "The Suez Canal is one of many narrow choke-points on which maritime trade relies https://t.co/60e3zSxhjQ",
  "data/tweet-economist/2021/3/1375583374287515663.json": "Turkey has handled the pandemic better than most big European countries. Before the central-bank governor was sacked, the IMF predicted 6% growth this year https://t.co/IoIvLKJSKi",
  "data/tweet-economist/2021/3/1375694301015998466.json": "Barely 10% of American workers belong to a labour union but 65% of Americans approve of them  https://t.co/SaKpBlpPx5",
  "data/tweet-economist/2021/3/1375701498487799814.json": "As crime data from 2020 are compiled, one thing has become clear: American cities saw the biggest rise in homicides in decades https://t.co/day8mBWXRJ",
  "data/tweet-economist/2021/3/1375742162562863104.json": "There are 264 virus species known to infect humans. To prevent the next pandemic, why not track them all? And why stop there? https://t.co/2Utg97UAr9",
  "data/tweet-economist/2021/3/1375600734645972994.json": "A study of south American songbirds by Sheela Turbek of the University of Colorado helps fill a gap in the theory of evolution https://t.co/RZbKnFQs5t",
  "data/tweet-economist/2021/3/1375753226591600640.json": "India now has 177 billionaires, up from 100 in 2017. Both the newcomers and the dropouts from the country's rich list tell a story of transformation https://t.co/doWo7fvIzu",
  "data/tweet-economist/2021/3/1375626023107244035.json": "A group of physicists may have found a means to extend the Standard Model of reality. It involves particles called beauty quarks https://t.co/UdRBHw7vDx",
  "data/tweet-economist/2021/3/1375803550190690309.json": "The price of crude shot up by 5% on news of the disruption https://t.co/cskxuRgZ4Q",
  "data/tweet-economist/2021/3/1375808099190255620.json": "Ronald Reagan’s tax cutting programme was so radical even his own vice president called it “voodoo economics.” Our “Checks and Balance” podcast asks if his revolution is unravelling https://t.co/ZXWE6VFjsz https://t.co/LvXyVY0Kxv",
  "data/tweet-economist/2021/3/1375806325444243462.json": "Several canals have undergone significant expansion projects to allow bigger ships to pass. We explain why an easier solution might be to bypass choke-points altogether https://t.co/jl5xLmpEwU",
  "data/tweet-economist/2021/3/1375790469188313088.json": "Sponsors of the games face growing pressure. Activists say they may “publicly name and shame” such companies https://t.co/MUBROfCSiH",
  "data/tweet-economist/2021/3/1375824433538080768.json": "The pandemic has brought the sharp joy of seeing decades of cumulative scientiﬁc progress in sudden, concerted action. The result will transform human health https://t.co/bhvQmTkrnO",
  "data/tweet-economist/2021/3/1375760780180721666.json": "\"The nowhere office\" where employees shift between office, home and local coffee shops could become a permanent model  https://t.co/ZDGy2meVIo",
  "data/tweet-economist/2021/3/1375735113300983809.json": "Researchers at America's defence department have plans for Gremlins (drones) to \"go in and create havoc\" before returning to an aerial mothership https://t.co/dQELKu2eAZ",
  "data/tweet-economist/2021/3/1375832758187143170.json": "Brazil's second wave is most likely caused by P.1, a variant that originated in Manaus. It may be both more contagious than earlier versions and able to reinfect people https://t.co/Pusyk5cSx5",
  "data/tweet-economist/2021/3/1375832253448732672.json": "Americans have rejected the institutions of religion but not the religious urge, such as a yearning for moral certainty and community https://t.co/XvZZJum3T2",
  "data/tweet-economist/2021/3/1375772124082798592.json": "Paul Kagame has had a hand in overthrowing at least three governments in three countries. Yet donors seem to love him https://t.co/ZTp1cKFsqt",
  "data/tweet-economist/2021/3/1375685030673063936.json": "Officials claim that efforts to trigger precipitation by scattering chemicals in the sky have been hugely successful. But evidence is sparse https://t.co/C0iKCpEK3j",
  "data/tweet-economist/2021/3/1375855179157889029.json": "Punishing people without also offering them the help they need is short-sighted and wrong  https://t.co/AkcLaQBhgw",
  "data/tweet-economist/2021/3/1375823178363199489.json": "If female support continues to rise, then it would remove a significant obstacle in the path to independence  https://t.co/dRsy9i8d7i",
  "data/tweet-economist/2021/3/1375865223429689348.json": "Ronald Reagan’s tax cutting programme was so radical even his own vice president called it “voodoo economics.” Our “Checks and Balance” podcast asks if his revolution is unravelling https://t.co/09q3nkUsbH https://t.co/ANC6Am5Anp",
  "data/tweet-economist/2021/3/1375886021464887305.json": "Extreme weather events are becoming more frequent due to climate change. Will the losses mean some property becomes uninsurable? https://t.co/hI3JWtDnA3 https://t.co/Eh7h3WbeEs",
  "data/tweet-economist/2021/3/1375855649586810881.json": "Genes encoding two proteins involved in handling fermentation products first appeared in the line that led to Homo sapiens some 10m years ago https://t.co/jGgraVt9Sy",
  "data/tweet-economist/2021/3/1375923601182969857.json": "After months of delay and as a devastating second wave of covid-19 gets worse, Brazil has finally started domestic production of vaccines https://t.co/Q6AHdnxQgT",
  "data/tweet-economist/2021/3/1375926624407986182.json": "Ronald Reagan’s tax cutting programme was so radical even his own vice president called it “voodoo economics.” Our “Checks and Balance” podcast asks if his revolution is unravelling https://t.co/qHxVHUdBrx https://t.co/jaUTTXwePT",
  "data/tweet-economist/2021/3/1375909242016825346.json": "President Erdogan's accumulation of political power and audacity has been followed by economic recklessness and some volatility https://t.co/YC8yJk5Gra",
  "data/tweet-economist/2021/3/1375959078665609222.json": "The Ku Klux Klan began burning crosses and wearing white hoods only after those symbols appeared in the film https://t.co/JkHRO3cYcJ",
  "data/tweet-economist/2021/3/1375958094908436480.json": "Housing is in short supply in Vancouver, the second-most-expensive city in the world. One Canadian indigenous group has a plan to change that https://t.co/FmIns5chb0",
  "data/tweet-economist/2021/3/1375946502288343044.json": "The aerial aircraft­-carrier of choice for America's defence department is a modified car­go plane, which could carry up to four Gremlin drones https://t.co/3B7aoAM51P",
  "data/tweet-economist/2021/3/1375916313193938948.json": "An ambitiously wide-ranging account of the forces that propelled the writing of constitutions https://t.co/X7jvMDdmJo",
  "data/tweet-economist/2021/3/1375971671052541959.json": "The Olympic charter promotes “respect for universal fundamental ethical principles”. China's human-rights record is problematic for the IOC https://t.co/Civu2uwNul",
  "data/tweet-economist/2021/3/1376002855761547266.json": "If Mexico were to legalise marijuana, the country would become the world’s largest legal cannabis market https://t.co/H4tR0k381J",
  "data/tweet-economist/2021/3/1375914795057221634.json": "More than 20,000 people took to the streets of the German city of Kassel earlier this month to protest against lockdown restrictions https://t.co/B1OusO912M",
  "data/tweet-economist/2021/3/1376009679319527424.json": "The ability of a single vessel to cripple one of the world's most vital trade routes for this long is a reminder of the fragility of supply chains  https://t.co/uhziBLOvtg",
  "data/tweet-economist/2021/3/1375999732410159104.json": "A new paper gives an insight into why two birds that are separated by just 12 genes do not breed with each other https://t.co/0wcfE27mod",
  "data/tweet-economist/2021/3/1375981227904270338.json": "The vote for unionisation at an Amazon plant in Alabama has drawn national attention https://t.co/pfHumiKh4Q",
  "data/tweet-economist/2021/3/1376012687101079554.json": "American cities saw an estimated 30% increase in homicides in 2020—the highest annual increase in more than 50 years   https://t.co/n0yemk0yOA",
  "data/tweet-economist/2021/3/1376028552815075329.json": "The tendency to reject religious institutions has given rise to a lot of heterodox thinking in America, even within its shrunken congregations https://t.co/wEEoc1BOsL",
  "data/tweet-economist/2021/3/1376032649077215234.json": "Women reporting abuse are often brushed aside. But men who threaten violence are sometimes bought off with property or child custody https://t.co/aDsOyI0QBB",
  "data/tweet-economist/2021/3/1376044651967348741.json": "At its peak, Kolkata was home to 50,000 ethnic Chinese. The community now numbers perhaps 2,500 https://t.co/WS6ZwBcoem",
  "data/tweet-economist/2021/3/1376061004900134914.json": "Activists fear a repeat of 2008, when China used the summer games to flex its metaphorical muscles https://t.co/dAQdDb6v67",
  "data/tweet-economist/2021/3/1376082089104318464.json": "Did Kim Kardashian really say this? https://t.co/s0O5S9Ftrb https://t.co/BWGaMbw5K8",
  "data/tweet-economist/2021/3/1376093727324782594.json": "There are two main arguments in favour of legalising marijuana: money and medicine https://t.co/D5zQFRoKXE",
  "data/tweet-economist/2021/3/1376089200911585280.json": "The Ever Given was blown off course by high winds, creating a bottleneck across one of the world's most important trading routes https://t.co/rKtMt3cQwD",
  "data/tweet-economist/2021/3/1376118259293024257.json": "European politicians are still wary of America, despite the overtures of Joe Biden’s White House. The brush with Donald Trump left some leaders arguing that the EU should be ready to flee   https://t.co/pMWH2haHil",
  "data/tweet-economist/2021/3/1376131118328594434.json": "Global population shrinkage looms: nearly half the world’s people now live in countries with fertility rates below replacement levels https://t.co/6dKyVmsRwA",
  "data/tweet-economist/2021/3/1376126176205357058.json": "Economic hardship, psychological exhaustion and scepticism about governments’ handling of the pandemic are mounting https://t.co/I1W3GclEtD",
  "data/tweet-economist/2021/3/1376138503512322049.json": "There are RNA-based drugs in clinical trials for the treatment of cancer, heart disease and numerous inherited disorders—as well as brain diseases https://t.co/0HUYwbaMgF",
  "data/tweet-economist/2021/3/1376155631183396865.json": "In 1972 GDP per person was almost 40% lower in Bangladesh than in Pakistan. Now it is more than 40% higher. This is no thanks to the country's leadership https://t.co/JXDry1IhhI",
  "data/tweet-economist/2021/3/1376153867021398027.json": "The Ever Given’s stubborn refusal to refloat has launched a thousand memes, but the economic damage is no joke https://t.co/YpV2z2EGUW",
  "data/tweet-economist/2021/3/1376148401214087171.json": "Some foreign retailers have been booted off Chinese apps, closed stores in the country and been publicly renounced by Chinese celebrities https://t.co/a89z8PcOAl",
  "data/tweet-economist/2021/3/1376154378491604994.json": "The Squamish Nation hope a new housing project will bring in roughly C$20bn ($16bn) over 99 years. This money could be spent on education and health care  https://t.co/VXa2FQV0Ra",
  "data/tweet-economist/2021/3/1376165695189303296.json": "The next pandemic could be spotted almost before it has begun https://t.co/EUrhXVjKkv",
  "data/tweet-economist/2021/3/1376124419526045697.json": "Get ready to ask people you meet not \"where do you work?\" but \"when do you work?\" https://t.co/XAx0ChgXoA",
  "data/tweet-economist/2021/3/1376167955537477632.json": "IOC officials say boycotts punish sport and do not work. But some countries' leaders may still stay away, as may athletes https://t.co/eN2xAdBZcF",
  "data/tweet-economist/2021/3/1376180535496695814.json": "The techniques used to make a SARS-CoV-2 vaccine could one day help tackle malaria, some cancers and many other diseases https://t.co/tLVPshqwes",
  "data/tweet-economist/2021/3/1376184334588252167.json": "Legal weed can generate millions in tax revenue for governments and offer relief to people suffering from chronic pain https://t.co/SkeV03iJP2",
  "data/tweet-economist/2021/3/1376192641910591492.json": "The vote for unionisation at an Amazon plant in Alabama is happening at a moment that looks unusually ripe for unions https://t.co/IcmcYSvmY5",
  "data/tweet-economist/2021/3/1376208732611350532.json": "Foreign apparel firms have been working to clear their supply chains of the forced labour of Uyghurs in Xinjiang. But China's government is increasingly keen to punish critics https://t.co/AuMifx3avv",
  "data/tweet-economist/2021/3/1376153359216967682.json": "Only a few of China’s rainmakers use planes. More often they fire silver iodide into the sky from artillery pieces https://t.co/09LUUEkkfM",
  "data/tweet-economist/2021/3/1376225079621746690.json": "Brazil's recorded covid-19 death toll is a quarter of the world’s total. The country has less than 3% of the global population https://t.co/VLgrAWndbz",
  "data/tweet-economist/2021/3/1376203443589775368.json": "The American army plans to use helicopters fitted with drone-launching pneumatic tubes as motherships for its drones https://t.co/TT8vFIoLq4",
  "data/tweet-economist/2021/3/1376138285353959427.json": "As President Erdogan’s party has accumulated power and audacity, it has eroded the institutional constraints that once ensured economic stability, including the autonomy of Turkey's central bank https://t.co/J3zeD5C0aT",
  "data/tweet-economist/2021/3/1376245225660821509.json": "There are RNA-based drugs in clinical trials for the treatment of cancer, heart disease and numerous inherited disorders—as well as brain diseases https://t.co/JNhmDUf2P7",
  "data/tweet-economist/2021/3/1376233329129889792.json": "Can planting trees offset carbon emissions produced by burning fossil fuels? https://t.co/qit37SSZKF https://t.co/usqAfbAUH9",
  "data/tweet-economist/2021/3/1376057071318228992.json": "Bangladesh has 11 brothel-villages, a legacy of British imperialism. This is the story of one of them. In partnership with @FullerProject https://t.co/sMWngeVKBQ",
  "data/tweet-economist/2021/3/1376246978242351104.json": "Anti-lockdown protests are not exclusive to the political right or left. Nor do they appear to be correlated with the severity of outbreaks https://t.co/A0z3gJRrJm",
  "data/tweet-economist/2021/3/1376260057667616768.json": "Residents of one area in Vancouver resist the construction of tall buildings. But they cannot stop the Squamish First Nation from erecting skyscrapers https://t.co/JnAR2hLXgt",
  "data/tweet-economist/2021/3/1376263344060039174.json": "New research by anthropologist Katherine Amato suggests that human beings’ love of all things fermented has deep evolutionary roots https://t.co/8fkgvILh1K",
  "data/tweet-economist/2021/3/1376161913856479235.json": "Britain is not being flooded by refugees: 36,000 people applied for asylum in 2019, a third as many as in France https://t.co/jmp2VFt8GT",
  "data/tweet-economist/2021/3/1376259806772801544.json": "The Reagan years are misremembered as a time of inexorable tax, deficit and spending cuts. But the president raised all three at different times. Our “Checks and Balance” podcast asks if his revolution is unravelling https://t.co/c4UW5XXo0S https://t.co/UZAS4M6QNO",
  "data/tweet-economist/2021/3/1376269144514043907.json": "An online mob demanded that brands such as H&amp;M, Nike and Uniqlo retract past statements about forced labour in Xinjiang if they expect to make money in China https://t.co/6g8XGUqYs3",
  "data/tweet-economist/2021/3/1376274921110827009.json": "Many countries legalise medical marijuana before turning to the recreational variety—Mexico did so in 2017 https://t.co/YClOpxcLZE",
  "data/tweet-economist/2021/3/1376281700905418754.json": "“You can use it to make any protein you like...in effect making an artificial immune system” Geoff Carr, The Economist’s science editor, explains how the potential of mRNA goes beyond covid-19 vaccines, on “Babbage” https://t.co/5nd37v0krJ",
  "data/tweet-economist/2021/3/1376301078283755520.json": "After months of delay and as a devastating second wave of covid-19 gets worse, Brazil has finally started domestic production of vaccines https://t.co/7Uh2vltB9t",
  "data/tweet-economist/2021/3/1376290761206038529.json": "The French armed forces are beginning to prepare for the return of a major conflict. A full-scale divisional exercise is planned for 2023 https://t.co/Qr7f6naRF1",
  "data/tweet-economist/2021/3/1376267114659602434.json": "A former head of sustainability at BlackRock has described ESG investing as \"little more than marketing hype, PR spin and disingenuous promises\" https://t.co/yvjL8ViUAX",
  "data/tweet-economist/2021/3/1376224072229654530.json": "Despite its magnitude, America’s increased murder rate has gone comparatively unremarked on by national politicians https://t.co/WpwirevHdm",
  "data/tweet-economist/2021/3/1376313003059126273.json": "Women initiate 70% of divorces in China. Often they are pressed to give up property or make crippling cash payments to a spouse to “buy” their freedom https://t.co/b4qu8Upz8e",
  "data/tweet-economist/2021/3/1376329781042626563.json": "In 25 of Brazil's 27 states, more than 80% of intensive ­care beds are occupied. The shock of the second wave is now changing people’s behaviour https://t.co/dkYfUrXe9r",
  "data/tweet-economist/2021/3/1376316839526031364.json": "The International Olympic Committee says the games are about sport, not politics, and will go ahead. But a boycott movement could gain momentum https://t.co/ywBM5yTpAG",
  "data/tweet-economist/2021/3/1376222058984660999.json": "A new paper argues that any positive economic effects that come from a shrinking population may be cancelled out by the reduction in humankind’s creative capacity https://t.co/TAprV1IZ28",
  "data/tweet-economist/2021/3/1376392971847864326.json": "Some have hailed the displacement of religious fervour into the secular realm as proof of the “God-shaped hole” in America https://t.co/0XklOP0M4T",
  "data/tweet-economist/2021/3/1376389176787091457.json": "A racist film was played all across America for three years. In places where it was shown, racist violence surged afterwards https://t.co/TRkaZ9sLTv",
  "data/tweet-economist/2021/3/1376406139139657728.json": "The Burmese people’s opposition to the coup is unwavering. Spilling yet more blood is unlikely to break their spirit https://t.co/D9rUFdpNDB",
  "data/tweet-economist/2021/3/1376416093640785926.json": "Joe Biden’s plans to fix America post-pandemic could add up to a $5 trn splurge. Is big government back? This week’s “Checks and Balance” podcast finds out https://t.co/TmIMKvlvNM",
  "data/tweet-economist/2021/3/1376440007154675717.json": "If an Olympic boycott movement gains momentum, it may be due as much to China’s behaviour abroad as to its abuses at home https://t.co/OMJ3dfdizx",
  "data/tweet-economist/2021/3/1376066303438491651.json": "“Quantum mechanics should have an influence on culture, I believe, like the Copernican revolution did.” @carlorovelli explains why the intellectual revolution of quantum theory is a game-changer. Listen to “Babbage” https://t.co/iNZQuavBWa https://t.co/5rxo3kQ7rP",
  "data/tweet-economist/2021/3/1376482033443217409.json": "Brazil's second wave is most likely caused by P.1, a variant that originated in Manaus. It may be both more contagious than earlier versions and able to reinfect people https://t.co/lG3tUoGyAx",
  "data/tweet-economist/2021/3/1376436341249036290.json": "France’s approach to future war differs from the tech-heavy vision recently unveiled by Britain https://t.co/Kk3KMdUCF9",
  "data/tweet-economist/2021/3/1376459113564110853.json": "Melting permafrost is causing landslides and avalanches in Longyearbyen, a town on the archipelago of Svalbard in Norway https://t.co/KMNricx6yX",
  "data/tweet-economist/2021/3/1376465115202134022.json": "A new study suggests that, in order to open and eat fruits with tough husks, human beings' ancestors first let them ferment https://t.co/AP6wFeBeom",
  "data/tweet-economist/2021/3/1376500673899081734.json": "Pho is the story of Vietnamese independence in a warm, soupy bowl. From @1843mag https://t.co/jUYGHUZcix",
  "data/tweet-economist/2021/3/1376576898915049473.json": "The Reagan years are misremembered as a time of inexorable tax, deficit and spending cuts. But the president raised all three at different times. Our “Checks and Balance” podcast asks if his revolution is unravelling https://t.co/D9yF52gOAq https://t.co/RINhtylGb7",
  "data/tweet-economist/2021/3/1376287990281035779.json": "Public sentiment in Iraq has turned. The masses who cheered Iran as a liberator increasingly see it as an occupying power https://t.co/7Us2ye8fjp",
  "data/tweet-economist/2021/3/1376692217092390919.json": "China's government is forcing foreign companies to make a choice they have been studiously trying to avoid: support China or get out of the Chinese market https://t.co/34CXZoH1xy",
  "data/tweet-economist/2021/3/1376680330099372041.json": "As spending has spiked and the economy has faltered, America’s national debt stands above $27trn, or around 130% of GDP https://t.co/jRwn41knjM",
  "data/tweet-economist/2021/3/1376668889174704129.json": "Rich countries continue to contribute, through their consumption, to the levelling of vast tracts of forests in poor countries https://t.co/09Ov7zqdBJ",
  "data/tweet-economist/2021/3/1376711048066179078.json": "The Ku Klux Klan began burning crosses and wearing white hoods only after those symbols appeared in the film https://t.co/FRRpTzH7rh",
  "data/tweet-economist/2021/3/1376705678744641537.json": "By the middle of the 2020s shortages of minerals for lithium-ion batteries could reverse the long decline in the price of batteries https://t.co/S2DrhZsPWT",
  "data/tweet-economist/2021/3/1376720751814979585.json": "We're hiring for two paid fellowships in America. Successful applicants will write articles about politics and policy in the United States https://t.co/UCRYD93T57",
  "data/tweet-economist/2021/3/1376730297245560832.json": "Countries such as Japan, Germany, China and America each have a unique deforestation footprint https://t.co/OkP27bzrXX",
  "data/tweet-economist/2021/3/1376735568885866507.json": "America is once again trying to kick-start its economy. Yet when Joe Biden held his first press conference as president, he felt no need to mention deficits at all https://t.co/oySFDInjuU",
  "data/tweet-economist/2021/3/1376750030510510080.json": "Brain injuries are startlingly common among those who have committed crimes https://t.co/OU2Y8THeqU",
  "data/tweet-economist/2021/3/1376725033607913474.json": "Nawal El-Saadawi shot the taboo of genital mutilation into general conversation and, along with it, herself into electric peril  https://t.co/ixWlnngs3O",
  "data/tweet-economist/2021/3/1376783798420013059.json": "Chris Bail, a sociologist at Duke University, explains in his new book why exposure to different opinions online often leads to ideological entrenchment rather than away from it  https://t.co/Hch96qIhjp",
  "data/tweet-economist/2021/3/1376759652134883329.json": "War propelled the writing of constitutions https://t.co/y4ziYvthdo",
  "data/tweet-economist/2021/3/1376812354940321796.json": "The environmental impact of losing three Amazonian trees might be more severe than the loss of 14 trees in a country like Norway https://t.co/JWcaCZTtdG",
  "data/tweet-economist/2021/3/1376841329221775361.json": "Amazon could get its first unionised workforce in America https://t.co/vxhDK5srvy",
  "data/tweet-economist/2021/3/1376806955654725633.json": "Can the aviation industry fully recover from the effects of the pandemic? https://t.co/z7ilEftZDy https://t.co/ckPYsddZWa",
  "data/tweet-economist/2021/3/1376855686689218567.json": "When participants in a recent study came across opposing political views online they often felt resentful or even threatened  https://t.co/oNRFPXTXDd",
  "data/tweet-economist/2021/3/1376903971323973633.json": "The destruction of biodiverse places like the Amazon rainforest cannot be mitigated by planting trees elsewhere https://t.co/91xn7vYIqz",
  "data/tweet-economist/2021/3/1376941295915167761.json": "By 2050 output of lithium, cobalt and graphite would have to be more than 450% higher than in 2018 to meet demand for batteries https://t.co/o1zWwKTd47",
  "data/tweet-economist/2021/3/1376957657756659717.json": "Nuclear power is one of the safest, most reliable and sustainable forms of energy, and decarbonising will be much more difficult without it https://t.co/eFsJFPLMlg\n\nhttps://t.co/PooCt2iX5z",
  "data/tweet-economist/2021/3/1376927442082922497.json": "In prison, while the other women wept, Nawal El-Saadawi sang, danced and wrote a memoir on toilet paper using a smuggled eye-pencil https://t.co/XXAeFDrF1p",
  "data/tweet-economist/2021/3/1377068246013259777.json": "Deaths from synthetic opioids—the biggest killer—were up by 52% year-on-year in the 12 months to August https://t.co/fJbxpw3qbO",
  "data/tweet-economist/2021/3/1377029905284792321.json": "The Reagan years are misremembered as a time of inexorable tax, deficit and spending cuts. But the president raised all three at different times. Our “Checks and Balance” podcast asks if his revolution is unravelling https://t.co/RgWV32Xndf https://t.co/WxoNZ9yyr9",
  "data/tweet-economist/2021/3/1377137484572684292.json": "Once fatalities are fully tallied for 2020, it is likely to be the deadliest year yet in America’s opioid epidemic https://t.co/fjx9buatR7",
  "data/tweet-economist/2021/3/1377278592158171139.json": "April fools used to bring us joy and laughter. Then fake news came along and spoiled it https://t.co/Gp3m2Qhx0p",
  "data/tweet-economist/2021/3/1377297748853198849.json": "RT @DuncanWeldon: This week I went to what we now have to call “the red wall”.\nIf you step out of the town centres that have often seen bet…",
  "data/tweet-economist/2021/3/1377121543193419777.json": "In January France's general staff quietly established ten working groups to examine the country’s readiness for high-intensity war https://t.co/0RE1hvpaTD",
  "data/tweet-economist/2021/3/1377318302968594443.json": "Joe Biden’s $2trn infrastructure plan, which the administration claims it will pay for by hiking corporation taxes, would be unprecedented in recent decades https://t.co/YZ6F44dVKR",
  "data/tweet-economist/2021/3/1377297655953555467.json": "RT @DSORennie: This week I asked several experienced Western envoys to Beijing to explain China's recent, v assertive diplomacy. The most s…",
  "data/tweet-economist/2021/3/1377322599622045702.json": "Unless methane emissions are reduced there is little hope of stabilising the climate https://t.co/6B9fOb2ykt",
  "data/tweet-economist/2021/3/1377294983892324357.json": "What might have been a routine reshuffle of Brazil's cabinet has become a potentially destabilising conflict with the country's military command https://t.co/N6FG77p5m0",
  "data/tweet-economist/2021/3/1377360461172195336.json": "Methane—\"carbon dioxide on steroids\"—is responsible for 23% of the rise in temperatures since pre-­industrial times. But carbon dioxide gets most of the attention https://t.co/81CSQwQNLB",
  "data/tweet-economist/2021/3/1377386491240837123.json": "Kyoto's cherry blossoms have reached their earliest peak in 1,200 years. For a behind-the-scenes look at @TheEconomist’s charts and data journalism, sign up to our free newsletter https://t.co/kZdRdQqg5B https://t.co/iV1HYMltPY",
  "data/tweet-economist/2021/3/1377393797009600515.json": "There are a few reasons to think Joe Biden will be able to pass his infrastructure plan in a post-Trump landscape  https://t.co/iJaMaBCBNl",
  "data/tweet-economist/2021/3/1377184376316817408.json": "Many called Nawal El-Saadawi a savage, dangerous woman. So her truth-telling about injustice was savage, too  https://t.co/gN23AzdHTa",
  "data/tweet-economist/2021/3/1377273360250458112.json": "Supply chains have become a source of vulnerability. But letting globalisation run aground would be a mistake. Our cover outside Europe this week https://t.co/4FU7vg5TeY https://t.co/eaYhRl9Bg3"
}