{
  "data/tweet-economist/2021/1/1353906326724866053.json": "A Brazilian city thought it had herd immunity. It was wrong https://t.co/ythQmUU3cs",
  "data/tweet-economist/2021/1/1353848466275971072.json": "“I find it comical. I really do.” Before @CindyMcCain was censured by her local Arizona Republican Party, @AnneMcElvoy asked her how she felt about the criticism from its members. “I'm very proud of what I did...I know I did the right thing” https://t.co/YPbmDa4N3E",
  "data/tweet-economist/2021/1/1353834562808377345.json": "Alexei Navalny's chief of staff hailed the protests “a victory of bravery and spirit over state terror” and called for another next Saturday https://t.co/ExVaLJczVp",
  "data/tweet-economist/2021/1/1353774587960578049.json": "“Biden is ahead of pace of all his seven predecessors.” On “Checks and Balance”, @kdtenpas says the new president’s speed in staffing his administration will help him deal with the multiple crises he faces https://t.co/VRL1cjwWcp",
  "data/tweet-economist/2021/1/1353768465207865344.json": "In Moscow, some 40,000 people took to the icy streets to protest against Alexei Navalny's arrest and Vladimir Putin's corrupt government https://t.co/juiDEmiuBg",
  "data/tweet-economist/2021/1/1353762834962898944.json": "Ethiopians are starving. Outsiders such as Britain and America should follow the EU's lead and insist that civilians be fed https://t.co/WJtKRMt99J",
  "data/tweet-economist/2021/1/1353730113448386568.json": "“I wouldn't be surprised if solar ends up being 50% of the world’s electricity by 2050.” Analyst @solar_chase tells @Eaterofsun that the energy form is currently “the cheapest source of electricity in many countries.” https://t.co/JNKdF6JcHB",
  "data/tweet-economist/2021/1/1353719770147938304.json": "Are you fluent in R? Can you build statistical models and write clean copy? We're hiring a data journalist and a data-journalism trainee https://t.co/xIO0Y8tFth",
  "data/tweet-economist/2021/1/1353713997401489412.json": "Zoroastrianism, Iran's oldest faith, is gaining popularity. But it is Sufism that the state's clerics see as the biggest threat https://t.co/yxiMBDSQXh",
  "data/tweet-economist/2021/1/1353711734041804800.json": "In 1933 Franklin Roosevelt became the first president to use the phrase \"first 100 days\" https://t.co/24Rwa8O44Q",
  "data/tweet-economist/2021/1/1353702944202493954.json": "The protest was the largest unauthorised anti-Kremlin demonstration in years, and resulted in 3,600 detentions https://t.co/7PvVh7ouo4",
  "data/tweet-economist/2021/1/1353681298208993280.json": "As Japan’s annual meat intake rose from near zero to 52kg per person (45% of America’s level), deaths from strokes tumbled https://t.co/5uTHMed71x",
  "data/tweet-economist/2021/1/1353679267821981696.json": "New research suggests that economic crises lead to political extremism only in combination with other social forces https://t.co/OK0tuyWW5H",
  "data/tweet-economist/2021/1/1353668393887522816.json": "Protests took place in more than 100 cities across Russia https://t.co/q57kQXe3tr",
  "data/tweet-economist/2021/1/1353658918237569026.json": "The UN’s genocide convention counts “measures intended to prevent births”, if their aim is “to destroy, in whole or in part, a national, ethnical, racial or religious group”  https://t.co/QMm8iqbB7k",
  "data/tweet-economist/2021/1/1353655911852740608.json": "A worker who has an insulated garden shed with Wi-Fi may not be keen on returning to their office in the city when the pandemic ends https://t.co/U2GlsuZXdU",
  "data/tweet-economist/2021/1/1353615615748157441.json": "Are city mice smarter than country mice? https://t.co/0IvLwU6xjq",
  "data/tweet-economist/2021/1/1353614852397428736.json": "Separating oxygen from the air using magnets could lead to a cheaper source of oxygen supply https://t.co/gPQoy9nVvZ",
  "data/tweet-economist/2021/1/1353613600234082305.json": "By keeping quiet, a good listener gains an edge over their counterpart https://t.co/qu2FKJPGsd",
  "data/tweet-economist/2021/1/1353612039969792000.json": "Meat traders warn that French supermarkets are talking of replacing British suppliers with their Spanish and eastern European peers https://t.co/o9dEuBI9bP",
  "data/tweet-economist/2021/1/1353591833109135361.json": "Soon two chipmaking firms in South Korea and Taiwan may dominate the production of the most advanced chips https://t.co/XH4He2WWTT",
  "data/tweet-economist/2021/1/1353587973330231296.json": "President Joe Biden has pledged $160bn towards a national vaccination plan https://t.co/1vkEkQN0uD",
  "data/tweet-economist/2021/1/1353583867614154754.json": "In “America and Iran” @JohnGhazvinian recounts a tragic story of Iranian overtures spurned by Americans https://t.co/UmufQhRVlG",
  "data/tweet-economist/2021/1/1353579591085002752.json": "The story carries a moral suited to the pandemic: good triumphs over evil, but only after great hardship  https://t.co/xrJzLxHXMw",
  "data/tweet-economist/2021/1/1353571834583801856.json": "In March we observed the 42nd anniversary of “The Hitchhiker’s Guide To The Galaxy”. The book has sold more than 14m copies worldwide https://t.co/dCYvZJ67kk",
  "data/tweet-economist/2021/1/1353563612053446659.json": "In a day by day comparison in Israel of a group of over-60s who had been vaccinated with a group of unvaccinated individuals, the rate of positive infections in the vaccinated group had fallen by a third on the 14th day https://t.co/wtsjcZuaZm",
  "data/tweet-economist/2021/1/1353559695026507776.json": "Some common diseases have proven stubbornly resistant. Tuberculosis still claims 1.4m lives a year https://t.co/SOlP5A50FV",
  "data/tweet-economist/2021/1/1353555749570568192.json": "One of Joe Biden’s and his advisers’ big ambitions is to bring foreign policy and economic policy more into alignment https://t.co/rXkTSnkLkV",
  "data/tweet-economist/2021/1/1353551690700644355.json": "Inequality is rising. In some provinces the richest 20% earn more than 20 times more than the poorest 20% https://t.co/nAUNd1zqZX",
  "data/tweet-economist/2021/1/1353550036530028544.json": "Godzilla may be ﬁctional. But the idea that radiation, used carefully, can create animals that are giants of their kind, is not https://t.co/QskulkAmph",
  "data/tweet-economist/2021/1/1353541064607617025.json": "Most presidents enter office vowing great things in the first 100 days. But why that particular time-frame? https://t.co/EjxolkpgvY",
  "data/tweet-economist/2021/1/1353530038319247363.json": "As the internet has brought big-city life to provincial China, it has also brought country living to the town, fostering a new urban romance with rural China https://t.co/aFqPaCmhUC",
  "data/tweet-economist/2021/1/1353526128179294222.json": "For vaccines from China to be widely accepted, the trial and manufacturing data surrounding them need more independent evaluation https://t.co/hZsbaoYZWw",
  "data/tweet-economist/2021/1/1353518496693551104.json": "How diverse are Joe Biden’s cabinet picks compared to those of Donald Trump, Barack Obama and George W. Bush? We dug into the data  https://t.co/ahMGrsAi46",
  "data/tweet-economist/2021/1/1353509305694228481.json": "Those born since 1991 spent their late teens with Xi Jinping in power, and nationalism in their school curriculum. This affects how \"Generation Xi\" see the world https://t.co/RjRc3gIkFx",
  "data/tweet-economist/2021/1/1353497077905584128.json": "Could a young, increasingly activist generation become a political challenge for China’s government? https://t.co/Qh7gjEapCA",
  "data/tweet-economist/2021/1/1353495322841018369.json": "A finding that 66% of people in Manaus had antibodies to covid-19 contributed to a false sensation that the pandemic was over https://t.co/cZkhYCoyny",
  "data/tweet-economist/2021/1/1353483983892451330.json": "Japanese people may have gained longevity by balancing their diets https://t.co/6ImWo2pIYC",
  "data/tweet-economist/2021/1/1353483982621585408.json": "In principle, vaccine passports are a good idea. In practice, governments face a host of questions about how they might work https://t.co/IkqP7SfQAd",
  "data/tweet-economist/2021/1/1353482233504538625.json": "A new study suggests that Twitter has recently limited the reach and influence of accounts that are linked to China’s state-managed news services https://t.co/1UDiB6zJEI",
  "data/tweet-economist/2021/1/1353447995384057856.json": "China's Communist Party does not embrace countercultures—which only fuels the country's underground scene https://t.co/WdOcccvbUS",
  "data/tweet-economist/2021/1/1353422593827753984.json": "At one hospital in Tigray the staff have not been paid since October, and a lack of electricity means the little medicine available is going bad https://t.co/wT3FfAJBaK",
  "data/tweet-economist/2021/1/1353418699340963841.json": "How the mosquito has played the greatest role in human history of any creature https://t.co/C7EM0RZynd https://t.co/X598UrMtOj",
  "data/tweet-economist/2021/1/1353417058227269634.json": "China's patriotic education in schools was ramped up after the Tiananmen protests of 1989, which Party leaders saw as a failure of indoctrination https://t.co/FnyMSuaRFT",
  "data/tweet-economist/2021/1/1353416794439114753.json": "It is not certain that Texan courts will be as hospitable as the NRA hopes https://t.co/YGReHUMCro",
  "data/tweet-economist/2021/1/1353414532929089538.json": "Contrary to Republican fears, there is no prospect of Joe Biden’s team reverting to the Obama administration’s relatively benign vision of coexistence with China https://t.co/PJGUFySFg4",
  "data/tweet-economist/2021/1/1353409768480776194.json": "Joe Biden has promised to deliver 100m vaccines to 100m Americans in his first 100 days in office https://t.co/IK6FGuojVR",
  "data/tweet-economist/2021/1/1353400433444847616.json": "There are credible reports of Ethiopia's government forces or their allies killing livestock and burning crops in Tigray. If true, both the perpetrators and those ordering them are guilty of war crimes https://t.co/LJQDFCGgIA",
  "data/tweet-economist/2021/1/1353391883318386688.json": "There is no doubt that Switzerland has become less welcoming to dirty money. But the Magnitsky case undermines its progress https://t.co/zNF8UKbeRz",
  "data/tweet-economist/2021/1/1353391881325957120.json": "Signal goes further than WhatsApp in its protection of privacy by holding the absolute minimum of data on its users https://t.co/UmbL5DfON4",
  "data/tweet-economist/2021/1/1353391366517055488.json": "Joe Biden may not get his proposed fiscal stimulus proposal through the Senate. But even a trimmed-down version could have big effects, potentially halving child poverty  https://t.co/a8qB2Z7jTV",
  "data/tweet-economist/2021/1/1353389872443240454.json": "For many young people in China, covid-19 has inspired an appreciation for the Chinese government and disdain for America's  https://t.co/b9UvDPSzmb",
  "data/tweet-economist/2021/1/1353388868184240128.json": "Social distancing has meant that many Americans are sitting on a cash-pile. Will they spend it once the economy fully reopens?https://t.co/Ez5QXXVVWy",
  "data/tweet-economist/2021/1/1353387099588861954.json": "The Holocaust and the mass murder of Tutsis in Rwanda are generally agreed to be examples of genocide. But what about the Chinese government's horrific treatment of the Uyghurs? https://t.co/HJUt4hjeEU",
  "data/tweet-economist/2021/1/1353384828612308992.json": "A growing share (though still a minority) of the public now says executions are immoral https://t.co/KDKF0gwdQk",
  "data/tweet-economist/2021/1/1353373523234971649.json": "An investigation revealed that urban mice had a 77% success rate at completing novel tasks, compared with 52% for rural mice https://t.co/0FlR3GRrbX",
  "data/tweet-economist/2021/1/1353373274231738373.json": "A technology firm called Aqwest plans to separate oxygen from the air magnetically, using structures called microchannels that act as gas separators https://t.co/iyQxXBvAO3",
  "data/tweet-economist/2021/1/1353368719980982278.json": "America’s uneven return to school risks creating a situation in which the inequities between poor and wealthy peers grow even more severe https://t.co/SOE5wVTQG9",
  "data/tweet-economist/2021/1/1353368463226531840.json": "Soldiers on horseback wore high heels in tenth-century Persia https://t.co/VDafwRUcf4 From @1843mag",
  "data/tweet-economist/2021/1/1353366982402314240.json": "The most nail-biting risk of all this year is of an unintended clash between China and America over the South China Sea #TheWorldIn2021 https://t.co/ah3c87slTa",
  "data/tweet-economist/2021/1/1353360665197621249.json": "The European Commission has set a goal of jabbing 70% of its adults by summer. There is time to catch up https://t.co/FiPFHF1CRS",
  "data/tweet-economist/2021/1/1353351372100481024.json": "Now that Qatar is rebuilding relationships with its neighbours, will it have less of a soft spot for Turkey? https://t.co/GvXohkOGgn",
  "data/tweet-economist/2021/1/1353346591416066048.json": "Joe Biden faces many crises. How will he deal with climate change, racial injustice and covid-19? Visit our hub to read about his proposals https://t.co/x8XmdB2OYt",
  "data/tweet-economist/2021/1/1353343804024250371.json": "People who have had damaging childhood experiences are twice as likely to develop chronic pain https://t.co/LgKmyQa2KN From @1843mag",
  "data/tweet-economist/2021/1/1353910935287713792.json": "KAL’s cartoon https://t.co/kSQFGU3erg",
  "data/tweet-economist/2021/1/1353925894495199232.json": "Our Big Mac index makes exchange-rate theory more digestible https://t.co/vDq3SUSpj7",
  "data/tweet-economist/2021/1/1353755275547844613.json": "Plenty of young Chinese will be discouraged by the growing repression of the state. Yet many feel optimistic about their country's future https://t.co/353tYYcwEq",
  "data/tweet-economist/2021/1/1353882329178107905.json": "The smallpox vaccine took decades to bear fruit https://t.co/5bntgLgGyP",
  "data/tweet-economist/2021/1/1353958686515982336.json": "Meanwhile, Alexei Navalny's most recent and explosive film, which attacks Vladimir Putin for corruption, notched up over 80m views in its first five days on YouTube https://t.co/3gPCbIfvCy",
  "data/tweet-economist/2021/1/1353963627091554304.json": "“Demon Slayer” is the most successful Japanese film of all time https://t.co/6Jwwlz7AYo",
  "data/tweet-economist/2021/1/1353968532921442306.json": "The secrets of successful listening https://t.co/EwJP81aXpk",
  "data/tweet-economist/2021/1/1353935741714374657.json": "A Tesla bull debates a Tesla bear https://t.co/8N2JnLiKUJ",
  "data/tweet-economist/2021/1/1353991265117999104.json": "Amazon has an emerging challenger. Ocado, a British firm, is using AI and automation technology to disrupt the online grocery-delivery industry https://t.co/M9Wsy2Z2bo https://t.co/Twq3cjELCS",
  "data/tweet-economist/2021/1/1353973423660269568.json": "After two months of war, Tigray faces starvation https://t.co/ndp8wI0N7E",
  "data/tweet-economist/2021/1/1354017908574314496.json": "According to some sociologists, 40% of those who protested in Russia at the weekend did so for the first time https://t.co/TRHU8od6ft",
  "data/tweet-economist/2021/1/1354044637007253504.json": "“I find it comical. I really do.” Before @CindyMcCain was censured by her local Arizona Republican Party, @AnneMcElvoy asked her how she felt about the criticism from its members. “I'm very proud of what I did...I know I did the right thing” https://t.co/t9c3hTdIkj",
  "data/tweet-economist/2021/1/1354089909083103232.json": "Turnout was held down not by support for Vladimir Putin, but by fear of being beaten up and arrested by police https://t.co/XToYmizvJy",
  "data/tweet-economist/2021/1/1354084894796877825.json": "It is possible that Ethiopia's government is simply too incompetent to alleviate the starvation of its people. But that seems unlikely https://t.co/lZjava2zRu",
  "data/tweet-economist/2021/1/1353896117193347074.json": "Before leaving office, Mike Pompeo accused China of genocide https://t.co/6mW01ngggC",
  "data/tweet-economist/2021/1/1354102575050723328.json": "Lorries carrying supplies into the starving parts of Ethiopia are being stopped by the central government or local authorities https://t.co/fC6LMHJT6d",
  "data/tweet-economist/2021/1/1354095763937091584.json": "“Biden is ahead of pace of all his seven predecessors.” On “Checks and Balance”, @kdtenpas says the new president’s speed in staffing his administration will help him deal with the multiple crises he faces https://t.co/wnoms1OpIv",
  "data/tweet-economist/2021/1/1353981778747396096.json": "The starvation in Ethiopia is due either to the government's incompetence, or to its effort to weaken the region of Tigray https://t.co/zhsdfzAvKj",
  "data/tweet-economist/2021/1/1354147436059652098.json": "In 1796 Edward Jenner, a physician, produced the first true vaccine—one that creates immunity without infection https://t.co/KyX6CnDGRc",
  "data/tweet-economist/2021/1/1354188604914999303.json": "What will happen to the Republican Party? @CindyMcCain, a member of the Biden-Harris transition advisory council and widow of Republican Senator John McCain, tells “The Economist Asks” podcast “this party may split” https://t.co/O2OPCdWFNr https://t.co/VYDEzxyppQ",
  "data/tweet-economist/2021/1/1354197203456299010.json": "Vladimir Putin still commands the television channels that helped him to come to power, but it is Alexei Navalny who dominates politics on Russia’s internet https://t.co/Euh24mdBmt",
  "data/tweet-economist/2021/1/1354197699466244098.json": "“Biden is ahead of pace of all his seven predecessors.” On “Checks and Balance”, @kdtenpas says the new president’s speed in staffing his administration will help him deal with the multiple crises he faces https://t.co/npv2K2n2l7",
  "data/tweet-economist/2021/1/1354197701295026181.json": "Storming Delhi’s Red Fort is the moment with which India’s farmers’ protest movement will be forever identified https://t.co/Q0PiDsQGxc",
  "data/tweet-economist/2021/1/1354230694269116416.json": "On current trends, covid-19 cases will double again in 105 days https://t.co/teJV9GMUee",
  "data/tweet-economist/2021/1/1354157310680174593.json": "The most-drunk spirit in the world is not gin, vodka or whisky, but baijiu. China’s national tipple could be going global\nhttps://t.co/YQrWygKktq https://t.co/z7NitpYGw6",
  "data/tweet-economist/2021/1/1354151313920155648.json": "“Joe Biden’s governing strategy is going to be to govern, which is a welcome change.” On “Checks and Balance” @jonfasman says the new president faces multiple crises https://t.co/0IyHfwZiCL",
  "data/tweet-economist/2021/1/1354289983260155904.json": "We're looking for an entry-level data-journalism trainee and a data journalist to join The Economist's data team https://t.co/N3YaEB9cpR",
  "data/tweet-economist/2021/1/1354308242969649153.json": "India's farmers have attracted broad sympathy; more than 50% of the workforce is in agriculture. But their grievances are diverse https://t.co/alrLhA7Jyf",
  "data/tweet-economist/2021/1/1354216317897863169.json": "The number of excess deaths is still greater than the number of covid-19 fatalities officially recorded by most countries https://t.co/PbOuJeFRPV",
  "data/tweet-economist/2021/1/1354332828935348227.json": "The African Continental Free Trade Area is part of the African Union's plan to turn the continent into a global economic power over the next few decades https://t.co/DFasS17vGf",
  "data/tweet-economist/2021/1/1354356619782533134.json": "RT @demarionunn: for the last 6 months i’ve been working as a uber eats courier to investigate how delivery is irreversibly changing our co…",
  "data/tweet-economist/2021/1/1354191410396860417.json": "“I wouldn't be surprised if solar ends up being 50% of the world’s electricity by 2050.” Analyst @solar_chase tells @Eaterofsun that the energy form is currently “the cheapest source of electricity in many countries.” https://t.co/tXwMVNFdNR",
  "data/tweet-economist/2021/1/1354344749730304001.json": "There is not yet a fully-fledged famine in Tigray. But there is a real danger that history will repeat itself https://t.co/aLXBf8tmlG",
  "data/tweet-economist/2021/1/1354261047872540680.json": "Italy's political crisis is also significant for the rest of Europe—and its pandemic recovery plans https://t.co/mUdL8I4SOi",
  "data/tweet-economist/2021/1/1354399099844521990.json": "This week the world reached 100m recorded cases of covid-19. On current trends, cases will double again in 105 days. With the true total likely to be far higher, vaccinations still have a long way to go https://t.co/s6LI5z6k7X https://t.co/EFR64M9z6r",
  "data/tweet-economist/2021/1/1354418265372680192.json": "It is hard to grasp the scale of the protest that has gripped India’s capital for the past two months https://t.co/886ARTHDQn",
  "data/tweet-economist/2021/1/1354210526650392585.json": "The African Continental Free Trade Area ties together the biggest number of member countries of any trade agreement since the establishment of the World Trade Organisation in 1995 https://t.co/2NvNHyMIXC",
  "data/tweet-economist/2021/1/1354496921847652355.json": "Today is #HolocaustMemorialDay. Last January we wrote about how historians are trying to identify every Jewish victim of the Holocaust https://t.co/PjqyLw3Z6B",
  "data/tweet-economist/2021/1/1354509256536502274.json": "Joe Biden's arrival at the White House signals the return of restraint to America's highest office. That is only the first step in America's renewal https://t.co/vVTaD2GDjz",
  "data/tweet-economist/2021/1/1354526190866993155.json": "Albert Einstein suggested that a new way of thinking about light might help science describe the world more consistently https://t.co/NTQ5LmOytJ",
  "data/tweet-economist/2021/1/1354522324234547201.json": "The recession resulting from the pandemic is shaking up the world of business—and the rules of capitalism #TheWorldIn2021 https://t.co/EgoW2zBn2H",
  "data/tweet-economist/2021/1/1354534663201685504.json": "Of the 9.5m Jews in Europe before the war, 6m were murdered during the Holocaust. Last year our data journalists charted historians' efforts to record each and every Jewish victim https://t.co/BRYFAa0T3f",
  "data/tweet-economist/2021/1/1354533148453953542.json": "Zoroastrianism, Iran's oldest faith, is gaining popularity. But it is Sufism that the state's clerics see as the biggest threat https://t.co/vP3W03PoKJ",
  "data/tweet-economist/2021/1/1354517060475363341.json": "\"Demon Slayer\" proved perfect for quarantine-era binging  https://t.co/1QrGLQ5V1A",
  "data/tweet-economist/2021/1/1354562761976668160.json": "Shares in GameStop are worth 17 times as much as they had been just a fortnight ago https://t.co/yZg61iDoDk",
  "data/tweet-economist/2021/1/1354575425201184769.json": "The golden age of oil is over. With a cloud hanging over their economies, how can oil states in the Middle East maintain their dazzling cities and pay for their mega-projects? #TheWorldIn2021  https://t.co/fUUvzSDuAp",
  "data/tweet-economist/2021/1/1354598863873724425.json": "Soon people in China will be able to download a government-issued digital wallet #TheWorldIn2021 https://t.co/ZJX1J4DWX5",
  "data/tweet-economist/2021/1/1354497918275891200.json": "The World Bank estimates that the African Continental Free Trade Area could boost Africa’s GDP by 7%—almost $450bn—by 2035 https://t.co/pK2nF6alqu",
  "data/tweet-economist/2021/1/1354608440052748289.json": "Shares in GameStop have leapt to a record high of more than $350 a pop https://t.co/6GMSXiHZz9",
  "data/tweet-economist/2021/1/1354508603462451201.json": "Sex ratios in China are skewed because many baby girls were aborted as a result of China's one-child policy. That ratio is most unequal in the countryside https://t.co/Sy7GKHJA0p",
  "data/tweet-economist/2021/1/1354683672331509760.json": "The jump in GameStop’s share price came after users of r/wallstreetbets, a Reddit forum, began to take a fancy to the firm https://t.co/IGkE7yL62p",
  "data/tweet-economist/2021/1/1354673914929180675.json": "Period poverty has been the subject of a wave of activism in recent years. Increasingly, lawmakers are listening https://t.co/AQrzOSTDhQ",
  "data/tweet-economist/2021/1/1354636602816032773.json": "All African countries but one have signed the AfCFTA, and 35 have ratified it https://t.co/WBsCpwOzQD",
  "data/tweet-economist/2021/1/1354562086077083648.json": "A finding that 66% of people in Manaus had antibodies to covid-19 contributed to a false sensation that the pandemic was over https://t.co/5RaHtn2DOK",
  "data/tweet-economist/2021/1/1354678732519161856.json": "Soon two chipmaking firms in South Korea and Taiwan may dominate the production of the most advanced chips https://t.co/xAgTKl7GR2",
  "data/tweet-economist/2021/1/1354710322305753089.json": "Coronaspeck is the helpful German word for the fat deposited by weeks of stay-at-home grazing https://t.co/NNzuTeIZnD From @1843mag",
  "data/tweet-economist/2021/1/1354669365489229824.json": "Not everyone in China wants to live by its rigid formula for success in work and life. But where do you go to rebel? https://t.co/kE1zRArbEW",
  "data/tweet-economist/2021/1/1354734349334306817.json": "The rich world has snapped up most of the global vaccine supply. But hoarding vaccines will only prolong the deadly effects of the pandemic https://t.co/RNqwMuyqjE",
  "data/tweet-economist/2021/1/1354719736374943744.json": "They're rich in protein and more sustainable than meats like beef or pork: insects are now on the menu #TheWorldIn2021 https://t.co/thePrN8QwD",
  "data/tweet-economist/2021/1/1354750003177263106.json": "Ethiopia’s government appears to be wielding hunger as a weapon. Listen to “Editor’s Picks” to hear essential stories from the latest issue of The Economist, read aloud https://t.co/2w5LGyZEq8",
  "data/tweet-economist/2021/1/1354645717562880001.json": "There have been some obvious winners in the pandemic economy such as Silicon Valley and China Inc. But also some unexpected success stories #TheWorldIn2021 https://t.co/h7GFUutw9y",
  "data/tweet-economist/2021/1/1354782372395446273.json": "The world is facing an upsurge of nuclear proliferation. To stop it, powers that already have the bomb need to act fast. Our cover this week\nhttps://t.co/VdwIcb8xen https://t.co/aAzmvsKSOB",
  "data/tweet-economist/2021/1/1354570270317666304.json": "The thinking was that Chinese students abroad might embrace Western values. Now it often goes the other way https://t.co/RBGPKU8WsC",
  "data/tweet-economist/2021/1/1354832197325348866.json": "AstraZeneca's boss said the deal his firm signed with the EU was “not a commitment” to Europe, merely a promise to try to supply vaccine doses quickly https://t.co/xdykAqxPNi",
  "data/tweet-economist/2021/1/1354754875251372033.json": "Europe's AstraZeneca vaccine deliveries will be scaled back by two-thirds or more in the first quarter of the year. This comes on top of Pfizer-BioNTech also pushing back promised deliveries by a few weeks https://t.co/6WIGd5pkJa",
  "data/tweet-economist/2021/1/1354873400636956676.json": "This week's cartoon from KAL: https://t.co/yItOrYcvVo https://t.co/FEbC1ofCVh",
  "data/tweet-economist/2021/1/1354854825536663552.json": "RT @_rospearce: High-res satellite data is always a pleasure to visualise.\n\nhttps://t.co/ShrIYe1z6a https://t.co/TACOITOqi6",
  "data/tweet-economist/2021/1/1354809396627300352.json": "There have been some obvious winners in the pandemic economy such as Silicon Valley and China Inc. But also some unexpected success stories #TheWorldIn2021 https://t.co/5n5P6h4PB8",
  "data/tweet-economist/2021/1/1354904663527723010.json": "After a forum of Reddit users discovered that a swathe of hedge funds had bet against GameStop, they began frantically buying shares in the hopes of forcing them to take losses https://t.co/neJ4bB3HCZ",
  "data/tweet-economist/2021/1/1354893303590899719.json": "Rappers outside the United States used to sound American. Nowadays, the spread of grime music and UK drill means imitating England’s rappers is fashionable https://t.co/o3VOR2gpuG",
  "data/tweet-economist/2021/1/1354908410031050759.json": "Big nuclear powers are adding to their capabilities, despite their commitment to work towards disarmament https://t.co/ONjprMdXQ3",
  "data/tweet-economist/2021/1/1354942103474860040.json": ".@TheEIU predicts that rich countries with access to proven vaccines will manage to inoculate their most vulnerable citizens by mid-March https://t.co/3L7ccTx1bJ",
  "data/tweet-economist/2021/1/1354973481180524550.json": "Many people think Buy American creates jobs. But by locking firms out of global supply chains, it destroys more employment than it generates https://t.co/ZzSjBHPQdt",
  "data/tweet-economist/2021/1/1354931268782346249.json": "Joe Biden's tightening of the Buy American agenda could be a sign of worse errors to come in his administration https://t.co/xYap7JruC2",
  "data/tweet-economist/2021/1/1354983022374875137.json": "If digital currency were ever to fully replace cash, what new powers would banks gain? #TheWorldIn2021 https://t.co/R0K0HJOg3c",
  "data/tweet-economist/2021/1/1355000639248592897.json": "Most middle-income countries will probably not be able to inoculate their most vulnerable citizens until late 2022 https://t.co/OIpqPzasgG",
  "data/tweet-economist/2021/1/1354991806161821697.json": "KAL’s cartoon https://t.co/uJRq2ZT3pl",
  "data/tweet-economist/2021/1/1355049391959191552.json": "“If I have the opportunity to leave Hong Kong, I plan to take it,” says a photojournalist horrified by the impact of the new national-security law on the free press https://t.co/oCw8Z3w0KZ",
  "data/tweet-economist/2021/1/1354968319028310017.json": "Aravind Adiga won the Booker prize for “The White Tiger” in 2008. For all India’s transformations since then, the story is no less trenchant in early 2021 https://t.co/vKTaunNMTQ",
  "data/tweet-economist/2021/1/1355045307072077827.json": "China's tough border controls have made it almost impossible for overseas students to return to the country. Many are furious https://t.co/KRgBU1OTUx",
  "data/tweet-economist/2021/1/1355057530129575938.json": "The stubborn men who rule the West Bank and Gaza often seem more concerned with preserving their own power than with improving their people’s lives https://t.co/yi8O0i23lC",
  "data/tweet-economist/2021/1/1355009488894521346.json": "As the pandemic enters its second year, be prepared for changes in three areas  #TheWorldIn2021 https://t.co/GgqBkmYNMs",
  "data/tweet-economist/2021/1/1355081017695068163.json": "Reports surfaced that Adnan Oktar was grooming his followers as sex slaves with cocaine, video and blackmail https://t.co/ETJrkHNniG",
  "data/tweet-economist/2021/1/1354917097411923973.json": "What happened in Wuhan? Filmmaker Hao Wu talks to @AnneMcElvoy about his film “76 Days” on the covid-19 outbreak. “I think for a lot of people who lived through the lockdown, it was such a traumatic experience. People emotionally are definitely scarred” https://t.co/jHId41bNb4",
  "data/tweet-economist/2021/1/1355090333684658178.json": "One Yorkshire plant nursery has been selling around £500,000-worth of plants a year to Northern Ireland. Now it has to stop, because it grows those plants in British soil https://t.co/L2mxXR23wJ",
  "data/tweet-economist/2021/1/1355124068782104578.json": "In poorer countries, meaningful vaccination coverage—enough for life to return to normal—may not be possible until 2023, if ever https://t.co/eY6EIRVibv",
  "data/tweet-economist/2021/1/1355091940606423040.json": "RT @DSORennie: For 60 years China’s ethnic Korean minority has run bilingual schools. They were studied as a model. Then national leaders c…",
  "data/tweet-economist/2021/1/1355132607751716865.json": "Ethiopia experienced one famine in 1973. It then suffered through another ten years later. The Ethiopian government is now courting a third https://t.co/EAMwrJhhSZ",
  "data/tweet-economist/2021/1/1355178036128313348.json": "Johnson &amp; Johnson have announced that their single-dose covid-19 vaccine is highly effective. Our film explains why vaccinating the world poses an unprecedented challenge https://t.co/C0oUmG0vve",
  "data/tweet-economist/2021/1/1355188205457461248.json": "COVAX, a vaccine-sharing scheme co-led by the WHO, promises only enough doses for 20% of each country’s population—and even those may not arrive promptly https://t.co/sXfNI1hTBM",
  "data/tweet-economist/2021/1/1355224453148512259.json": "In South Africa, 40% of women and 15% of men are obese. Much of the rest of the region is heading in the same direction https://t.co/kXLvelcN5Y",
  "data/tweet-economist/2021/1/1355217149527261187.json": "Few of Adnan Oktar's followers dared to speak out on the abuse they suffered. “Every freedom I had was gone,” says one https://t.co/DPRb2bmuU6",
  "data/tweet-economist/2021/1/1355199301077639176.json": "As a black player, people would tell Hank Aaron he had no business in baseball. He responded by keeping his cool and swinging https://t.co/7P2jv4Wdq5",
  "data/tweet-economist/2021/1/1355171853111861250.json": "Pet owners are more likely than other people to be vegetarians or vegans. So what should they feed their carnivorous cats and dogs? Technology may have the answer https://t.co/FXDN3U8pZx",
  "data/tweet-economist/2021/1/1355286872348647426.json": "Lockdowns have exacerbated a problem that has been spreading in many developed nations for decades: loneliness https://t.co/kr3L8PmR6k",
  "data/tweet-economist/2021/1/1355285369017647105.json": "Building a presidential legacy out of executive actions can be like building castles out of sand—both risk being wiped out by the changing tides https://t.co/2katm8dZ55",
  "data/tweet-economist/2021/1/1355305495192608768.json": "The WHO has warned that long lockdowns in poor countries will continue to be a drag on trade and supply chains, dampening economic recovery https://t.co/AWpQ4Rpemr",
  "data/tweet-economist/2021/1/1355295179301859331.json": "The EU has earmarked €2bn to help Poland decarbonise https://t.co/oPPcLgA6gx",
  "data/tweet-economist/2021/1/1355223449564835841.json": "Bookmark this page to track what Joe Biden does in his first 100 days in office https://t.co/Cq6BkRIOoT",
  "data/tweet-economist/2021/1/1355302243239677954.json": "Several prominent conspiracists admitted defeat after Donald Trump left office—but QAnon is not going away https://t.co/YFys7d2t2J",
  "data/tweet-economist/2021/1/1355332241233223680.json": "Pickleball—a hybrid of tennis, badminton and ping-pong—is growing in popularity https://t.co/scApM0iJDA",
  "data/tweet-economist/2021/1/1355303234815057927.json": "Several vaccine-makers are already working on modified jabs that target the B.1.351 variant crushing South Africa https://t.co/lvYfkf7OaH",
  "data/tweet-economist/2021/1/1355367856117002243.json": "The digital yuan will give China a conduit for moving money across its borders without having to rely on SWIFT, a global payments system that comes under American influence #TheWorldIn2021 https://t.co/y0SmpOWoTF",
  "data/tweet-economist/2021/1/1355111959075684354.json": "Last year an estimated 1.3m Romanians went back to Romania—equivalent to three times the population of its second-biggest city https://t.co/MOGf6mbXWb",
  "data/tweet-economist/2021/1/1355353311466168330.json": "Apple's haul was two-and-a-half times Microsoft’s own record sales and four times Facebook’s https://t.co/0b76sX2vWi",
  "data/tweet-economist/2021/1/1355362806749687808.json": "In Asia, there is widespread relief about Joe Biden’s new administration. But the relief is tempered by scepticism https://t.co/0gUR6xobTn",
  "data/tweet-economist/2021/1/1355412053691871232.json": "The conspiratorial impulse behind QAnon will be more enduring than Donald Trump  https://t.co/dStgERKk7x",
  "data/tweet-economist/2021/1/1355358571857383424.json": "The film’s director, Simon Stone, and its writer, Moira Buffini, dig beneath the scenario’s surface to find a delicate, humane and melancholy mood piece https://t.co/Acpn4onHr6",
  "data/tweet-economist/2021/1/1355399331231260674.json": "Apart from ripping families apart and tearing down reputations, such feuds destroy shareholder value https://t.co/IqIkVK7XJh",
  "data/tweet-economist/2021/1/1355384248438579200.json": "Putting trans women in female prisons sets up a clash of rights https://t.co/vRokZyYcGo",
  "data/tweet-economist/2021/1/1355441278553649152.json": "The work-from-home revolution could affect the shape of cities, gender equality and even how we measure time https://t.co/uwCpuSPayz https://t.co/nQaC3YOAKt",
  "data/tweet-economist/2021/1/1355437361547661313.json": "Most of the work of Britain's trade department in the four and a half years since its creation has focused on replicating trade deals to which Britain was already a party https://t.co/IMTm83oxl7",
  "data/tweet-economist/2021/1/1355433403462594561.json": "Executive actions are not the imperial, instantaneous process many Americans think they are https://t.co/B5RIMhWwOR",
  "data/tweet-economist/2021/1/1355388899070193665.json": "Protests in Ulaanbaatar over the mistreatment of a hospital patient caused the Mongolian prime minister to step down. But was there another, more cynical, reason for his resignation? https://t.co/7GiYMl35RR",
  "data/tweet-economist/2021/1/1355449689055911940.json": "Politicians in eastern Europe had long complained of a “brain drain” as their brightest left in search of higher wages in the west. Now, a \"brain gain\" has begun https://t.co/nuRdtKI3AF",
  "data/tweet-economist/2021/1/1355192583769747460.json": "Dan Gertler has sold much of Congo’s wealth in minerals to the world, making him a very rich man. But his luck may be running out https://t.co/2RzTx8p7NG",
  "data/tweet-economist/2021/1/1355490476288303105.json": "The coffee giant's revenues in China rose by 22% last quarter, to $911m https://t.co/V3UjM3cCJS",
  "data/tweet-economist/2021/1/1355471087111430145.json": "Joe Biden will not unilaterally abandon his dream of bipartisanship, but neither will he allow it to hamstring his administration. Enter, reconciliation https://t.co/CcyXqgL5bd",
  "data/tweet-economist/2021/1/1355219417496510465.json": "The European Court of Justice has found Poland in violation of EU environmental directives—yet the country still struggles to decarbonise https://t.co/VCOLq5OVo1",
  "data/tweet-economist/2021/1/1355510941258027011.json": "Hunger and obesity can live side by side. Around 30% of boys and 20% of girls aged five to 19 in Africa are underweight. Meanwhile, obesity is on the rise https://t.co/JNPCnh3AYW",
  "data/tweet-economist/2021/1/1355344827962036228.json": "The impeachment trial of Donald Trump is set, but it has become clear the winds of change are not blowing  https://t.co/YzydTDkDnV",
  "data/tweet-economist/2021/1/1355535022376292357.json": "Ecuador provides more than 75% of the world’s balsa, which is used to make blades for wind-power turbines https://t.co/bdqL00brHj",
  "data/tweet-economist/2021/1/1355460118066978819.json": "Europe would do better to focus on ironing out the vaccine logistics and to consider adopting the British strategy of delaying the second dose https://t.co/o6GwB7Br6f",
  "data/tweet-economist/2021/1/1355523359317102599.json": "The Novavax and Janssen jabs are welcome additions to the world’s arsenal of vaccines against the pandemic https://t.co/oN0x8Tbgy3",
  "data/tweet-economist/2021/1/1355519164044234754.json": "The founders of Because Animals, a firm based in Philadelphia, are hoping to use mouse stem cells to make cultured cat food https://t.co/DD7rpUc0J3",
  "data/tweet-economist/2021/1/1355572508179771392.json": "America, China, Europe and Russia share an interest in stopping proliferation. They should act quickly: once restraints start to weaken, they can fail rapidly https://t.co/E2IYRlkEAF",
  "data/tweet-economist/2021/1/1355567221163089920.json": "Young people in China do not share the starry-eyed admiration for the West that older generations did  https://t.co/pdSNwKLY8c",
  "data/tweet-economist/2021/1/1355585588972425219.json": "Some 80,000 Africans were studying in China before the pandemic struck, more than at universities in America or Britain  https://t.co/QAq2lvx96p",
  "data/tweet-economist/2021/1/1355592123014381572.json": "Global demand is collapsing. If Arab oil states do not wean their economies off the black stuff, they will suffer a similar fate #TheWorldIn2021  https://t.co/7Dqli2Enn7",
  "data/tweet-economist/2021/1/1355497502724796416.json": "London’s lingo such as “cheffed (stabbed), “rambo” (long knife) and “ching” (knife) are now common in drill music down under https://t.co/gmaQ7LYIFH",
  "data/tweet-economist/2021/1/1355591636026351621.json": "“There is no way to avoid risk in life,” says American climber and BASE jumper Steph Davis. “The real risk is in making your life small” https://t.co/Jwa04rjzw9",
  "data/tweet-economist/2021/1/1355620568897363968.json": "Part of the problem with the current spike in loneliness stems from contemporary employment. Globally, two in five office workers feel lonely at work https://t.co/qLz4HJlocq",
  "data/tweet-economist/2021/1/1355657559819104256.json": "Home heating causes 80% of Poland's emissions of PM2.5, grains of matter that enter lungs easily https://t.co/IYhimJhpjy",
  "data/tweet-economist/2021/1/1355283583158652931.json": "Google's CEO Sundar Pichai predicts technology will prevent further climate change whilst helping people cope with existing climate damage #TheWorldIn2021 https://t.co/y7Sg412qrj",
  "data/tweet-economist/2021/1/1355682424513064963.json": "It will help Joe Biden that the Trump administration was not very adept at administrative law https://t.co/QSInTIefmq",
  "data/tweet-economist/2021/1/1355660092671188993.json": "Tesla may have some catching up to do in large-scale production, but established carmakers face an equally daunting challenge: learning how to write software #TheWorldIn2021 https://t.co/VTDzS81cct",
  "data/tweet-economist/2021/1/1355602970549891079.json": "For months investors have fretted about a potential stockmarket bubble. Is the GameStop frenzy yet another reason to worry? https://t.co/Zhgq4yRkgJ",
  "data/tweet-economist/2021/1/1355687045268692993.json": "Donald Trump has moved both symptom and cause of the democratic crisis from the murkier parts of the internet to the Republican mainstream https://t.co/55RvDiIZW2",
  "data/tweet-economist/2021/1/1355712006054170631.json": "The introduction of the digital yuan will initially make little difference. But over time it could change the way central banks conduct monetary policy #TheWorldIn2021 https://t.co/NQi0EGGf21",
  "data/tweet-economist/2021/1/1355752933179195394.json": "No Zoom call can replace the “chemistry of the unexpected” that you get in person. Humans need offices https://t.co/rE8TZC3OMp One of @1843mag’s most popular stories of the year",
  "data/tweet-economist/2021/1/1355642217902313475.json": "Medellín is Colombia’s centre of bootleg booze. But the problem is widespread in the country https://t.co/No51o8xAwH",
  "data/tweet-economist/2021/1/1355600940926164993.json": "As the pandemic enters its second year, be prepared for changes in three areas  #TheWorldIn2021 https://t.co/6CLukibDJ4",
  "data/tweet-economist/2021/1/1355542798829817857.json": "Iran’s nuclear programme spooks Saudi Arabia. North Korea’s arsenal casts a darkening shadow over South Korea and Japan https://t.co/pK6VOtW3Gd",
  "data/tweet-economist/2021/1/1355765545795252224.json": "Australia’s government argues that Google and Facebook are monopolies, and that laws are therefore the last resort for limiting their power https://t.co/zVRiSSkidr",
  "data/tweet-economist/2021/1/1355769380781633538.json": "It would be troubling if Joe Biden's approach to Asia mimicked his predecessors'. Barack Obama was reluctant to exercise power against China. Donald Trump was more forceful, but overbearing https://t.co/sH6FRhmAUK",
  "data/tweet-economist/2021/1/1355728051724804098.json": "Although many Republicans desire to see the back of Donald Trump, they seem to have concluded the former president's grip on their party is too strong to disavow him https://t.co/EAseO3Xv6W",
  "data/tweet-economist/2021/1/1355591636202516484.json": "Kurt Campbell, who helped engineer Barack Obama’s “pivot” to Asia in 2012, will be Joe Biden’s new tsar for “Indo-Pacific” strategy https://t.co/nM2gqFksC5",
  "data/tweet-economist/2021/1/1355773267630563331.json": "Many African students accuse China of ignoring their pleas to be allowed back into the country, and complain that online lessons are poor https://t.co/4EjUfS4XEn",
  "data/tweet-economist/2021/1/1355741525859323906.json": "Poland’s nationwide sheet of smog stems from its use of coal for home heating https://t.co/jfUkdFTXos",
  "data/tweet-economist/2021/1/1355516134242603011.json": "Joe Biden has promised to renew aid to the Palestinians and restore diplomatic ties, but he can only do so much for them while they have such awful leaders https://t.co/YUeuyGw5qt",
  "data/tweet-economist/2021/1/1355788688274423808.json": "Global demand is collapsing. If Arab oil states do not wean their economies off the black stuff, they will suffer a similar fate #TheWorldIn2021  https://t.co/O3ewBhqqcl",
  "data/tweet-economist/2021/1/1355724124769943553.json": "Many see the prime minister's resignation as a cynical ploy to polish his image in the run-up to Mongolia's presidential elections https://t.co/VhogsaSo4V",
  "data/tweet-economist/2021/1/1355420056117792770.json": "The privacy that encrypted platforms offer is double-edged https://t.co/3Fh0oBAtZt",
  "data/tweet-economist/2021/1/1355814593474523138.json": "If Iran gets a nuclear bomb, Saudi Arabia would probably follow https://t.co/r7DsG3QLKW",
  "data/tweet-economist/2021/1/1355828425559322627.json": "Humans crave freedom, not just security https://t.co/EyaPHGY4pF",
  "data/tweet-economist/2021/1/1355815097210437634.json": "Dumped plants, health certificates for fish food sellers and rabies injections for dogs: post-Brexit absurdities are proliferating on the Northern Irish border https://t.co/6GFeeGv0HN",
  "data/tweet-economist/2021/1/1355853504468934659.json": "Once the nuclear order starts to fail, the unravelling will be almost impossible to stop. Hence the importance of acting today https://t.co/Ahjv2nnUFt",
  "data/tweet-economist/2021/1/1355857342567477251.json": "In parts of Africa, corpulence is considered beautiful and associated with wealth. A study in Uganda found that overweight people find it easier to get credit https://t.co/uWyd75GxQr",
  "data/tweet-economist/2021/1/1355867692717268994.json": "Russia and China are selling most new power reactors, in what a new paper calls an “autocratic nuclear marketplace” https://t.co/sdZJq88KOZ",
  "data/tweet-economist/2021/1/1355881538857160706.json": "What if you could feed your feline friend their favourite treat of mouse without exploiting even a single rodent? https://t.co/YSxnlyU3mM",
  "data/tweet-economist/2021/1/1355452706907938818.json": "Michael Gove referred to some “bumpy moments” on the post-Brexit road. “We can’t even find the road,” says the owner of a firm that normally sells fish food in Northern Ireland https://t.co/BVbfEwPlGN",
  "data/tweet-economist/2021/1/1355891595263029255.json": "More than 90% of German firms are family companies. The upshot is ubiquitous family strife  https://t.co/RcVtruzSaV",
  "data/tweet-economist/2021/1/1355886830110044169.json": "The pandemic has transformed our relationship with technology. While there are still lessons to be learnt, these changes are unlikely to go away #TheWorldIn2021 https://t.co/xLXd0OZmDb",
  "data/tweet-economist/2021/1/1355901169747550214.json": "Joe Biden's tightening of the Buy American agenda could be a sign of worse errors to come in his administration https://t.co/SLKOPPcq81",
  "data/tweet-economist/2021/1/1355919782487449602.json": "Executive action is useful not just for wiping away Donald Trump’s legacy, it also allows Joe Biden to sketch his own https://t.co/c3aVnQZJjo",
  "data/tweet-economist/2021/1/1355936654733807625.json": "America has a rich history of conspiracism https://t.co/e8ic7ky7Mt",
  "data/tweet-economist/2021/1/1355924079358959616.json": "From 1947, when Jackie Robinson became the first black player in the major leagues, Hank Aaron's dreams became boundless https://t.co/nuVgsfmMS5",
  "data/tweet-economist/2021/1/1355947225365569542.json": "Vladimir Putin still commands the television channels that helped him to come to power, but it is Alexei Navalny who dominates politics on Russia’s internet https://t.co/0N2tVxhqrG",
  "data/tweet-economist/2021/1/1355941929285001216.json": "Until recently, allegations against Adnan Oktar earned him only a couple of brief spells in prison, and one in a mental hospital https://t.co/CYGUxUcYC7",
  "data/tweet-economist/2021/1/1355934309157400576.json": "The pandemic has proved quite how far people are willing to go to avoid the risk of dying prematurely. So why would anyone willingly expose themselves to it? https://t.co/C0BRSyAjTZ",
  "data/tweet-economist/2021/1/1355965352472141826.json": "Vladimir Putin may command an army, the security services and a nuclear arsenal. But he is still afraid of the truth https://t.co/oegFulf6vA",
  "data/tweet-economist/2021/1/1355963083064283139.json": "Governments and the private sector worked together against the pandemic. Next will be climate change, says Sundar Pichai #TheWorldIn2021 https://t.co/YYXADj3zV9",
  "data/tweet-economist/2021/1/1355977910155407361.json": "Yes, we still think the world should be eating more insects. Still not convinced? We explain why bugs are coming to a table near you in #TheWorldIn2021 🐜 https://t.co/td0qqXFZ11",
  "data/tweet-economist/2021/1/1355968861972135943.json": "Convoluted negotiations to form Italy's new government are under way. It will be the country's 69th government since the end of the second world war https://t.co/vx9rYJkB1U",
  "data/tweet-economist/2021/1/1356000110564536320.json": "Shades of Minsk, as Russians again protest against Putin https://t.co/BFmc4dp8X4",
  "data/tweet-economist/2021/1/1355999054610784256.json": "The brutality displayed by the Russian police against protesters was a show of force, but also of the Kremlin’s nervousness https://t.co/3wI28HUhGt",
  "data/tweet-economist/2021/1/1356007372016254983.json": "More than 5,000 people were reported to have been arrested in protests across Russia, including Alexei Navalny’s wife, prominent journalists and a popular rapper, Oxxxymiron https://t.co/MSet7J11zK",
  "data/tweet-economist/2021/1/1355954648063086592.json": "What role could AI play in cooling the planet? Renowned scientist James Lovelock explains https://t.co/OToY9v1Lo5 https://t.co/ReNs7BlkHi",
  "data/tweet-economist/2021/1/1356020195349901312.json": "Of the 100 European cities with the most air pollution, 29 are Polish https://t.co/NCLLO5a37Q",
  "data/tweet-economist/2021/1/1355992268436594691.json": "Joe Biden has shown a willingness to pull multiple levers of power in pursuit of his climate agenda https://t.co/o3924EuDFu",
  "data/tweet-economist/2021/1/1355699797102092288.json": "In 2019 Ecuador exported $219m-worth of balsa wood. In the first 11 months of 2020 it exported balsa worth $784m https://t.co/6y0Z5dA4Sm",
  "data/tweet-economist/2021/1/1356022000922333189.json": "Many people think Buy American creates jobs. But by locking firms out of global supply chains, it destroys more employment than it generates https://t.co/lwvkqxWHwH",
  "data/tweet-economist/2021/1/1356002582536318977.json": "Weathering a brief dip after the insurrection, Donald Trump is as popular with Republican voters as ever https://t.co/9BZJRf949T",
  "data/tweet-economist/2021/1/1355945773071020044.json": "Journalists in Morocco say they are being cowed by the king and his kangaroo courts. Some are being blackmailed with sex tapes https://t.co/asjmpCfK4B",
  "data/tweet-economist/2021/1/1355908729493991425.json": "How did a small street protest at the mistreatment of a hospital patient end in the resignation of Mongolia's prime minister?  https://t.co/76ZySq2NaV",
  "data/tweet-economist/2021/1/1355999823678353412.json": "In 1974 Hank Aaron broke Babe Ruth's record, safe for nearly 40 years, of 714 career home runs. It should have been the best day of his life—instead, it was one of relief https://t.co/BKRPEmf7ja"
}