{
  "data/tweet-crypto/2022/6/1532667281892954112.json": "It’s time for a fresh take on Bitcoin’s supply/demand dynamics. Take a look at this first chart, and we’ll dive in. 🧵 https://t.co/3Eji34BLZH",
  "data/tweet-crypto/2022/6/1533784830680387584.json": "We’ve been teasing it for months, but the time is almost here – a proposal to fully integrate digital assets into our financial system. Excited to finally unveil this effort next week. Stay tuned 👀 👀 👀",
  "data/tweet-crypto/2022/6/1533782515676217344.json": "💥BREAKING: U.S. Senate #Bitcoin bill to fully integrate digital assets into financial system — to be revealed this week.",
  "data/tweet-crypto/2022/6/1534478634894893056.json": "Today I join 20 rights advocates from 20 countries in asking Congress to consider Bitcoin’s humanitarian impact.\n\nWestern technologists may ignore Bitcoin's role in helping tens of millions under tyranny or failed economies, but policymakers should not 🌍\n\nhttps://t.co/GgKnDb5RcL",
  "data/tweet-crypto/2022/6/1534222375046332417.json": "Proof-of-stake doesn’t solve the double-spend problem, so it can’t replace proof-of-work.",
  "data/tweet-crypto/2022/6/1534828958952345600.json": "#Bitcoin miners strengthen and stabilize the power grid.https://t.co/CwiGhsWS72",
  "data/tweet-crypto/2022/6/1536426194584883215.json": "every stock in the S&amp;P 500 is red right now https://t.co/vhrfVc1NIz",
  "data/tweet-crypto/2022/6/1536404795321360385.json": "I finally got the majority of my bids filled today. May not be the pico-bottom, but here's why I was happy to allocate here for the long-haul:\n\n- Price below realized price\n- 200WMA tapped\n- FTX and Okex quarterlies in backwardation\n- One of lowest deviations from 200D trend ever https://t.co/0PfH3BQqHw",
  "data/tweet-crypto/2022/6/1539340345187647489.json": "After investing 100 hours we all come to realize that #Bitcoin is 100x bigger than the next best digital commodity network and utterly unique. I take the long view in my cheerful, constructive conversation with @cvpayne as we talk BTC &amp; debunk the critics.\nhttps://t.co/YeqzfVd8xB",
  "data/tweet-crypto/2022/6/1541403084253003777.json": "\"When Not If...\" - Monster Of A Recession On Deck https://t.co/WXQqwKAfve",
  "data/tweet-crypto/2022/6/1541446704678985728.json": "#Bitcoin is a commodity, which is essential for any treasury reserve asset. This allows politicians, agencies, governments, &amp; institutions to support bitcoin as a technology &amp; digital asset to grow the economy and extend property rights &amp; freedom to all. \nhttps://t.co/b4WmdSRilb",
  "data/tweet-crypto/2022/6/1541697179001167872.json": "1/\nI have been open about the attempts from some hedge funds that were trying to cause further panic on the market after TERRA/LUNA collapse.\nIt really seemed from the beginning a coordinated attack, with a new wave of FUD, troll armies, clowns etc. https://t.co/hhcsgHV1Ow",
  "data/tweet-crypto/2022/6/1541814607177711616.json": "if anyone is interested in landing BIP324 (P2P encryption) in bitcoin at some point, or looking to do actual \"crypto\", please help reviewing the spec and implementation\nhttps://t.co/cUQbjg0uxw",
  "data/tweet-crypto/2022/6/1542188199170260992.json": "Probably the most important graph for health, ever.\n\nInsulin resistance predicts age-related diseases.\n\n&gt;200 healthy people tested for insulin resistance. \n\nAfter 6 years, no one in lowest third got heart disease, stroke, cancer, hypertension, or diabetes. https://t.co/QZgVyZstAk",
  "data/tweet-crypto/2022/6/1542186447742050304.json": "I'm not sure how the collapse of a dozen shitcoin ponzi schemes &amp; the many suckers' lives ruined will be blamed on bitcoiners not being nice to the scammers, but I am confident the shitcoin industrial complex will find a way.",
  "data/tweet-crypto/2022/6/1542422627922464768.json": "When money is politicized &amp; weaponized (like fiat USD, EUR), it loses its monetary function.\n\nIt becomes harder to use politicized &amp; weaponized money for trade, business and investment, because it is tracked, seized, debased.\n\nStart using #bitcoin for trade, business, investment! https://t.co/BTRw8VKsi5"
}