{
  "data/tweet-nytimes/2022/7/1542681919703470083.json": "Donald Trump’s organization has paid or promised to pay legal fees for Jan. 6 witnesses, raising concerns about efforts to sway their testimony. https://t.co/mJV5Geu9m9",
  "data/tweet-nytimes/2022/7/1542734799814774789.json": "The dangers of climate change are mounting so rapidly that they could soon overwhelm the ability of both nature and humanity to adapt unless greenhouse gas emissions are quickly reduced, according to a UN report by 270 researchers from 67 countries. https://t.co/JvRrFLKJwv",
  "data/tweet-nytimes/2022/7/1542855605936848896.json": "New York City is creating the first mobile testing units in the U.S. that will allow people who test positive for the coronavirus to immediately receive for free the antiviral treatment Paxlovid. https://t.co/a3uzndOwPW",
  "data/tweet-nytimes/2022/7/1542883577683124224.json": "New Zealand's government said that the Proud Boys' involvement in the Jan. 6 attack on the U.S. Capitol was \"consistent with the definition of a terrorist act.\" It is now illegal for New Zealanders to participate in or support the group's activities. https://t.co/tZsKa2u2us",
  "data/tweet-nytimes/2022/7/1542829156139802625.json": "The WNBA star Brittney Griner arrived at a Russian court for the start of a trial on drug charges. Legal experts said it was all but certain to end in a conviction.\n \nFollow updates. https://t.co/sMFmTDBJ5L https://t.co/MVZflzq2gP",
  "data/tweet-nytimes/2022/7/1542968826714886145.json": "The Supreme Court has moved relentlessly to the right, issuing blockbuster decisions on cases from abortion to climate change that will transform U.S. life. By one standard measurement, the term that ended this week was the most conservative since 1931. https://t.co/Cjeixw0dIe https://t.co/0kksaof87y",
  "data/tweet-nytimes/2022/7/1542825370373832707.json": "Kaleem Ullah Khan has spent a lifetime grafting hundreds of types of mango onto a 120-year-old tree in northern India. His decades of experimentation have earned him fame as the “mango man.” https://t.co/5uOrqk2cMF https://t.co/4lK6txxzLf",
  "data/tweet-nytimes/2022/7/1543023273604153345.json": "Breaking News: New York lawmakers passed a bill prohibiting firearms in many public places, a week after the Supreme Court struck down a state gun control law. https://t.co/Wbo0ELlAdg",
  "data/tweet-nytimes/2022/7/1542952657530355712.json": "Two days after the Supreme Court overturned Roe v. Wade, a 27-year old woman, T., delivered her fourth child, Cason. \n\nBorn after his mother fled domestic abuse and was denied an abortion, he is among the first of many post-Roe babies expected in Texas. https://t.co/sNUqHyKXEB",
  "data/tweet-nytimes/2022/7/1543031726741639168.json": "The most advanced weapons that the U.S. has so far supplied Ukraine, including rocket launchers, are making an impact in their first days on the battlefield, destroying Russian ammunition depots and command centers, American and Ukrainian officials say. https://t.co/erki99efnB",
  "data/tweet-nytimes/2022/7/1542941132966985729.json": "This week's testimony by 26-year-old Cassidy Hutchinson pulled back the curtain on Washington: a capital helmed largely by the geriatric set, fueled by recent college graduates — many of whom have a front-row seat to moments that can define the country. https://t.co/XsM5QM51oY",
  "data/tweet-nytimes/2022/7/1542921504203186177.json": "New York City suddenly removed its high profile, color-coded coronavirus alert system this week — just as newer Omicron subvariants are fueling another rise in cases and hospitalizations. https://t.co/HdMSEeUi4K",
  "data/tweet-nytimes/2022/7/1542987688445353986.json": "\"Cacio e pepe\" can be a verb, as evidenced by this cacio e pepe'd corn on the cob recipe. https://t.co/K2J8zb4bfz https://t.co/3Xia7hKHQA",
  "data/tweet-nytimes/2022/7/1543224249984421892.json": "Experts believe that a woolly mammoth unearthed last month in the Klondike gold fields of the Yukon of Canada had been preserved in the frozen ground for more than 30,000 years. https://t.co/JBRTEXcT6x",
  "data/tweet-nytimes/2022/7/1543221172120297474.json": "After two years of tumult, these essential conversations can help couples talk about what’s working, what’s not and where the relationship is headed. https://t.co/xvNZeDVImr https://t.co/0hN17v7JWL",
  "data/tweet-nytimes/2022/7/1543236937800204290.json": "Breaking News: The Texas Supreme Court allowed a 1925 law banning abortion to take effect, overturning a lower court ruling that had blocked it. https://t.co/OHWm61Mo3q",
  "data/tweet-nytimes/2022/7/1542806498748895232.json": "President Joko Widodo of Indonesia traveled to Ukraine and Russia this week in the hopes of opening a dialogue that could end the war.\nBut he concluded his trip with little to show for it. https://t.co/VRwe1Db3gS",
  "data/tweet-nytimes/2022/7/1543271539361062912.json": "New Zealand's government said that the Proud Boys' involvement in the Jan. 6 attack on the U.S. Capitol was \"consistent with the definition of a terrorist act.\" It is now illegal for New Zealanders to participate in or support the group's activities. https://t.co/PLywsUvNaE",
  "data/tweet-nytimes/2022/7/1543261975072964608.json": "While Russia has concentrated on fighting for control of the eastern Donbas region, Ukraine has made a series of strategic gains in the south on another critical front in the war. https://t.co/llJHAHGkVR",
  "data/tweet-nytimes/2022/7/1543242362842914817.json": "Three law enforcement officers were killed and three other officers were shot after a man barricaded in his home opened fire with a rifle in Allen, Kentucky — a rural town so small that it lacks its own police force. https://t.co/S87iaTycRI",
  "data/tweet-nytimes/2022/7/1543279966288240642.json": "Donald Trump has accelerated his campaign planning, hoping a White House bid will blunt a series of damaging revelations. Some Republicans are worried. https://t.co/E7K0kGyGd5 https://t.co/hPkWO7DWfD",
  "data/tweet-nytimes/2022/7/1543335472235220995.json": "Google said that it would delete abortion clinic visits from the location history of its users, in the company’s first effort to address how it will handle sensitive data in the wake of the Supreme Court overturning Roe v. Wade. https://t.co/fGRnTl9Fsn",
  "data/tweet-nytimes/2022/7/1543331236269146113.json": "This easy, delicious key lime pie takes just 30 minutes of prep (plus 3 hours’ freezing). https://t.co/F5eZgWVsSg https://t.co/29aEAfDg8z",
  "data/tweet-nytimes/2022/7/1543277084688138241.json": "Vladimir Zelenko, a self-described \"simple country doctor\" who rocketed to prominence in the early days of the Covid-19 pandemic when his unfounded treatment using hydroxychloroquine gained White House support, died on Thursday. He was 48. https://t.co/T3CxLQ5QSa",
  "data/tweet-nytimes/2022/7/1543340447375966209.json": "An unspecified number of police officers in Akron, Ohio, were put on administrative leave after the fatal shooting of Jayland Walker, a 25-year-old Black man. The city braced for protests that could follow the release on Sunday of video of the shooting. https://t.co/QM7WTz0Lbx",
  "data/tweet-nytimes/2022/7/1543370782612627458.json": "Breaking News: The Uvalde schools police chief who directed the response to the elementary school mass shooting resigned from his city council position. https://t.co/BVwK6CiTEb",
  "data/tweet-nytimes/2022/7/1543243121538076672.json": "This special technique for grilling corn uses a side pan of honey butter to thoroughly drench the corn in flavor while keeping it hot and juicy until you’re ready to eat. https://t.co/4mmckru0YQ",
  "data/tweet-nytimes/2022/7/1543288420016988161.json": "In Opinion\n\n\"The right to contraception could be the next to fall,\" writes @MaraGay, a member of the editorial board. \"Why? Because many in this movement are animated by an insatiable desire to punish women who have sex on our own terms and enjoy it.\" https://t.co/oIBwuOkVMa",
  "data/tweet-nytimes/2022/7/1543605498712301568.json": "For five years, the most famous clock tower in Britain was hidden behind an ugly fortress of scaffolding, its hourly bong rendered mute. But this summer, a sound familiar to Londoners for more than 160 years will again ring out — Big Ben is back. https://t.co/ku5z3w30OF https://t.co/zmGm9Wp1Nu",
  "data/tweet-nytimes/2022/7/1543581432139993088.json": "The driver of a truck that could top 350 miles per hour because it was powered by jet engines died after the vehicle crashed while racing two airplanes at an air show in Michigan. https://t.co/ZPiIBOFGyu",
  "data/tweet-nytimes/2022/7/1543609264719142912.json": "Charles Bausman, a former financial executive who runs websites that promote far-right views, recorded footage in the Capitol for a Russian television producer. Soon after, he fled to Moscow as a \"political refugee.\" https://t.co/GGykX6zOuC",
  "data/tweet-nytimes/2022/7/1543650403622993921.json": "Breaking News: Several people at a Copenhagen shopping mall have been shot and one person has been arrested in connection with the shooting. \n\nThe shooting happened at Field’s, the largest shopping center in Denmark. https://t.co/I9AoeHALSQ",
  "data/tweet-nytimes/2022/7/1543594165430374408.json": "The chief security officer of the Supreme Court has asked that Virginia and Maryland officials enforce laws that would prohibit protests outside the homes of justices after weeks of demonstrations favoring abortion rights. https://t.co/y5sLKmhm05",
  "data/tweet-nytimes/2022/7/1543654565630853121.json": "The \"American Cancer Society of Michigan\" and many other fake charities had the same mailbox at one Staten Island location. Here's how the IRS missed a clear fraud. https://t.co/pHxlBDx500 https://t.co/hLLwtfLzZH",
  "data/tweet-nytimes/2022/7/1543722306031198208.json": "Jayland Walker, a 25-year-old Black man who was killed by officers in Akron, Ohio, suffered more than 60 gunshot wounds but was unarmed, the police chief said. Police released footage that showed officers’ actions but deepened questions around his death. https://t.co/S8bdppq48D",
  "data/tweet-nytimes/2022/7/1543674117966249986.json": "These seven questions will help couples check in, whether they're in a relationship that is still reeling from the pandemic, or long ago dove back into old routines without pausing to touch base. https://t.co/ZsSfAM5CJB https://t.co/88BJEbNeoT",
  "data/tweet-nytimes/2022/7/1543728122243284992.json": "The police chief in Akron, Ohio, said officers shot Jayland Walker more than 60 times. Police reported gunfire from Walker’s vehicle after attempting to pull him over but confirmed he was unarmed at the time he was chased on foot and killed. https://t.co/aL7NLyhuLM https://t.co/JlOJ0BpIq9",
  "data/tweet-nytimes/2022/7/1543633984978051073.json": "Vladimir Zelenko, a self-described \"simple country doctor\" who rocketed to prominence in the early days of the Covid-19 pandemic when his unfounded treatment using hydroxychloroquine gained White House support, died on Thursday. He was 48. https://t.co/gBxXPKkxZ1",
  "data/tweet-nytimes/2022/7/1543631917937004546.json": "A new generation of women activists opposing abortion rights — often pointed to by anti-abortion leaders as the face of the movement — say they are poised to continue the fight in a post-Roe nation. https://t.co/BoiNtFmvqU",
  "data/tweet-nytimes/2022/7/1543820662187368449.json": "News Analysis: Former President Donald Trump has weathered scandals by keeping his intentions under wraps, Peter Baker writes. But recent testimony paints a stark portrait of a man willing to do almost anything to hang onto power. https://t.co/iZosXOem0T",
  "data/tweet-nytimes/2022/7/1543907497957801986.json": "Sixty years after the execution of Adolf Eichmann, the Nazi war criminal, his confessions have been aired in a new documentary.\n\nHours of tape recordings expose Eichmann's visceral, ideological antisemitism and his role in the mechanics of mass murder. https://t.co/2lPxpVKWLI https://t.co/vsqCqmZOHc",
  "data/tweet-nytimes/2022/7/1543624381720666113.json": "A central theme of Kremlin propaganda about the war in Ukraine is that the country's government and culture are filled with dangerous Nazis. These false claims started on state media, but smaller news sites have gone on to amplify the messages. https://t.co/M7la0G1VIN",
  "data/tweet-nytimes/2022/7/1544016309008191488.json": "Breaking News: Five people were killed and 16 were hospitalized in the shooting at a Fourth of July parade in Highland Park, north of Chicago. The police are still searching for the gunman.\n\nFollow our updates.\nhttps://t.co/db3NboaX9j",
  "data/tweet-nytimes/2022/7/1543965442775064576.json": "In Opinion\n\n“If Trump runs again, the Democratic Party had better put its strongest opponent forward to stop him,” Bret Stephens tells Gail Collins in their latest conversation. “God love Biden, but he ain’t it.” https://t.co/mcatlNuZaI",
  "data/tweet-nytimes/2022/7/1543665922963116032.json": "In Ukraine, volunteers with limited training are increasingly heading into the kind of battles that test even the most experienced soldiers. Their bodies are being returned to fill up cemeteries in largely peaceful cities and towns in the country’s west. https://t.co/uh0iYP5Atd https://t.co/qjSGorMTro",
  "data/tweet-nytimes/2022/7/1544004226782732290.json": "A shooting caused hundreds of people to flee for safety from the Fourth of July parade in Highland Park, Illinois, the authorities said. The Lake County Sheriff’s Office urged people to stay away from the area.\nhttps://t.co/eAPvRxNX9r",
  "data/tweet-nytimes/2022/7/1544034857575239681.json": "Witnesses of the shooting at a Fourth of July parade in Highland Park, Illinois, described scenes of chaos, terror and confusion.\n\n“The streets were just filled with people running, kids crying,” one woman told a local news station.\nhttps://t.co/Cp67JV4eIT",
  "data/tweet-nytimes/2022/7/1544052930285805570.json": "A shooting at a Fourth of July parade in Highland Park, Illinois, sent hundreds of people fleeing for safety. The police said six people were killed and dozens were wounded after a gunman opened fire from a rooftop.\nhttps://t.co/2buIjwH98j https://t.co/Hhsq7vv4gJ",
  "data/tweet-nytimes/2022/7/1544028697056911364.json": "Fourth of July celebrations have been canceled in Highland Park, Illinois, and several nearby communities in response to the shooting at Highland Park’s parade, as the police hunted for the perpetrator.\n\nFollow our updates.\nhttps://t.co/8fBq4vS6mx",
  "data/tweet-nytimes/2022/7/1544142040237326336.json": "Nicolas Toledo, 76, didn’t want to attend the Highland Park July 4th parade, but his disabilities required him to be around someone full-time.\n\nHe was in his wheelchair when the rooftop gunman started firing. He suffered three gunshot wounds, killing him. \nhttps://t.co/SBB3a5L66c",
  "data/tweet-nytimes/2022/7/1543905010685198336.json": "U.S. Special Operations veterans are training Ukrainian soldiers near the front lines in the war against Russia and, in some cases, helping to plan combat missions. The crowdfunded volunteers traveled to Ukraine despite warnings from the Pentagon. https://t.co/ivEGsk9Or5",
  "data/tweet-nytimes/2022/7/1544134455857643522.json": "President Biden once again expressed the horror of a nation in a statement, saying he was “shocked by the senseless gun violence” after a gunman killed six people and injured more than three dozen others at a July 4 parade in Highland Park, Illinois. https://t.co/jquXO7m934",
  "data/tweet-nytimes/2022/7/1544175523261300738.json": "Joe Turkel, a character actor who appeared in scores of movies but is best known for two of his final performances — as Lloyd the bartender in “The Shining” and Dr. Eldon Tyrell in “Blade Runner” — died on June 27. He was 94. https://t.co/vsbg8ysHC7",
  "data/tweet-nytimes/2022/7/1544190620918497280.json": "Brittney Griner, the WNBA star who has been detained in Russia on drug charges since February, sent a handwritten letter to President Biden asking him not to forget about her.\n\n\"I’m terrified I might be here forever,\" she wrote. https://t.co/sakqIzimPU",
  "data/tweet-nytimes/2022/7/1544301072889647107.json": "NATO formally approved membership bids for Finland and Sweden. Now, the legislatures of the 30 alliance members will consider ratification, a process that must be unanimous and can take several months at least.\nhttps://t.co/lzODZACuaG",
  "data/tweet-nytimes/2022/7/1544293791447896066.json": "Lauren Silva helped to rescue a toddler who was lying beneath an unresponsive and bleeding man during the shooting at a Fourth of July parade in Highland Park, Illinois.\n\n“I held him like he was my own,” she said.\nhttps://t.co/VmyEHA8jBw",
  "data/tweet-nytimes/2022/7/1544297051768381440.json": "Demaryius Thomas, a star NFL player, had CTE when he died in December at 33, doctors announced. But the posthumous diagnosis alone does not explain what role football had in his quick decline.\nhttps://t.co/5P26wqXNBE",
  "data/tweet-nytimes/2022/7/1544332803860533256.json": "Even in a country battered from the constancy of mass violence — at grocery stores, elementary schools, street corners — the shooting at a parade in Highland Park, Illinois, proved shocking. Six people were killed, including a 76-year-old grandfather. https://t.co/QMysERTqsZ https://t.co/gqzY86xLm2",
  "data/tweet-nytimes/2022/7/1544205702519980035.json": "High-profile Russians deemed insufficiently patriotic are being detained by security forces.\n\nThe message sent by these arrests: Nearly anyone is now punishable in Vladimir Putin’s Russia. https://t.co/IKQohGlYKL",
  "data/tweet-nytimes/2022/7/1544384395389407236.json": "Nearly a year after El Salvador’s president made Bitcoin a national currency, his bet on the digital coin appears to be backfiring.\n\nThe value of the government’s crypto holdings has plunged, and the country is running out of cash. https://t.co/4O3ICt8t4h",
  "data/tweet-nytimes/2022/7/1544362046921252869.json": "Breaking News: The suspect in the shooting in Highland Park, Illinois, during a Fourth of July parade planned the attack for weeks and wore women's clothing as a disguise to escape, officials said. https://t.co/s22971eZFr",
  "data/tweet-nytimes/2022/7/1544375917501464581.json": "Breaking News: Two British ministers, Rishi Sunak and Sajid Javid, unexpectedly quit, leaving Prime Minister Boris Johnson battling for his political survival amid a series of scandals. https://t.co/Wdbmp9qtOT",
  "data/tweet-nytimes/2022/7/1544411827941113856.json": "Breaking News: Rudy Giuliani, Lindsey Graham and several other Donald Trump allies were subpoenaed in Georgia’s criminal inquiry into election interference. https://t.co/qwi1l2UbSq",
  "data/tweet-nytimes/2022/7/1544429700465950725.json": "Rudy Giuliani, Lindsey Graham and several other Donald Trump allies were subpoenaed in Georgia’s criminal inquiry into election interference. https://t.co/BaiBvtu6Gu https://t.co/JuwaLAQ6GC",
  "data/tweet-nytimes/2022/7/1544428433438031888.json": "To serve this Georgian dish known as khachapuri adjaruli, you drop an egg yolk and some cold butter into the molten cheese and stir it into a gooey, stretchy cheese puddle. \n\nFull recipe: https://t.co/8OlWy5Qd16 https://t.co/mbVB0H3nZE",
  "data/tweet-nytimes/2022/7/1544481263066677250.json": "The governors of New York and New Jersey agreed to split the local costs of train tunnels under the Hudson River and a new bridge. https://t.co/RBldj634Qn",
  "data/tweet-nytimes/2022/7/1544456107145453568.json": "Sara Kruzan was 16 when she killed a man who she said sexually abused and trafficked her for years. She served nearly two decades in prison, and her case reignited criticism of the way courts treat survivors of abuse. https://t.co/K9yAb5NNLB",
  "data/tweet-nytimes/2022/7/1544462399985557506.json": "The Lake County coroner, Jennifer Banek, read aloud the names of six of the seven victims of the shooting in Highland Park, Illinois, at a news conference on Tuesday afternoon.\n\nFollow our live updates. https://t.co/uWd81Zgu5e https://t.co/X7coQCM4qX",
  "data/tweet-nytimes/2022/7/1544511479105331200.json": "A Colorado funeral home operator who was accused of stealing body parts and selling them to medical and scientific buyers, making hundreds of thousands of dollars in what the authorities called an “illegal body part scheme,” pleaded guilty to mail fraud. https://t.co/j5l9YgvtmZ",
  "data/tweet-nytimes/2022/7/1544516517349425152.json": "Newly signed legislation will make it more difficult to obtain a handgun license and buy high-capacity rifles in New Jersey, the latest in a patchwork effort by states to work around a sweeping Supreme Court ruling aimed at dismantling them. https://t.co/q8tJeKD2bb",
  "data/tweet-nytimes/2022/7/1544632925504806912.json": "Breaking News: European lawmakers voted to classify some gas and nuclear energy projects as “green,” a landmark decision that could be replicated elsewhere.\nhttps://t.co/2SwX4ZjT35",
  "data/tweet-nytimes/2022/7/1544652664570626049.json": "Western pygmy possums don’t usually live with western spiny-tailed geckos. But a nest box in Australia seems to have become a comfortable, if slightly crowded, home for the new roommates.\nhttps://t.co/hxeKaDqkul https://t.co/tQ2vlvNGyi",
  "data/tweet-nytimes/2022/7/1544468679726964736.json": "The Justice Department sued Arizona over a new Republican-imposed law requiring proof of citizenship to vote in a presidential election. https://t.co/5ArlDAir0p",
  "data/tweet-nytimes/2022/7/1544702309074194437.json": "Breaking News: Pat Cipollone, the former White House counsel to Donald Trump who repeatedly fought Trump's efforts to overturn the 2020 election, has agreed to testify by Friday before the Jan. 6 committee. https://t.co/wQjxzGsuCV",
  "data/tweet-nytimes/2022/7/1544690154685845509.json": "A New York judge held one of the world’s largest real estate firms — which appraised several of Donald Trump’s properties — in contempt of court amid a civil investigation into whether the former president falsely inflated the value of his assets. https://t.co/LTiM3QWOFd",
  "data/tweet-nytimes/2022/7/1544526575093284864.json": "Nuclear power is winning political converts in the U.S., amid obstacles facing clean energy goals and new electricity demands. https://t.co/QNJ3VSSTYO",
  "data/tweet-nytimes/2022/7/1544735461192744961.json": "The Gun Violence Archive has counted more than 300 mass shootings in the U.S. so far in 2022. Of those shootings, 15 involved four or more fatalities, including the one in Highland Park on Monday. https://t.co/pxSprXPbLt https://t.co/KLCucX3geo",
  "data/tweet-nytimes/2022/7/1544693933644685315.json": "Joe Rogan said he had declined several times to have Donald Trump on his influential Spotify podcast. “I don’t want to help him,” said Rogan, who has amplified Covid-19 misinformation and is popular with many Trump supporters. https://t.co/OLpILX1VBN",
  "data/tweet-nytimes/2022/7/1544784528966930432.json": "These are the names of the seven victims of the Fourth of July mass shooting in Highland Park, Illinois. https://t.co/11QpDDfLR7 https://t.co/WlaD0qkMBD",
  "data/tweet-nytimes/2022/7/1544809945626976259.json": "Breaking News: James Comey and Andrew McCabe, former FBI officials who Donald Trump wanted prosecuted, were both subjected to rare, intensive IRS audits. https://t.co/0TiHYvn7Uy",
  "data/tweet-nytimes/2022/7/1544776983422373889.json": "There is wide agreement across the federal government that disinformation campaigns threaten to exacerbate public health crises, stoke racial divisions and undermine democracy. But a deep partisan divide has made addressing these threats nearly impossible. https://t.co/Ygs2spLzcw",
  "data/tweet-nytimes/2022/7/1544966621424455680.json": "Breaking News: Boris Johnson will resign as the leader of Britain’s Conservative Party, the BBC said, clearing the way for his eventual departure as prime minister.\n\nFollow updates. https://t.co/fe9rwKZJer",
  "data/tweet-nytimes/2022/7/1544843672411377665.json": "The parents of two girls who said their children died as a result of a “blackout challenge” on TikTok are suing the company, claiming its algorithm intentionally served the children dangerous content that led to their deaths.\nhttps://t.co/jRdEME7FMi",
  "data/tweet-nytimes/2022/7/1544746790012043265.json": "The population of U.S. families making more than $100,000 has grown much faster than other groups, even after adjusting for inflation, and the number of families earning less than $40,000 has increased at twice the rate as families in the middle. https://t.co/j9eAPF9vjd",
  "data/tweet-nytimes/2022/7/1545013082417778689.json": "Breaking News: Prime Minister Boris Johnson of Britain said he would step down once a successor was chosen. “The process of choosing that new leader should begin now,” he said.\n\nFollow our updates.\nhttps://t.co/12Jx5dcUbF https://t.co/6Ao5KxoeQB",
  "data/tweet-nytimes/2022/7/1545014824282640384.json": "The most transmissible coronavirus subvariant yet, BA.5, is threatening a new wave of infections in the U.S., even among those who recovered from the virus fairly recently. The risk from Covid is increasing in much of the country, according to the CDC. https://t.co/LRSQENUVXD",
  "data/tweet-nytimes/2022/7/1544750573068718083.json": "\"The Minions aren’t voiced by celebrities. The Minions don’t make timely pop-culture references. The Minions just hit gag after gag: pure physical comedy without borders,\" writes Calum Marsh.\n\n\"And that’s how the Minions took over the world.\" https://t.co/gPOZO9rjVi",
  "data/tweet-nytimes/2022/7/1545051632240472065.json": "Breaking News: The detained U.S. basketball star Brittney Griner pleaded guilty to drug charges in Russia. She may face up to 10 years in a penal colony.\n\n\"There was no intent. I didn’t want to break the law,\" she said. https://t.co/bUdt4jwuJW https://t.co/DRQvRCw3C4",
  "data/tweet-nytimes/2022/7/1545101972562395136.json": "Breaking News: James Caan, the actor best known for his role as the quick-tempered Sonny Corleone in \"The Godfather,\" died at 82. https://t.co/7MJG4Q3e7y",
  "data/tweet-nytimes/2022/7/1544712794284630016.json": "Representative Mayra Flores is one of three Republican Latinas vying to transform South Texas politics by shunning moderates, embracing the far right and supporting Donald Trump. https://t.co/kpssUfGEX4",
  "data/tweet-nytimes/2022/7/1545015577810538496.json": "\"Them's the breaks,\" Prime Minister Boris Johnson of Britain said as he resigned as Conservative Party leader.\n\nHis departure comes after a rebellion of his cabinet, a wave of government resignations and a devastating loss of party support. https://t.co/F80IyQp8KR https://t.co/Zk06VS8Ilp",
  "data/tweet-nytimes/2022/7/1545146311648940038.json": "Breaking News: Derek Chauvin, convicted of murdering George Floyd, was sentenced to 21 years for using excessive force against Floyd and a 14-year-old boy. His federal and state sentences are to be served concurrently. https://t.co/Mv5HXI6EUR",
  "data/tweet-nytimes/2022/7/1545138115626602497.json": "Jeff Bezos won't be able to sail a superyacht through Rotterdam anytime soon. The boat's builder decided not to apply for a permit to dismantle a section of a 95-year-old bridge to allow the yacht to pass. https://t.co/8fUrLncJLM",
  "data/tweet-nytimes/2022/7/1545165802428661762.json": "James Caan, the actor who has had roles in \"The Godfather,\" \"Misery\" and \"Elf,\" died on Wednesday. The Bronx native was 82. https://t.co/bi0RjpIq9f https://t.co/d4tUxJ11tV",
  "data/tweet-nytimes/2022/7/1545170830073659394.json": "Sandra Lindsay, the New York critical care nurse who was the first American vaccinated against Covid-19 outside of a clinical trial, was presented with the Presidential Medal of Freedom on Thursday. She was one of 17 people awarded by President Biden. https://t.co/XxXw6r0k5p https://t.co/XfI76agaga",
  "data/tweet-nytimes/2022/7/1544863811479511041.json": "The Kraffts, married French volcanologists, were killed on June 3, 1991, observing an eruption of Mount Unzen in Japan. But the stunning 16-millimeter footage they shot throughout their careers lives on in “Fire of Love,” an all-archival documentary. https://t.co/TfUvaEKX03",
  "data/tweet-nytimes/2022/7/1545185922119254016.json": "Simone Biles was one of 17 people who received the Presidential Medal of Freedom, the nation’s highest civilian award, on Thursday. Other recipients included the soccer star Megan Rapinoe and former Representative Gabrielle Giffords. https://t.co/9trSZFve3H https://t.co/LI4vOhR8Su",
  "data/tweet-nytimes/2022/7/1545158224390852613.json": "The former Cleveland police officer who killed Tamir Rice in 2014 was sworn into a new job as a police officer in a rural town in Pennsylvania. Two days later, he left the post, following a public outcry. https://t.co/5LXLevK2fY",
  "data/tweet-nytimes/2022/7/1545116223704285184.json": "A subvariant of Omicron, known as BA.5, is the most transmissible variant yet of the coronavirus, and is fueling fresh outbreaks of cases and hospitalizations in many places including the U.S. https://t.co/VwLDQKVrhX",
  "data/tweet-nytimes/2022/7/1545247157996994564.json": "Breaking News: Shinzo Abe, Japan’s former prime minister, collapsed after a gunshot was heard as he delivered a speech, the country’s public broadcaster said. https://t.co/uDtIOskw3f",
  "data/tweet-nytimes/2022/7/1545267646022795264.json": "Shinzo Abe, Japan's former prime minister, was unconscious after he was apparently shot in Nara, Japan, a fire official said. He appeared to be bleeding after a gunshot was heard, the broadcaster NHK said. This is a developing story.\n\nFollow updates. https://t.co/1sSa4ntKPW",
  "data/tweet-nytimes/2022/7/1545154487580594177.json": "The Dallas Cowboys are facing criticism after announcing a new partnership with Black Rifle Coffee, the veteran-owned brand popular with conservatives and gun owners that sells roasts with names like “AK Espresso,” “Murdered Out” and “Silencer Smooth.” https://t.co/Emj28ZEr1Q",
  "data/tweet-nytimes/2022/7/1545278424008253441.json": "Secretary of State Antony Blinken, who was in Bali for a Group of 20 meeting, said that he was “deeply saddened and deeply concerned” by the news that Shinzo Abe, Japan's former leader, had apparently been shot.\n\nFollow live updates. https://t.co/QshESqu2jm https://t.co/ezgBRNj47I",
  "data/tweet-nytimes/2022/7/1545289297485520899.json": "Breaking News: Shinzo Abe, Japan's former leader, is in critical condition after being shot, Prime Minister Fumio Kishida said. Appearing emotional, he called the shooting a \"heinous act.\"\n\nFollow live updates. https://t.co/lYB9xKtNh2 https://t.co/fKCNA6gckO",
  "data/tweet-nytimes/2022/7/1545299832637620224.json": "Videos shared on social media showed the scene moments after Shinzo Abe, Japan's former leader, was shot at a junction in the city of Nara.\n\nThis video includes scenes of graphic violence: https://t.co/7MxzFjSOkf https://t.co/kSUut1WX5a",
  "data/tweet-nytimes/2022/7/1545101618194120704.json": "Memory decline is not inevitable with aging, neuroscientist Dr. Richard Restak argues in his latest book. Here are some of his tips for developing and maintaining a healthy memory. https://t.co/iRePACBvJ9",
  "data/tweet-nytimes/2022/7/1545071428906655745.json": "Brad Pitt has said he might have prosopagnosia, a rare neurological disorder commonly referred to as face blindness. Here’s what to know about the condition. https://t.co/aAXb55NBwq",
  "data/tweet-nytimes/2022/7/1545336548895473664.json": "Breaking News: Shinzo Abe, Japan’s longest-serving prime minister, was assassinated during a public speech. He was 67. A suspect was arrested. https://t.co/m82R4CByyF https://t.co/9nosZ1Jpcp",
  "data/tweet-nytimes/2022/7/1545330870394970112.json": "Akie Abe, the wife of Shinzo Abe, arrived at the hospital where Japan's former prime minister was being treated after he was shot, according to local media.\n\nFollow our updates.\nhttps://t.co/rGA7PSuot1 https://t.co/DQTQJZYDZO",
  "data/tweet-nytimes/2022/7/1545310719092072448.json": "The brother of Shinzo Abe and Japan's defense minister, Nobuo Kishi, said of the attack on Abe: \"Especially suppression of free speech should not be allowed in the midst of the upper house election.\" \n\n\"We pray for his definite recovery.\" https://t.co/kxweVRs3IM https://t.co/QazQ9yUm9j",
  "data/tweet-nytimes/2022/7/1545343230094499843.json": "Shinzo Abe, Japan’s longest-serving prime minister, died on Friday after being shot. He was 67.\n\nHe helped pull his country out of economic malaise, but fell short of his most cherished goal: making Japan a normalized military power.\nhttps://t.co/rq4J0Nj1l5 https://t.co/DIdGf4gcow",
  "data/tweet-nytimes/2022/7/1545370897003020293.json": "Prime Minister Fumio Kishida of Japan condemned the killing of Shinzo Abe and praised the former leader’s achievements in peace and stability in both Japan and the world.\nhttps://t.co/0kdbVMQJsG https://t.co/ELPgrJIRGj",
  "data/tweet-nytimes/2022/7/1545384744174686209.json": "The assassination of Shinzo Abe rattled Japan and its sense of identity as a peaceful country where violent crime is rare.\n\n“I’m shocked by this,” one woman said. “The shooting part is confusing. There are guns? In Japan?”\nhttps://t.co/slQoY2gKMd",
  "data/tweet-nytimes/2022/7/1545382216003469312.json": "Mourners placed flowers near the site where Shinzo Abe, Japan’s former prime minister, was assassinated in the city of Nara.\n\nFollow our updates.\nhttps://t.co/ng1JsLS5vz https://t.co/wYxe3z4nG2",
  "data/tweet-nytimes/2022/7/1545163269702311937.json": "How many children does Elon Musk have? News reported on Wednesday brought the known total to nine. https://t.co/5GEE1TJyWI",
  "data/tweet-nytimes/2022/7/1545404862657138690.json": "President Biden said he was “stunned, outraged and deeply saddened by the news that my friend Abe Shinzo, former prime minister of Japan, was shot and killed while campaigning. This is a tragedy for Japan and for all who knew him.”\nhttps://t.co/VKtANf3QDH https://t.co/j1B1axKWOL",
  "data/tweet-nytimes/2022/7/1545432561970724865.json": "The attack on former Prime Minister Shinzo Abe of Japan was especially shocking since gun violence is extremely rare in the country. Japan’s firearms law states that, in principle, firearms are not permitted. https://t.co/OajvZmScnY",
  "data/tweet-nytimes/2022/7/1545426950193299456.json": "Breaking News: The Wisconsin Supreme Court prohibited the use of most drop boxes for absentee ballots, a win for Republicans who want to limit voting access in urban areas. https://t.co/nOMoD5z1t8",
  "data/tweet-nytimes/2022/7/1545422525001244673.json": "In Opinion\n\n“Johnson’s career is ending, at least for now, the way Trump’s should have ended — with public revulsion leading his own party to oust him,\" writes Michelle Goldberg of the British prime minister. https://t.co/uBDVUCSvpk",
  "data/tweet-nytimes/2022/7/1545460258847576064.json": "Prime Minister Fumio Kishida of Japan on Friday called the fatal shooting of former Prime Minister Shinzo Abe an \"act of cowardly barbarism.\" https://t.co/FEkYw6Xo46 https://t.co/trp0qQMLGY",
  "data/tweet-nytimes/2022/7/1545426262981763072.json": "The symptoms of coronavirus subvariants BA.4 and BA.5 are similar to those of earlier versions of Omicron, experts said. https://t.co/WIkKYeRt9m https://t.co/hYTgcAdHYN",
  "data/tweet-nytimes/2022/7/1545411156101193730.json": "Shinzo Abe, Japan’s former prime minister, was assassinated as he gave a speech in the western city of Nara. A 41-year-old suspect was arrested and a crude weapon was retrieved, the police said.\n\nHere’s a look at the scene of the attack.\nhttps://t.co/nSRBVbmFsC https://t.co/VNbe1uok4s",
  "data/tweet-nytimes/2022/7/1545472816916709376.json": "A person in Japan must pass 12 steps before purchasing a firearm, including a written exam and a doctor's sign-off on their mental and physical health. Gun violence is almost unheard of in Japan, making Shinzo Abe's assassination even harder to fathom. https://t.co/2si1OvMY0x",
  "data/tweet-nytimes/2022/7/1545442615977545728.json": "Canadians will recognize this recipe: butter tarts. Each bite delivers three textures: flaky crust, chewy top, gooey center. https://t.co/aakrltetir https://t.co/Cxzh8KOgVm",
  "data/tweet-nytimes/2022/7/1545368870617235461.json": "\"This is America,\" President Biden said after awarding the Presidential Medal of Freedom to 17 people. The recipients included Simone Biles, Denzel Washington and former Senator John McCain, who was honored posthumously. https://t.co/ZD7bABLKl6",
  "data/tweet-nytimes/2022/7/1545526918333845508.json": "President Biden issued an order aiming to protect access to abortion medication and emergency contraception — but details on how those goals would be accomplished were not outlined. https://t.co/PJey7MNMpI https://t.co/suQkMs02kZ",
  "data/tweet-nytimes/2022/7/1545527091134959618.json": "Elon Musk said on Friday that he planned to terminate his blockbuster $44 billion deal to buy Twitter, after publicly indicating over months that he was dissatisfied with the agreement. https://t.co/dClbWNxhqW https://t.co/ps6AymA1vX",
  "data/tweet-nytimes/2022/7/1545500488946405376.json": "A 41-year-old man used a “homemade” gun to assassinate Shinzo Abe, the former prime minister of Japan, police officials said. The man was arrested and charged with murder. https://t.co/LQg3EyTGEn https://t.co/DaXNVPQx4E",
  "data/tweet-nytimes/2022/7/1545490056823062531.json": "Breaking News: Four Border Patrol agents are facing disciplinary action over their aggressive treatment of migrants at the border last year.\nhttps://t.co/JqzM5y28z8",
  "data/tweet-nytimes/2022/7/1545588583242817537.json": "Tony Sirico, the actor who played Paulie Walnuts in the hit HBO series “The Sopranos,” has died at 79. https://t.co/kUGPOyQc90",
  "data/tweet-nytimes/2022/7/1545558375056003072.json": "If LeBron James, instead of Brittney Griner, were in custody, wouldn't the outcry be louder? Male athletes benefit from a sports ecosystem that gives them more attention and bigger fame, @kurtstreeter writes. https://t.co/ROycIfqHgN",
  "data/tweet-nytimes/2022/7/1545538251091476482.json": "In Opinion\n\n\"It offends me to see sanctimonious public prayer in any circumstance — but a coach holding his players hostage while an audience watches his piety makes my skin crawl,\" writes Anne Lamott, a novelist, in a guest essay. https://t.co/P85uBxDsrW",
  "data/tweet-nytimes/2022/7/1545407457715015682.json": "In a game called GeoGuessr, competitors try to pinpoint where in the world a Google Street View image has been taken. Some can do it in seconds. https://t.co/OM8iLsw06g",
  "data/tweet-nytimes/2022/7/1545389763301097479.json": "The U.S. women’s national soccer team qualified for the 2023 Women’s World Cup after a 5-0 victory over Jamaica in a regional championship. The team will now play to secure a place in the Paris Olympics.\nhttps://t.co/Trre5UUqB3 https://t.co/g3ZPfxmla4",
  "data/tweet-nytimes/2022/7/1545573470905548806.json": "A new wave of right-wing candidates is explicitly aiming to promote Christian power in America, with many mixing religious fervor with conspiracy theories, and even calling for the end of the separation of church and state.\nhttps://t.co/wFLMWZ9V3J",
  "data/tweet-nytimes/2022/7/1545430042985074688.json": "A judge in Britain sided with Prince Harry in his defamation suit against the tabloid newspaper, The Mail on Sunday. The ruling, part of an initial phase of Harry's libel case, found parts of the article to be defamatory. https://t.co/KDku3YyG6z",
  "data/tweet-nytimes/2022/7/1545697999271391232.json": "Breaking News:  Protesters in Sri Lanka entered the president’s home as thousands descended on the capital amid fury over a devastating economic crisis.\n\nhttps://t.co/V2uiX1GnyD",
  "data/tweet-nytimes/2022/7/1545568435085656064.json": "Tin Chin and Mo Lin were inseparable at the Brooklyn homeless shelter where they met. But one of the men wasn’t who he seemed to be. https://t.co/cI1Q151BHw",
  "data/tweet-nytimes/2022/7/1545732512827297792.json": "Memory decline is not inevitable with aging, neuroscientist Dr. Richard Restak argues in his latest book. Here are some of his tips for developing and maintaining a healthy memory. https://t.co/QyFr9cuUiy",
  "data/tweet-nytimes/2022/7/1545766741455917056.json": "The prime minister of Sri Lanka announced that he will quit. President Gotabaya Rajapaksa has been asked by the country’s political leaders to also step down after months of protests accusing him of running the economy into the ground. https://t.co/yMTAPxaWCv"
}