{
  "data/tweet-nytimes/2022/3/1498451756547657734.json": "Putin has tried to control news outlets, social media and the opposition. Yet protests over the war in Ukraine still broke out. @sheeraf and @antontroian discuss Russian public opinion on Tuesday at 12 p.m. ET. DM questions to @nytimesevents. https://t.co/3fGr5m9yvk",
  "data/tweet-nytimes/2022/3/1498447987433000965.json": "News Analysis: After miscalculating Ukraine’s resolve to fight, Russian forces are turning to an old pattern of firing on cities and mounting sieges. https://t.co/LktaeJhlOX",
  "data/tweet-nytimes/2022/3/1498474364269998087.json": "Three members of Russia’s rubber-stamp Parliament have criticized their country’s war in Ukraine, a rare episode of dissent from within the Russian establishment. https://t.co/mopHtyoJU9",
  "data/tweet-nytimes/2022/3/1498464792243281926.json": "Senator Richard Durbin has called on the Biden administration to offer Temporary Protected Status to thousands of Ukrainians who are temporarily working or studying in the U.S., allowing them to stay without fear of deportation. https://t.co/YByruo2jaK",
  "data/tweet-nytimes/2022/3/1498459285117976576.json": "About half a million refugees have fled Ukraine since Russia’s invasion began last week, according to the United Nations refugee agency.\n\nAbout half of them crossed the western border to Poland. Others have gone to Hungary, Moldova, Romania and Slovakia.\nhttps://t.co/ktF9ultRmZ https://t.co/mNzTg2PvWr",
  "data/tweet-nytimes/2022/3/1498490713746681857.json": "President Volodymyr Zelensky called on Monday for an international tribunal to investigate and punish Russia for its actions in Ukraine, which he described as war crimes. https://t.co/Ra39PmfOJr",
  "data/tweet-nytimes/2022/3/1498478165362200581.json": "Disney said on Monday that it was “pausing” theatrical releases in Russia, including the Pixar film “Turning Red,” which was scheduled to release there on March 10. https://t.co/75KNP8nY9P",
  "data/tweet-nytimes/2022/3/1498470632438353922.json": "The prosecutor of the International Criminal Court said Monday that he will pursue an investigation into the war in Ukraine, citing a “reasonable basis to believe that both alleged war crimes and crimes against humanity have been committed.” https://t.co/9sycoJn4IV",
  "data/tweet-nytimes/2022/3/1498488213626884104.json": "The first talks between Ukraine and Russia aimed at halting the Russian invasion were eclipsed Monday by a deadly Russian rocket assault on Kharkiv, Ukraine’s second-largest city, that killed at least nine civilians and wounded dozens. https://t.co/42Hm2jl7iS",
  "data/tweet-nytimes/2022/3/1498504561656479749.json": "When \"wiper\" malware appeared to target Ukraine a few hours before Russia's invasion, Microsoft stepped in, throwing itself into the middle of a war. https://t.co/wM51WB5G43",
  "data/tweet-nytimes/2022/3/1498468080267182080.json": "The U.S. said Monday that it would expel 12 Russian diplomats from Moscow’s UN mission, saying they were actually intelligence operatives who had spied on the United States. https://t.co/JGl93kGyV1",
  "data/tweet-nytimes/2022/3/1498523459567202306.json": "In Opinion\n\nThe idealism of Ukrainians \"has turned out to be a powerful weapon,\" writes Michelle Goldberg. \"They’ve shown older democracies what it means to fight for their own putative values, leading to an almost ecstatic global outpouring of support.\" https://t.co/Wt1zYoIDSX",
  "data/tweet-nytimes/2022/3/1498513379144650755.json": "Cryptocurrency investors have donated more than $22 million worth of digital assets to the Ukrainian government and a nonprofit supporting the country’s military, according to data provided by the blockchain tracking firm Elliptic. https://t.co/Zf8Np4nQjN",
  "data/tweet-nytimes/2022/3/1498536862637608962.json": "Internet terminals sent by Elon Musk have arrived in Ukraine, according to the country's vice prime minister. The terminals were designed to work with satellites orbiting in space to provide internet access. https://t.co/6DVMHeaH9G",
  "data/tweet-nytimes/2022/3/1498463050424373250.json": "Republican congressional leaders on Monday denounced the actions of two House Republicans — Representative Marjorie Taylor Greene of Georgia and Representative Paul Gosar of Arizona — who participated in a far-right conference with ties to white supremacy. https://t.co/n8CYa8ztlu",
  "data/tweet-nytimes/2022/3/1498550564933804036.json": "As antiwar protests continued across Russia, the police detained at least 411 people in 13 cities on Monday, an activist group said. \n\nThe protests are a remarkable display of defiance in a country where prison terms are sometimes sought for demonstrators. https://t.co/etECbB73Gn https://t.co/zooLbvDvhe",
  "data/tweet-nytimes/2022/3/1498518529125015552.json": "For many Afghans who fled during the Taliban takeover, the few personal items they could grab are now their only tangible ties to the world they left behind. For Tahera Ahmadi, who sold her jewelry to afford the travel, it was a pin from her eldest sister. https://t.co/uhNHcQiQeL https://t.co/2Xjr3tiXBR",
  "data/tweet-nytimes/2022/3/1498598946989608960.json": "Valery Gergiev, a Russian maestro and prominent supporter of President Vladimir Putin of Russia, was removed from his post as chief conductor of the Munich Philharmonic after he refused to denounce Russia’s invasion of Ukraine.\nhttps://t.co/fCE9W6B2dG",
  "data/tweet-nytimes/2022/3/1498583871071436809.json": "An enormous explosion hit central Kharkiv, directly in front of a government building in Ukraine’s second largest city, officials said.\n\nVideo of the attack showed a large fireball that appeared to engulf several cars driving through the area.\nhttps://t.co/JjIV2DXnKZ https://t.co/oEboRgSgpU",
  "data/tweet-nytimes/2022/3/1498621339602673665.json": "Internet terminals sent by Elon Musk have arrived in Ukraine, according to the country's vice prime minister. The terminals were designed to work with satellites orbiting in space to provide internet access.\nhttps://t.co/uPI9IVWicq",
  "data/tweet-nytimes/2022/3/1498618157984100355.json": "Lee Young-ae, a South Korean actress popular in Ukraine, donated $83,500 to help the victims of war there, the Ukrainian ambassador-designate to Seoul​ said​.\n\nLee said she hoped that “the Ukrainian people will not lose hope and courage.”\nhttps://t.co/R0DJVCk9X5",
  "data/tweet-nytimes/2022/3/1498634175401889793.json": "President Volodymyr Zelensky of Ukraine pleaded for EU membership for his country in an emotional speech to the European Parliament. “We have proven that at a minimum we are exactly the same as you,” he told European lawmakers.\nhttps://t.co/Afqu90tpJN https://t.co/ImcMG8s8S6",
  "data/tweet-nytimes/2022/3/1498629158682902529.json": "Video verified by The New York Times shows an attack on apartment buildings next to a kindergarten in Kherson, a city that has been a target of Russia’s assault on southern Ukraine. Russian foot soldiers can also be seen patrolling the streets.\nhttps://t.co/9LU8Hv9uYt",
  "data/tweet-nytimes/2022/3/1498636929134473221.json": "When \"wiper\" malware appeared to target Ukraine a few hours before Russia's invasion, Microsoft stepped in, throwing itself into the middle of a war. https://t.co/yhsqQV3hlC",
  "data/tweet-nytimes/2022/3/1498655162868670475.json": "At least 136 civilians, including 13 children, were killed in the first five days of Russia’s attack on Ukraine, the UN said.\n\nBecause the figures reflect only casualties that UN staff verified, the true toll is almost certainly higher.\nhttps://t.co/MmxUSkorHT",
  "data/tweet-nytimes/2022/3/1498659374323179524.json": "France is working to identify and seize homes, luxury cars, yachts and other assets held by Russian oligarchs targeted by EU sanctions, officials said.\n\n“The oligarchs need to watch out,” Foreign Minister Jean-Yves Le Drian said.\nhttps://t.co/WMx3ksaAEx",
  "data/tweet-nytimes/2022/3/1498666898392858624.json": "About 100 diplomats walked out of a speech by Russia’s foreign minister at the UN Human Rights Council in protest over his country’s invasion of Ukraine.\n\nUkraine’s ambassador to the UN in Geneva led the walkout, which left a largely empty conference hall.\nhttps://t.co/5sQVOybIpp",
  "data/tweet-nytimes/2022/3/1498644227667992581.json": "Queen Elizabeth II is feeling well enough to return to work, Buckingham Palace said, ending more than a week of heightened concern about the 95-year-old monarch’s health after she tested positive for the coronavirus. https://t.co/rnN0UhHvIg",
  "data/tweet-nytimes/2022/3/1498455508264656896.json": "Crowds filled the tunnels of the railway station in Lviv, Ukraine, on Monday, as families continued to board trains to neighboring nations like Hungary and Poland in an effort to escape Russia’s invasion. Follow live updates: https://t.co/pLigrKsun0 https://t.co/pChtwWhBPc",
  "data/tweet-nytimes/2022/3/1498671943356198913.json": "Europe will soon face its “largest refugee crisis this century,” the UN refugee agency warned. About 660,000 refugees have fled Russia’s invasion of Ukraine in the last six days, with more than 150,000 leaving in the last 24 hours.\nhttps://t.co/ciZwW87dK4",
  "data/tweet-nytimes/2022/3/1498687098832015366.json": "Putin is using news outlets and social media to control what Russians learn about Ukraine. @EllenBarryNYT, @sheeraf, @KadriLiik and Denis Volkov of @levada_ru discuss public opinion about the war today at 12 p.m. ET. DM questions to @nytimesevents. https://t.co/wLIjwUmvsV",
  "data/tweet-nytimes/2022/3/1498694596460781577.json": "New: U.S. Secretary of State Antony Blinken pointedly questioned whether Russia should remain on the UN human rights council on Tuesday and criticized portrayals of Moscow’s invasion of Ukraine as a conflict in which both sides bear responsibility. https://t.co/yrLIvAH16z",
  "data/tweet-nytimes/2022/3/1498693932259151873.json": "Valery Gergiev, the star Russian maestro and prominent supporter of President Vladimir Putin of Russia, was removed Tuesday from his post as chief conductor of the Munich Philharmonic after he refused to denounce Putin’s invasion of Ukraine. https://t.co/1wE0leNqGr https://t.co/KsnXMDQd7Y",
  "data/tweet-nytimes/2022/3/1498675709098799110.json": "Russia intensified its attacks in Ukraine and appeared to target civilian areas with increasingly powerful weapons. Thousands of people fled Kyiv as a 40-mile Russian convoy approached the city.\n\nHere’s a rundown of the latest developments in the war.\nhttps://t.co/McAVhIWk1q",
  "data/tweet-nytimes/2022/3/1498700879507173381.json": "The French actor Gérard Depardieu has been one of the closest Western celebrities to President Vladimir Putin. Now, Depardieu has taken a surprising step against their friendship by denouncing the war in Ukraine. “Stop the weapons and negotiate,” he said. https://t.co/xfeKKlfPX9",
  "data/tweet-nytimes/2022/3/1498637940980948994.json": "Seven people were killed and 24 wounded in the shelling of an administrative building in Kharkiv, Ukraine’s state emergency service reported.\n\nEleven people were hospitalized, including a child, the authorities said.\nhttps://t.co/L4uXOcodHw",
  "data/tweet-nytimes/2022/3/1498705604998795270.json": "Putin is using news outlets and social media to control what Russians learn about Ukraine. @EllenBarryNYT, @sheeraf, @KadriLiik and Denis Volkov of @levada_ru discuss public opinion about the war. Join us now. DM questions to @nytimesevents. https://t.co/3fGr5lRXDM",
  "data/tweet-nytimes/2022/3/1498719292833124354.json": "President Volodymyr Zelensky of Ukraine accused Russia of war crimes on Tuesday for deliberately targeting civilians and attacking Kharkiv's main square: \"It is state terrorism by the Russian Federation. After this, Russia is a terrorist state.\" https://t.co/s93h0F4aWI https://t.co/kYccvr4LlN",
  "data/tweet-nytimes/2022/3/1498715923016003585.json": "Plagued by poor morale as well as fuel and food shortages, some Russian troops in Ukraine have surrendered en masse or sabotaged their own vehicles to avoid fighting, a senior Pentagon official said on Tuesday. https://t.co/i1K9cuq7sH",
  "data/tweet-nytimes/2022/3/1498709681816092681.json": "A projectile hit the main radio and TV tower in Kyiv on Tuesday after Russia said it would strike \"objects\" in the city to prevent \"information attacks.\" President Volodymyr Zelensky of Ukraine said at least five people were killed in the area. https://t.co/bywbXp2ZWL https://t.co/ziFN1PQZd2",
  "data/tweet-nytimes/2022/3/1498714711545810944.json": "A refugee camp of 30 tents has been built in Moldova to help Ukrainian refugees. People have lined up for hours, and some burst into tears after crossing the border. \"We don’t know where we’re going,\" one said. \"And we don’t know when we’re coming back.\" https://t.co/CYGG6Arq8Z https://t.co/jrhmiqMnT6",
  "data/tweet-nytimes/2022/3/1498701203466825732.json": "The International Energy Agency has agreed to release 60 million barrels of reserve oil to offset any shortage caused by Russia's invasion of Ukraine. https://t.co/cJ4l4GPu63",
  "data/tweet-nytimes/2022/3/1498754976222527489.json": "Africans trying to flee Ukraine said they were pushed to the end of long lines by Ukrainian authorities, and some said they were beaten. Ukraine's deputy interior minister has denied the reports, saying their policy is to release women and children first. https://t.co/s6IXwtns6G https://t.co/9MBo0qrv1T",
  "data/tweet-nytimes/2022/3/1498772838655967235.json": "One woman, who grew up in Russia but now lives in Kyiv with a Ukrainian husband, said her cousin didn't believe her when she called to say Ukraine was being invaded. Russia was only conducting an operation against Nazis there, she said her cousin told her. https://t.co/X8dDDxE6qA https://t.co/D5o22YjOCj",
  "data/tweet-nytimes/2022/3/1498725675796254721.json": "Breaking News: Texas officials are investigating parents of trans children for child abuse after Gov. Greg Abbott directed them to handle gender-affirming medical treatments as possible crimes, a lawsuit said. https://t.co/mmlDH3q81e",
  "data/tweet-nytimes/2022/3/1498797799298805761.json": "A large explosion struck Freedom Square in Kharkiv, Ukraine’s second-largest city, on Tuesday, directly in front of the city’s administrative building. At least seven people were killed, officials said. https://t.co/6gQ6t429JZ https://t.co/Opda9ZESgO",
  "data/tweet-nytimes/2022/3/1498792723209494532.json": "This is the Okhmadet Children’s Hospital in Kyiv, the Ukrainian capital, where parents and doctors tended to sick children on Monday, even as Russian forces closed in on the city.\n\nFollow live updates from our journalists on the ground: https://t.co/uFqd7EbpOV https://t.co/7LgnAjLIMD",
  "data/tweet-nytimes/2022/3/1498730800824700928.json": "A huge ship that had caught fire and was transporting about 4,000 luxury cars — including 1,000 Porsches and 200 Bentleys — sank on Tuesday, the company that managed the vessel said. Environmental groups had been deeply concerned that the ship would sink. https://t.co/eL0pc4Oagi",
  "data/tweet-nytimes/2022/3/1498765046406692872.json": "The International Skating Union barred Russian athletes from performing at the world championships in three weeks. The ban would keep Anna Shcherbakova, the reigning Olympic champion, from defending her 2021 world title. https://t.co/XaBBvHE6yn"
}