{
  "data/tweet-nytimes/2022/4/1509687016732123140.json": "President Biden announced on Thursday that the U.S. would release up to 180 million barrels of oil from a strategic reserve to counteract the economic impact of Russia’s invasion of Ukraine.\nhttps://t.co/86ha1QTWVn https://t.co/ZDxwm36APQ",
  "data/tweet-nytimes/2022/4/1509712169058897924.json": "A bill to limit the cost of insulin to $35 a month for most Americans who depend on it passed the House on Thursday. To become law, the bill will need to attract at least 10 Republican votes in the Senate to overcome a filibuster. https://t.co/E0FkuiRN6P",
  "data/tweet-nytimes/2022/4/1509694552986300421.json": "A law keeps personal census data secret for 72 years. The 1950 census goes public on Friday, a bonanza for historians and the merely curious. https://t.co/rLCkybleho",
  "data/tweet-nytimes/2022/4/1509727310710284296.json": "Russia is running its military campaign against Ukraine out of Moscow, with no central war commander on the ground to call the shots, according to American officials who have studied the five-week-old war. https://t.co/SPNJJZsCh2",
  "data/tweet-nytimes/2022/4/1509799241937723398.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/4prgyfysgf",
  "data/tweet-nytimes/2022/4/1509855670782283779.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/ZMPpOhC3OL https://t.co/XjNMQCiXmi",
  "data/tweet-nytimes/2022/4/1509852093439426565.json": "The U.S. Navy will name a new ship after the late Supreme Court Justice Ruth Bader Ginsburg.\n\nThe ship will join a class of vessels named after those who have fought for civil and human rights, including Harvey Milk, Robert F. Kennedy and Sojourner Truth.\nhttps://t.co/T1RDtIUw7w",
  "data/tweet-nytimes/2022/4/1509853035635388425.json": "Breaking News: Pope Francis apologized for the Roman Catholic Church’s role in a system of Canadian schools that abused Indigenous children for 100 years. He also promised to visit Canada as part of a process of healing and reconciliation. https://t.co/OjDnsLycH6",
  "data/tweet-nytimes/2022/4/1509870464491048960.json": "President Vladimir Putin of Russia is “a man in a cage he built himself” because of his decision to invade Ukraine, and he has damaged both his own nation and its army, Britain’s defense minister said.\nhttps://t.co/TgAbXgnw2U",
  "data/tweet-nytimes/2022/4/1509848328682590208.json": "The UN’s nuclear watchdog is looking into reports that some Russian soldiers who left the shuttered Chernobyl nuclear plant have radiation poisoning. They pulled out on Thursday, five weeks after seizing it, Ukraine’s state-run energy company said.\nhttps://t.co/OZOqLSSogV",
  "data/tweet-nytimes/2022/4/1509872452674936837.json": "Breaking News: The U.S. hiring spree continued in March, with employers adding 431,000 jobs, another sign of the economy’s resilience amid uncertainty. The unemployment rate was 3.6%, down from 3.8% a month earlier.\nhttps://t.co/01QmNXaJsz",
  "data/tweet-nytimes/2022/4/1509923567097556994.json": "Two low-flying Ukrainian helicopters crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, a regional governor said — the first time Russia has reported a Ukrainian airstrike on its territory since the war began. https://t.co/LA8CKJBFA1 https://t.co/5qEArPIFkh",
  "data/tweet-nytimes/2022/4/1509933257604964357.json": "Breaking News: Amazon workers voted to unionize at a massive New York warehouse, in a stunning win for a campaign targeting the second-largest employer in the U.S. and one of the biggest victories for organized labor in a generation. https://t.co/Jy5WDa21j4",
  "data/tweet-nytimes/2022/4/1509928598010044424.json": "Jen Psaki, the White House press secretary, is in advanced talks to join MSNBC after she leaves the Biden administration, according to two people familiar with the negotiations. She could leave the White House as soon as next month, one of the people said. https://t.co/GqmGB1iWmM",
  "data/tweet-nytimes/2022/4/1510007873153216513.json": "Two low-flying Ukrainian helicopters crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, a regional governor said — the first time Russia has reported a Ukrainian airstrike on its territory since the war began. https://t.co/LRzAFogyxd https://t.co/eoMatzd91w",
  "data/tweet-nytimes/2022/4/1510024233048489985.json": "Standing outside the Brooklyn office where Amazon unionization ballots were tallied, Christian Smalls, a former employee who started organizing workers before he was fired, popped a bottle of champagne: “To the first Amazon union in American history.\" https://t.co/flfFQyzM69 https://t.co/nc8oA211Ct",
  "data/tweet-nytimes/2022/4/1509956290805653506.json": "At 26, Sammy Basso is believed to be the oldest person with Progeria, an exceedingly rare and fatal disease that afflicts only about one in 18 million people. And now he’s researching it, hoping to find a treatment and the secrets of aging.\nhttps://t.co/1eRGoNgg7x https://t.co/2gsbjtXcVk",
  "data/tweet-nytimes/2022/4/1509946218998382602.json": "\"Putin is not the force he used to be\": Britain’s defense minister said that Russia’s army was \"exhausted\" and that its reputation \"has been trashed\" because of President Vladimir Putin's decision to invade Ukraine. https://t.co/tGsXhkj8al https://t.co/r6orvRlsQB",
  "data/tweet-nytimes/2022/4/1509999097427730435.json": "Amazon workers voted to unionize in a New York warehouse, in one of the biggest wins for organized labor in a generation.\n\nIn 2020, we interviewed Christian Smalls, who was fired by Amazon after protesting safety conditions and now is the union’s leader. https://t.co/vCod2WY6lU",
  "data/tweet-nytimes/2022/4/1510035581212016656.json": "Breaking News: Will Smith, who slapped the comedian Chris Rock at the Oscars, said he was resigning from the Academy of Motion Picture Arts and Sciences. https://t.co/wovv3Oo3FZ https://t.co/DID2mo6VAo",
  "data/tweet-nytimes/2022/4/1510067009551278085.json": "Breaking News: The Biden administration will work with allies to transfer Soviet-made tanks to bolster Ukrainian defenses, the first time the U.S. has done so. https://t.co/TxAH9vuIsk"
}