{
  "data/tweet-economist/2022/7/1542747369795686400.json": "Since the war began in Ukraine a new heroic figure has emerged: the woman with a gun. One of them is Olesia Vorotnyk https://t.co/ris78x4zNk",
  "data/tweet-economist/2022/7/1542787369056849921.json": "RT @suelinwong: How exactly did China turn Hong Kong into a police state? It wasn't just the national security law. It was decades in the m…",
  "data/tweet-economist/2022/7/1542848272154361858.json": "Ukraine, despite a smaller population, has a larger supply of eager recruits. Ukraine is also receiving ever more sophisticated Western weaponry as Russia cannibalises its own forces \nhttps://t.co/ceGVBSeeuh",
  "data/tweet-economist/2022/7/1542860919180509184.json": "Many Republicans knew all along what Donald Trump was. The main reason for Republicans’ capitulation is simpler. They hate their political opponents, who are his enemy, which made him their friend https://t.co/jfKQVO8b3T",
  "data/tweet-economist/2022/7/1542835329056514048.json": "Ferdinand “Bongbong” Marcos junior’s father was a murderous dictator who stole billions from the state and remained unrepentant to the end https://t.co/T3LW7P1yFn",
  "data/tweet-economist/2022/7/1542813534471524354.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/qUpafU4zg8 https://t.co/OzKOxp5xeC",
  "data/tweet-economist/2022/7/1542864873960476672.json": "Andrés Manuel López Obrador prefers to fight the drug war with “hugs not bullets”. This approach has failed: violence has intensified in Mexico and the pace of disappearances has increased https://t.co/AASae3BxSN",
  "data/tweet-economist/2022/7/1543017724330315778.json": "Provided Donald Trump can be stopped, which seems likelier than not, it is in theory easy to think that the right will return to sanity https://t.co/2GeAoKUtLS",
  "data/tweet-economist/2022/7/1543070968284946432.json": "In both neuroscience and artificial intelligence the next decade promises to be wild https://t.co/4B41cIZatK",
  "data/tweet-economist/2022/7/1543101386119856128.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/TAxmj6FEoh",
  "data/tweet-economist/2022/7/1542986919893766150.json": "Writing seems so fundamental that it is hard to believe just how recent—and miraculous—it really is https://t.co/ZdUtyG3w2C",
  "data/tweet-economist/2022/7/1543166163542282241.json": "Vladimir Putin hopes that the West will impose his terms on Ukraine. In exchange, he will spare the rest of the world from ruin, hunger and the threat of nuclear Armageddon. The thing is, to accept that deal would be a grave miscalculation \nhttps://t.co/Ei93nrhyk4",
  "data/tweet-economist/2022/7/1543211043547238401.json": "Some 80% of disappearances have occurred since 2006, when the government of Felipe Calderón launched a “war on drugs” https://t.co/A8bKxtmS1d",
  "data/tweet-economist/2022/7/1543259220547719170.json": "Ukraine’s national ballet no longer puts on work by Russians. “There is no more ‘Swan Lake’,” says Olesia Vorotnyk. Tchaikovsky is out https://t.co/GUVuk5gVG5",
  "data/tweet-economist/2022/7/1543284636226392070.json": "War is tipping a fragile world towards mass hunger. Fixing that is everyone’s business https://t.co/inRibOhDoL",
  "data/tweet-economist/2022/7/1543091635231363072.json": "A new book emphasises the imaginative leaps that were required to invent writing https://t.co/gr15QCZqOG",
  "data/tweet-economist/2022/7/1543332192260132864.json": "The war in Ukraine turned Poland into a star player. A wiser government would use its newfound centrality to increase its influence in Europe \nhttps://t.co/OG3yPKC47P",
  "data/tweet-economist/2022/7/1543175003159646208.json": "An alliance including Israel and stretching from Morocco all the way to the United Arab Emirates seems to be in the making https://t.co/0CyIx8s4ZO",
  "data/tweet-economist/2022/7/1543420195880030208.json": "Between 2006 and 2012 an average of eight people each day went missing in https://t.co/vQfqdF4BRR the daily toll of disappearances is 25 https://t.co/LrLrT0RurU",
  "data/tweet-economist/2022/7/1543455829696847872.json": "A Finnish study suggests all children may benefit from having male teachers https://t.co/XZKaiJAbLY",
  "data/tweet-economist/2022/7/1543319102156070913.json": "It was either the ancient Sumerians or the Egyptians who first resolved to make symbols stand for sounds https://t.co/7dpNeoXunl",
  "data/tweet-economist/2022/7/1543350307073171457.json": "Even without Donald Trump, culture warring will dominate conservatism until Republicans can no longer win power by it https://t.co/JRmepZOVEJ",
  "data/tweet-economist/2022/7/1543148755813269505.json": "Without a competent army, Congo will remain at the mercy of its predatory neighbours https://t.co/oHrQ47QAeT",
  "data/tweet-economist/2022/7/1543561423468601346.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/PBPdq3xpzg",
  "data/tweet-economist/2022/7/1543681751997874180.json": "When war began, Olesia Vorotnyk quit Ukraine’s national ballet and took up a position at a checkpoint, armed with an AK-47 https://t.co/94ThUbnIEq",
  "data/tweet-economist/2022/7/1543665909381963777.json": "If Ukraine can be kept supplied with arms and ammunition and uses its new firepower judiciously, it could recapture pockets of territory, sow chaos in Russia’s rear and inflict unsustainable losses  \nhttps://t.co/GRzUNM9DK0",
  "data/tweet-economist/2022/7/1543392660634861568.json": "Each neuron is a powerful an information processor. That has implications not only for learning how brains work—and how they go wrong—but also for designing artificial versions that more closely resemble the natural sort https://t.co/8s8RXIfdKY",
  "data/tweet-economist/2022/7/1543703227971125248.json": "Writing seems so fundamental that it is hard to believe just how recent—and miraculous—it really is https://t.co/YcAlZxmLrj",
  "data/tweet-economist/2022/7/1543721521931341830.json": "After Finland abolished a quota ensuring gender balance among primary-school teachers, pupils suffered https://t.co/9zQIH7VUjB",
  "data/tweet-economist/2022/7/1543808803287830530.json": "A Ukrainian ballerina goes to war https://t.co/ejZVTfodzk",
  "data/tweet-economist/2022/7/1543636968411652100.json": "Israel’s defence minister confirmed he had been working with America on a programme for strengthening defence co-operation between Israel and Arab countries https://t.co/TcrzN9hXk7",
  "data/tweet-economist/2022/7/1543818633557712896.json": "To understand why the Communist Party crushed Hong Kong when it did, rather than either doing so earlier or not doing so at all, the Chinese side of the story is vital—as it is to understanding why the clampdown has been so effective https://t.co/pkFYijc5gc",
  "data/tweet-economist/2022/7/1543980479384326146.json": "The overturning of Roe v Wade in America bucks a global trend towards more permissiveness of abortion that is highlighted in this map. \n\nBanning abortion tends not to reduce by much the number of abortions. But it can make every pregnancy less safe. Learn why ⬇️",
  "data/tweet-economist/2022/7/1544050163177734144.json": "The civic and environmental activist was killed near Izyum, aged 24 https://t.co/I8AVZtK3kS",
  "data/tweet-economist/2022/7/1544122745117712386.json": "War is tipping a fragile world towards mass hunger. Fixing that is everyone’s business https://t.co/IUMSuIFHDP",
  "data/tweet-economist/2022/7/1544147035766640642.json": "What to read to understand the history of Western capitalism https://t.co/jDqPxS2zY3",
  "data/tweet-economist/2022/7/1544080553166753792.json": "Society calls such tragedies natural disasters, but they often look man-­made https://t.co/9R5r3OKNY3",
  "data/tweet-economist/2022/7/1543833090388279297.json": "Ukraine’s national ballet no longer puts on work by Russians. “There is no more ‘Swan Lake’,” says Olesia Vorotnyk. Tchaikovsky is out https://t.co/ct6dTCzMag",
  "data/tweet-economist/2022/7/1544385349383774208.json": "Britain’s chancellor and health secretary have resigned, throwing Boris Johnson’s government into disarray. Catch up on the latest updates ⬇️",
  "data/tweet-economist/2022/7/1544199563061432321.json": "Suffering from a bad back, he spends seven-hour shifts seated at a sewing machine on a stool below knee height. To see a lawyer, he must skip a meal https://t.co/6rJFs353GT",
  "data/tweet-economist/2022/7/1544341133991739392.json": "Ferdinand “Bongbong” Marcos junior’s father was a murderous dictator who stole billions from the state and remained unrepentant to the end https://t.co/1ZTvBdjyn2",
  "data/tweet-economist/2022/7/1544486484547444736.json": "Olesia Vorotnyk danced with the national ballet. Then Russia invaded https://t.co/Y2gf4tW9P5",
  "data/tweet-economist/2022/7/1544477158327963648.json": "Motor-vehicle crashes were the leading cause of death for young people in America for more than 60 years. But since 2017, guns have killed more Americans between the ages of one and 24  \nhttps://t.co/dLyhTXAgFL",
  "data/tweet-economist/2022/7/1544529195438678016.json": "A Finnish study suggests all children may benefit from having male teachers https://t.co/mBuDH3znAb",
  "data/tweet-economist/2022/7/1544442045808496648.json": "Costly food and energy are fostering global unrest https://t.co/9mPcpkxuDB",
  "data/tweet-economist/2022/7/1544671027900211200.json": "The opposition politician does not complain easily. But he has been moved to a maximum-security prison notorious for its brutality—and is locked behind a six-metre-tall fence with murderers https://t.co/CFPyh9URwC",
  "data/tweet-economist/2022/7/1544666298621333512.json": "Olesia Vorotnyk danced with the national ballet. Then Russia invaded https://t.co/67spJBujFR",
  "data/tweet-economist/2022/7/1544725800720781319.json": "The fact that he is a serial liar and lacks the self-discipline to apply himself to hard problems is well-known. But the extent to which he poisons the reputations of those he comes into contact with is striking https://t.co/KPdYoH6kuS",
  "data/tweet-economist/2022/7/1544825415457509377.json": "It is a woke and fiscally irresponsible mess https://t.co/TlzZriYrqs",
  "data/tweet-economist/2022/7/1544742489524944896.json": "The British prime minister’s toxicity is not just a personal characteristic. It also says something important about the political system he sits atop https://t.co/pn5hAZhl7j",
  "data/tweet-economist/2022/7/1544907116154163201.json": "Ukraine’s national ballet no longer puts on work by Russians. “There is no more ‘Swan Lake’,” says Olesia Vorotnyk. Tchaikovsky is out https://t.co/h0r6UHjKWB",
  "data/tweet-economist/2022/7/1544960560978173956.json": "Boris Johnson is resigning. He leaves Britain in a dangerous state: the time when everything was possible is over https://t.co/brOwVBKw3s https://t.co/tPd98Inbhu",
  "data/tweet-economist/2022/7/1544972395752177665.json": "Boris Johnson is resigning as the leader of Britain’s Conservative Party. \n\nHe reportedly wants to stay on in a caretaker capacity until the autumn while a new leader is chosen.\n\nFollow the latest updates here 👇",
  "data/tweet-economist/2022/7/1544980327445270528.json": "Boris Johnson’s government has collapsed at last. For months Britain’s prime minister wriggled out of one scandal after another. He has asked to stay until the autumn, but he should go immediately https://t.co/RklTIylpZV",
  "data/tweet-economist/2022/7/1544997424829194241.json": "In his departure, as in government, Boris Johnson demonstrated a wanton disregard for the interests of his Conservative Party—and the country https://t.co/Kfu2GRlz59",
  "data/tweet-economist/2022/7/1545025955588194305.json": "For months Boris Johnson wriggled out of one scandal after another. He says he will stay on as prime minister until a new Conservative Party leader is chosen. He should go immediately https://t.co/M9dUPmFuA1",
  "data/tweet-economist/2022/7/1544989883877425155.json": "Voters should reject Chile’s new draft constitution https://t.co/L10ip2jecL",
  "data/tweet-economist/2022/7/1545052049686945794.json": "Boris Johnson did what he always does: he looked out for Boris Johnson. Now Britain faces the consequences https://t.co/s3tff9ORy0",
  "data/tweet-economist/2022/7/1545075438749360131.json": "The hype about TikTok is justiﬁed—and so are the concerns. There’s a reason why the world’s most exciting app is also its most mistrusted https://t.co/ZquBScEVEx https://t.co/h09eupWgRz",
  "data/tweet-economist/2022/7/1545044050021011457.json": "The British prime minister’s toxicity is not just a personal characteristic. It also says something important about the political system he sat atop https://t.co/kLPv48C8UC",
  "data/tweet-economist/2022/7/1544892085253427202.json": "Alaa Abd el-Fattah, a computer programmer, rocketed to fame as the voice of a new set of tech-savvy revolutionaries in Egypt. He has spent much of the past decade in prison https://t.co/7PGxAQ0kFe",
  "data/tweet-economist/2022/7/1545220087128408065.json": "A few ideas are laudable. But overall the draft is a confusing mess, full of woolly language that more or less guarantees decades of squabbling about what it actually means https://t.co/6DVtvkOPn6",
  "data/tweet-economist/2022/7/1545275984915492865.json": "Abe Shinzo, Japan’s longest-serving prime minister, is in a critical condition after being shot while making a campaign speech. In this article from 2020, we considered his political legacy https://t.co/qsFXoSbN0n",
  "data/tweet-economist/2022/7/1545281889807876096.json": "Abe Shinzo is in a critical condition in hospital after an assassination attempt. In May he gave an interview to The Economist, discussing Japan’s foreign and security policy—and his legacy https://t.co/tSd8y9JlHt",
  "data/tweet-economist/2022/7/1545259099432042496.json": "For months Boris Johnson wriggled out of one scandal after another. He says he will stay on as prime minister until a new Conservative Party leader is chosen. He should go immediately https://t.co/VopNea26A0",
  "data/tweet-economist/2022/7/1545239379928649728.json": "Chile’s new draft constitution would shift the country far to the left https://t.co/x1a5PQuATo",
  "data/tweet-economist/2022/7/1545128229882810368.json": "It is absurdly long, with 388 articles. It is also fiscally irresponsible and sometimes dotty https://t.co/WcnqFMPL59",
  "data/tweet-economist/2022/7/1545281040196960256.json": "Why do so many countries remain poor when some are fabulously rich? And what is work like today compared with the past? For the answers, you need to turn to economic history https://t.co/bkghfaecNH",
  "data/tweet-economist/2022/7/1545296680244871170.json": "The assassination attempt has sent shockwaves through a country where both gun crime and political violence are extremely rare https://t.co/kTmQ4g1UHL",
  "data/tweet-economist/2022/7/1545090505234595844.json": "About 70% of ten-year-olds in middle- and low-income countries cannot read and understand a simple story, the World Bank suggests. This should be seen for what it is: a global emergency https://t.co/WirCIPu5F1",
  "data/tweet-economist/2022/7/1545332768590254081.json": "Breaking news: Abe Shinzo, Japan’s longest-serving post-war prime minister, has died https://t.co/BeBBTLmRWZ",
  "data/tweet-economist/2022/7/1545328845389185028.json": "In an instant, the shooting shattered Japan’s sense of internal security. Yet the assassination attempt is not entirely without precedent https://t.co/bldtNA6EKQ",
  "data/tweet-economist/2022/7/1545339283036405762.json": "Japan’s longest-serving post-war prime minister has been assassinated. In May he spoke to The Economist, discussing the country’s foreign and security policy—and his legacy https://t.co/ENhzxfMpwA",
  "data/tweet-economist/2022/7/1545346011752763392.json": "♦️ Abe Shinzo, who was Japan’s longest-serving prime minister, has been assassinated.\n\n♦️ The race to be the next leader of Britain’s Conservative Party begins.\n\n♦️ Why Russian inflation is different.\n\nCatch up quickly on the global stories that matter 👇",
  "data/tweet-economist/2022/7/1544931985222942722.json": "Could the findings from the Large Hadron Collider’s next run help physicists achieve their ultimate goal: unifying the Standard Model and general relativity into an overarching “theory of everything”? We explain https://t.co/8EjK9K87yR",
  "data/tweet-economist/2022/7/1545353527458938881.json": "Abe Shinzo, Japan’s longest-serving post-war prime minister, has been assassinated. In this article from 2020, we considered his political legacy https://t.co/g0LZ7uQ0pB",
  "data/tweet-economist/2022/7/1545350662367711232.json": "RT @NoahSneider: 1/ The shooting of Abe Shinzo, Japan's former prime minister, has shocked Japan. It is likely to reshape the country in wa…",
  "data/tweet-economist/2022/7/1545375665846984705.json": "Abe Shinzo, Japan’s former prime minister, has been assassinated. On “The Intelligence”, @NoahSneider analyses the implications for the country and its politics https://t.co/xTNwk0uqMv",
  "data/tweet-economist/2022/7/1545376783142354945.json": "RT @t_wainwright: One of our covers this week is on the light-entertainment phenomenon that became an unlikely political force, even as it…",
  "data/tweet-economist/2022/7/1545419195805999106.json": "In an instant, the shooting shattered Japan’s sense of internal security https://t.co/f4G9uFsh6j",
  "data/tweet-economist/2022/7/1545393797605064704.json": "Chinese espionage against intellectual property is a “co-ordinated campaign on a grand scale”, MI5’s director-general says. The “strategic contest” will last decades https://t.co/E2fsNwPIw0",
  "data/tweet-economist/2022/7/1545454256001630210.json": "Abe Shinzo dreamed of being a filmmaker. He ended up his country’s most consequential prime minister in decades https://t.co/8sbjyLZQ5Z",
  "data/tweet-economist/2022/7/1545462985879060481.json": "Abe Shinzo served longer than any other post-war leader. When an assassin shot him at a campaign event, he became the first Japanese head of government to be killed in the post-war era https://t.co/jgsSnG1xnl",
  "data/tweet-economist/2022/7/1545483160904949761.json": "President Joe Biden has signed an executive order to safeguard the right to abortion in America, expanding access to medication abortion, contraception and emergency medical care. We explain the benefits of abortion-by-mail https://t.co/a46vrZXlLv",
  "data/tweet-economist/2022/7/1545542260946862081.json": "Ukraine’s comedian-turned-president was “visibly nervous” in his early bouts of diplomacy. Now he has an experience of statecraft that no modern Western leader can match, nor would wish to https://t.co/3YFl4YMVlr",
  "data/tweet-economist/2022/7/1545565611639578625.json": "Abe Shinzo dreamed of being a filmmaker. But his path into politics was all but predetermined https://t.co/ATx5hJGl7O",
  "data/tweet-economist/2022/7/1545639423890579456.json": "New data suggest that the damage from shutting down schools has been worse than almost anyone expected https://t.co/NFwisYrDsg",
  "data/tweet-economist/2022/7/1545416350151184386.json": "RT @majohns: Our story this week reproduces startling estimates (by McKinsey) of learning loss caused by covid school disruptions. Huge lag…",
  "data/tweet-economist/2022/7/1545481350064623621.json": "“Zelensky”, by Serhii Rudenko, is the first book in English about Ukraine’s comedian-turned-president-turned-war leader. It measures the gulf between before and now https://t.co/e74VDQk7EC",
  "data/tweet-economist/2022/7/1545561379922395137.json": "“America is basically going through the steepest episode of monetary tightening since 1981,” argues @S_Rabinovitch on our “Checks and Balance” podcast. “The precedent strongly suggests that...very likely will tip it into a recession” https://t.co/GedKDaaZZE",
  "data/tweet-economist/2022/7/1545719179193552896.json": "To critics, he represented a dangerous strain of nationalist revisionism. To supporters, he was the realist visionary Japan needed in a more turbulent modern world https://t.co/XBSYKnDU5K",
  "data/tweet-economist/2022/7/1545735276433137664.json": "Researchers at Imperial College London used an epidemiological model to calculate the pandemic deaths prevented by jabs https://t.co/tJl6KfgBVk",
  "data/tweet-economist/2022/7/1545743602206261249.json": "Whereas China’s “new Silk Road” has focused on hard infrastructure, the G7’s plan will prioritise climate and energy security, digital connectivity, health and equality https://t.co/MYitrfpLtE",
  "data/tweet-economist/2022/7/1545723206195204098.json": "War is the coldest, hardest of realities. It calls for virtues that are the opposite of acting. Volodymyr Zelensky’s is “unembellished courage”, writes Serhii Rudenko in a new book https://t.co/fUtmJrkRQ8",
  "data/tweet-economist/2022/7/1545816817679089664.json": "A few years ago Europe was deeply split over China. But at a recent NATO summit all 30 allies agreed that China was now in “strategic partnership” with Russia, and that the duo were “at the forefront of an authoritarian pushback” https://t.co/4hI7DTrERe",
  "data/tweet-economist/2022/7/1545528325682200579.json": "Elon Musk has ended his takeover bid of Twitter, according to a letter to the social-media firm from his lawyers. Earlier this year we assessed how the deal brought the whiff of the meme stock to the platform https://t.co/2eJHHCwQ4b",
  "data/tweet-economist/2022/7/1545812030694821891.json": "Britain’s last chief in Hong Kong describes China’s recent clampdown in the territory as “the destruction of one of the freest societies in Asia by communist tyranny” https://t.co/XofmYBM1UE",
  "data/tweet-economist/2022/7/1545900622876229632.json": "Abe Shinzo left an imprint on geopolitics. Diplomats across the world now speak of Asia in terms of the “Free and Open Indo-Pacific”, a coinage of his https://t.co/nARX8poipH",
  "data/tweet-economist/2022/7/1545901369143484418.json": "As bad as the past 18 months have been, they would have been worse without vaccines—perhaps about 2.7 times worse https://t.co/otoZ0XEkvR",
  "data/tweet-economist/2022/7/1545781113364291584.json": "Chile’s old constitution was hardly perfect. But compared with its proposed replacement, it is a paragon of clarity https://t.co/ujSF3YtJwY",
  "data/tweet-economist/2022/7/1545962579566231554.json": "The study found that vaccines helped both rich and poor countries. Nearly as many deaths were prevented in countries covered by the COVAX distribution scheme as in wealthy nations https://t.co/BD3xLi2nHc",
  "data/tweet-economist/2022/7/1545971271967596545.json": "Rather than scrapping the old constitution, Chileans should scrap the new one. We explain why https://t.co/YmbMZR16V9",
  "data/tweet-economist/2022/7/1545831428998545409.json": "Thousands of Ukrainians have been abducted from Russian-occupied areas, including activists, journalists and humanitarian workers https://t.co/tjfFDp8evC",
  "data/tweet-economist/2022/7/1545726727233720320.json": "Germany and Poland have never been great friends. Vladimir Putin’s invasion of Ukraine could have been a turning-point https://t.co/FrlFX5T4Ci",
  "data/tweet-economist/2022/7/1546088096856510464.json": "Thousands of Ukrainians have been abducted from Russian-occupied areas. Some victims have been tortured; others have turned up dead https://t.co/TvKeatFAc5",
  "data/tweet-economist/2022/7/1546038085049253889.json": "Gotabaya Rajapaksa said nothing throughout the day. Yet the longer he stayed silent, the darker the mood became. At around 10pm local time, the president at last recognised that it was over https://t.co/izZWiuWltl",
  "data/tweet-economist/2022/7/1545881742682333184.json": "In a country with deep ethnic divisions, and a 26-year-long civil war to show for them, the government’s catastrophic ineptitude served to bring Sri Lankans of all stripes together https://t.co/FcD5nXkpYZ",
  "data/tweet-economist/2022/7/1546122131045601282.json": "Boris Johnson had not merely one tragic flaw, but many. Dishonesty, arrogance, sexual incontinence, incompetence, an infantile irresponsibility https://t.co/SXg15KF8wX",
  "data/tweet-economist/2022/7/1546100678359060480.json": "When Volodymyr Zelensky first took office, he and his novice crew faced Ukraine’s challenges with more memes in their armoury than policies. Then, this February, came a war of national survival https://t.co/TTl7IBA1aq",
  "data/tweet-economist/2022/7/1546126872756592643.json": "Today we are dealing with the highest inflation since the 1970s. These three books and two papers will help you understand why we are where we are https://t.co/DpZZaR5M2a",
  "data/tweet-economist/2022/7/1545948676031483907.json": "Research suggests that globally schoolchildren may be eight months behind where they would normally be https://t.co/80jG3thc8X",
  "data/tweet-economist/2022/7/1546014963738853383.json": "Boris Johnson leaves Britain in a dangerous state. The time when everything was possible is over. Once he departs, politics must once more become anchored to reality https://t.co/2mxB5OLkQp",
  "data/tweet-economist/2022/7/1546172140013117445.json": "Germany and Poland have never been great friends. Vladimir Putin’s invasion of Ukraine could have been a turning-point https://t.co/DrSj64Gv7A",
  "data/tweet-economist/2022/7/1545924743106334720.json": "Opposition parties across the country will be worried by the BJP’s ability to split Shiv Sena, a usually disciplined group https://t.co/yrCL1WnHi0",
  "data/tweet-economist/2022/7/1546234540804415494.json": "A new study finds that jabs cut the disease’s death toll by 63% during their first year https://t.co/JMxHm9UhCI",
  "data/tweet-economist/2022/7/1546296073894989826.json": "His assassination is a tragic coda to the life of one of the most consequential politicians of modern Japan https://t.co/tKG9ZUOBeb",
  "data/tweet-economist/2022/7/1546088095799468033.json": "TikTok is only the fifth app to pass 3.5bn downloads, and the only one not owned by Meta, according to Sensor Tower https://t.co/UPbhXTFTEj",
  "data/tweet-economist/2022/7/1546332288392339456.json": "Without vaccines, the Delta- and Omicron-variant waves would have been almost three times deadlier, research suggests https://t.co/I8pfjUeLZF",
  "data/tweet-economist/2022/7/1546192844809031681.json": "On both the economy and culture, Republicans claim to be the rightful party of the working class, whether white or Hispanic https://t.co/iysSEVpa4o",
  "data/tweet-economist/2022/7/1546357247877464065.json": "Thousands of Ukrainians are disappearing. This is not new: Russia has deployed such terror tactics for decades https://t.co/2ZTboV1Mxw",
  "data/tweet-economist/2022/7/1546291694127222785.json": "Abe Shinzo’s killing jolted a country unaccustomed to gun violence or, in recent years, to explosive politics. It also resurfaced unsettling memories of turbulent past eras https://t.co/p77ne8Fvco",
  "data/tweet-economist/2022/7/1546127121592057856.json": "In the wake of the assassination Kishida Fumio, Japan’s current prime minister, vowed to “protect our democracy” and “not succumb to violence” https://t.co/49t1vUgZdI",
  "data/tweet-economist/2022/7/1546376834161442819.json": "Ukraine’s comedian-turned-president was “visibly nervous” in his early bouts of diplomacy. Now he has an experience of statecraft that no modern Western leader can match, nor would wish to https://t.co/g7WLq3E7IR",
  "data/tweet-economist/2022/7/1546068804257693696.json": "Germany and Poland bear historical grudges. Fanning them, as the Polish government is doing, does not help build European alliances against Russia https://t.co/xj1NUjoln5",
  "data/tweet-economist/2022/7/1546507455223439361.json": "Boris Johnson had not merely one tragic flaw, but many. Dishonesty, arrogance, sexual incontinence, incompetence, an infantile irresponsibility https://t.co/HMDg27aYuz",
  "data/tweet-economist/2022/7/1546161092803661827.json": "War is a rupture—in a country’s life and a leader’s. Amid the calamity, Ukrainians have proven lucky in theirs https://t.co/UaoI0wPv60",
  "data/tweet-economist/2022/7/1546451415203209216.json": "For the citizens of Maharashtra, the immediate worry is that the BJP’s divisive politics, and the violence and disharmony that come with it, will disrupt life in the state https://t.co/fUSCXwI0l9",
  "data/tweet-economist/2022/7/1546366921590931456.json": "As details about the killer have trickled out, Abe Shinzo’s death has come to look more like a tragic but isolated murder than the opening shot of a political battle. Nonetheless, his death will reshape Japan’s political landscape https://t.co/IwSkUYSjym",
  "data/tweet-economist/2022/7/1546665766233292800.json": "As bad as the past 18 months have been, they would have been worse without vaccines—perhaps about 2.7 times worse https://t.co/UmyOeP28ny",
  "data/tweet-economist/2022/7/1546670644171083781.json": "New data suggest that the damage from shutting down schools has been worse than almost anyone expected https://t.co/Qf1WbcRcaa",
  "data/tweet-economist/2022/7/1546551517007724544.json": "The world’s most famous school has produced 20 British prime ministers – including Boris Johnson. From 1843 magazine’s archive \nhttps://t.co/hZFzKYA1yo",
  "data/tweet-economist/2022/7/1546787217967923200.json": "Motor-vehicle crashes were the leading cause of death for young people in America for more than 60 years. But since 2017, guns have killed more Americans between the ages of one and 24  \nhttps://t.co/YBAF6tbCJT",
  "data/tweet-economist/2022/7/1546752530952110080.json": "Astronomy will never be the same again https://t.co/6gdmwWO6J4",
  "data/tweet-economist/2022/7/1546816300701421568.json": "Appeasing Vladimir Putin would bring dangers for the world. If he gets to keep the land he has occupied, he and despots elsewhere will conclude that warmongering pays https://t.co/peDxMkj4Yd",
  "data/tweet-economist/2022/7/1547010699737669633.json": "Why do so many countries remain poor when some are fabulously rich? And what is work like today compared with the past? For the answers, you need to turn to economic history https://t.co/gV6O2xB8Ie",
  "data/tweet-economist/2022/7/1547079137998815237.json": "Journalists in free countries should help those in autocracies. Cross-border collaborations have exposed scandals such as Pegasus and the Panama Papers https://t.co/t763u9h0TT",
  "data/tweet-economist/2022/7/1547074350330875904.json": "Less than 0.1% of graphene is needed to make concrete 30% stronger. And stronger concrete means less of it is needed, consequently reducing CO2 https://t.co/n3mWJhkMLz",
  "data/tweet-economist/2022/7/1547020039995494402.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/kV3beNjD5E",
  "data/tweet-economist/2022/7/1547111461775867904.json": "The effectiveness of Russian propaganda might be underestimated https://t.co/5CNeQOtjsX",
  "data/tweet-economist/2022/7/1547005851961118720.json": "The study found that vaccines helped both rich and poor countries. Nearly as many deaths were prevented in countries covered by the COVAX distribution scheme as in wealthy nations https://t.co/HKhe855KA9",
  "data/tweet-economist/2022/7/1547221262312898564.json": "When covid-19 first began to spread around the world, pausing normal lessons was a forgivable precaution. \n\nNew data suggests the damage has been worse than expected",
  "data/tweet-economist/2022/7/1547239188277387264.json": "“Only candour and an unflinching commitment to growth will chart a course back to shared prosperity,” argues the Conservative leadership candidate @TomTugendhat in a guest essay for The Economist https://t.co/1hzhK2ACgS",
  "data/tweet-economist/2022/7/1547244759038791681.json": "Muhammad bin Salman is opening up one of the world’s most closed and intolerant countries. But discontent is bubbling below the surface https://t.co/4DXlo25c0f",
  "data/tweet-economist/2022/7/1547238059137187841.json": "Almost every prominent democrat in Hong Kong is now either in jail or exile https://t.co/dNAXLMNjeE",
  "data/tweet-economist/2022/7/1547307898816036864.json": "Russia’s army, which relies heavily on trains to move munitions and human muscle to load them onto trucks, has created big depots close to railheads. That was fine until the High Mobility Artillery Rocket System turned up https://t.co/mSQtuYNrv6",
  "data/tweet-economist/2022/7/1547285172080574466.json": "In America, polls show that 76% of Jews and a hefty 92% of atheists support abortion rights https://t.co/TyPvYrIWtD",
  "data/tweet-economist/2022/7/1547274935290286080.json": "He leaves the country in a political vacuum. Ranil Wickremesinghe, the prime minister who has taken charge in the president’s absence, is deeply unpopular and tainted by his association with the Rajapaksa clan https://t.co/egxNRTQn5I",
  "data/tweet-economist/2022/7/1547403277976969216.json": "Sri Lanka gives a taste of how quickly things can spiral out of control. No one can be sure which country or region will explode next \nhttps://t.co/Dk0vNCtlXV",
  "data/tweet-economist/2022/7/1547389675811348480.json": "A new study finds that jabs cut the disease’s death toll by 63% during their first year https://t.co/Kt5k8ZqjR2",
  "data/tweet-economist/2022/7/1547374485883478020.json": "A study finds that wages, nutrition and schooling levels along a pre-Columbian road are all unusually high https://t.co/ov6K8YUimN",
  "data/tweet-economist/2022/7/1547294786742280194.json": "Sri Lanka is descending into anarchy. Its woes are a harbinger of havoc elsewhere. All around the world, inflation is crushing living standards, stoking fury and fostering turmoil \nhttps://t.co/XbPSWtFljH",
  "data/tweet-economist/2022/7/1547132463880851460.json": "RT @Henry_Curr: The average maturity of Italy's bonds is over 7 years. But the budgetary spillovers of QE mean half the debt would in effec…",
  "data/tweet-economist/2022/7/1547480085711691778.json": "Without vaccines, the Delta- and Omicron-variant waves would have been almost three times deadlier, research suggests https://t.co/tjakMWhPVU",
  "data/tweet-economist/2022/7/1547441956883730432.json": "Mobs quickly form online, using microblogs, short videos and messaging apps to wage furious verbal campaigns against “traitors”, “spies” and “secondary devils” https://t.co/K6xRl1EKlm",
  "data/tweet-economist/2022/7/1547337259661262849.json": "A new study suggests a tie for first place https://t.co/dRbTeRyDEB",
  "data/tweet-economist/2022/7/1547499051062525952.json": "In its prime, from around 1200 to 1550, Great Zimbabwe was home to about 10,000 people. Yet it is far less frequently visited, or understood, than Machu Picchu or Egypt’s pyramids. Why? https://t.co/AgPdYqfnhx https://t.co/rAEw2F8iGm",
  "data/tweet-economist/2022/7/1547453888873353217.json": "The war in Ukraine has not, as many Western leaders had hoped, forced Turkey’s leader to reconsider his romance with Vladimir Putin. Opportunism has prevailed instead https://t.co/LWyoI5ef3Z",
  "data/tweet-economist/2022/7/1547489826307538944.json": "Electricity can be transmitted through the air https://t.co/tQeDeyKLuR",
  "data/tweet-economist/2022/7/1547531492535959552.json": "If Joe Biden truly wants to save the soul of America he will have to start with the soul of his own party https://t.co/hhH8y31VPW https://t.co/NW7EfcOkLS",
  "data/tweet-economist/2022/7/1547570405392560139.json": "There may be a heatwave in Europe at present, but winter is coming. It promises to be brutal and divisive: the energy crisis is rapidly worsening as Vladimir Putin strangles gas supplies https://t.co/xUBNAJ71Df https://t.co/ZA5gPTPOw4",
  "data/tweet-economist/2022/7/1547589875687272449.json": "The Democrats are passing peak progressive. The backlash against these excesses is not just coming from within cities, but from working-class and non-white voters \n\nhttps://t.co/qWJ8l8e8Tt",
  "data/tweet-economist/2022/7/1547604682259935233.json": "Foreign observers see the rise in nationalism as a reflection of the Communist Party’s own mindset, and wonder whether it could portend more aggressive behaviour by China abroad https://t.co/3Nsv7WtTmT",
  "data/tweet-economist/2022/7/1547602224276070406.json": "The hype about TikTok is justiﬁed—and so are the concerns. There's a reason why the world’s most exciting app is also its most mistrusted https://t.co/qTI7kC1lQv",
  "data/tweet-economist/2022/7/1547612834665623554.json": "Two vaccines shared first place, and averted between 5m and 7m deaths (because of the considerable uncertainty, The Economist deemed this a statistical tie) https://t.co/paiWJShWvE",
  "data/tweet-economist/2022/7/1547606626756046849.json": "Until recently MPs swore that in Boris Johnson’s chaos lay a special bond with voters that would keep them in power for another decade. Now all candidates boast of their integrity, seriousness and grip; none seeks to be his heir https://t.co/f9KT7O8lkY",
  "data/tweet-economist/2022/7/1547601441149181955.json": "Moving the Democrats towards the centre ground would not just be a shrewd political tactic: it could also be the beginning of a cure for American democracy. The stakes could not be higher \nhttps://t.co/XAAaubYqOt",
  "data/tweet-economist/2022/7/1547631280740638723.json": "Sexual abuse in the Catholic Church is not a problem of a few bad apples; it is a rotting orchard https://t.co/UQVV56xXxG",
  "data/tweet-economist/2022/7/1547630434938281984.json": "There may be a heatwave in Europe at present, but winter is coming. It promises to be brutal and divisive: the energy crisis is rapidly worsening as Vladimir Putin strangles gas supplies https://t.co/c71L71N8Fb",
  "data/tweet-economist/2022/7/1547625202468528128.json": "The Democrats are moving away from their most radical ideas, but they must move faster \nhttps://t.co/sdLT0c4oBG",
  "data/tweet-economist/2022/7/1547642943330066439.json": "Japan’s current prime minister has been quick to declare loyalty to Abe Shinzo’s hawkish legacy. But Kishida Fumio should follow the pragmatic Abe, not the ideological Abe https://t.co/VD5vucQa6V",
  "data/tweet-economist/2022/7/1547633792835207170.json": "The hundreds of millions of short clips uploaded to TikTok are causing sleepless nights in both Silicon Valley and Western capitals  https://t.co/VQLLT2cwJH",
  "data/tweet-economist/2022/7/1547655678705078272.json": "Modern digital-art software is designed to be professional and utilitarian. “Mario Paint”— a charming game released 30 years ago—prioritised fun instead https://t.co/RcgVKW8xQm",
  "data/tweet-economist/2022/7/1547648386563600385.json": "Boris Johnson’s promise to step down has allowed him to cobble together a caretaker government, which will run the country until a new prime minister takes office in early September. How will he use that time? https://t.co/pCv8wQMICf",
  "data/tweet-economist/2022/7/1547666415326375936.json": "His resignation has been rejected by Italy’s president, Sergio Mattarella https://t.co/qUC29tllg7",
  "data/tweet-economist/2022/7/1547659711561867272.json": "The ethnic diversity of the candidates for the Conservative Party’s leadership election has been striking. It underlines a transformation since the 2005 general election, when just two non-white Tories won seats https://t.co/09WmEOCTDC",
  "data/tweet-economist/2022/7/1547677581402509314.json": "How did humans evolve? The Economist’s @alokjha and Dylan Barry explain how new technology is revealing the complexity of our origins, on our science and technology podcast “Babbage” https://t.co/ZweVWSV5cJ",
  "data/tweet-economist/2022/7/1547692176007524352.json": "Elephants only rarely develop cancer. That is odd. Cancer, after all, is something of a numbers game: the more cells, the more replications https://t.co/w2gP8ST54r",
  "data/tweet-economist/2022/7/1547691670744862720.json": "Investigations into sexual abuse by Catholic priests are often thwarted by an ancient institution’s reflexive secrecy https://t.co/jNmcZMcl2m",
  "data/tweet-economist/2022/7/1547688657858924546.json": "Levi Roach’s new book is a powerful account of Norman history, told from the conquerors’ perspective https://t.co/PaRUrZELNe",
  "data/tweet-economist/2022/7/1547713319598841857.json": "The Democrats need to ditch cherished myths that empower its idealists. The greatest myth is that the party’s progressive stances invigorate the base and are off-putting only to the other side \nhttps://t.co/4nHw22saCl",
  "data/tweet-economist/2022/7/1547708287956635655.json": "Core inflation rose 0.7% in June from May, the highest month-on-month increase in a year https://t.co/7req4NhE6e",
  "data/tweet-economist/2022/7/1547722513580298241.json": "Clear positives stand out from Abe Shinzo’s record, most notably the financial accounts of Japan Inc \nhttps://t.co/N3XKWNXUmf",
  "data/tweet-economist/2022/7/1547739460518891522.json": "Russia’s unprovoked invasion of Ukraine appeared to vindicate some of America’s anxieties. Western officials now wonder whether nationalism in China may lead it down a similar path https://t.co/qqizeyfEQX",
  "data/tweet-economist/2022/7/1547734590302744577.json": "Kishida Fumio, Japan’s current prime minister, is likely to carry on down the path Abe Shinzo charted—but more cautiously https://t.co/xhO1UB6HCp",
  "data/tweet-economist/2022/7/1547722877440405506.json": "Quantum computers will make secret intelligence easy to read. Resilient encryption has never been more important  https://t.co/unI7tAZfIS",
  "data/tweet-economist/2022/7/1547677335243001863.json": "When quantum computers reach their potential, the world will suffer the biggest security hack in history. Future-proof encryption is available and should be put to use https://t.co/xT9xfSTb6b",
  "data/tweet-economist/2022/7/1547778442220843010.json": "Abe Shinzo left his mark on Asia and the world, not just Japan https://t.co/jQMTC5oNgU",
  "data/tweet-economist/2022/7/1547773470292860929.json": "Japan should stay true to Abe Shinzo’s vision—up to a point https://t.co/lyO2qoqxqq",
  "data/tweet-economist/2022/7/1547768567621226500.json": "The destruction of “America’s Stonehenge” has been described as an act of domestic terrorism. What were the Georgia Guidestones, and why might they have been attacked? We explain https://t.co/r7ljXbQXwS",
  "data/tweet-economist/2022/7/1547763759921254401.json": "Although it may entice the eye, clear packaging gives the nose reason to despair. Light is a potent driver of chemical change—and the damage can happen fast https://t.co/Lm4f6LD2KT",
  "data/tweet-economist/2022/7/1547749266226941952.json": "AstraZeneca-Oxford and Pfizer-BioNTech ramped up production early, and by the end of the study period had by far the most doses administered outside China https://t.co/7jSQkX5VGa",
  "data/tweet-economist/2022/7/1547744372812238849.json": "Beneath the brushstrokes of Old Master paintings are intricate linen canvases which are works of art in themselves https://t.co/baECgsjyad",
  "data/tweet-economist/2022/7/1547798027984781313.json": "Abe Shinzo was a pragmatist who strengthened Japan’s defences and rallied allies. Japan is likely to stick to the course he set https://t.co/OlZiDT4Fpu",
  "data/tweet-economist/2022/7/1547793168388669440.json": "The missile strikes appear to have occurred all along the front lines, from Luhansk in the east to Kherson in the south https://t.co/M3dWZMzTP6",
  "data/tweet-economist/2022/7/1547783351200649219.json": "The grip the Normans exerted on Europe and the Middle East was more the result of a militarised diaspora and crafty opportunism than of conscious empire-building, argues Levi Roach in a new book https://t.co/L6n3H2YT7O",
  "data/tweet-economist/2022/7/1547650143012302852.json": "Letting the Conservative Party’s 180,000 or so members have the final say over its leader, even when they are also choosing the head of the government, risks turning the role of prime minister into a rotten presidency https://t.co/YntyVPDxWU",
  "data/tweet-economist/2022/7/1547812626360438785.json": "Abe Shinzo believed that Japan should assert itself in the world https://t.co/fCWVev2YTR",
  "data/tweet-economist/2022/7/1547802967096451072.json": "KAL’s cartoon https://t.co/ygl6ereI22",
  "data/tweet-economist/2022/7/1547821233424584704.json": "Most Europeans cannot yet see or smell the gastastrophe, but in the markets the warning signs are already flashing red https://t.co/ZdNoRPJ2W1",
  "data/tweet-economist/2022/7/1547843775493328901.json": "When a few people are given power over others, when checks on that power are weak and when victims lack effective channels to report abuse, predators will take advantage https://t.co/6BAI5n3bXy",
  "data/tweet-economist/2022/7/1547858778346835970.json": "How did interbreeding between modern humans and now-extinct hominins shape the human genome? Listen to “Babbage”, our podcast on science and technology, with @alokjha https://t.co/0mhKSFgUmO",
  "data/tweet-economist/2022/7/1547872463890964480.json": "Should next year’s crop in Ukraine and Russia fail, hundreds of millions more people could fall into poverty. Political unrest will spread, children will be stunted and people will starve \nhttps://t.co/SK8LvDH92g",
  "data/tweet-economist/2022/7/1547647645123956738.json": "The Democrats, like their Republican counterparts, have fallen prey to their activists. The party has begun to put this right, but there is a lack of urgency \n\nhttps://t.co/hynn9XKy3P",
  "data/tweet-economist/2022/7/1547886550293159944.json": "Two-thirds of Gaza’s 2.1m people are under 25. Thanks to the Israeli blockade, they are stuck on a tiny strip of land with few jobs and no way out https://t.co/sYagUB94Sl",
  "data/tweet-economist/2022/7/1547881551542685705.json": "Rhinos, cows and men with guns: why violence racks the biggest, driest and poorest chunk of Kenya https://t.co/397SPR6o4O",
  "data/tweet-economist/2022/7/1547679345652551681.json": "The extra couple of billion people expected by the UN will cause emissions of greenhouse gases, making it even harder to tackle climate change \nhttps://t.co/dvTshFYT0a",
  "data/tweet-economist/2022/7/1547645131683090433.json": "How is the Ukraine conflict changing warfare? Britain’s chief of the defence staff @AdmTonyRadakin_ joins @AnneMcElvoy and @Shashj on “The Economist Asks” podcast https://t.co/fggIG6qPxq",
  "data/tweet-economist/2022/7/1547856213597073408.json": "The existing encryption standards are a bit of gnarly mathematics designed to be well-nigh impossible for today’s computers to crack. Researchers worry, however, about a coming era of quantum computers https://t.co/QmGmf9Pi5k",
  "data/tweet-economist/2022/7/1547877327224197122.json": "“The original objectives by President Putin have not been met and will not be met.” @AdmTonyRadakin_ discusses the state of the conflict in Ukraine, on “The Economist Asks” https://t.co/VMB7oFNHor",
  "data/tweet-economist/2022/7/1547687895514824704.json": "This is an especially bad time to be increasing government borrowing. Annual global inflation is 9.5% and interest rates are rising https://t.co/4wUIbA2sPs",
  "data/tweet-economist/2022/7/1547921689240952832.json": "The dismal litany of child-abuse scandals within the Roman Catholic Church over the past 20 years has fuelled calls for change https://t.co/Pimhqg4dBA",
  "data/tweet-economist/2022/7/1547917239499624456.json": "Joe Biden often seems to distinguish himself from his party’s worst ideas in muted tones and delicate asides. He must be louder and clearer in defending ideas that used to be uncontroversial \nhttps://t.co/PkccwAtv7J",
  "data/tweet-economist/2022/7/1547895207500255233.json": "President Issaias Afwerki has turned Eritrea into a prison camp. Restraining him would be a public good \nhttps://t.co/ttC8Uomoic",
  "data/tweet-economist/2022/7/1547927745828511747.json": "What set apart “Mario Paint” from other games of its time was the capacity to create animations and write music. Thirty years on, a dedicated community of composers still exists https://t.co/OsPqJXctUh",
  "data/tweet-economist/2022/7/1547909352601767939.json": "Several calamities in the past decade have come close to ripping Europe apart, including the euro crisis in the early 2010s and the migrant crisis in 2015. The winter energy shock of 2022 could yet join them https://t.co/BziSaPJOTg",
  "data/tweet-economist/2022/7/1547879961184219137.json": "♦️ Italy’s president rejects an offer by Mario Draghi to resign as prime minister.\n\n♦️ Rishi Sunak tops the second round of voting in Britain’s Conservative Party leadership contest.\n\n♦️ New figures show the toll of lockdowns on China’s economy.\n\nCatch up on today’s news 👇",
  "data/tweet-economist/2022/7/1547655678642122757.json": "A rise in the number of old people and a fall in the number of very young children in England and Wales, as revealed by the 2021 census, has caused alarm. But it is less of a problem than the doomsayers suppose—for now https://t.co/gozJQDqhsg",
  "data/tweet-economist/2022/7/1547937789961900035.json": "A sense of mission ran in the family, as politics did, so that was his natural career https://t.co/kH8tjqOQXr",
  "data/tweet-economist/2022/7/1547945729624199169.json": "“The theory is born of America’s history,” writes @jasonintrator. “If American history is being accurately taught, so is much of the basis of CRT.” Part of a series of guest essays on the topic https://t.co/pm5kfjSYHh",
  "data/tweet-economist/2022/7/1547935283240243201.json": "“The world is a lesser place now that he has become the senseless victim of an assassin’s bullet,” writes @MrKRudd. In a guest essay, the former Australian prime minister considers Abe’s international legacy https://t.co/QkiOTuh2gb",
  "data/tweet-economist/2022/7/1547959722820571143.json": "Just about everything—from cars to clothing and furniture to rents—is getting more expensive https://t.co/iotTZyzv0x",
  "data/tweet-economist/2022/7/1547923458306162688.json": "Political upheaval could jeopardise Italy’s efforts to secure its giant share of the EU’s post-pandemic recovery fund https://t.co/NVoA4D2Gwg",
  "data/tweet-economist/2022/7/1547982844697251841.json": "During the pandemic the Communist Party has propelled popular nationalism to new heights https://t.co/KMmWIejYcD",
  "data/tweet-economist/2022/7/1547978308712681473.json": "Planning to fight Russia and being prepared to do so are two different things https://t.co/UslOts3kSr",
  "data/tweet-economist/2022/7/1547717591354945544.json": "To rising inflation, high debts and uncertain gas supplies, add political confusion https://t.co/nPkutTiTNd",
  "data/tweet-economist/2022/7/1547992664858980352.json": "The fact that he is a serial liar and lacks the self-discipline to apply himself to hard problems is well-known. But the extent to which he poisons the reputations of those he comes into contact with is striking https://t.co/wiELLUKMWe",
  "data/tweet-economist/2022/7/1547987635146174464.json": "Ukrainian commanders are cock-a-hoop. They say the new system—known as HIMARS—is tilting the war back in their favour after recent losses in Luhansk https://t.co/oYRKlcRfWp",
  "data/tweet-economist/2022/7/1548003473286868998.json": "Covid vaccination reduced symptoms of depression by 27% and anxiety by 28%, according to new research https://t.co/VLv46n2lC5",
  "data/tweet-economist/2022/7/1548003244919558147.json": "Abe Shinzo’s overseas visits helped transform Japan’s foreign-policy focus and standing in Asia—and confirmed him as the most consequential Japanese statesman since the second world war https://t.co/bASSOwFIsR",
  "data/tweet-economist/2022/7/1547998700076552193.json": "Joe Biden’s hosts will offer a friendly welcome, but they will probably send him home with little more than a few token souvenirs https://t.co/hWEfabBJz4",
  "data/tweet-economist/2022/7/1548009024133550081.json": "The Met Office in London has issued a red extreme heat warning for the first time. Heat is one of climate change’s deadliest manifestations, as we wrote in 2019 https://t.co/BN9BaYLG2K",
  "data/tweet-economist/2022/7/1548009023894523907.json": "If an institution routinely hushes up allegations and shuffles suspected predators to other jobs, rather than promptly reporting allegations to the police, abuse thrives https://t.co/JfnAMw9zjC",
  "data/tweet-economist/2022/7/1548007753783734274.json": "“Ukraine will not fall under the Russian yoke.” Britain’s chief of the defence staff @AdmTonyRadakin_ joins “The Economist Asks” podcast https://t.co/4ePnm48Cxb",
  "data/tweet-economist/2022/7/1548020048400265217.json": "Ukraine’s comedian-turned-president was “visibly nervous” in his early bouts of diplomacy. Now he has an experience of statecraft that no modern Western leader can match, nor would wish to https://t.co/DOXI9PG2sq",
  "data/tweet-economist/2022/7/1548013801928241161.json": "The most concerning part of the latest data was not the shocking headline figure. Rather, it was the change in core prices, stripping out volatile food and energy \n\nhttps://t.co/m3VJfr7pIO",
  "data/tweet-economist/2022/7/1548026127943286789.json": "Under Shinzo Abe, Japan’s female employment rates, previously low by the standards of rich economies, climbed rapidly  \nhttps://t.co/DO2Kxpvwin",
  "data/tweet-economist/2022/7/1548024866342785024.json": "A Ukrainian ballerina goes to war https://t.co/kTeA4ln4Xr",
  "data/tweet-economist/2022/7/1548024118049587200.json": "What to read to understand the history of Western capitalism https://t.co/w8VGpZxl6v",
  "data/tweet-economist/2022/7/1548022611640127491.json": "In June unofficial estimates put Turkish inflation at 160%, double the official rate of 79% https://t.co/mMY7Xak5jA",
  "data/tweet-economist/2022/7/1548031919115235332.json": "A Ukrainian ballerina goes to war https://t.co/Uw7UTre9z1",
  "data/tweet-economist/2022/7/1547966739639517187.json": "Researchers may have created an all-new fuel, high in both environmental credentials and in energy density, using genetically engineered bacteria https://t.co/KpVs6LpEtn",
  "data/tweet-economist/2022/7/1547991160773152769.json": "Britain is still a few years away from a demographic crunch but a shortage of babies will harm it in the end https://t.co/CE8NEBtRVz",
  "data/tweet-economist/2022/7/1547961984640897024.json": "Quantum computers will make secret intelligence easy to read. Resilient encryption has never been more important https://t.co/7sBTXJiJxN https://t.co/Yo1ULbKvPA",
  "data/tweet-economist/2022/7/1548062125590925314.json": "Elephants play host to a variegated gang of anti-cancer proteins, which confer a clear-cut survival benefit. Why have humans not evolved the same? https://t.co/FeJSXiPRVD",
  "data/tweet-economist/2022/7/1548107408060268550.json": "Abe Shinzo worked to put Japan at the forefront of efforts to prevent Chinese assertiveness from wrecking an open, international order that had by and large guaranteed East Asian peace and prosperity https://t.co/RGcrfYbZov",
  "data/tweet-economist/2022/7/1548085810452316160.json": "Officials in China's Henan province show how not to handle a financial scandal https://t.co/aA9Vu9qQ1X",
  "data/tweet-economist/2022/7/1548026625874227200.json": "Pupils may not like it much, but more time spent in the classroom is good for them. It also benefits their parents and society as a whole https://t.co/WwidCxfBWS",
  "data/tweet-economist/2022/7/1548144893171642368.json": "His first administration was a failure, lasting barely a year in 2006-07; but in his second, running from 2012 to 2020, he found his voice https://t.co/KvB0qjQhb4",
  "data/tweet-economist/2022/7/1548133251209801734.json": "Fasting is not just a mortification or denial; it is a reminder of the value and joy of food https://t.co/v752PxM0Jv",
  "data/tweet-economist/2022/7/1548089740787822595.json": "In addition to being Japan’s longest-serving leader, Abe Shinzo was the country’s most consequential politician in decades. His death leaves Japan at a crossroads https://t.co/0r4aiD8USz",
  "data/tweet-economist/2022/7/1547817292985118727.json": "Tomorrow’s code-cracking computers threaten sensitive data—but there is a future-proof way to encrypt information against hacks. Governments, businesses and software vendors should take heed https://t.co/CEVYJlC71B",
  "data/tweet-economist/2022/7/1548153878381617152.json": "One of the biggest financial scandals in Chinese history has occurred in Henan province. The government is not handling it well https://t.co/3GVIviOpDo",
  "data/tweet-economist/2022/7/1548178829620916224.json": "Less than 0.1% of graphene is needed to make concrete 30% stronger. And stronger concrete means less of it is needed, consequently reducing CO2 https://t.co/sDQSoEovxm",
  "data/tweet-economist/2022/7/1548013323605532673.json": "What is critical race theory?\n\nWe’re taking a deep-dive into how this once obscure academic topic became a new frontline in America’s culture war with a special three-part series on our “Checks and Balance” podcast. \n\nJoin us👇 https://t.co/LcimAtd8dX",
  "data/tweet-economist/2022/7/1548183985922068486.json": "Russia’s army, which relies heavily on trains to move munitions and human muscle to load them onto trucks, has created big depots close to railheads. That was fine until the High Mobility Artillery Rocket System turned up https://t.co/BnCOtqRJyZ",
  "data/tweet-economist/2022/7/1548149998306488328.json": "Japanese policymakers talk less of ditching Abenomics and more of building its legacy \nhttps://t.co/9fnaj3Lgzp",
  "data/tweet-economist/2022/7/1548047011873574914.json": "In the past four decades Brazil has transformed itself from a net importer into the world’s fourth-biggest food exporter https://t.co/PRxsdcIsgl",
  "data/tweet-economist/2022/7/1548203638899634177.json": "If the church stopped requiring priests to be celibate (or male, for that matter), it could recruit from a much larger pool. It would end up with far fewer abusers https://t.co/uRPXcMBxey",
  "data/tweet-economist/2022/7/1548189202642137090.json": "Long school holidays can negatively affect childrens’ learning and accentuate inequality. Better to keep them short https://t.co/WcwlOGZ0ec",
  "data/tweet-economist/2022/7/1548211852672348160.json": "As inflation soars and the lira spirals, millions of Turks have fallen below a poverty line of around $1,200 a month for a family of four https://t.co/Pn030NEZFL",
  "data/tweet-economist/2022/7/1548221073660862464.json": "More research is needed, but that is not to say this work is without potential relevance to humans https://t.co/Mn7aNjzdww",
  "data/tweet-economist/2022/7/1548216971807715329.json": "More than 50% of young Gazans have considered suicide, according to Save the Children. Even so, people in Gaza are often quick to insist someone else has it worse https://t.co/cmZ2dzzBcG",
  "data/tweet-economist/2022/7/1548240038135074816.json": "The Netherlands is the biggest nitrogen polluter in the EU. Farmers are up in arms about the government’s proposals to cut output https://t.co/deru1hOqbe",
  "data/tweet-economist/2022/7/1548168430691307520.json": "This month a French engineer declared that he and a collaborator had identified the landscape in the background of the “Mona Lisa” https://t.co/d6UX1t0nMh",
  "data/tweet-economist/2022/7/1548269980508049409.json": "As Japan’s prime minister his plan was for a “beautiful” country: strong, moral and an example to the world https://t.co/HzzLcmsM0p",
  "data/tweet-economist/2022/7/1548265876574461952.json": "A warm style with foreign leaders—including man-hugs with Narendra Modi—helped Abe Shinzo bring a newly assertive style of diplomacy to Japan https://t.co/Vx2Tli1NDZ",
  "data/tweet-economist/2022/7/1548280816656011269.json": "The havoc caused by extreme heat does not get the attention it merits for several reasons. From 2019 https://t.co/ZgywFMkjBR",
  "data/tweet-economist/2022/7/1548261485771571203.json": "As details about the killer emerged, Abe Shinzo’s death has come to look more like an isolated murder than the opening shot in a campaign of political violence https://t.co/X4V1AS2jo2",
  "data/tweet-economist/2022/7/1548293143363067904.json": "CRT exposes “the methods by which those who have traditionally been in positions of cultural, political and economic power preserve their influence over time,” says @jasonintrator. That is why it is a “target”, he argues in a guest essay https://t.co/h6DIRjqZ2n",
  "data/tweet-economist/2022/7/1548233241399681024.json": "His resignation marks the end of the Rajapaksa family’s two-decade dominance of politics in the country. Most Sri Lankans considered it long past time https://t.co/Gt1un81vKD",
  "data/tweet-economist/2022/7/1548298408846192640.json": "Some 400,000 Chinese people have been unable to access their bank deposits. Their protests have been met with violence https://t.co/WOKdKzjp7s",
  "data/tweet-economist/2022/7/1548251364353945600.json": "To uncover the story of human evolution, scientists are nowadays not only hunting for clues in the bones of our ancestors—but in the genomes of living people, too. Listen to “Babbage”, our podcast on science and technology https://t.co/vjvoHJfCwx",
  "data/tweet-economist/2022/7/1548314353299927040.json": "Nearly 250m people are on the brink of famine https://t.co/xlgCkkOe1u",
  "data/tweet-economist/2022/7/1548324597359001603.json": "A recent study found that more than half of lives saved around the world could be attributed to just two vaccines, which shared first place https://t.co/OcO5EDZufS https://t.co/kU6DsBjgMq",
  "data/tweet-economist/2022/7/1548255891798904835.json": "The grip the Normans exerted on Europe and the Middle East was more the result of a militarised diaspora and crafty opportunism than of conscious empire-building, argues Levi Roach in a new book https://t.co/W87Nri4Seq",
  "data/tweet-economist/2022/7/1548329634147680256.json": "Researchers think that somewhere between 6% and 9% of Catholic priests and religious figures may have been child abusers https://t.co/RErstDGxlj",
  "data/tweet-economist/2022/7/1548361352862765058.json": "Finding a balance between protecting wildlife and preserving the livelihoods of poor nomadic herders tests the ingenuity of conservationists in Kenya https://t.co/3QA7KEJty9 https://t.co/OY9zeH4SY3",
  "data/tweet-economist/2022/7/1548371647739990016.json": "Sexual abuse in the Catholic Church is not a problem of a few bad apples; it is a rotting orchard https://t.co/7cth4JsG5X",
  "data/tweet-economist/2022/7/1548356308310450183.json": "A heatwave is sweeping through Europe and Britain. In 2019 we explained the dangers of extreme heat—and how to avoid them https://t.co/rHQx9F24YT",
  "data/tweet-economist/2022/7/1548007006232928256.json": "Exposure to light can trigger undesirable photochemical reactions that leave wine smelling of “boiled cabbage”, “wet dog” or even “Marmite” https://t.co/TZ6c5YZ7s4",
  "data/tweet-economist/2022/7/1548390268193255431.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/Ev8L9Ry8zd",
  "data/tweet-economist/2022/7/1548390267610226691.json": "The legal case against Donald Trump is looking stronger https://t.co/RtNNr9leI0",
  "data/tweet-economist/2022/7/1548383223058534401.json": "Vaccines continue to save lives, and have allowed most countries to return to a semblance of pre-pandemic normalcy https://t.co/4ImY38dfYo",
  "data/tweet-economist/2022/7/1548360831796068356.json": "Dutch farmers and the government lock horns over the issue of nitrogen poo-llution https://t.co/B0x38GC8zN",
  "data/tweet-economist/2022/7/1548365613491376132.json": "Finding a balance between protecting wildlife and preserving the livelihoods of poor nomadic herders tests the ingenuity of conservationists in Kenya https://t.co/ZOWkry0RcR",
  "data/tweet-economist/2022/7/1548394081558024193.json": "Hair-raising accounts of the Trump presidency are now so familiar it is easy to become complacent about them https://t.co/vBcIg48ClK",
  "data/tweet-economist/2022/7/1548325859563413507.json": "While most of Europe’s politicians fail to level with the public about the hard choices that lie ahead, even grizzled energy traders used to wars and coups have started to sound worried https://t.co/dMMsFcBmte",
  "data/tweet-economist/2022/7/1548489650859257856.json": "His efforts to repair Japan’s economy made him popular. His main concern, though, was that Japan should assert itself in the world https://t.co/yO7F6cblue",
  "data/tweet-economist/2022/7/1548475620572573698.json": "Might Jair Bolsonaro try to steal Brazil’s election? https://t.co/mKeBp4w11d",
  "data/tweet-economist/2022/7/1548447560053927937.json": "“The CRT debate is just the latest excuse for conservatives to denigrate public schools,” writes @charles_siler. “They are trying to hold on to power as society evolves beyond them.” Part of a series of guest essays on the topic https://t.co/tEUsTJVtWe",
  "data/tweet-economist/2022/7/1548360323798732816.json": "Russia’s ability to mount a naval offensive or to land troops has been curtailed by Ukrainian missiles. We explain why they cannot replenish their naval numbers in the Black Sea https://t.co/yRflcxuHiV",
  "data/tweet-economist/2022/7/1548537177361063940.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/sfBGISvj6Z",
  "data/tweet-economist/2022/7/1548509131228659712.json": "The run on Henan’s banks highlights enduring problems which have been brought to the surface by China’s slowing economy https://t.co/qQY1Q9pkvj",
  "data/tweet-economist/2022/7/1548541721176317952.json": "Turkey grapples with triple-digit inflation https://t.co/yCuMwwEWlk",
  "data/tweet-economist/2022/7/1548565235472207872.json": "Some paedophiles become priests precisely because the priesthood offers opportunities to abuse. Others hope that a spiritual life will cure them of their urges. It generally doesn't https://t.co/CO34p4wWvm",
  "data/tweet-economist/2022/7/1548561372677640193.json": "Japan today is a much more engaged partner in geopolitics. That is thanks to the transformations that Abe Shinzo wrought https://t.co/Ngu9XffroG",
  "data/tweet-economist/2022/7/1548436588081729538.json": "The possibility of a humiliating loss to a Republican Party that is unrepentantly descending into anti-democratic conspiracy weighs heavily on Democrats and anxious international allies \nhttps://t.co/vZ3ZbxIAJD",
  "data/tweet-economist/2022/7/1548573022738595840.json": "Turkey’s property market is a bubble: over the past year, prices have increased by 182% in nominal terms, according to a survey https://t.co/XbbDwsaE9I",
  "data/tweet-economist/2022/7/1548582133333123073.json": "The Met Office in London has issued a red extreme heat warning for the first time. Heat is one of climate change’s deadliest manifestations, as we wrote in 2019 https://t.co/F03LFaFOoo",
  "data/tweet-economist/2022/7/1548556838106456064.json": "He appears bent on undermining trust in democratic institutions. But it is unclear is how far he might go, and who might support him if he plays dirty  https://t.co/zf9Q95sWYW",
  "data/tweet-economist/2022/7/1548586851711291393.json": "Josephine Baker was a true hero of the second world war https://t.co/uUOWxes5j4",
  "data/tweet-economist/2022/7/1548604459139448833.json": "Consumers, who use gas directly for heating and cooking, as well as indirectly as electricity, have little idea of what may hit them https://t.co/868Ol8kXpm",
  "data/tweet-economist/2022/7/1548596206254923776.json": "Xi Jinping has nurtured a volatile force. He may not always be so able to keep it under control https://t.co/gRKnXzAagF",
  "data/tweet-economist/2022/7/1548622106367246337.json": "Japan, he felt, needed to retell its history. He could not accept that his country’s future generations, who had nothing to do with the war, should be destined forever to apologise, as if the world could not move on https://t.co/9T8yJHFjMw",
  "data/tweet-economist/2022/7/1548284734882869248.json": "Financial crime is as old as money. Hucksters were dreaming up Ponzi schemes centuries before Charles Ponzi gave his name to the ruse. Try these books to get to grips with how it works https://t.co/8Cwl5mHlVC",
  "data/tweet-economist/2022/7/1548647998749609985.json": "To lower pollution, the Dutch government wants to cut the number of cows and pigs in the country by around a third. Farmers are outraged https://t.co/1MfF5aYtFx",
  "data/tweet-economist/2022/7/1548631353993879553.json": "Most countries ought to go Dutch or Danish: shorten their school holidays to six weeks in summer and roughly that again over the rest of the year https://t.co/vPVqv82Nuy",
  "data/tweet-economist/2022/7/1548693027526434819.json": "Millions of Turks are being plunged into poverty; others are buying up cryptocurrencies. Most are struggling https://t.co/xozYpGJBPB",
  "data/tweet-economist/2022/7/1548697917992697856.json": "Ukraine’s comedian-turned-president was “visibly nervous” in his early bouts of diplomacy. Now he has an experience of statecraft that no modern Western leader can match, nor would wish to https://t.co/3ZgG7X4PkU",
  "data/tweet-economist/2022/7/1548647477133426689.json": "From tax havens to kleptocracy, these five books chart the rise of financial crime https://t.co/5h4l3KhHWR",
  "data/tweet-economist/2022/7/1548692013025050625.json": "As more sex-abuse stories come to light, pews are emptying in America and across Europe https://t.co/P5eQKdFmH2",
  "data/tweet-economist/2022/7/1548733793313382400.json": "Mandatory celibacy is one reason why hardly anyone wants to be a priest. The one group undeterred by this rule is paedophiles, who already have to suppress their urges, or pretend to https://t.co/Mx4d28YV3M",
  "data/tweet-economist/2022/7/1548456236277850113.json": "He leaves the country in a political vacuum. Ranil Wickremesinghe, the prime minister who has taken charge in the president’s absence, is deeply unpopular and tainted by his association with the Rajapaksa clan https://t.co/jJfF4nnmzF",
  "data/tweet-economist/2022/7/1548721206202929153.json": "Society bombards us with instructions to be happier, fitter and richer. Why have we become so dissatisfied with being ordinary? https://t.co/hwpHEf47yk",
  "data/tweet-economist/2022/7/1548710881583833088.json": "Eritrea is building up forces on the borders of Tigray, where they threaten to wreck peace talks between Ethiopia and the Tigrayan People’s Liberation Front. Firm action is required \nhttps://t.co/ODjrYhy38Y",
  "data/tweet-economist/2022/7/1548624832597835777.json": "Under the current system, Conservative Party candidates to become prime minister end up appealing to a narrow caucus of self-selecting members, rather than lawmakers chosen by the electorate at large. That is wrong https://t.co/kahPRU8H95",
  "data/tweet-economist/2022/7/1548797715668140035.json": "Joe Biden’s administration has so far spent about $8bn on military aid alone for Ukraine https://t.co/ikPbomOanR",
  "data/tweet-economist/2022/7/1548888501684428802.json": "The bicycle is humanity’s most underrated invention https://t.co/mRTQuBUs62",
  "data/tweet-economist/2022/7/1548764752687628290.json": "Most animals play host to but one type of p53, a potent anti-cancer agent in the body’s arsenal. But elephants have 20—working together in harmony https://t.co/AC3FA8KipV",
  "data/tweet-economist/2022/7/1548907248730112002.json": "There was rampant physical, sexual and emotional abuse as well as malnourishment, disease and overcrowding https://t.co/9D2OYY0iJr",
  "data/tweet-economist/2022/7/1548685589779718145.json": "This month a French engineer declared that he and a collaborator had identified the landscape in the background of the “Mona Lisa” https://t.co/BirqiW9KVD",
  "data/tweet-economist/2022/7/1548832105869746177.json": "The Democrats need to wake up and stop pandering to their extremes https://t.co/bVdcNdkfM7",
  "data/tweet-economist/2022/7/1548878860766396417.json": "The British Museum has the world’s largest collection of Benin bronzes, at about 1,000 https://t.co/T3LfFJX52K",
  "data/tweet-economist/2022/7/1548957426388504577.json": "There may be a heatwave in Europe, but winter is coming. It promises to be brutal and divisive: the energy crisis is rapidly worsening as Vladimir Putin strangles gas supplies https://t.co/LHV0abWmwA https://t.co/2gHJVhyf4o",
  "data/tweet-economist/2022/7/1548948423063359494.json": "“Putin is afraid of the young”: meet the 23-year-old Russian activist living under house arrest https://t.co/ApBsw0OXfC",
  "data/tweet-economist/2022/7/1549055811162238976.json": "President Jair Bolsonaro seems to be using Donald Trump’s fraud-allegation playbook ahead of October’s election in Brazil, @GeorgiaBanjo tells “The Intelligence” https://t.co/q39Ae8jH6X",
  "data/tweet-economist/2022/7/1549199702364667904.json": "Sexual abuse in the Catholic Church is not a problem of a few bad apples; it is a rotting orchard https://t.co/fJjUWLPTV7",
  "data/tweet-economist/2022/7/1549209701358964737.json": "By 2050, 25% of the world’s population will be African https://t.co/zd8hAUhcA4",
  "data/tweet-economist/2022/7/1549260476009283584.json": "Abe Shinzo left his mark on Asia and the world, not just Japan https://t.co/Qrr01UZyRm",
  "data/tweet-economist/2022/7/1549070312498597888.json": "At wet-bulb temperatures above 35°C, it is thought that even young healthy people wearing light clothing—regardless of whether they are parked in front of a fan, in the shade or have unlimited water to drink—will die in about six hours https://t.co/UXh3X7U7aE https://t.co/CMyTw0McIq",
  "data/tweet-economist/2022/7/1549411944121225217.json": "Sexual abuse in the Catholic Church is not a problem of a few bad apples; it is a rotting orchard https://t.co/q5iYPBmMsM",
  "data/tweet-economist/2022/7/1549368675173638144.json": "By July 16th 1,756 forest fires had been recorded across the EU since the start of the year. That is 273% higher than the average for this time of year between 2006 and 2021 https://t.co/AwxjWQB3gl",
  "data/tweet-economist/2022/7/1549555359320350720.json": "President Jair Bolsonaro appears bent on undermining trust in Brazil’s democratic institutions—but it is unclear is how far he might go https://t.co/EDAsJJaCAm https://t.co/uCOC8lsqEb"
}