{
  "data/tweet-wsj/2022/6/1531814069182861316.json": "Rafael Nadal and Novak Djokovic have one of tennis’s most celebrated rivalries. At the French Open Tuesday night, the two legends played a clay court epic, with Nadal prevailing in four sets to move onto the semifinals, writes @jasongay https://t.co/mv5r5Ou5hW",
  "data/tweet-wsj/2022/6/1531851800437002240.json": "A surgeon lost his life savings. Others have given up on their dreams. All of them were swept up in crypto mania—and the crash. https://t.co/46uPnq152i",
  "data/tweet-wsj/2022/6/1531920429321003008.json": "Ukrainian President Volodymyr Zelensky said his country won’t surrender any territory to Russia in exchange for peace, despite losing terrain and soldiers daily to Moscow’s forces https://t.co/bNtzAlh76f",
  "data/tweet-wsj/2022/6/1531832963436105728.json": "French Laundry chef Thomas Keller on his guilty pleasure: “In-N-Out Burger. I always order the French fries well-done, so they get crispy.” https://t.co/WWvREZkDxq",
  "data/tweet-wsj/2022/6/1531972600129363968.json": "Russia is getting oil to market by using ship-to-ship transfers and tapping Indian refineries to hide the origins of gasoline and other products https://t.co/44D4sH5mil",
  "data/tweet-wsj/2022/6/1531908432466427905.json": "K-Pop boy band BTS met with President Biden at the White House to talk about discrimination against the Asian community amid an uptick in anti-Asian hate crimes in the U.S. https://t.co/G4QM2j43Lx",
  "data/tweet-wsj/2022/6/1531981412039024642.json": "The CEO of Deutsche Bank's asset-management subsidiary DWS will step down, a day after a raid by German authorities on its Frankfurt offices https://t.co/NjaQS4SBZL",
  "data/tweet-wsj/2022/6/1532010342733295617.json": "\"So many people don’t want to fight.\" Documents show hundreds of Russian troops and national guardsmen refused orders to join the war against Ukraine. https://t.co/4XkcxsfAZL",
  "data/tweet-wsj/2022/6/1531806509461651456.json": "From @WSJopinion: Europe is now trying to wean itself from the Kremlin’s energy leverage. The oil ban is a step in the right direction. https://t.co/lEQnCH61ZL",
  "data/tweet-wsj/2022/6/1532036806245597185.json": "Arkansas Gov. Asa Hutchinson, who is contemplating a bid for the 2024 Republican presidential nomination, said he wants his party to show more independence and break away from former President Donald Trump’s hold https://t.co/A3mioNH2P6",
  "data/tweet-wsj/2022/6/1532070759170211841.json": "Tesla employees are required to spend at least 40 hours a week in the office, Elon Musk said this week in an email to staff https://t.co/RvKYUnd3z9",
  "data/tweet-wsj/2022/6/1532086643309551617.json": "Breaking: A jury ruled in favor of Johnny Depp in his defamation lawsuit against Amber Heard, awarding him $15 million in damages. Heard was awarded $2 million in her countersuit. https://t.co/IsIBCNIru2",
  "data/tweet-wsj/2022/6/1532087606825078784.json": "Breaking: Sheryl Sandberg said she will be leaving her role as chief operating officer of Facebook parent Meta https://t.co/bDPh3RMhUg",
  "data/tweet-wsj/2022/6/1532106502818910209.json": "The Buffalo supermarket gunman was charged with domestic terrorism and 10 counts of first-degree murder, among other charges, by a county grand jury https://t.co/6RCpRVs9rS",
  "data/tweet-wsj/2022/6/1532104746294824964.json": "JPMorgan CEO Jamie Dimon said U.S. consumers still have some six to nine months of spending power in their bank accounts but warned of tumult ahead https://t.co/M5JSrhKfSs",
  "data/tweet-wsj/2022/6/1532131193826721795.json": "Ukrainian troops will be sufficiently trained within a month to operate advanced U.S. rocket systems, Pentagon officials said Wednesday https://t.co/QhDTsir3EQ",
  "data/tweet-wsj/2022/6/1532142485027180545.json": "The U.S. will forgive all $5.8 billion in student loans tied to defunct Corinthian Colleges, the largest single debt cancellation by the government https://t.co/EQtAJz1fu8",
  "data/tweet-wsj/2022/6/1532171484378054658.json": "At least four people were shot and killed by a gunman Wednesday in a mass shooting at a medical clinic in Tulsa, Oklahoma, police said. The shooter is also dead. https://t.co/gavBnKoiEC",
  "data/tweet-wsj/2022/6/1532162989310238724.json": "A gunman shot and killed multiple people and injured several others in a mass shooting Wednesday at a medical clinic in Tulsa, Oklahoma, according to local law enforcement https://t.co/N8VkQQp0Dt",
  "data/tweet-wsj/2022/6/1532161339002691584.json": "From @WSJopinion: Clinical reports in China recount scores of cases in which organ donors were alive when operations began, write Jacob Lavee and Matthew P. Robertson https://t.co/v6fxl6XZwg",
  "data/tweet-wsj/2022/6/1532138713496551424.json": "A 31-year-old former employee of an NFT marketplace has been charged with fraud and money laundering in what federal prosecutors said was the first case to involve insider trading of the digital tokens https://t.co/SOvIWo13IY",
  "data/tweet-wsj/2022/6/1532135017433993216.json": "Feel like watching corgis race? Or running yourself, for about 70 kilometers? These are among the ways people are marking Queen Elizabeth's Platinum Jubilee, celebrating 70 years on the throne. https://t.co/9LRQZsjuTy",
  "data/tweet-wsj/2022/6/1532191415891116033.json": "Police say they're investigating the motive for Wednesday’s deadly mass shooting in Oklahoma, which took place on the 101st anniversary of the Tulsa Race Massacre https://t.co/RDzZ9cIxfS",
  "data/tweet-wsj/2022/6/1532178383672582144.json": "Admiral Linda Fagan was sworn in Wednesday as the 27th commandant of the U.S. Coast Guard, making her the first woman to lead the military branch https://t.co/TE2hjsfDZk",
  "data/tweet-wsj/2022/6/1532209024317509632.json": "“He very purposely went to this location, went to a very specific floor and shot with very specific purpose.” Tulsa police said Wednesday night that the deadly mass shooting at a medical clinic did not appear to be a random act. https://t.co/N6DDNg76Ww",
  "data/tweet-wsj/2022/6/1532157590393827330.json": "President Biden says he “can’t take immediate action” to lower record-high gasoline prices https://t.co/wh2R39YUJt",
  "data/tweet-wsj/2022/6/1532153797908303872.json": "Denmark voted to deepen its military cooperation with the rest of Europe, as a majority of Danes on Wednesday approved scrapping a 30-year-old opt-out that kept the Scandinavian nation out of common European Union security and defense policies https://t.co/rwrrsHScw4",
  "data/tweet-wsj/2022/6/1532126126356811776.json": "Pfizer has asked the FDA to authorize its Covid-19 vaccine in children 6 months to 5 years. The three-dose series could be available later this month. https://t.co/V5I8cI8mic",
  "data/tweet-wsj/2022/6/1531987695148404736.json": "Ukrainian President Volodymyr Zelensky said supplying his country with long-range weapons doesn’t increase the risk of it attacking Russian territory https://t.co/LhlvPBh1fP",
  "data/tweet-wsj/2022/6/1531965045520883719.json": "“Buy now, pay later” companies such as Affirm, Afterpay and Klarna promised a credit revolution that would change the way people pay for things. Rising delinquencies and a slowing economy are clouding that outlook. https://t.co/60rDPBH1Yz",
  "data/tweet-wsj/2022/6/1532225547669065729.json": "Tesla employees are required to spend at least 40 hours a week in the office, Elon Musk said this week in an email to staff https://t.co/yt8EXGMM2n",
  "data/tweet-wsj/2022/6/1532210446333263873.json": "JPMorgan CEO Jamie Dimon said U.S. consumers still have some six to nine months of spending power in their bank accounts but warned of tumult ahead https://t.co/P8sIhmfP5z",
  "data/tweet-wsj/2022/6/1532128626086379524.json": "Criminal hacking gangs in countries like Russia, China and Iran are increasingly overlapping with national spy agencies. “They’re not only just accepted, but they’re supported by the intelligence services,” a U.S. official says. https://t.co/Yh16yitLyh",
  "data/tweet-wsj/2022/6/1532316142030753795.json": "As Queen Elizabeth II marks 70 years on the throne for her platinum jubilee, take a look at past celebrations of the British monarchy—from the U.K. to Jamaica https://t.co/uhwGH0k9e8",
  "data/tweet-wsj/2022/6/1532328141846372353.json": "Thousands of well-wishers gather in central London to mark Queen Elizabeth II’s 70 years on the throne https://t.co/ONUgz1XYZu",
  "data/tweet-wsj/2022/6/1532335004491055105.json": "Saudi Arabia is considering pumping more oil than planned to offset a decline in Russian crude production, a move the kingdom would tie to greater security guarantees from the U.S. https://t.co/wr2gZlSOLH",
  "data/tweet-wsj/2022/6/1532346301651771406.json": "Actor Johnny Depp was awarded $10.4 million in his case against Amber Heard in Virginia, while the actor’s former wife will receive $2 million in compensatory damages #WSJWhatsNow breaks down the numbers https://t.co/4c7FMFsjov https://t.co/pscTVQOMrs",
  "data/tweet-wsj/2022/6/1532356184627458049.json": "OPEC and its allies agreed to a bigger-than-expected oil-production increase of 648,000 barrels a day in July and August, delegates said https://t.co/S5T1yH1bGW",
  "data/tweet-wsj/2022/6/1532353909485969408.json": "More than two-thirds of Americans want to uphold Roe v. Wade, and most favor access to legal abortion for any reason, a WSJ-NORC poll finds https://t.co/MFRyGDoMfC",
  "data/tweet-wsj/2022/6/1532168883808911360.json": "Axiom Space and Collins Aerospace will compete for NASA space-suit work that could be valued at a total of $3.5 billion https://t.co/OP5pXMcfzD",
  "data/tweet-wsj/2022/6/1532397593308831744.json": "Breaking: The Tulsa, Okla., shooter killed the doctor who performed his back surgery last month, police said. A second doctor, a receptionist and a patient were also killed. https://t.co/1pGB1gjpQx",
  "data/tweet-wsj/2022/6/1532398982244274178.json": "Lawyer Michael Avenatti was sentenced to four years in prison for stealing $300,000 from adult-film actress Stormy Daniels, whom he represented in her battles with former President Donald Trump https://t.co/ipZOHUrVvm",
  "data/tweet-wsj/2022/6/1532395386501054464.json": "As Queen Elizabeth II marks 70 years on the throne for her platinum jubilee, take a look at past celebrations of the British monarchy—from the U.K. to Jamaica https://t.co/am0hYTGyES",
  "data/tweet-wsj/2022/6/1532444464085712902.json": "LeBron James is officially a billionaire. The NBA superstar has a net worth of $1.2 billion based on endorsements, business ventures, cash and investments, according to Forbes. He is the first active NBA player to reach the milestone. https://t.co/PoDlvjrL3A",
  "data/tweet-wsj/2022/6/1532439821725188104.json": "A 16-year-old boy was arrested after he plotted to carry out a mass shooting and a bombing at a high school in Berkeley, Calif., authorities said https://t.co/L8b4iOCBP7",
  "data/tweet-wsj/2022/6/1532422850686201856.json": "More than two-thirds of Americans want to uphold Roe v. Wade and 57% say a woman should be able to get an abortion for any reason, a WSJ poll finds https://t.co/hFycxumafv",
  "data/tweet-wsj/2022/6/1532418044475101184.json": "Tesla and SpaceX employees are required to spend at least 40 hours a week in the office, Elon Musk said this week in emails to staff https://t.co/L3wfbXpFdL",
  "data/tweet-wsj/2022/6/1532512126392205325.json": "President Biden called on Congress Thursday to reduce gun violence by reinstating an assault-weapons ban and raising the age to purchase firearms from 18 to 21, among other changes: “These are rational, common-sense measures.” https://t.co/9wvezdM5yu",
  "data/tweet-wsj/2022/6/1532524073581944842.json": "Sheryl Sandberg’s departure from Meta coincides with a company investigation into her activities, including a review of her use of corporate resources to help plan her coming wedding https://t.co/LRAGJr7AVu",
  "data/tweet-wsj/2022/6/1532520000245882880.json": "Johnny Depp has been the face of Dior’s Sauvage cologne since 2015. After his victory in court this week, fans are snatching up the fragrance. https://t.co/tDo7q4cEDw",
  "data/tweet-wsj/2022/6/1532550203169034241.json": "To help Ukraine export its wheat, Poland is scouring Europe for spare train wagons, encouraging truck companies to send drivers east and dispatching leaders to reassure far-off countries desperate for wheat https://t.co/IeqtuqJh7S",
  "data/tweet-wsj/2022/6/1532542410756079647.json": "“For God’s sake, how much more carnage are we willing to accept?” President Biden called on Congress to reinstate a ban on assault-style weapons, or—failing that—raise the minimum age to purchase such firearms to 21 https://t.co/8APUrzmIMn",
  "data/tweet-wsj/2022/6/1532535064663400449.json": "American teenager Coco Gauff captivated tennis during her breakthrough run at Wimbledon at age 15. Now she’s made the French Open final at 18—and will face World No. 1 sensation Iga Swiatek. Sports columnist @jasongay previews the matchup. https://t.co/NHWcquxvMK",
  "data/tweet-wsj/2022/6/1532452014780825609.json": "The White House is going to start paying its interns for the first time ever. Starting this fall, they will earn $750 a week over a 14-week program. https://t.co/GpJf7JMlRY",
  "data/tweet-wsj/2022/6/1532331210181066755.json": "Ukrainian security services are hunting down citizens they view as abetting Russia in a region where some Ukrainians still side with Moscow despite the war https://t.co/meQUgTEuNS",
  "data/tweet-wsj/2022/6/1532561482092879878.json": "A 16-year-old boy was arrested after he plotted to carry out a mass shooting and a bombing at a high school in Berkeley, Calif., authorities said https://t.co/klL5eIKpv0",
  "data/tweet-wsj/2022/6/1532361463238742018.json": "After beating Scotland 3-1,  Ukraine is now one victory from a spot in the World Cup. But what normally would have prompted a city-wide celebration was met with eerie silence across Kyiv. https://t.co/wvQepHeOKr",
  "data/tweet-wsj/2022/6/1532572829274804234.json": "When ducklings line up behind their mother and paddle, they are employing sophisticated physics to reduce surface resistance. Looking cute is a side benefit. https://t.co/jrGFDHNmZj",
  "data/tweet-wsj/2022/6/1532538827746721794.json": "From @WSJopinion: Are we doomed to high inflation for years? No. Depending on the details of timing, inflation will fall as quickly and dramatically as it rose. We’ve seen it happen before, writes Alan Blinder https://t.co/86yK2IQevi",
  "data/tweet-wsj/2022/6/1532516193290027021.json": "The Commodity Futures Trading Commission on Thursday sued the crypto company owned by the billionaire Winklevoss brothers, saying it misled regulators as part of an effort to gain approval for bitcoin futures in 2017 https://t.co/GwXlKnApeo",
  "data/tweet-wsj/2022/6/1532595458148794368.json": "President Biden says he “can’t take immediate action” to lower record-high gasoline prices https://t.co/jCG4KtPcAc",
  "data/tweet-wsj/2022/6/1532603043463712768.json": "Sheryl Sandberg’s departure from Meta coincides with a company investigation into her activities, including a review of her use of corporate resources to help plan her coming wedding https://t.co/RNy4ApmhEZ",
  "data/tweet-wsj/2022/6/1532701836850905088.json": "The U.S. economy added 390,000 jobs in May, extending a yearlong streak of strong gains. The jobless rate remained at 3.6%. https://t.co/wxYWCDIuyD",
  "data/tweet-wsj/2022/6/1532644521388957698.json": "To help Ukraine export its wheat, Poland is scouring Europe for spare train wagons, encouraging truck companies to send drivers east and dispatching leaders to reassure far-off countries desperate for wheat https://t.co/Bi6dcEKiSb",
  "data/tweet-wsj/2022/6/1532621877121896449.json": "China nears launch of advanced aircraft carrier, satellite images show; ship will enable China to project military power globally, analysts say https://t.co/Pcu1cL1iJt",
  "data/tweet-wsj/2022/6/1532753533551910913.json": "Federal prosecutors have charged former Trump White House official Peter Navarro with contempt of Congress for defying a subpoena from the House committee investigating the Jan. 6, 2021. attack on the U.S. Capitol https://t.co/tre6eAgmED",
  "data/tweet-wsj/2022/6/1532742668584984578.json": "Our reporter drove from New Orleans to Chicago and back to test the feasibility of taking a road trip in an EV. She wouldn’t do it again soon. https://t.co/WkagGa6QWK",
  "data/tweet-wsj/2022/6/1532721766174433281.json": "U.S. employers added 390,000 jobs in May, beating many economists’ expectations and extending a yearslong streak of strong gains in the labor market #WSJWhatsNow https://t.co/wcYuNSy6sZ https://t.co/9rHaf7uals",
  "data/tweet-wsj/2022/6/1532734177501663232.json": "Harini Logan, a 14-year-old from San Antonio, won the Scripps National Spelling Bee after correctly spelling 22 words as part of the competition’s first-ever spell-off https://t.co/9PNhTPYvpP",
  "data/tweet-wsj/2022/6/1532640797199327233.json": "JPMorgan CEO Jamie Dimon said U.S. consumers still have some six to nine months of spending power in their bank accounts but warned of tumult ahead https://t.co/3pIlKrz6Oo",
  "data/tweet-wsj/2022/6/1532497328669708292.json": "Ohio Gov. Mike DeWine plans to sign a bill reducing training requirements for teachers and other staff to carry guns in schools https://t.co/w80EyS28zF",
  "data/tweet-wsj/2022/6/1532716271267094528.json": "Al Horford had played more playoff games than anyone in NBA history without making the finals. On Thursday, he helped the Celtics take a 1-0 lead over Golden State. https://t.co/FGs6XrtQ3O",
  "data/tweet-wsj/2022/6/1532772878000738304.json": "From @WSJopinion: The Supreme Court has a chance to send a message to judges on rewriting election law in the middle of the game https://t.co/BduPvsnBl8",
  "data/tweet-wsj/2022/6/1532871016309043200.json": "Our reporter drove from New Orleans to Chicago and back to test the feasibility of taking a road trip in an EV. She wouldn’t do it again soon. https://t.co/Vj8y8I8uHX",
  "data/tweet-wsj/2022/6/1532897441703514115.json": "Twitter said the window has closed for antitrust regulators to block Elon Musk’s proposed $44 billion acquisition of the social-media company https://t.co/aRCYS7IgO2",
  "data/tweet-wsj/2022/6/1532917561423278080.json": "She was given a chance to plead for leniency. Instead she read testimony of the tanks, blood and dead bodies of Tiananmen Square. https://t.co/5jRCNkWaTg",
  "data/tweet-wsj/2022/6/1532927642667831299.json": "She was given a chance to plead for leniency. Instead she read testimony of the tanks, blood and dead bodies of Tiananmen Square. https://t.co/sttWLaePOC",
  "data/tweet-wsj/2022/6/1532920111140569089.json": "Sheryl Sandberg’s departure from Meta coincides with a company investigation into her activities, including a review of her use of corporate resources to help plan her coming wedding https://t.co/fo74fLBget",
  "data/tweet-wsj/2022/6/1532908777023979522.json": "From @WSJopinion: The Democrat Party, once a natural home for millions of Catholics, is now utterly hostile, writes Jayd Henricks  https://t.co/gLSIzUUOYQ",
  "data/tweet-wsj/2022/6/1532765333873991681.json": "For the first time, no public memorials will be held in Hong Kong to commemorate the 1989 Tiananmen Square massacre amid a national security crackdown https://t.co/NBxhvKGXIv",
  "data/tweet-wsj/2022/6/1532954050081300480.json": "From @WSJopinion: John Durham did more than expose Hillary Clinton’s dirty political tricks. He exposed the incestuous elite Washington world that enabled those tricks to succeed, writes @KimStrassel. https://t.co/70fQGc8rWL",
  "data/tweet-wsj/2022/6/1532488499961774080.json": "From @WSJopinion: Out of a single sentence barring discrimination on the basis of sex, the Biden administration is illegally rewriting federal law to erase women and undermine constitutional liberties, write Jennifer C. Braceras and Inez Feltscher Stepman https://t.co/tKt157IzP6",
  "data/tweet-wsj/2022/6/1532697380386230275.json": "Activist investors are asking companies to take a stand on abortion rights, forcing asset managers including BlackRock and Vanguard to confront the issue  https://t.co/4R0bb4Ggyn",
  "data/tweet-wsj/2022/6/1533059758520934400.json": "For the first time, no public memorials will be held in Hong Kong to commemorate the 1989 Tiananmen Square massacre amid a national security crackdown https://t.co/sXVvFKLxiP",
  "data/tweet-wsj/2022/6/1533048460559233026.json": "When ducklings line up behind their mother and paddle, they are employing sophisticated physics to reduce surface resistance. Looking cute is a side benefit. https://t.co/0NPlOArkED",
  "data/tweet-wsj/2022/6/1533033363237478402.json": "One hundred days after Russia invaded Ukraine, Moscow’s rosy view of the conflict clashes with the reality of its predicament https://t.co/XsC4ypYiSR",
  "data/tweet-wsj/2022/6/1533093763601555456.json": "World No. 1 Iga Swiatek of Poland defeated American Coco Gauff at the French Open final to claim her second major title https://t.co/oOGotwoXGq",
  "data/tweet-wsj/2022/6/1533127706736574466.json": "For the first time, scientists have identified the entire genetic makeup of a victim of the deadly Mount Vesuvius eruption nearly 2,000 years ago https://t.co/vUkKUZvFLI",
  "data/tweet-wsj/2022/6/1533052223617376259.json": "The developer of the American Dream mega mall in New Jersey has failed to make its semiannual interest payment on an $800 million municipal bond https://t.co/g6425dNHYU",
  "data/tweet-wsj/2022/6/1533139037585907719.json": "Hong Kong police barricaded a park that has been the site of annual vigils for victims of the Tiananmen Square Massacre, but hundreds of people defiantly flowed around the park’s perimeter https://t.co/BFblYQiCk7",
  "data/tweet-wsj/2022/6/1533131563327795203.json": "Tesla employees are required to spend at least 40 hours a week in the office, Elon Musk said this week in an email to staff https://t.co/A7AXzitmvI",
  "data/tweet-wsj/2022/6/1532957861105606657.json": "A U.S. diplomat reached out to the British government over a deal for a chip factory in Wales. It's part of the quiet diplomacy taking shape in the U.S.-China Tech Cold War. https://t.co/eIe51LFRBJ",
  "data/tweet-wsj/2022/6/1533203220134346755.json": "From @WSJopinion: Clinical reports in China recount scores of cases in which organ donors were alive when operations began, write Jacob Lavee and Matthew P. Robertson https://t.co/gF1PGudVZ8",
  "data/tweet-wsj/2022/6/1533222124046925827.json": "After Disney’s recent battles Florida lawmakers, tens of thousands of visitors are heading to Disney World for an unofficial gathering of LGBT parkgoers known as Gay Day https://t.co/HKH3EbeK9x",
  "data/tweet-wsj/2022/6/1533042654686195715.json": "Gay Day comes as Disney navigates political, customer and employee tensions over lesbian, gay, bisexual and transgender issues https://t.co/YpuT4CrhKd",
  "data/tweet-wsj/2022/6/1533279964438708229.json": "When a customer is angry, hearing them out is the most important thing. Don’t be too quick to jump in with an explanation or even offer a fix. https://t.co/SmPNtImhY4",
  "data/tweet-wsj/2022/6/1533271150645628929.json": "Soccer player Alex Morgan and other female stars are taking control over their financial destinies. “We’ve been undervalued as athletes our whole lives.” https://t.co/gu9Hw0w9uS",
  "data/tweet-wsj/2022/6/1533293807143469059.json": "Congratulations, you've hired someone to fill that open job. Next challenge is to get that person to actually show up. https://t.co/GbB0F2675O",
  "data/tweet-wsj/2022/6/1533320233477365760.json": "The number of U.S. residents in Portugal climbed by 45% last year. Here's what to know about why so many Americans are making the country their home base. https://t.co/1xFFr4kv7B",
  "data/tweet-wsj/2022/6/1533403288007237632.json": "Ukrainian forces have retaken parts of Severodonetsk, boosting hopes they can hold off the Russian offensive in Donbas as Kyiv awaits long-range rocket systems from the U.S. https://t.co/8Hhz8n7saj",
  "data/tweet-wsj/2022/6/1533350421200240640.json": "The global energy trade is turning into a geopolitical contest that will drive up the costs of oil and gas for much of the world. https://t.co/URj5d0SLoS",
  "data/tweet-wsj/2022/6/1533473029229092876.json": "Rafael Nadal has won the French Open for the 14th time, defeating Casper Ruud, securing his 22nd Grand Slam title https://t.co/tmi2PRDSJf",
  "data/tweet-wsj/2022/6/1533456481466650624.json": "Daniel Enriquez’s family left New York during a crime wave in 1980, but he moved back in the 1990s. Last month, the Goldman Sachs worker was shot and killed by a stranger on the subway:  “He came back, and it cost him his life.\" https://t.co/dUskd0VYAg",
  "data/tweet-wsj/2022/6/1533410869819891719.json": "From @WSJopinion: The Durham jury convicts the FBI. In the Russiagate case, it seems the agency wanted to be lied to, writes @HolmanJenkins. https://t.co/HJdMpSMNUG",
  "data/tweet-wsj/2022/6/1533482551771381761.json": "One of China’s biggest online influencers stepped on a political land mine while promoting an ice-cream product, sparking a wave of curiosity about the 1989 Tiananmen Square crackdown https://t.co/BXGpE4GDJE",
  "data/tweet-wsj/2022/6/1533467443993133057.json": "The developer of the American Dream mega mall in New Jersey has failed to make its semiannual interest payment on an $800 million municipal bond https://t.co/UCxDgBTXVb",
  "data/tweet-wsj/2022/6/1533516547683131392.json": "Elon Musk’s battle with bots on Twitter is personal: One estimate says spam, fake or inactive accounts make up the vast majority of his 95 million followers. https://t.co/bjamuON7PS",
  "data/tweet-wsj/2022/6/1533478804437483520.json": "The number of children dying by suicide has risen dramatically in recent years, leaving parents and experts searching for explanations: “I’m never going to make any sense of it.\" https://t.co/HakyeQ7b3I",
  "data/tweet-wsj/2022/6/1533395711215161346.json": "After Russia’s blockade of Black Sea routes, Ukraine is looking for alternative shipping options to help stave off global food shortages. The endeavor, however, is far from straightforward. https://t.co/R8IJJvDpVY",
  "data/tweet-wsj/2022/6/1533501442123767810.json": "From @WSJopinion: \"Top Gun: Maverick” crushed box-office debut records over Memorial Day weekend, and it’s worth asking why https://t.co/e8MwPYv0K4",
  "data/tweet-wsj/2022/6/1533552967231623170.json": "Gunmen killed dozens of worshipers, including children, in a shooting at a Sunday church service in southwestern Nigeria, in the latest example of spiraling religious violence in Africa’s most populous nation https://t.co/Gcf2brN4f4",
  "data/tweet-wsj/2022/6/1533550494777593857.json": "Ukraine’s farms are expected to produce around 30 million tons of wheat, corn and other food commodities this year, and they are seeking alternative routes to export those grains to stave off global food shortages. https://t.co/SY7mxfLwz9",
  "data/tweet-wsj/2022/6/1533569386266730498.json": "“Top Gun: Maverick” flew high again at the domestic box office this weekend with one of the strongest second-week performances ever https://t.co/c4foO6f0e4",
  "data/tweet-wsj/2022/6/1533531610968211458.json": "Queen Elizabeth II’s limited appearances at her jubilee celebration—with her son standing in for her—serves as a template for the final chapter of her reign https://t.co/ZgqRlVB1PQ",
  "data/tweet-wsj/2022/6/1533573151665291264.json": "Daniel Enriquez’s family left New York during a crime wave in 1980, but he moved back in the 1990s. Last month, the Goldman Sachs worker was shot and killed by a stranger on the subway:  “He came back, and it cost him his life.\" https://t.co/mFK0jqp77b",
  "data/tweet-wsj/2022/6/1533618444268195840.json": "Queen Elizabeth II’s limited appearances at her jubilee celebration—with her son standing in for her—serves as a template for the final chapter of her reign https://t.co/lkpl8NynaD",
  "data/tweet-wsj/2022/6/1533645587496804354.json": "The U.S. won’t impose new tariffs on solar imports for two years, in a move aimed at reviving stalled solar power projects, people familiar say https://t.co/OzJvcCu1Rs",
  "data/tweet-wsj/2022/6/1533663735885217794.json": "Desertions. Refusing orders. Moscow has a military problem on its hands. https://t.co/PZOeox8ENr",
  "data/tweet-wsj/2022/6/1533576931312123905.json": "The developer of the American Dream mega mall in New Jersey has failed to make its semiannual interest payment on an $800 million municipal bond https://t.co/lZGz2023iv",
  "data/tweet-wsj/2022/6/1533607137460486144.json": "One of China’s biggest online influencers stepped on a political land mine while promoting an ice-cream product, sparking a wave of curiosity about the 1989 Tiananmen Square crackdown https://t.co/7ceCI1Phfp",
  "data/tweet-wsj/2022/6/1532995605081075714.json": "In the 100 days since Russia launched a full-scale war on Ukraine, the death and destruction continues with no end in sight. From casualties and refugees to poverty and sanctions, here is a look at key metrics measuring the devastation. https://t.co/qhoVEAVgsY",
  "data/tweet-wsj/2022/6/1533610896630620162.json": "Bosses reward people who speak up in meetings. How can you avoid passing over the quietly productive? Behavioral economist Dan Ariely has the answers. https://t.co/m3Dc2Ot7Q1",
  "data/tweet-wsj/2022/6/1533693932281946112.json": "After Disney’s recent battles Florida lawmakers, tens of thousands of visitors are heading to Disney World for an unofficial gathering of LGBT parkgoers known as Gay Day https://t.co/XUv3ZWPuwg",
  "data/tweet-wsj/2022/6/1533754343144529920.json": "Ukrainian President Volodymyr Zelensky visited the front lines of the fighting in the eastern Luhansk region, miles from where a Russian general was killed, highlighting the shifting military situation in the area https://t.co/vdkVgBizAJ",
  "data/tweet-wsj/2022/6/1533667559861542912.json": "Take an early look at the front page of The Wall Street Journal https://t.co/G7fxGNp1Lv https://t.co/0zMgmyuOWO",
  "data/tweet-wsj/2022/6/1533801334562070528.json": "Breaking: Elon Musk threatened to end his deal to buy Twitter, accusing the company of not complying with his request for data on its spam and fake accounts https://t.co/U4d9XMyAX1",
  "data/tweet-wsj/2022/6/1533814738966220801.json": "A new study of an AstraZeneca breast-cancer drug showed it cut the risk of tumor progression by half for people with the most advanced form of the disease https://t.co/JqkGB46b2g",
  "data/tweet-wsj/2022/6/1533829833385512962.json": "The White House plans to waive some solar import tariffs to ensure supply while invoking the Defense Production Act to boost domestic manufacturing https://t.co/R4160EjHfL",
  "data/tweet-wsj/2022/6/1533856280971968513.json": "U.S. authorities filed documents to seize two planes owned by Russian oligarch Roman Abramovich, saying that the planes were manufactured in the U.S. and are subject to U.S. sanctions imposed in the wake of Russia’s invasion of Ukraine https://t.co/BpycUERDbj",
  "data/tweet-wsj/2022/6/1533902313114542083.json": "Twitter is being investigated by the Texas attorney general over its number of fake accounts \n https://t.co/Ynsc794ziO",
  "data/tweet-wsj/2022/6/1533546744679636993.json": "San Francisco District Attorney Chesa Boudin won office in 2019 promising radical change. Voters, fed up with crime, decide Tuesday if they still like the idea. https://t.co/yEXZsg35xT",
  "data/tweet-wsj/2022/6/1533911400468426753.json": "Former Proud Boys leader Enrique Tarrio and four other members of the far-right group have been indicted on seditious conspiracy charges in connection with the U.S. Capitol riot https://t.co/W1AMFfsEc9",
  "data/tweet-wsj/2022/6/1533882694345670656.json": "Our reporter drove from New Orleans to Chicago and back to test the feasibility of taking a road trip in an EV. She wouldn’t do it again soon. https://t.co/WwreScpAO1",
  "data/tweet-wsj/2022/6/1534011034087968768.json": "Twitter is being investigated by the Texas attorney general over its number of fake accounts https://t.co/S57XLKyl5i",
  "data/tweet-wsj/2022/6/1534003488648224769.json": "Brazil has ordered a Navy search team to scour a remote corner of the Amazon rainforest near Peru Monday, after British journalist Dom Phillips went missing with one of the country’s top indigenous experts https://t.co/0rhyelpmS2",
  "data/tweet-wsj/2022/6/1533906591531118592.json": "Boris Johnson survived a no-confidence vote, but the margin of victory suggests the U.K. prime minister's hold on the Conservative Party remains tenuous https://t.co/hZghIo73y1",
  "data/tweet-wsj/2022/6/1534007294773448705.json": "Former Proud Boys leader Enrique Tarrio and four other members of the far-right group have been indicted on seditious conspiracy charges in connection with the U.S. Capitol riot https://t.co/MN8Pll6mDN",
  "data/tweet-wsj/2022/6/1534022378526760960.json": "Our reporter drove from New Orleans to Chicago and back to test the feasibility of taking a road trip in an EV. She wouldn’t do it again soon. https://t.co/WrxIS2HWJW",
  "data/tweet-wsj/2022/6/1533965753581551618.json": "The company that makes Tasers is scrapping plans to develop drones to incapacitate mass shooters after nine of the 13 members of its ethics advisory board resigned over objection to the project https://t.co/qP7O6M8eyl",
  "data/tweet-wsj/2022/6/1534060142995689472.json": "Desertions. Refusing orders. Moscow has a military problem on its hands. https://t.co/qcdxNuPj6U",
  "data/tweet-wsj/2022/6/1534129087614164993.json": "Target warned profits would drop this year because it bought too many goods. It's the latest sign of the sudden supply-and-demand mismatch at U.S. stores https://t.co/rHK52T77uB",
  "data/tweet-wsj/2022/6/1534173374687084545.json": "A teenager with Down syndrome escaped besieged Mariupol as his mother wove a motivational fantasy that John Cena lay at the end of their dangerous journey out of Ukraine. The fantasy ended with a happy reality. https://t.co/2VNo30ELpQ",
  "data/tweet-wsj/2022/6/1534124271689162752.json": "An estimated 200,000 children of immigrants on work visas don’t have a clear legal path to stay in the U.S. once they turn 21 https://t.co/1nQU59JbPy",
  "data/tweet-wsj/2022/6/1534188481714462720.json": "Thousands of workers in the U.K. are beginning a four-day workweek this week, one of the largest tests to date of whether employees can accomplish just as much—for the same pay—in fewer hours https://t.co/WOFIiwAOD3",
  "data/tweet-wsj/2022/6/1534118714299363329.json": "Russia walked out of a Security Council meeting after EU officials blamed Moscow for global food crisis https://t.co/8yaktPPBYk",
  "data/tweet-wsj/2022/6/1533820219994607617.json": "The Supreme Court ruled unanimously that airline baggage handlers can’t be compelled to resolve employment disputes through individual private arbitration. The decision could have implications for drivers hired by companies such as Amazon and Uber. https://t.co/7t2jMlndvn",
  "data/tweet-wsj/2022/6/1534222443753226243.json": "No more tacked-on fees and surcharges when fans search for a live-event ticket in the state of New York: Lawmakers passed a bill that makes pricing for concerts, Broadway shows or sporting events “all-in” https://t.co/mKRydMoHOW",
  "data/tweet-wsj/2022/6/1534207329222201344.json": "“Biologically, a bee is clearly not a fish.” Legally, at least in California, bumblebees are close enough for protection under a law written for fish. https://t.co/rgT9vSJGUb",
  "data/tweet-wsj/2022/6/1534075242787782656.json": "From @WSJopinion: The revelations from the Sussmann trial make it abundantly likely that Hillary Clinton not only knew about but led the entire smear campaign to tie Trump to Russia, write @DouglasESchoen and Andrew Stein https://t.co/WIClrbK4TB",
  "data/tweet-wsj/2022/6/1534233761319202817.json": "David Bowie released the Ziggy Stardust album 50 years ago this month. Music and pop culture have never been the same. https://t.co/O2Aewtiaff",
  "data/tweet-wsj/2022/6/1534290389393350658.json": "Saudi Arabia is engaging in serious talks with Israel to build business ties and create new security arrangements as the conservative Islamic kingdom senses a shift among its public in favor of establishing official ties with the majority Jewish state https://t.co/1BCWqMH2ce",
  "data/tweet-wsj/2022/6/1534052607542628354.json": "Apple has introduced changes to iMessage, including an undo-send function and the ability to edit texts, plus a new MacBook Air, a buy-now-pay-later feature integrated into its Apple Pay offering and the promise of expanding CarPlay https://t.co/IY1WrRmNx9",
  "data/tweet-wsj/2022/6/1534286612179329024.json": "Experts advising the FDA endorsed Novavax’s Covid-19 vaccine, voting overwhelmingly that the shot’s benefits outweighed its risks. The agency is expected to next decide on authorizing the shot. https://t.co/JNy5TgcSIh",
  "data/tweet-wsj/2022/6/1534260189179924482.json": "Apple products such as iPhones with the company's proprietary Lightning charger ports face a potential ban in the EU that would make USB Type-C chargers the standard https://t.co/lFhgzP4KCD",
  "data/tweet-wsj/2022/6/1534362092056231940.json": "David Bowie released the Ziggy Stardust album 50 years ago this month. Music and pop culture have never been the same. https://t.co/VzEkRTugMd",
  "data/tweet-wsj/2022/6/1534373412159868930.json": "A teenager with Down syndrome escaped besieged Mariupol as his mother wove a motivational fantasy that John Cena lay at the end of their dangerous journey out of Ukraine. The fantasy ended with a happy reality. https://t.co/l1XdAxp5n8",
  "data/tweet-wsj/2022/6/1534358321364336641.json": "From @WSJopinion: Can pot make people violent? There could be a connection between cannabis and the violent crime surge, writes @AllysiaFinley https://t.co/7BdlnRVKYV",
  "data/tweet-wsj/2022/6/1534301728153157632.json": "Treasury Secretary Janet Yellen warned that the U.S. is likely facing a prolonged period of elevated inflation https://t.co/EG3bwQp3MP",
  "data/tweet-wsj/2022/6/1534390342254047234.json": "San Francisco District Attorney Chesa Boudin was recalled by voters Tuesday, according to an Associated Press projection, in a blow to the progressive prosecutors movement https://t.co/91voVdjD7d",
  "data/tweet-wsj/2022/6/1534404869397831680.json": "Walmart heir Rob Walton has agreed to buy the Denver Broncos for $4.65 billion—a price that shatters the record for the most expensive sale of a North American sports franchise https://t.co/hB9cot5kA7",
  "data/tweet-wsj/2022/6/1534347000610799616.json": "Senior U.S. cyber officials have urged companies to remain on high alert for cyberattacks as a consequence of Russia’s war in Ukraine, saying the warnings are based on intelligence assessments of potential strikes https://t.co/pDsZBkGZja",
  "data/tweet-wsj/2022/6/1534369660489109511.json": "Three Arizona police officers were placed on administrative leave after allegedly witnessing a man drowning without diving in the water to save him, according to officials and video footage of the incident https://t.co/tFkxMTh813",
  "data/tweet-wsj/2022/6/1534486677032427520.json": "Russia’s lengthening war with Ukraine will lead to a near doubling of inflation rates in rich countries this year and threaten food shortages in poorer countries, according to a new study from the OECD https://t.co/bVf1bvBSmq",
  "data/tweet-wsj/2022/6/1534526356490428416.json": "Gymnasts, including Simone Biles, and other women filed claims against the FBI seeking $1 billion over the handling of the Larry Nassar sexual-abuse case https://t.co/D7tWnsSyFQ",
  "data/tweet-wsj/2022/6/1534555104749182980.json": "An armed man who made threats against Supreme Court Justice Brett Kavanaugh was arrested near the justice's home, the court said https://t.co/XwhnXwpB4w",
  "data/tweet-wsj/2022/6/1534491939889991681.json": "Moderna said a modified Covid-19 booster shot provided a stronger immune response against Omicron than the company’s original vaccine in a new study https://t.co/GKHc6qJvtl",
  "data/tweet-wsj/2022/6/1534562671617515521.json": "Miah Cerrillo, a fourth-grade student who survived the mass shooting in Uvalde, Texas, delivered remarks via video at a House hearing on gun violence https://t.co/GwIT84yxrD",
  "data/tweet-wsj/2022/6/1534524423046324225.json": "The hit reality TV show \"Live PD,\" which followed police live, is getting a second life on the Reelz cable network after A&amp;E canceled the program following the 2020 killing of George Floyd https://t.co/HwGN9g08FC",
  "data/tweet-wsj/2022/6/1534599914801573888.json": "A new bill in Washington, D.C., prohibits companies from punishing current and prospective employees by denying them roles or promotions because of a failed marijuana test https://t.co/hySoxaETIS",
  "data/tweet-wsj/2022/6/1534607476418654208.json": "Fourth-grade Robb Elementary School student Miah Cerrillo testified Wednesday about the attack in Uvalde, Texas, last month that left 19 of her classmates and two teachers dead, telling Congress she doesn’t feel safe in school anymore https://t.co/4XpSBljZqg",
  "data/tweet-wsj/2022/6/1534569733374214144.json": "From @WSJopinion: A new secret Chinese military base in Cambodia ought to wake up America’s political class—including the U.S. Navy brass—to what is fast becoming a global Chinese challenge https://t.co/gHWxFDQ78Z",
  "data/tweet-wsj/2022/6/1534616802738700290.json": "The man arrested near Brett Kavanaugh's house was charged with attempted murder. Authorities said he was carrying a gun, a knife, pepper spray and zip ties. https://t.co/Qe53MTlb2j",
  "data/tweet-wsj/2022/6/1534690503605768196.json": "The recall of San Francisco District Attorney Chesa Boudin offered new evidence that Democrats are at risk if they look soft on crime in this year’s midterm elections, even in the nation’s most liberal areas https://t.co/kYSPnVibJ2",
  "data/tweet-wsj/2022/6/1534630109713399814.json": "Retired Marine Gen. John Allen is under FBI investigation for allegedly trying to help Qatar navigate a diplomatic crisis in 2017 and then covering up that he did so, according to a new FBI affidavit https://t.co/y7s1Paeozg",
  "data/tweet-wsj/2022/6/1534596186115538947.json": "From @WSJopinion: It’s well known that gun sales have surged in recent years, but less well known is that blacks have led the trend, writes @jasonrileywsj https://t.co/cjnRoCafED",
  "data/tweet-wsj/2022/6/1534747134133682176.json": "From @WSJopinion: Putin may have flubbed most of his war aims but he’s arguably achieving the most important, neutralizing Russia’s own urban, educated middle class, the real threat to his regime, writes @HolmanJenkins\nhttps://t.co/upUolpMDNq",
  "data/tweet-wsj/2022/6/1534618798732591105.json": "KPMG said it is no longer operating in Russia and Belarus, three months after it announced its intention to leave following the invasion of Ukraine https://t.co/X6gEJGPdu6",
  "data/tweet-wsj/2022/6/1534906657486036996.json": "The PGA Tour suspended 17 players, including Phil Mickelson and Dustin Johnson, for competing in the new rival, Saudi-backed LIV Golf circuit https://t.co/W7DmqAz9gL",
  "data/tweet-wsj/2022/6/1534777348372955138.json": "Two Georgia hospitals were hit with federal financial penalties for failing to disclose their prices, marking the first such enforcement action under federal rules that took effect in January 2021 https://t.co/dghHBDkmxF",
  "data/tweet-wsj/2022/6/1534885121907740673.json": "Workers filed 229,000 jobless claims last week, the largest total since January, adding to signs the labor market could be cooling a bit https://t.co/lPPmk5R9WZ",
  "data/tweet-wsj/2022/6/1534924554673565696.json": "From @WSJopinion: Everyone on the right and left should be denouncing political violence, and that starts with President Biden. The consequences of a Supreme Court assassination are horrible even to contemplate.\nhttps://t.co/02fG9sbOLD",
  "data/tweet-wsj/2022/6/1534944891951882241.json": "The FBI arrested a Republican candidate for Michigan governor. Ryan Kelley faces four charges in connection with the Jan. 6 Capitol riot. https://t.co/hpNcKy6avT",
  "data/tweet-wsj/2022/6/1534324352346472448.json": "Michael Barr, President Biden’s nominee to become the government’s most influential bank regulator, edged closer to being confirmed by the Senate after winning the support of Republican Sen. Pat Toomey https://t.co/BYeuscTM7L",
  "data/tweet-wsj/2022/6/1534927721947611137.json": "Auto-safety regulators escalated a probe into Tesla’s Autopilot after identifying six new crashes that occurred with first-responder vehicles https://t.co/aAeCiS2I0i",
  "data/tweet-wsj/2022/6/1534623047507922944.json": "Abbott was alerted to alleged safety problems at its biggest baby formula plant months earlier than previously known, people familiar with the matter say and documents show https://t.co/2eAtNBEG07",
  "data/tweet-wsj/2022/6/1535015170002542614.json": "NASA is building a team to study UFOs https://t.co/m70VwiMwyZ",
  "data/tweet-wsj/2022/6/1535000055907852288.json": "Negotiators don’t yet have an agreement on new laws to prevent gun violence that could pass the Senate, where any bill would need significant bipartisan support https://t.co/xJUGZG7uYZ",
  "data/tweet-wsj/2022/6/1535084253318365197.json": "Capitol Police Officer Caroline Edwards said she was near Officer Brian Sicknick during the Capitol riot when he was sprayed with a chemical and turned \"ghostly pale.\" Sicknick died the following night after suffering a stroke. https://t.co/4VXcnqHhZg",
  "data/tweet-wsj/2022/6/1535082559863930893.json": "U.S. Capitol Police and loved ones of officers who died after the Jan. 6 riot, including Sandra Garza, the long-time partner of Capitol Hill Police Officer Brian Sicknick, comforted each other during footage of the attack at Thursday's hearing https://t.co/vE987U1I58",
  "data/tweet-wsj/2022/6/1535080581230379034.json": "Capitol Police officer Caroline Edwards, who suffered a concussion during the Jan. 6 attack, testified at Thursday's hearing about her harrowing experience during the Capitol riot https://t.co/I5jEfFGfjB",
  "data/tweet-wsj/2022/6/1535076081140645891.json": "“Trump gave no order to deploy the National Guard that day, and made no effort to work with the Department of Justice to coordinate and deploy law enforcement assets,\" Rep. Liz Cheney said of Jan. 6, 2021. \"“But Mike Pence did each of those things.” https://t.co/JXIN6cJmX7",
  "data/tweet-wsj/2022/6/1535069123826294792.json": "Rep. Liz Cheney said that multiple Republican lawmakers, including Pennsylvania Rep. Scott Perry, \"sought presidential pardons for their roles in attempting to overturn the 2020 election.” A Perry aide called the allegation \"a ludicrous and soulless lie.\" https://t.co/tCVgzPTT2G",
  "data/tweet-wsj/2022/6/1535066295384801280.json": "In a video testimony, Ivanka Trump said that hearing that attorney general William Barr didn’t believe there was evidence of widespread voter fraud “affected my perspective. I respect Attorney General Barr, so I accepted what he was saying.” https://t.co/DDKzZMX450",
  "data/tweet-wsj/2022/6/1535064787209560067.json": "“It was crazy stuff and they were … doing a great, great disservice to the country,\" former Attorney General William Barr said in taped comments about allegations of widespread election fraud by former President Donald Trump. https://t.co/9wxoBXo39N",
  "data/tweet-wsj/2022/6/1535057873763442698.json": "Rep. Liz Cheney said the Jan. 6 hearings will include testimony that President Trump didn’t want to call off the riot or ask supporters to leave the Capitol, and was “aware of the rioters’ chants to ‘hang Mike Pence.'\" https://t.co/x0DhL9ln7y",
  "data/tweet-wsj/2022/6/1535030257983672332.json": "Facebook is re-examining its commitment to paying for news, prompting some news organizations to prepare for a potential revenue shortfall of tens of millions of dollars https://t.co/obDKNfQZns",
  "data/tweet-wsj/2022/6/1534917018268446721.json": "Agatha Christie became famous in the 1920s as a mystery writer. For younger generations, she’s the next hot thing. “The unique way of storytelling is something I think is very rare nowadays,” said one student who plans to read all her novels. https://t.co/eEAvDpwe9w",
  "data/tweet-wsj/2022/6/1535162419168829440.json": "The FBI arrested a Republican candidate for Michigan governor. Ryan Kelley faces four charges in connection with the Jan. 6 Capitol riot. https://t.co/KR3y5Q5pav",
  "data/tweet-wsj/2022/6/1535132187506446336.json": "The Jan. 6 panel presented emotional testimony and dramatic footage Thursday to connect former President Donald Trump’s actions to the Capitol attack. Here are six takeaways: https://t.co/WJ9AB0WWpE",
  "data/tweet-wsj/2022/6/1535022702662242312.json": "Xbox videogames are coming to Samsung smart TVs, with a gaming app that allows Microsoft Game Pass subscribers to play in the cloud using a Bluetooth-enabled controller https://t.co/Cb1BzyC1Kx",
  "data/tweet-wsj/2022/6/1535103068651540480.json": "Capitol Police Officer Caroline Edwards, who was injured in the Jan. 6 riot, testified about \"slipping in people's blood\" and \"hours of hand-to-hand combat\" during the attack https://t.co/dVVcBviJVr",
  "data/tweet-wsj/2022/6/1535238465998159875.json": "U.S. inflation reached a new four-decade high of 8.6% in May https://t.co/iT5EkVYITo",
  "data/tweet-wsj/2022/6/1535259693647548418.json": "Breaking: The U.S. will end Covid-19 testing requirements for air travelers coming to the country effective Sunday, a government official said https://t.co/GrznSBTJX7",
  "data/tweet-wsj/2022/6/1535318845690466304.json": "Breaking: Meta's lawyers are investigating Sheryl Sandberg's use of Facebook resources for personal projects going back several years, people familiar say https://t.co/C5gLFa04XH",
  "data/tweet-wsj/2022/6/1535377531595112450.json": "Justin Bieber says he has Ramsay Hunt syndrome, which is caused by a virus that can attack nerves and lead to facial paralysis. The 28-year-old singer has postponed a slate of concerts. https://t.co/piqp9WCyxX",
  "data/tweet-wsj/2022/6/1535372268188364800.json": "The SEC is investigating Goldman Sachs over its ESG funds, say people familiar with the matter https://t.co/HNwjDKgmVA",
  "data/tweet-wsj/2022/6/1535358468844146689.json": "Tesla plans a 3-for-1 stock split, joining other tech companies with lofty share prices in taking a step to make ownership more accessible to retail investors https://t.co/A7fyw6X7ar",
  "data/tweet-wsj/2022/6/1535373800593825792.json": "The Biden administration has abandoned former President Donald Trump’s proposal to alter Air Force One’s longstanding color scheme to red, white and blue https://t.co/XID3wLKB2H",
  "data/tweet-wsj/2022/6/1535343562396733440.json": "A gas station owner in Massachusetts has stopped selling in protest over the surging price of gasoline for his customers https://t.co/qQOp3tZ9VB",
  "data/tweet-wsj/2022/6/1535398521561661441.json": "The Biden administration plans to pursue a rule requiring tobacco companies to reduce nicotine levels in all cigarettes sold in the U.S. https://t.co/haRoAxv3L3",
  "data/tweet-wsj/2022/6/1535475675343241216.json": "U.S. inflation reached a new four-decade high of 8.6% in May https://t.co/K6MJXtpi4c",
  "data/tweet-wsj/2022/6/1535479483490344960.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/m11M4Wmfy2 https://t.co/QD4qylhOdA",
  "data/tweet-wsj/2022/6/1535430389203869697.json": "Meta's lawyers are investigating Sheryl Sandberg's use of Facebook resources for personal projects going back several years, people familiar with the matter say https://t.co/EzKdHOCjqC",
  "data/tweet-wsj/2022/6/1535494569193787392.json": "The Biden administration has abandoned former President Donald Trump’s proposal to alter Air Force One’s longstanding color scheme to red, white and blue https://t.co/uySMLwS4Ma",
  "data/tweet-wsj/2022/6/1535487032050470912.json": "Justin Bieber says he has Ramsay Hunt syndrome, which is caused by a virus that can attack nerves and lead to facial paralysis. The 28-year-old singer has postponed a slate of concerts. https://t.co/YFdYdQCZBr",
  "data/tweet-wsj/2022/6/1535554970413670401.json": "Take a look at the front page of today's Wall Street Journal https://t.co/3WCmLGeVVQ https://t.co/d0hIek1E7X",
  "data/tweet-wsj/2022/6/1534984608315588623.json": "A Michigan police officer was charged with second-degree murder in the shooting death of Patrick Lyoya, a Black man, after a traffic stop in Grand Rapids in April https://t.co/2uPCAaDUf3",
  "data/tweet-wsj/2022/6/1535592751735226368.json": "Desertions. Refusing orders. Moscow has a military problem on its hands. https://t.co/KmhwU9mL1i",
  "data/tweet-wsj/2022/6/1535604029199372289.json": "Hot-sauce lovers are going to be in for a rude awakening: A sriracha shortage is coming. https://t.co/JbkRRof4cJ",
  "data/tweet-wsj/2022/6/1535626691120447488.json": "Our reporter drove from New Orleans to Chicago and back to test the feasibility of taking a road trip in an EV. She wouldn’t do it again soon. https://t.co/gMa2runRZd",
  "data/tweet-wsj/2022/6/1535056587303407617.json": "In a videotaped deposition, former attorney general William Barr says he told former President Donald Trump during a tense December 2020 meeting that the widespread election fraud claims being made by his allies were “bullshit.\" https://t.co/MigPngeYq8",
  "data/tweet-wsj/2022/6/1534894357744128000.json": "The Biden administration is considering changes to a 2009 executive order detailing classification rules for national security information, amid a push in Washington to allow for greater disclosure of classified information https://t.co/gNHh2iZJVs",
  "data/tweet-wsj/2022/6/1535611583598141440.json": "Luxury watchmakers had their best ever year in 2021—by selling fewer watches https://t.co/MwoHNcqDHD",
  "data/tweet-wsj/2022/6/1535596488591556610.json": "Apple will approve borrowers and fund loans itself for its buy now, pay later offering rather than rely on a bank https://t.co/DmqoZc0IDo",
  "data/tweet-wsj/2022/6/1535577615792209920.json": "Murder rates didn’t soar only in cities during the pandemic. Homicide rates in rural America rose 25% in 2020, the largest rural increase since the CDC began tracking such data in 1999. https://t.co/pJHmAamqYF",
  "data/tweet-wsj/2022/6/1535649338914914304.json": "The number of U.S. residents in Portugal climbed by 45% last year. Here's what to know about why so many Americans are making the country their home base. https://t.co/3xBoTpOpkQ",
  "data/tweet-wsj/2022/6/1535397661129551872.json": "The Jan. 6 select House committee made clear in its first hearing that its main goal is showing Donald Trump was to blame for the attack on the Capitol, raising the question of what legal or political consequences he might face at the end of the probe https://t.co/V7lhSebETc",
  "data/tweet-wsj/2022/6/1535698466848006147.json": "A teenager with Down syndrome escaped besieged Mariupol as his mother wove a motivational fantasy that John Cena lay at the end of their dangerous journey out of Ukraine. The fantasy ended with a happy reality. https://t.co/nm7Qoz7h7D",
  "data/tweet-wsj/2022/6/1535622984098107395.json": "A surgeon lost his life savings. Others have given up on their dreams. All of them were swept up in crypto mania—and the crash. https://t.co/4IcYDykIXd",
  "data/tweet-wsj/2022/6/1535653124274278401.json": "Gun-control activists will march and rally in Washington, D.C., and in more than 400 other cities nationwide Saturday to demand Congress take action on proposed gun-control measures following a recent string of mass shootings https://t.co/IcpCtoE8gG",
  "data/tweet-wsj/2022/6/1535600260290170881.json": "Republican opposition to an assault-weapons ban and a Justice Department study showing the limited effects of a previous prohibition have left Democrats reluctant to try to revive the 1994 law https://t.co/3zR0CLVAXA",
  "data/tweet-wsj/2022/6/1535804121986514944.json": "Hot-sauce lovers are going to be in for a rude awakening: A sriracha shortage is coming. https://t.co/E4jyTOyJBh",
  "data/tweet-wsj/2022/6/1535777686076829697.json": "Justin Bieber says he has Ramsay Hunt syndrome, which is caused by a virus that can attack nerves and lead to facial paralysis. The 28-year-old singer has postponed a slate of concerts. https://t.co/l7zIa9mMKs",
  "data/tweet-wsj/2022/6/1535690879016501251.json": "From @WSJopinion: Most Americans would like to know more about the events of that horrible January day, to have a serious national debate, and to ensure it never happens again. But this committee isn’t a credible messenger, writes @KimStrassel. https://t.co/DaUxofqTuz",
  "data/tweet-wsj/2022/6/1535807873556615168.json": "“The Star-Spangled Banner” began as a remix of a popular 19th-century song, the equivalent of today’s viral memes or TikToks. https://t.co/2upajgQpLl",
  "data/tweet-wsj/2022/6/1535849419849060353.json": "Samples from the asteroid Ryugu contained amino acids that are considered the precursors of life, supporting a theory that solar-system rocks crashing into Earth helped jump-start primordial life-forms https://t.co/RzPASVbbgK",
  "data/tweet-wsj/2022/6/1535830524408758273.json": "Rural America, too, has seen a surge in violent crime. “I’ve never seen these numbers before,” said one South Carolina sheriff about homicides. https://t.co/IUroCmyWoi",
  "data/tweet-wsj/2022/6/1535841852250804226.json": "The days of the cookie-cutter flight attendant are coming to an end as airlines relax their appearance standards to allow for tattoos, piercings and sneakers https://t.co/7Txt1zaEyZ",
  "data/tweet-wsj/2022/6/1535947546966769664.json": "From @WSJopinion: Can pot make people violent? There could be a connection between cannabis and the violent crime surge, writes @AllysiaFinley https://t.co/leNrMR9weW",
  "data/tweet-wsj/2022/6/1535940263859957761.json": "Russian forces shelled a chemical plant where civilians had taken shelter, a Ukrainian official said, as the bloody battle for the eastern city of Severodonetsk raged on https://t.co/Ie3lIv4pc9",
  "data/tweet-wsj/2022/6/1536012963932413953.json": "Idaho police arrested 31 people believed to be part of the white nationalist group Patriot Front—equipped with shields, shin guards and other riot gear—near an annual LGBT pride event Saturday https://t.co/wneJrGamWq",
  "data/tweet-wsj/2022/6/1536038162392584192.json": "From @WSJopinion: It’s well known that gun sales have surged in recent years, but less well known is that blacks have led the trend, writes @jasonrileywsj https://t.co/JSGw6fSAkm",
  "data/tweet-wsj/2022/6/1536060837030412292.json": "Rural America, too, has seen a surge in violent crime. “I’ve never seen these numbers before,” said one South Carolina sheriff about homicides. https://t.co/Fck2tII5UA",
  "data/tweet-wsj/2022/6/1536102309767397378.json": "From @WSJopinion: The biggest risk to children comes from disruptions in their schooling. We will be cleaning up the school-closing mess for years, and fomenting baseless fear only makes the task harder, writes @DrJBhattacharya. https://t.co/KuEBHiCkzg",
  "data/tweet-wsj/2022/6/1536124966273437697.json": "Google suspended an engineer who contended that an artificial-intelligence chatbot the company developed had become sentient, telling him that he had violated the company’s confidentiality policy after it dismissed his claims. https://t.co/vE069Y3UMP",
  "data/tweet-wsj/2022/6/1536143834631000064.json": "Google agreed to pay $118 million to settle a lawsuit claiming the tech giant had discriminated against women in pay and promotions https://t.co/lom6Mbr6VD",
  "data/tweet-wsj/2022/6/1536093598118252545.json": "The bipartisan proposal to curb gun violence aims to crack down on illegal gun sales, funds mental health programs and school security, and includes juvenile records in background checks for gun buyers under 21 https://t.co/An3n62LJl7",
  "data/tweet-wsj/2022/6/1536019484812754945.json": "Senators have reached a bipartisan deal to address gun violence, announcing legislative framework focusing on mental health, school security and red-flag laws https://t.co/o6ogakDPTd",
  "data/tweet-wsj/2022/6/1536192902078124032.json": "NASA is assembling researchers to examine “unidentified aerial phenomena,” commonly known as UFOs. The study is expected to take about nine months. https://t.co/lPlnhlR4oF",
  "data/tweet-wsj/2022/6/1536216821073858560.json": "One of the largest crypto lenders, Celsius Network, told users it is pausing all withdrawals, swaps, and transfers between accounts due to “extreme market conditions.” https://t.co/rPYAUQ6kbS",
  "data/tweet-wsj/2022/6/1536215563734814721.json": "Ukraine’s fate will largely depend on how fast and in what quantities new heavy weapons arrive from the U.S. and its allies https://t.co/VceHaD817d",
  "data/tweet-wsj/2022/6/1536309935763558407.json": "No one is sure why Japan’s Covid-19 death rate is lower than other wealthy nations, but mask-wearing and low obesity might play a role https://t.co/5FpIaVr9pd",
  "data/tweet-wsj/2022/6/1536336044261531648.json": "“Squid Game” is coming back. Netflix confirmed the popular dystopian drama will return for a second season and said work on the episodes was still in its early stages, but didn't include a planned release date. https://t.co/h7PcKr0xVJ",
  "data/tweet-wsj/2022/6/1536341256388939777.json": "The Dow dropped about 550 points and Treasury yields surged on inflation worries. The S&amp;P 500 slid 2.2%, putting it in bear-market territory. https://t.co/3QD4j5Q6ie",
  "data/tweet-wsj/2022/6/1536302382488948736.json": "Ukraine’s fate will largely depend on how fast and in what quantities new heavy weapons arrive from the U.S. and its allies https://t.co/OYifvT1Dhl",
  "data/tweet-wsj/2022/6/1536428571257974784.json": "High inflation is likely to lead the Fed to consider surprising markets with a larger-than-expected 0.75-percentage-point rate increase this week https://t.co/VOUZs3Liae",
  "data/tweet-wsj/2022/6/1536396748532420609.json": "From @WSJopinion: We wish we didn’t have to write this, but we live in fanatical times when political violence is all too possible. Protecting democracy means protecting all of its institutions. https://t.co/kPdPhbnVW5",
  "data/tweet-wsj/2022/6/1536355235844718593.json": "Bartenders beware! Coca-Cola is rolling out premixed cans of Jack and Coke. It will have about 5% alcohol and make it easy to have the classic cocktail without a bar. https://t.co/Lwm8L5rfgL",
  "data/tweet-wsj/2022/6/1536460958477991936.json": "Bartenders beware! Coca-Cola is rolling out premixed cans of Jack and Coke. It will have about 5% alcohol and make it easy to have the classic cocktail without a bar. https://t.co/I3RWhpvMnC",
  "data/tweet-wsj/2022/6/1536473504152961025.json": "With the U.S. sending roughly $130 million a day in military aid to Ukraine plus economic and other assistance, current and former U.S. officials warn that more must be done to ensure arms and money aren’t diverted, stolen or misused https://t.co/Dw45ioUDYG",
  "data/tweet-wsj/2022/6/1536506221607407616.json": "Elon Musk will participate in an all-hands meeting with Twitter employees Thursday, marking the first time the billionaire has spoken directly with the company’s workforce since he began his courtship of it in April https://t.co/x2HcbcTAln",
  "data/tweet-wsj/2022/6/1536494902657306625.json": "Nearly 37 years after its release, Kate Bush's “Running Up That Hill (A Deal With God)\" reached No. 4 on the Billboard singles chart Monday thanks to Netflix’s “Stranger Things\" and a legion of new fans https://t.co/oe7xuTP5x6",
  "data/tweet-wsj/2022/6/1536482625917009920.json": "Idaho police said they are receiving death threats following the weekend arrests of 31 people believed to be members of white supremacist group Patriot Front https://t.co/bZQNz7ObHb",
  "data/tweet-wsj/2022/6/1536287284030578688.json": "Hot-sauce lovers are going to be in for a rude awakening: A sriracha shortage is coming. “We can confirm that there is an unprecedented shortage of our products,” says Huy Fong Foods, citing weather-related issues that hurt its chili crops. https://t.co/unEyUHECE1",
  "data/tweet-wsj/2022/6/1536404308643696641.json": "“I told him that it was crazy stuff.” During a House Committee investigation of the Jan. 6 storming of the U.S. Capitol, former Attorney General William Barr said Donald Trump showed little interest in the actual facts about the election results. https://t.co/Wvj7Whd2SL",
  "data/tweet-wsj/2022/6/1536204252795875328.json": "Take an early look at the front page of The Wall Street Journal https://t.co/SvQleCLMB6 https://t.co/yHQ4FX7Tk1",
  "data/tweet-wsj/2022/6/1536570411097411585.json": "Take an early look at the front page of The Wall Street Journal https://t.co/MjyVh3RPyv https://t.co/0kxMSpN2pl",
  "data/tweet-wsj/2022/6/1536566617185783808.json": "Where did officials go wrong on inflation? They applied an old playbook to a new crisis. “We fought the last war.” https://t.co/69RF6M9wnZ",
  "data/tweet-wsj/2022/6/1536619515152412681.json": "Google suspended an engineer who contended that an artificial-intelligence chatbot the company developed had become sentient, telling him that he had violated the company’s confidentiality policy after it dismissed his claims. https://t.co/3f8gTmTQsu",
  "data/tweet-wsj/2022/6/1536442644100009987.json": "The S&amp;P 500 closed in a bear market, sliding 3.9%, as stocks plunged on fears about the pace of Fed rate increases. The Dow dropped about 875 points. https://t.co/Mv06XtVXBR",
  "data/tweet-wsj/2022/6/1536389209824673797.json": "Where did officials go wrong on inflation? They applied an old playbook to a new crisis. “We fought the last war.” https://t.co/pUsad5niZX",
  "data/tweet-wsj/2022/6/1536685634802405380.json": "Heavy rains ravaged Yellowstone National Park and forced visitors to evacuate just as the summer tourism season was underway #WSJWhatsNow https://t.co/MavGwS7s80 https://t.co/HqNzeizPQB",
  "data/tweet-wsj/2022/6/1536736986689568768.json": "K-pop boy band BTS said they are going on hiatus to take time away from the group to grow and mature as individuals, as well as work on solo music https://t.co/yn9lWabaGh",
  "data/tweet-wsj/2022/6/1536728956229001216.json": "From @WSJopinion: Inflation wasn’t real. Then it was \"transitory.\" Now we’re told the Fed will cure it with a few rate hikes. Only a true wishful thinker could be confident of that, writes @gerardtbaker. https://t.co/ptoVhmatjt",
  "data/tweet-wsj/2022/6/1536774247045115906.json": "Caterpillar is moving its headquarters to Texas from its longtime base in Illinois, the latest major manufacturer to leave the state in recent weeks https://t.co/Xk9qpM71TY",
  "data/tweet-wsj/2022/6/1536864851250790400.json": "Crypto lender Celsius Network has hired restructuring lawyers to advise on possible solutions for its mounting financial problems \nhttps://t.co/LOGUEOH67U",
  "data/tweet-wsj/2022/6/1536853554622865409.json": "R.I.P., Internet Explorer https://t.co/X21KxA3ikw",
  "data/tweet-wsj/2022/6/1536913942420897794.json": "Caterpillar is moving its headquarters to Texas from its longtime base in Illinois, the latest major manufacturer to leave the state in recent weeks https://t.co/dQrVBBm6Ta",
  "data/tweet-wsj/2022/6/1536887487154606080.json": "All entrances to Yellowstone National Park are closed indefinitely, the National Park Service said, warning of dangerous conditions and the risk of rockslides https://t.co/wZyPOeld8q",
  "data/tweet-wsj/2022/6/1536883715208626176.json": "The metaverse economy is expected to grow to $5 trillion by 2030 and encompass daily activities such as socializing and remote learning, consulting firm McKinsey said https://t.co/bACSPWDOK0",
  "data/tweet-wsj/2022/6/1536796900229271553.json": "Where did officials go wrong on inflation? They applied an old playbook to a new crisis. “We fought the last war.” https://t.co/RoDK8kbXDV",
  "data/tweet-wsj/2022/6/1536959243575824384.json": "R.I.P., Internet Explorer https://t.co/FVHjZOjdP9",
  "data/tweet-wsj/2022/6/1536918836812861440.json": "Rep. Tom Rice, one of the 10 House Republicans who voted to impeach Donald Trump, has lost in a South Carolina primary, the AP projects. Trump-backed state Rep. Russell Fry won. https://t.co/fg5KnhDXmC",
  "data/tweet-wsj/2022/6/1536638351062839296.json": "Take an early look at the front page of The Wall Street Journal https://t.co/iKbVb1GK4A https://t.co/0CpccmUK6x",
  "data/tweet-wsj/2022/6/1536644054724796416.json": "Minnesota Timberwolves owner and former Walmart executive Marc Lore’s new food-truck startup has a $3.5 billion valuation, and he wants to expand to new regions  https://t.co/TFlCN0xnQa",
  "data/tweet-wsj/2022/6/1536521360339509249.json": "Returning office workers get creative to help their lonely dogs cope: \"Judge Judy\" and robotic vacuums https://t.co/qzhb2jbOT4",
  "data/tweet-wsj/2022/6/1536559074476703745.json": "Bartenders beware! Coca-Cola is rolling out premixed cans of Jack and Coke. It will have about 5% alcohol and make it easy to have the classic cocktail without a bar. https://t.co/tgclCFKHlM",
  "data/tweet-wsj/2022/6/1536834625447813120.json": "BP is taking the lead on a more-than-$30 billion project to produce massive amounts of hydrogen from renewable energy in Australia’s Outback, a major bet on a promising alternative fuel that is in growing demand but remains expensive https://t.co/Ir83ONFnnb",
  "data/tweet-wsj/2022/6/1537113987183218688.json": "Lego said it is going to spend $1 billion to build a factory in Virginia. The new facility is expected to create more than 1,700 jobs. https://t.co/b7TR2885tr",
  "data/tweet-wsj/2022/6/1537088440382144514.json": "For the first time, scientists have discovered where the Black Death originated from: a mountainous region of modern-day Kyrgyzstan https://t.co/TScW1p9zzF",
  "data/tweet-wsj/2022/6/1537144173752614912.json": "Bill Gates said he thinks cryptocurrencies and NFTs are “100%” based on the greater fool theory https://t.co/Ch4s4Ar5xM",
  "data/tweet-wsj/2022/6/1537004532814733314.json": "Take an early look at the front page of The Wall Street Journal https://t.co/aEo6WuZwdG https://t.co/Kova3KiQWT",
  "data/tweet-wsj/2022/6/1537155532947177477.json": "Dr. Anthony Fauci has tested positive for Covid-19 https://t.co/AVqsSreve5",
  "data/tweet-wsj/2022/6/1537125307467059200.json": "President Biden will sign an executive order aimed at improving protections for LGBT people that includes efforts to counter laws around transgender youths https://t.co/bGFmuWVW9w",
  "data/tweet-wsj/2022/6/1537166111770398721.json": "WWE’s board is investigating a secret $3 million settlement that longtime CEO Vince McMahon reached with a former employee with whom he allegedly had an affair, according to documents and people familiar https://t.co/FXdiFlpfiq",
  "data/tweet-wsj/2022/6/1537162905686364163.json": "Covid vaccines from Pfizer and Moderna were recommended for kids as young as 6 months by FDA advisers. It's the last major group waiting for the shots. https://t.co/NZrDnS9lgD",
  "data/tweet-wsj/2022/6/1537160522394632193.json": "Chinese leader Xi Jinping again fell short of publicly siding with Moscow over the invasion of Ukraine during a telephone call Wednesday with Russian counterpart Vladimir Putin, according to an account from state broadcaster Chinese Central Television https://t.co/OUbvi9dHjV",
  "data/tweet-wsj/2022/6/1537185728215633922.json": "A federal court has ruled that it is unconstitutional for a North Carolina charter school to require girls to wear skirts https://t.co/8FuzSno75c",
  "data/tweet-wsj/2022/6/1537200835389796355.json": "R.I.P., Internet Explorer. Microsoft has pulled the plug on its venerable browser after more than 27 years. https://t.co/zpyv7vQk1A",
  "data/tweet-wsj/2022/6/1537172341758869505.json": "The Federal Reserve raises rates by 0.75 points and signals a more aggressive path for interest-rate hikes  #WSJWhatsNow https://t.co/ZaJ0RxsK2v https://t.co/DvLwfWBpCb",
  "data/tweet-wsj/2022/6/1537158025856917507.json": "A federal judge in Washington has denied former Trump strategist Steve Bannon’s motion to throw out his indictment on contempt-of-Congress charges https://t.co/BrLdoaqKLy",
  "data/tweet-wsj/2022/6/1537232163396935680.json": "A fisherman has confessed to killing and dismembering British journalist Dom Phillips and his guide, Bruno Pereira, deep in the Amazon rainforest, Brazilian police said Wednesday https://t.co/SmhEGp87w9",
  "data/tweet-wsj/2022/6/1537168107378188289.json": "Fourteen markets across Middle East and Southeast Asia have banned theatrical showings of “Lightyear,”  the latest feature film from Disney's Pixar, because it depicts a same-sex relationship https://t.co/mmLEQNzMkX",
  "data/tweet-wsj/2022/6/1536766697285242881.json": "If inflation has relegated you to window shopping, this summer’s surplus sales might give you a reason to go back inside https://t.co/G22siMq1r9",
  "data/tweet-wsj/2022/6/1537242330637344768.json": "President Biden took a fresh shot at countering high gasoline prices by urging U.S. oil refiners to expand capacity and accusing them for profiteering https://t.co/JlRc8OFNDx",
  "data/tweet-wsj/2022/6/1537321604518117377.json": "Bill Gates said he thinks cryptocurrencies and NFTs are “100%” based on the greater fool theory https://t.co/JNyFKPpJO0",
  "data/tweet-wsj/2022/6/1537281591537549312.json": "Abbott Laboratories said it has paused baby-formula production at its Sturgis, Michigan, plant after storms flooded part of it, affecting production https://t.co/bnnuNMsXlu",
  "data/tweet-wsj/2022/6/1537291406653399040.json": "Take an early look at the front page of The Wall Street Journal https://t.co/AtwDUrxpfc https://t.co/m45MUGmuRB",
  "data/tweet-wsj/2022/6/1537410410537795584.json": "The U.S. is sending $1 billion in new military assistance to help Ukraine repel Russia’s invasion, in response to Kyiv’s urgent pleas #WSJWhatsNow https://t.co/omkOqo7LBS https://t.co/Zk31ra5mOJ",
  "data/tweet-wsj/2022/6/1537287620237086720.json": "U.S.-led coalition forces seized a man that officials described as a senior leader of Islamic State in an operation in northeast Syria late Wednesday https://t.co/aNhbhTmkEM",
  "data/tweet-wsj/2022/6/1537435846562852867.json": "The average rate for a 30-year fixed mortgage hit 5.78%, the highest level since 2008 https://t.co/h7lubWrcZa",
  "data/tweet-wsj/2022/6/1537499018477043717.json": "Scientists have discovered polar bears that have adapted to life without sea ice. It raises hopes the species can survive even as the climate warms. https://t.co/e29kmeXrrF",
  "data/tweet-wsj/2022/6/1537514122077773829.json": "Israel has repeatedly struck Iran-related targets in Syria. Behind the scenes, many of Israel’s missions have been reviewed for approval by senior officials at U.S. Central Command and the Pentagon, sources say. https://t.co/eBmlOUt32V",
  "data/tweet-wsj/2022/6/1537608499949076481.json": "World Cup organizers unveiled the host cities for the 2026 World Cup in the U.S., Canada and Mexico—and all 11 American stadiums are home to NFL teams https://t.co/PEG1nMFC2h",
  "data/tweet-wsj/2022/6/1537530548540801035.json": "The Dow plunged more than 700 points as stocks slid on recession concerns. The Nasdaq fell 4.1%. https://t.co/HgiJLjpE2W",
  "data/tweet-wsj/2022/6/1537640087751630848.json": "The Golden State Warriors won the NBA championship, defeating the Boston Celtics. It's the fourth title in eight seasons for the team and star Stephen Curry. https://t.co/yTINFlKwSb",
  "data/tweet-wsj/2022/6/1537641652222836737.json": "The Bank of Japan maintained ultra-low interest rates, confirming that it won’t join major global central banks in tightening monetary policy https://t.co/dlON2jdTj2",
  "data/tweet-wsj/2022/6/1537551882780033024.json": "Two American men—both veterans—who volunteered to serve alongside Ukrainian forces are missing and feared captured by Russian forces, according to officials https://t.co/VDmuORs6f9",
  "data/tweet-wsj/2022/6/1537657551784923137.json": "Kate Bush is running up the charts https://t.co/0ps4fyWHk2",
  "data/tweet-wsj/2022/6/1537710403647590400.json": "Scientists have discovered polar bears that have adapted to life without sea ice. It raises hopes the species can survive even as the climate warms. https://t.co/XaMYrrWJF3",
  "data/tweet-wsj/2022/6/1537753437579972608.json": "The EU recommended that Ukraine become an official candidate to join the bloc, a first step on a long path toward membership with many obstacles https://t.co/HSER8tvOBz",
  "data/tweet-wsj/2022/6/1537757668181479426.json": "China said it launched its newest and most advanced aircraft carrier that would expand Beijing’s military influence at sea #WSJWhatsNow https://t.co/EfO4LHqw2b https://t.co/EgseaxJaLF",
  "data/tweet-wsj/2022/6/1537785928206385152.json": "SpaceX fired employees who criticized CEO Elon Musk and the way the company applies internal rules, according to an email to staff https://t.co/Vow4OlFpAI",
  "data/tweet-wsj/2022/6/1537772565766279169.json": "The board of World Wrestling Entertainment appointed Stephanie McMahon as interim chief executive officer and chairwoman pending an investigation into alleged misconduct by her father and longtime head of the company, Vince McMahon. https://t.co/vW4D3l2x2S",
  "data/tweet-wsj/2022/6/1537762012851232768.json": "More than 60% of CEOs see a recession coming in the next 12 to 18 months, and some think one is already here, according to a survey released Friday by the Conference Board  https://t.co/TB3Sj7TvMU",
  "data/tweet-wsj/2022/6/1537502778951606272.json": "The Senate passed legislation to expand healthcare and benefits for millions of veterans, especially those exposed to noxious chemicals https://t.co/NHQdXZ7t9u",
  "data/tweet-wsj/2022/6/1537748150840184832.json": "British Home Secretary Priti Patel has approved an order to extradite WikiLeaks founder Julian Assange from the U.K. to the U.S. to face espionage charges https://t.co/EdGCs1q2VX",
  "data/tweet-wsj/2022/6/1537619843083554827.json": "Transportation Secretary Pete Buttigieg is putting airlines on notice he wants summer operations to go smoothly https://t.co/BNkBJnns2c",
  "data/tweet-wsj/2022/6/1537668980722257920.json": "Take an early look at the front page of The Wall Street Journal https://t.co/0kOI5xutU5 https://t.co/o14couGlTm",
  "data/tweet-wsj/2022/6/1537733062196350977.json": "China has launched its third aircraft carrier, its largest and most sophisticated to date, advancing its ambitions to build a modern navy that can project power around the world https://t.co/h0hER4z2DD",
  "data/tweet-wsj/2022/6/1537816119028944900.json": "From @WSJopinion: Trump might have been the only Republican who could beat Hillary in 2016. But he’s a sure loser in 2024, writes @Peggynoonannyc https://t.co/01qiPR4IVx",
  "data/tweet-wsj/2022/6/1537782187763826688.json": "“Inflation doesn’t matter as much if you don’t spend money.” Meet the super-frugal families fighting inflation by curbing spending. https://t.co/znqYx1LR9N",
  "data/tweet-wsj/2022/6/1537582071241007105.json": "The Justice Department is pouring resources into enforcing U.S. sanctions in the wake of Russia’s invasion of Ukraine https://t.co/FqLbcVojYN",
  "data/tweet-wsj/2022/6/1537955819622240257.json": "Russian forces have conducted a series of operations against the U.S.-led coalition in Syria this month, risking direct conflict with the U.S., military officials say https://t.co/106QvBCrxm",
  "data/tweet-wsj/2022/6/1537997300949082114.json": "From @WSJopinion: President Reagan understood something neither party grasps today: that the value of the dollar isn’t a function of how many dollars government supplies but of how many dollars people demand, writes Richard Vigilante https://t.co/gYSBBgkRtO",
  "data/tweet-wsj/2022/6/1538008635434905600.json": "SpaceX fired employees who criticized CEO Elon Musk and the way the company applies internal rules, according to an email to staff https://t.co/6gTlVGooiy",
  "data/tweet-wsj/2022/6/1538012385616613377.json": "“Inflation doesn’t matter as much if you don’t spend money.” Meet the super-frugal families fighting inflation by curbing spending. https://t.co/5ptUZoDcOK",
  "data/tweet-wsj/2022/6/1537935657309327360.json": "Recent Russian military operations in Syria are raising concerns that the moves might escalate into an unintended conflict with U.S. forces https://t.co/O4aYy09vzx",
  "data/tweet-wsj/2022/6/1538035038385852423.json": "Hubris, greed and leverage. How the crypto industry grew to wild heights, and what the reckoning looks like. https://t.co/4eJ2DxfUrG",
  "data/tweet-wsj/2022/6/1537404703860051971.json": "A tight labor market has given workers the upper hand. Some now feel that power starting to slip. https://t.co/qEUsnISQht",
  "data/tweet-wsj/2022/6/1537895417186095108.json": "In a combative speech, Putin criticized the West for failing to recognize the rise of new power blocs since the end of the Cold War and warned that its sanctions on Moscow had backfired https://t.co/sipIsHRhUq",
  "data/tweet-wsj/2022/6/1538085313301692416.json": "Bitcoin fell below $20,000, down 72% from its high in November, as a steep selloff in cryptocurrencies deepened https://t.co/m1MwW95XNV",
  "data/tweet-wsj/2022/6/1538102989407367169.json": "Scientists have discovered polar bears that have adapted to life without sea ice. It raises hopes the species can survive even as the climate warms. https://t.co/sFdw25A7C7",
  "data/tweet-wsj/2022/6/1538046387635503104.json": "China has launched its third aircraft carrier, its largest and most sophisticated to date, advancing its ambitions to build a modern navy that can project power around the world https://t.co/pwKYDRlrdL",
  "data/tweet-wsj/2022/6/1537993540713664512.json": "Jewel wrote 200 new songs for her new album “Freewheelin’ Woman,” then whittled them down to 12 tracks. “I was always prolific,” says the singer, who has an archive of at least 1,000 unreleased songs. https://t.co/LmRMWJDM9i",
  "data/tweet-wsj/2022/6/1538148284631552005.json": "Bill Gates said he thinks cryptocurrencies and NFTs are “100%” based on the greater fool theory https://t.co/bBLLKpEvyW",
  "data/tweet-wsj/2022/6/1538142515999789056.json": "An anonymous individual has bid a record $19 million for the opportunity to eat lunch with Warren Buffett, who at age 91 is participating in the annual charity event for the last time https://t.co/Az7SCG1ODF",
  "data/tweet-wsj/2022/6/1538031269803462659.json": "In a combative speech, Putin criticized the West for failing to recognize the rise of new power blocs since the end of the Cold War and warned that its sanctions on Moscow had backfired https://t.co/6bT5zDAy0n",
  "data/tweet-wsj/2022/6/1538091675414929410.json": "Take a look at the front page of today's Wall Street Journal https://t.co/x0GFeAu0vW https://t.co/Tiv8ih3zzU",
  "data/tweet-wsj/2022/6/1538186050086047746.json": "A teenager with Down syndrome escaped besieged Mariupol as his mother wove a motivational fantasy that John Cena lay at the end of their dangerous journey out of Ukraine. The fantasy ended with a happy reality. https://t.co/D6lzII3AfL"
}