{
  "data/tweet-nytimes/2022/4/1509687016732123140.json": "President Biden announced on Thursday that the U.S. would release up to 180 million barrels of oil from a strategic reserve to counteract the economic impact of Russia’s invasion of Ukraine.\nhttps://t.co/86ha1QTWVn https://t.co/ZDxwm36APQ",
  "data/tweet-nytimes/2022/4/1509712169058897924.json": "A bill to limit the cost of insulin to $35 a month for most Americans who depend on it passed the House on Thursday. To become law, the bill will need to attract at least 10 Republican votes in the Senate to overcome a filibuster. https://t.co/E0FkuiRN6P",
  "data/tweet-nytimes/2022/4/1509694552986300421.json": "A law keeps personal census data secret for 72 years. The 1950 census goes public on Friday, a bonanza for historians and the merely curious. https://t.co/rLCkybleho",
  "data/tweet-nytimes/2022/4/1509727310710284296.json": "Russia is running its military campaign against Ukraine out of Moscow, with no central war commander on the ground to call the shots, according to American officials who have studied the five-week-old war. https://t.co/SPNJJZsCh2",
  "data/tweet-nytimes/2022/4/1509799241937723398.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/4prgyfysgf",
  "data/tweet-nytimes/2022/4/1509855670782283779.json": "Two Ukrainian helicopters crossed into Russian territory and fired on an oil depot in the city of Belgorod, injuring two people, a regional governor said. It is the first Ukrainian airstrike Russia has reported on its territory since the start of the war.\nhttps://t.co/ZMPpOhC3OL https://t.co/XjNMQCiXmi",
  "data/tweet-nytimes/2022/4/1509852093439426565.json": "The U.S. Navy will name a new ship after the late Supreme Court Justice Ruth Bader Ginsburg.\n\nThe ship will join a class of vessels named after those who have fought for civil and human rights, including Harvey Milk, Robert F. Kennedy and Sojourner Truth.\nhttps://t.co/T1RDtIUw7w",
  "data/tweet-nytimes/2022/4/1509853035635388425.json": "Breaking News: Pope Francis apologized for the Roman Catholic Church’s role in a system of Canadian schools that abused Indigenous children for 100 years. He also promised to visit Canada as part of a process of healing and reconciliation. https://t.co/OjDnsLycH6",
  "data/tweet-nytimes/2022/4/1509870464491048960.json": "President Vladimir Putin of Russia is “a man in a cage he built himself” because of his decision to invade Ukraine, and he has damaged both his own nation and its army, Britain’s defense minister said.\nhttps://t.co/TgAbXgnw2U",
  "data/tweet-nytimes/2022/4/1509848328682590208.json": "The UN’s nuclear watchdog is looking into reports that some Russian soldiers who left the shuttered Chernobyl nuclear plant have radiation poisoning. They pulled out on Thursday, five weeks after seizing it, Ukraine’s state-run energy company said.\nhttps://t.co/OZOqLSSogV",
  "data/tweet-nytimes/2022/4/1509872452674936837.json": "Breaking News: The U.S. hiring spree continued in March, with employers adding 431,000 jobs, another sign of the economy’s resilience amid uncertainty. The unemployment rate was 3.6%, down from 3.8% a month earlier.\nhttps://t.co/01QmNXaJsz",
  "data/tweet-nytimes/2022/4/1509923567097556994.json": "Two low-flying Ukrainian helicopters crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, a regional governor said — the first time Russia has reported a Ukrainian airstrike on its territory since the war began. https://t.co/LA8CKJBFA1 https://t.co/5qEArPIFkh",
  "data/tweet-nytimes/2022/4/1509933257604964357.json": "Breaking News: Amazon workers voted to unionize at a massive New York warehouse, in a stunning win for a campaign targeting the second-largest employer in the U.S. and one of the biggest victories for organized labor in a generation. https://t.co/Jy5WDa21j4",
  "data/tweet-nytimes/2022/4/1509928598010044424.json": "Jen Psaki, the White House press secretary, is in advanced talks to join MSNBC after she leaves the Biden administration, according to two people familiar with the negotiations. She could leave the White House as soon as next month, one of the people said. https://t.co/GqmGB1iWmM",
  "data/tweet-nytimes/2022/4/1510007873153216513.json": "Two low-flying Ukrainian helicopters crossed into Russian territory early Friday and fired on an oil depot in the city of Belgorod, a regional governor said — the first time Russia has reported a Ukrainian airstrike on its territory since the war began. https://t.co/LRzAFogyxd https://t.co/eoMatzd91w",
  "data/tweet-nytimes/2022/4/1510024233048489985.json": "Standing outside the Brooklyn office where Amazon unionization ballots were tallied, Christian Smalls, a former employee who started organizing workers before he was fired, popped a bottle of champagne: “To the first Amazon union in American history.\" https://t.co/flfFQyzM69 https://t.co/nc8oA211Ct",
  "data/tweet-nytimes/2022/4/1509956290805653506.json": "At 26, Sammy Basso is believed to be the oldest person with Progeria, an exceedingly rare and fatal disease that afflicts only about one in 18 million people. And now he’s researching it, hoping to find a treatment and the secrets of aging.\nhttps://t.co/1eRGoNgg7x https://t.co/2gsbjtXcVk",
  "data/tweet-nytimes/2022/4/1509946218998382602.json": "\"Putin is not the force he used to be\": Britain’s defense minister said that Russia’s army was \"exhausted\" and that its reputation \"has been trashed\" because of President Vladimir Putin's decision to invade Ukraine. https://t.co/tGsXhkj8al https://t.co/r6orvRlsQB",
  "data/tweet-nytimes/2022/4/1509999097427730435.json": "Amazon workers voted to unionize in a New York warehouse, in one of the biggest wins for organized labor in a generation.\n\nIn 2020, we interviewed Christian Smalls, who was fired by Amazon after protesting safety conditions and now is the union’s leader. https://t.co/vCod2WY6lU",
  "data/tweet-nytimes/2022/4/1510035581212016656.json": "Breaking News: Will Smith, who slapped the comedian Chris Rock at the Oscars, said he was resigning from the Academy of Motion Picture Arts and Sciences. https://t.co/wovv3Oo3FZ https://t.co/DID2mo6VAo",
  "data/tweet-nytimes/2022/4/1510067009551278085.json": "Breaking News: The Biden administration will work with allies to transfer Soviet-made tanks to bolster Ukrainian defenses, the first time the U.S. has done so. https://t.co/TxAH9vuIsk",
  "data/tweet-nytimes/2022/4/1510089666162266114.json": "Western diplomats and independent military analysts say the Russian pullback from Kyiv is real, a sign that Moscow’s initial strategy has failed in the face of grave planning failures, logistical problems and fierce and effective Ukrainian resistance. https://t.co/RDQAQ892pd",
  "data/tweet-nytimes/2022/4/1510029255140331530.json": "Ukraine’s army claims to be in control of dozens of towns to the west and east of Kyiv where some of the most intense fighting of the war has happened. If the stated gains hold up, it would mark the largest shift in fighting around the capital in weeks. https://t.co/D70MfQ1Ft1",
  "data/tweet-nytimes/2022/4/1510225602594447368.json": "Female patients and people of color are more likely to have their symptoms dismissed by medical providers, studies show.\nNew York Times readers shared their experiences with what many refer to as \"medical gaslighting.\" Read more: https://t.co/D6VUOktwR9 https://t.co/6e16d2cYCC",
  "data/tweet-nytimes/2022/4/1510180269411741698.json": "Polls and interviews show many Russians now accept President Putin’s assertion that their country is under siege from the West and had no choice but to attack. The war’s opponents are leaving the country or keeping quiet. https://t.co/ACsLJA9hXw",
  "data/tweet-nytimes/2022/4/1510050662498902017.json": "Sarah Palin is joining the crowded race for Alaska’s lone congressional seat, which was left vacant by the unexpected death of Don Young. https://t.co/lIWXXZbNca",
  "data/tweet-nytimes/2022/4/1510284693937311754.json": "Kyiv was the key target for Russia. It’s the heart of Ukraine and the seat of its government. But despite more troops and firepower, Russia’s advance there has failed. Here’s why. https://t.co/RMYLZ5Bptd",
  "data/tweet-nytimes/2022/4/1510307351466762248.json": "The next wave of Covid-19 is coming. Are you ready?\n\nThe culprit this time is BA.2, a subvariant of the Omicron variant. Nobody knows for sure how much havoc it will cause, but BA.2 is now the dominant strain in the United States and around the world. https://t.co/l8Fk8H5VT7 https://t.co/uVas8ndi7g",
  "data/tweet-nytimes/2022/4/1510320992127799297.json": "Amazon spent millions to fight worker unrest. The company deployed an “incident commander,\" according to court documents.\n\nUnion organizers in New York had a budget of $120,000. They deployed TikToks, homemade ziti and free marijuana.\n\nHere's how they won. https://t.co/e3jp9q8eco",
  "data/tweet-nytimes/2022/4/1510105245631848449.json": "In a new special, the stand-up comic Jerrod Carmichael reveals that he is gay and has been lying about it for years. Stylishly directed by Bo Burnham, the special, “Rothaniel,” grapples with the roots of his silence — and the price of breaking it. https://t.co/xBWIKQDHWy",
  "data/tweet-nytimes/2022/4/1510326221644738565.json": "Tesla said it delivered 310,000 vehicles from January through March, up from 185,000 cars during the same period in 2021. The nearly 70 percent increase was in contrast with major carmakers like General Motors and Toyota, which reported big sales declines. https://t.co/mCNjxKcXhV",
  "data/tweet-nytimes/2022/4/1510314895488782337.json": "The attorney general’s deliberative approach to Jan. 6 has frustrated Democratic allies of the White House and, at times, President Biden himself. Biden said privately that he wanted Garland to act less like a ponderous judge and more like a prosecutor. https://t.co/N2DDZvaJ2M",
  "data/tweet-nytimes/2022/4/1510250707097726977.json": "The photographer, Maks Levin, was shot by Russian armed forces with “small arms fire” and a criminal investigation into his death is underway, according to the office of Ukraine’s prosecutor general. https://t.co/HepY8kyGC5",
  "data/tweet-nytimes/2022/4/1510416821568028675.json": "Lithuania has stopped importing natural gas from Russia as of this month, saying the move was an example for other European Union members.\n\n“If we can do it, the rest of Europe can do it too,” Gitanas Nauseda, Lithuania’s president, said Saturday. https://t.co/1Hp9e0GKDM",
  "data/tweet-nytimes/2022/4/1510428130028273669.json": "After months of dreary weather and bare branches, it’s finally cherry blossom season in New York City.\n\nHere’s an overview of what kind of cherry blossoms you can find in New York City, when they’ll be in bloom and where you can find them. https://t.co/j2dqeCiNLd",
  "data/tweet-nytimes/2022/4/1510397923141599238.json": "Jen Psaki is in advanced talks with MSNBC to join the network and could leave the White House as soon as next month, a person familiar with the negotiations said. https://t.co/q8Il3V1Pep",
  "data/tweet-nytimes/2022/4/1510299781708587012.json": "History has tended to smite Russian leaders who launched what they wrongly anticipated would be short, victorious wars. Some analysts believe that Vladimir Putin is risking a similar fate. https://t.co/o3bIUxQpvw",
  "data/tweet-nytimes/2022/4/1510594230674149382.json": "The outgunned people of Vasylkiv, a provincial Ukrainian town, successfully fought off Russian troops in the early days of the war — helping to keep the capital safe and entering Ukraine’s military lore. https://t.co/z0lMRZqaZX",
  "data/tweet-nytimes/2022/4/1510645605277876234.json": "Estelle Harris, who hyperventilated her way into the hearts of “Seinfeld” fans as Estelle Costanza, the mother of George Costanza, died Saturday.\n\nShe wound her way through community theaters and television commercials before her big \"Seinfeld\" break. https://t.co/tsfgVsQ7hV https://t.co/VIIO9cTX8N",
  "data/tweet-nytimes/2022/4/1510628205031477250.json": "Global outrage against Moscow mounted on Sunday over allegations that Russian forces had executed civilians in Ukraine, with Western leaders redoubling calls for war crimes investigations. https://t.co/mQbX2mz0iQ",
  "data/tweet-nytimes/2022/4/1510613116559765511.json": "Will Smith has spent decades radiating boundless likability. His family has become known for sharing therapy sessions online. \n\nHis slap at the Oscars has complicated all of that. https://t.co/PQrOKx1n5Q",
  "data/tweet-nytimes/2022/4/1510653595594727428.json": "Western officials expressed outrage on Sunday at videos and images emerging from Bucha, a town near Kyiv, Ukraine, that appeared to show civilian bodies scattered on the streets after Russia withdrew its troops from the area in recent days. https://t.co/zwNGZ8bhlR https://t.co/Uusv56MGkt",
  "data/tweet-nytimes/2022/4/1510684820950691840.json": "Christian Smalls and his best friend from Amazon's New York warehouse, Derrick Palmer, set their sights on unionizing.\n\nAmazon spent more than $4.3 million on anti-union consultants last year. The union spent $120,000 — and won a historic labor victory. https://t.co/XvNPyxIQaE https://t.co/BJ9qiqnuOh",
  "data/tweet-nytimes/2022/4/1510707699276820484.json": "Human Rights Watch said it documented “apparent war crimes” by Russian forces against Ukrainian civilians in occupied areas. A report published Sunday describes laws-of-war violations with chilling detail, including repeated rape and two summary killings. https://t.co/RYRJCHhWfL",
  "data/tweet-nytimes/2022/4/1510360184366977024.json": "Sufyian Barhoumi, 48, was captured in Pakistan in March 2002 and soon taken to Guantánamo Bay, where he never faced trial. He was notified in August 2016 that he was eligible for release, but his case was sidelined by a Trump administration policy. https://t.co/GpeAgCISBn",
  "data/tweet-nytimes/2022/4/1510788903585861633.json": "Breaking News: Olivia Rodrigo, 19, won best new artist at the #Grammys. The singer-songwriter and Disney star dominated last year — culturally, critically and commercially. https://t.co/sIpkwrlEsa https://t.co/j5UX0M1Li6",
  "data/tweet-nytimes/2022/4/1510784828110745602.json": "Billie Eilish performed the title track from her album \"Happier Than Ever\" at the #Grammys in a T-shirt paying tribute to the late Foo Fighters drummer Taylor Hawkins. \n\nLive updates: https://t.co/UvUR9wfNP4 https://t.co/9bzw6pBH6V",
  "data/tweet-nytimes/2022/4/1510750269407121418.json": "With Russian forces retreating, Ukrainians in Bucha are finding scores of bodies in yards and on roads amid mounting evidence that civilians had been killed purposely and indiscriminately. A mass grave filled up after the morgue became inoperable. https://t.co/H8tbmTO3kD",
  "data/tweet-nytimes/2022/4/1510806174203105284.json": "President Volodymyr Zelensky of Ukraine addressed the Grammy Awards in a video, giving an emotional plea for support in his country’s war against Russia. “What is more opposite to music?” Zelensky said. “The silence of ruined cities and killed people.” https://t.co/wI83OZMO5k https://t.co/FDTiY5RArZ",
  "data/tweet-nytimes/2022/4/1510801839855439880.json": "At 95, Tony Bennett is the oldest album of the year nominee ever, for “Love for Sale,” his Cole Porter tribute with Lady Gaga. And Bennett’s extraordinary history with the Grammy Awards goes back nearly six decades. https://t.co/HpU4Zx1vGs",
  "data/tweet-nytimes/2022/4/1510798293764300802.json": "In a remarkable moment at the #Grammys: President Volodymyr Zelensky of Ukraine gave an impassioned pre-taped message, leading into a performance from John Legend. https://t.co/LTXd22U7YJ",
  "data/tweet-nytimes/2022/4/1510742717139193861.json": "Olivia Rodrigo, who has earned seven #Grammy nominations — including for record, album, song of the year and best new artist — has arrived at the red carpet. \n\nFollow live updates: https://t.co/sbLstgTPv6 https://t.co/ScCWpCTRqT",
  "data/tweet-nytimes/2022/4/1510806899247263748.json": "Olivia Rodrigo won the #Grammy for best pop vocal album for \"Sour.\" https://t.co/prtvSaon0S https://t.co/wMBzCwEGWc",
  "data/tweet-nytimes/2022/4/1510822869001027585.json": "Breaking News: Jon Batiste won album of the year at the 2022 #Grammys for \"We Are.\" https://t.co/kBCPjRAcEX https://t.co/CtDDlI1I41",
  "data/tweet-nytimes/2022/4/1510809400927260674.json": "Jon Batiste was nominated for 11 #Grammys — more than any other artist this year. On Sunday, he got a chance to celebrate the recognition by performing the song “Freedom” from his album “We Are.” The track is a contender for record of the year. https://t.co/pfD2QWfWE8",
  "data/tweet-nytimes/2022/4/1510818653683568645.json": "Doja Cat, who won a #Grammy while apparently in the bathroom, dodged the CBS censors while accepting her award. https://t.co/vOPODQ2chT https://t.co/NZgcNa7VlN",
  "data/tweet-nytimes/2022/4/1510745234820538376.json": "Doja Cat, who has eight #Grammy nominations, arrives on the red carpet. \n\nHer latest album, “Planet Her,” broke Spotify and Billboard records to become one of the biggest releases of 2021. https://t.co/An4FiHtkaJ https://t.co/zjHE9WaLZe",
  "data/tweet-nytimes/2022/4/1510791812386066436.json": "Lil Nas X, who is nominated for multiple awards including record of the year and album of the year, arrived at the #Grammys wearing Balmain.\n\nSee all the stars on the red carpet: https://t.co/y6AujmK3QA https://t.co/2u40CdYpYP",
  "data/tweet-nytimes/2022/4/1510882133878923270.json": "President Volodymyr Zelensky of Ukraine addressed the Grammy Awards in a video, giving an emotional plea for support in his country’s war against Russia. “What is more opposite to music?” Zelensky said. “The silence of ruined cities and killed people.” https://t.co/YocS9HmwUN https://t.co/W3R1aVPshD",
  "data/tweet-nytimes/2022/4/1510958880800624640.json": "Elon Musk bought a nearly 10% stake in Twitter. News of the purchase, which makes the Tesla founder Twitter’s largest shareholder, sent the social media platform’s share prices soaring 25%.\nhttps://t.co/EOXvBnwkta",
  "data/tweet-nytimes/2022/4/1510970460837658625.json": "President Volodymyr Zelensky of Ukraine criticized the former leaders of Germany and France, Angela Merkel and Nicolas Sarkozy, inviting them to visit Bucha, a Kyiv suburb, “to see what the policy of 14 years of concessions to Russia has led to.”\nhttps://t.co/GYZbWPWwce",
  "data/tweet-nytimes/2022/4/1510986820196130818.json": "President Volodymyr Zelensky visited Bucha, where emergency workers were still gathering bodies of civilian victims from streets and backyards after Russian troops withdrew, Ukrainian news media reported.\nhttps://t.co/OWSlkRGRU2 https://t.co/1R5sWQWwXP",
  "data/tweet-nytimes/2022/4/1510975854423199751.json": "Elon Musk bought a 9.2% stake in Twitter, making him its largest shareholder as he questions its policy on moderating speech.\nhttps://t.co/G9DMVuKNF6",
  "data/tweet-nytimes/2022/4/1510673505683230728.json": "Mantas Kvedaravicius, a Lithuanian documentary filmmaker, has been killed in the besieged city of Mariupol. \n\nThe Ukrainian Defense Ministry’s information agency said Kvedaravicius had been killed in an attack by Russia “while trying to leave Mariupol.” https://t.co/qdUX909dF2",
  "data/tweet-nytimes/2022/4/1510980604564758535.json": "Russian forces occupied Trostyanets, a strategic town in northeast Ukraine, for a month before the Ukrainian military freed it. Residents described mounting atrocities during the weeks of violence.\n\n“This is true barbarity,” one said. https://t.co/iWt6wHzj9t",
  "data/tweet-nytimes/2022/4/1511060668610457612.json": "Breaking News: Satellite images refute Russia’s claim that the killing of civilians in Bucha, a suburb of Ukraine's capital, occurred after its soldiers had left town, a New York Times analysis found. https://t.co/2pDlly6EHs",
  "data/tweet-nytimes/2022/4/1511067345304887306.json": "President Volodymyr Zelensky of Ukraine lambasted the former leaders of Germany and France, Angela Merkel and Nicolas Sarkozy, inviting them to visit Bucha, a Kyiv suburb, “to see what the policy of 14 years of concessions to Russia has led to.”\n https://t.co/E5sM9Kt3LO https://t.co/FyfV0OAr8c",
  "data/tweet-nytimes/2022/4/1510973736371040256.json": "China Eastern Airlines Flight 5735 was almost exactly vertical and approaching the speed of sound as it tore into a hillside in China in March, killing all 132 people onboard. Now investigators are facing the formidable task of working out what went wrong.\nhttps://t.co/Z3h241RbMO https://t.co/TQu6k721Lt",
  "data/tweet-nytimes/2022/4/1510976773437206540.json": "Tetiana Pomazanko was killed in her garden when Russian troops entered Bucha. Her 76-year-old mother covered her corpse as best she could amid the chaos.\n\nHer death is just one of many uncovered days after Russian forces withdrew from the Kyiv suburb.\nhttps://t.co/QvDWQGYi16 https://t.co/wv7B9E28jP",
  "data/tweet-nytimes/2022/4/1511072892796162055.json": "President Biden on Monday said reports of indiscriminate killings of civilians in the town of Bucha constituted a \"war crime.\" \"This guy is brutal,\" Biden said about President Putin. \"And what’s happening in Bucha is outrageous, and everyone’s seen it.\" https://t.co/RWExRytKaN https://t.co/QwUv6D4zuk",
  "data/tweet-nytimes/2022/4/1510955374978945031.json": "Jon Batiste, a New Orleans native and musical fixture of “The Late Show With Stephen Colbert,” won five Grammys, including album of the year. He beat stars like Lil Nas X, Billie Eilish, Olivia Rodrigo, Taylor Swift, Justin Bieber, Kanye West and Doja Cat. https://t.co/XcqjhP01lo",
  "data/tweet-nytimes/2022/4/1511071128097284097.json": "Each spring and autumn, the skies in southern Denmark come to life with the swirling displays of hundreds of thousands of starlings, an event known locally as “sort sol,” or “black sun.” \n\nSee more of the visual phenomenon: https://t.co/aGrRFA3UhC https://t.co/Suun8xnOGd",
  "data/tweet-nytimes/2022/4/1511106368408858624.json": "Tatyana Petrovna, 72, in the garden where the bodies of two of her relatives lay. \n\nNeighbors told our reporter that one of the men had stayed in Bucha to look after his dogs. Not far from his body, our reporter found two dogs, dead. They had been shot. https://t.co/DxANUvN8RK https://t.co/j4j2KvjmJE",
  "data/tweet-nytimes/2022/4/1511093785484271618.json": "The College of the Holy Cross is renaming the science buildings on its campus in Worcester, Massachusetts, in honor of one of its most famous graduates, Dr. Anthony Fauci. https://t.co/feayz4tqxf",
  "data/tweet-nytimes/2022/4/1511129899230240777.json": "Breaking News: Senators Mitt Romney of Utah and Lisa Murkowski of Alaska said they would side with Democrats in supporting Judge Ketanji Brown Jackson, paving the way for her confirmation as the first Black woman on the Supreme Court. https://t.co/fR7YTnM9qI",
  "data/tweet-nytimes/2022/4/1511156687171989507.json": "The next wave of Covid-19 is coming. Here are seven ways you can lower your risk. https://t.co/wRdMJD352f https://t.co/CNzvLRsYIe",
  "data/tweet-nytimes/2022/4/1510991605725073415.json": "The U.S. and its allies will seek to suspend Russia from the UN Human Rights Council, according to the U.S. ambassador to the UN.\n\n“The images out of Bucha and devastation across Ukraine require us now to match our words with action,” she said.\nhttps://t.co/tIpkOrNBb3",
  "data/tweet-nytimes/2022/4/1510957373871038471.json": "As the war in Ukraine continues, China is pushing an ideological campaign to defend its ties with Moscow. The centerpiece is a Communist Party-produced documentary that paints President Vladimir Putin as a hero and Russia as a long-suffering victim.\nhttps://t.co/EVSbQMuhu8",
  "data/tweet-nytimes/2022/4/1511194436797181954.json": "After trailing by 15 points at halftime, Kansas erased their deficit and took the lead within 10 minutes, holding off North Carolina to win the NCAA Men's championship on Monday. The victory was the first championship for the Jayhawks since 2008. https://t.co/qZtCpPs1U1 https://t.co/XNUB7q4IFs",
  "data/tweet-nytimes/2022/4/1511058545432743942.json": "Beijing is mounting a campaign aimed at officials and students to rally domestic support for Russia. The message: China will not turn its back. https://t.co/jSUWwqiG63",
  "data/tweet-nytimes/2022/4/1511222143526359042.json": "Satellite images refute Russia’s claim that the killing of civilians in Bucha, a suburb of Ukraine's capital, occurred after its soldiers had left town, a New York Times analysis found. https://t.co/yTsRuItPuA",
  "data/tweet-nytimes/2022/4/1511274452847411211.json": "The images of lifeless bodies, bloodied by bullets, left behind in Bucha, Ukraine, after Russia’s withdrawal have provoked international outrage.\n\nThe photographs and eyewitness accounts could provide documentation for potential war crimes investigations.\nhttps://t.co/fpICkUYTdB",
  "data/tweet-nytimes/2022/4/1511263137542066178.json": "More than 300 people have been tortured and killed in Bucha, a suburb of Kyiv, President Volodymyr Zelensky of Ukraine said, adding that the list of victims is likely to grow.\nhttps://t.co/8XiwQT7drJ",
  "data/tweet-nytimes/2022/4/1511040917033136130.json": "President Biden on Monday declined to call what was happening in Ukraine a genocide but said reports of indiscriminate killings of civilians in the town of Bucha constituted a \"war crime\" and that the U.S. would bring additional sanctions against Russia. https://t.co/DGCRIDYw1Q",
  "data/tweet-nytimes/2022/4/1511323797382647820.json": "Vitali Klitschko, Kyiv’s mayor, described the killing of civilians by Russian forces as “genocide” and repeated calls by President Volodymyr Zelensky for the international community to send more aid to Ukraine and to cut off all business ties with Russia.\nhttps://t.co/H9azppG1Bq",
  "data/tweet-nytimes/2022/4/1511329617289875460.json": "Elon Musk is joining Twitter’s board of directors, the social media platform said, one day after he disclosed he had become the company’s largest shareholder.\nhttps://t.co/C16elBtAMW",
  "data/tweet-nytimes/2022/4/1511349892454703114.json": "Breaking News: President Volodymyr Zelensky of Ukraine is addressing the UN Security Council amid evidence of Russian atrocities.\n\nWatch the address, and follow our live analysis. \nhttps://t.co/10gHDim2MU",
  "data/tweet-nytimes/2022/4/1511267663309332484.json": "France, the U.S. and Britain are likely to present evidence of atrocities in Bucha, Ukraine, to the UN Security Council, as they look to isolate President Vladimir Putin and demand that he be held accountable for possible war crimes.\n\nFollow our updates.\nhttps://t.co/95HVwxUjHC",
  "data/tweet-nytimes/2022/4/1511369343963222025.json": "Tens of thousands of Ukrainians are reportedly being taken to what are being referred to as filtration camps in Russia, where their passports and phones are being taken away, and family members are being separated, the U.S ambassador to the UN said. https://t.co/rfco4F888b https://t.co/KuyTW7NKfj",
  "data/tweet-nytimes/2022/4/1511373126835351565.json": "President Volodymyr Zelensky, in his first speech to the UN Security Council since the invasion began, called the Russians war criminals who he said had killed families, raped women in front of their children and left Ukraine “filled with mass graves.” https://t.co/32vtmmOhpU https://t.co/c002bDxkzU",
  "data/tweet-nytimes/2022/4/1511116482666762245.json": "Spanish authorities seized a $90 million yacht owned by a Russian oligarch at the request of American officials, the Justice Department said on Monday. Over one week last month, Spain seized three superyachts believed to belong to Russian oligarchs. https://t.co/5IVqRmeRkI",
  "data/tweet-nytimes/2022/4/1511313985211187205.json": "France opened three investigations into potential war crimes against French citizens in Ukraine.\n\nOfficials said the crimes were committed in three cities from Feb. 24, the day the Russian invasion began, through March 16.\nhttps://t.co/NslAHAR6nR",
  "data/tweet-nytimes/2022/4/1511127751599833091.json": "When the Transportation Security Administration comes up, “funny” is not the word that springs to mind. But the agency’s Instagram account is remarkably lighthearted and pun-filled. Meet the woman behind it. https://t.co/ZwmL2tIdq1 https://t.co/n8P8jMhTzS",
  "data/tweet-nytimes/2022/4/1511414653359906820.json": "Attempts to ban books in the U.S. surged in 2021 and most of the targeted books are about Black and LGBTQ people, according to the American Library Association. \n\nHere are the ten most frequently challenged books, according to the association. https://t.co/begaJX1yBf https://t.co/FLrIsohC0f",
  "data/tweet-nytimes/2022/4/1511365589075480581.json": "A technical problem with President Zelensky’s video at the UN Security Council was resolved. Images of charred, rotting and slaughtered bodies from several Ukraine cities filled the screen at the meeting, momentarily shocking its members into silence. https://t.co/v81esmYdSX",
  "data/tweet-nytimes/2022/4/1511473784305373191.json": "President Volodymyr Zelensky, in a live video speech to the UN Security Council, called the Russians war criminals who he said killed families, raped women in front of their children, pillaged homes and left his country in ruins, “filled with mass graves.” https://t.co/6RbjEqTzAJ https://t.co/2qzjVns9KG",
  "data/tweet-nytimes/2022/4/1511488871678234642.json": "Linda Thomas-Greenfield, the U.S. ambassador to the UN, called for Russia to be suspended from the UN’s Human Rights Council, saying its inclusion “hurts the council’s credibility” and is “just plain wrong.”\n\nFollow live updates on Ukraine: https://t.co/nmZbqS3iL6 https://t.co/yfwBo7qABv",
  "data/tweet-nytimes/2022/4/1511452393258594316.json": "Hackers have repeatedly broken into social media accounts and broadcasting systems in Ukraine to spread false messages of a surrender and attempt to erode confidence in Ukrainian institutions, mirroring tactics used in Russian disinformation campaigns.\nhttps://t.co/hItMkG80Td",
  "data/tweet-nytimes/2022/4/1511448625871785992.json": "As many as 200 people are missing and presumed dead in Borodyanka, a one-street town not far from Kyiv, Ukraine. It has been devastated by Russian airstrikes, the acting mayor said Tuesday.\n\nFollow our live coverage. https://t.co/yeFtAo3UNh https://t.co/ii2sLsVqgu",
  "data/tweet-nytimes/2022/4/1511529129849626630.json": "With evidence mounting of atrocities in the Kyiv suburbs, President Volodymyr Zelensky of Ukraine delivered a scathing speech to the UN on Tuesday, accusing Russia of a litany of horrors and questioning the world body over its inaction. https://t.co/Smqm3iT9kH",
  "data/tweet-nytimes/2022/4/1511503982958686212.json": "Barack Obama returned to the White House on Tuesday, his first visit since departing in January 2017.\n\n“Vice President Biden,” Obama joked in his opening.\n“Welcome back to the White House, man,” President Biden said. “Feels like the good old days.” https://t.co/8L1RfxA3kH",
  "data/tweet-nytimes/2022/4/1511456157776367617.json": "The evidence showed that Russian forces had committed war crimes in Ukraine, the U.S. Ambassador to the UN, Linda Thomas-Greenfield, said on Tuesday, adding that the world will never hear those of the civilians brutally killed in Bucha. https://t.co/EjA6dC1yf8 https://t.co/Cx9LugO7WS",
  "data/tweet-nytimes/2022/4/1511524138967617536.json": "Russian troops recently withdrew from the area around Borodyanka, Ukraine, which was among the first places to be hit by Russian airstrikes after the invasion. Now, dozens of people who were sheltering there are missing and presumed dead under the rubble. https://t.co/YeQu12mJab",
  "data/tweet-nytimes/2022/4/1511636593597206531.json": "Russian soldiers opened fire on a cyclist last month in Bucha, Ukraine, new video shows. The footage was recorded by Ukraine’s military in early March, when Russian forces still held the town, and has been independently verified by The New York Times.\nhttps://t.co/8RNHDxPl5E",
  "data/tweet-nytimes/2022/4/1511770750914633742.json": "A video posted online on Monday and verified by The New York Times appears to show a group of Ukrainian soldiers killing captured Russian troops outside a village west of Kyiv. https://t.co/Wog3JdR8l7",
  "data/tweet-nytimes/2022/4/1511788365934432259.json": "A Ukrainian makeup artist recognized a manicured hand with red and white nail polish — one that she had seen many times holding a brush or lipstick during her makeup lessons — in an image from Bucha.\n\nNow, it lay lifeless on a street, covered in dirt. https://t.co/badOIZ7JsP",
  "data/tweet-nytimes/2022/4/1511785840317550596.json": "A Jewish community center in Poland, 40 miles from Auschwitz, has transformed into a hub where volunteers from across the world are helping Ukrainian refugees. “To see the Polish people taking refugees in,” a rabbi said, “It’s very healing for us as Jews.”\nhttps://t.co/Cxa8DzzzSz",
  "data/tweet-nytimes/2022/4/1511827603111522312.json": "Boston Marathon organizers will not allow runners from Russia or Belarus to compete in the event on April 18, one of the most prestigious distance-running events in the world, because of the war in Ukraine. \n\nLive updates on Ukraine: https://t.co/7CkLBhbSsm",
  "data/tweet-nytimes/2022/4/1511858806359265281.json": "The U.S. said it secretly removed malware from computer networks around the world, a move believed to have pre-empted Russian cyberattacks. https://t.co/afnVqQhI93",
  "data/tweet-nytimes/2022/4/1511845724719362049.json": "Russian forces in Ukraine appear to be using a new type of weapon as they step up attacks on civilian targets: an advanced land mine equipped with sensors that can detect when people walk nearby. https://t.co/8edUhHiy85",
  "data/tweet-nytimes/2022/4/1511871413275222025.json": "Runners from Russia and Belarus will not be allowed to compete in the Boston Marathon this month, the race organizers said on Wednesday — another example of the countries’ deepening isolation over the invasion of Ukraine. https://t.co/AVq36tK8Ua",
  "data/tweet-nytimes/2022/4/1511777030781734919.json": "Ukrainian troops and armored vehicles rolled through the recently recaptured town of Bucha, northwest of Kyiv. As Russian forces retreated from the area in the past week, mounting evidence of atrocities against civilians has emerged. https://t.co/C4f0AcQd8F https://t.co/9wl8iEl0DE",
  "data/tweet-nytimes/2022/4/1511891536321122304.json": "After protests, UCLA took down a job posting for an assistant adjunct professor that offered no pay. But an unspoken secret had been fleetingly exposed: Free labor is a fact of academic life. https://t.co/KEd5ezBDp2 https://t.co/wfMAQgSzhc",
  "data/tweet-nytimes/2022/4/1511757105803546627.json": "The reign of Japan’s monkey queen has just begun.\n\nIn Yakei's first breeding season, the 9-year-old female Japanese macaque played the field and mated with at least one male, all while managing to maintain her status as her troop’s alpha. https://t.co/FGBTaPpgvS https://t.co/TLUL1fwBjm https://t.co/1YpMxDqgJe",
  "data/tweet-nytimes/2022/4/1511911658196766721.json": "With the Biden administration sending dozens of armed drones to Ukraine, the Pentagon is training Ukrainian soldiers in the U.S. to use the weapons to attack Russian tanks and other armored vehicles.\nhttps://t.co/tL0E2IXdyN",
  "data/tweet-nytimes/2022/4/1511935572008386560.json": "President Volodymyr Zelensky of Ukraine accused Russian forces of trying to hide evidence of war crimes and asked allies to find the determination to take harsher measures against Moscow, including totally banning imports of Russian oil. https://t.co/H1F51W467T",
  "data/tweet-nytimes/2022/4/1511937817055838208.json": "The U.S. House voted to call for an investigation of war crimes committed during Russia’s invasion of Ukraine, including the deliberate targeting of civilians and nonmilitary buildings.\n\nSix House Republicans voted against the measure. https://t.co/n0iqcwepSt",
  "data/tweet-nytimes/2022/4/1511984678315646976.json": "A Ukrainian makeup artist recognized a manicured hand with red and white nail polish — one that she had seen many times holding a brush or lipstick during her makeup lessons — in an image from Bucha. Now, that hand lay lifeless, covered in dirt. https://t.co/fbN3qTSjPE https://t.co/Fgczq6tNfe",
  "data/tweet-nytimes/2022/4/1511856348639727626.json": "A fox that bit at least nine people on Capitol Hill, possibly including a congressman, tested positive for rabies on Wednesday, according to city health officials, after she had been euthanized. https://t.co/TFWo2h1B92",
  "data/tweet-nytimes/2022/4/1512029969077227520.json": "Footage has been found of an 11-year-old Prince supporting a Minneapolis teachers’ strike and being interviewed by a local TV station.\n\n“I think they should get some more money” because they’re “working extra hours for us and all that stuff,” Prince says. https://t.co/vY84IrtTst",
  "data/tweet-nytimes/2022/4/1512022392079536135.json": "“Scenes of glorious excess make the screen hum with energy” in “RRR,” our reviewer writes. Set in 1920s India before independence, the film is the latest feature from the director S.S. Rajamouli. https://t.co/eR9rUFiseE",
  "data/tweet-nytimes/2022/4/1512064169222287361.json": "Finland seized works of art being transported back to Russia from exhibitions in Italy and Japan, officials said. The shipments, containing paintings and sculptures, are suspected of being subject to EU sanctions against Russia over its invasion of Ukraine.https://t.co/4i8KiQT4SA",
  "data/tweet-nytimes/2022/4/1512067798914125836.json": "Footage has been found of an 11-year-old Prince supporting a Minneapolis teachers’ strike and being interviewed by a local TV station.\n\n“I think they should get some more money” because they’re “working extra hours for us and all that stuff,” Prince says. https://t.co/g8VOuGg9gn https://t.co/R21lIpMYoR",
  "data/tweet-nytimes/2022/4/1512097992047828999.json": "The UN voted to suspend Russia from the 47-member Human Rights Council over the Kremlin’s war in Ukraine. The General Assembly, which elects members of the Human Rights Council, has suspended only one other country: Libya, in March 2011.\nhttps://t.co/AOJvpNSReh",
  "data/tweet-nytimes/2022/4/1512018619701600259.json": "Over 5,000 people have died in the Ukrainian city of Mariupol since the start of Russia’s invasion, the city’s mayor said.\n\nInformation from Mariupol has been difficult to verify as Russia has bombarded the city with continued assaults. \nhttps://t.co/Lh905wYtOa",
  "data/tweet-nytimes/2022/4/1512047552815841285.json": "The U.S. said it secretly removed malware from computer networks around the world, a move believed to have pre-empted Russian cyberattacks. https://t.co/c3CD8rzPup",
  "data/tweet-nytimes/2022/4/1512107421791141896.json": "Breaking News: The Senate voted 53 to 47 to limit debate on Judge Ketanji Brown Jackson’s Supreme Court nomination. A final vote to confirm Judge Jackson is expected later today. https://t.co/K4eMotTYAH",
  "data/tweet-nytimes/2022/4/1512102922582171658.json": "Judge Ketanji Brown Jackson, an alumna of Harvard Law School, is poised to become the first Black female justice in the Supreme Court's 233-year history. Here’s what that means to Black women at her alma mater. https://t.co/pY0MMie2sq",
  "data/tweet-nytimes/2022/4/1512121804755714052.json": "German intelligence has intercepted radio transmissions in which Russian forces discussed carrying out killings of civilians north of Kyiv, Ukraine, according to two officials. https://t.co/sSh7GJe6jQ",
  "data/tweet-nytimes/2022/4/1512099948015271937.json": "Breaking News: Pakistan’s Supreme Court blocked Prime Minister Imran Khan’s move to dissolve Parliament, setting the stage for a vote widely expected to remove him from office. https://t.co/emLxv2JxOj",
  "data/tweet-nytimes/2022/4/1512133508935917570.json": "Breaking News: The Senate voted 53 to 47 to confirm Judge Ketanji Brown Jackson, making her the first Black woman elevated to the Supreme Court. https://t.co/NkzOL5QZTh https://t.co/GiF6VrrFcW",
  "data/tweet-nytimes/2022/4/1512128190298398720.json": "Vice President Kamala Harris, the first Black woman to hold the position and one of just 11 Black senators in American history, will preside over the vote to confirm Judge Ketanji Brown Jackson as the first Black woman on the Supreme Court. https://t.co/m3l82yLqlu",
  "data/tweet-nytimes/2022/4/1512138316682076164.json": "Judge Ketanji Brown Jackson, who was confirmed to the Supreme Court on Thursday, will be the first Black female justice in the Supreme Court's 233-year history. Here’s what that means to Black women at her alma mater.\nhttps://t.co/k6zKBC4NH8",
  "data/tweet-nytimes/2022/4/1512092195574190081.json": "Breaking News: Speaker Nancy Pelosi tested positive for the coronavirus, the latest high-profile official to contract it amid a wave of cases in Washington. https://t.co/OdylnmCFrd",
  "data/tweet-nytimes/2022/4/1512148223728705560.json": "President Biden congratulated Judge Ketanji Brown Jackson in the White House as the Senate voted on Thursday to confirm her to the Supreme Court. She was confirmed on a 53-47 vote, with three Republicans joining all 50 Democrats in backing her. https://t.co/AZRjG7s3OO https://t.co/FlUUybHyxG",
  "data/tweet-nytimes/2022/4/1512128489125732360.json": "The New York attorney general, Letitia James, asked a judge to hold Donald Trump in contempt for failing to turn over documents related to her investigation. The filing also requested to fine Trump $10,000 a day until he turns over the materials. https://t.co/0B0ozohfiJ",
  "data/tweet-nytimes/2022/4/1512158311164096516.json": "Vice President Kamala Harris, the first Black woman to hold the position, presided over the Senate's 53-47 vote to confirm Judge Ketanji Brown Jackson as the first Black woman on the Supreme Court. https://t.co/qfmsgiztLP https://t.co/OzrGfThF2m",
  "data/tweet-nytimes/2022/4/1512228748904513538.json": "The FBI is preparing to investigate the handling of classified material that was found in Donald Trump’s Florida home after he left office. https://t.co/EsU5ohR4Za",
  "data/tweet-nytimes/2022/4/1512188490993344529.json": "The Manhattan district attorney, Alvin Bragg, publicly discussed his office’s investigation into Donald Trump for the first time on Thursday, saying in an interview that his office had recently questioned new witnesses and reviewed additional documents.\nhttps://t.co/h3f56J8f2q",
  "data/tweet-nytimes/2022/4/1512082063964340226.json": "More than 2,000 Ukrainians have arrived at the U.S.-Mexico border over the past 10 days. The Biden administration said it would accept 100,000 refugees fleeing Russia’s invasion of Ukraine.\n\nLive updates: https://t.co/BodPYlbNSg https://t.co/WCEdOuch8C",
  "data/tweet-nytimes/2022/4/1512243860470128641.json": "Pink Floyd is releasing its first new track in almost three decades on Friday to raise money for the people of Ukraine, the band said on Thursday. https://t.co/kr9AiWjtGM",
  "data/tweet-nytimes/2022/4/1512160484073607169.json": "Breaking News: At least two people were killed and eight wounded in a shooting in central Tel Aviv, the latest in a deadly wave of terrorism in Israel.\nhttps://t.co/Fa0ny6T6R5",
  "data/tweet-nytimes/2022/4/1512251394564280321.json": "Footage has been found of an 11-year-old Prince supporting a Minneapolis teachers’ strike and being interviewed by a local TV station.\n\n“I think they should get some more money” because they’re “working extra hours for us and all that stuff,” Prince says. https://t.co/pEMluyNZyv",
  "data/tweet-nytimes/2022/4/1512155758804279302.json": "Scientists expect Covid-19 to eventually become endemic, something we learn to live with. But endemic diseases can take many forms, few of them harmless. We explored the possibilities. https://t.co/CMvDX19wwz",
  "data/tweet-nytimes/2022/4/1512374830175301633.json": "The Kramatorsk train station in eastern Ukraine was hit with a Tochka-U short-range ballistic missile as “thousands of peaceful Ukrainians were waiting to be evacuated,” President Volodymyr Zelensky said.\nhttps://t.co/2Ve47SvBvn https://t.co/4smKbYDcPN",
  "data/tweet-nytimes/2022/4/1512294202599743489.json": "Tesla will begin producing its electric pickup, the Cybertruck, next year, Elon Musk announced. https://t.co/CBA8ptwAYu",
  "data/tweet-nytimes/2022/4/1512362168070639619.json": "The front page of The New York Times for April 8, 2022. https://t.co/k8J7Ii5Ltn https://t.co/8AbisUG0jp",
  "data/tweet-nytimes/2022/4/1512373204886695936.json": "The FBI is preparing to investigate the handling of classified material that was found in Donald Trump’s Florida home after he left office. https://t.co/UoljJoesWl",
  "data/tweet-nytimes/2022/4/1512381001548324869.json": "The EU should adopt more sanctions against Russia, the president of the European Council said in response to images of dozens of reported civilian casualties after a Russian strike on a train station in eastern Ukraine.\nhttps://t.co/4Uzr2QLexc",
  "data/tweet-nytimes/2022/4/1512394859646263296.json": "A Russian strike on a train station in Kramatorsk, a city in eastern Ukraine, left at least 39 people dead and nearly 90 wounded, Ukrainian officials said. Platforms had been jammed in recent days with people rushing to reach safer areas in the west. https://t.co/ChZhTlkU3Y https://t.co/vbRfTAI7gw",
  "data/tweet-nytimes/2022/4/1512422536851693570.json": "There were 4,000 people at the train station in Kramatorsk, Ukraine, when it was attacked, according to the city’s mayor. Most were women, children and older people, he said. \n\nFollow updates. https://t.co/scIcGBxi0O https://t.co/bxhGQXAQVB",
  "data/tweet-nytimes/2022/4/1512469096109121537.json": "Ukrainian police inspected the remains of a large rocket with the words “for our children” in Russian next to the Kramatorsk train station. At least 50 people were killed and many more wounded in a rocket assault Friday morning. https://t.co/V4zTjgyQQv https://t.co/pBTli4Fp6y",
  "data/tweet-nytimes/2022/4/1512495518320050176.json": "Judge Ketanji Brown Jackson called her confirmation to the Supreme Court “the greatest honor of my life.” President Biden hailed a “real change” in American history as he and his supporters celebrated the ascension of the first Black woman to the court. https://t.co/1GmzhSYvCs https://t.co/xaqav3t0yy",
  "data/tweet-nytimes/2022/4/1512506518255644675.json": "Breaking News: Will Smith will be banned from attending the Oscars for 10 years, the Academy of Motion Picture Arts and Sciences said Friday, because of the “harmful behavior” he displayed when he slapped the comedian Chris Rock. https://t.co/24cIXV6ZLC",
  "data/tweet-nytimes/2022/4/1512510637322162186.json": "About 4,000 people were at the Kramatorsk train station trying to escape eastern Ukraine when a missile strike tore through it on Friday, killing at least 50 people and wounding nearly 100, according to Ukrainian officials. \n\nFollow live updates: https://t.co/D9QmnIcEue https://t.co/EVs2VRtRu6",
  "data/tweet-nytimes/2022/4/1512499097172946959.json": "Breaking News: Jurors acquitted two men of conspiring to kidnap Gov. Gretchen Whitmer of Michigan. The jurors said they were deadlocked on similar charges against two other men in the closely watched domestic terror case. https://t.co/dZXSuGxy79",
  "data/tweet-nytimes/2022/4/1512547113934147591.json": "“It has taken 232 years and 115 prior appointments for a Black woman to be selected to serve on the Supreme Court of the United States,” Judge Ketanji Brown Jackson said at a White House ceremony on Friday. “But we’ve made it. We’ve made it. All of us.” https://t.co/R7CNCKpR7e https://t.co/7tSPTmuZ1n",
  "data/tweet-nytimes/2022/4/1512520724824604674.json": "Companies in the Cayman Islands have frozen $7.3 billion in accounts believed to be tied to Russian oligarchs, financial regulators in the islands said. https://t.co/3cpvRXty3g",
  "data/tweet-nytimes/2022/4/1512528234101026820.json": "Residents of Kyiv returned to the streets as the city reopened after a month of Russian attacks on Ukraine’s capital subsided. https://t.co/LrCznUKETX https://t.co/qN2xcF9RC9",
  "data/tweet-nytimes/2022/4/1512543330223239169.json": "Russian soldiers spent weeks at Chernobyl, using it as a staging ground for the assault on the Ukrainian capital of Kyiv. Now there are signs that they may have exposed themselves to potentially harmful doses of radiation. https://t.co/FgJq5lTZf7",
  "data/tweet-nytimes/2022/4/1512508711276888074.json": "Will Smith is barred from attending the Oscars for 10 years, the Academy of Motion Picture Arts and Sciences said on Friday. The ban came a week after the actor resigned from the organization following his violent outburst during last month’s ceremony. https://t.co/1ZKWMpivaz https://t.co/K7MF4i5WhI",
  "data/tweet-nytimes/2022/4/1512476647290769408.json": "Flanked by Judge Ketanji Brown Jackson and Vice President Kamala Harris, President Biden said the judge’s confirmation to the Supreme Court has changed the course of American life. https://t.co/x3wKVlzevG https://t.co/Gtx9iILNxn",
  "data/tweet-nytimes/2022/4/1512581097334394883.json": "Donald Trump Jr. sent the White House chief of staff a text message two days after Election Day in 2020 that laid out strategies for declaring his father the winner regardless of the electoral outcome, people familiar with the exchange said on Friday. https://t.co/fluJgZRfaW",
  "data/tweet-nytimes/2022/4/1512568241121636357.json": "Breaking News: A major organizer of pro-Trump events after the 2020 election agreed to cooperate with the Justice Department’s expanding Jan. 6 investigation. https://t.co/61uuGpWyEM",
  "data/tweet-nytimes/2022/4/1512628888110829570.json": "President Volodymyr Zelensky of Ukraine described a missile attack on the Kramatorsk railway station that killed at least 50 civilians trying to evacuate from the fighting, including children, as “another war crime of Russia.”  https://t.co/kp6DiHHrzA",
  "data/tweet-nytimes/2022/4/1512576026735308801.json": "The FAA is is pushing for a $81,950 fine for a woman accused of hitting, spitting at, head-butting and biting flight crew members in July. It is the largest fine the agency has ever recommended against an unruly passenger. https://t.co/KE9CVdKAPE",
  "data/tweet-nytimes/2022/4/1512369709219561477.json": "Pink Floyd is releasing its first new track in almost three decades on Friday to raise money for the people of Ukraine, the band said on Thursday. https://t.co/mKlFNnSqit",
  "data/tweet-nytimes/2022/4/1512440503400288268.json": "Breaking News: A missile strike on a train station in Kramatorsk, Ukraine, killed at least 50 people and wounded nearly 100, according to Ukrainian officials, who blamed Russia for hitting a major evacuation point. https://t.co/fxsf8Z8GOQ",
  "data/tweet-nytimes/2022/4/1512596176649994245.json": "A Canadian steel industry billionaire illegally helped steer $1.75 million in donations to a pro-Trump super PAC and has agreed to pay one of the largest fines ever levied by the Federal Election Commission to settle the case, the commission said on Friday.https://t.co/TopIOEtDIM",
  "data/tweet-nytimes/2022/4/1512786724920995841.json": "At least 53 people — including Attorney General Merrick Garland and Valerie Biden Owens, the president’s sister — and have tested positive for Covid-19 after attending an A-list Washington dinner. https://t.co/86j0nuV5NU",
  "data/tweet-nytimes/2022/4/1512842905907568652.json": "Dwayne Haskins, 24, the backup Pittsburgh Steelers quarterback and a former standout at Ohio State, died Saturday, Steelers Coach Mike Tomlin said in a statement. Haskins's agent told ESPN that he died after being struck by a vehicle on a Florida highway. https://t.co/4bTueWeeKm https://t.co/mBW2bwPGVi",
  "data/tweet-nytimes/2022/4/1512836505903013891.json": "Since Russia invaded Ukraine in late February, women around Poland have been making trips to the Polish-Ukrainian border to offer rides to the multitudes of refugees seeking safe passage out of the country. https://t.co/kzbxQ3jsAO",
  "data/tweet-nytimes/2022/4/1512886261564030981.json": "Breaking News: Prime Minister Imran Khan of Pakistan has been removed from office after losing a no-confidence vote in Parliament. The vote capped a political crisis that has embroiled the country for weeks. https://t.co/K7Z6Xc9Moq",
  "data/tweet-nytimes/2022/4/1512826431159611403.json": "\"When we walked downstairs, we just saw dead bodies,\" said Viktoria Dubovitskaya, who was sheltering with her two children in Mariupol’s Drama Theater when it was devastated by a Russian airstrike. \"So many bodies. The whole place was covered in blood.\" https://t.co/kkGeK4TCQQ",
  "data/tweet-nytimes/2022/4/1512762288188674050.json": "Thieves made off with thousands of pounds of cheese, worth about $23,000, from a Dutch dairy farm last week. \"It was like waking up in a movie,\" said Gerda van Dorp, a cheese farmer. https://t.co/0CrHKQ1Bwd",
  "data/tweet-nytimes/2022/4/1512938422306054149.json": "Arthur D. Riggs, a biochemist whose pioneering research led him to breakthrough advances, including the invention of artificial insulin and monoclonal antibodies, has died at 82. His impact on the field of biotechnology was nothing less than revolutionary. https://t.co/9G1HLKwyOx",
  "data/tweet-nytimes/2022/4/1512979949464035332.json": "Former President Donald Trump’s eldest son sent the White House chief of staff a text message two days after Election Day in 2020 laying out strategies for declaring his father the winner regardless of the outcome, people familiar with the exchange said. https://t.co/wKaq3LIPqz",
  "data/tweet-nytimes/2022/4/1512919556716740609.json": "“The ceiling fell and it all came down on her. She was shouting, ‘Mom, save me!’”\n\nAn 85-year-old mother recalls a desperate struggle to save her daughter in eastern Ukraine when a Russian bombardment destroyed her house. https://t.co/p9F0F1IwBb",
  "data/tweet-nytimes/2022/4/1512686824556310530.json": "Gerda Weissmann Klein's story of surviving the Holocaust became the subject of an Oscar-winning documentary and her advocacy for tolerance and civic education won her a Presidential Medal of Freedom. She died at age 97. https://t.co/MjIEhF5pp5",
  "data/tweet-nytimes/2022/4/1512535782896115714.json": "SpaceX and NASA launched their first space tourism mission on Friday, sending three paying customers and a retired NASA astronaut to the International Space Station. Seats for the 10-day trip were $55 million each. https://t.co/1CUt97n3LB https://t.co/pYxpt52scM",
  "data/tweet-nytimes/2022/4/1513130959671025677.json": "There’s a new 750-mile bicycle route in New York. We rode every inch of it, from Manhattan to Buffalo to the Canadian border. This is what it was like. https://t.co/elKOP6LdIO",
  "data/tweet-nytimes/2022/4/1513176246578032646.json": "Chanel suspended operations in Russia in response to Vladimir Putin’s invasion of Ukraine, and asked customers in global stores to attest that their items would not be used in Russia. \n\nNow, Russian influencers are cutting up their Chanel bags in protest. https://t.co/ZP1LUPsJuA",
  "data/tweet-nytimes/2022/4/1513055441630240771.json": "World leaders have vowed to hold Vladimir Putin responsible for war crimes in Ukraine. If past prosecutions of war crimes are any indication, the process takes years of investigations and litigation that are only decided decades after a conflict ends. https://t.co/GxtttLBH8s",
  "data/tweet-nytimes/2022/4/1513225321805488141.json": "Representative Liz Cheney said Sunday that the Russian government was engaged in a genocide in Ukraine, two days after more than 50 people were killed in a missile strike at Kramatorsk's train station.\n\n\"I think this clearly is genocide,\" she said on CNN. https://t.co/jTdDcb0xPm",
  "data/tweet-nytimes/2022/4/1513221545526808578.json": "A murder charge against a woman in Texas in connection with a “self-induced abortion” will be dismissed, a Texas district attorney announced. He said the woman \"cannot and should not be prosecuted for the allegation against her.\" https://t.co/poxeDXP3U3",
  "data/tweet-nytimes/2022/4/1513271567500943362.json": "Six months after leaving the White House, Jared Kushner secured a $2 billion investment from a fund led by the Saudi crown prince, a close ally during the Trump administration, despite objections from the fund’s advisers about the merits of the deal. https://t.co/FDlmrzvYdw https://t.co/OHfyPVHsHN",
  "data/tweet-nytimes/2022/4/1513218397395427329.json": "Breaking News: Eric Adams, the mayor of New York City, tested positive for the coronavirus on Sunday, his 100th day in office. He is isolating and canceling the rest of his events for the week, a spokesman said. https://t.co/rxEVb5KJCu",
  "data/tweet-nytimes/2022/4/1513327222945366016.json": "A new law in Maryland will allow trained medical professionals other than physicians to perform abortions. It also invests $3.5 million a year into abortion-care training, and requires most insurance providers in the state to cover the cost of an abortion. https://t.co/dh48IZ5hON",
  "data/tweet-nytimes/2022/4/1513459361129156609.json": "Russian attacks on the Kharkiv region of Ukraine on Sunday killed 11 people, including a child, the regional governor said.\n\nFollow our updates on the war. https://t.co/QyhnRGSAAi https://t.co/hPrlofKp5k",
  "data/tweet-nytimes/2022/4/1513456838800519175.json": "China has increasingly amplified Russia’s campaign to sow disinformation about the war in Ukraine, undercutting U.S. and European diplomatic efforts. The result is an alternate reality of the war for a global audience. https://t.co/i0GNRoXRBs",
  "data/tweet-nytimes/2022/4/1513464428280401922.json": "Six months after leaving the White House, Jared Kushner secured a $2 billion investment from a fund led by the Saudi crown prince, a close ally during the Trump administration, despite objections from the fund’s advisers about the merits of the deal. https://t.co/bamrRp9VVj",
  "data/tweet-nytimes/2022/4/1513502177146384392.json": "French experts arrived in Ukraine to help investigate possible war crimes committed by Russian forces, France announced. Coroners and crime scene investigators will help identify bodies and gather evidence in the Kyiv suburb of Bucha, authorities said. https://t.co/meqCV9YZbk",
  "data/tweet-nytimes/2022/4/1513281933551284227.json": "\"We'll bury them, like humans\": Following the withdrawal of Russian forces from a Kyiv suburb, officials examined and documented the bodies of those who lost their lives in the war. https://t.co/6p1Ifks8vD",
  "data/tweet-nytimes/2022/4/1513549965792100363.json": "The New York Times documented the bodies of almost three dozen people where they were killed in Bucha — in their homes, in the woods, in a vacant parking lot — and learned the story behind many of their deaths. Read more: https://t.co/UfJBpaoiY9 https://t.co/PdPPrMi1G6",
  "data/tweet-nytimes/2022/4/1512806318788300809.json": "Floridians cherish manatees, but people have failed to care for the animals’ environment, putting the species’ survival at risk. As manatees are disappearing in large numbers, humans are trying crisis measures in desperate attempts to keep them alive. https://t.co/QYFG21Y2cN https://t.co/XVucRlFTmo",
  "data/tweet-nytimes/2022/4/1513551251660754946.json": "Photographers in New Zealand are capturing bioluminescence, a phenomenon in which glowing algae give crashing waves an electric blue glow. One enthusiast sometimes stays out until sunrise: \"it does come down to blind luck.\" https://t.co/heJExB0D4B https://t.co/IkUidb5baB",
  "data/tweet-nytimes/2022/4/1513495849938079751.json": "“This was Trump pulling a Putin.” For @NYTMag, @DraperRobert talked to Fiona Hill, John Bolton and other former Trump advisers about the ex-president's pressure campaign on Ukraine, the Russian invasion, Jan. 6 — and what connects them.\nhttps://t.co/u0KvJZlmkw",
  "data/tweet-nytimes/2022/4/1513566335980249092.json": "The Pentagon on Monday confirmed that Russia is sending hundreds of military vehicles, including infantry and combat helicopter support units, and artillery to eastern Ukraine in preparation for a major new phase of the seven-week war. https://t.co/JjLTRdjwUU",
  "data/tweet-nytimes/2022/4/1513593450373038086.json": "Breaking News: With Covid cases low but rising sharply, Philadelphia will reinstate its indoor mask mandate next week, city officials said, a little more than a month after lifting it. It's the first major U.S. city to do so. https://t.co/cBqUg2WHBe",
  "data/tweet-nytimes/2022/4/1513619098240000008.json": "Britney Spears announced on Monday that she is pregnant. During her successful effort to end her conservatorship, the performer had complained that the team appointed to supervise her had blocked her from having additional children. https://t.co/Yp7ZGjaj4a",
  "data/tweet-nytimes/2022/4/1513584672906911747.json": "Two Buffalo police officers who shoved a 75-year-old man to the ground during a protest in 2020 have been cleared by an arbitrator, who said the use of force was “absolutely legitimate.” A video showing the man motionless and bleeding sparked outrage. https://t.co/5icq03G0zu",
  "data/tweet-nytimes/2022/4/1513213989215522826.json": "Johnny Depp could not convince a judge in London that he was innocent of allegations that he had abused his former wife, Amber Heard. But in a trial starting Monday, the actor will take his defamation complaint to a jury in Virginia. https://t.co/2UZVa9vCbV",
  "data/tweet-nytimes/2022/4/1513648102624104453.json": "President Volodymyr Zelensky warned that “tens of thousands” of Russian troops were poised for a major assault in the east. Ukrainian officials urged civilians to escape while there was still time. https://t.co/CvB0HOfnBB",
  "data/tweet-nytimes/2022/4/1513419095936544768.json": "A Ukrainian soccer team, Shakhtar Donetsk, was forced from its country by the Russian invasion. \n\nNow the team is going to play a series of exhibition games to raise money for the war effort. https://t.co/nQWLJK4DeR https://t.co/RaX5NuwDxb",
  "data/tweet-nytimes/2022/4/1513728658309099525.json": "The chemical derived from psychedelic mushrooms appeared to have a \"liberating\" effect on the brains of people with severe depression, the authors of a small study said, helping alleviate symptoms and generating neural responses that lasted for weeks. https://t.co/RLxpCfoXar",
  "data/tweet-nytimes/2022/4/1513487070559408134.json": "As the Russian advance on Ukraine’s capital stalled, a campaign of terror and revenge against civilians nearby in Bucha began, survivors and investigators say. The New York Times visited the suburb after Russia’s retreat to uncover the scale of atrocities. https://t.co/7aVUpsqqdx https://t.co/29iGhpdI09",
  "data/tweet-nytimes/2022/4/1513668281739235333.json": "A California woman who tackled a Black teenager at a New York City hotel after falsely accusing him of stealing her cellphone pleaded guilty to a felony hate crime charge stemming from the altercation. Parts of it were captured in a widely seen video. https://t.co/1acjrvYLz6",
  "data/tweet-nytimes/2022/4/1513713564367953925.json": "President Volodymyr Zelensky says Ukraine takes “as seriously as possible” an apparent threat of Russian chemical weapon use. https://t.co/EBnay4NPWv",
  "data/tweet-nytimes/2022/4/1513625463415058433.json": "Dozens of bodies buried during the Russian occupation of the Kyiv suburb of Bucha are being exhumed. Ukrainian officials are working to identify them. https://t.co/XAZoLCst5h https://t.co/tRjdBeLZJi",
  "data/tweet-nytimes/2022/4/1513838112832688130.json": "Nokia, whose equipment helps provide internet and communications in Russia, said it was exiting the country because of the war in Ukraine. Word of the Finland-based company’s departure closely followed a similar announcement by Ericsson, a Swedish rival. https://t.co/ujrKFZgPBS",
  "data/tweet-nytimes/2022/4/1513870515919851520.json": "Breaking News: Several people were shot on a Brooklyn subway platform during the Tuesday morning commuter rush, officials said. The attack occurred at the 36th Street station in Sunset Park. https://t.co/NiP843NRwx",
  "data/tweet-nytimes/2022/4/1513870108552220673.json": "Breaking News: Boris Johnson will be fined for breaking UK lockdown rules at Downing Street, making him the first British prime minister to be found breaking the law in living memory. https://t.co/WwAzn2EgOQ",
  "data/tweet-nytimes/2022/4/1513877761680678921.json": "Several people were shot on the platform of the 36th Street subway station in Brooklyn on Tuesday, officials said. The police are seeking a man in a worker’s vest and gas mask.\n\nFollow our updates. https://t.co/I89OVcr2Jv",
  "data/tweet-nytimes/2022/4/1513874551578443786.json": "Breaking News: Brian Benjamin, New York’s lieutenant governor, was arrested in connection with a scheme to funnel fraudulent donations to a prior campaign. https://t.co/eux4n1r8Nq",
  "data/tweet-nytimes/2022/4/1513902796554256386.json": "Police are seeking a man with a gas mask and an orange construction vest who had been wearing a dark blue outfit that appeared to resemble that of a transit worker, a senior law enforcement official said.\n\nLive updates about the Brooklyn shooting: https://t.co/YeAbAMYsKa",
  "data/tweet-nytimes/2022/4/1513821758943551491.json": "Britney Spears announced on Monday that she is pregnant. During her successful effort to end her conservatorship, the performer had complained that the team appointed to supervise her had blocked her from having additional children. https://t.co/bFWiQbuUUT https://t.co/mRWpPdn6mE",
  "data/tweet-nytimes/2022/4/1513919260262817798.json": "Breaking News: At least 16 people were injured, 10 of them shot, after a man in a gas mask set off a canister of smoke and opened fire on a subway train in Sunset Park, Brooklyn, officials said. The police are still seeking the suspect. https://t.co/ccYnt1La0r",
  "data/tweet-nytimes/2022/4/1513938019820126212.json": "John Butsikares, a freshman at Brooklyn Technical High School, said he had only just started taking the New York subway by himself last fall. Before Tuesday's shooting in Sunset Park, he had never questioned the trips. https://t.co/SVLuKTg8KC https://t.co/yoaNZMpidw",
  "data/tweet-nytimes/2022/4/1513946322700836870.json": "At least 16 people were injured, 10 of them by gunfire, in the subway in Brooklyn during the Tuesday morning rush, officials said, after a man released a canister of smoke and opened fire on an N train. The suspect is still at large. https://t.co/U8uvNYYutA https://t.co/YlUmpCoaY7",
  "data/tweet-nytimes/2022/4/1513928720330989570.json": "Yelp will cover expenses for its employees and their spouses who must travel out of state for abortion care, becoming the latest company to respond as states enact new restrictions on the procedure. Yelp will offer the benefit to workers in any state. https://t.co/J1dNJfUMNU",
  "data/tweet-nytimes/2022/4/1513635523713241092.json": "Elon Musk, Twitter’s largest shareholder and one of its highest-profile users, could very well use the social media platform against itself and even buy enough shares to take over the company. It leaves Twitter with an activist investor unlike any other. https://t.co/KB3YHkXq3k",
  "data/tweet-nytimes/2022/4/1513962697452359681.json": "The search for the gunman was hampered by the fact that the Sunset Park station’s security camera system wasn’t working, Mayor Eric Adams said.\n\nFollow along with our live updates. https://t.co/G7IxpgKq7e",
  "data/tweet-nytimes/2022/4/1513992186613932034.json": "Breaking News: Lt. Gov. Brian Benjamin of New York resigned, hours after he was arrested on charges of bribery, fraud and falsification of records. https://t.co/TOgtryXO57",
  "data/tweet-nytimes/2022/4/1513924078402514945.json": "President Vladimir Putin of Russia said on Tuesday that peace talks with Ukraine had reached a “dead end” and called the evidence of Russian atrocities in the Kyiv suburb of Bucha “fake.” https://t.co/9MVq219VFz",
  "data/tweet-nytimes/2022/4/1513986591760527361.json": "Gilbert Gottfried has died at 67. The comedian was known for his distinctive voice in stand-up, commercials and the movie “Aladdin.” https://t.co/nCULh29Clu https://t.co/uRw8AT4QHv",
  "data/tweet-nytimes/2022/4/1513985376511303685.json": "A congressman persuaded fellow Republicans to abruptly turn against a bid to name a federal courthouse after the first Black man to serve on Florida’s supreme court. Asked why he voted against a bill he co-sponsored, Rep. Vern Buchanan said: “I don’t know.”https://t.co/KRAIlETRak",
  "data/tweet-nytimes/2022/4/1513974017325158414.json": "Smoking a joint or taking an edible before getting behind the wheel can pose distinctive risks, experts say, because there’s no standard dose for marijuana. https://t.co/wpbaqDdvyz https://t.co/h4owp9wNrv",
  "data/tweet-nytimes/2022/4/1513966460418285576.json": "“The only reason to keep secrets is because of shame. I don’t want to do that anymore,” Viola Davis said in an interview with @nytmag. https://t.co/oH32CLkyQH https://t.co/DwKKtNEfb6",
  "data/tweet-nytimes/2022/4/1513826271083520007.json": "New Zealand will send more than 50 soldiers to Europe to help distribute aid to Ukraine. A majority of them will help transport an enormous amount of military equipment being donated for the war effort. https://t.co/WFFhBju4F7",
  "data/tweet-nytimes/2022/4/1513981563238760455.json": "A top U.S. defense official said on Tuesday that the Pentagon would convene a classified meeting with the leaders of the biggest American military contractors on Wednesday to discuss stepped-up assistance to Ukraine. https://t.co/yulkXMVOak",
  "data/tweet-nytimes/2022/4/1514060823706144773.json": "Gilbert Gottfried, the comedian known for his distinctive voice in stand-up, commercials and the movie “Aladdin,” has died at 67. https://t.co/CymWiYOKV8 https://t.co/7G3cXLnQ2B",
  "data/tweet-nytimes/2022/4/1514070889121390592.json": "Ukrainian officials said on Tuesday that they had thwarted a Russian cyberattack on Ukraine’s power grid that could have knocked out power to two million people. https://t.co/tIcllG92ZV",
  "data/tweet-nytimes/2022/4/1514158977545814017.json": "The World Bank is preparing to deliver $1.5 billion in aid to Ukraine to help the country maintain government operations amid Russia’s offensive, the World Bank president said on Tuesday. https://t.co/etT5fdYOD3",
  "data/tweet-nytimes/2022/4/1514211849918685186.json": "Mimi Reinhard, a secretary at a Nazi labor camp in World War II who typed up Schindler’s list, has died at 107. She added her own name to the list of 1,100 Jews who would be not be sent the gas chambers. https://t.co/S1Sp6oEVvW",
  "data/tweet-nytimes/2022/4/1514215601023160326.json": "The consulting firm McKinsey &amp; Company repeatedly allowed employees who served pharmaceutical companies, including opioid makers, to also consult for the FDA, internal records show.\n\nAnd McKinsey touted that inside access in pitches to private clients. https://t.co/GwDt8dMMVi",
  "data/tweet-nytimes/2022/4/1514282280147206153.json": "\"Yes, I called it genocide.\" For the first time on Tuesday, President Biden accused Russia’s president, Vladimir Putin, of perpetrating genocide on the Ukrainian people. But he emphasized that was his personal view, not a legal determination. https://t.co/FsCr2qhyq7 https://t.co/NDesApzoac",
  "data/tweet-nytimes/2022/4/1514264696190377987.json": "Using a mix of high-tech and Cold War tactics, Ukrainian activists and Western institutions have begun to pierce the propaganda bubble in Russia, circulating information about the Ukraine war among Russian citizens. https://t.co/cYRGDTVzyf",
  "data/tweet-nytimes/2022/4/1514305177775484940.json": "Breaking News: The suspect in the Brooklyn subway shooting has been arrested, officials say. https://t.co/lOw9PGgSBK",
  "data/tweet-nytimes/2022/4/1514308994344665095.json": "Breaking News: The police captured Frank James, a man accused of shooting 10 people in Brooklyn, officials said, after a more than 24-hour manhunt.\n\nFollow live updates. https://t.co/kitO26kNbA https://t.co/fRTxV5fXBH",
  "data/tweet-nytimes/2022/4/1514272619545174018.json": "Breaking News: The CDC extended the federal mask mandate for airports, planes and public transit until May 3. It was set to expire in five days. https://t.co/1XJhKnYGgl",
  "data/tweet-nytimes/2022/4/1514192934115098634.json": "\"The fear in China now is that the 'zero Covid' policy has become another Mao-style political campaign that is based on the will of one person, the country’s top leader, Xi Jinping — and that it could end up hurting everyone,\" our columnist @liyuan6 writes.https://t.co/0J1iVHwsC3",
  "data/tweet-nytimes/2022/4/1514328843695407109.json": "Russian forces in Ukraine have committed violations of international humanitarian law, some of which could constitute war crimes, the Organization for Security and Cooperation in Europe found. https://t.co/soPT8noeAm",
  "data/tweet-nytimes/2022/4/1514238671649751042.json": "Authorities in Jersey in the Channel Islands said they froze $7 billion in assets believed to belong to Roman Abramovich, a Russian oligarch sanctioned by Britain. https://t.co/afN5C81WcG",
  "data/tweet-nytimes/2022/4/1514336426808205317.json": "When a Russian missile strike hit a maternity hospital in Mariupol in March, Elena Karas, a nurse, was taking care of 13 premature babies. She was one of six medical workers in her ward who continued to work despite the dangers of commuting in the city. https://t.co/oIdFKpJvh2 https://t.co/5GBMVU5yu0",
  "data/tweet-nytimes/2022/4/1514343940622888963.json": "The U.S. has increased the flow of intelligence to Ukraine. The information could allow the Ukrainians to conduct more effective counterattacks against Russian forces in the Donbas or Crimea, or better predict the movement of Russian troops. https://t.co/TZdllHhsj4",
  "data/tweet-nytimes/2022/4/1514377923247194113.json": "After a manhunt, police announced they had arrested Frank James, 62, in connection with the mass shooting on a subway train in Brooklyn that injured at least 23 people. https://t.co/xCYEhTgMZN https://t.co/QqgRlBVXNH",
  "data/tweet-nytimes/2022/4/1514418176414691332.json": "In a rapid response to Russia’s invasion of Ukraine and in the face of Moscow’s warnings to NATO to stop its enlargement, Finland and Sweden are seriously debating applications for membership in the alliance and are widely expected to join. https://t.co/u6yFNHTTVW",
  "data/tweet-nytimes/2022/4/1514410637451055105.json": "Investigators from almost a dozen countries combed towns and graves in Ukraine for evidence of war crimes, and an investigation by an international organization detailed what it said were “clear patterns” of human rights violations by Russian forces. https://t.co/8KkPhoLuIY",
  "data/tweet-nytimes/2022/4/1514327594627473416.json": "The U.S. will send an additional $800 million worth of military and other security aid to Ukraine to help fight against Russia’s invasion, President Biden told President Volodymyr Zelensky on Wednesday. https://t.co/WyBQu1dR2x",
  "data/tweet-nytimes/2022/4/1514305122599383044.json": "As Ukrainians emerge from basements and bunkers into the ruins of their hometowns, many are being confronted with a new horror: thousands of mines and unexploded bombs left behind by retreating Russian troops. https://t.co/e4N3RzRv25 https://t.co/ETAE914nA4",
  "data/tweet-nytimes/2022/4/1514433269344915464.json": "The U.S. will send an additional $800 million worth of military and other security aid to Ukraine and step up intelligence sharing, American officials announced, as Russian forces appeared to be preparing for a new offensive in the country’s east. https://t.co/Sdoo44FTz1",
  "data/tweet-nytimes/2022/4/1514556214499287042.json": "Breaking News: Elon Musk offered to buy Twitter for $54.20 a share, just weeks after he became the social media company’s largest shareholder. https://t.co/BPuAGSBLma",
  "data/tweet-nytimes/2022/4/1514576727158267910.json": "Elon Musk launched a takeover bid for Twitter, weeks after he became the platform’s largest shareholder. Musk’s offer of $54.20 a share would value the company at about $43 billion.\n\nFollow our updates.\nhttps://t.co/naejFunx1D https://t.co/CWIeyBxQlz",
  "data/tweet-nytimes/2022/4/1514551560189190147.json": "On \"Old Enough!,\" Japanese toddlers try to run errands alone for the first time — with mixed results.\n\n\"It's a typical way of raising children in Japan and symbolic of our cultural approach,\" a child development expert said. The show is now on Netflix. https://t.co/Zlp4uTNsF3 https://t.co/9XyTHXh45a",
  "data/tweet-nytimes/2022/4/1514604431878152208.json": "The Moskva, a key Russian warship, suffered catastrophic damage that a Ukrainian official said was from a defense missile strike, though Russia claimed it was caused by an onboard fire. Russia said the fire was contained, but Ukraine said the ship sank. https://t.co/Ko7EqtKxyP",
  "data/tweet-nytimes/2022/4/1514600876169576453.json": "Elon Musk said if his offer to buy Twitter was rejected, he'd reconsider his position as the company's largest shareholder, citing concerns over the platform’s current leadership.\nhttps://t.co/ditITWYv7F https://t.co/uggeamfcGF",
  "data/tweet-nytimes/2022/4/1514633219806838784.json": "Breaking News: EU officials have begun drafting a ban on Russian oil imports, a move long resisted because of its potential to raise energy prices. https://t.co/CKwpTJ5Nq3",
  "data/tweet-nytimes/2022/4/1514649735453368326.json": "New York City has been celebrating a new hero: Zach Tahhan, a 21-year-old Syrian who moved to the U.S. five years ago. He is one of several people who say they led the police to the Brooklyn subway shooting suspect. https://t.co/9dFdOSkQqU https://t.co/IhhllEtnZ1",
  "data/tweet-nytimes/2022/4/1514730249573089288.json": "Russia says its warship Moskva was damaged by a fire and sank while being towed to port. Ukraine says it hit the flagship of Russia’s Black Sea fleet with a missile strike. https://t.co/Z6I1WtxL5A https://t.co/JOSAo4UcFY",
  "data/tweet-nytimes/2022/4/1514706353113243654.json": "The Russian Defense Ministry says its naval flagship Moskva has sunk in the Black Sea while being towed in a storm. Ukraine had claimed it hit the warship with a missile. \n\nFollow live updates: https://t.co/hRURDz64cf https://t.co/381hzTxIvB",
  "data/tweet-nytimes/2022/4/1514612700436852736.json": "The U.S. offered Slovakia, a fellow NATO member, American-made Patriot missiles if it would “donate” its Soviet-era antiaircraft system to Ukraine.\n\nWeapons from other nations are also flowing through the country to Ukrainian troops.\nhttps://t.co/DtphuI3jW5",
  "data/tweet-nytimes/2022/4/1514577993443721221.json": "In a symbolic victory for Ukraine, the Moskva, the flagship of Russia’s Black Sea Fleet, suffered damage that a Ukrainian official said was the result of a missile strike by coastal defense forces. Russia claimed the damage was caused by an onboard fire. https://t.co/RtGs5fl1qm",
  "data/tweet-nytimes/2022/4/1514440834225254410.json": "The U.S. is considering whether to send a high-level official to Kyiv, Ukraine’s capital, in the days ahead as a sign of support for Ukraine in its war with Russia, according to a person familiar with the internal discussions.\nhttps://t.co/t1Dz0NPsOo",
  "data/tweet-nytimes/2022/4/1514490908254904323.json": "Friendly reminder: you can eat those stickers on fruit, if you really want to. https://t.co/dG5TgU2R65",
  "data/tweet-nytimes/2022/4/1514785686464860166.json": "An Ohio man who claimed that Donald Trump was legally responsible for his decision to break into the U.S. Capitol on Jan. 6, 2021 was convicted on Thursday in the first trial connected to the riot to feature a defense that blamed the former president. https://t.co/IOt65o1DSo",
  "data/tweet-nytimes/2022/4/1514740305941118980.json": "Ed Buck, a onetime Democratic donor and activist, was sentenced by a federal judge in Los Angeles on Thursday to 30 years in prison for giving two men fatal doses of methamphetamine at his West Hollywood apartment, prosecutors said. https://t.co/wEzS8YiiOP",
  "data/tweet-nytimes/2022/4/1514313757790453761.json": "In a rapid response to Russia’s invasion of Ukraine and in the face of Moscow’s warnings to NATO to stop its enlargement, Finland and Sweden are seriously debating applications for membership in the alliance and are widely expected to join. https://t.co/J9nktQlFFy",
  "data/tweet-nytimes/2022/4/1514780563730698253.json": "The comet’s core could be up to 85 miles across, making it more than twice the width of the state of Rhode Island. \n\nIt also has a mass of 500 trillion tons, equivalent to roughly 2,800 Mount Everests. https://t.co/MHxlIFdr0d",
  "data/tweet-nytimes/2022/4/1514840976417820673.json": "Russia’s war against Ukraine suffered a pair of setbacks Thursday when Moskva, the flagship of Russia’s Black Sea fleet, sank after a catastrophic explosion and fire, as the European Union moved closer to an embargo on Russian oil imports. https://t.co/44sMimCxct",
  "data/tweet-nytimes/2022/4/1514928275407220739.json": "Samia Suluhu Hassan, who became Tanzania’s first female president when her predecessor died suddenly, is setting a new course for her country. On Friday, she is set to meet with Vice President Kamala Harris.\nhttps://t.co/mjOR8QUCBK",
  "data/tweet-nytimes/2022/4/1514830939410599938.json": "The second season of \"Bridgerton\" has broken Netflix viewing records and catapulted Jonathan Bailey to new fame. But Bailey isn't basking in the spotlight. He has been onstage most nights, starring in a play called \"Cock.\" https://t.co/ypEvPTbQSs https://t.co/ValIFVUtAm",
  "data/tweet-nytimes/2022/4/1514978141021917185.json": "The FDA granted emergency use authorization to the first Covid-19 test that can detect the coronavirus in a breath sample, within minutes and with a high degree of accuracy, the agency said Thursday. https://t.co/Mprpyn5p98",
  "data/tweet-nytimes/2022/4/1515007931225366538.json": "Breaking News: Twitter rebuffed Elon Musk’s takeover bid with a so-called poison pill that would flood the market with new shares if he buys 15% of its stock. Musk currently owns more than 9%. https://t.co/x8IsysIFp0",
  "data/tweet-nytimes/2022/4/1515066200375574529.json": "Twitter countered Elon Musk’s offer to buy the company with a corporate tool known as a poison pill.\n\nHere's what that means, how it works and why it could make it much more difficult for Musk to take over Twitter. https://t.co/JLoKBO0ZLk https://t.co/JVCRWJcII4",
  "data/tweet-nytimes/2022/4/1515108060037107718.json": "Liz Sheridan, a stage, film and television actress best known for playing Helen Seinfeld, Jerry’s mother on the acclaimed sitcom “Seinfeld,” died on Friday. She was 93. https://t.co/2EZ44wiRhR",
  "data/tweet-nytimes/2022/4/1515122827795521537.json": "Two Ukrainian missiles struck the Moskva, a prized Russian ship, U.S officials confirmed. The sinking of the Moskva on Thursday was a major blow to the Russian fleet and the most significant combat loss for any navy since 1982. https://t.co/KAYsPykhKw",
  "data/tweet-nytimes/2022/4/1515095155182866432.json": "Russian media has increasingly seized on Fox News’s prime-time segments, its opinion pieces and even the network’s active online comments section to depict America’s foreign policy as a threat to Russia’s interests. https://t.co/EgpT9zuIIE",
  "data/tweet-nytimes/2022/4/1515112761776381962.json": "More than 150 people were injured in fighting between Israeli riot police and Palestinians at the Aqsa Mosque compound, one of Jerusalem’s holiest sites, on Friday, the first day of a rare convergence of Ramadan, Easter and Passover. https://t.co/ibZE00kgr0 https://t.co/Qj2cLbSN2N",
  "data/tweet-nytimes/2022/4/1515034762880167944.json": "Ramzan Kadyrov, the leader of Chechnya, is accused of gruesome human rights abuses and is a close ally of President Vladimir Putin. Yet several athletes in the world of UFC and mixed martial arts have kept ties with him. https://t.co/axTSW6845c",
  "data/tweet-nytimes/2022/4/1514981906621812743.json": "The sinking of one of Russia’s most formidable warships, the Moskva, is a stunning blow for the country — whether the ship sank after an accidental fire, as Russia’s Defense Ministry maintains, or after being struck by missiles, as Ukraine has claimed. https://t.co/02ruUb3dSx",
  "data/tweet-nytimes/2022/4/1515137942976671748.json": "Russia has warned the Biden administration to stop supplying advanced weapons to Ukrainian forces or face “unpredictable consequences.” The message suggested rising concerns in Moscow that the weapons were hindering its combat capabilities. https://t.co/WbWleI942T",
  "data/tweet-nytimes/2022/4/1515200845687795715.json": "Samia Suluhu Hassan, Tanzania’s first female vice president, is also the only female head of government in Africa. On Friday, she met in Washington with a fellow path-breaker, Vice President Kamala Harris. https://t.co/D37y3VmEHD",
  "data/tweet-nytimes/2022/4/1515327923380760577.json": "After nearly 80 years, a watch that was taken by a Nazi soldier during World War II, lost in a cornfield and later hidden in a clock on a farm in Belgium, has been returned to the grandchildren of its maker.\n\nAnd it still works. https://t.co/68JoCCpycd",
  "data/tweet-nytimes/2022/4/1515358120570204164.json": "What does it feel like under Russian bombardment? Our cameras captured life on the front lines in southeast Ukraine, where shelling is relentless and the war feels like it's inching closer every day. https://t.co/mNEqqiX95S https://t.co/nvNfLVwo7K",
  "data/tweet-nytimes/2022/4/1515414779103432708.json": "The World Health Organization calculated that 15 million people have died from the Covid pandemic. But the release of this staggering estimate has been delayed for months because of objections from India, which has tried to keep it from becoming public. https://t.co/RRNEGqUSKD",
  "data/tweet-nytimes/2022/4/1515261249734512641.json": "The FDA granted emergency use authorization to the first Covid-19 test that can detect the coronavirus in a breath sample, within minutes and with a high degree of accuracy, the agency said Thursday. https://t.co/SS1vWkuIQQ",
  "data/tweet-nytimes/2022/4/1515456273369776128.json": "Russia is ambling toward a major default on its foreign debt, a grim milestone that it has not seen since the Bolshevik Revolution more than a century ago. It could cause years of legal wrangling and pit Russia against big investors from around the world. https://t.co/Hy90FiBaDF",
  "data/tweet-nytimes/2022/4/1515433615437484032.json": "Ukrainian refugees are attending Passover Seders, revisiting the Jewish story of flight as they themselves live as refugees. Here's what our reporter saw at a Seder with about 40 Ukrainians. https://t.co/q7d7nUmkoY https://t.co/8wHHWyaXDu",
  "data/tweet-nytimes/2022/4/1515373203228708876.json": "Germany’s energy minister has called on people to cut back their energy consumption, including by drawing curtains and lowering the temperature in their homes, as part of what he described as a national effort to reduce dependence on Russian fossil fuels. https://t.co/g6bdWVsSqN",
  "data/tweet-nytimes/2022/4/1515561965606912001.json": "Peng Ming-min, a victim of World War II who endured Japanese imperial rule, brutal Chinese martial law and decades of exile to become a leading fighter for democracy and self-determination for his native Taiwan, died in the capital city Taipei. He was 98. https://t.co/CDmi7Ukld4",
  "data/tweet-nytimes/2022/4/1515291461113331714.json": "As many as 200,000 American children have lost a parent to Covid. The New York Times spoke to several grandparents who have stepped in after losses.\nhttps://t.co/4hZlr7mVeB",
  "data/tweet-nytimes/2022/4/1515016774663774212.json": "Breaking News: A U.S. official said Ukraine’s missiles hit the Russian flagship Moskva that sank in the Black Sea. And President Vladimir Putin warned the U.S. to stop sending arms. Here’s the latest. https://t.co/OErvfKSn6O",
  "data/tweet-nytimes/2022/4/1515686536112713732.json": "He asked a manager not to throw him a birthday party because he had an anxiety disorder. When other employees planned a celebration, the situation quickly spiraled out of control.\n\nNow, a jury has awarded him $450,000 for lost wages and emotional distress. https://t.co/18qsPqeszS",
  "data/tweet-nytimes/2022/4/1515388307936624651.json": "In Opinion\n\n\"The best photographs of war might make us want to look away,\" writes David Hume Kennerly (@kennerly), a Pulitzer Prize-winning photographer. \"It’s imperative that we do not.\" https://t.co/plGVs3c4jR",
  "data/tweet-nytimes/2022/4/1515731837125070859.json": "The Neptune missiles used to sink a warship from Russia’s Black Sea fleet were built at home in Ukraine, as part of a coastal defense system designed to hide below enemy radar and evade counterattacks. https://t.co/kOqM1HDOl1",
  "data/tweet-nytimes/2022/4/1515478901140725761.json": "Ahmet Nejat Ozsu won’t budge. For 15 years, he has lived in the same apartment — a one-bedroom on the Upper West Side. When a developer bought the building for $70 million and told tenants that they had to move, Ozsu made plans to stay. https://t.co/CK8PytIRp7",
  "data/tweet-nytimes/2022/4/1515795337579012102.json": "A Russian missile attack injured four people working for José Andrés’ World Central Kitchen operation in the northeast Ukrainian city of Kharkiv.\n\n\"Just absolutely horrific brutality,\" the organization’s chief executive said in a video from the scene. https://t.co/ecplu8cr13",
  "data/tweet-nytimes/2022/4/1515780903422865408.json": "Violence remains commonplace within the Russian military, where more senior soldiers routinely abuse junior ones. Experts say that violence, coupled with a lack of independent oversight, makes war crimes against Ukrainians more possible. https://t.co/nKROGaIi0U",
  "data/tweet-nytimes/2022/4/1515773354015399939.json": "Ukrainians packed churches on Sunday for Easter commemorations that combined ancient traditions with the reality of war. Many families in the country’s small Roman Catholic community were missing men who are off fighting or volunteering in the war effort. https://t.co/qs9T22doUp https://t.co/JneqHNsbwy",
  "data/tweet-nytimes/2022/4/1515808058370408448.json": "Devon Henry and his contracting company have hauled away 23 Confederate monuments across the South. But the work comes with considerable personal risk: He has been repeatedly threatened, carries a firearm and often wears a bulletproof vest on job sites. https://t.co/vH0fjcB9NA https://t.co/pyxQkoFwty",
  "data/tweet-nytimes/2022/4/1515822426105552900.json": "Elon Musk is frequently described as libertarian, but that fails to capture how paradoxical and random his politics can be. There is not much consistency in his statements or Twitter commentary — except that they often align with his business interests. https://t.co/8vh6Fnd4Ld",
  "data/tweet-nytimes/2022/4/1515811106538799107.json": "Two people were killed and eight others suffered gunshot wounds in a mass shooting at a party in Pittsburgh early Sunday morning. The gunfire erupted at an Airbnb rental where about 200 people, many underage, were in attendance. https://t.co/bYOAmb6ILq https://t.co/Ep0AC8LTLH",
  "data/tweet-nytimes/2022/4/1515909266124775426.json": "France’s soccer federation bans hijab-wearing women from competing in soccer games, even though FIFA allows them. These Muslim players are fighting back.\n \n\"Either I’m accepted as I am, or I’m not. And that’s it,\" one woman said. https://t.co/2lZZnrLVna https://t.co/L12JFRDDFH",
  "data/tweet-nytimes/2022/4/1515720507408191493.json": "\"They are gone, vanished.\"\n\nIn one Ukrainian village, the legacy of Russia's occupation is not measured in mass killings or ruined buildings, but in the disappearances of friends and neighbors. Questions about what happened to them will linger for years. https://t.co/93U3qOqyNW",
  "data/tweet-nytimes/2022/4/1516019972639711238.json": "Runners from Russia and Belarus will not be allowed to compete in the Boston Marathon on Monday.\n\n“We must do what we can to show our support to the people of Ukraine,” the chief of the Boston Athletic Association said. https://t.co/5npdWnO2nF",
  "data/tweet-nytimes/2022/4/1516008646626402307.json": "In Opinion\n\n“To put it bluntly: if we fail to use the months remaining before the elections to deliver on more of our agenda, Democrats are headed toward big losses in the midterms,” writes Senator Elizabeth Warren of Massachusetts in a guest essay. https://t.co/8qlBq99WUx",
  "data/tweet-nytimes/2022/4/1515894145189138434.json": "Pope Francis called for peace and condemned what he called the \"senseless\" war in Ukraine during his annual “Urbi et Orbi” (“To the City and the World”) message in St. Peter’s Square, where he spoke to tens of thousands of faithful. https://t.co/6xqJucrvgw",
  "data/tweet-nytimes/2022/4/1516041381638246403.json": "Three companies affiliated with Alex Jones, including Infowars, filed for bankruptcy on Sunday. The conspiracy theorist and his companies are facing lawsuits over his false claims about the Sandy Hook school shooting. https://t.co/DcOmVkXtL9",
  "data/tweet-nytimes/2022/4/1515837519409123329.json": "A supportive crowd in Asheville, N.C., watched the Ukrainians nearly pull off an upset of the United States in a Billie Jean King Cup qualifier.\n\n\"It’s been hard not to cry,\" King said. \"I just hope the Ukrainians had a moment of escapism.\" https://t.co/uiis6RGWcB",
  "data/tweet-nytimes/2022/4/1515701635955277828.json": "The Disney brand is about wishing on stars and living happily ever after. Lately, however, real world ugliness has been creeping into the Magic Kingdom. In trying to offend no one in this hyperpartisan moment, Disney has seemingly lost everyone. https://t.co/CS17qnNR4Q",
  "data/tweet-nytimes/2022/4/1515788456189960195.json": "Pope Francis called for peace and condemned what he called the \"senseless\" war in Ukraine during his annual “Urbi et Orbi” (“To the City and the World”) message in St. Peter’s Square, where he spoke to tens of thousands of faithful. https://t.co/02lAUx2zRY https://t.co/rAAJSCjzV5",
  "data/tweet-nytimes/2022/4/1516147575719702529.json": "Breaking News: Russia began a much-dreaded assault on eastern Ukraine, President Volodymyr Zelensky said, an offensive said to span about 300 miles. \"No matter how many servicemen get thrown there, we will fight, we will defend ourselves,\" he said. https://t.co/1lWFvvctMF",
  "data/tweet-nytimes/2022/4/1516139517161451527.json": "The U.S. will begin training Ukrainian troops to operate powerful howitzers that the Biden administration is sending to Ukraine to help it fight the next major phase of the war, a senior Pentagon official said on Monday. https://t.co/svOfr8YZVn",
  "data/tweet-nytimes/2022/4/1516054001577566219.json": "France’s soccer federation bans hijab-wearing women from competing in soccer games, even though FIFA allows them. These Muslim players are fighting back.\n \n\"Either I’m accepted as I am, or I’m not. And that’s it,\" one woman said. https://t.co/p0In0f51D9 https://t.co/omzPjcsxwH",
  "data/tweet-nytimes/2022/4/1516218274589118468.json": "Breaking News: The four largest U.S. airlines — United, Delta, Southwest and American — dropped their mask requirements for domestic flights after a judge struck down the federal mandate. https://t.co/3V1GfwsUHU",
  "data/tweet-nytimes/2022/4/1516194891973509132.json": "Hugs at Disneyland are back: After two years of pandemic restrictions, guests are once again be allowed to embrace the park’s characters.\n\n“It’s part of what makes Disney so special,” said one mother who brought her kids to the California park on Monday. https://t.co/qbylLxas2J https://t.co/RtB8i7rsyG",
  "data/tweet-nytimes/2022/4/1516235182503780365.json": "A federal judge ruled that a group of Georgia voters can move forward with legal efforts seeking to disqualify Representative Marjorie Taylor Greene from running for re-election to Congress, citing her role in the Jan. 6, 2021, attack on the Capitol. https://t.co/sGzMextvxR",
  "data/tweet-nytimes/2022/4/1516097995317592065.json": "Peres Jepchirchir of Kenya, a Tokyo Olympics gold medalist and 2021 New York Marathon winner, landed a third major crown in less than a year in the women's race in the Boston Marathon on Monday. She finished in 2 hours 21 minutes 2 seconds. https://t.co/oNq5RK7CFC https://t.co/C9fDdBV3j8",
  "data/tweet-nytimes/2022/4/1516172234628415505.json": "Gavriel Heine, an American conductor and longtime fixture of the Mariinsky Theater in Russia, resigned over the weekend in protest of the country’s invasion of Ukraine. “There’s no way I could ever be in denial of what is happening,” he said. https://t.co/YNXkmZk7yv",
  "data/tweet-nytimes/2022/4/1516386163057209350.json": "A federal judge ruled that a group of Georgia voters can move forward with legal efforts seeking to disqualify Representative Marjorie Taylor Greene from running for re-election to Congress, citing her role in the Jan. 6, 2021, attack on the Capitol. https://t.co/EoxHq7iqNg",
  "data/tweet-nytimes/2022/4/1516410025480237067.json": "Breaking News: The Biden administration reversed a Trump-era change to an environmental law, again requiring agencies to weigh climate impacts before they approve highways, pipelines and other major projects.\nhttps://t.co/f0cBcEEdrt",
  "data/tweet-nytimes/2022/4/1515794545115549705.json": "Drone crews have killed more people than nearly anyone else in the military in the past decade, but they seldom got the same recovery periods or mental-health screenings as other fighters.\n\nThe unseen scars of those who kill via remote control: https://t.co/pGMXpudWlK",
  "data/tweet-nytimes/2022/4/1516433949928607754.json": "How safe are you from Covid-19 when you get on a plane? Our air flow simulation can explain.https://t.co/VJJfnWHn1A",
  "data/tweet-nytimes/2022/4/1516245216679931910.json": "Many U.S. airlines dropped their mask requirements on Monday after a judge struck down the federal mandate for airplanes and public transit. But experts say it’s a good idea to wear a mask, especially on planes. https://t.co/8zltuQn4vR",
  "data/tweet-nytimes/2022/4/1516371059582410753.json": "Many U.S. airlines dropped their mask requirements on Monday after a judge struck down the federal mandate for airplanes and public transit. But experts say it’s a good idea to wear a mask, especially on planes. https://t.co/bp7Le4fZTj",
  "data/tweet-nytimes/2022/4/1516459127819677697.json": "Greek authorities have seized a Russian-owned oil tanker in the Aegean Sea. The seizure did not relate to the cargo of crude oil but to the ship itself, which belongs to a Russian bank on the EU sanctions list, a spokesman for the Greek coast guard said. https://t.co/91NrF2fzBV",
  "data/tweet-nytimes/2022/4/1516518279954812937.json": "It can be confusing to figure out where you should still wear a mask if you want to protect yourself and those around you. Here’s a guide to the places and situations where experts say it’s still a good idea to cover your face. https://t.co/zHTcIXZsBg https://t.co/5dCZYxcpFG",
  "data/tweet-nytimes/2022/4/1516505360839942150.json": "Breaking News: President Biden said it’s up to individuals whether to wear masks, undercutting efforts by his administration to urge Americans to keep wearing them on airplanes and public transit after a federal judge struck down a nationwide mask mandate. https://t.co/2b2Kcs9o5h",
  "data/tweet-nytimes/2022/4/1516605131978158080.json": "Breaking News: The Diocese of Camden, N.J., agreed to pay $87.5 million in one of the largest sex abuse settlements involving the Catholic Church in the U.S. https://t.co/LVsvDGJK1b",
  "data/tweet-nytimes/2022/4/1516587489204391938.json": "After a ruling on Monday that struck down a federal mask mandate on planes and public transportation, our reporters want to hear from you: Will you keep masking? Are you changing your travel plans? https://t.co/SI4fOuWzdW https://t.co/S77U1PLNLk",
  "data/tweet-nytimes/2022/4/1516584956750929923.json": "New York Times cameras captured life on the front lines in southeast Ukraine, where Russian shelling is relentless and it feels like the war is inching closer every day. https://t.co/2OMZOL629a https://t.co/zTsvZmiYS4",
  "data/tweet-nytimes/2022/4/1516650639148912643.json": "Wimbledon officials were set to announce they would bar Russian and Belarusian players from playing in this year's tournament because of Russia’s invasion of Ukraine and Belarus’ support of the war. https://t.co/kLL4S7xaTo",
  "data/tweet-nytimes/2022/4/1516525811540635659.json": "Automated payment and the spread of tipping to every corner of the food-service business have helped workers weather the pandemic. But some diners feel that tipping has gotten excessive.\n\nJoin the conversation: https://t.co/DG0oiHoxhT https://t.co/fhXQMkm9Z9",
  "data/tweet-nytimes/2022/4/1516733469782646789.json": "In Opinion\n\n\"We admire him because, in the face of unequal odds, Ukraine’s president stands his ground. Because he proves the truth of the adage that one man with courage makes a majority,\" Bret Stephens writes of President Volodymyr Zelensky of Ukraine. https://t.co/UAH4uiqqqg",
  "data/tweet-nytimes/2022/4/1516569852219166721.json": "Gov. Ron DeSantis asked Florida lawmakers on Tuesday to consider the “termination” of self-governing privileges that Disney World has held in the Orlando area for 55 years after Disney condemned a new state education law known as “Don’t Say Gay.” https://t.co/MmgW3diSKL",
  "data/tweet-nytimes/2022/4/1516529594853113863.json": "Watch how some airline passengers reacted to the TSA abruptly stopping the enforcement of its mask mandate on planes and in airports on Tuesday. https://t.co/6PE6QWwDHZ https://t.co/XwaeTAJz4J",
  "data/tweet-nytimes/2022/4/1516798617490710543.json": "Russian and Belarusian athletes will be barred from playing at Wimbledon because of Russia’s invasion of Ukraine and Belarus’ support of the war. The decision would exclude a number of highly ranked players, including No. 2 Daniil Medvedev. https://t.co/PqYXUexJcz",
  "data/tweet-nytimes/2022/4/1516763649200828423.json": "In Opinion\n\nMarine Le Pen \"may pretend to be a regular politician, but she remains as dangerous as ever,\" says Rim-Sarah Alouane, who writes about French politics, in a guest essay. \"For the good of minorities and France itself, she must not prevail.\"\nhttps://t.co/FeijmQrLbD",
  "data/tweet-nytimes/2022/4/1516907390167224320.json": "Breaking News: The Justice Department will appeal a court ruling striking down the federal mask mandate on public transportation, at the CDC’s request. https://t.co/ZRYXkRG7p5",
  "data/tweet-nytimes/2022/4/1516934256722911236.json": "The Ukrainian postal service printed a run of one million stamps with the image of a Ukrainian special forces fighter raising his middle finger at a Russian warship. The stamps have sold out.\nhttps://t.co/SEIimTrOlb",
  "data/tweet-nytimes/2022/4/1516593769650470922.json": "Public health experts expressed dismay over a U.S. judge’s ruling that struck down the public transit mask mandate.\n\n“If this ruling stands, it could put the American public at great risk,” said Dr. Richard Besser, a former acting director of the CDC. https://t.co/eIWKZ8Zh0a",
  "data/tweet-nytimes/2022/4/1516916388455137286.json": "Donald Trump’s campaign was ordered to pay nearly $1.3 million in legal fees to Omarosa Manigault Newman, the former White House aide and “Apprentice” star, after he unsuccessfully sued her for writing a tell-all book. https://t.co/4TrlukAdOs",
  "data/tweet-nytimes/2022/4/1516895748675317762.json": "Trevor Jacob, a YouTuber who posted a video of himself parachuting out of a plane that he claimed had malfunctioned, had his private pilot certificate revoked. The FAA found that he purposely abandoned the aircraft. https://t.co/KGrmiGgbfP",
  "data/tweet-nytimes/2022/4/1516884450663178243.json": "A majority of people in the U.S. favored requiring people on planes, trains and buses to wear masks, according to a new poll that was conducted in all 50 states right before a federal judge struck down the mask mandate on planes and public transit.\nhttps://t.co/1Bb1exVIgA",
  "data/tweet-nytimes/2022/4/1516899573050101761.json": "European intelligence agencies have warned about Russian spies for years. Now, an investigation in Slovakia exposed how their secret operations are trying to cause conflict in Europe and create sympathy for Moscow's war in Ukraine. https://t.co/s919IHgEs0",
  "data/tweet-nytimes/2022/4/1516944839283200000.json": "The actor Johnny Depp took the stand for the second day on Wednesday to describe his turbulent marriage to the actress Amber Heard, whom he has sued for defamation, accusing her of “demeaning name-calling” that often escalated into physical violence. https://t.co/zFt6F05QZI",
  "data/tweet-nytimes/2022/4/1517020722174087168.json": "People have been finding hungry, scared kangaroos in forests in eastern India. \n\nThey were almost certainly smuggled into India to be exotic pets, wildlife experts say. Some view the sightings as an example of how brazen the smuggling trade has become. https://t.co/dgfx4apYZm https://t.co/4vuJuNbKtr",
  "data/tweet-nytimes/2022/4/1517123518890135552.json": "Pedro Sánchez and Mette Frederiksen, the prime ministers of Spain and Denmark, arrived in Kyiv to meet with President Volodymyr Zelensky. They are the latest in a series of European leaders to visit the Ukrainian capital.\n\nFollow our updates on Ukraine.\nhttps://t.co/yJZTNCWch1 https://t.co/kp5zcO6nJF",
  "data/tweet-nytimes/2022/4/1517132333362593793.json": "Kevin McCarthy vowed to push Donald Trump to resign after Jan. 6, and Mitch McConnell said he deserved impeachment. Then their fury faded.\nhttps://t.co/IdcrdpypFa",
  "data/tweet-nytimes/2022/4/1517169719115141123.json": "Breaking News: Warner Bros. Discovery is shutting down CNN+. The streaming service debuted just weeks ago and was meant to bring CNN into the digital future. https://t.co/vqApzdFQvY",
  "data/tweet-nytimes/2022/4/1517110945264377857.json": "Two men took money from donors to a project meant to help Donald Trump's border wall and spent it on jewelry, plastic surgery and a golf cart, prosecutors say. They are expected to plead guilty in Federal District Court in Manhattan, court filings show. https://t.co/3HjdDlbMQE",
  "data/tweet-nytimes/2022/4/1517196434491289600.json": "Breaking News: Florida lawmakers voted to revoke Disney World’s special tax status, a step seen as retaliation for Disney’s criticism of the “Don’t Say Gay” law. The move revokes a privilege that effectively allowed Disney to self-govern its theme park. https://t.co/bQ4LsCYquA",
  "data/tweet-nytimes/2022/4/1517203589256654848.json": "Florida lawmakers voted to revoke Disney World’s special tax status, a move seen as retaliation after Disney, Florida’s largest private employer, criticized the “Don’t Say Gay” law. Gov. Ron DeSantis will almost certainly sign the measure. https://t.co/3XvCb20f7m https://t.co/fVHfWv5EJq",
  "data/tweet-nytimes/2022/4/1517313263746392069.json": "Kevin McCarthy denied saying that he would urge Donald Trump to resign after Jan. 6, but a short audio clip tells a different story. https://t.co/VkCyEPN38j",
  "data/tweet-nytimes/2022/4/1517050558930112512.json": "In a one-year study, people who confined a low-calorie diet to certain hours lost no more weight than those who ate at any time.\n\n\"There is no benefit to eating in a narrow window,\" one diet researcher said. https://t.co/SAAQ6H9Kkf",
  "data/tweet-nytimes/2022/4/1517317276558667777.json": "President Biden announced another $800 million in military aid to Ukraine on Thursday, saying it sent an “unmistakable message” to Russia’s president, Vladimir Putin: “He will never succeed in dominating and occupying all of Ukraine.” https://t.co/cfB0Cx5PYu https://t.co/hosUtWksgv",
  "data/tweet-nytimes/2022/4/1517420466172014598.json": "Marine Le Pen, the far-right challenger for the French presidency, is linked to President Vladimir Putin of Russia by a web of financial ties and a history of support that has hardly dimmed despite the war in Ukraine.\nhttps://t.co/HDHGnSbAjD",
  "data/tweet-nytimes/2022/4/1517254372228583424.json": "Thirteen female athletes who were sexually assaulted by Larry Nassar are seeking $10 million each from the FBI, alleging that agents mishandled an investigation and allowed the former sports doctor to continue abusing more victims.\nhttps://t.co/hOuFTEz64q",
  "data/tweet-nytimes/2022/4/1517263184540966913.json": "Donald Trump Jr. has agreed to voluntarily meet with the House committee investigating the Jan. 6 Capitol attack. Texts show he encouraged White House officials to pursue “multiple paths” to overturn his father’s loss in the days after the election.\nhttps://t.co/fmLMrcjhZm",
  "data/tweet-nytimes/2022/4/1517507041241227264.json": "The UN detailed a “horror story” of possible war crimes and abuses unfolding in Ukraine, citing indiscriminate shelling, hundreds of summary executions and the widespread devastation of civilian lives.\nhttps://t.co/gsZRtcI5Sj",
  "data/tweet-nytimes/2022/4/1517576498831572993.json": "A series of satellite images show what appears to be a growing mass grave site on the outskirts of Mariupol. The holes were dug between March and April, while Russian forces were in control of the Ukrainian town, according to a New York Times analysis. https://t.co/IYUa6UUf0D https://t.co/znMTSKhozN",
  "data/tweet-nytimes/2022/4/1517495965573427200.json": "The Tennessee General Assembly became what is believed to be the first state legislature to pass a bill that would require drunken drivers to pay child support if they kill the parent of a minor.\n\nThe bill will now go to the governor for his signature.\nhttps://t.co/75keU4IONb",
  "data/tweet-nytimes/2022/4/1517594108327567360.json": "Rep. Kevin McCarthy’s false claim that he never urged Donald Trump to resign after the Capitol riot exposed the hypocrisy of Republicans who have privately scorned Trump while publicly defending him, a phenomenon widely known but seldom seen in Washington. https://t.co/ECO7XJSYGW",
  "data/tweet-nytimes/2022/4/1517590338201862144.json": "Rep. Marjorie Taylor Greene on Friday repeated false claims of fraud in the 2020 election as she defended her actions surrounding the Capitol riot, in an extraordinary hearing on whether she should be labeled an “insurrectionist” and barred from office. https://t.co/WQ2D9fHuUh",
  "data/tweet-nytimes/2022/4/1517533731980197895.json": "In a promo for a Tucker Carlson show on Fox News, a naked man atop a rock pile exposes his genitals to red light from what appears to be an air purifier, described as a treatment for a testosterone “calamity.” An endocrinologist says it's all ridiculous. https://t.co/mgy8jcpb58",
  "data/tweet-nytimes/2022/4/1517612996687810560.json": "Hackers claim to have broken into dozens of Russian institutions over the past two months, including one of the Kremlin’s intelligence services. https://t.co/rfaFoOIVMr",
  "data/tweet-nytimes/2022/4/1517480895900536832.json": "Florida rejected dozens of math textbooks last week. Using online sample materials provided by publishers to Florida school districts, The New York Times reviewed 21 of them to figure out why.\nhttps://t.co/WtgqF0LDHK",
  "data/tweet-nytimes/2022/4/1517702309609971715.json": "The wider ambitions a Russian general expressed on Friday — to take southern Ukraine all the way to Moldova, Ukraine’s southwest neighbor — reveal larger truths about Moscow’s agenda, President Volodymyr Zelensky of Ukraine said. https://t.co/dMtXcj0pze",
  "data/tweet-nytimes/2022/4/1517435601779363841.json": "Japan and New Zealand opened talks on an agreement for “seamless” sharing of classified information, a step that could strengthen Tokyo’s case to eventually join the “Five Eyes” intelligence partnership among English-speaking powers.\nhttps://t.co/6mc7ORuV4I",
  "data/tweet-nytimes/2022/4/1517785263954702336.json": "Mark Meadows, Donald Trump’s former White House chief of staff, was told Jan. 6 could turn violent but pushed ahead with plans for a rally, a House panel said.\nhttps://t.co/5nGSKsGBj9",
  "data/tweet-nytimes/2022/4/1517891077675618305.json": "Gerhard Schröder has become the most prominent face of a long era of miscalculation that left Germany deeply reliant on Russian gas. He expresses no regret and has also profited handsomely from it, earning millions while promoting Russian energy interests. https://t.co/4gMhiZwkXH https://t.co/Bqhp9Y3lVJ",
  "data/tweet-nytimes/2022/4/1517927875860705282.json": "Breaking News: President Volodymyr Zelensky of Ukraine said that the U.S. secretary of state, Antony Blinken, and the defense secretary, Lloyd Austin, will visit Kyiv on Sunday. https://t.co/oj1d3oeRU1",
  "data/tweet-nytimes/2022/4/1517917475999989760.json": "After months of begging allies to provide heavy weapons, President Volodymyr Zelensky said Saturday that his pleas were finally being answered: \"We will be able to show the occupiers that the day when they will be forced to leave Ukraine is approaching.\" https://t.co/2Ey8cZS0Su",
  "data/tweet-nytimes/2022/4/1517977900347240449.json": "About 95 percent of airline pilots in the U.S. today are male, and nearly as many are white. Now, with pilots in short supply, there's urgency for the industry to act on diversifying. https://t.co/FbavdEcsia",
  "data/tweet-nytimes/2022/4/1518005191093755909.json": "Before the Jan. 6 attack on the Capitol, Trump White House officials and members of the right-wing House Freedom Caucus strategized about a plan to direct thousands of angry marchers to the building, according to newly released testimony. https://t.co/WvbRSxZ7CR",
  "data/tweet-nytimes/2022/4/1517872184622043142.json": "Investors and corporations are buying up houses and turning them into rental properties — adding obstacles to first-time home buyers. One estimate says about 2.5 million households shopping for a first home will be shut out of the market this year. https://t.co/9V5uW8D6hG",
  "data/tweet-nytimes/2022/4/1517860859934126081.json": "The dress worn by Judy Garland in \"The Wizard of Oz\" was given to a priest in 1973, but had been missing for decades when it was found in a shoe box last year. Now a university hopes to auction it off for at least $1.2 million. https://t.co/ZsRzfEspoe",
  "data/tweet-nytimes/2022/4/1518045297372499968.json": "Breaking News: Senator Orrin Hatch, the Utah Republican who crusaded for right-wing causes in a seven-term career, has died. He was 88. https://t.co/L9Ny2kgXRz",
  "data/tweet-nytimes/2022/4/1517985432453238787.json": "A Tennessee prosecutor dropped criminal charges against a woman who was sentenced to prison after she tried to restore her right to vote. The case spurred outrage among voting rights supporters, who said it highlighted racial disparities in prosecutions. https://t.co/eVNdLxnnZF",
  "data/tweet-nytimes/2022/4/1517902388090314753.json": "Mark Meadows, the final chief of staff for President Donald Trump, was told that the events of Jan. 6 could turn violent, but he pushed forward with a rally anyway, the House committee investigating the Capitol attack alleged in a court filing. https://t.co/73tjmgG48p",
  "data/tweet-nytimes/2022/4/1518223262240620546.json": "American adolescence is undergoing a drastic change. Three decades ago, the gravest public health threats to teens in the U.S. came from drinking, pregnancy and smoking. These have since fallen sharply, while rates of mental health disorders are soaring. https://t.co/TUaqwHLLvH",
  "data/tweet-nytimes/2022/4/1518279881833996289.json": "In comments sections, in social media, even in the official pronouncements of the state, Ukrainians are using a new word built from several languages that is not only a condemnation of Russian actions, but also an offering to the Russian language. https://t.co/AyasKPhbfz https://t.co/ibVpWJcojB",
  "data/tweet-nytimes/2022/4/1518291411837325313.json": "Breaking News: Emmanuel Macron is projected to win a second term as president of France, triumphing on Sunday over Marine Le Pen, his far-right challenger. https://t.co/8iMH4J1fFs",
  "data/tweet-nytimes/2022/4/1518327718861021189.json": "Speaking to a crowd in front of the Eiffel Tower, a solemn Emmanuel Macron acknowledged \"the anger that has been expressed\" during a bitter campaign against Marine Le Pen, and that he had a duty to \"respond effectively\" after his victory. https://t.co/cXEiII4vD1 https://t.co/8yeHHF1pi6",
  "data/tweet-nytimes/2022/4/1518363349645410305.json": "Emmanuel Macron defeated his far-right challenger, Marine Le Pen, becoming the first French president to be re-elected since 2002. https://t.co/AbO3A2cXl6 https://t.co/7IsO3Y7fVN",
  "data/tweet-nytimes/2022/4/1518367463645368320.json": "Breaking News: Twitter’s board is seriously considering Elon Musk’s $46.5 billion bid to buy the company, people with knowledge of the situation said. The board met on Sunday morning to discuss Musk’s offer, after he began lining up financing last week. https://t.co/knjwxAOzSV",
  "data/tweet-nytimes/2022/4/1518340263596470276.json": "In the shadow of a devastating war, worshipers in Kyiv, Ukraine’s capital, attended services on the holiest day of the year for Orthodox Christians. https://t.co/VOuzZKOnXw https://t.co/IdgcNJ5Jck",
  "data/tweet-nytimes/2022/4/1518361133089964034.json": "Secretary of State Antony Blinken and Defense Secretary Lloyd Austin met with President Volodymyr Zelensky in Kyiv on Sunday, becoming the first senior U.S. officials known to have visited Ukraine since Russia invaded on Feb. 24. https://t.co/meZKd75HvS",
  "data/tweet-nytimes/2022/4/1518359130355998720.json": "A man who set himself on fire in front of the Supreme Court on Friday in an apparent Earth Day protest against climate change has died. A friend said the self-immolation was \"a deeply fearless act of compassion to bring attention to climate crisis.\" https://t.co/hKSt7eLETi",
  "data/tweet-nytimes/2022/4/1518257224841404416.json": "In some ways, this is the safest time to be an American teenager: drug use, drunk driving and teen pregnancy rates are all down. But a mental health crisis has emerged, with soaring rates of adolescent depression, anxiety and suicide. https://t.co/RZ9MWftZsM https://t.co/7eSGWS5pVy",
  "data/tweet-nytimes/2022/4/1518174180755521536.json": "You can make pancakes from scratch in about as much time as it takes to make toast 🥞 https://t.co/4EpwxoSl5g https://t.co/E2qUdl33eS",
  "data/tweet-nytimes/2022/4/1518369450650599425.json": "In a trip shrouded in secrecy, Secretary of State Antony Blinken and Defense Secretary Lloyd Austin made a wartime journey to Ukraine on Sunday, where President Volodymyr Zelensky of Ukraine planned to urge them to provide more aid. https://t.co/vH9ccuopYx",
  "data/tweet-nytimes/2022/4/1518424602896224259.json": "For years, the U.S. sent mixed signals about its interests in Ukraine. Then Russia invaded.\n\nNow, the U.S. is at the center of an extraordinary effort to foil Vladimir Putin, casting the war as a battle between democratic values and authoritarian might. https://t.co/I0wC3nh1Tk",
  "data/tweet-nytimes/2022/4/1518480111510638592.json": "Twitter is nearing a deal to sell itself to Elon Musk, two people with knowledge of the situation said.  https://t.co/sjenMP1Z67",
  "data/tweet-nytimes/2022/4/1518513358240202752.json": "Breaking News: Defense Secretary Lloyd Austin said the U.S. wanted Russia to be “weakened” and unable to rebuild its military, a bolder American stance. https://t.co/szF0dl0uwa",
  "data/tweet-nytimes/2022/4/1518460816198094850.json": "Markelle Taylor started running as an antidote to despair in prison. This week he ran the Boston Marathon as a free man — with a time of 2:52:00. https://t.co/8WkW4hkJ77",
  "data/tweet-nytimes/2022/4/1518585847087575042.json": "Twitter is nearing a deal to sell itself to Elon Musk, people familiar with the situation said. An agreement could be announced as soon as today.\nhttps://t.co/aW3YQEztGv",
  "data/tweet-nytimes/2022/4/1518575819957817345.json": "In the first days of the war in Ukraine, many people, including Russian President Vladimir Putin, expected the Ukrainian leadership to fracture.\n\nInstead, leading politicians created a largely united front that continues today.\nhttps://t.co/CrakRbatJZ",
  "data/tweet-nytimes/2022/4/1518537566940954624.json": "Jon Stewart, the former host of “The Daily Show,” won the Mark Twain Prize for American Humor, one of comedy’s top honors.  \n\nThe prize ceremony also honored Stewart's activism on behalf of veterans and 9/11 emergency workers. https://t.co/mf5xG3NWmr",
  "data/tweet-nytimes/2022/4/1518586910888837120.json": "In Opinion\n\n\"The irony is that Mr. Putin’s cruel war in Ukraine will achieve the opposite of his ambitions: NATO will emerge from this crisis larger, stronger and more united,\" writes Anders Fogh Rasmussen, a former NATO secretary general, in a guest essay.https://t.co/euHX7rDgGW",
  "data/tweet-nytimes/2022/4/1518633723754954752.json": "Breaking News: A New York judge held Donald Trump in contempt of court for failing to turn over documents related to an inquiry by the state attorney general. https://t.co/Uyn8HSyMOs",
  "data/tweet-nytimes/2022/4/1518639763917582338.json": "Donald Trump was held in contempt of court for failing to turn over materials sought by Letitia James, the New York attorney general. He will be fined $10,000 per day until he cooperates. https://t.co/ZhCuWWuR8E",
  "data/tweet-nytimes/2022/4/1518653589874483200.json": "A New York judge held Donald Trump in contempt of court for failing to turn over documents related to an inquiry by the state attorney general. He will be fined $10,000 per day until he cooperates. https://t.co/sjHoGiiSZk https://t.co/vWeRkKpyhR",
  "data/tweet-nytimes/2022/4/1518622747865366530.json": "Breaking News: A state court in Kansas rejected a Republican-drawn map of congressional districts as an unconstitutional gerrymander. https://t.co/I7xi8N5KUT",
  "data/tweet-nytimes/2022/4/1518666374213742592.json": "Breaking News: Elon Musk struck a deal on Monday to buy Twitter for roughly $44 billion. https://t.co/HjSHsXcAac",
  "data/tweet-nytimes/2022/4/1518663956109438976.json": "Breaking News: A Texas court halted the execution of Melissa Lucio, who was convicted of killing her 2-year-old child, after new evidence and expert testimony emerged that cast strong doubt on her guilt. https://t.co/yXum4lQVi0",
  "data/tweet-nytimes/2022/4/1518705422781267968.json": "Elon Musk, the world's richest man, struck a deal to buy Twitter for $44 billion. What will the purchase mean for the social network? Join @sheeraf, @LaurenSHirsch and @kateconger at 8 p.m. ET to discuss the implications. DM questions to @nytimesevents. https://t.co/0DJOq3uTAf",
  "data/tweet-nytimes/2022/4/1518685050874867712.json": "Here are four ways Twitter could change under Elon Musk. https://t.co/C7uBtiZZuH",
  "data/tweet-nytimes/2022/4/1518741690021933057.json": "LIVE NOW: @sheeraf, @LaurenSHirsch and @kateconger discuss Elon Musk's $44 billion purchase of Twitter and what it will mean for the social network. DM questions to @nytimesevents. https://t.co/oxgjS7TQAb",
  "data/tweet-nytimes/2022/4/1518709944417230850.json": "Large fires tore through oil depots on Monday in Bryansk, a Russian city less than 100 miles from the Ukrainian border that is a key logistical hub in Russia’s war effort.\n\nGet live updates: https://t.co/KKrBLA3hZR https://t.co/FrzXesvT9F",
  "data/tweet-nytimes/2022/4/1518552933599748096.json": "Evangelical churches have long been powerful vehicles for influence on the American right. Now, some of those churches have embraced a new cause: promoting Donald Trump’s false claim that the 2020 election was stolen. https://t.co/XXiD6Pswdq",
  "data/tweet-nytimes/2022/4/1518620877058973699.json": "Meta said it's planning to open its first physical storefront next month. Customers will be able to try out devices and experiment with virtual and augmented reality. \"The best way to understand virtual reality is to experience it,\" Mark Zuckerberg said. https://t.co/xPJOCHN49z",
  "data/tweet-nytimes/2022/4/1518771887693778948.json": "About 15,000 Russian military personnel have been killed since the start of Russia’s war in Ukraine, the British defense secretary, Ben Wallace, told the House of Commons on Monday. https://t.co/A6p1hykNo1",
  "data/tweet-nytimes/2022/4/1518889141747998720.json": "“We’re here to help Ukraine win the fight against Russia’s unjust invasion, and to build up Ukraine’s defenses for tomorrow’s challenges,” U.S. Defense Secretary Lloyd Austin III said at the Ukraine Defense Consultative Group meeting in Germany. \nhttps://t.co/kjA0v3W5Pd https://t.co/aIywH9K5OJ",
  "data/tweet-nytimes/2022/4/1518873782810820608.json": "Germany will send Ukraine dozens of radar-equipped heavy tanks, designed for air defense, the first time it has supplied Ukraine with heavy weapons in the war. Defense Minister Christine Lambrecht will make the announcement today, an official said.\nhttps://t.co/akmX34lUrb",
  "data/tweet-nytimes/2022/4/1518779420051398656.json": "When Defense Secretary Lloyd Austin declared at the end of a visit to Ukraine that America’s goal is to see Russia so “weakened” that it would no longer have the power to invade a neighboring state, he was acknowledging a transformation of the conflict. https://t.co/847QZKLixo",
  "data/tweet-nytimes/2022/4/1518954068722561024.json": "President Biden plans to use his clemency powers for the first time to commute the sentences of 75 nonviolent drug offenders and issue three pardons, including to the first Black Secret Service agent to work on a presidential detail.\nhttps://t.co/ggkKqKmOdc",
  "data/tweet-nytimes/2022/4/1518956846299729921.json": "Germany said that it would send Ukraine several dozen armored antiaircraft vehicles, a major policy change after a debate over the transfer of heavy weapons that has divided the government.\nhttps://t.co/l5GBvng7q0",
  "data/tweet-nytimes/2022/4/1518973661109227527.json": "Breaking News: Harvard will spend $100 million to study and redress its ties to slavery, joining other universities confronting their complicity with slavery. https://t.co/C1Tgeht54m",
  "data/tweet-nytimes/2022/4/1518972521370075137.json": "Ukrainian soldiers held a funeral for Ehor Kihitov, 21, who was killed this month along with nearly two dozen soldiers in an artillery strike in the eastern Luhansk region.\n\nHis twin, Hlib, was too distraught to speak. “Now he is alone,” said their mother. https://t.co/XCKcvTZuSj https://t.co/QrtDl7Yl63",
  "data/tweet-nytimes/2022/4/1519036096419700739.json": "Members of the far right celebrated Elon Musk’s deal to buy Twitter and began testing the platform's limits with tweets criticizing the transgender community, doubting the effectiveness of masks, or claiming that the 2020 election results were fraudulent. https://t.co/kP5eZ6D4gP",
  "data/tweet-nytimes/2022/4/1518979557998669825.json": "A court filing and newly disclosed text messages provide additional evidence of how closely some pro-Trump lawmakers worked with the White House on efforts to overturn the 2020 election and encourage Trump’s supporters to march to the Capitol on Jan. 6. https://t.co/IZFO2ZcJRY",
  "data/tweet-nytimes/2022/4/1519054998092587010.json": "A man who admitted to defacing an LGBTQ mural in South Florida has been ordered by a judge to write a 25-page essay about the shooting at the Pulse gay nightclub, where a gunman killed 49 people in 2016. https://t.co/IZJIcNm0wn",
  "data/tweet-nytimes/2022/4/1519021021852057601.json": "Tamara Mikheenko, 70, hid in a basement shelter as she described the incessant shelling of her town, Orikhiv, in eastern Ukraine. Struggling to communicate through tremendous sobs, she begged world leaders to do whatever was necessary to stop the violence. https://t.co/y3oUey67w8 https://t.co/GneVoaDbtA",
  "data/tweet-nytimes/2022/4/1519067801549426690.json": "New audio recordings reveal Kevin McCarthy, the House Republican leader, worried that comments by his far-right colleagues after the Jan. 6 attack could incite violence. He said he would try to rein in the lawmakers, but has instead defended them. https://t.co/7Ucbh6aIbQ",
  "data/tweet-nytimes/2022/4/1519076587790114816.json": "Rep. Madison Cawthorn was briefly detained by the police after trying to bring a loaded gun through airport security. This is the second time in a little more than a year that the North Carolina Republican has been stopped from flying with a firearm. https://t.co/OFkCcqq5Cq",
  "data/tweet-nytimes/2022/4/1519043704723591173.json": "Ukrainian authorities yanked down one of the grander statues in Kyiv that symbolized the country’s ties to Russia. The 26-foot-tall monument was called The Friendship of Nations and was installed four decades ago. https://t.co/e2BbKNlaqZ",
  "data/tweet-nytimes/2022/4/1519163698451042306.json": "78% of adults in the U.S. approve of allowing up to 100,000 Ukrainian refugees into the country, Gallup reported. https://t.co/YUyjh7YiDf",
  "data/tweet-nytimes/2022/4/1519041132520423429.json": "“If I was vaccinated,” said a 47-year-old police sergeant who was hospitalized for 49 days with the coronavirus, “I have to think I wouldn’t have gotten as sick as I did.”\n\nHe plans to get the shot as soon as his doctors give him final medical clearance. https://t.co/EXCGs6Af2Z",
  "data/tweet-nytimes/2022/4/1519273920024748034.json": "Kane Tanaka survived two world wars, the 1918 flu outbreak, paratyphoid and two rounds of cancer. Deep into her 12th decade, visitors found her to be vivacious and irrepressibly funny.\n\nTanaka, who was the world’s oldest person, died this month at 119.\nhttps://t.co/I2KjTVfOFK https://t.co/I5h0bn2MZN",
  "data/tweet-nytimes/2022/4/1519318471737331712.json": "Breaking News: The Trump administration inappropriately awarded $700 million from a pandemic fund to a struggling trucking company in 2020 over the objections of career officials at the Defense Department, House Democrats said.\nhttps://t.co/cH3G0TdI5t",
  "data/tweet-nytimes/2022/4/1519384450685181957.json": "Breaking News: The Minneapolis Police Department routinely engages in racist and discriminatory policing and has used fake social media accounts to target Black people and organizations, a state report found. https://t.co/JihaccsWA2",
  "data/tweet-nytimes/2022/4/1519390953164914691.json": "To block Russia's advance, Ukrainians intentionally flooded Demydiv, a village north of Kyiv, along with a vast expanse of fields and bogs around it, creating a quagmire. \"Everybody understands and nobody regrets it for a moment,\" one resident said. https://t.co/zTMQp0lclJ https://t.co/UaK7psW1aP",
  "data/tweet-nytimes/2022/4/1519394767364308993.json": "Children born in Italy will be given their mother’s and father’s surnames at birth. The court's ruling overturns decades of patriarchal family legacy, which largely left women out of the decision-making process. https://t.co/ZkY1UNX4DA",
  "data/tweet-nytimes/2022/4/1519138048524668936.json": "The youngest detainee at Guantánamo Bay, a Yemeni man who has been held since 2002 without charge, has been cleared for release, the Pentagon said. But he now must wait for the Biden administration to find a country willing to offer him rehabilitation. https://t.co/G58CRA4M66",
  "data/tweet-nytimes/2022/4/1519428795635281920.json": "The House passed a bill urging President Biden to sell the frozen luxury assets of Russian oligarchs and use the funds to provide additional military and humanitarian aid to Ukraine. https://t.co/7e3NdMA1LY",
  "data/tweet-nytimes/2022/4/1519421217605832707.json": "Elon Musk tweeted critically about two top lawyers at Twitter. Users then began tweeting abusive comments at them, including racist and sexist attacks. https://t.co/wdKoq3GkiQ",
  "data/tweet-nytimes/2022/4/1519360805199876098.json": "In Opinion\n\n\"Getting rid of policies that restrict hate speech will likely affect women and minorities much more than it does white men like Mr. Musk,\" writes Elizabeth Spiers, a writer and digital media strategist, in a guest essay. https://t.co/jzMwNpB2Sj",
  "data/tweet-nytimes/2022/4/1519383394571980801.json": "The EU has been preparing for Russia to cut natural gas off, Ursula von der Leyen, the European Commission president, said. It is another attempt by Russia “to use gas as an instrument of blackmail,” she said. https://t.co/NJtIkkZaMu https://t.co/0V3XX3lt7O",
  "data/tweet-nytimes/2022/4/1519476501124685826.json": "It is now becoming clear Russia used hacking campaigns to support its ground campaign in Ukraine, pairing malware with missiles in several attacks, including on TV stations and government agencies, according to a new study released by Microsoft. https://t.co/EBnsPsoQMF",
  "data/tweet-nytimes/2022/4/1519375926836043776.json": "The mayor of Mariupol pleaded on Wednesday for European help to rebuild his shattered city and said that 20,000 people had been killed there since Russia’s invasion in February. https://t.co/mUz2UIq1gk https://t.co/0eyMLYdgO8",
  "data/tweet-nytimes/2022/4/1519451332452794375.json": "Prosecutors said Thomas Raynard James had the same name as a suspect, leading to his wrongful conviction for murder in 1991. On Wednesday, a judge approved a motion to vacate James’s conviction and sentence, setting him free after over 31 years in prison. https://t.co/10fGprihfB",
  "data/tweet-nytimes/2022/4/1519636305264664577.json": "\"There is no way a war can be acceptable in the 21st century,\" said António Guterres, the UN secretary general, as he toured wreckage near Kyiv. He called the war in Ukraine \"an absurdity.\" https://t.co/cT0lXRTonN",
  "data/tweet-nytimes/2022/4/1519617438358421507.json": "If the plan was to terrify Poland and Bulgaria with the prospect of unheated homes and cold meals to break their will to help Ukraine, Russia chose the wrong season to halt the flow of natural gas. https://t.co/oOYY9IyqeR",
  "data/tweet-nytimes/2022/4/1519602400855736320.json": "Ed Balls\nhttps://t.co/zPPUNVkXJN",
  "data/tweet-nytimes/2022/4/1519685423555043328.json": "Breaking News: President Biden will propose making it easier for the U.S. to seize assets of Russian oligarchs and use the proceeds to help Ukraine in its war against Russia. https://t.co/Fkgev3TyWo",
  "data/tweet-nytimes/2022/4/1519703667770806272.json": "Breaking News: The FDA announced a plan to ban sales of menthol-flavored cigarettes. Public health experts say the proposal could save hundreds of thousands of lives, especially among Black smokers — 85% of whom use menthol products. https://t.co/EQWMC8gTNs",
  "data/tweet-nytimes/2022/4/1519285239641747456.json": "While Elon Musk’s exact plans for Twitter remain unclear, his promises to remove barriers to free speech on the platform have raised alarms among those who fight the toxic and at times dangerous flow of misinformation and disinformation.\nhttps://t.co/0aZmi7xJIG",
  "data/tweet-nytimes/2022/4/1519647664182382592.json": "Climate change will drive thousands of viruses to jump from one species of mammal to another over the next 50 years, a new study has shown. As the planet warms, bats in Southeast Asia will be especially prone to spreading viruses to other mammals. https://t.co/bTMKUWDbGo",
  "data/tweet-nytimes/2022/4/1519728177865707522.json": "President Biden asked Congress on Thursday for $33 billion in additional aid for Ukraine, saying “the cost of this fight is not cheap,” but that, “caving to aggression is going to be more costly if we allow it to happen.” https://t.co/xqhUaHPBLb https://t.co/ewvSvrh5dB",
  "data/tweet-nytimes/2022/4/1519748308692054020.json": "“The cost of this fight is not cheap,” President Biden said on Thursday as he called on Congress to approve $33 billion in additional aid for Ukraine, arguing that American weapons and humanitarian assistance are helping to beat back Russian forces. https://t.co/2iY3UkbwyB https://t.co/QBMijABMDt",
  "data/tweet-nytimes/2022/4/1519723172802740224.json": "“There’s definitely a sci-fi element to it,” an engineer who worked on Perseverance’s parachute system said of photographs released on Wednesday. “It exudes otherworldly, doesn’t it?”\nhttps://t.co/aT4JuAp8tX https://t.co/dDvNkam63s",
  "data/tweet-nytimes/2022/4/1519715591292178441.json": "The FDA announced a plan to ban sales of menthol-flavored cigarettes. Public health experts say the proposal could save hundreds of thousands of lives, especially among Black smokers — 85% of whom use menthol products. https://t.co/tR0bxqPZGK https://t.co/dL33QsHaH6",
  "data/tweet-nytimes/2022/4/1519491626606944256.json": "In a warehouse-turned-bomb-shelter in Lviv, in western Ukraine, a group of children performed a play featuring a range of stories about family separation as told from the perspective of children. https://t.co/wpT7BCTKRN",
  "data/tweet-nytimes/2022/4/1519833869234712576.json": "A study found that for predicting some dog behaviors, breed is essentially useless, and for most, not very good. https://t.co/JYD3pcfOIs https://t.co/sRDNDvjSgT",
  "data/tweet-nytimes/2022/4/1519703131365519360.json": "Over the past 15 years, many college-educated workers have experienced a gap between their expectations and their job prospects. Now, they’re fighting back by unionizing, raising the possibility of a once-in-a-century revival of the labor movement. https://t.co/VoLhZ45EVG",
  "data/tweet-nytimes/2022/4/1519853988660793345.json": "Airbnb told employees that they would have the option to permanently work remotely, joining a number of companies that have ditched return-to-office plans. U.S. employees can also move to anywhere in the country without a reduction to their compensation. https://t.co/AfF2lgUgI3",
  "data/tweet-nytimes/2022/4/1519670325268692995.json": "In Opinion\n\n\"One need not find Elon Musk personally or politically appealing to appreciate that his contributions to humanity could end up being profound,\" Farhad Manjoo writes. https://t.co/uPNdyKsAkz",
  "data/tweet-nytimes/2022/4/1519851475488456710.json": "A shipment of five million honeybees was diverted to Atlanta and left out on a hot tarmac. Local beekeepers tried to come to the rescue, but very few survived. https://t.co/KiBIZwvtxC",
  "data/tweet-nytimes/2022/4/1519972018627784704.json": "Ukraine published the names and photos of 10 Russian soldiers whom they accuse of kidnapping and torturing unarmed civilians in the town of Bucha, the most detailed accusation yet against Russian forces in Ukraine.\nhttps://t.co/TBB74V5FsO https://t.co/pBR5ilCpJF",
  "data/tweet-nytimes/2022/4/1520104420779962373.json": "It was only a fish! It was only a fish! https://t.co/CD3dL8tc0Y https://t.co/r2zpIaGTai",
  "data/tweet-nytimes/2022/4/1520128292791230465.json": "The body of Vira Hyrych, a prominent Ukrainian radio journalist, was recovered after a Russian missile strike on her apartment building in Kyiv. She had worked for Radio Free Europe/Radio Liberty, a U.S.-funded independent news organization, since 2018.\nhttps://t.co/kHqKQiSN3c https://t.co/D7Gariy399",
  "data/tweet-nytimes/2022/4/1520135602313830400.json": "“We want to go home,” a girl says in one video. “We want to see the sunshine.”\n\nIn the absence of independent media to chronicle their plight, fighters inside a steel plant in Mariupol, Ukraine, are publishing videos to show the world their hardship. https://t.co/tKtsv4Fvig",
  "data/tweet-nytimes/2022/4/1520100625429798915.json": "A couple digitized dozens of cassettes they found in their Fire Island home. The tapes, accumulated from 1979 to 1999, captured the soundtrack to a critical juncture in gay history as the AIDS crisis emerged. https://t.co/iNt3Wn4OCn",
  "data/tweet-nytimes/2022/4/1520159266014908421.json": "“If Mariupol is hell, Azovstal is worse.” The mayor of Mariupol, Ukraine, appealed for international help evacuating civilians as conditions deteriorated inside the Azovstal steel complex, the city’s last holdout for Ukrainian fighters and civilians. https://t.co/iYVgfpYOe6 https://t.co/1wWFrTYVTQ",
  "data/tweet-nytimes/2022/4/1520298921653899265.json": "“We want to go home,” a girl says in one video. “We want to see the sunshine.”\n\nIn the absence of independent media to chronicle their plight, fighters inside a steel plant in Mariupol, Ukraine, are publishing videos to show the world their hardship. https://t.co/pHMUrhVpjw",
  "data/tweet-nytimes/2022/4/1520221438338383872.json": "Coronavirus cases and hospitalizations are rising in a majority of American states, in what appears to be the first widespread increase since the peak of the Omicron surge in January. https://t.co/KfgZFZbybh",
  "data/tweet-nytimes/2022/4/1520431552232099840.json": "A recent series of attacks in Russia have been some of the most opaque developments in the war. If carried out by Ukraine, they represent acts of once nearly unimaginable audacity; one prompted the first air raid siren on Russian soil since World War II. https://t.co/bc0NhgBXpc",
  "data/tweet-nytimes/2022/4/1520424003713785856.json": "Tucker Carlson has constructed what is, by some measures, the most successful show in the history of cable news. It may also be the most racist.\n\nThe New York Times examined how he positioned himself to inherit the movement that grew around Donald Trump. https://t.co/jmXH4p0uju https://t.co/lc8RdQpwNb",
  "data/tweet-nytimes/2022/4/1520469304176750593.json": "Tucker Carlson, the host of the most-watched show on prime-time cable news, uses a simple narrative to instill fear in his viewers. To understand how he promotes extremist ideas and conspiracy theories, we analyzed 1,150 episodes. Here’s what we found. https://t.co/erE9z7xSge https://t.co/HEygrwwqbu",
  "data/tweet-nytimes/2022/4/1520191243380301825.json": "Besieged by multiplying scandals and salacious accusations, Representative Madison Cawthorn, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.\nhttps://t.co/qxLL4Fy7Kv",
  "data/tweet-nytimes/2022/4/1520497201998401537.json": "A New York Times analysis of 1,150 episodes reveals how Tucker Carlson pushes extremist ideas and conspiracy theories into millions of households. Night after night, he uses a simple narrative: \"They\" want to control and then destroy \"you.\" https://t.co/9hHa4YNrDn",
  "data/tweet-nytimes/2022/4/1520503269000417281.json": "A man in a lab coat showed up with Russian soldiers at a Ukrainian museum. When they left, priceless gold artifacts were gone, officials said. And it was hardly the first attack on Ukrainian culture since the war began. https://t.co/EL95Xm6u5A https://t.co/UohCoQJ7PQ",
  "data/tweet-nytimes/2022/4/1520524087591854081.json": "Naomi Judd, of the Grammy-winning country duo The Judds and the mother of Wynonna and Ashley Judd, died on Saturday. She was 76.\n\nHer death came one day before The Judds were set to be inducted into the Country Music Hall of Fame. https://t.co/LNeyDGLhV0 https://t.co/ttkAlHDktj",
  "data/tweet-nytimes/2022/4/1520206322712645633.json": "A former Idaho state representative was convicted Friday of raping a 19-year-old legislative intern after a dinner in 2021, a case that spurred the Republican lawmaker’s resignation last year and the censure of another lawmaker who had doxxed the victim. https://t.co/TkPR8BdnDr",
  "data/tweet-nytimes/2022/4/1520454202740424705.json": "Children who grew up in the U.S. under the protection of their parents’ temporary visas do not qualify for the DACA program, and risk losing their legal status when they turn 21. They are urging the Biden administration to act on an immigration overhaul. https://t.co/lD1Pw7rP3B",
  "data/tweet-nytimes/2022/4/1520548562664361984.json": "Besieged by multiplying scandals and salacious accusations, Representative Madison Cawthorn, Republican of North Carolina, is under mounting pressure from both parties to end his short career in Congress.\nhttps://t.co/vgFpf2glnT"
}