{
  "data/tweet-wsj/2022/8/1553912174195707905.json": "Russia’s intelligence service worked for nearly a decade to recruit members of fringe U.S. political groups to advance pro-Russia propaganda, according to an indictment https://t.co/QCZSHtnD5e",
  "data/tweet-wsj/2022/8/1553904619859939328.json": "England won the Women's European Championship Sunday, 56 years after the men's team won the country's last major soccer trophy https://t.co/XDGMIuBZDC",
  "data/tweet-wsj/2022/8/1553897075292733452.json": "The campaign to rename New Zealand https://t.co/EQaNXpsa7e",
  "data/tweet-wsj/2022/8/1553961248286560256.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/qRci2Jtk71",
  "data/tweet-wsj/2022/8/1554006612112809988.json": "The first grain shipment since the Russian invasion left Ukraine’s Odessa port under a deal aimed at easing global food shortages https://t.co/n8QqCWhmL9",
  "data/tweet-wsj/2022/8/1554100326122328066.json": "House Speaker Nancy Pelosi is planning to visit Taiwan this week and meet with officials, a person familiar said. China has warned against such a visit. https://t.co/PsQO6GbDcO",
  "data/tweet-wsj/2022/8/1554102398313848838.json": "The first grain shipment from Ukraine since the start of Russia’s invasion set sail from the port of Odessa under a deal aimed at easing global food shortages #WSJWhatsNow https://t.co/wNpsqOI53u https://t.co/nIR0sQ95Dk",
  "data/tweet-wsj/2022/8/1554116016002703362.json": "The death toll from Kentucky’s historic flooding rose to 30 people, as rescue workers continue searching for missing people and more severe weather was expected Monday https://t.co/QdYAdZBsRE",
  "data/tweet-wsj/2022/8/1554138641907257345.json": "Amazon is looking to draw in new audiences to its “Thursday Night Football” coverage by having Dude Perfect, known for their comedy routines and trick shots, call some of its games https://t.co/MfCYjIvDC6",
  "data/tweet-wsj/2022/8/1554153764751278081.json": "From @WSJopinion: Chuck Schumer wants a Senate vote on his partisan tax deal with Joe Manchin as early as this week, and no wonder he wants to rush it through. The more Americans learn what’s in this tax-and-spend behemoth, the more they’ll dislike it. https://t.co/GQc4YWIXYP",
  "data/tweet-wsj/2022/8/1554123565124968455.json": "From @WSJopinion: Biden’s climate plans are unsustainable, writes Stuart Gottlieb. The current White House agenda is so unrealistic it risks a backlash that will hurt the cause for decades. https://t.co/0eQK01beQH",
  "data/tweet-wsj/2022/8/1554176403184271360.json": "Authorities in Bulgaria are investigating an explosion at an ammunition depot owned by an arms dealer who Bulgarian officials say is a middleman for exports of munitions to Ukraine https://t.co/LvfxRXQpyr",
  "data/tweet-wsj/2022/8/1554200712539684865.json": "Breaking: The first Jan. 6 rioter convicted by a jury was sentenced to over seven years in prison, the longest sentence for a Capitol rioter so far https://t.co/etjU5y4GFB",
  "data/tweet-wsj/2022/8/1554248934528270336.json": "A U.S. drone strike killed al Qaeda leader Ayman al Zawahiri in Afghanistan, congressional officials said. He was a key strategist behind the 9/11 attacks. https://t.co/UTSVKZTMLi",
  "data/tweet-wsj/2022/8/1554256344978493441.json": "Al Qaeda leader Ayman al Zawahiri, a founding member of the jihadist movement and key strategist behind the 9/11 attacks, was killed in a drone strike in Afghanistan, officials said https://t.co/2v8WJHZhks",
  "data/tweet-wsj/2022/8/1553915957319532547.json": "Essay: Psychological research on the “bystander effect” can help explain why police took so long to confront a school shooter in Uvalde, Texas. https://t.co/9dj6VNnPCz",
  "data/tweet-wsj/2022/8/1554296223019966464.json": "The White House said Monday that a U.S. missile launched from a drone in Afghanistan killed al Qaeda leader Ayman al Zawahiri, a founding member of the jihadist movement and a key strategist behind the Sept. 11 attacks https://t.co/byQFWtHz2u",
  "data/tweet-wsj/2022/8/1554304746684645376.json": "House Speaker Nancy Pelosi is planning to visit Taiwan this week and meet with officials, a person familiar said. China has warned against such a visit. https://t.co/jGEOqznAc1",
  "data/tweet-wsj/2022/8/1554246363927515136.json": "The U.S. conducted the first known counterterrorism operation in Afghanistan in almost a year, officials said. The Taliban said the drone strike took place in central Kabul and targeted a residential home. https://t.co/dLfVcVl8e2",
  "data/tweet-wsj/2022/8/1554244348111245312.json": "From @WSJopinion: The Democrats’ latest inaptly named measure will hamstring business with more rules, taxes and red tape, making the supply-demand imbalance even worse. The Inflation Reduction Act won’t reduce inflation, writes Stephen Miran. https://t.co/7oS15E7NYu",
  "data/tweet-wsj/2022/8/1554312296893415424.json": "Live coverage: China said it was conducting military exercises in the waters off its southern and northeastern coasts this week, as U.S. House Speaker Nancy Pelosi prepares to travel to Taiwan for a visit that Beijing has strongly opposed https://t.co/1vsyDLpUqK",
  "data/tweet-wsj/2022/8/1554338743787610113.json": "Chinese stocks tumbled on Tuesday ahead of U.S. House Speaker Nancy Pelosi’s planned visit to Taiwan, as investors fretted over the tensions between Beijing and Washington surrounding her trip. https://t.co/f5OOu7p2WG",
  "data/tweet-wsj/2022/8/1554206599253737475.json": "The Securities and Exchange Commission said on Monday it charged 11 individuals with creating and promoting a fraudulent platform that operated as a global crypto pyramid and Ponzi scheme https://t.co/kFwVS9r4Bl",
  "data/tweet-wsj/2022/8/1554326165745242113.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/UReEdKQ1xw",
  "data/tweet-wsj/2022/8/1554448195228418048.json": "U.S. House Speaker Nancy Pelosi will spend a night in Taipei after the plane carrying her and other members of a Congressional delegation arrives from Kuala Lumpur, people familiar with the plans said. The imminent arrival hasn’t been officially confirmed. https://t.co/KezhDB9J5B",
  "data/tweet-wsj/2022/8/1554455757558616064.json": "The game of the day in Asia has been \"Where is Nancy Pelosi’s plane?\" Thousands of people were glued to flight-tracking websites to monitor her trip and to see for themselves if she would indeed head to Taiwan. https://t.co/ivCHIydjBo",
  "data/tweet-wsj/2022/8/1554467512955322368.json": "Investors are closely monitoring House Speaker Nancy Pelosi’s planned Taiwan visit, which risks setting up the potential for increased tensions between the U.S. and China, explains @RebeccaYFeng #WSJWhatsNow https://t.co/1MbLeGjpEm https://t.co/p45bSpugvY",
  "data/tweet-wsj/2022/8/1554481008992468992.json": "Nancy Pelosi arrived in Taiwan and plans to meet its president, despite China's warnings. She's the highest-level U.S. official to visit in 25 years. https://t.co/Y1oPiCN1OV",
  "data/tweet-wsj/2022/8/1554129870384422914.json": "Breaking: Estée Lauder is in talks to buy luxury fashion brand Tom Ford, people familiar with the matter said. The potential $3 billion acquisition would be the cosmetics giant’s biggest ever. https://t.co/XFoeldmVsz",
  "data/tweet-wsj/2022/8/1554425072777105408.json": "Amid deadly flooding in Kentucky and fierce wildfires in California, Vice President Kamala Harris announced $1 billion in grants for communities to prepare and respond to climate-related disasters #WSJWhatsNow https://t.co/12uuCamV3H https://t.co/CALyOKCkK9",
  "data/tweet-wsj/2022/8/1554527471260794880.json": "From @WSJopinion: Even if Nancy Pelosi’s trip to Taiwan ends in anticlimax, China’s military threats show that the status of Taiwan and its protection are fast becoming emergencies https://t.co/PGNGmU6G0J",
  "data/tweet-wsj/2022/8/1554548349398835203.json": "Breaking: Equifax provided inaccurate credit scores on millions of Americans seeking home, car and credit-card loans, people familiar with the matter said, resulting in higher interest rates and denied applications for some consumers https://t.co/AdH2cbAGft",
  "data/tweet-wsj/2022/8/1554542575763263490.json": "Interest in House Speaker Nancy Pelosi’s visit to Taiwan appears to have overwhelmed Weibo, one of China’s largest social-media platforms https://t.co/jzzsSsyvAy",
  "data/tweet-wsj/2022/8/1554553902586118145.json": "A missile strike in Afghanistan that killed al Qaeda leader Ayman al Zawahiri and House Speaker Nancy Pelosi’s visit to Taiwan have put foreign policy back on center stage for President Biden https://t.co/BexOQK9vUg",
  "data/tweet-wsj/2022/8/1554612282931437570.json": "The U.S. Air Force plane carrying House Speaker Nancy Pelosi to Taiwan took a three-hour detour to avoid potential military conflicts in the South China Sea, where Beijing has an established military presence https://t.co/rM3HNbftiN",
  "data/tweet-wsj/2022/8/1554652045470273536.json": "Former Missouri Gov. Eric Greitens, who resigned amid scandals in 2018, lost the GOP Senate primary to state Attorney General Eric Schmitt, the AP projects https://t.co/0V7JcUQh6O",
  "data/tweet-wsj/2022/8/1554618067187032066.json": "The Senate has passed the largest expansion of veteran healthcare benefits in decades, just a week after Republicans blocked the bill, sparking blowback https://t.co/ucQzw6YKYW",
  "data/tweet-wsj/2022/8/1554566265355780097.json": "Robinhood is laying off 23% of its staff, the second round of cuts since April as the online brokerage reels from a slowdown in trading https://t.co/ZzR07IYow3",
  "data/tweet-wsj/2022/8/1554263248081395713.json": "Many Americans inheriting an IRA will pay a much larger tax bill under new IRS guidance.“Grandma meant well, but the plan backfired.” https://t.co/oSRlwDfCsZ",
  "data/tweet-wsj/2022/8/1554669534749024256.json": "House Speaker Nancy Pelosi, the highest-ranking U.S. official in a quarter-century to visit Taiwan, met Wednesday with President Tsai Ing-wen and reiterated her support for cooperation between the two governments https://t.co/YSN8SHXys7",
  "data/tweet-wsj/2022/8/1554662544714915844.json": "Kansas voters soundly rejected a proposed state constitutional amendment that would have ended protections for abortion https://t.co/g5BDCS3PWc",
  "data/tweet-wsj/2022/8/1554489746977595401.json": "Dozens of major corporations, including Apple, GM and Lyft, have asked the Supreme Court to affirm the use of racial preferences in college admissions, arguing that more diversity on campuses contributes both to commercial innovation and business success https://t.co/TmDF4fMWvZ",
  "data/tweet-wsj/2022/8/1554689790758555650.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/ncuQrwHKsB",
  "data/tweet-wsj/2022/8/1554681185204314113.json": "House Speaker Nancy Pelosi is the highest-ranking U.S. official in a quarter-century to visit Taiwan, despite stern warnings from China. Follow our live coverage for the latest updates: https://t.co/ZJlCMLJu1t https://t.co/3cEwCV0m5M",
  "data/tweet-wsj/2022/8/1554485956811579393.json": "In the wake of the Ukraine war, Europe is weaning off Russian coal and turning to Colombia and other countries with an urgent appeal: Sell us more coal https://t.co/sctxT9zcY6",
  "data/tweet-wsj/2022/8/1554746412902109184.json": "House Speaker Nancy Pelosi vowed to preserve democracy in Taiwan in the face of growing threats from mainland China in a closely watched meeting with Taiwan’s president https://t.co/sdhDxw5i4V",
  "data/tweet-wsj/2022/8/1554708708839624704.json": "Vin Scully, Baseball’s Master Storyteller, Dies at 94 https://t.co/Y8hcp8N3Sc",
  "data/tweet-wsj/2022/8/1554740114248683520.json": "Trump-backed Blake Masters won Arizona's GOP Senate primary, AP projects. Peter Thiel, his former boss, spent millions of dollars in support of him. https://t.co/mmxEr5MOPE",
  "data/tweet-wsj/2022/8/1554803057095053313.json": "Leaders of a Senate committee are set to propose legislation that would assign oversight of the two largest cryptocurrencies, bitcoin and ether, to the federal agency that regulates milk futures and interest-rate swaps https://t.co/lPUfU7jELx",
  "data/tweet-wsj/2022/8/1554810576328691714.json": "Vin Scully, the voice of the Dodgers for nearly seven decades who elevated baseball broadcasting to artful storytelling, has died. He was 94. https://t.co/j9ihR72IYq",
  "data/tweet-wsj/2022/8/1554833248936534023.json": "U.S. gas prices have fallen for seven straight weeks and are approaching an average price of $4 a gallon, easing the pain of record-high fuel costs amid shrinking global demand for oil https://t.co/oWu77OWvBB",
  "data/tweet-wsj/2022/8/1554761533384704003.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/bxuMFr9yhP",
  "data/tweet-wsj/2022/8/1554874059007090691.json": "Breaking: Phil Mickelson and 10 other LIV golfers filed an antitrust lawsuit against the PGA Tour challenging their suspensions https://t.co/zsnYgU3E0u",
  "data/tweet-wsj/2022/8/1554821920226512896.json": "Germany might postpone closing its last nuclear reactors, Chancellor Scholz said, as Russia's cuts in gas flows threaten energy shortages https://t.co/b74fpkT8O0",
  "data/tweet-wsj/2022/8/1554820127715049478.json": "Officials from Russia, Ukraine, Turkey and the U.N. cleared a cargo ship carrying corn to continue its journey from Ukraine to Lebanon, in an early test for a deal on grain exports between Moscow and Kyiv #WSJWhatsNow https://t.co/L7tNBeRMrm https://t.co/HzQgMaJf3u",
  "data/tweet-wsj/2022/8/1554893622012698625.json": "The U.S. Senate is expected to pass a resolution that would approve the addition of Finland and Sweden to NATO https://t.co/jbH4TIZlkL",
  "data/tweet-wsj/2022/8/1554796476466970624.json": "Colleges are scaling back Covid-19 precautions for the fall, saying the pandemic phase is over https://t.co/X7r02wQXZw",
  "data/tweet-wsj/2022/8/1554942737774006272.json": "Some 60% of Kansas voters across the political spectrum rejected an amendment that would have eliminated abortion rights in the state, signaling the potential for the issue to shake up elections this fall https://t.co/r8TBToj4ca",
  "data/tweet-wsj/2022/8/1554931384476729345.json": "Alex Jones told a jury Wednesday that a significant defamation judgment could foretell the end of his Infowars media empire, in testimony during a trial to determine damages for repeatedly saying publicly that the 2012 Sandy Hook school shooting was a hoax https://t.co/I2hG0zrNW1",
  "data/tweet-wsj/2022/8/1554957387177541633.json": "The Senate overwhelmingly approved adding Finland and Sweden to NATO, a move that leaders said is key to U.S. security after Russia's invasion of Ukraine https://t.co/55OHxeP4ji",
  "data/tweet-wsj/2022/8/1554965433526239237.json": "The Justice Department sued former Trump adviser Peter Navarro on Wednesday over missing official emails https://t.co/UIoYYvG4jU",
  "data/tweet-wsj/2022/8/1555021971368382464.json": "New York's attorney general called for investigations, potentially leading to fines if airlines deliberately book flights despite staff shortages https://t.co/jmYwLQKSXE",
  "data/tweet-wsj/2022/8/1554882322981437440.json": "If you ask Michael Saylor why he bet the future of MicroStrategy on bitcoin, he’ll tell you he didn’t have a choice. The decision backfired, badly. On Tuesday, the tech company announced he would step down as CEO amid mounting losses tied to bitcoin. https://t.co/qqP7WRAico",
  "data/tweet-wsj/2022/8/1555127689408925697.json": "South Korea’s president, in the middle of his summer vacation in Seoul, doesn’t plan to meet face-to-face with visiting House Speaker Nancy Pelosi https://t.co/Zt6j4UO635",
  "data/tweet-wsj/2022/8/1555052174895349761.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/3ZoC5AdwlD",
  "data/tweet-wsj/2022/8/1555029548147871745.json": "Australia launched a wide-ranging review of its military, reflecting concerns among some U.S. allies that the U.S.-China rivalry is increasing the risk of armed conflict in Asia and the Pacific https://t.co/HlXz1v2Hcj",
  "data/tweet-wsj/2022/8/1555193429004533764.json": "Breaking: Mortgage rates fell to 4.99%, their lowest level since April https://t.co/3gVtPKrJUj",
  "data/tweet-wsj/2022/8/1555139050423697409.json": "If you ask Michael Saylor why he bet the future of MicroStrategy on bitcoin, he’ll tell you he didn’t have a choice. The decision backfired, badly. On Tuesday, the tech company announced he would step down as CEO amid mounting losses tied to bitcoin. https://t.co/GZOY265QEd",
  "data/tweet-wsj/2022/8/1555218770838290432.json": "Breaking: Four current and former Louisville officers will face civil-rights and other charges in connection with Breonna Taylor’s death, more than two years after she was fatally shot in her home during a botched police raid https://t.co/fFu9wxcPwB",
  "data/tweet-wsj/2022/8/1555172973069451265.json": "Ukraine struck a railway bridge in the southern Kherson region as it seeks to cut Russia’s supply lines in preparation for a looming counter-offensive     https://t.co/9mji5CcDOx",
  "data/tweet-wsj/2022/8/1555237175922507777.json": "Florida Gov. Ron DeSantis has suspended state attorney Andrew Warren for pledges he made about declining to prosecute cases involving abortion and potential violations related to gender-transition treatments for children https://t.co/q8qIMQ8y3Q",
  "data/tweet-wsj/2022/8/1555195602203451395.json": "U.S. gas prices have fallen for seven straight weeks and are approaching an average price of $4 a gallon, easing the pain for American drivers #WSJWhatsNow https://t.co/bMPvQOUWTW https://t.co/WUmW8gpNLJ",
  "data/tweet-wsj/2022/8/1555297562613129218.json": "Essay: China is threatening Taiwan because it knows its global power is peaking and the time to attack is soon. Is the U.S. prepared for the war to come? https://t.co/ZpmkG3fKBo",
  "data/tweet-wsj/2022/8/1555207022898978816.json": "The pistol used to kill Alissa King, a popular 17-year-old basketball star in Boston, came from a pawnshop in Alabama—part of a surge in gun trafficking across state lines https://t.co/AKinsRv0UY",
  "data/tweet-wsj/2022/8/1555313271166701568.json": "Breaking: Alex Jones was ordered to pay $4.1 million to the parents of a Sandy Hook school shooting victim. The Infowars founder has suggested the massacre was a hoax. https://t.co/waz8upywrB",
  "data/tweet-wsj/2022/8/1555320232486617088.json": "An image of a galaxy about 500 million light-years from Earth was captured by the James Webb Space Telescope. See the other images NASA has released. https://t.co/W9Ogg3ilZv",
  "data/tweet-wsj/2022/8/1555366342273941504.json": "Breaking: Sen. Kyrsten Sinema said she would move forward with the Democrats’ climate package after a deal to remove carried-interest tax provisions https://t.co/OJCeEp789V",
  "data/tweet-wsj/2022/8/1555395553957224449.json": "Breaking: Pelosi said the U.S. won’t allow China to isolate Taiwan, as Beijing encircled the island with rocket and ballistic-missile fire following her visit https://t.co/WFbRPYzO4G",
  "data/tweet-wsj/2022/8/1555380252511293440.json": "Breaking: Trump-backed Kari Lake won Arizona’s GOP primary for governor, AP projects. She defeated Karrin Taylor Robson, who was endorsed by Mike Pence. https://t.co/BHlKNTFQNn",
  "data/tweet-wsj/2022/8/1555448547230769152.json": "An image of a galaxy about 500 million light-years from Earth was captured by the James Webb Space Telescope. See the other images NASA has released. https://t.co/V0o1JeWnv7",
  "data/tweet-wsj/2022/8/1555271156248330245.json": "China’s current military drills offer a hint about its strategy: In a crisis, Beijing would try to squeeze rather than flatten Taiwan into submission https://t.co/eBfU7ucRgf",
  "data/tweet-wsj/2022/8/1555268893161230336.json": "Breaking: Monkeypox was declared a public-health emergency in the U.S. as cases mount around the country, a move aimed at speeding up the distribution of vaccines https://t.co/gqLp3fdOLa",
  "data/tweet-wsj/2022/8/1555533862666649600.json": "The U.S. added 528,000 jobs in July. The economy has now recouped the number of jobs lost in the wake of the pandemic. https://t.co/q6NyG6ivdU",
  "data/tweet-wsj/2022/8/1555532078778826754.json": "Amazon is buying Roomba maker iRobot for $1.7 billion, including debt, as the online retailer adds another connected-home product to its portfolio https://t.co/bp05w9tjK5",
  "data/tweet-wsj/2022/8/1555542932366704642.json": "From @WSJopinion: The federal government isn’t starving for revenue. Congress wants more tax revenue because it can’t control its appetite for spending. https://t.co/Txj2FgiHB7",
  "data/tweet-wsj/2022/8/1555593744338108417.json": "A man who made threats against Dr. Anthony Fauci over the U.S.’s Covid-19 response was sentenced to roughly three years in federal prison https://t.co/WZNVFQ5R38",
  "data/tweet-wsj/2022/8/1555610870864125953.json": "The CDC advised sexually active people to limit their number of sex partners, after finding the monkeypox outbreak has been concentrated among men who have had sex with multiple men https://t.co/HaIOB5By0T",
  "data/tweet-wsj/2022/8/1555675371944673281.json": "Breaking: Alex Jones was ordered to pay $42.5 million in punitive damages to the parents of a Sandy Hook victim, in addition to $4.1 million for actual damages https://t.co/btIMOo1tqy",
  "data/tweet-wsj/2022/8/1555683001283088384.json": "Alex Jones was ordered to pay $45.2 million in punitive damages to the parents of a Sandy Hook victim (corrects an earlier tweet, which has been deleted, that stated the figure was $42.5 million) https://t.co/KNNnguv5LB https://t.co/pKUB2IILXZ",
  "data/tweet-wsj/2022/8/1555554970338037760.json": "The U.S. economy added 528,000 jobs in July, defying expectations that cooling consumer spending and rising risks of a recession would slow job growth #WSJWhatsNow https://t.co/E7dmjOb1iq https://t.co/VhyQG7Lswj",
  "data/tweet-wsj/2022/8/1555014668875612160.json": "Recent subpoenas of top Trump White House lawyers are the latest sign that the Justice Department’s Jan. 6 probe is entering a more aggressive phase https://t.co/dC35qsfFPv",
  "data/tweet-wsj/2022/8/1555739199768350720.json": "Author Michael Pollan predicts psychedelics will become more integrated in our society: “There will be a medical industry providing psychedelic therapy” https://t.co/NY66DJGZKv",
  "data/tweet-wsj/2022/8/1555726621042155520.json": "Rep. Dan Newhouse is the second GOP House member to make it through a primary after voting to impeach former President Donald Trump. https://t.co/S7QUJ0iAyL",
  "data/tweet-wsj/2022/8/1555773191150346247.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/bBCD3LiMTp https://t.co/RX1RfhIwF9",
  "data/tweet-wsj/2022/8/1555788265751453698.json": "If a salesman wants to convince people to buy what he’s selling, it helps if he has a beard, according to a study https://t.co/HSPmDAseLj",
  "data/tweet-wsj/2022/8/1555792050720751616.json": "Stacks of cash, a stealthy dash to the airport, and cloak-and-dagger tactics: the inside story of Carlos Ghosn’s carefully orchestrated escape from Japan https://t.co/Bv9DOEDzwL",
  "data/tweet-wsj/2022/8/1555848711816765440.json": "Take a look at the front page of today's Wall Street Journal https://t.co/8nbGztJMeQ https://t.co/AKjrwXQckq",
  "data/tweet-wsj/2022/8/1555909075149508610.json": "From @WSJopinion: Having created the inflationary mess in the first place, Democrats now aim to con the country into believing that they’re cleaning it up, even as they steal a further march in their plan to remake the country, writes @gerardtbaker https://t.co/fASZ2fjwaf",
  "data/tweet-wsj/2022/8/1555920418845999106.json": "Stacks of cash, a stealthy dash to the airport, and cloak-and-dagger tactics: the inside story of Carlos Ghosn’s carefully orchestrated escape from Japan https://t.co/tfJx5lZYs7",
  "data/tweet-wsj/2022/8/1555893994554621955.json": "Ukraine’s official tongue, once derided as the language of uneducated villagers, is gaining popularity in Kyiv and other cities where residents want to sever linguistic ties with Russia https://t.co/cJ5NY9Pq3v",
  "data/tweet-wsj/2022/8/1556014769714462720.json": "Eli Lilly spoke out against Indiana’s new abortion law, saying the restrictions could hurt the pharmaceutical company’s ability to keep and attract employees and will lead to more hiring outside the state https://t.co/3FZk3gYEhX",
  "data/tweet-wsj/2022/8/1556086481210544131.json": "Obituary: Donald Jonas, who raised millions from his art collection to fund philanthropy, said, \"If you die rich, you die poor really.\"\nhttps://t.co/HBE3Pifp4F",
  "data/tweet-wsj/2022/8/1556067631710572548.json": "Vice President Kamala Harris cast a tie-breaking vote to help Senate Democrats advance the climate and tax package. Final vote could come as soon as Sunday. https://t.co/8TyFeF0VUa",
  "data/tweet-wsj/2022/8/1556124244869791744.json": "Forty-six million people moved to a different ZIP Code in the year through February 2022. They are changing the geography of the American economy. https://t.co/0nH0K6LvOb",
  "data/tweet-wsj/2022/8/1556128011874885633.json": "The era of cheap American energy is at an end. A costlier, more volatile energy era is here. https://t.co/lBgvfh6QBJ",
  "data/tweet-wsj/2022/8/1556097825431162881.json": "How does Nathan Fielder do it? Even the participants on his show don’t always know. https://t.co/FGUsnPvjAH",
  "data/tweet-wsj/2022/8/1556226177374818304.json": "After clearing a procedural hurdle Saturday, Democrats are poised to pass the legislation on Sunday https://t.co/4Pn8e6PLXy",
  "data/tweet-wsj/2022/8/1556294207064645633.json": "Essay: China is threatening Taiwan because it knows its global power is peaking and the time to attack is soon. Is the U.S. prepared for the war to come? https://t.co/WAYdddqF8g",
  "data/tweet-wsj/2022/8/1556248829988683777.json": "The number of U.S. residents in Portugal leaped last year. Here's why so many Americans are relocating there. https://t.co/LkVfzoPjOx",
  "data/tweet-wsj/2022/8/1556282800633937920.json": "Biden tested negative for Covid-19 for a second consecutive day following his rebound case and was cleared for travel by his doctor. https://t.co/9nfD6ENwhf",
  "data/tweet-wsj/2022/8/1556267685218074628.json": "Palestinian Islamic Jihad fired rockets at Jerusalem, targeting the contested city for the first time as the violent flare-up between the Gaza militant group and Israel entered its third day  https://t.co/CYw25VrJGw",
  "data/tweet-wsj/2022/8/1556112944852881410.json": "Even trendy razor companies are backing off from the clean shave. How armpit hair resprouted, from glossy ads to celebrity underarms. https://t.co/qKF1TFdhfQ",
  "data/tweet-wsj/2022/8/1556361176619126790.json": "The Senate passed Democrats’ climate, healthcare and tax package, sending the bill to the House after more than 15 hours of amendments https://t.co/4600ReE5EJ",
  "data/tweet-wsj/2022/8/1556116704161398784.json": "Electric bikes have come a long way in the past decade. Better batteries and motors now make them a viable alternative to cars. https://t.co/DPooOk6jon",
  "data/tweet-wsj/2022/8/1556331889115422723.json": "From @WSJopinion: The White House seems to be under the impression that Trump got the boot in 2020 because of his stewardship of the economy. But the economy is one area where he polled strongest, writes @jasonrileywsj. https://t.co/UudLGZQ7Zq",
  "data/tweet-wsj/2022/8/1556131782390595587.json": "A major fire spread uncontrolled at a large oil-storage facility in the Cuban port of Matanzas. More than a hundred people were injured and many firefighters were missing, authorities said. The fire was set off by a bolt of lightning. https://t.co/at8Chr0buA",
  "data/tweet-wsj/2022/8/1556399856020848644.json": "Forget beaches. Miami is all about hedge funds and crypto now. https://t.co/qWVIjT1Bnc",
  "data/tweet-wsj/2022/8/1556245041668149248.json": "China wrapped up four days of live-fire and combat exercises that showcased its growing offensive capabilities against Taiwan and updated Beijing’s tool kit for intimidating the island democracy  https://t.co/Sbtu3Aewu8",
  "data/tweet-wsj/2022/8/1556401174462464000.json": "Israel and Gaza militants agreed to a cease-fire after three days of fighting that saw more than 40 Palestinians killed https://t.co/rGRp5z8NJK",
  "data/tweet-wsj/2022/8/1556290332798631936.json": "Why is NATO so worried about the Poland-Lithuania border region? Because it is sandwiched between two Russian military strongholds. https://t.co/zTMiIU4hpx",
  "data/tweet-wsj/2022/8/1556422474056728578.json": "Obituary: Richard Tait created the Cranium board game, designed to make everyone feel smart, at least part of the time, by challenging various parts of the brain. He died of Covid-19 at age 58. https://t.co/AxAfvskwnj",
  "data/tweet-wsj/2022/8/1556589619663233024.json": "Pfizer will buy Global Blood Therapeutics for $5.4 billion, people familiar with the matter say, giving it a foothold in the treatment of sickle-cell disease",
  "data/tweet-wsj/2022/8/1556599897469718528.json": "BlackRock is opening a satellite office in South Florida to accommodate a top executive and dozens of other employees, joining a migration of financial firms to the state https://t.co/2xH7HNVfyl",
  "data/tweet-wsj/2022/8/1556682667571249153.json": "In nearly 75% of college programs tallied in new federal data, men earned more than women soon after graduating—with the same degree. It’s evidence that the gender pay gap is there from the start. https://t.co/xR3gG03RCB",
  "data/tweet-wsj/2022/8/1556700022330331137.json": "David McCullough, the bestselling author whose biographies on Presidents Harry Truman and John Adams won Pulitzer Prizes, has died at 89 https://t.co/skmOTIMGKo",
  "data/tweet-wsj/2022/8/1556739320257593344.json": "Olivia Newton-John, the Grammy-winning singer-songwriter best known for her starring role in the film “Grease,” has died at 73 https://t.co/bo647Zf4WA",
  "data/tweet-wsj/2022/8/1556750872536817664.json": "As many as 80,000 Russian troops have been wounded or killed in less than six months of fighting in Ukraine, the Pentagon said Monday, the first time the U.S. military announced its estimates of the toll of the invasion on Russia https://t.co/oBnKTMoVIy",
  "data/tweet-wsj/2022/8/1556783270196649985.json": "Former President Donald Trump said Monday evening that FBI agents were conducting a raid at his Mar-a-Lago resort in Palm Beach, Florida: “Nothing like this has ever happened to a president of the United States before.\" https://t.co/zW2g1aXsZG",
  "data/tweet-wsj/2022/8/1556795265314689025.json": "FBI agents searched former President Donald Trump’s Mar-a-Lago home in Florida Monday, which people familiar with the matter said was part of an investigation into Trump’s handling of official records https://t.co/4rleeaIEXz",
  "data/tweet-wsj/2022/8/1556807605003108358.json": "“Better Call Saul” often looks more like art than television. Here, we break down some of the shots that will cement the show as one of the era’s most visually inventive. https://t.co/brGJCeRYpK",
  "data/tweet-wsj/2022/8/1556803723409637377.json": "The U.S. has obtained a warrant to seize a private plane worth more than $90 million that is allegedly owned by blacklisted Russian oligarch Andrei Skoch https://t.co/jp2KkejeBe",
  "data/tweet-wsj/2022/8/1556841452054781952.json": "President Biden has spent more days away on personal travel and given fewer interviews than Donald Trump or Barack Obama. He’s also played less golf. https://t.co/SBx8pB1Aj8",
  "data/tweet-wsj/2022/8/1556840740155695104.json": "Former President Trump's lawyer confirmed federal agents “seized paper\" during a search of Trump's Mar-a-Lago home in Florida Monday https://t.co/cRRqo64Tyt",
  "data/tweet-wsj/2022/8/1556856567458414592.json": "Olivia Newton-John, the Grammy-winning singer-songwriter best known for her starring role in the film “Grease,” died Monday at 73 https://t.co/Phtym8IuTU",
  "data/tweet-wsj/2022/8/1556852794858020867.json": "As many as 80,000 Russian troops have been wounded or killed in less than six months of fighting in Ukraine, the Pentagon said Monday, the first time the U.S. military announced its estimates of the toll of the invasion on Russia https://t.co/ZnUb348KGi",
  "data/tweet-wsj/2022/8/1556864129465450496.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/wp8EgJKI1Z",
  "data/tweet-wsj/2022/8/1556645174704472064.json": "The IRS is telling Congress it would use extra funding it gets to pursue tax cheats earning more than $400,000. https://t.co/LFyrd10UEU",
  "data/tweet-wsj/2022/8/1556898122558836737.json": "“Better Call Saul” often looks more like art than television. Here, we break down some of the shots that will cement the show as one of the era’s most visually inventive. https://t.co/rPgSYAFpZE",
  "data/tweet-wsj/2022/8/1556969057559220224.json": "Deadly flooding has sparked scenes of chaos in South Korea, home to companies such as Samsung and Hyundai, where heavy rain is expected to continue for several days #WSJWhatsNow https://t.co/LP8nfXfK0U https://t.co/PNQkP0A2vO",
  "data/tweet-wsj/2022/8/1557004091473240065.json": "After the mass violence in Uvalde, Texas, and other nearby areas, many residents are showing a new interest in making changes to gun policies. https://t.co/bS3J7H5epC",
  "data/tweet-wsj/2022/8/1556935873928855554.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/4uKY5sFJR6",
  "data/tweet-wsj/2022/8/1556989413653110784.json": "Some Republicans condemned the FBI search of former President Donald Trump’s Mar-a-Lago home, and threatened to conduct oversight into the Justice Department should they win the majority in November. House Speaker Pelosi said that no one is above the law. https://t.co/QI7szXwlEx",
  "data/tweet-wsj/2022/8/1557075506155163648.json": "An appeals court ruled that House Democrats can obtain former President Donald Trump’s tax returns from the IRS https://t.co/1EX21vek3h",
  "data/tweet-wsj/2022/8/1556890547360514051.json": "From @WSJopinion: The Schumer-Manchin bill won’t reduce inflation, won’t reduce the budget deficit, and it won’t reduce the world’s temperature\nhttps://t.co/N1SGfN7LfU",
  "data/tweet-wsj/2022/8/1557105734227197953.json": "A former Twitter employee was found guilty of spying for Saudi Arabia and money laundering after passing on private user information associated with critics of the kingdom in exchange for hundreds of thousands of dollars https://t.co/VSSadtCGpE",
  "data/tweet-wsj/2022/8/1557113265431388162.json": "The last Domino’s Pizza Inc. franchises in Italy have closed after the American brand failed to break through in the birthplace of pizza https://t.co/OkWlKMiGTS",
  "data/tweet-wsj/2022/8/1556962273469632513.json": "Taiwan’s military fired dozens of shells off its southern coast in a defense simulation, as the island followed up Chinese military drills with preplanned defensive maneuvers of its own https://t.co/UTcaSwju9Z",
  "data/tweet-wsj/2022/8/1557132127782699008.json": "FBI agents searched Trump’s Florida home in part because they believed additional classified information remained after the National Archives retrieved 15 boxes of White House documents from the resort earlier this year, people familiar with the matter say https://t.co/eVFjtW1zH1",
  "data/tweet-wsj/2022/8/1557181196911656960.json": "FBI agents searched Trump’s Florida home in part because they believed additional classified information remained after the National Archives retrieved 15 boxes of White House documents from the resort earlier this year, people familiar with the matter say https://t.co/z7xCq5HEx9",
  "data/tweet-wsj/2022/8/1556769769012985858.json": "Watch: Chili peppers contain a chemical compound called capsaicin that activates pain receptors in the mouth. But why do we perceive it as hot? https://t.co/sc8EK9vERC",
  "data/tweet-wsj/2022/8/1557196327125229568.json": "Elon Musk sold nearly $7 billion worth of Tesla stock in recent days, regulatory disclosures show, just months after saying he wasn’t planning to sell additional shares in the company https://t.co/HNQ2shfSAu",
  "data/tweet-wsj/2022/8/1557192597357182986.json": "Wisconsin Democrats selected Lt. Gov. Mandela Barnes as their nominee to take on Republican Sen. Ron Johnson in November’s election https://t.co/0p5w3QasVK",
  "data/tweet-wsj/2022/8/1557226537866469378.json": "A former Twitter employee was found guilty of spying for Saudi Arabia and money laundering after passing on private user information associated with critics of the kingdom in exchange for hundreds of thousands of dollars https://t.co/c7gaS7EVf1",
  "data/tweet-wsj/2022/8/1557215210481586176.json": "“Better Call Saul” often looks more like art than television. Here, we break down some of the shots that will cement the show as one of the era’s most visually inventive. https://t.co/zjF8x7Dfk9",
  "data/tweet-wsj/2022/8/1557094428359237636.json": "The FBI search of Donald Trump’s home rallied many Republicans around the former president and could shift the course of midterm elections and the 2024 presidential race https://t.co/FbKCnJIUJo",
  "data/tweet-wsj/2022/8/1557109531506786305.json": "A government records case against former President Donald Trump could trigger an unprecedented legal battle over whether the ex-president could be barred from seeking reelection if convicted https://t.co/TgmixexPgo",
  "data/tweet-wsj/2022/8/1557245366864678912.json": "President Biden has spent more days away on personal travel and given fewer interviews than Donald Trump or Barack Obama. He’s also played less golf. https://t.co/jIT9qEd1oI",
  "data/tweet-wsj/2022/8/1557331800950718465.json": "Donald Trump is set to be deposed Wednesday by the New York attorney general’s office in its civil-fraud investigation into the financial dealings of the former president and his company. https://t.co/lElKpJzCAk",
  "data/tweet-wsj/2022/8/1557344130690387968.json": "U.S. inflation was 8.5% in July, holding close to its highest annual rate in four decades despite easing energy costs https://t.co/JwwXpWypsG",
  "data/tweet-wsj/2022/8/1557354843240538113.json": "A top-ranking Democrat asked the Consumer Financial Protection Bureau to stop Equifax from selling credit scores to lenders until the credit-reporting firm can prove it has the controls in place to ensure its scores are correct https://t.co/DbWgv8iiUq",
  "data/tweet-wsj/2022/8/1557381736983666692.json": "Donald Trump said he declined to answer questions during his testimony in New York's civil-fraud investigation, asserting his right under the Fifth Amendment https://t.co/y0uX29xuWQ",
  "data/tweet-wsj/2022/8/1557321148202893313.json": "Tim Michels, a wealthy Wisconsin businessman backed by Donald Trump, won the Republican gubernatorial primary and will face Democratic Gov. Tony Evers in the battleground state #WSJWhatsNow https://t.co/DQcr60zri8 https://t.co/aGZ4Qb4h8M",
  "data/tweet-wsj/2022/8/1557127432003526661.json": "Actor Ben Affleck has listed his seven-bedroom home in the Pacific Palisades area of Los Angeles for $29.995 million https://t.co/S6kfdz43c6",
  "data/tweet-wsj/2022/8/1557275636619792386.json": "The FBI search of Donald Trump’s home rallied many Republicans around the former president and could shift the course of midterm elections and the 2024 presidential race https://t.co/l3mdcNOVYM",
  "data/tweet-wsj/2022/8/1557358657054064640.json": "By some measures, paying $426 for a night at a Motel 6 might sound absurd. By others, it’s not the worst deal out there. https://t.co/aBKguwVZKF",
  "data/tweet-wsj/2022/8/1557474906882932737.json": "Two former JPMorgan traders were convicted of manipulating gold prices. A federal jury found they used misleading orders to rig prices for several years. https://t.co/J9swWyeSMG",
  "data/tweet-wsj/2022/8/1557452991661314048.json": "The average price of a gallon of unleaded gasoline in the U.S. fell to $4 a gallon Wednesday, a 20% drop from June's peak, as demand for oil softens around the globe https://t.co/M1LPMLYfVO",
  "data/tweet-wsj/2022/8/1557479426102857731.json": "The FCC rescinded more than $2 billion in grants previously awarded to Elon Musk’s SpaceX and a small internet provider https://t.co/EfeMkAvhvW",
  "data/tweet-wsj/2022/8/1557513406126739458.json": "Consumers are likely to travel and spend more because U.S. national gasoline prices have fallen for weeks, economists said, delivering an expected boost to the economy https://t.co/GYF02bhzbw",
  "data/tweet-wsj/2022/8/1557603989847478273.json": "Donald Trump said Wednesday that he declined to answer questions during his testimony in New York's civil-fraud investigation, asserting his right under the Fifth Amendment https://t.co/GY0pRbhDse",
  "data/tweet-wsj/2022/8/1557588899819569153.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/dShl8mpkwe",
  "data/tweet-wsj/2022/8/1557351089007202314.json": "Iran has begun training Russian officials to use its advanced drones, according to the Biden administration, the latest sign that Moscow plans to use Tehran’s military weapons to try to seize a new aerial advantage in Ukraine https://t.co/w9sLAzEymW",
  "data/tweet-wsj/2022/8/1557653066719051778.json": "U.S. inflation was 8.5% in July, holding close to its highest annual rate in four decades despite easing energy costs https://t.co/vdJSsa0ydG",
  "data/tweet-wsj/2022/8/1557683280840892419.json": "Few African regions have the nerve to say no to China. Independence-minded Somaliland is one. “We’re not going to allow anyone to dictate who we can have a relationship with.” https://t.co/9eSFFEHGOF",
  "data/tweet-wsj/2022/8/1557468102983557120.json": "Minnesota corrections officers of color who alleged they were barred from guarding Derek Chauvin reached a $1.5 million settlement with officials https://t.co/DetPHhmUVs",
  "data/tweet-wsj/2022/8/1557732344345161728.json": "From @WSJopinion: If preventing Trump from running in 2024 was the purpose of the Mar-a-Lago search, the government wasted its time and the taxpayers’ resources, write @DavidRivkin and Lee A. Casey https://t.co/EMkzpu8eSK",
  "data/tweet-wsj/2022/8/1557458422139965443.json": "The Nasdaq surged 2.9% and entered a bull market, up at least 20% from a recent low. The rise ended the longest bear market since 2008. https://t.co/WTaNuPOsLf",
  "data/tweet-wsj/2022/8/1557377496357785602.json": "United Airlines has paid a $10 million deposit for 100 electric flying taxis, a sign that the airline is growing more confident in the nascent technology https://t.co/72AqpuYP7W",
  "data/tweet-wsj/2022/8/1557675752019075073.json": "In June, the FBI asked for a stronger lock to be installed on the door of a Mar-a-Lago storage room holding government records. Then, things soured between the FBI and the Trump team. https://t.co/wW6wT3uNvk",
  "data/tweet-wsj/2022/8/1557770095568592896.json": "From @WSJopinion: The Trump raid is now a wall-to-wall political disaster for the United States, doing more damage, if that’s possible, to the country’s internal divisions and even creating external risks, writes @DanHenninger https://t.co/dSHPM7r93x",
  "data/tweet-wsj/2022/8/1557755052139364352.json": "The SEC is investigating Melvin Capital's investor disclosures after it was crippled by last year's meme-stock rally, people familiar with the matter said https://t.co/pPFKAGqUcS",
  "data/tweet-wsj/2022/8/1557809813786083329.json": "Breaking: The Justice Department asked a judge to unseal the search warrant for former President Donald Trump’s Mar-a-Lago home. Attorney General Merrick Garland said he approved the effort to seek a warrant. https://t.co/m4Ow7ui0iw",
  "data/tweet-wsj/2022/8/1557822942276354048.json": "Shannon Bream, chief legal correspondent for Fox News, was named the new host of “Fox News Sunday.” She will be the first woman to host a Sunday morning talk show on the network. https://t.co/eK9ULqXFRN",
  "data/tweet-wsj/2022/8/1557502089022119936.json": "In the wake of the FBI’s search of Donald Trump’s Mar-a-Lago home, the Justice Department is sticking to its practice of not commenting on probes—despite GOP calls for an explanation https://t.co/oBoORUJW7h",
  "data/tweet-wsj/2022/8/1557862541975486470.json": "Breaking: A man armed with a rifle who tried to storm the FBI’s Cincinnati office was killed after a gun battle with police, officials said https://t.co/5NgLWeHQKE",
  "data/tweet-wsj/2022/8/1557845595733504001.json": "New research shows that boys given behavioral training for aggression more than 30 years ago became men who earned more money and committed less crime https://t.co/BCkyA4Xv6h",
  "data/tweet-wsj/2022/8/1557566249386786818.json": "Chile, Bolivia and Argentina account for more than half of the world’s known lithium deposits. But try getting it out of the ground and into electric-car batteries. https://t.co/JrB3My7maQ",
  "data/tweet-wsj/2022/8/1557883348953038848.json": "NASA calls the Perseids, which return every summer and will peak Friday and Saturday, one of the best annual meteor showers. Here's how to watch. https://t.co/VLfbdDvzzO",
  "data/tweet-wsj/2022/8/1557796519604064257.json": "In a call with President Biden ahead of House Speaker Nancy Pelosi's visit to Taiwan, Chinese leader Xi Jinping indicated that Beijing had no intention of going to war, according to people close to China’s decision-making https://t.co/Z6eMlQaPlg",
  "data/tweet-wsj/2022/8/1557947514480992258.json": "From @WSJopinion: In descending on Mar-a-Lago, the DOJ and the FBI shifted the U.S. into the category of countries whose ruling parties use government power to investigate political rivals, writes @KimStrassel https://t.co/FGKhCP7qWI",
  "data/tweet-wsj/2022/8/1557936183035969538.json": "The CDC said it no longer recommends that people quarantine after being exposed to Covid-19, as long as they don’t feel sick, get tested after five days and wear a high-quality mask around others for 10 days https://t.co/v9d6CbicAg",
  "data/tweet-wsj/2022/8/1557997464275374082.json": "Trump said he wouldn't oppose the release of the FBI’s search warrant of his Florida home https://t.co/oXA4IoyaZj",
  "data/tweet-wsj/2022/8/1557955057408217088.json": "In June, the FBI asked for a stronger lock to be installed on the door of a Mar-a-Lago storage room holding government records. Then, things soured between the FBI and the Trump team. https://t.co/WZnPNVESYS",
  "data/tweet-wsj/2022/8/1557389844174733313.json": "With inflation still high, Social Security recipients are on track to receive their highest cost-of-living increase in more than four decades next year https://t.co/FfYtw8Jypx",
  "data/tweet-wsj/2022/8/1558123844610756609.json": "Author Salman Rushdie was attacked Friday at a lecture series in upstate New York. His book “The Satanic Verses” led to death threats against him in the 1980s. https://t.co/sSurFhxRPc",
  "data/tweet-wsj/2022/8/1558118096363208706.json": "Chinese President Xi Jinping is planning his first face-to-face meeting with President Biden on a visit to Southeast Asia in November, people familiar with the matter say https://t.co/OkBi4YnZYk",
  "data/tweet-wsj/2022/8/1558141378990833664.json": "Breaking: FBI agents searching Trump’s Mar-a-Lago home removed 11 sets of classified documents, including some marked as top secret and meant to be only kept in special government facilities, according to a copy of the inventory reviewed by WSJ https://t.co/n6veD2OVSt",
  "data/tweet-wsj/2022/8/1558007914878599168.json": "Few African regions have the nerve to say no to China. Independence-minded Somaliland is one. “We’re not going to allow anyone to dictate who we can have a relationship with.” https://t.co/oI0j50rUBn",
  "data/tweet-wsj/2022/8/1557962631369183232.json": "“We’ve never seen a property market slowdown of this size and severity.” China’s housing bubble has burst, and the world’s second-largest economy will likely feel the effects for years. https://t.co/PHXgSMXgrx",
  "data/tweet-wsj/2022/8/1558208757821235201.json": "The House passed a climate and healthcare bill that will soon head to Biden’s desk, capping a yearlong push by Democrats https://t.co/zaBPnQeaeT",
  "data/tweet-wsj/2022/8/1558211754081001474.json": "Stargazers are getting set for the Perseid meteor shower this evening, which will peak in the early morning hours on Friday and Saturday. NASA calls the Perseids one of the best annual meteor showers. https://t.co/0riqtvx1yP",
  "data/tweet-wsj/2022/8/1558189105900670978.json": "The items the FBI seized from former President Trump’s Mar-a-Lago home this week included top secret documents, secret documents and confidential documents—each is a different level of classification. Here's what that means. https://t.co/uqC3MkWGaD",
  "data/tweet-wsj/2022/8/1558234428060606467.json": "In an exclusive interview, Henry Kissinger discusses the qualities of great leaders, U.S. policy toward Taiwan and Ukraine, and the dangerous \"disequilibrium\" emerging in the world https://t.co/5ZjSqneZks",
  "data/tweet-wsj/2022/8/1557713519621160962.json": "“I have a really good résumé, but the headshot is the first impression.” People judge a book by its cover. A $1,000 professional headshot may be worth it. https://t.co/BIFhTBdGX8",
  "data/tweet-wsj/2022/8/1558313668097474562.json": "The items the FBI seized from former President Trump’s Mar-a-Lago home this week included top secret documents, secret documents and confidential documents—each is a different level of classification. Here's what that means. https://t.co/fNQcEXzyrx",
  "data/tweet-wsj/2022/8/1558291022429528064.json": "From @WSJopinion: Like so many other ghosts from the past that have returned in recent times, Salman Rushdie’s assault reminds us that the threat to free speech is both old and new again, writes @almarlatour https://t.co/SgpYiKRpcm"
}