{
  "data/tweet-economist/2022/8/1553899291546046464.json": "Ukraine is gathering strength for an assault on Kherson https://t.co/Eh0JlVAtCF",
  "data/tweet-economist/2022/8/1553932336143687682.json": "This week 191 countries gather in New York to review the Nuclear Non-Proliferation Treaty, a cornerstone of global security https://t.co/6D8h0djASc",
  "data/tweet-economist/2022/8/1553910445463027712.json": "The sun is both our creator and destroyer https://t.co/8BSUqAWFgH",
  "data/tweet-economist/2022/8/1554023593956220928.json": "Russia’s hostility has three targets: the liberal West, Ukraine and trai­tors at home. All of them need to take stock of what Russian fascism means \nhttps://t.co/zPM4JGKmnu",
  "data/tweet-economist/2022/8/1554152798417260546.json": "Vladimir Putin has summoned the demons of history by branding Volodymyr Zelensky, who is Jewish, as “a Nazi”. Israel is worried that Russia’s president may be falling back on bad old tsarist ways https://t.co/QnJn07Ru65",
  "data/tweet-economist/2022/8/1554142895040495616.json": "The national-security dimensions of microchips made the CHIPS Act a rare instance of broad political agreement in America https://t.co/sult1CT1Mb",
  "data/tweet-economist/2022/8/1554177503719301121.json": "The engine of fascism does not have a reverse gear. Vladimir Putin cannot turn back to a reality­-based brand of authoritarianism. It will seek to ex­pand both geographically and into people’s private lives \nhttps://t.co/pEOL8ICHZw",
  "data/tweet-economist/2022/8/1554415057844453377.json": "♦️ Nancy Pelosi is expected to arrive in Taiwan today.\n\n♦️ Ayman al-Zawahiri, leader of al-Qaeda, was killed by American drone strike, Joe Biden confirms.\n\n♦️ BP’s profits soar as the energy giant benefits from rising commodity prices.\n\nCatch up on today’s news ⬇️",
  "data/tweet-economist/2022/8/1554463929157443584.json": "A trip designed to convey strength risks instead showing up the Biden administration’s confusion and lack of purpose https://t.co/ftHXdjqCLV",
  "data/tweet-economist/2022/8/1554451133258661891.json": "“This terrorist leader is no more. People around the world no longer need to fear the vicious and determined killer,” declared Joe Biden https://t.co/ow1umC8OI9",
  "data/tweet-economist/2022/8/1554496028564389890.json": "Nancy Pelosi, the speaker of America’s House of Representatives, has landed in Taiwan. She is expected to meet Taiwan’s president Tsai Ing-wen on Wednesday. Follow her visit and catch up on the latest news ⬇️",
  "data/tweet-economist/2022/8/1554557946507526152.json": "Clinical practice is already changing to emphasise dealing with environmental triggers of depression rather than deploying drugs https://t.co/nqKNUmQKVJ https://t.co/qhxJNxYNbH",
  "data/tweet-economist/2022/8/1554714417903943681.json": "America’s Congress may be a separate branch from the executive, but Taiwan policy is too important for turf wars. The trip has made Joe Biden look irresolute and lacking in authority https://t.co/Vih3V5ugvE",
  "data/tweet-economist/2022/8/1554766008694480896.json": "♦️ Nancy Pelosi meets Taiwan’s president and reaffirms “American solidarity”.\n\n♦️ The first grain shipment to leave Ukraine since the war began reaches Turkey.\n\n♦️ Kansas chooses to keep the right to abortion in the state’s constitution after referendum.\n\nCatch up on today’s news",
  "data/tweet-economist/2022/8/1554581807143784450.json": "One view is that the trip is a symptom of America’s incoherent approach to China—the country’s single most important opponent in the long run https://t.co/7khiuiC0Z1",
  "data/tweet-economist/2022/8/1554737785097043968.json": "Germans have been living in a dream https://t.co/aLL8QPBBzo",
  "data/tweet-economist/2022/8/1554864436489355266.json": "Kansans vote to keep their state’s constitutional right to abortion https://t.co/Qo8yaEZm1j",
  "data/tweet-economist/2022/8/1554883859585589251.json": "Vladimir Putin has embraced fascist methods and fascist thinking. This holds an alarming message for the rest of the world \nhttps://t.co/p1bZFphIYS",
  "data/tweet-economist/2022/8/1554892246201376768.json": "Investigators appear to be building a criminal case against the former president https://t.co/knrdkPiFI6",
  "data/tweet-economist/2022/8/1554298866962399232.json": "Many voters mention their anger at how many Navajo households still must transport water to their homes by truck, despite previous administrations’ promises to solve the issue https://t.co/FGnkY0BVUU",
  "data/tweet-economist/2022/8/1554946509719965698.json": "The margin, 62% to 38%, suggests broad opposition to the demise of Roe v Wade https://t.co/UciEcIrG3k",
  "data/tweet-economist/2022/8/1555014032804937736.json": "Kansas has become a refuge for women from neighbouring Oklahoma and Missouri, where near-total bans on abortion are now in place. https://t.co/abAJtlaFpm",
  "data/tweet-economist/2022/8/1555078875872432128.json": "The pro-choice campaign triumphed through smart strategy. Instead of slogans explicitly about abortion, it emphasised personal liberty and privacy https://t.co/s2QMDb86Df",
  "data/tweet-economist/2022/8/1554746684109996034.json": "“We call it science at digital speed.”\n\n@demishassabis tells @kncukier how DeepMind’s AI system predicted the structure of almost all known proteins, on our “Babbage” podcast https://t.co/6sZKHMUzKa",
  "data/tweet-economist/2022/8/1555014428193595392.json": "The question now is how low prices will go https://t.co/OnkYaZWAbd",
  "data/tweet-economist/2022/8/1555162994946068480.json": "The Bank of England raises interest rates to 1.75%, the largest rise since 1995, as inflation soars in Britain. Catch up on the latest news ⬇️",
  "data/tweet-economist/2022/8/1555196245471264770.json": "For decades, an exercise of deliberate ambiguity has kept the peace between America and China over Taiwan. Today, this strategic ambiguity is breaking down https://t.co/9FvRq2fXwY https://t.co/7vtpcmcpHH",
  "data/tweet-economist/2022/8/1555125456864792576.json": "The country’s once-famed health system is in tatters. Where did it go wrong? https://t.co/yFhLjbXDBp",
  "data/tweet-economist/2022/8/1555258450036359169.json": "This week’s cartoon from KAL: https://t.co/oy4CioF2Vt https://t.co/vXqHSzxVnS",
  "data/tweet-economist/2022/8/1555308202136408073.json": "When Joe biden bangs on about bipartisanship and compromising, some Democrats think he’s out of touch. But the accumulating evidence suggests he understands how to make progress better than they do https://t.co/zQ7jlvUuc4",
  "data/tweet-economist/2022/8/1555445100993552386.json": "Under Vladimir Putin’s form of fascism, Rus­sia is set on a course that knows no turning back. Without victimhood and the use of violence, Mr Putin has noth­ing to oﬀer his people https://t.co/E9IRysv9XC",
  "data/tweet-economist/2022/8/1555285726090170369.json": "According to The Economist’s excess mortality tracker, Cuba has one of the highest estimated death tolls from the pandemic, relative to its size. Where did it go wrong? https://t.co/QL4RHQf53m",
  "data/tweet-economist/2022/8/1555474318125137920.json": "DeepMind’s AI system, AlphaFold, has predicted the shape of almost all known proteins. We explore what that means for science, on “Babbage”, our podcast on science and technology https://t.co/O1vP6kJFrt",
  "data/tweet-economist/2022/8/1555466866759553024.json": "Although the United States is not treaty-bound to defend Taiwan, our story from last year warned that a Chinese assault would be a test of America’s military might and its diplomatic and political resolve https://t.co/uSYr03gGT7 https://t.co/cwyIv54nvF",
  "data/tweet-economist/2022/8/1555686901553692679.json": "A conspiracy-monger at last faces the consequences of warping the facts https://t.co/YjVduGW11k",
  "data/tweet-economist/2022/8/1555384500888158210.json": "After this result, conservative legislators will think twice before pursuing strict abortion bans that may be out of step with their constituents’ views  https://t.co/wnlNMSNotP",
  "data/tweet-economist/2022/8/1555544687355764738.json": "“Great minds do not think alike. They challenge each other to think again.”\n\n@AdamMGrant talks to @annemcelvoy about what makes a good argument, on “The Economist Asks” podcast https://t.co/KwxzSuZzHO",
  "data/tweet-economist/2022/8/1555757417371258883.json": "A video of the 18-year-old pianist performing Rachmaninoff’s famously difficult concerto has been viewed more than 5m times on YouTube https://t.co/Y7uAc9kVM8",
  "data/tweet-economist/2022/8/1555899538036215808.json": "They’re in Canada https://t.co/hl6a0DuBT7",
  "data/tweet-economist/2022/8/1555772517008265216.json": "The Netflix show is reported to have an eye-watering budget of some $15m per episode, exceeding even the estimated figures for “The Crown” ($13m) https://t.co/HgdAYjB61u",
  "data/tweet-economist/2022/8/1555954829821939712.json": "Women in Arab countries have fewer chances to enjoy sport since exercise is frowned upon once girls become teenagers. Harassment in the street often makes it even more unpleasant https://t.co/TX2gokN39c",
  "data/tweet-economist/2022/8/1555873232997187586.json": "For those who dearly love “The Sandman” for its characters and their stories, Netflix’s new adaptation provides a whole new experience. And for those encountering them for the first time, a treat lies in store https://t.co/8AJHpDt2w4",
  "data/tweet-economist/2022/8/1556073155512467456.json": "The most recent data showed that the Chinese economy grew by only 0.4% in the second quarter, compared with a year earlier. This was not only bad, but worse than expected \nhttps://t.co/1hUcCPfDMi",
  "data/tweet-economist/2022/8/1556175147392024576.json": "For more than two decades, attempts to turn Neil Gaiman’s epic comic-book series into a film failed. But Netflix’s new adaptation of “The Sandman” is magnificent  https://t.co/djLoL2oii6",
  "data/tweet-economist/2022/8/1556189866723008512.json": "Vladimir Putin is not only out to crush a free Ukraine. He will use violence and totali­tarianism to impose his will at home. So far he is winning \nhttps://t.co/rOKsVFkGvs",
  "data/tweet-economist/2022/8/1556337823632035840.json": "Henry Kissinger considers whether leaders are now emerging with “the character, intellect and hardiness required to meet the challenges facing world order”. He is not optimistic https://t.co/38fZsYq93d",
  "data/tweet-economist/2022/8/1556389854849732618.json": "“Great minds do not think alike. They challenge each other to think again.”\n\n@AdamMGrant talks to @annemcelvoy about what makes a good argument, on “The Economist Asks” podcast https://t.co/1O6iXcWcoc",
  "data/tweet-economist/2022/8/1555818176402919424.json": "Some in the West want a return to business as usual once the war is over, but there can be no true peace with a fascist Russia \nhttps://t.co/gAzqhJrrfg",
  "data/tweet-economist/2022/8/1556255970740895744.json": "It has come just a few months before China’s Communist Party congress, at which Xi Jinping is expected to secure a third term as leader, violating recent norms https://t.co/Gc9BwkWgXm",
  "data/tweet-economist/2022/8/1556374782287007744.json": "In the context of Taiwan, the balance of military power between China and America has swung in China’s direction \nhttps://t.co/YouEkOUyYG",
  "data/tweet-economist/2022/8/1556718956177678336.json": "The UN’s nuclear watchdog has called the shelling at the Zaporizhzhia nuclear power plant in southern Ukraine “suicidal”. Earlier this year 1843 magazine investigated how the Russian occupation of Chernobyl jeopardised the safety of Europe https://t.co/yPPcLTK4qo",
  "data/tweet-economist/2022/8/1556907479455473664.json": "Vladimir Putin has embraced fascist methods and fascist thinking. This holds an alarming message for the rest of the world \nhttps://t.co/h0rfetXHJx",
  "data/tweet-economist/2022/8/1556967749510991875.json": "Antidepressants help some patients, but not others. A thread ⬇️ https://t.co/nKSP535pEb https://t.co/45dfjlywNf",
  "data/tweet-economist/2022/8/1556975902474510336.json": "America has the highest maternal mortality rate in the industrialised world. With the overturning of Roe v Wade, the Supreme Court ruling that abortion was a constitutional right, it is likely to rise https://t.co/x0iEaUMFQk https://t.co/LGQ7FHsRwi",
  "data/tweet-economist/2022/8/1557055044477919232.json": "The legal case against Donald Trump is looking stronger https://t.co/Q0SSSvIeNH",
  "data/tweet-economist/2022/8/1557063566355734529.json": "The study found that in the first year of vaccine rollout, jabs saved the lives of 19.1m-20.4m people https://t.co/mhQkybzpL3",
  "data/tweet-economist/2022/8/1557071740781608960.json": "Beef emits 31 times more CO₂ per calorie of food than tofu does https://t.co/c4py6uiaCz",
  "data/tweet-economist/2022/8/1557050425395892225.json": "Turkey will probably remain a headache for NATO, even when Recep Tayyip Erdogan is out of the picture https://t.co/7DXk5zoozZ",
  "data/tweet-economist/2022/8/1556902500376125441.json": "Kenya’s president, Uhuru Kenyatta, is the third consecutive leader to step down after two terms, as the constitution requires. This will strengthen Kenya's role as a cornerstone of democracy in the region https://t.co/IBUuDsAzSL",
  "data/tweet-economist/2022/8/1557250562709749760.json": "Giving Vladimir Putin an “off-ramp” will not make the world safer. It it is naive to imagine that he is ready to make peace https://t.co/6McJQo7v9a",
  "data/tweet-economist/2022/8/1557334400198758402.json": "RT @duncanrobinson: Welcome to Britain. Nothing works. https://t.co/YfDluYf22V",
  "data/tweet-economist/2022/8/1557260434268372997.json": "Germans have been living in a dream https://t.co/P76fZQlY9X",
  "data/tweet-economist/2022/8/1557612017715920896.json": "The enemy of democracy is complacency  https://t.co/McqZS42KRe",
  "data/tweet-economist/2022/8/1557693229767745536.json": "For more than 60 years motor-vehicle crashes were the leading cause of death for young people in America. But since 2017 guns have killed more people between the ages of one and 24 ⬇️ https://t.co/7geZ97iXSZ https://t.co/JoUenf1LKL",
  "data/tweet-economist/2022/8/1557715481854971904.json": "Thanks to Vladimir Putin, Germany has woken up. It must reclaim its place as a stronger, bolder, more determined leader of a more united Europe https://t.co/l14rVjBGDy https://t.co/wxrI3gf94f",
  "data/tweet-economist/2022/8/1557549822839750656.json": "Donald Trump gave militias the impression that someone sympathetic to their beliefs was finally in power. The insurrection on January 6th was a last-ditch attempt to keep him there https://t.co/vj5D8V4jiR",
  "data/tweet-economist/2022/8/1557718508586287104.json": "An uneasy peace that has held for more than six decades is fragile. We explain how to prevent a war between America and China over Taiwan: https://t.co/hXxjEGpYen https://t.co/9XfNDjohI6",
  "data/tweet-economist/2022/8/1557731758799736833.json": "Germany’s dependence on cheap Russian fuel has been exposed by the Ukraine war. It is not only vulnerable to the Kremlin’s energy blackmail, but has also been bankrolling Vladimir Putin’s invasion \nhttps://t.co/urlDdBp33h",
  "data/tweet-economist/2022/8/1557740596852183041.json": "The status quo surrounding Taiwan, which China claims and whose thriving democracy America supports, is changing in dangerous ways, say officials on both sides https://t.co/NjXho4LRNv",
  "data/tweet-economist/2022/8/1557727081991385088.json": "Thousands of Ukrainians are disappearing. This is not new: Russia has deployed such terror tactics for decades https://t.co/Mj5CJJmvnN",
  "data/tweet-economist/2022/8/1557840976873390080.json": "The argument that more gun-carrying results in less crime is dangerously flawed, new research suggests https://t.co/BkFtAgKyUW",
  "data/tweet-economist/2022/8/1557626736669507584.json": "And why foreign policy should pay more heed to half of humanity https://t.co/4d9AIZAhUM",
  "data/tweet-economist/2022/8/1557640711931142144.json": "The sun is both our creator and destroyer https://t.co/6zcYOkjWOn",
  "data/tweet-economist/2022/8/1557660475923566592.json": "The World Health Organisation hopes efforts to curb the virus will intensify now it has declared a global emergency https://t.co/lS84hQ5x94 https://t.co/oy0YUP3s7P",
  "data/tweet-economist/2022/8/1557959724611551233.json": "Vladimir Putin’s warmongering may prove to be the catalyst that turns Germany into his own nightmare: a stronger, bolder, more determined leader of a more united Europe \n\nhttps://t.co/ZQk34Jeif6",
  "data/tweet-economist/2022/8/1557816753962491905.json": "RT @COdendahl: Since 2015, #Germany’s manufacturing output has fallen, in line with Japan’s. The challenge for its industrial model are cle…",
  "data/tweet-economist/2022/8/1558012569960550402.json": "Sexual abuse in the Catholic Church is not a problem of a few bad apples; it is a rotting orchard https://t.co/ZbRiEtvcwR",
  "data/tweet-economist/2022/8/1558030240441671683.json": "This week’s cartoon from KAL: https://t.co/jChb14PkdX https://t.co/eGAYKXjpje",
  "data/tweet-economist/2022/8/1558039479230799873.json": "France is building overpasses to reduce roadkill https://t.co/qTsGP34IpQ",
  "data/tweet-economist/2022/8/1557998174916288512.json": "The world must also ensure that Vladimir Putin does not prosper from his aggression today. Otherwise he will issue more nuclear threats in the future \nhttps://t.co/fQTwphcgUq",
  "data/tweet-economist/2022/8/1557974136298815491.json": "Elephants only rarely develop cancer. That is odd. Cancer, after all, is something of a numbers game: the more cells, the more replications https://t.co/nyJWhJISpf",
  "data/tweet-economist/2022/8/1557540277728022529.json": "Our senior economics writer has picked out five books that will get you to see the world like an economist https://t.co/RsrS99X5Pb",
  "data/tweet-economist/2022/8/1557932758462259200.json": "These five books provide the perfect beginner’s guide to economics  https://t.co/ncVNllDM6Q",
  "data/tweet-economist/2022/8/1558205708977557505.json": "Thinking results in chemical changes in the brain, which presents as fatigue. A tired brain, therefore, is a signal to stop working (or doom-scrolling through Twitter) in order to restore balance to the brain https://t.co/8ZlBVQDEWI",
  "data/tweet-economist/2022/8/1558080902953156609.json": "A conspiracy-monger at last faces the consequences of warping the facts https://t.co/OgFHve8ME8",
  "data/tweet-economist/2022/8/1558251171252502530.json": "The arrest of José Rubén Zamora is another milestone in the country’s seeming return to authoritarian rule https://t.co/23vy0hTFMm",
  "data/tweet-economist/2022/8/1558378612432191489.json": "Sir Salman Rushdie was taken to hospital after he was stabbed several times while waiting to give a lecture in upstate New York. In 2017 the Booker-prizewinning novelist told “The Economist Asks” podcast about his experience of life under a fatwa https://t.co/FjrIyFsZ86 https://t.co/R0d4u2Le7i",
  "data/tweet-economist/2022/8/1558289612682006528.json": "Friendship across class lines may boost social mobility and decrease poverty https://t.co/uD2AdJWfYa",
  "data/tweet-economist/2022/8/1558314096117825536.json": "KAL’s cartoon https://t.co/bXCHD5QbMJ",
  "data/tweet-economist/2022/8/1558529391180791808.json": "Donald Trump’s narcissism is the black hole at the centre of America’s politics. It has warped the principles of the Republican Party and ripped reputations away from once-respected men and women. It is tearing at America’s governing institutions https://t.co/LnA95GpggX",
  "data/tweet-economist/2022/8/1558552677788930049.json": "The bicycle is humanity’s most underrated invention https://t.co/YQ3tKFSNWJ",
  "data/tweet-economist/2022/8/1558545695119925248.json": "Nearly 250m people are on the brink of famine https://t.co/fU0fcczG3g",
  "data/tweet-economist/2022/8/1558538394497687554.json": "Joe Biden had made a bold promise to reduce America’s emissions by roughly half of their level of 2005 by 2030. The IRA alone will not fulfil his promise, but it will help America get most of the way there https://t.co/RMGqINoPne",
  "data/tweet-economist/2022/8/1558435514088390657.json": "To lower pollution, the Dutch government wants to cut the number of cows and pigs in the country by around a third. Farmers are outraged https://t.co/L2vckkntD3",
  "data/tweet-economist/2022/8/1558607819011653632.json": "More Americans are trying to take their weapons on to planes. And a worrying number may be making it into the sky, data suggest https://t.co/J6BNL5UBW9 https://t.co/A5BPLZI9OO",
  "data/tweet-economist/2022/8/1558658134838755328.json": "Thanks to Vladimir Putin, Germany has woken up. It must reclaim its place as a stronger, bolder, more determined leader of a more united Europe https://t.co/MUdzsfbv97",
  "data/tweet-economist/2022/8/1558503029342707713.json": "President Issaias Afwerki has turned Eritrea into a prison camp. Restraining him would be a public good \nhttps://t.co/J9FjoBOqbW",
  "data/tweet-economist/2022/8/1558460380787232770.json": "Barbecuing isn’t golf, or sailing, or some other expensive hobby that keeps men away from their families. It is done with family, and at the end there’s dinner. From 1843 magazine https://t.co/3FYbZNmmS7",
  "data/tweet-economist/2022/8/1558414341162110977.json": "Taiwan is now home to a trio of eye-catching performing-arts venues designed by prestigious architects. They position Taiwan as a hub for world-class culture and creativity https://t.co/bYlRAIYzYI",
  "data/tweet-economist/2022/8/1558715876345536512.json": "Germans may well forgive their politicians for privations closely connected to the war. Recent polling shows strong majorities re­main in favour of sanctioning Russia and sending arms to Ukraine \nhttps://t.co/WnIqKDdTUj",
  "data/tweet-economist/2022/8/1558691973132869632.json": "Drought, and the war in Ukraine, are causing the first famine of the global food crisis https://t.co/jK1Jt4V1AZ",
  "data/tweet-economist/2022/8/1558294561755127808.json": "Aboriginal people had lived on the continent for some 60,000 years before the British showed up. Yet they played no part in drafting Australia’s constitution and were not accorded any rights in it. Could that be about to change? https://t.co/lG27oUC402",
  "data/tweet-economist/2022/8/1558710640147144705.json": "Aboriginal leaders have proposed a body of 24, chosen by Aboriginal people, to advise the federal government whenever legislation affecting indigenous Australians’ “social, spiritual and economic well-being” is in the works https://t.co/fq4xFNaYrZ",
  "data/tweet-economist/2022/8/1558648117951610881.json": "Read these five books to understand the heart and soul of economics \nhttps://t.co/plNbIyBPZb",
  "data/tweet-economist/2022/8/1558682253256974341.json": "Wrecked planes smoulder at Russia’s Saky airbase in Crimea https://t.co/mUAnLFXMPi",
  "data/tweet-economist/2022/8/1558779729578270720.json": "The share of youngsters who are “almost constantly” online has roughly doubled, a survey by the Pew Research Centre finds \nhttps://t.co/VR4nOQABdf",
  "data/tweet-economist/2022/8/1558877893836554243.json": "Want to live well? Head to the capital of Austria👇 https://t.co/T8XMmE7HOS\n\nPhoto: Getty Images https://t.co/7SDWp3tm4s",
  "data/tweet-economist/2022/8/1558872041335525378.json": "The arrest of a crusading journalist in Guatemala is another milestone in the country’s seeming return to authoritarian rule https://t.co/zmrSSLVUCl https://t.co/kamDfjGZGm",
  "data/tweet-economist/2022/8/1558824775966916609.json": "It was thought that our brains get tired in the same way our muscles do: from not enough glucose to create energy. But research suggests that “depleted” brains use less than one-tenth of a Tic-Tac’s worth of additional glucose https://t.co/zRRfTftG7g",
  "data/tweet-economist/2022/8/1558867902681554944.json": "“The horror stories are endless. Yet Ethiopia’s government denies them,” says @berhe_lucy. In a guest essay for The Economist, she describes her struggle to write on Tigray while living in exile  https://t.co/Y84Hu8isjZ",
  "data/tweet-economist/2022/8/1558687104233881600.json": "Friendship across class lines may boost social mobility and decrease poverty https://t.co/JHR6ZJB4Os",
  "data/tweet-economist/2022/8/1558470641480785920.json": "Perfectionism is associated with a string of mental-health disorders, from depression and burnout to stress and self-harm, according to a big literature review in 2016 https://t.co/rZVd42dTA6"
}