{
  "data/tweet-economist/2022/2/1488323986983317504.json": "When Russia attacked Ukraine in 2014, it deployed about half a dozen battalion tactical groups. Now at least 56 BTGs are on Ukraine’s border https://t.co/3giODLc2xt",
  "data/tweet-economist/2022/2/1488411924979228673.json": "Russia’s build-up today is larger than America’s in Europe ahead of the first Gulf war in 1991 or the NATO air campaign against Serbia in 1999 https://t.co/9v6db7mXv7",
  "data/tweet-economist/2022/2/1488523158722420747.json": "This is probably the largest accretion of firepower seen in Europe for 40 years https://t.co/s367PCboiv",
  "data/tweet-economist/2022/2/1488381681711128576.json": "In his new book, “Davos Man”, @petersgoodman argues that the mega-rich’s pursuit of wealth has undermined society’s capacity to deal with crises and left the world in its present troubled state https://t.co/BsdpO9tNcr",
  "data/tweet-economist/2022/2/1488446211795431424.json": "Russians have an increasingly positive attitude towards Ukraine. A war in which Ukrainians and young Russians die in their thousands would be massively unpopular https://t.co/ZRHjFNqwcU",
  "data/tweet-economist/2022/2/1488796391187091458.json": "RT @PedderSophie: For the past few months our data team has been building a model to calculate the probability of victory at the 🇫🇷 preside…",
  "data/tweet-economist/2022/2/1488811307642101760.json": "Save the rhino, save the plant https://t.co/fkuowtzv9c",
  "data/tweet-economist/2022/2/1488835527017127937.json": "Emmanuel Macron has a four-in-five chance of re-election, according to our new forecast https://t.co/w1HaqJlBWo",
  "data/tweet-economist/2022/2/1488845831335776260.json": "No French president has been re-elected for 20 years. Emmanuel Macron looks set to break that pattern https://t.co/QGIESCU22e",
  "data/tweet-economist/2022/2/1489083656056545280.json": "As a matter of principle, Joe Rogan should be able to speak—even if he is wrong https://t.co/DWdAcuk6JB",
  "data/tweet-economist/2022/2/1489162825058693123.json": "Sensible policy on psychedelic drugs is growing more common https://t.co/k341E15Yjr",
  "data/tweet-economist/2022/2/1489191707463856139.json": "Turkey's annual inflation rate rose to 48.7% in January, from 36.1% in December. But its president refuses to raise interest rates. What is he thinking?\nhttps://t.co/fOUWXv0Crt",
  "data/tweet-economist/2022/2/1489204287435644929.json": "We invented this tool in 1986 as a lighthearted guide to whether currencies are at their “correct” level. Here is the latest update https://t.co/ywFDwvQgRL",
  "data/tweet-economist/2022/2/1489235444139278346.json": "How high will interest rates go? They may have to rise sharply to fight inflation, but our cover story explains why the low-rate era is unlikely to end permanently https://t.co/7XJLekP3XO https://t.co/9YyxIBCcGR",
  "data/tweet-economist/2022/2/1489277018575450127.json": "Tucker Carlson of Trump-loving Fox News has been pushing an “America First” cocktail of disdainful isolationism, paranoid anti-elitism and Vladimir Putin fandom. Most Americans disagree with him https://t.co/br8DSjTVW2",
  "data/tweet-economist/2022/2/1489183684402028547.json": "Psychedelic therapy shows great promise. More states should legalise it https://t.co/PEOfxapUWg",
  "data/tweet-economist/2022/2/1489377374114390020.json": "What did Apple actually do, and why was it so costly? https://t.co/l7XfxyRE7J",
  "data/tweet-economist/2022/2/1489446016722034689.json": "Last year, citing privacy concerns, Apple forced apps to ask users if they want to be tracked. It seems most do not https://t.co/Mhw4I4qb1Z",
  "data/tweet-economist/2022/2/1489311746175254530.json": "This week’s cartoon from KAL: https://t.co/M2THiLChkq https://t.co/Zz1pmkSa65",
  "data/tweet-economist/2022/2/1489333297389973505.json": "Only two French presidents have won re-election since Charles de Gaulle. Our forecast gives Emmanuel Macron a high chance of becoming the third https://t.co/QqCjdqj5e1",
  "data/tweet-economist/2022/2/1489522422068002819.json": "Emmanuel Macron is highly likely to be re-elected as France’s president https://t.co/DRrdltDFEi",
  "data/tweet-economist/2022/2/1489630591704309762.json": "Companies based in rich countries often facilitate corruption abroad https://t.co/POx3rdNCHg",
  "data/tweet-economist/2022/2/1489752146631344129.json": "London has long been a playground for oligarchs. An anti-corruption group has identified £1.5bn ($2bn) of Russian money in property, most of it controlled by shell companies https://t.co/Zti5rIgbKM",
  "data/tweet-economist/2022/2/1489785611812757504.json": "Leaky oil-and-gas infrastructure is responsible for 22% of all man-made methane emissions. Patching up these leaks is a cheap way to slow the pace of global warming in the near term https://t.co/Z0pKNcQZPl",
  "data/tweet-economist/2022/2/1489783094014099456.json": "The financial impact on ad-sellers like Meta has been painful https://t.co/EQxWr7jfxh",
  "data/tweet-economist/2022/2/1489830706217992198.json": "NGOs are “like vultures”, complains a journalist and activist: they live off disasters, but do little to improve things. It is a common view https://t.co/7sJeVAd3Z1",
  "data/tweet-economist/2022/2/1489859758559485959.json": "A hospital in Congo has treated 103 raped children aged five or younger in the past three years. That is about one child every ten days https://t.co/P4Pu6O5Uyi",
  "data/tweet-economist/2022/2/1489877573521887233.json": "According to our French election model, Emmanuel Macron stands a good chance of winning a second term in April https://t.co/iWHHoeWOae https://t.co/Vw4LmvDXNz",
  "data/tweet-economist/2022/2/1489902386617462794.json": "In his new book, “Davos Man”, Peter Goodman says the World Economic Forum functions like billionaire therapy: a place where the very rich go to reassure themselves that they are the solution to social ills rather than the problem https://t.co/GrLAprLCL7",
  "data/tweet-economist/2022/2/1489928598706429961.json": "To understand the Roman empire, read Pliny the Younger https://t.co/23nEON2hZv",
  "data/tweet-economist/2022/2/1489864976261173250.json": "Despite the reproaches hurled his way by French voters, Emmanuel Macron is looking well-placed to keep his job https://t.co/nULuP64unW https://t.co/xO2UrhBLVO",
  "data/tweet-economist/2022/2/1489992217703981059.json": "“Magic mushrooms” will soon be used in Oregon to treat certain mental-health disorders.\n\n👉 Swipe to learn how psychedelic therapy shows tremendous promise, then read why other states should follow Oregon’s lead👇",
  "data/tweet-economist/2022/2/1489973097398734852.json": "As long as bitcoin and its ilk are decentralised, the ability of far-right groups to use them will remain https://t.co/1Df0tvSpR5",
  "data/tweet-economist/2022/2/1490035019393515520.json": "Between third and sixth grade, the children who attended preschool did worse on standardised tests, had lower school attendance, racked up more disciplinary infractions and needed more special-education services https://t.co/dGADRbLugL",
  "data/tweet-economist/2022/2/1489894752887705603.json": "Only two French presidents have won re-election since Charles de Gaulle. Our forecast gives Emmanuel Macron a high chance of becoming the third https://t.co/NxWXBahtVc",
  "data/tweet-economist/2022/2/1490178522664652800.json": "What Spotify data show about the decline of English https://t.co/4VkHftMMwH https://t.co/gT94DYkgHi",
  "data/tweet-economist/2022/2/1490264764886528004.json": "In his new book, “Davos Man”, Peter Goodman says the World Economic Forum functions like billionaire therapy: a place where the very rich go to reassure themselves that they are the solution to social ills rather than the problem https://t.co/WgXUqsU8g2",
  "data/tweet-economist/2022/2/1490014887984123912.json": "Emmanuel Macron remains a divisive figure in France. But his management of the economy and the pandemic should prove in his favour https://t.co/21EXn2QGeT https://t.co/S7Z0cydZtq",
  "data/tweet-economist/2022/2/1490295222013775878.json": "Employers offering low wages or poor conditions are struggling to fill positions: unfilled vacancies, at 30m across the rich world, have never been so high https://t.co/JEpTtZgOnK",
  "data/tweet-economist/2022/2/1490060420241149958.json": "Emmanuel Macron has a four-in-five chance of re-election, according to our new forecast https://t.co/oC4Z5Glqss",
  "data/tweet-economist/2022/2/1490398148514230279.json": "A number of papers have found that the economic benefits of child-care or pre-K programmes vastly outweigh the costs https://t.co/Z0XRqLY0TQ",
  "data/tweet-economist/2022/2/1490427856060567559.json": "The British pound is 17% undervalued against the US dollar, according to our latest calculations https://t.co/r0qsPerDEv",
  "data/tweet-economist/2022/2/1490223492914163715.json": "These findings support arguments made by advocates of “open science”, who say that new scientific results should be made available to other researchers and the public freely and quickly https://t.co/7DOnIaL9ML",
  "data/tweet-economist/2022/2/1490404524250517506.json": "Together, Russia and Ukraine account for 30% of global wheat exports https://t.co/IhjNLafkGu",
  "data/tweet-economist/2022/2/1490627171479658499.json": "Companies based in rich countries often facilitate corruption abroad https://t.co/Ff2AUgdJKg",
  "data/tweet-economist/2022/2/1490302015825752066.json": "Emmanuel Macron has a four-in-five chance of re-election, according to our new forecast https://t.co/mOdTxQ5GXu",
  "data/tweet-economist/2022/2/1490510302357635073.json": "The global gap between life expectancy and healthy life expectancy, a measure of how long a person lives without chronic health problems, is nearly ten years https://t.co/rC5a837PPj",
  "data/tweet-economist/2022/2/1490981976458895361.json": "Poor countries tend to do worse than rich ones, partly because poverty makes corruption worse and partly because corruption makes poverty worse https://t.co/xoOjj004os",
  "data/tweet-economist/2022/2/1490862525654900736.json": "During the worst fighting of the Russia-Ukraine war, in 2015, Russia sent no more than a dozen battalion tactical groups. By February 4th it had 83 in place near the border, with 14 more in transit https://t.co/rNUsVPlfpU",
  "data/tweet-economist/2022/2/1490953182708645888.json": "The data show that the hegemony of English is in decline https://t.co/efM4gN2OV5 https://t.co/3eMMOJAeuT",
  "data/tweet-economist/2022/2/1491053257418022917.json": "Save the rhino, save the plant https://t.co/C0FyngF510",
  "data/tweet-economist/2022/2/1490991423105212419.json": "America is uniting against Vladimir Putin https://t.co/u5DW0JD2kE",
  "data/tweet-economist/2022/2/1490470634794725376.json": "The data-rich environment of the metaverse could be an authoritarian’s dream https://t.co/UuMFxVKXQM",
  "data/tweet-economist/2022/2/1491156559388360704.json": "Where possible, they should be removed or redesigned https://t.co/xk4YhUTr8G",
  "data/tweet-economist/2022/2/1491240544449843200.json": "Living longer is of little use if the extra years are spent in bed https://t.co/HB3LU6fz8J",
  "data/tweet-economist/2022/2/1491312334756790280.json": "Rhinos were the only recorded dispersers of 35% of the large-fruited species found in the regions where data were available https://t.co/Z6SANM7tCW",
  "data/tweet-economist/2022/2/1491384663117639685.json": "The device worked well enough that all three users in the trial were able to stand up and take a few steps almost immediately after they had recovered from the surgery to have it implanted https://t.co/mMsmVb7YIv",
  "data/tweet-economist/2022/2/1491378104434110470.json": "A new study finds preschool can be detrimental to children https://t.co/iRcA7vV8My",
  "data/tweet-economist/2022/2/1490904038266884097.json": "A number of papers have found that the economic benefits of child-care or pre-K programmes vastly outweigh the costs https://t.co/En2cIfs00q",
  "data/tweet-economist/2022/2/1491562823205404679.json": "More than a third of the world’s population live under authoritarian rule while just 6.4% live in a full democracy, according to @TheEIU’s Democracy Index https://t.co/oeML3zYeek",
  "data/tweet-economist/2022/2/1491588995360432128.json": "Researchers have released 59 megajoules of energy—enough to run a 60-watt light bulb for 11 days—from nuclear fusion, the reaction that powers the sun. That is a new record https://t.co/88XBwh8wsl",
  "data/tweet-economist/2022/2/1491661270231273474.json": "For the second year in a row, the pandemic was the biggest source of strain on democratic freedom around the world https://t.co/pt9aBtFuUR",
  "data/tweet-economist/2022/2/1491738382493523972.json": "Which region recorded the steepest decline in democracy in 2021? https://t.co/59e0xsUosb",
  "data/tweet-economist/2022/2/1491750989996646401.json": "The financial system is in better shape than it was in 2008. But make no mistake: it faces a stern test. Our cover this week https://t.co/erceNK3uVm https://t.co/rd9fFXgrxL",
  "data/tweet-economist/2022/2/1491845201446543365.json": "This week’s cartoon from KAL: https://t.co/ZBv25ez7OA https://t.co/MRtlddBJp0",
  "data/tweet-economist/2022/2/1491971267502743552.json": "“Can humans change the way they behave, or does history repeat itself endlessly, with humans forever condemned to reenact past tragedies without changing anything except the décor?” asks the historian @harari_yuval  https://t.co/NpIXk1aMbs",
  "data/tweet-economist/2022/2/1492005419073613854.json": "The biggest challenge to the Western model of democracy over the coming years will come from China https://t.co/xW2pn3i895",
  "data/tweet-economist/2022/2/1491987673548038144.json": "It has always been assumed that noise is a problem unique to animals. But plants suffer too https://t.co/IoXwSIXEDY",
  "data/tweet-economist/2022/2/1492130759603331081.json": "What is the secret to a living a longer, healthier life? The world’s oldest country is searching for the answer 👇 https://t.co/eZBQzUpd13 https://t.co/adymUqJaFr",
  "data/tweet-economist/2022/2/1492101095551864838.json": "“I love Ukraine but I will not die for it.” Liza, a 26-year-old Ukrainian, on why she is preparing to leave https://t.co/eRgxJqZW0t",
  "data/tweet-economist/2022/2/1492237024052629510.json": "How did “Finlandisation”—a reference to Finland’s officially neutral status during the cold war—work in practice, and how might a similar status be applied to Ukraine? https://t.co/orECu8BQSk",
  "data/tweet-economist/2022/2/1492297176998887425.json": "In practice, the price of Finnish independence was that the Soviet Union would exert significant influence on the country’s politics https://t.co/TIpl99T8vC",
  "data/tweet-economist/2022/2/1492362865159942144.json": "A record 43% of India’s MPs who won seats in the 2019 general election had been charged with a crime, with 29% booked for grave offences such as rape and murder https://t.co/4D9U1t4Org",
  "data/tweet-economist/2022/2/1492388531125293058.json": "A fundamental question about the nature of history and of humanity lies “at the heart of the Ukraine crisis”, writes Yuval Noah Harari, the historian and author of “Sapiens”, in a commentary for The Economist. “Is change possible?”  https://t.co/qt7tKHGVY7",
  "data/tweet-economist/2022/2/1492377932098154497.json": "Omicron is unlikely to be the last variant of concern. Researchers have tried to map where the next one is most likely to emerge. \n\nRead our analysis of the study 👇",
  "data/tweet-economist/2022/2/1492402848751050754.json": "For Ukrainians nervously pondering their fate, “Finlandisation” does not seem appealing https://t.co/aX6BQatsGr",
  "data/tweet-economist/2022/2/1492312268087992323.json": "“If it again becomes normative for powerful countries to wolf down their weaker neighbours, it would affect the way people all over the world feel and behave,” says @harari_yuval. He explains what’s at stake in Ukraine with the threat of a Russian invasion https://t.co/eEoJ5AtAMO",
  "data/tweet-economist/2022/2/1492419719919542272.json": "Patients in the trial were not only able to stand and walk, but eventually also to swim and cycle https://t.co/NXGQZXzMTD",
  "data/tweet-economist/2022/2/1492398323747205122.json": "Allegations that Pegasus was used to spy on Israeli activists, politicians and businessmen have shifted public opinion about the software https://t.co/an7iCPoAqM",
  "data/tweet-economist/2022/2/1492453945264029697.json": "“I love Ukraine but I will not die for it.” Liza, a 26-year-old Ukrainian, on why she is preparing to leave https://t.co/aAyIjHJyaX",
  "data/tweet-economist/2022/2/1492434058239959040.json": "This week’s cartoon from KAL: https://t.co/LAtkMReYRG https://t.co/Mm8jD1l7YQ",
  "data/tweet-economist/2022/2/1492147930446368769.json": "The device worked well enough that all three users in the trial were able to stand up and take a few steps almost immediately after they had recovered from the surgery to have it implanted https://t.co/GQTR7Wm8PR",
  "data/tweet-economist/2022/2/1492417966964674568.json": "Ukraine has bought dozens of Turkey’s TB2 drone in recent years. Unfortunately for Ukraine, they are no match for Russia’s army https://t.co/GiAqplgp8d",
  "data/tweet-economist/2022/2/1492508564031774724.json": "“Finlandisation” might allow Ukraine to avoid an invasion—but the country would be firmly in Moscow’s grip https://t.co/ossfr7yLIm",
  "data/tweet-economist/2022/2/1492447150013304832.json": "Ukraine has forced America and its allies to bond. But the country’s future is still uncertain  https://t.co/HdT3fOyY58",
  "data/tweet-economist/2022/2/1492567435366604801.json": "Global democracy scores have never been this low, according to @TheEIU https://t.co/8BHjhJAWa5",
  "data/tweet-economist/2022/2/1492570727236710401.json": "The impact of the device on the lives of those in the small Swiss trial has already been dramatic https://t.co/32GPrObnJU",
  "data/tweet-economist/2022/2/1492578521927065600.json": "China and Russia are calling on @NATO to stop admitting new members—but this is “a blatant attempt to deny sovereign nations the right to make their own choices”, argues the organisation’s chief  https://t.co/6RMNkygXJV",
  "data/tweet-economist/2022/2/1492599423049814016.json": "Ethiopia has used Turkish drones against rebels in Tigray. Evidence suggests that one such air strike killed at least 58 civilians in January https://t.co/8AJKp0wyQ6",
  "data/tweet-economist/2022/2/1492375181943349256.json": "Despite its strengths, the Biden administration is turning out to be error-prone in an unerringly consistent fashion https://t.co/28sjF1cMpv",
  "data/tweet-economist/2022/2/1492647481368354818.json": "Russia is engaged in the largest military build-up in Europe since the cold war. Our interactive guide uses satellite images to show where its troops have massed https://t.co/0hy9k38wPB",
  "data/tweet-economist/2022/2/1492587334100996099.json": "Prosciutto, gorgonzola and tiramisu earn a red mark. Even olive oil should be consumed in moderation, suggests the EU’s Nutri-Score https://t.co/O5Cl8P2U4N",
  "data/tweet-economist/2022/2/1492705102834114561.json": "A treaty signed with the Soviet Union in 1948 became the basis for “Finlandisation” https://t.co/ce57Y3HCRT",
  "data/tweet-economist/2022/2/1492652530333061123.json": "Today “Columbo” oﬀers a welcome dose of familiarity to veteran viewers and reassur­ance all round, like the comedies of P.G. Wodehouse or the mysteries of Agatha Christie https://t.co/u21GD9lb7d",
  "data/tweet-economist/2022/2/1492589849714565121.json": "Emmanuel Macron may have an approval rating of below 40% but our French election model predicts that he stands the highest chance of winning https://t.co/WFYOpq73TD",
  "data/tweet-economist/2022/2/1492750646105284609.json": "Turkish drones have knocked out Russian-made tanks in Nagorno-Karabakh, Syria and Libya. They may do so again in Ukraine https://t.co/Eem5KPxcts",
  "data/tweet-economist/2022/2/1492763401059196928.json": "Around 100 Russian battalion tactical groups—troops, air defence, artillery and logistics—have gathered on Ukraine’s borders with Russia and Belarus. Satellite images have tracked their movement https://t.co/qFPEMtpgFk",
  "data/tweet-economist/2022/2/1492564180519591938.json": "“In the past few generations, for the first time in history the world became dominated by elites who see war as both evil and avoidable,” writes @harari_yuval. The historian argues that the decline of war “resulted from humans making better choices”  https://t.co/cohBTn2oXE",
  "data/tweet-economist/2022/2/1492807535086157829.json": "Emmanuel Macron remains a divisive figure in France. But his management of the economy and the pandemic should prove in his favour https://t.co/Gc2GhlPBl6 https://t.co/LeCjJbT98l",
  "data/tweet-economist/2022/2/1492697906691948546.json": "Last year South Korea’s arms exports exceeded imports for the first time https://t.co/frFeyRm8G6",
  "data/tweet-economist/2022/2/1492834716340400128.json": "Vladimir Putin's interpretation of the Minsk agreement from 2015 is a Trojan horse that would bring chaos to Ukraine https://t.co/KCmAMPdxMb",
  "data/tweet-economist/2022/2/1492841760569139207.json": "No French president has been re-elected for 20 years. Emmanuel Macron looks to be in prime position to break that pattern https://t.co/6gcF5fHdXp",
  "data/tweet-economist/2022/2/1492782361267871745.json": "The new device will need approval from medical regulators before it can be used in clinics https://t.co/xuafOfbsQz",
  "data/tweet-economist/2022/2/1492856858847195136.json": "This week’s cartoon from KAL: https://t.co/XwVqGeGyQp https://t.co/WgZEDqmM7n",
  "data/tweet-economist/2022/2/1492869191455674371.json": "Investors should question the idea that the best way to make polluters pollute less is to dump their shares. Instead, they should hold on to them and work with managers to reduce emissions https://t.co/L5YpXGIaSv",
  "data/tweet-economist/2022/2/1492702845308743687.json": "More reporters are missing—presumed kidnapped—in Mexico than anywhere else in the world. Even so, the events of recent weeks have shocked many  https://t.co/vmY4hICdej",
  "data/tweet-economist/2022/2/1492636149285806083.json": "The Brazilian modernist tradition proved extraordinarily fertile  https://t.co/JpFxeK5PfP",
  "data/tweet-economist/2022/2/1492916500709191681.json": "A poll found that more than a third of Africans either think the African Union is useless or have no opinion of it at all https://t.co/LBF6uqoufk",
  "data/tweet-economist/2022/2/1492919257969184771.json": "These satellite images show exactly how Ukraine is now ringed by Russian forces to its north, east and south https://t.co/gJ4JoXw5Ou",
  "data/tweet-economist/2022/2/1492996010863431697.json": "Last month South Korea's president agreed to a $3.5bn contract to sell a home-grown missile system to the UAE. It is the biggest deal in the history of the country’s defence industry https://t.co/La9WK0ZdNR",
  "data/tweet-economist/2022/2/1493037035627630592.json": "A majority of Democrats (67%) and Republicans (50%) want the Supreme Court to smack down partisan gerrymanders https://t.co/FT6pzta1ry",
  "data/tweet-economist/2022/2/1493056678660612100.json": "More reporters are missing—presumed kidnapped—in Mexico than anywhere else in the world. Even so, the events of recent weeks have shocked many  https://t.co/NUQcWNhzEV",
  "data/tweet-economist/2022/2/1493269850655014914.json": "Will Vladimir Putin launch his war in Ukraine? We explain why Russia’s military build-up has entered a more dangerous phase ⬇️ https://t.co/81wNh0Ac51\n\n📷: @Maxar https://t.co/Z475CqOVKz",
  "data/tweet-economist/2022/2/1493048468142792704.json": "The device worked well enough that all three users in the trial were able to stand up and take a few steps almost immediately after they had recovered from the surgery to have it implanted https://t.co/xxTtLVuKuT",
  "data/tweet-economist/2022/2/1493359682655866880.json": "Many pro-Russians decided that they neither wanted to die for Russia nor see their city racked by conflict. The vast majority of younger Odessans are proud to be Ukrainian https://t.co/9L9kjWNXQf",
  "data/tweet-economist/2022/2/1493333508378574849.json": "A growing number of people are organising their love and sex lives via spreadsheets. Is this really how to excel in relationships? https://t.co/REbZWiO21p",
  "data/tweet-economist/2022/2/1493145826037805056.json": "Whether the end is war or detente, today's suspense can surely not be sustained for long https://t.co/NwHQnIc9eu",
  "data/tweet-economist/2022/2/1493481977604984836.json": "Women are disproportionately likely to publish in fields related to health and psychology; they remain less likely to publish in maths, physics and engineering https://t.co/SymTzjmqYy",
  "data/tweet-economist/2022/2/1493412271892144133.json": "White power, dark money https://t.co/zXUJKDA2lk",
  "data/tweet-economist/2022/2/1493558488689164290.json": "Journalists are flocking to Ukraine to arrive in time for a war that the Americans are now suggesting could begin as soon as February 16th https://t.co/GmB5bXA6eP"
}