{
  "data/tweet-wsj/2022/5/1520621562633801728.json": "The first cargo of Ukrainian corn to be exported via the Black Sea since Russia’s invasion set sail from a Romanian port Friday, dodging a Russian naval blockade that has all but halted Ukraine’s grain exports. https://t.co/1lA5ujfMEZ",
  "data/tweet-wsj/2022/5/1520666866749947904.json": "Vladimir Putin believes that Ukraine has no historical identity independent of Russia. Many Russian liberals and dissidents have traditionally agreed, writes @yarotrof. https://t.co/CHcPkhIQHx",
  "data/tweet-wsj/2022/5/1520731021313986560.json": "House Speaker Nancy Pelosi and a delegation of U.S. lawmakers met with Ukrainian President Volodymyr Zelensky in Kyiv on Saturday night, as Russia’s military advance stalled in Ukraine’s east https://t.co/uY8iz6r11d",
  "data/tweet-wsj/2022/5/1520644231685189633.json": "\"Are there any Nazis in the house?\" the Russian soldiers asked. The next day, they took away her son. https://t.co/So5X7eRA6O",
  "data/tweet-wsj/2022/5/1520580024964894720.json": "Performance reviews miss the gritty, granular, unique raw material of real performance. https://t.co/bYqH0HiFE3",
  "data/tweet-wsj/2022/5/1520792686185308161.json": "Vladimir Putin signed a law Sunday suspending certain visa preferences for nationals of most European countries, further alienating Moscow from the West https://t.co/U9c31yAIoV",
  "data/tweet-wsj/2022/5/1520800194182500353.json": "“Our delegation traveled to Kyiv to send an unmistakable and resounding message to the entire world: America stands firmly with Ukraine,” House Speaker Nancy Pelosi and other members of Congress said after meeting with President Volodymyr Zelensky. https://t.co/Vmjs0OojMp",
  "data/tweet-wsj/2022/5/1520659321947885570.json": "Without these traders, Russia will struggle to find buyers for its oil, the foundation of the country’s economic wealth. https://t.co/vocNKPo118",
  "data/tweet-wsj/2022/5/1520806516571389956.json": "When Florida Republicans approved a bill to strip Disney of its special tax privileges in, they failed to address a key question: Who's responsible for paying back nearly $1 billion in municipal debt used for infrastructure around Disney World?  \nhttps://t.co/AxKbfp44QY",
  "data/tweet-wsj/2022/5/1520852543345152001.json": "President Volodymyr Zelensky said Sunday that 100 people were evacuating the besieged Azovstal steel plant in Mariupol under the supervision of the United Nations, and would be taken to the southeastern city of Zaporizhzhya https://t.co/1aHfIIUyn4",
  "data/tweet-wsj/2022/5/1520844273553481728.json": "Vladimir Putin believes that Ukraine has no historical identity independent of Russia. Many Russian liberals and dissidents have traditionally agreed, writes @yarotrof. https://t.co/nMlFB66t3S",
  "data/tweet-wsj/2022/5/1520798991537090561.json": "A recent survey of U.S. consumers found more than 70% said they have switched to cheaper food and household staples, and nearly 40% said they were delaying purchases of big-ticket items https://t.co/iZp82falt0",
  "data/tweet-wsj/2022/5/1520912217155252225.json": "This CEO has let his employees work whenever they want—from wherever they want—for years. Here’s how he makes that work.  https://t.co/sq0yEy7uuV",
  "data/tweet-wsj/2022/5/1520953767780392960.json": "Elon Musk broke nearly every rule in the deal-making playbook. How he landed Twitter anyway. https://t.co/SkCn0MuDQr",
  "data/tweet-wsj/2022/5/1520870754249842691.json": "The U.S. holds one sanctions card close to the vest: Vladimir Putin's alleged girlfriend and the mother of at least three of his children, the government says. https://t.co/a1CT3PlYir",
  "data/tweet-wsj/2022/5/1520727267630108672.json": "From @WSJopinion: Unless the U.S. Supreme Court rules in my favor, teachers could be fired for praying over their lunch in the cafeteria if students can see them, writes Joe Kennedy https://t.co/AY9h2zpiW6",
  "data/tweet-wsj/2022/5/1521063957460660224.json": "Ukraine says it sank two Russian boats in the Black Sea with drone strikes, as explosions rang out once again in Russia’s border region of Belgorod https://t.co/0VwK6WyAYh",
  "data/tweet-wsj/2022/5/1521108520820690945.json": "Potential grand jurors in Georgia's Fulton County have been ordered to arrive at a courthouse Monday as part of a county prosecutor’s probe into alleged efforts by former President Donald Trump and others to overturn the state’s 2020 election results https://t.co/MYOL7doSxZ",
  "data/tweet-wsj/2022/5/1521134979002126337.json": "Could Russia’s Vladimir Putin be prosecuted for the crime of aggression? Some legal scholars are calling for a special tribunal like the one at Nuremberg that tried Nazi officials after World War II https://t.co/PZGuNUmJWY",
  "data/tweet-wsj/2022/5/1521119886759575554.json": "Israeli Foreign Minister Yair Lapid called Russian Foreign Minister Sergei Lavrov’s comments that Jews are the biggest anti-Semites ‘unforgivable’ https://t.co/JkqOeoXGXk",
  "data/tweet-wsj/2022/5/1521036830723952640.json": "How two Americans ended up bouncing around Ukraine’s front lines, figuring out how to fire Javelin missiles. https://t.co/knQOVFEsbb",
  "data/tweet-wsj/2022/5/1521097490140999683.json": "Millions of Grindr users had their location data collected from the gay-dating app and sold for years, people familiar with the matter said https://t.co/veK1PHlj4U",
  "data/tweet-wsj/2022/5/1521204129955254279.json": "TikTok brain is real, researchers say, and it’s affecting kids’ brain development. \"We’ve made kids live in a candy store.\" https://t.co/MVzYE4iqxq",
  "data/tweet-wsj/2022/5/1521181809438072832.json": "A special grand jury was selected Monday to hear evidence in a county prosecutor’s probe into efforts by former President Donald Trump and others to overturn Georgia’s 2020 election results https://t.co/e3LQOhI9Vw",
  "data/tweet-wsj/2022/5/1520972632325242887.json": "Kevin Hart is expanding his entertainment empire, backed by a $100 million investment from private-equity firm Abry Partners https://t.co/iEGMeEG6g6",
  "data/tweet-wsj/2022/5/1521294918806814721.json": "Ukraine says it sank two Russian boats in the Black Sea with drone strikes, as explosions rang out once again in Russia’s border region of Belgorod https://t.co/CfNE4d8Bky",
  "data/tweet-wsj/2022/5/1521282182224007170.json": "From @WSJopinion: For all the talk of Putin’s mistakes, he was right in guessing that NATO won’t fight for Ukraine, writes Yulia Latynina. And this is perhaps the biggest reason why he must be crushed. https://t.co/MVQC8rLdqH",
  "data/tweet-wsj/2022/5/1521358851051823111.json": "A leaked Supreme Court draft opinion published by Politico indicates justices may overturn Roe v. Wade, which established a constitutional right to an abortion https://t.co/GkrVkCkv8M",
  "data/tweet-wsj/2022/5/1521384119627915264.json": "Could Russia’s Vladimir Putin be prosecuted for the crime of aggression? Some legal scholars are calling for a special tribunal like the one at Nuremberg that tried Nazi officials after World War II. https://t.co/htiTWNhaat",
  "data/tweet-wsj/2022/5/1521482224880730115.json": "Russia doubled down Tuesday on its ever-wilder claims about Jews, neo-Nazis and Ukraine, accusing Israeli Foreign Minister Yair Lapid of making “anti-historical statements” when he said Jews didn’t murder themselves in the Holocaust https://t.co/POabpo1c6f"
}