{
  "data/tweet-stocks/2022/1/1479066687508992009.json": "Breaking News: Novak Djokovic was refused entry to Australia and asked to leave the country after a 12-hour airport standoff over the validity of his visa and questions about his vaccine medical exemption for the Australian Open. https://t.co/B2wgwmj8OB",
  "data/tweet-stocks/2022/1/1480081747983360002.json": "Mayor Eric Adams says allowing non-citizens to vote for NYC elections is 'best choice' https://t.co/BM2NfjH4rw https://t.co/dhN9BVTz28",
  "data/tweet-stocks/2022/1/1480283358030708742.json": "CDC Director Sheepishly Admits Justice Sotomayor Issued COVID Misinformation On Hospitalized Kids https://t.co/luR9CGjeHx",
  "data/tweet-stocks/2022/1/1480298561539653637.json": "This point has not yet been appreciated by many. A prerequisite for vaccine mandates is gone. Vax confers personal health benefit to avoid severe disease. But the value of societal transmission is rapidly evaporating. Thus, all mandates are unjustifiable. https://t.co/JUoOoDvaeO",
  "data/tweet-stocks/2022/1/1480341248464625665.json": "REST IN PEACE BOB SAGET 🙏 https://t.co/cv4JSCN5ZR",
  "data/tweet-stocks/2022/1/1480875783610675201.json": "\"Mass Vaccination Should End\" - Former UK Task-Force Chair Says We Should \"Treat COVID Like The Flu\" https://t.co/bCW3pW1DvL",
  "data/tweet-stocks/2022/1/1482101571387281408.json": "Video taken at a trainyard in Chicago. \"Let me know if this video plays\" - Ron https://t.co/uyZ64uNTxV",
  "data/tweet-stocks/2022/1/1482483164241174534.json": "I once had a retired Swedish general tell me that (even though Sweden is not in NATO), every time they wargamed a major conflict, whoever was playing the Russian side seized Gotland as a first move, thus cutting the Baltics off from the rest of the alliance https://t.co/HlXGt2Xc0u",
  "data/tweet-stocks/2022/1/1482454153221840901.json": "While it has become conventional wisdom that the @federalreserve will raise rates 3 to 4 times this year to mitigate inflation, the market expects 25 bp increments. The unresolved elephant in the room is the loss of the Fed’s perceived credibility as an inflation fighter and",
  "data/tweet-stocks/2022/1/1483178953980395521.json": "A second RAF C-17 is heading towards Ukraine this evening, both deliberately avoided German airspace. I wonder if Germany is refusing flights with weapons for Ukraine access to their airspace. https://t.co/7Y1rBqjmO4",
  "data/tweet-stocks/2022/1/1483321339490574337.json": "A page on Telegram run by Belarusian Railway Workers claims that Russian Military Forces have begun to transfer military equipment into Belarus via four crossings: Osinovka, Zakopytya, Shesterovka, and Ezerishche. \n\nNo 'reverse movement' dates scheduled, as of now. https://t.co/zLxjRqajlJ",
  "data/tweet-stocks/2022/1/1483700379279925264.json": "Every problem the US faces today was predictable.\nPrint money, get inflation.\nShut down economy, destroy supply chains.\nStop policing, crime goes up.\nHand money out for not working, get shortages.\nUse appeasement as foreign policy, get geopolitical tensions.\n#juststopit",
  "data/tweet-stocks/2022/1/1484659349339394051.json": "*EL SALVADOR BOUGHT 410 BITCOIN FOR $15M, BUKELE SAYS",
  "data/tweet-stocks/2022/1/1485646809959645190.json": "Russia deploys elements of 10 army groups and an army corps near Ukraine. Of those, only 3 are permanently stationed to cover Russia's south-western borders. The increase is therefore substantial in terms of size and capabilities, but also broad in terms of the territory covered. https://t.co/N4JMHoQpTy",
  "data/tweet-stocks/2022/1/1485644331159539718.json": "JUST IN - Putin discussed \"strategic partnership\" with #Cuba in a phone call with President Díaz-Canel (RIA)",
  "data/tweet-stocks/2022/1/1485657241600548875.json": "https://t.co/z30YKur2Yw",
  "data/tweet-stocks/2022/1/1485834696328163328.json": "As a result of the @US_FDA's abrupt decision to remove the EUAs for two monoclonal antibodies, monoclonal antibody treatment sites will be closed until further notice. Full press release is below. https://t.co/RGeWTPwxCs",
  "data/tweet-stocks/2022/1/1486407600321306629.json": "A western Intelligence official tells me, his analysis is that Putin’s goal is to topple President Zelensky and make Ukraine a dependent state like Belarus and that if a limited military/covert operation could achieve that, for Putin, all the better, otherwise a wider operation.",
  "data/tweet-stocks/2022/1/1486558542224101380.json": "We are risking nuclear conflict so that 400 people in northern Virginia can remodel their bathrooms",
  "data/tweet-stocks/2022/1/1486549040229761025.json": "BREAKING: Denmark's prime minister says COVID-19 no longer \"socially critical,\" all restrictions to be lifted on Tuesday",
  "data/tweet-stocks/2022/1/1486705325176762368.json": "Man steals huge 70-inch TV from Seattle store, released without bail by lenient judge https://t.co/yXODflKLum https://t.co/hHzE19hhmu",
  "data/tweet-stocks/2022/1/1486829866561462285.json": "A Russian invasion is now virtually certain once the ground freezes, Biden said to Zelensky, a senior Ukrainian official told @mchancecnn. Kyiv could be “sacked,\" Russian forces may attempt to occupy it, “prepare for impact”, Biden said, according to this official.",
  "data/tweet-stocks/2022/1/1486831566491955207.json": "BREAKING: Ukrainian president had to correct Biden multiple times on their call today when he insisted Kyiv was about to be ‘sacked’ by Russian forces. At one point he even asked Biden to calm down.",
  "data/tweet-stocks/2022/1/1486861093058363398.json": "And in the darkness bind them https://t.co/BvxR4HTTq1",
  "data/tweet-stocks/2022/1/1486879333578911746.json": "CNN In Meltdown Mode Over Biden-Ukraine Phone Call Fiasco https://t.co/rtWoYESd52",
  "data/tweet-stocks/2022/1/1486995059505520643.json": "Lukashenka speaking before National Assembly of Belarus: if Belarus attacked, or Russia attacked, there will be a war https://t.co/MxYDj27Jnu"
}