{
  "data/tweet-nytimes/2022/5/1520710885911711745.json": "Delta Air Lines diverted a shipment of five million honeybees bound for Alaska to Atlanta and left the bee shipment out on a hot tarmac. Local beekeepers tried to come to the rescue, but very few survived. “This is just such a waste, an absolute tragedy.” https://t.co/Zc3dRi3XkB",
  "data/tweet-nytimes/2022/5/1520658041523351554.json": "Tucker Carlson, the host of the most-watched show on prime-time cable news, uses a simple narrative to instill fear in his viewers. To understand how he promotes extremist ideas and conspiracy theories, we analyzed 1,150 episodes. Here’s what we found. https://t.co/qUVe1jpso4",
  "data/tweet-nytimes/2022/5/1520763740068761600.json": "Nancy Pelosi made an unannounced visit to Ukraine’s capital Saturday, becoming the highest-ranking U.S. official to meet with President Volodymyr Zelensky since the war started. She told him, \"Our commitment is to be there for you until the fight is done.\" https://t.co/qiefJPVPMt https://t.co/ms1jTh5Fdg",
  "data/tweet-nytimes/2022/5/1520775064228143104.json": "Ukrainian soprano Liudmyla Monastyrska sang the title role in “Turandot” at the Metropolitan Opera on Saturday, replacing a Russian diva who was dropped over past support of Vladimir Putin. At curtain calls, Monastyrska emerged wrapped in Ukraine's flag. https://t.co/QRSM8hZPUN https://t.co/rV8DaOlLHT",
  "data/tweet-nytimes/2022/5/1520778838179041281.json": "Tucker Carlson is the champion of the most ardent Donald Trump followers. After 2016, his show focused on the emotional core of Trump’s allure: white panic over an increasingly diverse U.S.\n\nThe shift powered Carlson's rise — and reshaped Fox News. https://t.co/MPDVIOql1p https://t.co/2kA4Da8gvl",
  "data/tweet-nytimes/2022/5/1520816587091161088.json": "Tucker Carlson has weaponized his viewers' fears to create what may be the most racist show in the history of cable news. \n\nA New York Times examination shows how intertwined his rise has been with the transformation of Fox News and U.S. conservatism. https://t.co/176OLUd00R",
  "data/tweet-nytimes/2022/5/1520880084168622082.json": "Régine, who was credited with opening the world's first disco, has died at 92. She built a $500 million empire of 23 clubs in Europe, the Middle East and the Americas, including Régine’s in Manhattan, the most famous nightspot of its era. https://t.co/FMFz5XwWRn https://t.co/w9aTgR0WGX",
  "data/tweet-nytimes/2022/5/1520975151587864576.json": "Oleg Tinkov, one of Russia’s few self-made business tycoons, spoke out against his country’s war in Ukraine. Now he is in hiding.\n\nIn an exclusive interview he said, “I don’t believe in Russia’s future’’ under President Vladimir Putin. https://t.co/fT5ta26ddn",
  "data/tweet-nytimes/2022/5/1520960028609495040.json": "House Speaker Nancy Pelosi traveled to Kyiv over the weekend, leading the second senior American delegation to meet with President Volodymyr Zelensky and declare support for Ukraine's fight against Russia. https://t.co/d2MxIjKfYF",
  "data/tweet-nytimes/2022/5/1520861890137800705.json": "As the presidential election in the Philippines nears, many young voters support Leni Robredo, the vice president. She faces long odds against Ferdinand Marcos Jr., son of a late dictator, as some in an older generation are nostalgic for strongman rule. https://t.co/mR3BtaVp7M",
  "data/tweet-nytimes/2022/5/1521067004517654528.json": "Russia committed about 65% of its ground combat forces to the war in Ukraine, and more than a quarter of those are now likely “combat ineffective,” Britain said. The assessment added to intelligence reports that Russian forces have suffered heavy losses. https://t.co/J2TOBmDRLV",
  "data/tweet-nytimes/2022/5/1520897119820955655.json": "The fact that Kim Kardashian and Pete Davidson chose to make their red carpet debut in Washington was a pretty clear indication of how they wanted to be seen by the world. https://t.co/03mrWFFrMX",
  "data/tweet-nytimes/2022/5/1520965927038337025.json": "\"Two months of darkness.\"\n\nEvacuations are underway for people hiding beneath the Azovstal steel factory in Mariupol, Ukraine. One worker said that she had not seen sunlight in weeks. https://t.co/4FNMCBB91S https://t.co/N1wyvwBfTG",
  "data/tweet-nytimes/2022/5/1521145957299232769.json": "Breaking News: The Supreme Court unanimously ruled that Boston violated the First Amendment when it refused to let a group raise a Christian flag at City Hall. https://t.co/lvPYldWgNb",
  "data/tweet-nytimes/2022/5/1521044360879644677.json": "\"We want a change.\"\n\nMany young Filipinos are aiming to upend a presidential election where the front-runner is Ferdinand Marcos Jr., the son of the late dictator. https://t.co/lsOfAdxQWV",
  "data/tweet-nytimes/2022/5/1521146329287778305.json": "The New York Times analyzed 1,150 episodes of the highest-rated prime-time show in cable news, “Tucker Carlson Tonight.” It revealed how Carlson pushes extremist ideas and conspiracy theories into millions of households every weeknight. https://t.co/KZUBK2UrHQ",
  "data/tweet-nytimes/2022/5/1521185160686882817.json": "Breaking News: A former New York City police officer was found guilty of assaulting a police officer with a metal flagpole during the Capitol riot last year. The Justice Department has won all four of its jury trials connected to the Jan. 6 attack. https://t.co/VOwOX8PaXB",
  "data/tweet-nytimes/2022/5/1520952484885368834.json": "Zhiwen Yan, a Chinese restaurant deliveryman and a beloved figure in his neighborhood in Queens, was shot and killed. No motive was offered, but officials said they were investigating the possibility that he was targeted because of his Asian ethnicity. https://t.co/OFYQshfMlG",
  "data/tweet-nytimes/2022/5/1521168917632364544.json": "Tucker Carlson weaponized his viewers' fears to create what may be the most racist show in the history of cable news. \n\nOur examination shows how intertwined his rise has been with the transformation of Fox News and U.S. conservatism. Some takeaways: https://t.co/esT86zvAqZ",
  "data/tweet-nytimes/2022/5/1520982437014257664.json": "Amid the current crisis, Fiona Hill and other former advisers are connecting President Trump’s pressure campaign on Ukraine to Jan. 6. And they’re ready to talk.\n\nListen to the Sunday Read: https://t.co/MKlnHfAsUd",
  "data/tweet-nytimes/2022/5/1521268332149850114.json": "Riz Ahmed is at the #MetGala in an undone silk shirt and undershirt. “This is an homage to the immigrant workers who kept the Gilded Age going,” he said.\n\nFollow live updates from the red carpet: https://t.co/k9Y1Kcm1Vr https://t.co/FKekTCOov7",
  "data/tweet-nytimes/2022/5/1521260772613050369.json": "Blake Lively, a co-host of tonight's #MetGala, arrived in a full bustle dress with a train silhouette, a tiara and opera gloves.\n\nFollow live updates from the red carpet: https://t.co/z7vu5Jz2BV https://t.co/MLz29hsISa",
  "data/tweet-nytimes/2022/5/1521274631520497671.json": "Architecture is in the air: Alicia Keys arrives at the #MetGala in a Ralph Lauren dress inspired by the Empire State Building. https://t.co/NMl76TMvjN https://t.co/SQIt1CV2tT",
  "data/tweet-nytimes/2022/5/1521273360486916101.json": "Hillary Clinton arrived at the #MetGala in a Joseph Altuzarra dress that is embroidered with the names of American women who inspired her, including Abigail Adams and Harriet Tubman. https://t.co/TJG7ANFamv https://t.co/cwRP0uWrBP",
  "data/tweet-nytimes/2022/5/1521282205473026050.json": "Elon Musk, who dominated headlines recently after his successful bid to buy Twitter for $44 billion, appeared at the #MetGala with his mother, the supermodel Maye Musk. https://t.co/vPNEmqGSxe https://t.co/AZBl7QqRXe",
  "data/tweet-nytimes/2022/5/1521278525822672896.json": "Billie Eilish arrives at the #MetGala in Gucci. https://t.co/B6fO0obWP2 https://t.co/MMz8FIktOO",
  "data/tweet-nytimes/2022/5/1521302366716416001.json": "Breaking News: The Supreme Court has privately voted to strike down Roe v. Wade, according to a leaked draft of its majority opinion published by Politico. https://t.co/DVfKUd6J1l https://t.co/ALWHGErymI",
  "data/tweet-nytimes/2022/5/1521289717194629120.json": "Gigi Hadid arrives at the #MetGala looking incredibly comfortable. https://t.co/0LTlAAjjyt https://t.co/4uTw6UOI5b",
  "data/tweet-nytimes/2022/5/1521280901988167681.json": "Fredrik Robertsson arrives at the #MetGala with his take on the Gilded Glamour theme. https://t.co/tszZfWYfin https://t.co/3fVOhXvrug",
  "data/tweet-nytimes/2022/5/1521266314429571075.json": "Michelle Yeoh arrived at the #MetGala wearing a mint green Prabal Gurung dress. Follow our red carpet updates: https://t.co/w6kvMymd8l https://t.co/rGSCxH9uPW",
  "data/tweet-nytimes/2022/5/1521287225870368768.json": "Jared Leto (the real one, at right) and Gucci’s Alessandro Michele arrived at the #MetGala dressed as identical twins. https://t.co/SBOqVKRmpR https://t.co/lPc8ctmjzs",
  "data/tweet-nytimes/2022/5/1521262035601960960.json": "Janelle Monáe arrived at the #MetGala in a dreamy Ralph Lauren gown. \"A star draped in stars,\" our reporter writes.\n\nFollow live updates from the red carpet: https://t.co/WeY8QINnDO https://t.co/I8C4er25rH",
  "data/tweet-nytimes/2022/5/1521346104662667264.json": "The Supreme Court privately voted to overturn the Roe v. Wade abortion rights decision, a leaked draft opinion shows. Senator Chuck Schumer and Speaker Nancy Pelosi said it could become one of the “most damaging decisions in modern history.”\n\nLive updates: https://t.co/icHcFHoh6s",
  "data/tweet-nytimes/2022/5/1521336282428973057.json": "From December 2021: The typical abortion patient in the U.S. already has a child, is poor, is unmarried and in her late 20s, has some college education and is very early in pregnancy. https://t.co/qedBy7bhKo",
  "data/tweet-nytimes/2022/5/1521155302749519872.json": "Breaking News: A Philadelphia police officer who was fired after he fatally shot a 12-year-old boy in the back in March has been charged with murder in connection with the shooting, the authorities said Monday. https://t.co/iQDD8G3zUS",
  "data/tweet-nytimes/2022/5/1521392890622193664.json": "Protesters flocked to the U.S. Supreme Court after reports emerged that a majority of justices had voted to strike down Roe v. Wade. The mood outside the court was a mix of anger and mourning. Some demonstrators shouted defiant chants; others sat silently.\nhttps://t.co/iGqgpFyiec https://t.co/ZqXsRPSgHr",
  "data/tweet-nytimes/2022/5/1521376028563845120.json": "Abortion would remain legal in about half of U.S. states if Roe v. Wade was overturned, but the rest would likely ban the procedure.\n\nThe number of abortions would probably fall, particularly among poor women in the South and Midwest. https://t.co/SRRRHYVDVe",
  "data/tweet-nytimes/2022/5/1521410516043898882.json": "In the immediate aftermath of a leaked draft opinion that suggests the U.S. Supreme Court will overturn Roe v. Wade, supporters of abortion rights emphasized that the procedure was still legal — but under serious threat.\nhttps://t.co/bc7Oo6M9IV https://t.co/afnNsVONUe",
  "data/tweet-nytimes/2022/5/1521444492175417348.json": "Progressive lawmakers across Europe expressed concerns and surprise that the U.S. Supreme Court had privately voted to strike down Roe v. Wade.\n\n“It would be a terrible regression for American women,” one French senator said.\nhttps://t.co/V9P9XqoaKw",
  "data/tweet-nytimes/2022/5/1521399219290099712.json": "“Ending legal abortion will not end abortion,” said Cecile Richards, a former president of Planned Parenthood. “It simply will mean that women are no longer safe in this country.” https://t.co/rdNlOHfK1R",
  "data/tweet-nytimes/2022/5/1521298089537155072.json": "Kim Kardashian and Pete Davidson arrive at the #MetGala. https://t.co/ofGBWfM1eB https://t.co/ogbabmSfg3",
  "data/tweet-nytimes/2022/5/1521293476079575055.json": "Cardi B and Donatella Versace arrive at the #MetGala. Cardi's Versace dress is made from almost a kilometer of chains and jewelry. https://t.co/5bHYEkkuG9 https://t.co/i9MpElEMWU",
  "data/tweet-nytimes/2022/5/1521460086979403776.json": "The Supreme Court legalized abortion in the U.S. with its ruling on Roe v. Wade in 1973. Nearly 50 years later, the court privately voted to strike down the decision, a leaked draft opinion shows.\n\nHere’s what to know about the case.\nhttps://t.co/YdkVrva7Ik",
  "data/tweet-nytimes/2022/5/1521487260067246086.json": "Progressive lawmakers across Europe reacted with concern and surprise to the news that the U.S. Supreme Court might overturn Roe v. Wade.\n\n“The right of women to decide what happens to our own bodies is a human right,” the first minister of Scotland said. https://t.co/LydVWSGG5e",
  "data/tweet-nytimes/2022/5/1521470915694972929.json": "Elon Musk often acts on impulse and the certainty that he is 100% right, according to interviews with those who have worked with him. He has constructed an insular world of about 10 confidants who mostly agree with him and carry out his bidding.\nhttps://t.co/0XF7GtV6lV",
  "data/tweet-nytimes/2022/5/1521512422674157571.json": "“The Republican-appointed justices’ reported votes to overturn Roe v. Wade would go down as an abomination, one of the worst, most damaging decisions in modern history,” Senator Chuck Schumer, Democrat of New York and the majority leader, said on Tuesday. https://t.co/6V3pWhGChE https://t.co/3jLdBNQQlg",
  "data/tweet-nytimes/2022/5/1521489804252393472.json": "The typical abortion patient in the U.S. already has a child, is poor, is unmarried and in her late 20s, has some college education and is very early in pregnancy.  https://t.co/3j6kgrfweN",
  "data/tweet-nytimes/2022/5/1521502376322113537.json": "While cautioning the decision isn’t final until the Supreme Court announces its opinion, Senator Susan Collins, a Republican, said the draft ruling does not align with conversations she had with two Trump-appointed justices she voted to confirm. https://t.co/ws8kOVxSSe https://t.co/Scv283DQNh",
  "data/tweet-nytimes/2022/5/1521532559615840257.json": "Sen. Mitch McConnell called for a criminal investigation and charges against whoever leaked the draft Supreme Court opinion overturning Roe v. Wade, escalating conservatives’ effort to focus public attention on the leak itself rather than its substance. https://t.co/5nIutqMOXq https://t.co/SMnu0k3Aue",
  "data/tweet-nytimes/2022/5/1521570111777349633.json": "About half of the states are expected to ban abortion or enact limits on the procedure if the Supreme Court overturns Roe v. Wade, as a leaked draft opinion indicates the court has privately voted to do. See what could happen in those states. https://t.co/vBU2UqSLSG",
  "data/tweet-nytimes/2022/5/1521596743686701056.json": "President Biden said the leaked draft of a Supreme Court ruling poised to reverse Roe v. Wade, if finalized, could undermine rights beyond abortion, including same-sex marriage. https://t.co/pvnWFdDn5J https://t.co/7U2Ab2735K",
  "data/tweet-nytimes/2022/5/1521592963125682176.json": "\"Our children will have less rights than their parents.\" Senator Chuck Schumer denounced the Supreme Court’s draft decision to overturn Roe v. Wade, saying it would be \"one of the worst, most damaging decisions in modern history.\" https://t.co/Zht7aAjyGe https://t.co/sgyay2Cgo9",
  "data/tweet-nytimes/2022/5/1521462101130330114.json": "A warehouse of a Russian textbook company, whose chairman is a close friend of President Vladimir Putin, went up in flames overnight.\n\nThe blaze is another in a series of suspicious fires that have erupted across the country.\nhttps://t.co/bKykUQGmZL",
  "data/tweet-nytimes/2022/5/1521640784373682182.json": "Hundreds of demonstrators gathered at Foley Square in Lower Manhattan on Tuesday evening to protest the possibility of the Supreme Court’s overturning Roe v. Wade, which has guaranteed the right to abortion for nearly half a century. https://t.co/ACFdFI2Vyd https://t.co/O6R1f7E66L",
  "data/tweet-nytimes/2022/5/1521630697185755137.json": "Gov. Ron DeSantis of Florida, who recently signed into law a ban on abortion after 15 weeks of pregnancy, described the leak of the draft Supreme Court opinion on abortion as an attack on the justices. \"That’s a judicial insurrection,\" he said. https://t.co/nav7mF37sr",
  "data/tweet-nytimes/2022/5/1521614339517603841.json": "Thirteen states in the U.S. have so-called trigger laws, which would effectively ban abortions almost immediately after a decision from the Supreme Court to overturn Roe v. Wade. https://t.co/VzsPXHcQWq https://t.co/U1gGjA35OU",
  "data/tweet-nytimes/2022/5/1521603043355148296.json": "“This is my third war,” said Raisa Nazarchuk, 84, at a shelter in Lviv, Ukraine, on Tuesday. “Do you know when it will be over?” \n\nA child in World War II, she also survived the war with Russian-backed separatist forces that broke out in 2014. https://t.co/nZEtSDyQQ3 https://t.co/de23JKWWo0",
  "data/tweet-nytimes/2022/5/1521653354174287872.json": "Maxwell Berry, a 23-year-old Ohio man who the authorities say groped two flight attendants and punched a third before being duct-taped to his seat amid jeers from his fellow passengers on a flight last summer, was sentenced on Tuesday to 60 days in jail. https://t.co/uNdwu2Wx1N",
  "data/tweet-nytimes/2022/5/1521633220734955523.json": "Senator Lisa Murkowski, a centrist Republican, called the leak of a draft opinion on Roe v. Wade \"absolutely reprehensible.\" But, she added, if the decision goes in the direction that the draft indicates, \"it rocks my confidence in the court right now.\" https://t.co/DtsO2feuIQ https://t.co/LkciYToBQl",
  "data/tweet-nytimes/2022/5/1521750063634075654.json": "Breaking News: The EU proposed a total ban on Russian oil, its biggest step toward supporting Ukraine and reducing reliance on Russia. \n\nFollow our live updates on the war. https://t.co/diw3GSxJ2n",
  "data/tweet-nytimes/2022/5/1521829910922379265.json": "Breaking News: Dolly Parton was voted into the Rock &amp; Roll Hall of Fame, though she had asked not to be included, as were Eminem, Lionel Richie, Carly Simon, Eurythmics, Duran Duran and Pat Benatar.\nhttps://t.co/tHM8hdMmph",
  "data/tweet-nytimes/2022/5/1521708721688170498.json": "Thousands of abortion rights supporters protested across the U.S. after a draft ruling showed a majority of Supreme Court justices would vote to overturn Roe v. Wade. https://t.co/5BiyxSWUN1",
  "data/tweet-nytimes/2022/5/1521870438338596867.json": "Breaking News: Stanford University will receive a record $1.1 billion gift from the venture capitalist John Doerr to fund a school focused on climate change and sustainability. https://t.co/HIzxTTHXbs",
  "data/tweet-nytimes/2022/5/1521574013276930048.json": "Three survivors of the 1921 massacre that saw a white mob kill hundreds of Black residents in Tulsa can proceed with part of a lawsuit seeking reparations, an Oklahoma judge ruled. “History was made today,” a lawyer for the plaintiffs said. https://t.co/2WAbR82iNx",
  "data/tweet-nytimes/2022/5/1521754800840482819.json": "The comedian Dave Chappelle was tackled onstage as he performed at the Hollywood Bowl in Los Angeles, according to witnesses and videos. Footage circulating on social media appeared to show a man charging into Chappelle. https://t.co/hwlbL2T5Ej",
  "data/tweet-nytimes/2022/5/1521871031857827841.json": "Dolly Parton was voted into the Rock &amp; Roll Hall of Fame, though she had asked not to be included, as were Eminem, Lionel Richie, Carly Simon, Eurythmics, Duran Duran and Pat Benatar.\nhttps://t.co/2mGKVbrcFt https://t.co/Kj5pHzt2TB",
  "data/tweet-nytimes/2022/5/1521878599585959936.json": "The next round of sanctions against Russia will include Patriarch Kirill of Moscow over his support of the Kremlin's invasion of Ukraine, according to diplomats who reviewed the document but were not authorized to speak publicly. https://t.co/fJxqE2y3P8",
  "data/tweet-nytimes/2022/5/1521918859367833600.json": "The man who tackled Dave Chappelle onstage during his standup act at the Hollywood Bowl was armed with a fake gun that contained a blade, according to the police. He was charged with assault with a deadly weapon, the Los Angeles Police Department said. https://t.co/apiEwU3Qcq",
  "data/tweet-nytimes/2022/5/1521959121905459200.json": "Bolivian river dolphins were photographed with an anaconda in their mouths in August 2021. The aroused males could have been having a sexual romp with each other before the snake became entangled. https://t.co/wOyrIe6CUL https://t.co/tADtnIbPWv",
  "data/tweet-nytimes/2022/5/1521901260873641986.json": "Young children who transition to a new gender with social changes — taking on new names, pronouns and clothing — are likely to continue identifying as that gender five years later, according to a report. Participants transitioned, on average, at age 6.5. https://t.co/ywsKaYvGn5",
  "data/tweet-nytimes/2022/5/1521844362497429511.json": "Germany will offer visas and job opportunities to Russians seeking to get away from Vladimir Putin’s government, the German economy minister said, describing measures similar to those Berlin has laid out for Ukrainian refugees.\nhttps://t.co/YGVy5VmCjw",
  "data/tweet-nytimes/2022/5/1522001634712293376.json": "Breaking News: The U.S. has provided intelligence that has helped Ukraine target and kill many Russian generals who have died in the war, officials said. https://t.co/QwzcL9B7Yd",
  "data/tweet-nytimes/2022/5/1521475943411421185.json": "The resistance to Russia’s invasion will rank as “Ukraine’s finest hour,” Prime Minister Boris Johnson of Britain said, invoking Winston Churchill, in the first address by a foreign leader to the Ukrainian Parliament since the war began.\nhttps://t.co/ywLnjL2w4u https://t.co/QIw84itW2d",
  "data/tweet-nytimes/2022/5/1521957896644354048.json": "Gov. Gavin Newsom vowed to protect the right to abortion in California and issued an impassioned “wake-up call” to the Democratic Party about what he described as a coordinated Republican-led effort to erode rights. https://t.co/vcl8TZEoF9",
  "data/tweet-nytimes/2022/5/1521913378251362309.json": "Breaking News: The Federal Reserve raised interest rates by half a percentage point, its largest move since 2000, as it tries to tame rapid inflation. https://t.co/o3jHahEjt1",
  "data/tweet-nytimes/2022/5/1522043416854605824.json": "A growing number of White House Correspondents Dinner attendees have tested positive for Covid, including Secretary of State Antony Blinken. https://t.co/sadG6f9b0S",
  "data/tweet-nytimes/2022/5/1522191917135638529.json": "Elon Musk grew up in elite white communities in South Africa, detached from apartheid’s atrocities and surrounded by anti-Black propaganda.\n\nHe sees his takeover of Twitter as a free speech win but in his youth did not suffer the effects of misinformation. https://t.co/bciCJDWGGP",
  "data/tweet-nytimes/2022/5/1522193974211063808.json": "Breaking News: Nearly 15 million more people than expected died during the pandemic, the WHO said, far exceeding Covid tolls reported by countries.\nhttps://t.co/GpDiu2tizK",
  "data/tweet-nytimes/2022/5/1522161703349370881.json": "Shawn Williams was just 19 when he was falsely accused of a 1993 murder in Brooklyn.\n\nNow, after being freed in 2018, city officials will pay him $10.5 million to settle a federal civil rights suit against a former detective and two other officers. https://t.co/7bVmlTE5al",
  "data/tweet-nytimes/2022/5/1522033378194771971.json": "A dramatic account of how the Oath Keepers leader, Stewart Rhodes, tried to reach Donald Trump on Jan. 6 with a message that the group could help keep him in power was revealed in federal court. https://t.co/G8MwFS78f1",
  "data/tweet-nytimes/2022/5/1522240980052852736.json": "Ads account for roughly 90% of Twitter’s revenue. Numerous advertising executives say they’re willing to move their money elsewhere, especially if Elon Musk gets rid of the safeguards that allowed Twitter to remove racist rants and conspiracy theories. https://t.co/mT4gF9PIRb",
  "data/tweet-nytimes/2022/5/1522210784281079808.json": "Shell, Europe’s largest energy company, reported its biggest ever quarterly profit amid high oil and natural gas prices. The company recorded $9.1 billion in profit in the first three months of the year.\nhttps://t.co/k3leaF2Dbe",
  "data/tweet-nytimes/2022/5/1522318054016884741.json": "Karine Jean-Pierre has been named White House press secretary. She will be the first Black woman and the first openly gay person to serve in the role. https://t.co/1HIvotvtM6 https://t.co/g8sXjiLGFW",
  "data/tweet-nytimes/2022/5/1522205742480117760.json": "Ukraine made significant gains in the battleground of Kharkiv in recent days, regaining strategic territory around the city. The advance could hinder Moscow’s assault in the eastern Donbas region, analysts said.\nhttps://t.co/cYhJPUqZos",
  "data/tweet-nytimes/2022/5/1522213293498114048.json": "About 150 skulls, with missing teeth and shattered bits of bone, were found in a cave in southern Mexico in 2012.\n\nThe police thought it was a gang-related crime scene. But it turns out the killings happened more than 1,000 years ago.\nhttps://t.co/3cTazFiJ8h",
  "data/tweet-nytimes/2022/5/1522277464663285764.json": "The vaquita, a shy porpoise from Mexico with panda-like eyes, is one of the world’s most endangered animals. Only about 10 remain.\n\nBut now there’s some rare good news about their chance for survival. https://t.co/wV95SMniC3",
  "data/tweet-nytimes/2022/5/1522350709701816329.json": "Breaking News: The U.S. provided targeting information that helped Ukrainian forces locate and strike the flagship of Russia’s Black Sea fleet last month. https://t.co/pdmluD7yqG",
  "data/tweet-nytimes/2022/5/1522337871922872322.json": "Donald Trump asked his then-defense secretary, Mark Esper, about the possibility of launching missiles into Mexico to “destroy the drug labs” and wipe out the cartels, Esper said in his upcoming memoir. https://t.co/HsaD7M1GQX",
  "data/tweet-nytimes/2022/5/1522312716110639104.json": "Aleksandr Lukashenko, the authoritarian leader of Belarus and close ally of President Vladimir Putin, said Russia’s invasion had \"dragged on\" and called for an end to the \"war,\" using a word that the Kremlin has assiduously avoided. https://t.co/92ywHzHo6Q",
  "data/tweet-nytimes/2022/5/1522248527979626498.json": "A Maryland man who died two months after receiving a heart transplant from a genetically altered pig was infected with a virus that the animals are known to carry, according to the surgeon. The infection may have contributed to his death. https://t.co/uAnhhTemO3",
  "data/tweet-nytimes/2022/5/1522207019528339457.json": "Cinco de Mayo has a history that runs deep and continues to serve as a vehicle conveying Mexican culture, pride and values.\n\nHere are a few things to know about the day.\nhttps://t.co/pKAGVYexDu",
  "data/tweet-nytimes/2022/5/1522429553859305472.json": "Surprise 🐰 Bad Bunny just released a new album, \"Un Verano Sin Ti.\"\n\n\"The album is very Caribbean, in every sense: with its reggaeton, its mambo, with all those rhythms,\" he said in an exclusive interview. \"And I like it that way.\" https://t.co/QOagkVhoDZ https://t.co/T12S8G0QA5",
  "data/tweet-nytimes/2022/5/1522237232085622785.json": "Nearly 15 million more people died during the first two years of the pandemic than would have been expected during pre-pandemic times, the WHO found. The previous death count, from countries’ reporting, was six million. https://t.co/fj6WmdcvLK https://t.co/VCmqsAyaKV",
  "data/tweet-nytimes/2022/5/1522363015093489664.json": "Breaking News: The FDA said it would limit the use of Johnson &amp; Johnson’s Covid vaccine, citing safety concerns over a rare blood clotting disorder. https://t.co/9qJIkMG4AV",
  "data/tweet-nytimes/2022/5/1522535414887821316.json": "A marble bust was sold for $34.99 at a Goodwill store in Austin, Texas, in 2018. Turns out, it was an actual Roman bust from the late 1st century BC or early 1st century AD.\n\nHow it got to Texas remains a mystery.\nhttps://t.co/qo1UYzQ9wx",
  "data/tweet-nytimes/2022/5/1522359506390458369.json": "The number of unruly air passenger incidents reached its lowest level in the U.S. since 2020, a week after a federal judge in Florida struck down a government mask mandate on public transportation, according to FAA data. https://t.co/hZensTzxSo",
  "data/tweet-nytimes/2022/5/1522556304853770242.json": "Breaking News: U.S. employers added 428,000 jobs in April and average hourly earnings rose 5.5% from a year ago, signs of strength in the labor market.\nhttps://t.co/5tRS98mu7o",
  "data/tweet-nytimes/2022/5/1522395786960687105.json": "Jill Biden is leaving late Thursday for Eastern Europe, where she will visit with Ukrainian refugees displaced by the Russian invasion and tour the Slovakian border with Ukraine. https://t.co/NOU00rAjsl",
  "data/tweet-nytimes/2022/5/1522599624950878208.json": "A marble bust was sold for $34.99 at a Goodwill store in Austin, Texas, in 2018. Turns out, it was an actual Roman bust from the late 1st century BC or early 1st century AD.\n\nHow it got to Texas remains a mystery. https://t.co/j1uE7tgVf0 https://t.co/yHl5EjKXOf",
  "data/tweet-nytimes/2022/5/1522466197702381568.json": "The top UN human rights official said that her staff had documented scores of cases of Russian forces targeting male civilians around Kyiv.\n\nSome were beaten or executed, and some were taken to detention camps inside Russia and Belarus, the official said. https://t.co/1OrHwObsIz",
  "data/tweet-nytimes/2022/5/1522589505508814848.json": "Threatened with rent hikes and eviction, tenants of a Bronx building came together to fight the landlord. Now they are on the cusp of owning the building. https://t.co/Ym2EpmCMNS",
  "data/tweet-nytimes/2022/5/1522667549690929153.json": "Tesla is covering transportation costs for employees to get out-of-state abortions, according to a report it released on Friday. The company recently moved to Texas, which is home to some of the most restrictive abortion laws in the U.S. https://t.co/eUgaodSemF",
  "data/tweet-nytimes/2022/5/1522682668458164225.json": "When a new landlord bought their building in the Bronx and threatened to raise rents and kick them out, tenants banded together. They never expected how far they might get: the chance to buy their apartments for $2,500 each. https://t.co/EIz3VZoikU https://t.co/XdysUOZ0u5",
  "data/tweet-nytimes/2022/5/1522615957021200384.json": "Here's what the U.S. would look like without Roe v. Wade. https://t.co/Cm9NtnutXR https://t.co/PgRkP3B6MX",
  "data/tweet-nytimes/2022/5/1522712860488769536.json": "A federal judge in San Francisco on Friday dismissed Donald Trump’s lawsuit against Twitter over the social media company’s decision to bar him from its platform permanently after the Jan. 6 attack at the U.S. Capitol. https://t.co/numfrtQv9w",
  "data/tweet-nytimes/2022/5/1522697774415892481.json": "If the Supreme Court's draft opinion overturning Roe v. Wade becomes final, poor women will feel the brunt of it as some states ban abortion, @sangerkatz tells @AsteadWesley. Listen to their full conversation. https://t.co/shSP0jtFcP https://t.co/vYNh4lJitI",
  "data/tweet-nytimes/2022/5/1522773270713483270.json": "Mattea Roach ended her “Jeopardy!” streak on Friday, winning 23 straight games and earning $560,983 (plus a $2000 consolation prize for her loss). She is among the show’s winningest regular-season players. https://t.co/0x0InPlX40",
  "data/tweet-nytimes/2022/5/1522743038614851589.json": "After weeks of investigation, Italian authorities announced late Friday evening that they had impounded a nearly $700 million superyacht, saying that its owner had “significant economic and business links” to “prominent elements of the Russian government.” https://t.co/3oC9s8Pesv",
  "data/tweet-nytimes/2022/5/1522695215395778560.json": "Ukrainian troops, emboldened by weapons supplied by the West, went on the offensive Friday against Russian forces in the northeast, seeking to drive them back from two key cities as the war plunged deeper into a grinding, town-for-town battle. https://t.co/45b1rdCcOi",
  "data/tweet-nytimes/2022/5/1522975806770884610.json": "The Kremlin entered the war in Ukraine expecting a quick and painless victory, predicting that Ukrainians in the east would gladly join its side.\n\nThat plan has failed spectacularly. https://t.co/eB4KyQzIv8",
  "data/tweet-nytimes/2022/5/1522994702189953025.json": "Jill Biden, the first lady, met with Ukrainian refugees in Romania on Saturday. At a public school in the country’s capital, she listened to stories from women who fled Russian bombs and visited with children who said their only wish was to return home. https://t.co/Xry3sXJZfC https://t.co/LfSLa9g8J8",
  "data/tweet-nytimes/2022/5/1522722909835436037.json": "Two-thirds of working parents meet the criteria for parental burnout, a new report says. The nonclinical term means they are so exhausted by the pressure of caring for their children, they feel they have nothing left to give. https://t.co/IWceUCPf6x https://t.co/0kWpY62Zrr",
  "data/tweet-nytimes/2022/5/1522943005535133697.json": "Ed Koch created the modern template of a brash big-city mayor. He also strained to conceal a basic fact of his life: He was gay. Now, friends in whom Koch confided want to complete the record, telling the New York Times it belongs to the sweep of history. https://t.co/bWxxImPLtw https://t.co/vWSyoRKJrR",
  "data/tweet-nytimes/2022/5/1522979603496660994.json": "The Taliban government decreed Saturday that Afghan women must cover themselves from head to toe, expanding a series of restrictions on women that dictate nearly every aspect of public life. https://t.co/H04n8uVlxr",
  "data/tweet-nytimes/2022/5/1523067243097165825.json": "Jill Biden, the first lady, visited a school in Romania’s capital that has taken in Ukrainian students displaced amid Russia’s invasion. https://t.co/YcqRl0FWWN https://t.co/3PHKBKv4FN",
  "data/tweet-nytimes/2022/5/1522895043610173440.json": "Two-thirds of working parents meet the criteria for parental burnout, a new report says. The nonclinical term means they are so exhausted by the pressure of caring for their children, they feel they have nothing left to give. https://t.co/I44vCGPkg7",
  "data/tweet-nytimes/2022/5/1522835645894467587.json": "A court in Belarus sentenced a 24-year-old Russian law student whose boyfriend is a prominent dissident to six years in prison on Friday. This comes nearly a year after the country’s authorities diverted a commercial flight to Minsk to arrest them. https://t.co/St2WfkUqyT",
  "data/tweet-nytimes/2022/5/1522968273607868422.json": "Emmanuel Macron was inaugurated on Saturday for a second term as president of France. In a sober speech lasting less than ten minutes, Macron seemed determined to project a new humility, vowing to lead more inclusively. https://t.co/fyggNV8eJG https://t.co/vWxdz23IH3",
  "data/tweet-nytimes/2022/5/1523111716451942400.json": "When a new landlord bought their building in the Bronx and threatened to raise rents and kick them out, tenants banded together. They never expected how far they might get: the chance to buy their apartments for $2,500 each. https://t.co/EvZIYwkRX4 https://t.co/3hENvXtDHZ",
  "data/tweet-nytimes/2022/5/1523247601944260611.json": "Finding the right sofa for your space and budget begins with deciding what type and style you want. These @wirecutter tips will help you find a sofa that will be an investment in your current and future home. https://t.co/ekQGYuxnaR https://t.co/T4AaZg6vMN",
  "data/tweet-nytimes/2022/5/1523262704169136128.json": "Gilgeori Toast is a popular salty-sweet egg sandwich sold by street-food vendors in Korea. Eaten for breakfast or lunch, it’s quick, easy and adaptable. If you don’t have cabbage on hand, toss in any vegetables you have that would add crunch and flavor. https://t.co/atjk1X2htB https://t.co/YQGzkw9lJl",
  "data/tweet-nytimes/2022/5/1523089750575689729.json": "Rich Strike, an 80-1 shot ridden by Sonny Leon and trained by Eric Reed, rallied to capture the 148th Kentucky Derby. Before Friday morning, Rich Strike wasn't even in the field.\n\n\"This is the most unbelievable day ever possible,\" Reed said after the race. https://t.co/HVKjZakuRh https://t.co/19PBh8ByqD",
  "data/tweet-nytimes/2022/5/1523295173618200580.json": "Breaking News: Jill Biden, the first lady, traveled to western Ukraine in an unannounced trip Sunday. She met Ukraine’s first lady, Olena Zelenska, in a town that has seen its population double with the arrival of people fleeing from elsewhere in Ukraine. https://t.co/JON0YhJlsM",
  "data/tweet-nytimes/2022/5/1523172101028417536.json": "A marble bust was sold for $34.99 at a Goodwill store in Austin, Texas, in 2018. Turns out, it was an actual Roman bust from the late 1st century BC or early 1st century AD.\n\nHow it got to Texas remains a mystery. https://t.co/cgbMZOxyJJ",
  "data/tweet-nytimes/2022/5/1523300461733826561.json": "Dozens of people are feared dead after a Russian airstrike leveled a school in eastern Ukraine. If the death toll is as high as local officials fear, it could be one of the deadliest single attacks since Russia renewed its offensive in the region. https://t.co/AYK201oqx4 https://t.co/q41QExXU7R",
  "data/tweet-nytimes/2022/5/1523053969211224064.json": "Since the Taliban seized control of Afghanistan, women have been subjected to a cascade of restrictions on employment, education, travel and other aspects of public life. Many assumed the return of a burqa-style body covering was the inevitable next step. https://t.co/1TwbXfWmVa https://t.co/j9qGy1izBw",
  "data/tweet-nytimes/2022/5/1523077258721644544.json": "Breaking News: In an upset, Rich Strike, the longest shot on the board at 80-1, won the 148th Kentucky Derby in front of the first full crowd at Churchill Downs since 2019. https://t.co/MFEtQ0LXfo",
  "data/tweet-nytimes/2022/5/1523360857534595072.json": "Ncuti Gatwa, a star of the Netflix series “Sex Education,” will be the 14th actor and first Black man to play the title role in “Doctor Who,” the long-running British science fiction franchise about a time-traveling adventurer, the BBC announced on Sunday. https://t.co/S3ZD6sAojr",
  "data/tweet-nytimes/2022/5/1523370673434890240.json": "Prime Minister Justin Trudeau of Canada has made an unannounced visit to Ukraine. Local officials posted photos of the premier touring devastation in the town of Irpin, a suburb of Kyiv. https://t.co/4jQJl7LSq8 https://t.co/WcwaFjX1ai",
  "data/tweet-nytimes/2022/5/1523330643660361731.json": "More than half of the women and girls of reproductive age in the U.S. live in 28 states that could seek to ban or further restrict access to abortion if the Supreme Court were to overturn Roe v. Wade. See our analysis of those states. https://t.co/360gbAvSXT",
  "data/tweet-nytimes/2022/5/1523412445615693824.json": "U2 frontman Bono visited the grounds of a church in Bucha, Ukraine, where a mass grave was found in March after Russian troops withdrew from the town. Earlier Sunday, Bono and his bandmate the Edge performed in a Kyiv metro station. https://t.co/w4yDSxQbhn https://t.co/jvw0e4t1qf",
  "data/tweet-nytimes/2022/5/1523417506131501056.json": "Jill Biden met Ukraine’s first lady, Olena Zelenska, in an unannounced trip to western Ukraine on Sunday. Dr. Biden's full-throated call for an end to the war reflected bolder steps the Biden administration has taken to move against Russian aggression. https://t.co/e2O4e368dZ https://t.co/1TUNfwRiOY",
  "data/tweet-nytimes/2022/5/1523372181547544576.json": "George Pérez, a celebrated comic book artist and writer who gave new life to Wonder Woman in the 1980s and helped create series for DC Comics and Marvel Comics that brought together some of the biggest heroes of the comics world, has died at 67. https://t.co/lX14moOYtC https://t.co/Vf2xQHmex4",
  "data/tweet-nytimes/2022/5/1523438575827644417.json": "The headquarters of an anti-abortion group in Madison, Wis., was set on fire Sunday morning in an act of vandalism that included the attempted use of a Molotov cocktail and graffiti that read \"If abortions aren’t safe then you aren’t either,\" police said. https://t.co/Ly0jEAAiOw",
  "data/tweet-nytimes/2022/5/1523477886669180930.json": "Patron, an expert bomb finder and perhaps Ukraine's smallest fighter, has been honored by the country's president. \n\nHe has found more than 200 Russian explosives, President Volodymyr Zelenksy said, and also helps children learn about mine safety. https://t.co/dmJ37qU0tf https://t.co/yn3xH0dV6Q",
  "data/tweet-nytimes/2022/5/1523436349788893184.json": "In an unannounced trip to Ukraine, Dr. Jill Biden, the first lady, met with Ukraine’s first lady, Olena Zelenska, in a town a few miles away from the border with Slovakia. https://t.co/CZDPWucUHw https://t.co/7dCFVA3Cx3",
  "data/tweet-nytimes/2022/5/1523202315062185985.json": "This pie from the British author and television host Nadiya Hussain riffs on the lamb samosas she grew up eating with her Bangladeshi family. https://t.co/cTtY7uM6U5 https://t.co/spzkhbOGod",
  "data/tweet-nytimes/2022/5/1523532009901015041.json": "Millions of Filipinos will vote for their next president today in a polarizing election.\n\nFollow our live updates from the Philippines #Eleksyon2022. https://t.co/rWk8zQ2PHh",
  "data/tweet-nytimes/2022/5/1523561205830500352.json": "Leni Robredo, the only woman on the ballot in the Philippines election, is an outspoken critic of President Rodrigo Duterte and a frequent target of his insults.\n\nThousands of young people, some too young to vote, have been cheering her on. #Halalan2022 https://t.co/8BWmwxnryh https://t.co/RoTwfIQvGp",
  "data/tweet-nytimes/2022/5/1523581069408325632.json": "The Philippines presidential election has been described by some as a battle between those who want to remember the past and those trying to rewrite it.\n\nHere's a look at Election Day from polling stations around Manila. #Halalan2022 https://t.co/eOBwVQbPmZ https://t.co/UePLGygQdy",
  "data/tweet-nytimes/2022/5/1523618847743709185.json": "Patron, an expert bomb finder and perhaps Ukraine's smallest fighter, has been honored by the country's president. \n\nHe has found more than 200 Russian explosives, President Volodymyr Zelenksy said, and also helps children learn about mine safety. https://t.co/H0Cei5IO1J https://t.co/ed6u53AxsS",
  "data/tweet-nytimes/2022/5/1523626376330362880.json": "The headquarters of an anti-abortion group in Madison, Wisconsin, was set on fire Sunday in an act of vandalism that included the attempted use of a Molotov cocktail and graffiti that read \"If abortions aren't safe then you aren't either,\" the police said. https://t.co/SpDEQz4NaH",
  "data/tweet-nytimes/2022/5/1523546169011544065.json": "Election violence broke out in the Philippines after a shooting between two groups linked to rivals for mayor killed four people, and a grenade attack wounded nine.\n\nThere were also reports of broken voting machines across the country. #Eleksyon2022 https://t.co/w8MByH9MH4",
  "data/tweet-nytimes/2022/5/1523664204749852672.json": "Protesters chanting “fascists” threw red liquid at Russia’s ambassador to Poland as diplomats visited a Warsaw memorial honoring Red Army soldiers killed in World War II.\nhttps://t.co/fk5m48WAUH https://t.co/ocFEMDajhU",
  "data/tweet-nytimes/2022/5/1523643977248948224.json": "Jill Biden, who visited Ukraine on Sunday, said she told President Biden on a call that the U.S. needed to keep supporting the country. The first lady added that she told him about “the horrors and the brutality that the people I had met had experienced.”\nhttps://t.co/XVQfSWyh6Y",
  "data/tweet-nytimes/2022/5/1523727062753816576.json": "President Volodymyr Zelensky honored the bomb-sniffing dog Patron on Sunday. The dog, whose name means \"ammo\" in Ukrainian, helps sniff out Russian mines and explosives in the northeastern city of Chernihiv, Ukraine. https://t.co/jcCLLtVEZ0 https://t.co/GtDqfCrGod",
  "data/tweet-nytimes/2022/5/1523681723829075969.json": "Ferdinand Marcos Jr., the son and namesake of the ousted dictator, edged closer to a triumph in the presidential election in the Philippines on Monday as early vote counting put him in a lead over Leni Robredo. #Eleksyon2022 https://t.co/ur6MBUZ0su",
  "data/tweet-nytimes/2022/5/1523701883206094849.json": "Nina Mikhailovna thought she'd never witness anything as bad as the war with the Germans, but the current war with the Russians is worse. \"These are our people,\" she said, citing the intertwined history and family ties that link Russia and Ukraine. https://t.co/p07C6689Jw https://t.co/KL2GJ9cojr",
  "data/tweet-nytimes/2022/5/1523740755663200256.json": "Breaking News: Ferdinand Marcos Jr., the son of an exiled dictator, is set to win a sweeping presidential victory in the Philippines. Marcos had more than double the votes counted for Leni Robredo, the current vice president, according to the latest tally. https://t.co/1Eu5z8p3QS",
  "data/tweet-nytimes/2022/5/1523641463728394240.json": "Leni Robredo, the only woman on the ballot in the Philippines election, is an outspoken critic of President Rodrigo Duterte and a frequent target of his insults.\n\nThousands of young people, some too young to vote, have been cheering her on. #Halalan2022 https://t.co/WJHkMPUZVV",
  "data/tweet-nytimes/2022/5/1523781136475992064.json": "The Philippines was once described by a Facebook executive as “patient zero” in the global disinformation epidemic, but over the years, the government has done little to stop the deluge. Now researchers fear voters have become conditioned to the problem. https://t.co/aHh3VYZzlL",
  "data/tweet-nytimes/2022/5/1523755708835151876.json": "Ferdinand Marcos Jr., the son of an exiled dictator, is set to win a sweeping presidential victory in the Philippines. Marcos had more than double the votes counted for Leni Robredo, the current vice president, according to the latest tally. https://t.co/mQLs7HPSor https://t.co/vRJlCUDxx5",
  "data/tweet-nytimes/2022/5/1523636420618956807.json": "An antiwar message appeared in the digital schedules of several major Russian TV networks during the annual Victory Day parade. The schedules were apparently hacked, although there was no immediate claim of responsibility.\nhttps://t.co/iplHdg5W1L",
  "data/tweet-nytimes/2022/5/1523834942962208768.json": "Breaking News: Andy Warhol’s “Marilyn” sold for $195 million, breaking the auction record for an American artist held by Jean-Michel Basquiat. https://t.co/O2Q01mCGoa",
  "data/tweet-nytimes/2022/5/1523840267991883786.json": "Emily Meggett, the keeper of centuries-old culinary traditions in the Carolinas, is considered by many to be the most important Gullah Geechee cook alive. At 89, she has finally published her own cookbook. https://t.co/KF98Gua8BU",
  "data/tweet-nytimes/2022/5/1523865430456156161.json": "Russia’s lack of guided weapons, and their often poor accuracy when used, offers more indications of just how far behind Moscow’s armed forces are compared with Western militaries. https://t.co/59dsjreNed",
  "data/tweet-nytimes/2022/5/1523987975213916160.json": "A House subcommittee will hold the first open congressional hearing on unidentified aerial vehicles in more than half a century next week. The hearing will include testimony from two top defense intelligence officials.\nhttps://t.co/mLkgEvc1Ah",
  "data/tweet-nytimes/2022/5/1524022464912760835.json": "Young voters in the Philippines protested against Ferdinand Marcos Jr., who claimed a landslide win in the country’s presidential race.\n\nLeni Robredo, the current vice president, said her team was looking into voter fraud reports from election observers.\nhttps://t.co/9dU8tPQpnK https://t.co/wEh8apgGQ0",
  "data/tweet-nytimes/2022/5/1523970115997470721.json": "Andy Warhol’s “Marilyn” sold for $195 million on Monday, breaking the auction record for an American artist held by Jean-Michel Basquiat. https://t.co/pl9n8UOziD https://t.co/10ARDNUs20",
  "data/tweet-nytimes/2022/5/1523871712684687365.json": "President Biden signed the Lend-Lease Act, which will waive time-consuming requirements on the provision of arms to Ukraine. https://t.co/rdwGQoNUTc",
  "data/tweet-nytimes/2022/5/1523762290578833408.json": "Kevin Thompson thought he would lead his hometown church in Arkansas for the rest of his life. But he left after the rise of Donald Trump soured his relationship with congregants.\n\n\"The moment you lose the concept of truth you’ve lost everything,\" he said. https://t.co/byGqgxXz89",
  "data/tweet-nytimes/2022/5/1524053399968354307.json": "Breaking News: Soccer’s global governing body and EA Sports are ending a partnership that created FIFA, one of the most popular video games of all time. The game has generated more than $20 billion in sales over the past two decades. https://t.co/S3X4eEUprp",
  "data/tweet-nytimes/2022/5/1524068035442753538.json": "Treasury Secretary Janet Yellen said on Tuesday that the loss of access to legal abortions would damage the U.S. economy and deal a blow to the financial well-being of women. https://t.co/lJWyuY3z9C https://t.co/FhkgyiG6Jf",
  "data/tweet-nytimes/2022/5/1524086738137800709.json": "Breaking News: Elon Musk said that if his deal to buy Twitter closes he would “reverse the permanent ban” of Donald Trump, calling the decision to block him “morally wrong.” https://t.co/12r8gOAJMq",
  "data/tweet-nytimes/2022/5/1524084380918026240.json": "“It sounds like a spy novel.\" Maria Alyokhina, leader of the band Pussy Riot, decided it was time to leave Russia after more than a decade of activism — at least temporarily. She and her girlfriend disguised themselves as food couriers to evade the police. https://t.co/FCT7dNyhf0 https://t.co/cAJdzyjfEj",
  "data/tweet-nytimes/2022/5/1524117082492788736.json": "Young voters in the Philippines protested on Tuesday against Ferdinand Marcos Jr., who clinched a landslide win this week in the country’s presidential race. Leni Robredo, the current vice president, said her team was looking into reports of voter fraud. https://t.co/9mK5AeCF51 https://t.co/DoJ1zlyEHx",
  "data/tweet-nytimes/2022/5/1524144779671576576.json": "Maria Alyokhina, the activist and Pussy Riot band leader, escaped from Russia disguised as a food courier to evade the police, as President Vladimir Putin cracked down harder to snuff out any criticism of his war in Ukraine. https://t.co/LwkU4F4rbC https://t.co/b5MjSXIjpY",
  "data/tweet-nytimes/2022/5/1524139760800964612.json": "The Guggenheim Museum in New York and the National Gallery in London are removing the Sackler name from their walls over the family’s ties to the opioid crisis. https://t.co/5sd2t8nRyt",
  "data/tweet-nytimes/2022/5/1524073543935438853.json": "Breaking News: Gun deaths reached the highest level ever recorded in the U.S. in 2020, the CDC reported on Tuesday. Gun-related homicides, in particular, rose by 35%, a surge that exacted an unprecedented toll on Black men, researchers said. https://t.co/A5POzyavKZ",
  "data/tweet-nytimes/2022/5/1524201402662330369.json": "Across the U.S., mothers say they are rationing food for their babies as they search for more formula. Some are driving hours, only to find empty shelves. Online, private sellers are gouging prices, marketing cans for double or triple their normal price. https://t.co/ZtajH5TJYl",
  "data/tweet-nytimes/2022/5/1524262129385316354.json": "Breaking News: Al Jazeera said one of its journalists was killed in the West Bank city of Jenin during clashes between Israeli forces and Palestinian gunmen. https://t.co/DGzZEiXtnm",
  "data/tweet-nytimes/2022/5/1524231650716041217.json": "Jim Pillen, a University of Nebraska regent endorsed by Gov. Pete Ricketts, beat a GOP rival backed by Donald Trump in the Republican primary for Nebraska governor. https://t.co/RPh1OpIp3Y",
  "data/tweet-nytimes/2022/5/1524207718432751618.json": "The Senate confirmed Lisa Cook as a Federal Reserve governor on Tuesday, making her the first Black woman to hold that influential policy post. Her confirmation came after Vice President Kamala Harris broke a 50-to-50 tie in the Senate. https://t.co/IwGv3D85IA",
  "data/tweet-nytimes/2022/5/1524335780377808896.json": "Russia has long seen Bulgaria as its most ardent and reliable friend in Europe. But since Russia’s invasion of Ukraine, relations have soured rapidly.\nhttps://t.co/t5oIUz8n6E https://t.co/OuJrHU9grp",
  "data/tweet-nytimes/2022/5/1524127157395636225.json": "Queen Elizabeth II was unable to deliver her speech at the State Opening of Parliament on Tuesday because she was having trouble walking, the palace said. It was the first time she had formally ceded her responsibilities to her heir, Prince Charles. https://t.co/s1pOsGsT8O https://t.co/mdj9tOeKaA",
  "data/tweet-nytimes/2022/5/1524320950728204289.json": "Shireen Abu Akleh, a Palestinian American journalist for Al Jazeera, was shot and killed in the West Bank early Wednesday, the Palestinian health ministry said. The circumstances surrounding the shooting were not immediately clear. https://t.co/qvLIaWKUcM",
  "data/tweet-nytimes/2022/5/1524423228516704263.json": "Breaking News: Over 500 Native American children died at U.S. schools where they were forced to live between 1819 and 1969, an initial federal inquiry found. https://t.co/C3C3nnmiZo",
  "data/tweet-nytimes/2022/5/1524456833372594177.json": "As Senate Democrats push forward to force a test vote on legislation to turn abortion rights into law, Sen. Patrick Leahy of Vermont pointed out that the debate over abortion rights is happening in an institution that is still dominated by men. https://t.co/EhqddIyVRU https://t.co/Lfafdaou41",
  "data/tweet-nytimes/2022/5/1524502131306344454.json": "A 21-year-old Russian soldier accused of fatally shooting a 62-year-old civilian on a bicycle will be the first Russian service member to stand trial in Ukraine for war crimes since the invasion, Ukraine’s prosecutor general said on Wednesday.\nhttps://t.co/m9FnN9DmHi",
  "data/tweet-nytimes/2022/5/1524521019146485761.json": "Louisiana’s governor said he opposed pending legislation that would classify abortion as homicide and make it possible for prosecutors to bring criminal cases against women who end a pregnancy. He said he would veto the bill if passed by state lawmakers. https://t.co/DnJwXjgho3 https://t.co/p3YQxvbYy0",
  "data/tweet-nytimes/2022/5/1524463545575948288.json": "Sen. Joe Manchin says he opposes Democrats' abortion rights legislation, depriving his party of a simple majority to pass it if were brought to the floor. But even if he supported it, Democrats lack the 60 votes needed to overcome a Republican filibuster. https://t.co/V0gUR4tmPA",
  "data/tweet-nytimes/2022/5/1524419153079189506.json": "Shireen Abu Akleh, a Palestinian American reporter who was killed in the West Bank on Wednesday, was a household name across the Middle East. \"Shireen was a trailblazer,\" said Dalia Hatuqa, her friend and a fellow journalist. https://t.co/Ak1Ntg8oMs",
  "data/tweet-nytimes/2022/5/1524532334300606464.json": "A passenger without any flying experience safely landed a private plane on Tuesday after the pilot had a medical issue. “I’ve got a serious situation here,” the passenger said to an air-traffic controller who helped him successfully land the plane. https://t.co/KirYe2g684 https://t.co/o05dBpz0Z8",
  "data/tweet-nytimes/2022/5/1524454289887928323.json": "Maria Alyokhina, the activist and Pussy Riot band leader, escaped from Russia disguised as a food courier to evade the police, as President Vladimir Putin cracked down harder to snuff out any criticism of his war in Ukraine. https://t.co/QnF0enD2fA https://t.co/tqgBeChqgE",
  "data/tweet-nytimes/2022/5/1524486964933795846.json": "Breaking News: Senate Republicans used a filibuster to block a bill to safeguard abortion rights, thwarting Democrats’ effort to enshrine Roe v. Wade in federal law. https://t.co/zgJmZuoWyK",
  "data/tweet-nytimes/2022/5/1524451102904795137.json": "Shireen Abu Akleh, a Palestinian American journalist for Al Jazeera, was shot and killed in the West Bank early Wednesday, the Palestinian Health Ministry said. The circumstances surrounding the shooting were not immediately clear. https://t.co/k45YD1MJRe",
  "data/tweet-nytimes/2022/5/1524600145974898693.json": "Breaking News: North Korea reported its first outbreak of the coronavirus and ordered all of its cities and counties to lock down. https://t.co/e6AjrJKxvt",
  "data/tweet-nytimes/2022/5/1524654594646847489.json": "Breaking News: Finland’s leaders announced their support for applying to join NATO. The move was expected, and was prompted by Russia’s invasion of Ukraine. https://t.co/EheOFOxvd1",
  "data/tweet-nytimes/2022/5/1524484849658126336.json": "“I’ve got a serious situation here. My pilot has gone incoherent, and I have no idea how to fly the airplane.” A passenger without any flying experience safely landed a private plane at a Florida airport after the pilot had a medical issue, the FAA said. https://t.co/bq46AGzS5Y",
  "data/tweet-nytimes/2022/5/1524667973147013122.json": "One of the biggest donors to the UK's Conservative Party is suspected of secretly funneling $630,225 to the party from a Russian account, a bank alert showed. The cash was part of a fund-raising blitz that helped propel the party to victory in 2019. https://t.co/OQsW2M3cMq",
  "data/tweet-nytimes/2022/5/1524745222030348288.json": "Breaking News: Astronomers captured the first image of the black hole at the center of our galaxy, using the powerful Event Horizon Telescope.\nhttps://t.co/nLMc6DCRTF https://t.co/jylWp5gOVs",
  "data/tweet-nytimes/2022/5/1524583904480579584.json": "Across the U.S., parents say they are rationing food for their babies as they search for more formula. Some are driving hours, only to find empty shelves. Online, private sellers are gouging prices, marketing cans for double or triple their normal price. https://t.co/V5d68nEqbR",
  "data/tweet-nytimes/2022/5/1524752275599732737.json": "Thailand plans to give away a million cannabis plants to households across the country. The giveaway comes ahead of a new law that will allow residents to grow weed for their personal medicinal use or as a small-scale commercial enterprise.\nhttps://t.co/2qrskRYXoH",
  "data/tweet-nytimes/2022/5/1524554966043664385.json": "Gov. Gavin Newsom of California on Wednesday proposed a series of tax incentives explicitly aimed at recruiting employers from states that restrict reproductive and LGBTQ rights. https://t.co/U9W1mbiCgC",
  "data/tweet-nytimes/2022/5/1524795916875603968.json": "Breaking News: Federal prosecutors have begun a grand jury investigation into whether classified White House documents that ended up at Donald Trump’s Florida home were mishandled, according to two people briefed on the matter. https://t.co/a8nvLkYM96",
  "data/tweet-nytimes/2022/5/1524761680324050944.json": "German electronics giant Siemens is exiting Russia after about 170 years of business there, the latest in a long list of businesses to leave the country since its invasion of Ukraine. The company said it lost about $625 million after Russian sanctions. https://t.co/hPHWtr1kOq",
  "data/tweet-nytimes/2022/5/1524758839039602688.json": "The bodies of more than 1,000 civilians have been recovered in areas north of Kyiv that were occupied by Russian forces, the UN said.\n\n“The figures will continue to increase,” the UN’s human rights chief said.\nhttps://t.co/Ce64xCi7Tj",
  "data/tweet-nytimes/2022/5/1524713542766710785.json": "President Biden, anticipating the grim milestone of one million lives lost to Covid in the U.S., will order flags at the White House and all federal buildings to be flown at half-staff until Monday. https://t.co/9dtZZHJ2ud",
  "data/tweet-nytimes/2022/5/1524932458575273985.json": "Senator Rand Paul of Kentucky on Thursday single-handedly delayed a bipartisan effort to quickly send $40 billion in aid to Ukraine, which Congress had tried to fast-track amid the escalating brutality of Russia’s war.\nhttps://t.co/R6ndCo1NKh",
  "data/tweet-nytimes/2022/5/1524987903398518784.json": "The five-year wait for a new album by Kendrick Lamar — the Pulitzer-anointed, voice-of-a-generation rapper — is finally over.\n\n\"Mr. Morale &amp; the Big Steppers\" is here. https://t.co/j5Ux0GUbTQ",
  "data/tweet-nytimes/2022/5/1524962707153330188.json": "Thailand plans to give away a million cannabis plants to households across the country ahead of a new law that will allow residents to grow weed for their personal medicinal use or as a small-scale commercial enterprise.\nhttps://t.co/TOiVQX8W7A https://t.co/qSUJiNUzpE",
  "data/tweet-nytimes/2022/5/1524957621572222992.json": "The declaration by Finland’s leaders that they will join NATO — with expectations that neighboring Sweden would soon do the same — could now reshape a strategic balance in Europe that has prevailed for decades.\nhttps://t.co/P3tau96Mqd",
  "data/tweet-nytimes/2022/5/1525061106246754304.json": "Breaking News: Elon Musk said his $44 billion deal to take over Twitter was “on hold” until he gathered more details about spam and fake accounts on the site. https://t.co/z2QtVDKsao",
  "data/tweet-nytimes/2022/5/1524904778010185738.json": "In Opinion\n\nGov. Ron DeSantis of Florida \"is a leader in a new, Trump-inflected party, but without the character flaws and baggage of the former president,\" writes Rich Lowry, the editor of National Review. https://t.co/KV1HAGzRfY",
  "data/tweet-nytimes/2022/5/1525116824840437761.json": "Breaking News: Video showed Israeli police officers assaulting mourners at the funeral procession of Shireen Abu Akleh, the Palestinian journalist who was killed this week. Israel said they were “forced to act” after rocks were thrown. https://t.co/cmdgKoGhal",
  "data/tweet-nytimes/2022/5/1525083398162862080.json": "Breaking News: Sheikh Khalifa bin Zayed Al Nahyan, the ailing ruler of the United Arab Emirates, died at 73, a state-run news agency reported.\nhttps://t.co/Osg29KnfKj",
  "data/tweet-nytimes/2022/5/1525151411822022658.json": "Leni Robredo, the outgoing vice president of the Philippines, acknowledged on Friday her loss in one of the most consequential presidential elections in the nation’s history, urging her supporters to accept the results and to keep fighting disinformation. https://t.co/q0WSzDryzh https://t.co/UyKjxe1nz3",
  "data/tweet-nytimes/2022/5/1525152662718750721.json": "Video showed Israeli police officers in Jerusalem beating and kicking mourners next to the coffin of Shireen Abu Akleh, an Al Jazeera reporter who was killed on Wednesday. Israel said they were “forced to act” after rocks were thrown. https://t.co/jsRnb9DO22 https://t.co/9DokPP9XUd",
  "data/tweet-nytimes/2022/5/1525141869499490306.json": "Breaking News: The Texas Supreme Court ruled that state officials can resume abuse investigations of parents who provide certain medical treatments to transgender children, reversing a lower court’s decision. https://t.co/cRXg7Kepmc",
  "data/tweet-nytimes/2022/5/1524851943243407360.json": "Shireen Abu Akleh, a trailblazing Palestinian journalist, was fatally shot on Wednesday while covering an Israeli army raid on the Jenin refugee camp in the West Bank. https://t.co/17a5mwjLFY https://t.co/uEYciiV9ip",
  "data/tweet-nytimes/2022/5/1524882138218250240.json": "In a first for underwear, the FDA has authorized vanilla-flavored panties to be considered protection against sexually-transmitted infections during oral sex. https://t.co/V6WTZ4fLXe",
  "data/tweet-nytimes/2022/5/1525216838904422400.json": "Leni Robredo, the outgoing vice president of the Philippines, acknowledged on Friday her loss in one of the most consequential presidential elections in the nation’s history, urging her supporters to accept the results and to keep fighting disinformation. https://t.co/8lYrY5VEYK https://t.co/rJLieC5L8y",
  "data/tweet-nytimes/2022/5/1525169034320392194.json": "Fred Ward, the versatile actor who played an astronaut in “The Right Stuff,” a grizzled drifter in “Tremors” and the titular writer in “Henry and June” across a decades-long career, died on Sunday. He was 79. https://t.co/4YyJPHXMu6",
  "data/tweet-nytimes/2022/5/1525102348397613058.json": "Russia’s invasion of Ukraine has forced Sweden to recalculate its military position after more than 200 years of neutrality.\n\nPulled along by its strategic partner, Finland, it is expected to apply, reluctantly, to join NATO.\nhttps://t.co/HiOJ0VRN8i",
  "data/tweet-nytimes/2022/5/1524766620249436161.json": "Palestinians gathered at the Palestinian Authority’s presidential headquarters to mourn Shireen Abu Akleh, the Al Jazeera journalist who was fatally shot in the West Bank on Wednesday.\n\n“The bullet killed a piece of all of us,” one mourner said.\nhttps://t.co/ElhqYp8GfB https://t.co/7kgKTwKhS4",
  "data/tweet-nytimes/2022/5/1525196701006323712.json": "Mike Pence will go to Georgia to headline a rally for Gov. Brian Kemp the day before the state’s primary election, Kemp’s campaign said. Donald Trump has endorsed Kemp's opponent, and criticized him for refusing to overturn Georgia's 2020 election results. https://t.co/A0InjgeVui",
  "data/tweet-nytimes/2022/5/1525267165179523072.json": "Former employees said the Las Vegas Raiders organization is in disarray, citing executive departures, poor financial management, unpaid electric bills and a raft of firings, payouts and NDAs.\nhttps://t.co/ZMNuoAJrUp",
  "data/tweet-nytimes/2022/5/1525071869816209408.json": "Senator Rand Paul of Kentucky on Thursday single-handedly delayed a bipartisan effort to quickly send $40 billion in aid to Ukraine, which Congress had tried to fast-track amid the escalating brutality of Russia’s war.\nhttps://t.co/7QAk4xGZIY",
  "data/tweet-nytimes/2022/5/1525234514695536640.json": "In the Republican primary for Pennsylvania's open Senate seat, Kathy Barnette, a Black mother of two who has never held office and whose life story has moved many white anti-abortion conservatives, poses a late threat to the two presumptive favorites. https://t.co/FxNMWs7xk9",
  "data/tweet-nytimes/2022/5/1524841914910003201.json": "Palestinians gathered on Thursday to honor Shireen Abu Akleh, the Al Jazeera journalist who was fatally shot on Wednesday.\nThe Palestinian Authority president, Mahmoud Abbas, described her as a “martyr for truth and for the free word.” https://t.co/A5AUj1uJwY",
  "data/tweet-nytimes/2022/5/1525386953130221568.json": "President Vladimir Putin has zealously guarded family from scrutiny. Now sanctions are cracking the wall of secrecy around him. https://t.co/jTxlTq2K7t https://t.co/W9LdQS6PaI",
  "data/tweet-nytimes/2022/5/1525467235074048004.json": "Justice Clarence Thomas said on Friday night the leak of a draft opinion has done irreparable damage to the Supreme Court and that it had destroyed trust among the members. He also decried the protests at justices’ homes. https://t.co/sKgi6XKul0",
  "data/tweet-nytimes/2022/5/1525181606843015171.json": "Many adults under 35 have stopped playing it safe. Instead of saving, they’re spending more and pursuing passion projects or risky careers. https://t.co/i8QgTst4y6 https://t.co/J7g4WTcuSq",
  "data/tweet-nytimes/2022/5/1525501382089900034.json": "Nearly one million people have died of Covid in the U.S. since the pandemic began. The deaths came in wave after wave and left no corner of the country untouched. https://t.co/GEgsY0db1K https://t.co/GlCgTKZIH2",
  "data/tweet-nytimes/2022/5/1525497446645829633.json": "Senator Mitch McConnell and three other Republican senators visited Ukraine on Saturday to meet with President Volodymyr Zelensky. The trip highlights the widespread bipartisan support for Ukraine in Washington. https://t.co/kvIL1QwWho https://t.co/yCGkyN0MQD",
  "data/tweet-nytimes/2022/5/1525471012778823680.json": "Ernie Barnes’s most famous painting, “Sugar Shack,” an exultant dancing scene featured on the cover of Marvin Gaye’s album “I Want You” and during the closing credits of TV’s “Good Times,” sold for $15.3 million at Christie’s. https://t.co/mkiL5hkyXN",
  "data/tweet-nytimes/2022/5/1525565379963133952.json": "Thousands of marchers converged in the nation’s capital and across the country on Saturday to show their support for abortion rights nearly two weeks after the leak of a Supreme Court draft opinion that would overturn Roe v. Wade. https://t.co/Tw2yGnVEY1 https://t.co/73qT7T4cwd",
  "data/tweet-nytimes/2022/5/1525588017011953665.json": "The front page of The New York Times for Sunday, May 15, 2022. https://t.co/NouHgbxIAL",
  "data/tweet-nytimes/2022/5/1525615715209859077.json": "The Ukrainian rap and folk band Kalush Orchestra won the Eurovision Song Contest on Saturday, as European viewers and juries delivered a symbolic, pop culture endorsement of solidarity behind Ukraine in its defense against Russia’s invasion.\n\nhttps://t.co/BLrjbrszJ5 https://t.co/l2NkatfXmw",
  "data/tweet-nytimes/2022/5/1525628303738130437.json": "No, the Biden administration is not sending baby formula to undocumented immigrants at the expense of American families amid a national shortage. https://t.co/YefeU7whSN",
  "data/tweet-nytimes/2022/5/1525606908119351299.json": "An 18-year-old white male who traveled from outside Buffalo was in custody after an attack at a Tops grocery store that officials said was racially motivated. Eleven of the 13 people who were shot were Black.  https://t.co/ZpsgpZrPZ6",
  "data/tweet-nytimes/2022/5/1525655976010997760.json": "Vladimir Putin has viewed the expansion of NATO as an existential threat that would leave Russia hemmed in with Western missiles on its doorstep. Now, his invasion of Ukraine has NATO on the brink of its largest potential expansion in nearly two decades. https://t.co/ZNko8WWRAS",
  "data/tweet-nytimes/2022/5/1525603122940456962.json": "New York University (Taylor's Version)\n\nTaylor Swift will not only be delivering this year's commencement speech, she will also receive an honorary doctorate of fine arts. https://t.co/AZA0Kj7Ajx",
  "data/tweet-nytimes/2022/5/1525325072201834497.json": "My Chemical Romance announced its breakup in 2013 and released its last new song in 2014. Although the band reunited to tour in 2019, “The Foundations of Decay” is its first new material since then. \n\nListen to the track and 12 more new songs: https://t.co/ywmWRA7x45",
  "data/tweet-nytimes/2022/5/1525370842573676544.json": "South Korea remains one of the few countries where tattoo artists are treated as criminals. Tens of thousands of them work in secret under the constant threat of law enforcement — but they say it's time to end the stigma. https://t.co/mUPh8zs9SE",
  "data/tweet-nytimes/2022/5/1525617328397877256.json": "Britney Spears, who was recently released from a conservatorship that had prevented her from becoming pregnant, revealed on Instagram on Saturday that she has had a miscarriage. \n\nhttps://t.co/FmM0vFF7XE",
  "data/tweet-nytimes/2022/5/1525852266233843715.json": "The high concentration of Black residents on Buffalo’s East Side, which the suspect in Saturday’s mass shooting said was his reason for targeting the area, is a direct result of decades of segregation and systemic racism, according to decades of research. https://t.co/ylYrIj9SO3",
  "data/tweet-nytimes/2022/5/1525844715001856002.json": "Finland’s government announced on Sunday that it would apply for membership in NATO, a move that would end decades of strategic nonalignment and pave the way for one of the most significant expansions of the Western military alliance in years. https://t.co/IBlgcDEQ6B",
  "data/tweet-nytimes/2022/5/1525856044622266370.json": "Gov. Kathy Hochul of New York, a day after a mass shooting at a Buffalo supermarket, called on elected officials and business leaders to address the “lethal combination” of hateful ideology online and an overabundance of guns. https://t.co/pxqWiFjsCv https://t.co/BDujcV4GmR",
  "data/tweet-nytimes/2022/5/1525882718810251264.json": "Celestine Chaney, 65, was killed during the Buffalo shooting, her son, Wayne Jones said. She was visiting her sister and the two of them went to the supermarket because Chaney wanted strawberries to make shortcake. “She loved those,” he said. https://t.co/XfMf4tWuuy",
  "data/tweet-nytimes/2022/5/1525814514523971584.json": "The Empire State Trail is a sprawling route that connects Buffalo to Albany and New York City to the Canadian border. It's a showcase of New York State's history and natural beauty. Here's our interactive guide to the highlights. https://t.co/WkSheDoNfr https://t.co/DHL3BIRooB",
  "data/tweet-nytimes/2022/5/1525874919438942208.json": "Robert Donald, the owner of a gun store in Endicott, New York, said he sold an assault weapon to the man accused of killing 10 people in Buffalo. Donald said he did a background check on the gunman before he sold him the gun. The report showed nothing. https://t.co/Bh6bhRDleI",
  "data/tweet-nytimes/2022/5/1525901336553918472.json": "Heyward Patterson, who would frequently give people rides to and from the Tops supermarket and help them carry their groceries, was among the 10 people fatally shot in Buffalo, according to his great niece. https://t.co/E0apFHDhwk",
  "data/tweet-nytimes/2022/5/1525877452861591555.json": "Roberta Drury, 32, was killed in the Buffalo shooting, her sister Amanda Drury, 34, said. She was on her way to the Tops supermarket to get groceries to make dinner, she said: \"She was very vibrant.\" https://t.co/dqdkLywJkO",
  "data/tweet-nytimes/2022/5/1525876185405734915.json": "Aaron Salter Jr. spent decades with the Buffalo Police Department before retiring and taking a job as a security guard with Tops, the Buffalo grocery store where a gunman killed ten people: \"There could have been more victims if not for his actions.\" https://t.co/1sz5ZCwRBj",
  "data/tweet-nytimes/2022/5/1525958867070373888.json": "Breaking News: Multiple victims were reported in a shooting at a Southern California church on Sunday. The Orange County Sheriff’s Department said a weapon that might have been involved in the shooting had been recovered and that one person was in custody. https://t.co/aieHucGzR7",
  "data/tweet-nytimes/2022/5/1525935872796987393.json": "Breaking News: Lt. Gov. John Fetterman of Pennsylvania, the front-runner in the state’s Democratic Senate primary, said he was recovering from a stroke. It was unclear when he would return to in-person campaigning before Tuesday's primary. https://t.co/i9t6baBP26",
  "data/tweet-nytimes/2022/5/1525931546724777989.json": "As the news of the losses at the Donets River crossing in Bilohorivka, Ukraine, started to spread, some Russian bloggers did not appear to hold back in their criticism of what they said was incompetent leadership. https://t.co/8nI7ja4Mgt",
  "data/tweet-nytimes/2022/5/1525915601864392704.json": "Breaking News: The suspect, who authorities said went on to carry out the shooting at a Buffalo grocery store, received a mental health evaluation last year after making threats at a high school, the police said. https://t.co/fsUtplfcuM",
  "data/tweet-nytimes/2022/5/1526141597544505345.json": "Breaking News: McDonald’s is selling its business in Russia after 32 years in the country, where it served as a potent symbol of U.S.-style capitalism.\nhttps://t.co/mDJioTe5Al",
  "data/tweet-nytimes/2022/5/1526163098830249984.json": "NATO will grant fast-track membership to Sweden and Finland, its secretary general said. The move raises the pressure on President Vladimir Putin, who justified the invasion of Ukraine by what he cast as the need to keep NATO away from Russia’s borders.\nhttps://t.co/IrUIXfmefF",
  "data/tweet-nytimes/2022/5/1525965498835410947.json": "President Vladimir Putin has zealously guarded family from scrutiny. Now sanctions are cracking the wall of secrecy around him. https://t.co/sQS2661u4d",
  "data/tweet-nytimes/2022/5/1525991933683933186.json": "Democrats are vowing to push through domestic terrorism legislation to improve intelligence sharing and coordination between law enforcement agencies following the mass shooting in Buffalo — despite growing Republican opposition. https://t.co/StK0HAbMwb",
  "data/tweet-nytimes/2022/5/1526170887782912002.json": "Coronavirus cases are spreading at an alarming rate across the U.S., particularly in the Northeast and the Midwest. An average of more than 90,000 new cases are being identified each day, a 60% increase from two weeks ago.\nhttps://t.co/5ZbiY6ilO9",
  "data/tweet-nytimes/2022/5/1525868628666720258.json": "16 years ago, Dennis DeGray was paralyzed in an accident. Now, implants in his brain allow him to play a video game, manipulate a robotic limb, send texts and emails, purchase products on Amazon and even fly a simulator drone — without lifting a finger. https://t.co/mvNUsHNxWe",
  "data/tweet-nytimes/2022/5/1526205306086244353.json": "Breaking News: President Biden approved a plan to redeploy hundreds of ground forces into Somalia, reviving an open-ended U.S. counterterrorism operation. The move largely reverses Donald Trump's decision to withdraw most troops from the country.\nhttps://t.co/uR7uYYK1s1",
  "data/tweet-nytimes/2022/5/1526227231655215104.json": "‘All these innocent lives’: These were the victims in the Buffalo attack. https://t.co/X11cxxg80J https://t.co/zjQ7jBGeZG",
  "data/tweet-nytimes/2022/5/1526257455482736641.json": "Rep. Liz Cheney, Republican of Wyoming and a former House member of GOP leadership, called out her party’s leaders Monday for enabling the spread of white nationalism after a gunman who believed racist ideology killed 10 people at a Buffalo supermarket. https://t.co/XbZkfndStm https://t.co/kPb9WmFD1U",
  "data/tweet-nytimes/2022/5/1526243599528116225.json": "Starbucks said it would reimburse travel expenses for employees who need abortions and cannot get them within 100 miles of their homes. In a memo on Monday, the company said it wanted to ensure that its employees had “access to quality health care.” https://t.co/PI1Yg2xKTx",
  "data/tweet-nytimes/2022/5/1526191498500329473.json": "Replacement theory, a racist conspiracy espoused by the suspect in the Buffalo massacre, has helped inspire a wave of mass shootings.\n\nOnce confined to the fringes, elements of the theory have become a potent force in conservative media and politics.\nhttps://t.co/BXVBYe6HbO",
  "data/tweet-nytimes/2022/5/1526223489396506625.json": "In Opinion\n\n“This Catholic feels an intense disquiet that Catholic doctrine may be shaping (or misshaping) the freedom and the future of millions of women, and men,” Maureen Dowd writes. https://t.co/XY15fgBMsd",
  "data/tweet-nytimes/2022/5/1526212234707353600.json": "At the start of the pandemic, few could imagine that one million people in the U.S. would be lost. It’s a staggering total that struck every corner of the country. But it did not strike evenly. https://t.co/8ht2v7Trxj https://t.co/0BfxVxiPjp",
  "data/tweet-nytimes/2022/5/1526276320442851329.json": "Katherine Massey, one of the victims of the mass shooting at a Tops supermarket in Buffalo on Saturday, wrote several commanding letters in local Buffalo publications urging stronger gun control laws. https://t.co/vB6n4JBUEK",
  "data/tweet-nytimes/2022/5/1526305256791060481.json": "\"You expect us to keep doing this over and over again, forgive and forget,\" said Garnell Whitfield, a former fire commissioner who lost his mother, Ruth Whitfield, in Saturday's mass shooting in Buffalo. https://t.co/tv6JKjSXuT https://t.co/6Ev0vaUlzq",
  "data/tweet-nytimes/2022/5/1526041020819030017.json": "Australia’s Covid death rate sits at one-tenth of America’s, putting the nation of 25 million people near the top of global rankings in the protection of life. Both countries share similar demographics, but their rates point to different cultures of trust. https://t.co/VQwzMwytVB",
  "data/tweet-nytimes/2022/5/1525980606986964996.json": "An undocumented Mexican woman, an undocumented Mexican immigrant, a Lebanese student and an American-born Syrian: They aided investigators after the worst subway attack in decades. Now, they're seeking protection from the nation’s immigration system. https://t.co/iK2yUOpfnj",
  "data/tweet-nytimes/2022/5/1526231013189468162.json": "The coronavirus has become more adept at reinfecting people as Omicron and its many descendants seem to have evolved to partially dodge immunity. Waves of infections two, maybe three times a year may be the future of Covid-19, some scientists now fear. https://t.co/FbS9z8mTe8",
  "data/tweet-nytimes/2022/5/1526281360884867074.json": "Among the victims of Saturday's mass shooting in Buffalo was Andre Mackniel, who was headed to the Tops grocery store for a birthday cake, chips and soda for his 3-year-old son. “He was a loving father,” his fiancée, Tracey Maciulewicz, said. https://t.co/ciEQwuxnzs",
  "data/tweet-nytimes/2022/5/1526376986741989377.json": "After the deadly mass shooting in Buffalo, Representative Elise Stefanik, Republican of New York, is facing scrutiny for echoing the racist “great replacement” theory in campaign advertisements. https://t.co/1yJfttFUe2",
  "data/tweet-nytimes/2022/5/1526356846059175937.json": "Russian forces in Ukraine have underperformed to a degree that has surprised most Western analysts, raising the prospect that President Vladimir Putin’s military operation could end in failure. https://t.co/5uLd3Hehz8",
  "data/tweet-nytimes/2022/5/1526225989583482883.json": "Blood moon. Flower moon. Total eclipse. Whatever you called it, Earth’s shadow draped over the moon Sunday. Here are some photos of what it looked like around the world. https://t.co/oJpCVgT9fG",
  "data/tweet-nytimes/2022/5/1526366929337868304.json": "In the past decade, hate crimes against Black Americans, who are 12% of the population, have far exceeded those reported against any other group, federal data shows. In 2020, more than half of the victims of hate crimes based on race were Black people. https://t.co/mHATWSO6Zc",
  "data/tweet-nytimes/2022/5/1526319095448326145.json": "Officials on Monday strongly recommended that New Yorkers wear medical-grade masks in offices, grocery stores and other public indoor settings, stopping short of a mandate as the city approaches a \"high\" alert level for Covid-19. https://t.co/3GOBBeQA4r",
  "data/tweet-nytimes/2022/5/1526336507430182912.json": "Breaking News: Ukraine ended its “combat mission” in Mariupol and said fighters were being evacuated, signaling that the battle at a steel plant was over. https://t.co/XWTQLrzzLG",
  "data/tweet-nytimes/2022/5/1526491736759062530.json": "Elon Musk said his $44 billion acquisition of Twitter \"cannot move forward\" until he gets more details about the volume of spam and fake accounts on the platform.\nhttps://t.co/dAiLaypS8Y",
  "data/tweet-nytimes/2022/5/1526382003267985409.json": "In Opinion\n\n“Replacement theory is an attack on democracy,” writes the editorial board. “It privileges the purported interests of some Americans over those of others, asserting, in effect, that the will of the people means the will of white people.” https://t.co/uOI4TGxxRl",
  "data/tweet-nytimes/2022/5/1526529232058343424.json": "Sweden’s foreign minister signed her country’s application to join NATO.\n\n“It feels momentous,” she said, “and it feels like we now have reached what we think is best for Sweden.”\nhttps://t.co/PrpnVrBpTW https://t.co/NjgIf9IOof",
  "data/tweet-nytimes/2022/5/1526565730728157184.json": "A House subcommittee has opened a hearing on unidentified aerial phenomena observed by military pilots and others. A government report last year cataloged 143 reports of unexplained aerial phenomena dating to 2004. https://t.co/fodDTbqiZB https://t.co/Dyr3heNqIg",
  "data/tweet-nytimes/2022/5/1526351798151290880.json": "Senator Chuck Schumer on Monday reprimanded hard-right Republicans, along with Fox News and pundit Tucker Carlson, for amplifying the white supremacist “replacement theory” that motivated the mass shooter who killed 10 Black people in Buffalo on Saturday. https://t.co/abge2mLmR7",
  "data/tweet-nytimes/2022/5/1526606915740082176.json": "Breaking News: In an emotional speech in Buffalo, President Biden denounced Saturday’s shooting as racist terrorism and criticized the use of hate speech for political gain. https://t.co/NLJhG9oGC5 https://t.co/mp4AsWqWZe",
  "data/tweet-nytimes/2022/5/1526574546505150466.json": "Senator Chuck Schumer sent a letter to Fox News executives calling on it to take responsibility for spreading harmful and racist rhetoric and to \"immediately cease the reckless amplification of the so-called 'Great Replacement' theory.\" https://t.co/Lg2jLJ2BO7",
  "data/tweet-nytimes/2022/5/1526583588216614915.json": "Leaders of Finland and Sweden confirmed on Tuesday that the Nordic nations would jointly submit their applications for NATO membership this week, and would travel to Washington to meet with President Biden. https://t.co/pFz6i53mXO",
  "data/tweet-nytimes/2022/5/1526642492766027779.json": "In the first lawsuit of its kind, two real Electoral College delegates in Wisconsin are seeking damages from 10 fake ones who tried to help Donald Trump in 2020 overturn his defeat in the state. https://t.co/yU4GnKWEyK",
  "data/tweet-nytimes/2022/5/1526633680680124419.json": "Spain approved a draft law on Tuesday that would grant women paid time off from work because of severe menstrual pain. The new law, the first of its kind in Europe if it passes, would also extend access to abortion. https://t.co/t3DaugA6cQ",
  "data/tweet-nytimes/2022/5/1526667967039160322.json": "Breaking News: The Justice Department is said to have asked the House panel investigating Jan. 6 for transcripts, which could be used as evidence in potential criminal cases or to pursue new leads. https://t.co/i8Xzv0Y9Sr",
  "data/tweet-nytimes/2022/5/1526643745805975552.json": "“White supremacy is a poison,” President Biden said in Buffalo on Tuesday. “We need to say as clearly and forcefully as we can that the ideology of white supremacy has no place in America. None.” \n\nRead a transcript of his speech. https://t.co/Erpx6jHh7B",
  "data/tweet-nytimes/2022/5/1526676485439897600.json": "Spain on Tuesday approved a draft law that would make it the first European country to grant women days off work because of severe menstrual pain. It would also extend access to abortion, allowing the procedure from the age of 16 without parental consent. https://t.co/pONkkyFw4z https://t.co/ttn32TsNz6",
  "data/tweet-nytimes/2022/5/1526730623657857025.json": "John Fetterman, the Democratic lieutenant governor of Pennsylvania, won his party’s Senate nomination on Tuesday. The result sets the stage for a fierce general election battle in a state that could determine control of the chamber. https://t.co/YGKMmSwr7W https://t.co/RmF72dju4p",
  "data/tweet-nytimes/2022/5/1526728486852894720.json": "Lt. Gov. John Fetterman, a progressive with blue-collar appeal, won the Democratic Senate primary in Pennsylvania just days after suffering a stroke. https://t.co/CKvrt6Oxt3",
  "data/tweet-nytimes/2022/5/1526700882959663106.json": "Breaking News: The Justice Department accused the former casino mogul Steve Wynn of lobbying Donald Trump on behalf of the Chinese government and sought to force Wynn to register as a foreign agent. https://t.co/eps2U5ocHN",
  "data/tweet-nytimes/2022/5/1526754724912975874.json": "Rep. Madison Cawthorn has lost the Republican primary in North Carolina's 11th District. The outcome served as a rebuke of Cawthorn, a right-wing firebrand and the youngest freshman in Congress, who was once seen as a rising star of the Republican Party. https://t.co/p7TzENNzmI https://t.co/DljzbYqajf",
  "data/tweet-nytimes/2022/5/1526752599126450179.json": "Breaking News: Rep. Madison Cawthorn lost his Republican primary in North Carolina after a series of incendiary statements and scandals soured many former supporters. https://t.co/Gii86HK9gh",
  "data/tweet-nytimes/2022/5/1526741124718665729.json": "Jeff Jackson, a Democratic state senator who suspended his U.S. Senate campaign in late 2021, won his party’s primary nomination for North Carolina’s newly added 14th Congressional District. https://t.co/gSpmGnb8dq",
  "data/tweet-nytimes/2022/5/1526740633695690753.json": "Christian Cooper is perhaps best known for his encounter in Central Park with a white woman who called 911 to falsely accuse him of threatening her. Now, he'll be back in the public eye — this time hosting a new show for National Geographic.\nhttps://t.co/tXjrBmTu6h",
  "data/tweet-nytimes/2022/5/1526716235102277638.json": "Josh Shapiro, the Pennsylvania state attorney general, won the Democratic nomination for governor. With a Republican-controlled legislature, he has pledged to veto abortion ban bills. https://t.co/Z2KGF8mkh1",
  "data/tweet-nytimes/2022/5/1526696593109434371.json": "The leaders of Finland and Sweden confirmed on Tuesday that they would jointly submit their applications for NATO membership this week, in a coordinated decision to end decades of neutrality amid Russia’s invasion of Ukraine. https://t.co/qjuOy6EcGd https://t.co/N9OOA6Q1Zw",
  "data/tweet-nytimes/2022/5/1526672709257666561.json": "President Biden delivered a speech in Buffalo on Tuesday denouncing the attack that killed 10 people as a racist act of terror. Many Black residents of the area said that the address would ultimately mean little without further action. https://t.co/IqyM9NGpYI https://t.co/EgKr9ZWDCB",
  "data/tweet-nytimes/2022/5/1526694073041620993.json": "President Biden condemned the racist rhetoric that reportedly influenced a white man to gun down Black shoppers at the Tops supermarket in Buffalo. “What happened here is simple and straightforward: Terrorism. Terrorism. Domestic terrorism,” Biden said. https://t.co/7PQuMUnLXs https://t.co/xGFlqAMCmD",
  "data/tweet-nytimes/2022/5/1526653810952880128.json": "Biniam Girmay of Eritrea became the first Black African cyclist to win a stage of one of the Grand Tours. “It’s unbelievable,” he said after he won the 10th stage of the Giro d’Italia. https://t.co/J6W2DEOupt",
  "data/tweet-nytimes/2022/5/1526711691748179968.json": "Hundreds of Ukrainian soldiers who made a last stand against Russian forces from a Mariupol steel mill faced an uncertain future Tuesday under Kremlin custody. They were transported to Russian-held territory aboard buses emblazoned with “Z.\" https://t.co/cfXE2DKpvW",
  "data/tweet-nytimes/2022/5/1526808199487279104.json": "Breaking News: Finland and Sweden formally asked to join NATO, casting aside decades of neutrality after Russia’s invasion of Ukraine upended European security.\n\nhttps://t.co/LbLHJdVr5K",
  "data/tweet-nytimes/2022/5/1526589647417233408.json": "A military analyst on Russian state television left other panelists in stunned silence when he said that the conflict in Ukraine was deteriorating for Russia, giving the kind of honest assessment that is virtually banished from the official airwaves. https://t.co/bnhNCRplOR",
  "data/tweet-nytimes/2022/5/1526604351413833728.json": "President Biden paid tribute to each of the victims of the racist massacre in Buffalo. He choked up as he said one of the victims was a father visiting the supermarket to buy a birthday cake for his 3-year-old son. \n\n\"Evil will not win, I promise you.\" https://t.co/umNDlTv50W",
  "data/tweet-nytimes/2022/5/1526876655708426241.json": "Kaja Kallas, Estonia’s prime minister, remembers life under Soviet occupation. She has become one of Europe’s toughest voices against Russia for its war in Ukraine. https://t.co/FjA8fjsmmY",
  "data/tweet-nytimes/2022/5/1526895443224977410.json": "Rep. Madison Cawthorn lost the Republican primary in North Carolina's 11th District on Tuesday. The outcome served as a rebuke of Cawthorn, a right-wing firebrand and the youngest freshman in Congress, who was once seen as a rising Republican star. https://t.co/S6b2efK3dl https://t.co/Q5xw0VEoZX",
  "data/tweet-nytimes/2022/5/1526884086740144130.json": "Finland and Sweden formally asked to join NATO on Wednesday after decades of strategic neutrality. Both countries have seen public opinion tilt heavily in favor of becoming members of the alliance since Russia’s invasion of Ukraine. https://t.co/CRT6Apj4pm https://t.co/3eosqhkaEG",
  "data/tweet-nytimes/2022/5/1526872250636554241.json": "It’s difficult to catch Asian elephants responding to deaths of herd members in the wild. So researchers turned to YouTube.\n\nVideos showed the animals touching or trying to lift carcasses. Often, the elephants kept a kind of vigil over their fallen peers.\nhttps://t.co/rz1QaUqBAq",
  "data/tweet-nytimes/2022/5/1526717971057500161.json": "About 30 minutes before he opened fire at a Buffalo supermarket, the gunman in Saturday's shooting invited a small group of people to join a chat room on Discord where he had spent months planning the massacre. No one appeared to have alerted the police. https://t.co/DPvK99gZr3",
  "data/tweet-nytimes/2022/5/1526907732120453122.json": "Breaking News: A Russian soldier pleaded guilty in Kyiv to shooting a civilian, in the first Ukrainian trial over a potential war crime since Russia’s invasion.\n\nAsked if he accepted his guilt, the soldier said: “Yes. Fully yes.”\nhttps://t.co/9Wd9cE0jdI",
  "data/tweet-nytimes/2022/5/1526949218904158213.json": "Breaking News: Turkey blocked NATO’s initial effort to fast-track Finland’s and Sweden’s applications to join the alliance, according to a senior diplomat. https://t.co/WTrg4uwz1U",
  "data/tweet-nytimes/2022/5/1526993644208762882.json": "Breaking News: A third of Americans live in areas with such high Covid levels now that they should consider wearing masks indoors whether local leaders require it or not, U.S. health officials warned. https://t.co/emLWdlZ7eN",
  "data/tweet-nytimes/2022/5/1526968875690106881.json": "Breaking News: More than 75% of long Covid patients in the U.S. were not hospitalized when they were first infected — yet months later, they were experiencing symptoms that were diagnosed as post-Covid conditions, a large study found. https://t.co/olGbuOYMt8",
  "data/tweet-nytimes/2022/5/1527008665248616448.json": "President Biden formally endorsed Finland and Sweden’s applications to join NATO on Wednesday, while also issuing a carefully-worded warning to Russia that the U.S. would help defend the countries in the interim before they become members. https://t.co/Cbq3uKvAdZ",
  "data/tweet-nytimes/2022/5/1527101751912017920.json": "A giant freshwater stingray was rescued and released along the Mekong River in Cambodia after getting caught on a fisherman’s line earlier this month. The endangered creature was 13 feet long and weighed 400 pounds. https://t.co/fRc66mxP9N https://t.co/UbyDnIRpHY",
  "data/tweet-nytimes/2022/5/1527082605795057672.json": "Breaking News: President Biden invoked the Defense Production Act to increase baby formula supplies and offered U.S. planes to speed shipments from abroad as the country faces a shortage that has sown fear and frustration among parents. https://t.co/PrTJzvHNXY",
  "data/tweet-nytimes/2022/5/1527061506449362944.json": "A Massachusetts man has been diagnosed with the monkeypox virus, a rare and potentially fatal disease. The case, the first in the U.S. this year, follows a series of unusual clusters in other countries that have begun to alarm health officials. https://t.co/kW11otfnWu",
  "data/tweet-nytimes/2022/5/1527033808083632129.json": "The Ukrainian fighters who surrendered to Russian forces at a steel plant in Mariupol are entitled to protection under the Geneva Conventions as prisoners of war, legal experts said. A convention states they cannot be prosecuted only for fighting in a war. https://t.co/2MwXwsLlvq",
  "data/tweet-nytimes/2022/5/1527087909073039360.json": "Rosmarie Trapp, a member of the singing family made famous by “The Sound of Music” and the last surviving daughter of the baron and the would-be nun depicted in the stage musical and 1965 film, has died. She was 93. https://t.co/zWflwtwRh9",
  "data/tweet-nytimes/2022/5/1527099243797913603.json": "A group trying to hold lawyers accountable for their efforts to keep Donald Trump in power after his 2020 election loss filed a complaint against Senator Ted Cruz with the Texas bar association. https://t.co/7AGrITEiRp",
  "data/tweet-nytimes/2022/5/1527133217362526208.json": "Here's a look at the toll long Covid takes inside the body — and why it can be so debilitating. https://t.co/6xt8oeohE0",
  "data/tweet-nytimes/2022/5/1527042605766348802.json": "Two strongmen leaders are hindering Europe's efforts to stand up to Vladimir Putin. President Recep Tayyip Erdogan of Turkey is blocking the NATO applications of Sweden and Finland, and Prime Minister Viktor Orban of Hungary is blocking an EU embargo. https://t.co/09Q85fg3TF",
  "data/tweet-nytimes/2022/5/1527219768473829376.json": "A giant freshwater stingray was rescued and released along the Mekong River in Cambodia after getting caught on a fisherman’s line earlier this month. The endangered creature was 13 feet long and weighed 400 pounds. https://t.co/SMJgEwUMEL https://t.co/UZG3auunN7",
  "data/tweet-nytimes/2022/5/1527197439282790400.json": "An official in Japan mistakenly wired a rural town’s entire Covid relief budget, nearly $360,000, to a single recipient. After promising to return the cash, the police said, the man gambled it away in online casinos. https://t.co/Y4z3mBg3To",
  "data/tweet-nytimes/2022/5/1527234382452383749.json": "In Opinion\n\n“It was only on the battlefields of World War II that fascism was defeated,” writes Timothy Snyder, a history professor, in a guest essay. “Now it’s back — and this time, the country fighting a fascist war of destruction is Russia.”\nhttps://t.co/GEyTHDQuuy",
  "data/tweet-nytimes/2022/5/1527003623930085379.json": "One third of Americans live in areas where the threat of Covid is now so high that they should consider wearing a mask in indoor public settings, whether local leaders require it or not, federal health officials warned. https://t.co/MDAOZJfIGB https://t.co/cg3e40PhOh",
  "data/tweet-nytimes/2022/5/1527269103777587200.json": "The Senate voted unanimously on Wednesday to confirm Bridget Brink to be the U.S. ambassador to Ukraine, filling a position that has remained empty for more than a year. The move came hours after the U.S. reopened its embassy in Kyiv.\nhttps://t.co/cfBe3HSJMm https://t.co/f1QviIcE69",
  "data/tweet-nytimes/2022/5/1527246467215380482.json": "A day of reckoning has arrived for some people and their dogs after two years of 24/7 togetherness. As more remote workers return to the office, the transition could be a challenge for owners and pets alike.\nhttps://t.co/7SYTmU9NPH https://t.co/mX7yk7HjoQ",
  "data/tweet-nytimes/2022/5/1527343256333262848.json": "Breaking News: Oklahoma lawmakers passed a bill banning nearly all abortions starting at fertilization, which would make it the nation’s strictest abortion law. https://t.co/XcR8XudXyp",
  "data/tweet-nytimes/2022/5/1527074363689811968.json": "In 2012, the photographer Matika Wilbur, who is Swinomish and Tulalip, packed her cameras, sold everything and bought her RV, she named “Big Girl.” She spent the next decade on the road attempting to photograph every federally recognized tribe in the U.S. https://t.co/zfuW4n2Pa2 https://t.co/pGW8pmJjdb",
  "data/tweet-nytimes/2022/5/1527349306751012886.json": "Germany’s former chancellor, Gerhard Schröder, will lose his government-funded office because of his unwillingness to quit his lobbying posts with Russian energy companies and distance himself from Vladimir Putin, a parliamentary committee said Thursday. https://t.co/hQyWAlZcMX",
  "data/tweet-nytimes/2022/5/1527412578397433857.json": "New evidence — including three videos obtained by The New York Times — shows how Russian paratroopers rounded up and executed at least eight Ukrainian men in Bucha on March 4, a likely war crime. https://t.co/EnA2q943Ds https://t.co/BRMDeGo0u6",
  "data/tweet-nytimes/2022/5/1527303142467043328.json": "Puberty is starting earlier than it used to for some girls. Scientists aren’t sure why, but they’re studying the potential role of obesity, chemicals and stress.\nhttps://t.co/fhQtZWZdZP",
  "data/tweet-nytimes/2022/5/1527434537680224271.json": "Breaking News: The U.S. officially surpassed one million known deaths from Covid-19 on Thursday, according to a New York Times database. The milestone comes amid a growing wave of cases. https://t.co/gIAuFxic18 https://t.co/5hSV8ikEDE",
  "data/tweet-nytimes/2022/5/1527340519755374592.json": "Breaking News: The Senate overwhelmingly approved $40 billion in aid to Ukraine, bringing the total U.S. war investment to $54 billion in about two months. https://t.co/ulei0HD1W0",
  "data/tweet-nytimes/2022/5/1527471684109860872.json": "The three known remaining survivors of the 1921 massacre that saw a white mob kill hundreds of Black residents in Tulsa, Oklahoma, received a $1 million donation from a philanthropic group frustrated that the justice system has yet to compensate them. https://t.co/McacHMMpX6",
  "data/tweet-nytimes/2022/5/1527337059290996762.json": "Current and former Wells Fargo employees said that they were instructed by their bosses or human resources managers to interview “diverse” candidates — even though the decision had already been made to give the job to another candidate. https://t.co/DxCVvxF4GU",
  "data/tweet-nytimes/2022/5/1527581935278645248.json": "New evidence — including three videos obtained by The New York Times — shows how Russian paratroopers rounded up and executed at least eight Ukrainian men in Bucha on March 4, a likely war crime. https://t.co/mgWmJYgPJF https://t.co/ZGrldnhht6",
  "data/tweet-nytimes/2022/5/1527454074257526794.json": "Rep. Hakeem Jeffries, the second-highest-ranking Black lawmaker in Congress, has launched an effort to discredit a proposed congressional map that would divide historically Black neighborhoods in New York, likening its configurations to Jim Crow tactics. https://t.co/3n7hb0lrlN",
  "data/tweet-nytimes/2022/5/1527474209559089152.json": "Russia appeared to be laying the groundwork Thursday for annexing swaths of southeast Ukraine, with officials already moving to introduce the ruble currency and install proxy politicians in local governments. https://t.co/4hbi9OcIvY",
  "data/tweet-nytimes/2022/5/1527630247763578883.json": "The membership list of the “Friends of Stone” group chat, provided to The New York Times by one of its participants, offers a kind of road map of Roger Stone’s links to a large number of people who sought to overturn the 2020 election.\nhttps://t.co/dOy7XPxEO4",
  "data/tweet-nytimes/2022/5/1527636806883328002.json": "The G7 agreed to provide nearly $20 billion to Ukraine over the coming months to help keep its government running.\n\n“We will continue to stand by Ukraine throughout this war and beyond and are prepared to do more as needed,” a joint statement said.\nhttps://t.co/PnulHb4uc7",
  "data/tweet-nytimes/2022/5/1527725990037753856.json": "A street inside New York City’s only Army base will soon bear the name of First Lt. John Earl Warren Jr., a Black officer who died saving others in Vietnam — instead of the name of the Confederate general who led the South’s attempt at secession. https://t.co/GNhn27ZHi4",
  "data/tweet-nytimes/2022/5/1527743484341411841.json": "The conservative lawyer John Eastman, the architect of a strategy to overturn the 2020 election, dealt directly with Donald Trump and received handwritten notes from him as the men sought to keep Trump in power, according to a new court filing. https://t.co/KV1xdhY0cR",
  "data/tweet-nytimes/2022/5/1527748546371387393.json": "Tesla’s shares have declined more than 40% since April 4, vaporizing more than $400 billion in stock market value — and Elon Musk has not helped by turning his bid to buy Twitter into a financial soap opera. https://t.co/jr5HyXfm6Y",
  "data/tweet-nytimes/2022/5/1527782479892996096.json": "State Representative Summer Lee, a progressive Democrat, won a House primary in Pennsylvania on Friday after three days of vote-counting. She could become the first Black woman to represent the state in Congress. https://t.co/1FMVyTCyAR",
  "data/tweet-nytimes/2022/5/1527798849686863872.json": "Heyward Patterson, a 67-year-old church deacon whose life revolved around service and faith, often helped older customers with their shopping bags at Tops supermarket. He was the first of the victims of the racist massacre in Buffalo to be laid to rest. https://t.co/QOG2uEDaAI",
  "data/tweet-nytimes/2022/5/1527806417687683072.json": "An archbishop in San Francisco said on Friday that Speaker Nancy Pelosi would not be permitted to receive communion in his archdiocese because of her support for abortion rights. https://t.co/tSB9cAgDzJ",
  "data/tweet-nytimes/2022/5/1527698191419940867.json": "Karine Jean-Pierre, the new White House press secretary, was raised in an immigrant family with \"so many secrets.\" Now she occupies one of the most scrutinized jobs in American politics. https://t.co/BGxhhltO6d",
  "data/tweet-nytimes/2022/5/1527774948680511491.json": "Karine Jean-Pierre, the new White House press secretary, was raised in an immigrant family with \"so many secrets.\" Now she occupies one of the most scrutinized jobs in American politics. https://t.co/vrkwrN6CFh https://t.co/zQT6qSV0B4",
  "data/tweet-nytimes/2022/5/1527773682487140352.json": "A tornado swept through northern Michigan on Friday. The police said that trees and power lines were blocking roadways and reported that “multiple homes and businesses” were damaged in Gaylord, a city of about 4,000. https://t.co/D86jKD2KKI",
  "data/tweet-nytimes/2022/5/1528003936803868675.json": "A failed state. An aid trap. The modern world’s first nation born of a slave revolt.\n\nWe just published an investigation on an overlooked part of history, examining what might have been — if Haiti had not been looted since its birth. Here's what we found. https://t.co/B0ZHFaf33q",
  "data/tweet-nytimes/2022/5/1528019081491886082.json": "Haiti is the only country in the world where descendants of enslaved people were forced to pay reparations to descendants of their masters for generations.\n\nNobody knew exactly how much Haiti paid France — and at what cost to its future — until now. https://t.co/ZxAwpSwJ98 https://t.co/Ri6jHQOgYK",
  "data/tweet-nytimes/2022/5/1527990665526779904.json": "Breaking News: Australian voters were projected to end nearly a decade of conservative government, ousting the combative prime minister, Scott Morrison. https://t.co/KvME93oO0Y",
  "data/tweet-nytimes/2022/5/1528011500295794691.json": "When she needed surgery after a car accident, the hospital said she'd have to pay about $1,337. But after the surgery, the hospital claimed it “misread” her insurance card — and billed her $229,112. When she didn’t pay, the hospital's operator sued her. https://t.co/ziZDFQxVFN",
  "data/tweet-nytimes/2022/5/1528031335536803840.json": "Breaking News: Kylian Mbappé has reached one of the richest deals in soccer history to stay with Paris St.-Germain, rejecting Real Madrid’s offer. https://t.co/QSxdqd7790",
  "data/tweet-nytimes/2022/5/1528026597495820288.json": "Patriarch Kirill I, the leader of the Moscow-based Russian Orthodox Church, has provided spiritual cover for the invasion of Ukraine, reaping vast resources for his church in return. In an extraordinary step, the EU is now threatening him with sanctions. https://t.co/JK9pV2W1tt",
  "data/tweet-nytimes/2022/5/1527786358080774144.json": "A street inside New York City’s only Army base was renamed in honor of First Lt. John Earl Warren Jr., a Black officer who died saving others in Vietnam. “John Warren died so that others can live,” said Col. Craig Martin, commander of the garrison. https://t.co/POyaEjbwFr https://t.co/CZzB82f6op",
  "data/tweet-nytimes/2022/5/1527985060284182529.json": "An archbishop in San Francisco said on Friday that Speaker Nancy Pelosi would not be permitted to receive communion in his archdiocese because of her support for abortion rights. https://t.co/uDKkVGlHI0",
  "data/tweet-nytimes/2022/5/1527835330765889536.json": "In Opinion\n\n\"Whatever you think of Heard’s actions, or whether you choose to believe her, this is a good old-fashioned public pillorying — only memes have replaced the stones,\" writes @jessicabennett about Amber Heard and Johnny Depp. https://t.co/ByNPA2USsl",
  "data/tweet-nytimes/2022/5/1528064356444999686.json": "They rose up in the first successful slave rebellion in the modern world. Then the former slaveholders returned with an ultimatum: face another war or pay cash for your freedom. How much was a mystery, until now.\n\nThis is the true cost of Haiti's freedom. https://t.co/wMD2a7SHKz https://t.co/SdFGvE8ItZ",
  "data/tweet-nytimes/2022/5/1528068137958227968.json": "In 1791, enslaved Haitians ousted the French in the first successful slave rebellion in the modern world. Two decades later, French warships arrived with an ultimatum: face another war or pay cash for freedom. The amount paid remained a mystery, until now. https://t.co/6YSaxehZU9",
  "data/tweet-nytimes/2022/5/1527586214257250304.json": "Ukraine’s foreign minister criticized what he called a lack of support from NATO since Russia’s invasion.\n\nAlliance members “are really doing awesome and important work, providing vital assistance,” he said. “But NATO as an institution has done nothing.”\nhttps://t.co/f9ryEcnrC1",
  "data/tweet-nytimes/2022/5/1528152421129650177.json": "Karine Jean-Pierre, the new White House press secretary, was raised in an immigrant family with \"so many secrets.\" Now she occupies one of the most scrutinized jobs in American politics. https://t.co/14RGFiEmdJ https://t.co/bXWgInaPMe",
  "data/tweet-nytimes/2022/5/1528366347045961729.json": "In 1791, enslaved Haitians ousted the French in the first successful slave rebellion in the modern world. Two decades later, the French returned with an ultimatum: face another war or pay cash for freedom. The amount paid has remained a mystery, until now. https://t.co/CsQzIia3ye https://t.co/rGbIOGWjko",
  "data/tweet-nytimes/2022/5/1527793843076272128.json": "The baby formula shortage highlights the market power of a single manufacturer and the lack of meaningful competition in an industry governed by rules and regulations designed to protect the incumbents. https://t.co/u2Oa3dNOzA",
  "data/tweet-nytimes/2022/5/1528084140096204800.json": "Just as temperatures were heating up for about half of the U.S. population this week, the National Oceanic and Atmospheric Administration issued its monthly climate trends report on Thursday. The main takeaway? Prepare for a scorcher of a summer. https://t.co/iBjKGuU5cB https://t.co/Bpxm0Kxana",
  "data/tweet-nytimes/2022/5/1528385211729383426.json": "At least 357 sitting Republican legislators in closely contested battleground states have used the power of their office to discredit or try to overturn the results of the 2020 presidential election, according to a review by The New York Times. https://t.co/fM8SE0ZIWl",
  "data/tweet-nytimes/2022/5/1528107122076033027.json": "Tom Cruise was 24 when \"Top Gun\" made him box office royalty, and he has basically stayed there since. Today, he represents a kind of movie star who no longer really exists — the kind that, for decades, box office blockbusters were built around. https://t.co/Ct2TbiwWvG",
  "data/tweet-nytimes/2022/5/1528449373562195969.json": "Since Russia invaded Ukraine, The New York Times has been collecting evidence of brutalities. While many acts of war are disturbing, some — especially those that show disregard for the lives of civilians — may be war crimes under the Geneva Conventions. https://t.co/P42kF6cM3k",
  "data/tweet-nytimes/2022/5/1528122218584186882.json": "In a sign of growing concern about the spread of new coronavirus infections, the CDC is now saying that all people 50 or older should get a second booster shot if at least four months have passed since their first booster dose. https://t.co/2G25x4QEmX",
  "data/tweet-nytimes/2022/5/1528456935737024512.json": "In a visit to Kyiv on Sunday, Poland's president said Ukraine alone should determine its future and that the international community must demand Russia’s complete withdrawal from its territory. https://t.co/KCH0vXl15u https://t.co/MU7lTLSqhI",
  "data/tweet-nytimes/2022/5/1528359028396539905.json": "Kate McKinnon, Pete Davidson and Aidy Bryant each got to take a victory lap in the “Saturday Night Live” season finale. https://t.co/s9XrPJjLF5",
  "data/tweet-nytimes/2022/5/1528525512150220801.json": "Weeks before the Trump administration ended, Jared Kushner and Steven Mnuchin met with future investors on trips to the Middle East. The travels raise questions about whether they sought to exploit relationships with foreign leaders for business interests. https://t.co/KflAktROxt https://t.co/SrNHp1W4Ph",
  "data/tweet-nytimes/2022/5/1528441846283784194.json": "After a man from Conklin, N.Y., was charged with the mass killing at a Buffalo grocery store, the community where he grew up has been forced to wrestle with hard questions about how such hate could have percolated in one of their neighbors. https://t.co/71rvbLHqkv",
  "data/tweet-nytimes/2022/5/1528547523807281154.json": "By collecting, melting, reforming and packaging partially used soap left behind by hotel guests, Clean The World has distributed nearly 70 million bars of soap in more than 120 countries — including Romania, where many Ukrainian refugees have arrived.\nhttps://t.co/oZf12MCnGC",
  "data/tweet-nytimes/2022/5/1528631413569896450.json": "Breaking news: President Biden said the U.S. would defend Taiwan militarily if China invaded, appearing to step away from a policy of “strategic ambiguity.” https://t.co/tSqWNtucPI",
  "data/tweet-nytimes/2022/5/1528490910543233025.json": "Lara Logan’s path has been one of the most puzzling in TV news history — CBS News once saw her as a next-generation star, but she now promotes far-right falsehoods and conspiracies. Former colleagues say her transformation did not come out of nowhere. https://t.co/BjP0Db7PPr",
  "data/tweet-nytimes/2022/5/1528680842041647104.json": "Haiti is the only country in the world where descendants of enslaved people were forced to pay reparations to descendants of its masters for generations.\n\nNobody knew exactly how much Haiti paid France — and at what cost to its future — until now. https://t.co/mjv4pbxJWD",
  "data/tweet-nytimes/2022/5/1528707326798184449.json": "A bank that helped finance the Eiffel Tower, one of the world’s best known landmarks, drained millions of dollars from Haiti. That history has been all but erased — but The New York Times tracked the money.\n\nHere’s what to know. \nhttps://t.co/xx7fmMzEvR https://t.co/wyPgLKoo6i",
  "data/tweet-nytimes/2022/5/1528696026516930567.json": "President Biden said the U.S. would use military force to defend Taiwan if China attacked, appearing to step away from a policy of “strategic ambiguity” and repeating even more unequivocally statements that his staff tried to walk back in the past.\nhttps://t.co/uIoK63VSeH https://t.co/X98M3ri4jl",
  "data/tweet-nytimes/2022/5/1528740146895638529.json": "Breaking News: A Russian diplomat resigned over the Ukraine invasion, describing it as a crime.\n\n“Never have I been so ashamed of my country,” he said.\nhttps://t.co/wTEGNYQ1VK",
  "data/tweet-nytimes/2022/5/1528741565132308487.json": "President Volodymyr Zelensky, addressing the World Economic Forum in Davos, Switzerland, invited business leaders whose companies are leaving Russia to bring their firms to Ukraine to help rebuild his country.\nhttps://t.co/TV1uaCa2Tw https://t.co/KyYA3PU22U",
  "data/tweet-nytimes/2022/5/1528369193132953600.json": "Au 19ème siècle, le Crédit Industriel et Commercial, la banque qui aida à financer la tour Eiffel, a soutiré des millions de francs à Haïti. Cette histoire est quasi gommée des mémoires — mais le New York Times a enquêté sur les paiements. https://t.co/mJQmExkMBf",
  "data/tweet-nytimes/2022/5/1528760240006627341.json": "Starbucks announced on Monday that it was officially exiting its business in Russia, closing 130 stores there and halting the shipment of any Starbucks products. https://t.co/K2AixC2aTw",
  "data/tweet-nytimes/2022/5/1528741301172285441.json": "Customs agents in Detroit intercepted the larvae and pupae of an unidentified insect inside seed pods in a passenger’s luggage. The insect turned out to be a species of moth not seen since 1912, officials said.\nhttps://t.co/AZkNeK7x8G",
  "data/tweet-nytimes/2022/5/1528643055955345409.json": "Breaking News: President Biden will begin an economic bloc with a dozen Asia-Pacific nations meant to counter China and reassert U.S. influence in the region. The alliance comes five years after Donald Trump’s withdrawal from the Trans-Pacific Partnership. https://t.co/Q9LEaovLOL",
  "data/tweet-nytimes/2022/5/1528779065754275841.json": "Russians invited guests to the Russia House at Switzerland's World Economic Forum for years. A Ukrainian has now changed it to the \"Russian War Crimes House\" to rally people at the annual event to commit to the business of arming and rebuilding Ukraine. https://t.co/1R6Xq1a56X",
  "data/tweet-nytimes/2022/5/1528669597582368768.json": "A bank that helped finance the Eiffel Tower drained millions of dollars from Haiti. That history has been all but erased — but The New York Times tracked the money. https://t.co/RTz7dZD28k",
  "data/tweet-nytimes/2022/5/1528868389837541376.json": "Addressing the World Economic Forum, President Volodymyr Zelensky of Ukraine called on Monday for tougher sanctions against Russia and invited international companies shunning Russia to set up shop in Ukraine. https://t.co/3677KuNNKL https://t.co/5FTBx0Zim8",
  "data/tweet-nytimes/2022/5/1528916221365821441.json": "Congressional ethics investigators said they have found \"substantial evidence\" that Rep. Ronny Jackson, Republican of Texas and the former White House doctor to Donald Trump, improperly used campaign donations to pay for access to a private dining club. https://t.co/TOHWNB4Y5b",
  "data/tweet-nytimes/2022/5/1528873446255599617.json": "Former Senator David Perdue ended his campaign for governor of Georgia with a racist appeal to Republican primary voters on Monday, accusing Stacey Abrams, the presumptive Democratic nominee, of “demeaning her own race.” https://t.co/ssmUGezsq5",
  "data/tweet-nytimes/2022/5/1528801711116234753.json": "A bank that helped finance the Eiffel Tower drained millions of dollars from Haiti. That history has been all but erased — but The New York Times tracked the money. https://t.co/ENGhtyXTLZ https://t.co/2RMVTahs34",
  "data/tweet-nytimes/2022/5/1528699818129952768.json": "Weeks before the Trump administration ended, Jared Kushner and Steven Mnuchin met with future investors on trips to the Middle East. The travels raise questions about whether they sought to exploit relationships with foreign leaders for business interests. https://t.co/YrCk9gDOBJ",
  "data/tweet-nytimes/2022/5/1528953948790562818.json": "President Volodymyr Zelensky of Ukraine called on world leaders at the World Economic Forum on Monday to turn up the pressure on Russia. \n\n“This is really the moment when it is decided whether brute force will rule the world,” he said. https://t.co/hrTfjO2pFO",
  "data/tweet-nytimes/2022/5/1528820596821282816.json": "Many Black families in Buffalo remain fearful after ten people were killed in a racist mass shooting on May 14. Simier Sweet, 13, said he was nervous about walking to the bus stop alone. “It could happen on the bus, anywhere, me walking to my school.” https://t.co/7NKlaeutRz",
  "data/tweet-nytimes/2022/5/1528913695656615936.json": "Across the world, about 15 million more people died than expected in the first two years of the pandemic. These latest estimates by the WHO are what many scientists consider the most reliable gauge of the total impact of the pandemic so far. https://t.co/DX5Huh5VMK",
  "data/tweet-nytimes/2022/5/1528907423653699585.json": "New York lawmakers on Monday passed the Adult Survivors Act, which enables adult victims of sexual abuse a one-time opportunity to file civil lawsuits even if any statutes of limitations have run out. Gov. Kathy Hochul is expected to sign the bill. https://t.co/qshaKDlf2i",
  "data/tweet-nytimes/2022/5/1529039534691786752.json": "In 1914, eight U.S. marines strolled into the headquarters of Haiti's national bank and walked out with $500,000 in gold.\n\nThe operation was a precursor to the full-scale invasion of Haiti — a country the U.S. ruled with brute force for 19 years.\nhttps://t.co/KvGfN52KB4",
  "data/tweet-nytimes/2022/5/1529092397203849217.json": "About 15 million more people died than expected across the world in the first two years of the pandemic, according to the WHO. These estimates are what many scientists say are the most reliable gauge of the total impact of the pandemic so far. https://t.co/NUO4CilpQz https://t.co/bgKdzfKtKn",
  "data/tweet-nytimes/2022/5/1529046303841431552.json": "American-made M777 howitzers are the most lethal weapons the West has provided so far to Ukraine. Their recent arrival has buoyed the Ukrainian military’s hopes of achieving artillery superiority over Russia.\nhttps://t.co/9eR7kLGvTh",
  "data/tweet-nytimes/2022/5/1529052115859120128.json": "A Moscow court upheld an additional nine-year sentence in a high-security prison for the opposition leader Aleksei Navalny.\n\n“This war, just like your courts, is totally built on lies,” he said of the war in Ukraine, according to Russian journalists.\nhttps://t.co/xzY5wSTZeR https://t.co/LsuDe8xpsY",
  "data/tweet-nytimes/2022/5/1529068382221389826.json": "In 1914, eight U.S. marines strolled into the headquarters of Haiti's national bank and walked out with $500,000 in gold.\n\nThe operation was a precursor to the full-scale invasion of Haiti — a country the U.S. ruled with brute force for 19 years. https://t.co/M2u8Jv9BNJ",
  "data/tweet-nytimes/2022/5/1529195425361715203.json": "Breaking News: A shooting at an elementary school in Uvalde, Texas, left at least two people dead and more than a dozen children injured. https://t.co/2ktFxhNrzx",
  "data/tweet-nytimes/2022/5/1529186747212615680.json": "Stacey Abrams, who is running for governor in Georgia, declined to comment on racist remarks made by David Perdue. \"I have listened to Republicans for the last six months attack me, but they've done nothing to attack the challenges facing Georgia.\" https://t.co/S2RXWPH9ve https://t.co/u0kR6K75YG",
  "data/tweet-nytimes/2022/5/1529097402321408002.json": "Russia’s depleted military is running out of time to break through in Ukraine’s east.\n\nSee how the scope of the invasion has changed.\nhttps://t.co/Vgtb7c6sJb",
  "data/tweet-nytimes/2022/5/1529209157097758722.json": "A gunman walked into an elementary school in Uvalde, Texas, on Tuesday afternoon and killed 14 children and a teacher, Gov. Greg Abbott said on Tuesday. The last day of school was to be this Thursday. https://t.co/hiGgECcKLa https://t.co/L5bMvEhyUg",
  "data/tweet-nytimes/2022/5/1529204916589408256.json": "Breaking News: A gunman killed 14 children and a teacher at an elementary school in Uvalde, Texas, Gov. Greg Abbott said. The 18-year-old suspect was also killed. https://t.co/5zJTcrL1NK",
  "data/tweet-nytimes/2022/5/1529213425825599490.json": "May 24: Uvalde, Texas\nMay 14: Buffalo\n\nThe massacre in Uvalde, in which 14 children and a teacher were killed, was the deadliest mass shooting in the U.S. this year. It happened just 10 days after 10 people were killed in a Buffalo supermarket. https://t.co/JFDWZQHB7f",
  "data/tweet-nytimes/2022/5/1529216948780908546.json": "Gov. Greg Abbott of Texas, along with Donald Trump and Senator Ted Cruz, is scheduled to speak at the NRA's annual meeting in Houston on Friday, three days after the mass shooting in Uvalde, Texas, that has left at least 14 children and one teacher dead. https://t.co/S8q5cDzfkJ",
  "data/tweet-nytimes/2022/5/1529220750758096896.json": "Anguished parents were instructed to stay away from the school that was the site of the mass shooting in Uvalde, Texas. A message on the district website said, “Students need to be accounted for before they are released to your care.” https://t.co/2xWhSmG2Hm",
  "data/tweet-nytimes/2022/5/1529230790084681728.json": "The massacre in Uvalde, Texas, which killed 14 students and a teacher, is the deadliest shooting at an elementary school since the shooting at Sandy Hook Elementary School in 2012 that killed 20 first graders and six adults in Newtown, Connecticut. https://t.co/cmFmNfTdGG https://t.co/5hfl3cGJkS",
  "data/tweet-nytimes/2022/5/1529228273594601473.json": "President Biden ordered the flags lowered on federal buildings in honor of the victims of the school shooting in Uvalde, Texas. He will deliver remarks at 8:15 p.m. Eastern when he returns from a trip abroad, White House officials said. https://t.co/YcgYLxI982",
  "data/tweet-nytimes/2022/5/1529240851200753667.json": "“Today is a dark day,” Senator Ted Cruz said in a statement after the shooting in Uvalde, Texas. He did not immediately call for any policy proposals to curb mass shootings and is scheduled to speak at the NRA’s annual meeting in Houston on Friday.\nhttps://t.co/F8qiulrknI",
  "data/tweet-nytimes/2022/5/1529238327186030592.json": "Stacey Abrams has won the Democratic nomination for governor of Georgia. Her first run, against Brian Kemp in 2018, propelled her to political stardom. https://t.co/5oX0cgk4VB",
  "data/tweet-nytimes/2022/5/1529235823408910338.json": "The massacre at Robb Elementary School in Uvalde comes as a trial is underway for the gunman in the 2018 shooting at Marjory Stoneman Douglas High School in Parkland, Florida, where a former student killed 17 people and injured 17 others.\n\nLive updates: https://t.co/gna5H65ogR",
  "data/tweet-nytimes/2022/5/1529224497626337286.json": "The U.S. is in the middle of a gun-buying boom that shows no sign of letting up as the annual number of firearms manufactured has nearly tripled since 2000. https://t.co/NmSvXUr4aj",
  "data/tweet-nytimes/2022/5/1529249167708651520.json": "Parents waited, hoping to be reunited with their children in Uvalde, Texas, on Tuesday.\n\nIt is a small, working-class city about 80 miles west of San Antonio, in a region with a large Mexican American population. https://t.co/HtTCsLVp64 https://t.co/kPDfJS8Bi7",
  "data/tweet-nytimes/2022/5/1529245890866708483.json": "Vice President Kamala Harris addressed the shooting in Uvalde, Texas, on Tuesday, speaking at an event in Washington, D.C.: \"Our hearts keep getting broken.\" https://t.co/v1UdvHMv5e https://t.co/Dz80owqpae",
  "data/tweet-nytimes/2022/5/1529243397873180673.json": "Anguished parents were instructed to stay away from the school that was the site of the mass shooting in Uvalde, Texas. They were told to gather at the Uvalde Civic Center “for reunification” as students were still being accounted for. https://t.co/WkiKZcA9jI https://t.co/N8IN3VvYxU",
  "data/tweet-nytimes/2022/5/1529258478279311361.json": "After the mass shooting in Uvalde, Texas, the National Parents Union called for policy change and “more than thoughts and prayers,” citing more than 100 school shootings in the state since 1970.\n\nFollow live updates: https://t.co/a3i7EGBGQL https://t.co/Dld2TwDzS9",
  "data/tweet-nytimes/2022/5/1529255957708013578.json": "The shooting at an elementary school in Uvalde, Texas, on Tuesday was the deadliest shooting at an elementary school since the 2012 shooting at Sandy Hook Elementary School in Newtown, Connecticut, that killed 20 first graders and six adults.\nhttps://t.co/zFPmGdG1wx https://t.co/bkrb9JBPCI",
  "data/tweet-nytimes/2022/5/1529254166077796352.json": "Senator Mitch McConnell, the minority leader, said on Tuesday that he was “horrified and heartbroken” by the shooting in Uvalde, Texas, but gave no indication that he was dropping his longstanding opposition to gun control measures. https://t.co/d0bxoUUrlW https://t.co/M37Y54kFeQ",
  "data/tweet-nytimes/2022/5/1529250487299624960.json": "Breaking News: At least 18 children and one teacher died on Tuesday in a school shooting in Uvalde, Texas, the state police said, adding four more children to an earlier toll. https://t.co/jRlDHW5zIT",
  "data/tweet-nytimes/2022/5/1529155536196800512.json": "The goals of Russia’s invasion keep getting smaller. Its forces are inflicting losses on the Ukrainian military at a cost to Russia’s own supply of troops and equipment, and they are failing to make major advances. https://t.co/hNQjng06Fx https://t.co/1JO65JB1Ip",
  "data/tweet-nytimes/2022/5/1529125101148545024.json": "Jen Psaki, the former White House press secretary, is joining MSNBC later this year and will serve as a political analyst, the network said. She is also set to host a show starting next year on the Peacock streaming service. https://t.co/7e1dz16jUX",
  "data/tweet-nytimes/2022/5/1529291185910648832.json": "The death toll continues to mount in the mass shooting at an elementary school in Uvalde, Texas, on Tuesday, but already it is the second-deadliest school shooting on record in the U.S. https://t.co/tsYSBgBpvQ https://t.co/xM79pAkieC",
  "data/tweet-nytimes/2022/5/1529284727219404801.json": "Breaking News: A gunman killed at least 19 children and two adults on Tuesday in an elementary school in Uvalde, Texas, the state police said, revising an earlier toll. The suspect also died at the scene. https://t.co/IukDJaT1s4",
  "data/tweet-nytimes/2022/5/1529277337761726465.json": "“What are we doing?” Nearly 10 years after the shooting at Sandy Hook Elementary School in Connecticut, Senator Chris Murphy, Democrat of Connecticut, took to the Senate floor to beg his colleagues to take action on gun control. https://t.co/hEaUdVMAUK https://t.co/sYb2k7Iq4S",
  "data/tweet-nytimes/2022/5/1529274866729308160.json": "About 90% of the students at Robb Elementary School in Uvalde, Texas, where a gunman killed at least 18 children and 1 teacher, are Hispanic, district records show. The last day of the school year had been scheduled for this Thursday. https://t.co/XSwCGYkVzs",
  "data/tweet-nytimes/2022/5/1529271075879673859.json": "“What are we doing?!”\n\nNearly 10 years after the shooting at Sandy Hook Elementary School, Senator Chris Murphy, Democrat of Connecticut, begged his colleagues to take action on gun control after Tuesday’s shooting in Uvalde, Texas.\nhttps://t.co/bYy0oDF3OU https://t.co/r4tFQU4e3e",
  "data/tweet-nytimes/2022/5/1529266037958578176.json": "\"We have to act.\"\n\nAn emotional President Biden addressed the nation on Tuesday night, hours after a gunman killed 18 children and a teacher at an elementary school in Uvalde, Texas. https://t.co/fJWD5XxHTI https://t.co/G2ReS1K79s",
  "data/tweet-nytimes/2022/5/1529263496101351426.json": "Senate Democrats have not yet held a vote on legislation the House previously passed that would strengthen background checks for gun buyers. It does not have the Republican support to overcome a filibuster.\n\nFollow updates on the shooting in Uvalde, Texas: https://t.co/yUaf55uoqK https://t.co/wLRVEqk6HC",
  "data/tweet-nytimes/2022/5/1529296235676454913.json": "A shaken and emotional President Biden declared that it is “time to turn this pain into action” as he addressed the nation on Tuesday after the slaughter of 19 elementary school children and 2 adults in Uvalde, Texas.\nhttps://t.co/dCsHmwaceu",
  "data/tweet-nytimes/2022/5/1529248322304634880.json": "Senator Raphael Warnock won the Democratic nomination for Senate in Georgia. He’ll seek a full term in a fall campaign with high stakes for the chamber. https://t.co/vybnwfck2E",
  "data/tweet-nytimes/2022/5/1529308797944184834.json": "Nearly a decade later, while watching the death toll rise after Tuesday’s shooting at Robb Elementary School in Uvalde, Texas, one father of a Sandy Hook victim felt defeated. “I guess it’s something in society we know will happen again, over and over.” https://t.co/5stg4ZSSAy",
  "data/tweet-nytimes/2022/5/1529326437492203520.json": "May 24: Uvalde, Texas\nMay 14: Buffalo\n\nThe massacre in Uvalde, in which at least 19 children and two adults were killed, was the deadliest mass shooting in the U.S. this year. It happened just 10 days after 10 people were killed in a Buffalo supermarket. https://t.co/P2fbtzaWyW",
  "data/tweet-nytimes/2022/5/1529379265736757249.json": "Steve Kerr, the coach of the Golden State Warriors, made a forceful plea for gun control measures before Game 4 of the NBA’s Western Conference finals against the Dallas Mavericks.\n \nFollow updates on the shooting at Robb Elementary School in Texas. https://t.co/O2WRrAy9vm https://t.co/hQ1VDUbcl1",
  "data/tweet-nytimes/2022/5/1529332281369845760.json": "Brad Raffensperger, the Republican who defied Donald Trump in 2020 and earned his wrath, defeated Jody Hice to win Georgia’s secretary of state primary. https://t.co/4nGtoRURDJ",
  "data/tweet-nytimes/2022/5/1529401916735819778.json": "At least 19 children and two adults were killed in the mass shooting at an elementary school in Uvalde, Texas, on Tuesday, making it the second-deadliest school shooting on record in the U.S. https://t.co/YuW2zDH0Fg https://t.co/zoBGe2vUwY",
  "data/tweet-nytimes/2022/5/1529421790476439554.json": "After a mass shooting left 51 dead in 2019, New Zealand sprang to action, quickly banning most semi-automatic weapons and launching a buyback scheme.\n\nJacinda Ardern, the country’s prime minister, said the response was “pragmatic.”\nhttps://t.co/k7zyPdHjbW https://t.co/F9QOWn1Cqj",
  "data/tweet-nytimes/2022/5/1529192019410698240.json": "Southern Baptist leaders are planning to release the names of hundreds of ministers and church workers accused of sexual abuse after a bombshell report revealed the existence of the secret list. https://t.co/HFmmXPtRnm",
  "data/tweet-nytimes/2022/5/1529428338091122688.json": "Within hours of the Uvalde shooting, the Senate majority leader, Chuck Schumer, moved to clear the way to force votes on legislation that would strengthen background checks for gun buyers, moving to revive measures that Republicans have blocked in the past.https://t.co/AVXbDEUW95",
  "data/tweet-nytimes/2022/5/1529364180473892864.json": "The front page of The New York Times for May 25, 2022.\n\nFollow our updates on the shooting at Robb Elementary School in Uvalde, Texas: https://t.co/h7HlnHyvd5 https://t.co/atvROP49S7",
  "data/tweet-nytimes/2022/5/1529434614917484544.json": "Amerie Jo Garza, 10, was among the victims of the Robb Elementary School shooting in Uvalde, Texas.\n\nShe was “full of life, a jokester, always smiling,” her father said.\nhttps://t.co/LPHH00oahY",
  "data/tweet-nytimes/2022/5/1529432135903453184.json": "The FBI released data showing a rapidly escalating pattern of public shootings in the U.S. on Monday, one day before the massacre in Uvalde, Texas.\n\nThe bureau identified 61 “active shooter” attacks in 2021, the highest annual total since 2017.\nhttps://t.co/PJhSEigCjl",
  "data/tweet-nytimes/2022/5/1529445954348253186.json": "May 24: Uvalde, Texas\nMay 14: Buffalo\n\nThe massacre in Uvalde, in which at least 19 children and two adults were killed, was the deadliest mass shooting in the U.S. this year. It happened just 10 days after 10 people were killed in a Buffalo supermarket. https://t.co/rXoiXLsjac",
  "data/tweet-nytimes/2022/5/1529457276683173888.json": "Global leaders responded to the shooting in Uvalde, Texas, with dismay, heartbreak and calls for action to end the violence.\n\nPresident Volodymyr Zelensky of Ukraine said he was “deeply saddened by the news of the murder of innocent children.”\nhttps://t.co/iSMX7di9Uc https://t.co/GJJqQamtPP",
  "data/tweet-nytimes/2022/5/1529473643771740160.json": "Kate Moss, a former girlfriend of Johnny Depp, testified on Wednesday in his defamation case against his ex-wife Amber Heard to rebut a rumor. “He never pushed me, kicked me or threw me down any stairs,” Moss said over a video call.\nhttps://t.co/AtWkpqn5UJ",
  "data/tweet-nytimes/2022/5/1529467350063403009.json": "While watching the death toll rise after Tuesday’s shooting at Robb Elementary School in Uvalde, Texas, Neil Heslin, the father of a Sandy Hook victim, felt defeated.\n\n“It’s almost like an instant replay of Sandy Hook,” he said. https://t.co/CMniF1EU3T https://t.co/fbpqBNJzKt",
  "data/tweet-nytimes/2022/5/1529497537769623552.json": "The death toll continues to climb in the mass shooting at Robb Elementary in Uvalde, Texas, on Tuesday, but already it is the second-deadliest shooting at an elementary, middle or high school on record in the U.S. https://t.co/lSxmgi0d56 https://t.co/fl64tcQCGQ",
  "data/tweet-nytimes/2022/5/1529153420661346308.json": "Breaking News: President Biden is set to issue an executive order aimed at reforming federal policing on Wednesday, the two-year anniversary of George Floyd’s death. https://t.co/17ApeY3oea",
  "data/tweet-nytimes/2022/5/1529520222956306432.json": "Pope Francis said he was \"heartbroken\" by the shooting at Robb Elementary in Uvalde, Texas, where 19 children and two teachers were killed. \"It’s time to say enough to the indiscriminate circulation of weapons,\" he said. https://t.co/nLoX6s3aaQ https://t.co/e9IXlK3qSt",
  "data/tweet-nytimes/2022/5/1529530290493849600.json": "Beto O’Rourke, who is running for governor of Texas, interrupted Gov. Greg Abbott of Texas's news conference in Uvalde and was escorted out after shouting ensued from state officials. “You’re doing nothing,\" O'Rourke said. “This is totally predictable.” https://t.co/lwOEuEGOqI",
  "data/tweet-nytimes/2022/5/1529516858805723138.json": "Breaking News: The House committee investigating Jan. 6 has heard accounts of Donald Trump reacting approvingly to chants calling for the hanging of Mike Pence. https://t.co/3YaSaaLaoS",
  "data/tweet-nytimes/2022/5/1529534032735883264.json": "Beto O’Rourke, who is running for governor of Texas, was escorted out of Gov. Greg Abbott's news conference after he accused Republicans of “doing nothing” to address gun violence. Someone on stage with the governor shouted expletives at O’Rourke. https://t.co/XTwk7y3Gg5 https://t.co/yeJWZL8WiD",
  "data/tweet-nytimes/2022/5/1529541577370226691.json": "The night before the Uvalde shooting, Jailah Silguero, 10, told her father that she didn’t want to go to school the next day. “It’s always been a fear of mine to lose a kid,” he said, crying. \n\nHere’s what we know about the victims so far. https://t.co/GzxhSplo6L https://t.co/VzNKP7hoGa",
  "data/tweet-nytimes/2022/5/1529545359554486272.json": "Just days before the recent mass shootings in Texas and New York, both committed by 18-year-olds, a federal appeals court struck down a California law that banned the sale of some semiautomatic weapons to people under 21. https://t.co/dY6DVtiWyc",
  "data/tweet-nytimes/2022/5/1529513846997655552.json": "Breaking News: The Justice Department is investigating the role of pro-Trump lawyers, including Rudy Giuliani, in a plan to put forward alternate electors to overturn the 2020 election. https://t.co/7i1LKJNvT7",
  "data/tweet-nytimes/2022/5/1529570511184855040.json": "Beto O’Rourke, who is running for governor of Texas, interrupted a news conference hosted by Gov. Greg Abbott on Wednesday and accused Republicans of \"doing nothing\" to address gun violence in the aftermath of the Uvalde school shooting. https://t.co/SyMyQbynnA https://t.co/vf2hTzzgOF",
  "data/tweet-nytimes/2022/5/1529573042367737862.json": "Josh Duggar, a onetime star of the TLC reality show \"19 Kids and Counting,\" about a large family guided by conservative Christian values, was sentenced to more than 12 years in prison on Wednesday for downloading child sexual abuse imagery. https://t.co/jjkHZt9830",
  "data/tweet-nytimes/2022/5/1529586888075616256.json": "The gunman who killed 19 children and two teachers at Robb Elementary was inside the school for roughly an hour before a tactical unit from the Border Patrol shot and killed him, according to the director of the Texas Department of Public Safety. https://t.co/6ckNaUc10j",
  "data/tweet-nytimes/2022/5/1529603227951501312.json": "Jackie Cazares and Annabelle Rodriguez were cousins in the same classroom at Robb Elementary School. Amerie Jo Garza loved Play-Doh. And Xavier Lopez made the honor roll on the day he was killed.\n\nHere’s what we know about the victims so far. https://t.co/0rUzt1Qbmg https://t.co/nMk4uUr21f",
  "data/tweet-nytimes/2022/5/1529537843432931328.json": "In Opinion\n\n“The United States must treat the easy access to semiautomatic weapons as the national security threat it is,” writes Mary McCord, a former U.S. national security official, in a guest essay. https://t.co/rd3ep8Uzr6",
  "data/tweet-nytimes/2022/5/1529568041574481921.json": "Parents waiting in agony for news about their children were asked by authorities to provide DNA samples, suggesting that some of the 19 children who were killed in the Uvalde shooting may have been so severely wounded that they were difficult to identify. https://t.co/2J9MJc6zpu",
  "data/tweet-nytimes/2022/5/1529481190381690881.json": "Donald Trump barreled into Georgia vowing to marshal voters against his enemies and punish Republicans who crossed him in 2020. Instead, Georgia voters punished him for meddling in their state. https://t.co/1Hv6ZPpO9b",
  "data/tweet-nytimes/2022/5/1529478340947632128.json": "Breaking News: In a major breakthrough, scientists used a technique called quantum teleportation to send data across three physical locations, taking a significant step toward the computer network of the future. https://t.co/LXYcKe7DBH",
  "data/tweet-nytimes/2022/5/1529630919014944768.json": "Gov. Kevin Stitt of Oklahoma signed a bill into law on Wednesday that bans nearly all abortions starting at fertilization. The new law, expected to take effect immediately, is the most restrictive abortion ban in the U.S.\nhttps://t.co/P7cB0qmpsn",
  "data/tweet-nytimes/2022/5/1529615827326099456.json": "Joe Costilla extended his arms and allowed George Rodriguez to fall out of the truck and into his hug. “I lost two,” Rodriguez said in between sobs. “My grandson and a niece. I lost two.”\n\n“I know, I know,” his friend responded. “We lost our cousin, too.” https://t.co/479uas1hCk",
  "data/tweet-nytimes/2022/5/1529575558538985473.json": "La noche anterior al tiroteo en Uvalde, Jailah Silguero, de 10 años, le dijo a su papá que no quería ir a la escuela al día siguiente. Jailah fue una las 21 personas asesinadas el martes en Texas. \n\nEsto es lo que sabemos sobre ellas. https://t.co/zeFco03yOU https://t.co/Q9ePmXyj8T",
  "data/tweet-nytimes/2022/5/1529666159745937408.json": "The front page of The New York Times for May 26, 2022.\n\nFollow our updates on the school shooting in Uvalde, Texas. https://t.co/yZQA0TuQL0 https://t.co/ldwxNlQh07",
  "data/tweet-nytimes/2022/5/1529668680019324929.json": "Honor roll students, two cousins, a teacher who brought the neighborhood together: Here’s what we know about the victims of the school shooting in Uvalde, Texas.\nhttps://t.co/vmntP9HheM https://t.co/673o4mPrb6",
  "data/tweet-nytimes/2022/5/1529341507576152065.json": "The U.S. is in the middle of a gun-buying boom that shows no sign of letting up as the annual number of firearms manufactured has nearly tripled since 2000. https://t.co/f4qeuBovGi",
  "data/tweet-nytimes/2022/5/1529698863363276800.json": "Irma Garcia, a teacher, was killed in the school shooting in Uvalde, Texas. She was like a \"second mom\" to her students, her nephew said.\n\n\"She’s always been optimistic about everything, and just so loving with the people in her life.\" https://t.co/c6pkxBr33W",
  "data/tweet-nytimes/2022/5/1529653568571047936.json": "A mother recalled Eva Mireles, a teacher at Robb Elementary School who was killed in the shooting in Uvalde, Texas, as transformational in her daughter's life. “She was just above and beyond as far as teachers go.”\nhttps://t.co/g9Xe8h2jSs",
  "data/tweet-nytimes/2022/5/1529688804545765381.json": "Britain, Australia, Canada, New Zealand, Norway: All these countries had a culture of gun ownership, and they all tightened restrictions after mass shootings.\n\nOnly the U.S. has so consistently refused to reform gun laws, Max Fisher writes. https://t.co/Vfb1I0Swhk",
  "data/tweet-nytimes/2022/5/1529613326426288129.json": "In the aftermath of Tuesday’s school massacre in Uvalde, Texas, where a gunman killed 19 children and two teachers, Senator Ted Cruz remained unapologetic in his broad opposition to gun control measures. https://t.co/xS92oY1MIJ",
  "data/tweet-nytimes/2022/5/1529673722235322369.json": "Jimmy Carter, at 97, is stepping into a big environmental fight over a small road in Alaska. At stake is the future of a law that the 39th president called one of his highest achievements. https://t.co/K11KQkPXrL",
  "data/tweet-nytimes/2022/5/1529710938852556800.json": "After the mass shooting in Uvalde, Texas, The New York Times asked all 50 Republicans in the Senate whether they would support measures to strengthen background checks for gun buyers.\n\nHere's where they stand. https://t.co/qqYJLCNdVm",
  "data/tweet-nytimes/2022/5/1529851126950027264.json": "Parents of students who were trapped inside Robb Elementary School furiously urged police to storm the school sooner, according to a witness who was there on the day of the shooting. \"The dads were saying, 'Give me the vest, I’ll go in there!'\" https://t.co/TXGQpkMLlv"
}