{
  "data/tweet-nytimes/2022/7/1542681919703470083.json": "Donald Trump’s organization has paid or promised to pay legal fees for Jan. 6 witnesses, raising concerns about efforts to sway their testimony. https://t.co/mJV5Geu9m9",
  "data/tweet-nytimes/2022/7/1542734799814774789.json": "The dangers of climate change are mounting so rapidly that they could soon overwhelm the ability of both nature and humanity to adapt unless greenhouse gas emissions are quickly reduced, according to a UN report by 270 researchers from 67 countries. https://t.co/JvRrFLKJwv",
  "data/tweet-nytimes/2022/7/1542855605936848896.json": "New York City is creating the first mobile testing units in the U.S. that will allow people who test positive for the coronavirus to immediately receive for free the antiviral treatment Paxlovid. https://t.co/a3uzndOwPW",
  "data/tweet-nytimes/2022/7/1542883577683124224.json": "New Zealand's government said that the Proud Boys' involvement in the Jan. 6 attack on the U.S. Capitol was \"consistent with the definition of a terrorist act.\" It is now illegal for New Zealanders to participate in or support the group's activities. https://t.co/tZsKa2u2us",
  "data/tweet-nytimes/2022/7/1542829156139802625.json": "The WNBA star Brittney Griner arrived at a Russian court for the start of a trial on drug charges. Legal experts said it was all but certain to end in a conviction.\n \nFollow updates. https://t.co/sMFmTDBJ5L https://t.co/MVZflzq2gP",
  "data/tweet-nytimes/2022/7/1542968826714886145.json": "The Supreme Court has moved relentlessly to the right, issuing blockbuster decisions on cases from abortion to climate change that will transform U.S. life. By one standard measurement, the term that ended this week was the most conservative since 1931. https://t.co/Cjeixw0dIe https://t.co/0kksaof87y",
  "data/tweet-nytimes/2022/7/1542825370373832707.json": "Kaleem Ullah Khan has spent a lifetime grafting hundreds of types of mango onto a 120-year-old tree in northern India. His decades of experimentation have earned him fame as the “mango man.” https://t.co/5uOrqk2cMF https://t.co/4lK6txxzLf",
  "data/tweet-nytimes/2022/7/1543023273604153345.json": "Breaking News: New York lawmakers passed a bill prohibiting firearms in many public places, a week after the Supreme Court struck down a state gun control law. https://t.co/Wbo0ELlAdg",
  "data/tweet-nytimes/2022/7/1542952657530355712.json": "Two days after the Supreme Court overturned Roe v. Wade, a 27-year old woman, T., delivered her fourth child, Cason. \n\nBorn after his mother fled domestic abuse and was denied an abortion, he is among the first of many post-Roe babies expected in Texas. https://t.co/sNUqHyKXEB",
  "data/tweet-nytimes/2022/7/1543031726741639168.json": "The most advanced weapons that the U.S. has so far supplied Ukraine, including rocket launchers, are making an impact in their first days on the battlefield, destroying Russian ammunition depots and command centers, American and Ukrainian officials say. https://t.co/erki99efnB",
  "data/tweet-nytimes/2022/7/1542941132966985729.json": "This week's testimony by 26-year-old Cassidy Hutchinson pulled back the curtain on Washington: a capital helmed largely by the geriatric set, fueled by recent college graduates — many of whom have a front-row seat to moments that can define the country. https://t.co/XsM5QM51oY",
  "data/tweet-nytimes/2022/7/1542921504203186177.json": "New York City suddenly removed its high profile, color-coded coronavirus alert system this week — just as newer Omicron subvariants are fueling another rise in cases and hospitalizations. https://t.co/HdMSEeUi4K",
  "data/tweet-nytimes/2022/7/1542987688445353986.json": "\"Cacio e pepe\" can be a verb, as evidenced by this cacio e pepe'd corn on the cob recipe. https://t.co/K2J8zb4bfz https://t.co/3Xia7hKHQA",
  "data/tweet-nytimes/2022/7/1543224249984421892.json": "Experts believe that a woolly mammoth unearthed last month in the Klondike gold fields of the Yukon of Canada had been preserved in the frozen ground for more than 30,000 years. https://t.co/JBRTEXcT6x"
}