{
  "data/tweet-wsj/2021/12/1466146349645283332.json": "The Women's Tennis Association said it is suspending all of its tournaments in China because of concerns over the safety of player Peng Shuai, after an allegation of sexual assault against a former government official appeared on her social-media account https://t.co/WwCU20jgtv",
  "data/tweet-wsj/2021/12/1466121476977745920.json": "Breaking: The first confirmed U.S. case of the Omicron variant was reported in California, in a traveler returning from a trip to South Africa on Nov. 22 https://t.co/fnb3r9C3r6",
  "data/tweet-wsj/2021/12/1466067099491655690.json": "“I am very lucky in my life that I have benefited from second chances, and I am aware that other people don’t even get first chances.” Oscar-winning director and actor Ben Affleck on feeling grateful for his imperfect life: https://t.co/F7w2xoMaeF",
  "data/tweet-wsj/2021/12/1466016753079754752.json": "Hedge-fund billionaire and New York Mets owner Steven A. Cohen is backing a startup that wants to let investors trade stocks 24 hours a day, seven days a week https://t.co/kd1Vs0K3Da",
  "data/tweet-wsj/2021/12/1465995373068050436.json": "Some alumni are pushing back against \"intellectual monocultures\" at their schools, withholding donations. \"This is a battle for our culture and, in many ways, for Western civilization.\" https://t.co/FKznZm6Azr",
  "data/tweet-wsj/2021/12/1465953845452976130.json": "One of the hottest real-estate markets right now is in the metaverse, where property sales in digital worlds like Sandbox and Decentraland are setting records https://t.co/SrN69Vga7t",
  "data/tweet-wsj/2021/12/1465938753437016064.json": "Americans saw China as the nation's top foe and their trust in the U.S. military dropped, according to the first major national-security survey conducted since the U.S. withdrawal from Afghanistan https://t.co/cPxvlbJ32e",
  "data/tweet-wsj/2021/12/1465920630298226689.json": "Take an early look at the front page of The Wall Street Journal https://t.co/AYzMuK9PCj https://t.co/GnBl8rff6b",
  "data/tweet-wsj/2021/12/1465893464915300357.json": "The Omicron variant may lead to more infections but vaccinated people will likely remain protected from severe disease, vaccine maker BioNTech's founder said https://t.co/NH2kio4LVA",
  "data/tweet-wsj/2021/12/1465885907224084482.json": "A federal judge has issued a temporary nationwide block against a Biden administration mandate that millions of healthcare workers get vaccinated against Covid-19 starting next week https://t.co/i4vZyqIxTt",
  "data/tweet-wsj/2021/12/1465859470903418884.json": "Twitter banned users from sharing photos and videos of another person without their permission, a move aimed at improving privacy and security https://t.co/SzMK4nRfgb",
  "data/tweet-wsj/2021/12/1465848184299790344.json": "Some alumni are pushing back against \"intellectual monocultures\" at their schools, withholding donations. \"This is a battle for our culture and, in many ways, for Western civilization.\" https://t.co/BOOgdWtr4s",
  "data/tweet-wsj/2021/12/1465833333171097603.json": "CNN suspended Chris Cuomo indefinitely after newly released records detailed his efforts to help brother Andrew Cuomo respond to sexual-misconduct allegations https://t.co/cq8kiBTsNU",
  "data/tweet-wsj/2021/12/1466157606620344323.json": "Democrat Stacey Abrams said she would run for governor of Georgia in 2022, her second bid after losing a close race in 2018 https://t.co/QkZ4krY1UA",
  "data/tweet-wsj/2021/12/1466161448183336971.json": "Bad Bunny was Spotify’s most listened-to artist in 2021, making him the platform's No. 1 streamed artist two years in a row. Taylor Swift, BTS, Drake and Justin Bieber rounded up the top-five streamed artists in Spotify's 2021 Wrapped list. https://t.co/QDqCck628X",
  "data/tweet-wsj/2021/12/1466176554921345024.json": "Square, the financial-services company co-founded and led by former Twitter chief Jack Dorsey, is changing its corporate name to Block https://t.co/7RiFmMYuAe",
  "data/tweet-wsj/2021/12/1466126211810217985.json": "Comedian Trevor Noah will return to host the Grammy Awards early next year https://t.co/PK1Bn3r7gF",
  "data/tweet-wsj/2021/12/1466199212715089924.json": "Federal judges would have to speed disclosure of stock trades and publish their financial-disclosure reports online for the first time under a bipartisan bill overwhelmingly passed by the U.S. House Wednesday https://t.co/t0kgS5Kjnu",
  "data/tweet-wsj/2021/12/1466237220176728071.json": "Square, the financial-services company co-founded and led by former Twitter chief Jack Dorsey, is changing its corporate name to Block https://t.co/LlfPc8SOUk",
  "data/tweet-wsj/2021/12/1466244498363719687.json": "CNN anchor Chris Cuomo said being suspended by the network was \"embarrassing,\" addressing the controversy over his role in the sexual-harassment scandal involving his brother, former New York Gov. Andrew Cuomo https://t.co/944CugHY7H",
  "data/tweet-wsj/2021/12/1465984034471923720.json": "CNN suspended Chris Cuomo indefinitely after newly released records detailed his efforts to help brother Andrew Cuomo respond to sexual-misconduct allegations https://t.co/lC8wkZ0KGt",
  "data/tweet-wsj/2021/12/1466267148670619650.json": "Starting base salary is $200,600 for a software engineer at Amazon in Colorado. We sifted through hundreds of job listings to understand how companies are paying workers. https://t.co/gHWjEzTHmf",
  "data/tweet-wsj/2021/12/1466078903139766273.json": "Four people were injured after a decades-old bomb dropped from an aircraft in World War II exploded during construction works near the main train station in Munich on Wednesday, authorities said https://t.co/JM2Dzb3Gx2",
  "data/tweet-wsj/2021/12/1466240746378440704.json": "“I am very lucky in my life that I have benefited from second chances, and I am aware that other people don’t even get first chances.” Ben Affleck talks Jennifer Lopez, fame, infamy, addiction and finally getting satisfaction—or as close to it as he’ll get https://t.co/s8GwH2vqD0",
  "data/tweet-wsj/2021/12/1466293562954375169.json": "Jeff Bezos said the National Enquirer tried to use embarrassing photos to extort him over his affair, and his team suggested the details came from a phone hack. Probes by the U.S. government haven't backed those claims. https://t.co/KktDNKQsEV",
  "data/tweet-wsj/2021/12/1466347034017996802.json": "Biden will require travelers to the U.S. to provide a negative Covid test within a day of departure and will extend transit mask rules to slow Omicron's spread https://t.co/t9yxEshGEl",
  "data/tweet-wsj/2021/12/1466367050297880578.json": "Glaxo’s antibody treatment was found to be effective against Omicron, setting it apart from therapies that appear to work less well against the coronavirus variant https://t.co/qY2TUC1zlL",
  "data/tweet-wsj/2021/12/1466278502014099457.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/8x6btK5IwG",
  "data/tweet-wsj/2021/12/1466410610514702337.json": "Chinese authorities protested the departure of international women’s tennis amid concerns over the safety of star player Peng Shuai, while at the same time moving to suffocate a brief flurry of online chatter about the news https://t.co/fABN4ETUAu",
  "data/tweet-wsj/2021/12/1466414377892986885.json": "Democrats and Republicans reached an agreement to extend government funding through Feb. 18, the first step toward avoiding a shutdown this weekend https://t.co/EkZwDH83ek",
  "data/tweet-wsj/2021/12/1466425687296851970.json": "The U.S. and Mexico reached a deal to restart the Trump-era Remain in Mexico policy. Asylum seekers will be sent back while their claims are considered. https://t.co/Wofiq7S5MC",
  "data/tweet-wsj/2021/12/1466421933709398031.json": "Scientists in South Africa tracking the spread of Omicron say they are seeing a rise in coronavirus reinfections in people who had recovered from Covid-19, suggesting previous infection provides reduced protection against the new variant https://t.co/xRPoEk35UM",
  "data/tweet-wsj/2021/12/1466478550828167177.json": "China has long dispatched pandas to zoos around the world in gestures of goodwill. Taiwan's scaly pangolin now wants a shot at center stage. https://t.co/L3ytuDI2by",
  "data/tweet-wsj/2021/12/1466502474508947467.json": "Meghan Markle claimed victory in her legal battle against a British tabloid that published a letter the former actress sent to her father https://t.co/Ucm1J0Mtj5",
  "data/tweet-wsj/2021/12/1466353991189778434.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/K8JGgzQ1fd",
  "data/tweet-wsj/2021/12/1466550513240059904.json": "Jeffrey Epstein and Ghislaine Maxwell had a strict rule for employees at his Palm Beach, Fla., estate: “See nothing, hear nothing, say nothing.” A former staff member described working on the estate in Maxwell’s sex-trafficking trial Thursday. https://t.co/5e6b4KgTZi",
  "data/tweet-wsj/2021/12/1466557875480932354.json": "China has long dispatched pandas to zoos around the world in gestures of goodwill. Taiwan's scaly pangolin now wants a shot at center stage. https://t.co/HkEghnSMKp",
  "data/tweet-wsj/2021/12/1466600585684307971.json": "The Senate passed an extension of government funding and sent the bill to Biden, averting a shutdown after resolving a standoff over vaccine rules https://t.co/h0v19cdVpR",
  "data/tweet-wsj/2021/12/1466516299400585218.json": "Scientists in South Africa tracking the spread of Omicron say they are seeing a rise in reinfections in people who had recovered from Covid-19, suggesting previous infection provides reduced protection against the new variant https://t.co/a2CksCF54G",
  "data/tweet-wsj/2021/12/1466655959833587716.json": "\"They look like living conifer cones.\" The scaly, ant-eating pangolin is trying to usurp the giant panda as the animal kingdom's goodwill ambassador. https://t.co/GdXRuOVhT0",
  "data/tweet-wsj/2021/12/1466606898615140357.json": "A  roughly 40-acre Bahamas private island known as Little Pipe Cay, last listed for $85 million in 2018, is back on the market for $100 million https://t.co/EMqM3PgDnR",
  "data/tweet-wsj/2021/12/1466588057335914498.json": "Max Martin, the Swedish songwriter-producer behind hits by Britney Spears, Katy Perry and Taylor Swift, is tied with George Martin of Beatles fame for the most No. 1 hits among producers—and is poised to break the record https://t.co/WmhaWVtJbk",
  "data/tweet-wsj/2021/12/1466418158349213705.json": "Selected by the editors of the @WSJBooks pages, here are this year’s most distinguished works of fiction and nonfiction https://t.co/CG1HMeKwx0",
  "data/tweet-wsj/2021/12/1466822777349021700.json": "Breaking: Prosecutors charged the parents of Ethan Crumbley, the Michigan high-school student accused of killing four classmates this week, with four counts of involuntary manslaughter in connection with the gun used in the shootings https://t.co/seiUxCfGVF",
  "data/tweet-wsj/2021/12/1466837154680692736.json": "At least 64 out of 120 fully vaccinated people who attended a Christmas party in Oslo, Norway, tested positive for the Omicron variant, providing an early data point on the ease through which it spreads between vaccinated people https://t.co/R0qbOs4yg4",
  "data/tweet-wsj/2021/12/1466846593739595783.json": "At least 64 out of about 120 fully vaccinated people who attended a  party in Norway tested positive for Covid-19, with at least 13 confirmed to have the Omicron variant (corrects a now-deleted tweet that said 64 people tested positive for the variant) https://t.co/joUHnKSvWW https://t.co/R4jkAjEKhG",
  "data/tweet-wsj/2021/12/1466863574693912586.json": "Turkey's president has taken control of its economy. The lira is collapsing, protesters are in the streets. \"Everyone here is outraged.” https://t.co/QJqU3J0gwG",
  "data/tweet-wsj/2021/12/1466765449148997634.json": "A total solar eclipse is happening Saturday. But only a few thousand people—and penguins—will see it in-person. Here's how to watch it if you can't cruise around the South Orkney Islands. https://t.co/yOLUsAZcGG",
  "data/tweet-wsj/2021/12/1466984376403648512.json": "Russian President Vladimir Putin is amassing a force expected to total 175,000 troops near Russia’s border with Ukraine, giving him the capability for a potential invasion by early 2022, according to Biden administration officials https://t.co/9HGE2K0CMO",
  "data/tweet-wsj/2021/12/1467008285568118787.json": "Apple’s vision for life after the iPhone is coming into view https://t.co/P4bOWA9A1P",
  "data/tweet-wsj/2021/12/1466874911801106445.json": "From @WSJopinion: Infectious disease will always be with us, writes @EVKontorovich. It cannot become an excuse to give the federal government carte blanche to control the lives of citizens. https://t.co/x7nWHBDvXz",
  "data/tweet-wsj/2021/12/1467001141170950146.json": "China has approved the creation of one of the world’s largest rare-earths companies to aim to maintain its dominance in the global supply chain of the strategic metals https://t.co/4C0GiKsLZp",
  "data/tweet-wsj/2021/12/1466746591864307714.json": "Doctors say early evidence suggests Omicron is more transmissible and presents higher reinfection risk, but more time is needed to assess its severity. https://t.co/ZVBAWMaXwb",
  "data/tweet-wsj/2021/12/1466988145384337416.json": "\"They look like living conifer cones.\" The scaly, ant-eating pangolin is trying to usurp the giant panda as the animal kingdom's goodwill ambassador. https://t.co/G50FMAhoFp",
  "data/tweet-wsj/2021/12/1467059861812826113.json": "Evidence is building that immunity from Covid-19 infection is at least as strong as that from vaccination. Scientists are divided on the implications for vaccine policy. https://t.co/ceZEPLmcwD",
  "data/tweet-wsj/2021/12/1467054870511423493.json": "The parents of the Michigan high-school shooting suspect were found and arrested, police said, hours after they were charged with involuntary manslaughter https://t.co/s60atCpSVV",
  "data/tweet-wsj/2021/12/1467033462158864391.json": "Biden will require travelers to the U.S. to provide a negative Covid test within a day of departure and will extend transit mask rules to slow Omicron's spread https://t.co/N3y7HOZTHH",
  "data/tweet-wsj/2021/12/1467116535655370755.json": "French President Emmanuel Macron traveled to Saudi Arabia to meet Crown Prince Mohammed bin Salman, who since the 2018 murder of Jamal Khashoggi hasn’t visited the U.S. or Europe and has been largely shunned by Western leaders https://t.co/IGIrVvc6tX",
  "data/tweet-wsj/2021/12/1466844720169205780.json": "The Women’s Tennis Association said that its largest Chinese sponsor iQiyi, a Netflix-like streaming platform, asked to be removed from the WTA’s website as the organization spoke out about Peng Shuai https://t.co/nGJqwQBQtX",
  "data/tweet-wsj/2021/12/1467195758524997632.json": "The Omicron variant may lead to more infections but vaccinated people will likely remain protected from severe disease, vaccine maker BioNTech's founder said https://t.co/SNFjz8o13E",
  "data/tweet-wsj/2021/12/1466927784312385537.json": "A total solar eclipse is happening Saturday. But only a few thousand people—and penguins—will see it in-person. Here's how to watch it if you can't cruise around the South Orkney Islands. https://t.co/oP2VGiBzxX",
  "data/tweet-wsj/2021/12/1467222209299107845.json": "Some alumni groups, driven by politically moderate or conservative baby boomers, say college campuses have been overtaken by progressive groupthink—and they’re not sending any more checks until something is done about it  https://t.co/6f8Inrppzf",
  "data/tweet-wsj/2021/12/1467173125074862086.json": "A woman using the pseudonym Jane testified in federal court that Jeffrey Epstein and Ghislaine Maxwell gave her money, bought her gifts including underwear and repeatedly sexually abused her beginning when she was 14 https://t.co/S8qFyvVNvf",
  "data/tweet-wsj/2021/12/1467264702891888640.json": "CNN fired Chris Cuomo for his role in the sexual-harassment scandal that led to the resignation of his brother, former New York Gov. Andrew Cuomo https://t.co/30R4zHktSz",
  "data/tweet-wsj/2021/12/1466969286539362305.json": "From @WSJopinion: The Biden administration at some point will realize that its political fortunes are tied to a virus that isn’t going anywhere, writes @KimStrassel. The longer it takes to make a clean break, the likelier it is to succumb to Covid. https://t.co/cTglXdmoip",
  "data/tweet-wsj/2021/12/1466886237197848577.json": "CNN anchor Michael Smerconish will temporarily fill in for Chris Cuomo next week, the cable network said https://t.co/DBkTBAiDbX",
  "data/tweet-wsj/2021/12/1467241073273671682.json": "Apple’s vision for life after the iPhone is coming into view, writes @mims https://t.co/WLDWQuDiPM",
  "data/tweet-wsj/2021/12/1467214670499037187.json": "From @WSJopinion: Lockdowns don't stop the virus, and vaccine mandates are hurting hospitals. The Omicron variant is no excuse for more of either one. https://t.co/BfiC0cEOGY",
  "data/tweet-wsj/2021/12/1467131591658983433.json": "Tesla came to China with big plans. China had even bigger plans for Tesla. https://t.co/U1abEcEKKE",
  "data/tweet-wsj/2021/12/1467320354817425415.json": "Adele said she will perform at a four-month long residency in Las Vegas early next year https://t.co/MmKm07OiUx",
  "data/tweet-wsj/2021/12/1467297745476194309.json": "“I am very lucky in my life that I have benefited from second chances, and I am aware that other people don’t even get first chances.” Ben Affleck talks Jennifer Lopez, fame, infamy, addiction and finally getting satisfaction—or as close to it as he’ll get https://t.co/1atjGnWGuQ",
  "data/tweet-wsj/2021/12/1467124059850907648.json": "Home buyers in high-cost areas of the U.S. will be able to borrow nearly $1 million for a mortgage loan backed by the government, a reflection of the rapid appreciation in home prices nationally https://t.co/p1NbM9KGMc",
  "data/tweet-wsj/2021/12/1467358101846339587.json": "The United Arab Emirates and Saudi Arabia are reopening diplomatic missions and restarting flights as they try to match Qatar’s sway in Taliban-ruled Afghanistan https://t.co/6NCptXOLFW",
  "data/tweet-wsj/2021/12/1467331649654472704.json": "Eighty years ago, Japanese submariner Kazuo Sakamaki took part in the surprise attack on Pearl Harbor—and became his country’s first prisoner of war. https://t.co/VUyo5uSJ95",
  "data/tweet-wsj/2021/12/1467410956829528064.json": "An explosion shook the area near Iran’s main nuclear-enrichment plant Saturday, prompting conflicting explanations from Iranian officials as Tehran engages in talks over its nuclear program https://t.co/daC3Y8XrfN",
  "data/tweet-wsj/2021/12/1467426065761157120.json": "The currency is collapsing, protestors are on the streets, and people are lining up for subsidized bread. Inside Turkey's economic turmoil. https://t.co/CsvPdZs5cA",
  "data/tweet-wsj/2021/12/1467450055107960832.json": "Tesla came to China with big plans. China had even bigger plans for Tesla. https://t.co/Ql7pbZRfIv",
  "data/tweet-wsj/2021/12/1467475108159791106.json": "Some alumni groups, driven by politically moderate or conservative baby boomers, say college campuses have been overtaken by progressive groupthink—and they’re not sending any more checks until something is done about it  https://t.co/n1goAMRqEu",
  "data/tweet-wsj/2021/12/1467471356182859788.json": "From @WSJopinion: We need a new, stronger model of public education that is based on evidence, centered on children, and built around achievement, excellence and accountability for all, writes @MikeBloomberg https://t.co/LRT94q1JYP",
  "data/tweet-wsj/2021/12/1467509140629057542.json": "Jeffrey Epstein's former pilot testified that Ghislaine Maxwell was intricately involved in the disgraced financier's daily life, managing household staff and flying with him on a private plane that flew former presidents and celebrities https://t.co/llztcnhRhy",
  "data/tweet-wsj/2021/12/1467505316392751110.json": "Hundreds of thousands of Americans are striking out on their own as consultants, retailers and small-business owners https://t.co/BhOFO3VWn1",
  "data/tweet-wsj/2021/12/1467388294463995905.json": "Containment was a winning strategy for the Cold War. It can also guide the U.S. in the long contest ahead with China, writes historian Hal Brands. https://t.co/OQwTPp85ZC",
  "data/tweet-wsj/2021/12/1467511591138734083.json": "A small study found a pattern of milder illness from the Omicron variant than in previous waves of Covid-19. The authors cautioned that it is too early to say for sure if the new strain is less virulent than its predecessors. https://t.co/eQoR2WDawX",
  "data/tweet-wsj/2021/12/1467538572190355459.json": "Breaking: Bob Dole, a fixture on the Washington scene for more than half a century and a national leader of the Republican Party, has died at 98 https://t.co/KXn0M5a3gX",
  "data/tweet-wsj/2021/12/1467490223210872833.json": "High inflation has been blamed on supply-chain bottlenecks, labor shortages and the effects of fiscal stimulus, but there’s another factor at work—a shift away from globalization https://t.co/IL4tbDvjKd",
  "data/tweet-wsj/2021/12/1467561960719986695.json": "Evidence is building that immunity from Covid-19 infection is at least as strong as that from vaccination. Scientists are divided on the implications for vaccine policy. https://t.co/GfdwboB3Mz",
  "data/tweet-wsj/2021/12/1467433591584047104.json": "At least 13 people were killed after the eruption of Mount Semeru, on the Indonesian island of Java https://t.co/SzI4msp9U4",
  "data/tweet-wsj/2021/12/1467555636586205199.json": "China wants to put its first Atlantic military base in Equatorial Guinea, U.S. intelligence shows. The prospect has set off alarm bells in Washington. https://t.co/y8qR9xehlO",
  "data/tweet-wsj/2021/12/1467546853600333828.json": "From @WSJopinion: The Biden administration at some point will realize that its political fortunes are tied to a virus that isn’t going anywhere, writes @KimStrassel. The longer it takes to make a clean break, the likelier it is to succumb to Covid. https://t.co/VdVRAGj8Mt",
  "data/tweet-wsj/2021/12/1467580795762139145.json": "Some alumni groups, driven by politically moderate or conservative baby boomers, say college campuses have been overtaken by progressive groupthink—and they’re not sending any more checks until something is done about it  https://t.co/9ZfWH9vT3w",
  "data/tweet-wsj/2021/12/1467633653895286792.json": "Bob Dole, a fixture on the Washington scene for more than half a century and a national leader of the Republican Party, died at 98 https://t.co/XlYeOqZzSJ",
  "data/tweet-wsj/2021/12/1467558164828762116.json": "U.S. workers handed in nearly 20 million resignations this spring and summer. \"Everybody quitting is saying, 'I became part of the Great Resignation.' \" https://t.co/9UqslINCYp",
  "data/tweet-wsj/2021/12/1467648755084271616.json": "New surveys from the U.S. Labor Department show exactly who is quitting—or thinking about quitting—as part of The Great Resignation: low-wage workers, employees of color and women not in management https://t.co/QqksO8dwkW",
  "data/tweet-wsj/2021/12/1467237283770286085.json": "An explosion shook the area near Iran’s main nuclear-enrichment plant late on Saturday, prompting conflicting explanations from Iranian officials as Tehran engages in talks with world powers over its nuclear program https://t.co/zlUZc0dSlv",
  "data/tweet-wsj/2021/12/1467652507937779716.json": "A New England Patriots linebacker and his wife turn NFL trades into investment opportunities #WSJWhatsNow https://t.co/bJXp6pWh35 https://t.co/cEHTEY2WCe",
  "data/tweet-wsj/2021/12/1467690310859993095.json": "“I am very lucky in my life that I have benefited from second chances, and I am aware that other people don’t even get first chances.” Ben Affleck talks Jennifer Lopez, fame, infamy, addiction and finally getting satisfaction—or as close to it as he’ll get https://t.co/R570DXyLPI",
  "data/tweet-wsj/2021/12/1467686504252194821.json": "Netflix announced its 2022 lineup, which includes new seasons of “Stranger Things” and “The Umbrella Academy” https://t.co/ydMlvGWmTl",
  "data/tweet-wsj/2021/12/1467720480488624129.json": "China wants to put its first Atlantic military base in Equatorial Guinea, U.S. intelligence shows. The prospect has set off alarm bells in Washington. https://t.co/hO08mBbRsY",
  "data/tweet-wsj/2021/12/1467753061087166465.json": "Myanmar’s Aung San Suu Kyi was found guilty and sentenced to four years in prison in the first verdicts in a raft of charges brought by the military https://t.co/pzaz55oIxU",
  "data/tweet-wsj/2021/12/1467595901942251520.json": "High inflation has been blamed on supply-chain bottlenecks, labor shortages and the effects of fiscal stimulus, but there’s another factor at work—a shift away from globalization https://t.co/ahBtzvLOC1",
  "data/tweet-wsj/2021/12/1467603481372598273.json": "Russia and India set to reinforce defense ties at a summit meeting, as the U.S. considers sanctions over New Delhi’s purchase of a Russian missile system https://t.co/KmoBtLlCGO",
  "data/tweet-wsj/2021/12/1467761996883968003.json": "How Elon Musk became a high-profile cheerleader of China's Communist Party https://t.co/IhbzquXPZi",
  "data/tweet-wsj/2021/12/1467864418302181383.json": "Breaking: New York City will require all private-sector workers to be fully vaccinated against Covid-19, Mayor Bill de Blasio said. The new mandate will go into effect Dec. 27. https://t.co/4vGlgF5kJa",
  "data/tweet-wsj/2021/12/1467818638505914369.json": "Myanmar’s Aung San Suu Kyi is sentenced to four years in prison  https://t.co/HLS0nhtyK0",
  "data/tweet-wsj/2021/12/1467879045010718723.json": "The Biden administration unveiled steps to combat corruption globally, including new rules on U.S. real-estate purchases to prevent money laundering https://t.co/8fnDdJSTqM",
  "data/tweet-wsj/2021/12/1467866447066058757.json": "The U.S. won't send officials to attend the coming Winter Olympics in Beijing. An announcement on the diplomatic boycott is expected this week. https://t.co/zF4x89X56K",
  "data/tweet-wsj/2021/12/1467913745431212035.json": "Toyota is investing $1.25 billion and creating 1,750 jobs with a new electric-vehicle battery plant in rural Randolph County, N.C. https://t.co/oTUnzQKjcM",
  "data/tweet-wsj/2021/12/1467924597324619779.json": "From @WSJopinion: Iran and Russia give every sign they don’t take President Biden seriously https://t.co/k2Mg1rhZmn",
  "data/tweet-wsj/2021/12/1467660107064479752.json": "The number of married couples who live apart is small but growing. Here’s how they say the arrangement helps their families and their relationships. https://t.co/doNp9uD85D",
  "data/tweet-wsj/2021/12/1467203325263331342.json": "Entrepreneurs are working to enable consumers to control and benefit from the personal data that the tech industry collects https://t.co/yM61Mzp9yG",
  "data/tweet-wsj/2021/12/1467890345975369728.json": "Jack in the Box is buying Del Taco Restaurants for $455 million, a deal that ties up two West Coast fast-food chains https://t.co/glSbReA02d",
  "data/tweet-wsj/2021/12/1468018009520611328.json": "Tesla and SpaceX founder Elon Musk speaks with WSJ’s @JoannaStern at #WSJCEOCouncil https://t.co/OiyO7UJuMz https://t.co/0xUmYBJH9b",
  "data/tweet-wsj/2021/12/1468041330647519240.json": "Millennials, feeling their mortality during Covid-19, start writing their wills. “It was a game-changer when my wife asked me if I’d want to be put on a ventilator if I needed one.” https://t.co/83vBl84PgW",
  "data/tweet-wsj/2021/12/1468067798660304897.json": "President Biden will warn Russia's Vladimir Putin not to invade Ukraine in a call scheduled Tuesday, officials said https://t.co/VhwEZLTIkl",
  "data/tweet-wsj/2021/12/1468093680087097344.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/fA0aW0ZKcp",
  "data/tweet-wsj/2021/12/1468048892482707458.json": "Apple’s vision for life after the iPhone is coming into view, writes @mims https://t.co/B0mrbPZrc8",
  "data/tweet-wsj/2021/12/1468181006444384260.json": "Watch: Investors are pouring money into the meme-based cryptocurrency Shiba Inu Coin, WSJ retail investing reporter Caitlin McCabe explains why  https://t.co/7UE5m3EZvt",
  "data/tweet-wsj/2021/12/1468188858210783241.json": "Saudi Arabia is running out of the ammunition to defend against drone and missile attacks from the Houthi rebels in Yemen, and is appealing to the U.S. and its Gulf and European allies for a resupply  https://t.co/vabKKjCkKg",
  "data/tweet-wsj/2021/12/1468057196588056582.json": "Disappearing court documents. Restricted access to data on ships and supplies. China closes off details about what’s happening inside the country. https://t.co/qzYQo1pM83",
  "data/tweet-wsj/2021/12/1467958294882959366.json": "Indian and Russian officials rejected American pressure to downgrade their close defense ties as the two countries’ leaders met in New Delhi and agreed to extend military technical cooperation for another decade https://t.co/Tv5I3uxMiQ",
  "data/tweet-wsj/2021/12/1468188541670891526.json": "“Honestly, I would just can this whole bill.” Tesla CEO Elon Musk criticized federal efforts meant to spur electric-vehicle adoption, including a bill that would boost incentives for buying battery-powered cars #WSJWhatsNow https://t.co/yeiEt1CcZt",
  "data/tweet-wsj/2021/12/1468198635804532742.json": "Evergrande didn’t make payments due on some U.S. dollar bonds before a final deadline expired Monday, people familiar with the matter said, potentially setting the stage for a massive default and one of the country’s largest-ever debt restructurings https://t.co/ZBPSAPLVdl",
  "data/tweet-wsj/2021/12/1468230078362537999.json": "From @WSJopinion: New York Mayor Bill de Blasio’s vaccine mandate for all workers is an infringement on liberty and a strike against the city, not the virus. https://t.co/6SXhsV218I",
  "data/tweet-wsj/2021/12/1468243478333181952.json": "U.S. Transportation Secretary Pete Buttigieg speaks with WSJ’s @catherine_lucey at #WSJCEOCouncil https://t.co/DJ68z02nZG",
  "data/tweet-wsj/2021/12/1468236385920458767.json": "Big wage increases are in store for next year. A new report shows companies budgeting the most for raises since 2008. https://t.co/7crjPLbYE2",
  "data/tweet-wsj/2021/12/1468240969636139011.json": "The governor of Hawaii declared a state of emergency as pounding rainfall hits the tropical islands, causing flooding and power outages in some places https://t.co/zJ3df6pliB",
  "data/tweet-wsj/2021/12/1468075318871314434.json": "From @WSJopinion: History can be cruel to candidates for President who lose, but Bob Dole’s contributions to American life far exceeded his failed campaigns for the White House https://t.co/MJM68exDPl",
  "data/tweet-wsj/2021/12/1468267838553174017.json": "Nobuo Matsubara still remembers being told in January 1942 that his brother, a Japanese navy ensign, had been killed in the attack on Pearl Harbor. It wasn’t true. But under the values of the time, the truth was even worse https://t.co/pjp3LmTax7",
  "data/tweet-wsj/2021/12/1468270367047356422.json": "CNN won’t pay anchor Chris Cuomo a severance after firing him amid revelations that he helped his brother, Andrew Cuomo, respond to allegations of sexual harassment, the network’s president told employees https://t.co/vvkpMSeilA",
  "data/tweet-wsj/2021/12/1468273358823477249.json": "Amazon Web Services, the cloud-computing unit of Amazon, appeared to be down for thousands of users Tuesday morning https://t.co/GYnmAfn1OO",
  "data/tweet-wsj/2021/12/1468309998220496900.json": "Rohingya refugees sued Facebook parent Meta Platforms for $150 billion, alleging the social-media platform perpetuated the genocide against the Muslim ethnic group in Myanmar https://t.co/3coTVUIHTj",
  "data/tweet-wsj/2021/12/1468054432059428867.json": "Actor Laura Dern, known for her roles in \"Big Little Lies,\" \"Little Women\" and \"Marriage Story,\" wakes up at 6:30 a.m. and makes an effort to not pick up her phone first thing. She meditates for a few minutes instead. https://t.co/R9wRqQCp8p",
  "data/tweet-wsj/2021/12/1468333639155032064.json": "U.S. voters are pessimistic about the economy and short on confidence in President Biden’s leadership, a new WSJ Poll finds, a warning for Democrats entering a midterm election year https://t.co/mtDVlcpYEQ",
  "data/tweet-wsj/2021/12/1468367242064760841.json": "A U.S. judge on Tuesday blocked the Biden administration’s Covid-19 vaccine mandate for employees of federal contractors https://t.co/FBUE9wljht",
  "data/tweet-wsj/2021/12/1468392647555526661.json": "The United Arab Emirates is shifting to a 4½-day workweek that will start Monday and end on Friday at noon https://t.co/sgz89dNcdr",
  "data/tweet-wsj/2021/12/1468486768160919552.json": "Australia is joining the U.S. in a diplomatic boycott of the 2022 Winter Olympics in Beijing https://t.co/gCRcmaUwMw",
  "data/tweet-wsj/2021/12/1468381066931195915.json": "One container ship waited nearly two months to dock at port. Here’s what the delay meant for small businesses with chess sets, holiday boots and other products stuck on board. https://t.co/bomQKQxD5g",
  "data/tweet-wsj/2021/12/1468549256420151305.json": "Omicron was able to elude two doses of the Covid-19 vaccine from Pfizer and BioNTech in initial lab testing, but three doses neutralized the variant, the companies said https://t.co/efJcH1q2Lx",
  "data/tweet-wsj/2021/12/1468573601620242439.json": "Epidemiologists believe Singapore is the first country to adopt a policy of withdrawing coverage of Covid-19 medical costs specifically for those who choose to go unvaccinated https://t.co/Zjc8pRWq13",
  "data/tweet-wsj/2021/12/1468513213167947777.json": "Turkey's embattled economy could get worse before it gets better, investors and economists fear https://t.co/MiVevzZZ8a",
  "data/tweet-wsj/2021/12/1468090426624286720.json": "Biden convenes a summit of democracies this week, but in the background potential crises are unfolding: a potential Russian invasion of Ukraine, continuing Chinese pressure on Taiwan and the potential collapse of Iran nuclear talks, writes @GeraldFSeib https://t.co/bZJKsKAg1h",
  "data/tweet-wsj/2021/12/1468645324214386695.json": "From @WSJopinion: By pretending that the police are a bigger threat to society than the criminals, progressive policies are making the country demonstrably less safe than it’s been in decades, writes @jasonrileywsj\nhttps://t.co/1GG1jd75y4",
  "data/tweet-wsj/2021/12/1468656703151427596.json": "Due to the Amazon cloud outage, a couple had to \"manually\" feed their cats \"like in ancient times\" https://t.co/WKAyDWtItM",
  "data/tweet-wsj/2021/12/1468636556735008771.json": "The Senate is expected to pass legislation aimed at nullifying President Biden’s vaccine-or-test mandate for private employers, a move that would mark a significant bipartisan rebuke of the president https://t.co/BQPA3gUTZU",
  "data/tweet-wsj/2021/12/1468720823741595649.json": "From @WSJopinion: “My generation will rely on the future economic growth spurred by investments made today. We want a country that values hard work and doesn’t take away more of our money—especially money we don’t even have.” https://t.co/mvYZtaS4im",
  "data/tweet-wsj/2021/12/1468724614691971084.json": "The U.K. and Canada have joined a widening diplomatic boycott of the 2022 Winter Olympics in Beijing https://t.co/uSq6csOS1O",
  "data/tweet-wsj/2021/12/1468590186720374784.json": "The Turkish lira has plummeted, but so far the world’s biggest emerging markets have avoided contagion, explains @ahirtens #WSJWhatsNow https://t.co/OXgNaH18ky",
  "data/tweet-wsj/2021/12/1468747297487994880.json": "Japan's restless seniors try team videogaming. “It’s better than having nothing to do at home and watching TV.\" https://t.co/IMsstI3vyD",
  "data/tweet-wsj/2021/12/1468713264003661838.json": "Photos entered into evidence at Ghislaine Maxwell’s sex-trafficking trial include pictures of her kissing and hugging Jeffrey Epstein and giving him a foot rub on a private jet, providing a glimpse into how close the two were, prosecutors say https://t.co/kHQEhFPg2r",
  "data/tweet-wsj/2021/12/1468815209473138688.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/V3wUTya2d0",
  "data/tweet-wsj/2021/12/1468882934107189256.json": "Amazon was fined $1.3 billion by Italian regulators for favoring sellers that use its logistics services. The company faces a similar probe by the EU. https://t.co/cHmyVMclQB",
  "data/tweet-wsj/2021/12/1468918027207024640.json": "In a significant rebuke, the Senate approved legislation to nullify President Biden’s Covid-19 vaccine-or-test mandate for private employers, with two Democratic senators voting with Republicans #WSJWhatsNow https://t.co/4z6bOsMPHD",
  "data/tweet-wsj/2021/12/1468977337442226179.json": "Rupert Murdoch purchased a 340,000-acre Montana cattle ranch from the Koch family for roughly $200 million, making it the largest ranch sale in state history, people with knowledge of the deal said https://t.co/YMzg1FftKq",
  "data/tweet-wsj/2021/12/1468990887891976192.json": "New York Attorney General Letitia James said she is ending her bid for governor and will seek another term in her current office https://t.co/hIzDImGOXn",
  "data/tweet-wsj/2021/12/1469003995079446538.json": "Half of Americans support President Biden’s Covid-19 vaccine requirements for private-sector employers, and a slim majority backs other state and local mandates, a new Wall Street Journal poll finds https://t.co/Xe4i4aux5L",
  "data/tweet-wsj/2021/12/1469023324500017155.json": "Starbucks baristas in Buffalo, N.Y. voted to form the first labor union at one the coffee giant’s U.S. cafes in the company’s 50-year history https://t.co/gGC1tGneTZ",
  "data/tweet-wsj/2021/12/1468769905092841478.json": "The Senate approved legislation aimed at nullifying President Biden’s vaccine-or-test mandate for private employers https://t.co/IMYfuxAqAl",
  "data/tweet-wsj/2021/12/1469015237517099015.json": "The holiday shopping season makes us prime targets for cybercriminals. Here’s how to avoid some of the most popular scams plus other tips for online safety\nhttps://t.co/YsTLizQUx4",
  "data/tweet-wsj/2021/12/1468971224256503818.json": "New York City lawmakers are set to vote on a bill that would let more than 800,000 residents who aren’t U.S. citizens vote in local elections, potentially becoming the largest city in the U.S. to do so https://t.co/A4ozeJbp6J",
  "data/tweet-wsj/2021/12/1469063236813307916.json": "An appeals court rejected former President Trump's bid to block the House committee investigating the Jan. 6 riot from gaining access to records from his presidency https://t.co/hik04N1StN",
  "data/tweet-wsj/2021/12/1469087182438682625.json": "Breaking: Actor Jussie Smollett was found guilty of lying to police when he reported being the victim of a hate crime near his Chicago apartment in 2019 https://t.co/krRkbVXm4e",
  "data/tweet-wsj/2021/12/1469136053244239878.json": "The U.S. plans to ban American investment in Chinese AI company SenseTime and is looking to block SMIC, China's largest chip maker, from buying U.S. manufacturing tools, people familiar with the matter said https://t.co/9wt7VA8466",
  "data/tweet-wsj/2021/12/1469120967267991559.json": "“If it’s gone, it’s a big deal.” Researchers want to know if one of the four main influenza strains that infect humans has disappeared https://t.co/IjvUV2j3Kf",
  "data/tweet-wsj/2021/12/1469158688686493700.json": "GE, Union Pacific and other large employers have suspended Covid-19 vaccine requirements for workers after a court ruling blocked the Biden administration's mandate for federal contractors https://t.co/nLsYx38XsP",
  "data/tweet-wsj/2021/12/1469117220408242176.json": "From @WSJopinion: A new poll from Gallup confirms that the American people still have more faith in capitalism than they do in socialism https://t.co/HDnyZoT5cE",
  "data/tweet-wsj/2021/12/1469256561553862659.json": "The U.S. won an appeal against a U.K. court's decision to bar the extradition of Julian Assange, clearing a hurdle in its pursuit of the WikiLeaks founder https://t.co/2s3Pnx0DGh",
  "data/tweet-wsj/2021/12/1469275943181197312.json": "Watch as baristas at a Buffalo, N.Y., Starbucks store realized they had enough votes to unionize, making them the first labor union at one of the coffee giant’s own U.S. cafes #WSJWhatsNow https://t.co/YSDanIzDj4",
  "data/tweet-wsj/2021/12/1469098314062835713.json": "Company leaders are unloading stock at a record pace. Top insiders, like Elon Musk and Mark Zuckerberg, sold more than $63.5 billion this year, a WSJ analysis shows. https://t.co/nV0Wyh6RJK",
  "data/tweet-wsj/2021/12/1469060564773224456.json": "From @WSJopinion: Yes, the crime wave is as bad as you think. Progressives gaslight the public by claiming things used to be worse, writes @Rafa_Mangual https://t.co/4owMvQjj4d",
  "data/tweet-wsj/2021/12/1468600028742705157.json": "The nation’s large and diverse group of Hispanic voters is showing signs of dividing its support between Democrats and Republicans more evenly than in recent elections, a new Wall Street Journal poll finds https://t.co/V3jTLXz3H7",
  "data/tweet-wsj/2021/12/1469299204350779398.json": "U.S. inflation hit a 39-year high of 6.8% last month. Consumer demand and supply shortages continue to pressure prices. https://t.co/H2vCq7YPNr",
  "data/tweet-wsj/2021/12/1469317769866981388.json": "From @WSJopinion: Kamala Harris’s shaky standing is a danger to the country given the position she could be called on to fill, writes @Peggynoonannyc https://t.co/X3moCatbwQ",
  "data/tweet-wsj/2021/12/1469332354229579778.json": "An elite group of U.S.-trained Somali commandos has become so entangled in local political power struggles that it has ceased operations against the Islamist militants it was created to fight https://t.co/iq3mKal2Uc",
  "data/tweet-wsj/2021/12/1469151162788106245.json": "The U.A.E. recently ordered work halted on a Chinese facility in the country after American officials argued that Beijing intended to use the site for military purposes https://t.co/C2lPyV1QRs",
  "data/tweet-wsj/2021/12/1469339912986148873.json": "U.S. inflation is at its highest rate in nearly four decades this fall, reaching 6.8% in November from a year ago. Why do prices keep going up and what's the cause? The reasons are myriad—the pandemic is one. https://t.co/OA3LOcpLdY",
  "data/tweet-wsj/2021/12/1469143608876019718.json": "Why Mark Zuckerberg may be wrong about the metaverse as the inevitable next leap forward in computer interfaces https://t.co/aEOYBoyALD",
  "data/tweet-wsj/2021/12/1469381465226059786.json": "GM plans to invest more than $3 billion to make electric vehicles in Michigan, people familiar with the matter said https://t.co/jKz3CPkpP8",
  "data/tweet-wsj/2021/12/1469348900540723202.json": "Elon Musk, CEO of Tesla and SpaceX, said he might quit his jobs, without providing details about which positions he might relinquish or how serious he was about changing roles https://t.co/vHIKIAxfKH",
  "data/tweet-wsj/2021/12/1469325547587129347.json": "Breaking: The Supreme Court ruled that abortion clinics can challenge Texas’ ban on most abortions, putting the law in jeopardy even though it remains in effect for now https://t.co/WuGfkOH57P",
  "data/tweet-wsj/2021/12/1469370101673639944.json": "From @WSJopinion: The Biden Administration ignored the law. Now the vaccine mandates are getting crushed in court. https://t.co/9MNe7ElgIf",
  "data/tweet-wsj/2021/12/1469532428721131521.json": "The Omicron variant has so far caused mostly mild cases of Covid-19 in a small group of largely vaccinated people in the U.S., CDC data show https://t.co/UwQsVf6GhX",
  "data/tweet-wsj/2021/12/1469539986353664004.json": "Here is an early look at the front page of The Wall Street Journal's weekend edition https://t.co/IdXxaSgzzy https://t.co/VugPWezud5",
  "data/tweet-wsj/2021/12/1469570179311050752.json": "Japan's restless seniors try team videogaming. “It’s better than having nothing to do at home and watching TV.\" https://t.co/mDaApwDKU6",
  "data/tweet-wsj/2021/12/1469615472744321024.json": "Take a look at the front page of today's Wall Street Journal https://t.co/Y5XvBLtSDF https://t.co/n0VkHytxLK",
  "data/tweet-wsj/2021/12/1469577714898194434.json": "The backlog of container ships off the ports of Los Angeles and Long Beach isn’t getting smaller—it just looks that way https://t.co/o9Nfn2x3FO",
  "data/tweet-wsj/2021/12/1469460698891788291.json": "From @WSJopinion: Merrick Garland’s Justice Department is pursuing an even more partisan agenda than it did in the Obama years, writes @KimStrassel https://t.co/YhaPGmADky",
  "data/tweet-wsj/2021/12/1469551290497830913.json": "From @WSJopinion: The best way to help working families is to cut their tax bills, which helps not only families using child-care facilities but also those providing the best care available—at home with mom or dad https://t.co/lLF2Js9FNf",
  "data/tweet-wsj/2021/12/1469664531102191624.json": "Essay: The late Hugo Chavez’s embrace of Fidel Castro and the Cuban regime sent Venezuela into a spiral of poverty and chaos https://t.co/tjQI8FsmZl",
  "data/tweet-wsj/2021/12/1469653296549969923.json": "Omicron was able to elude two doses of the Covid-19 vaccine from Pfizer and BioNTech in initial lab testing, but three doses neutralized the variant, the companies said https://t.co/qfdW9iy6uL",
  "data/tweet-wsj/2021/12/1469690984313327624.json": "Australia is joining the U.S. in a diplomatic boycott of the 2022 Winter Olympics in Beijing https://t.co/IrFKwYIkWh",
  "data/tweet-wsj/2021/12/1469687191337066497.json": "Essay: Hardships that hasten children’s cognitive development can harm their prospects as adults, according to recent research. What they need is the safety to play and explore. https://t.co/e8uVQFlHQd",
  "data/tweet-wsj/2021/12/1469706066850156551.json": "The United Arab Emirates is shifting to a 4½-day workweek that will start Monday and end on Friday at noon https://t.co/U53BG7otQ0",
  "data/tweet-wsj/2021/12/1469717380486025222.json": "Austria’s Covid-19 infections have plummeted and vaccination rates have soared after the country imposed a lockdown and said it would make the shots mandatory https://t.co/JRROnb23VG",
  "data/tweet-wsj/2021/12/1469732495457456133.json": "Singapore will stop covering Covid-19 medical costs for those who choose to go unvaccinated https://t.co/mP5T1ytfmL",
  "data/tweet-wsj/2021/12/1469728812363653122.json": "Due to the Amazon cloud outage, a couple had to \"manually\" feed their cats \"like in ancient times\" https://t.co/I1GUQbJPY2",
  "data/tweet-wsj/2021/12/1469441799966056451.json": "“Honestly, I would just can this whole bill.” Tesla CEO Elon Musk criticized federal efforts meant to spur electric-vehicle adoption, including a bill that would boost incentives for buying battery-powered cars #WSJWhatsNow https://t.co/gMzyxzaxX8",
  "data/tweet-wsj/2021/12/1469743889137418250.json": "U.S. voters are pessimistic about the economy and short on confidence in President Biden’s leadership, a WSJ poll found https://t.co/eQhMCivdld",
  "data/tweet-wsj/2021/12/1469711086261841934.json": "At least 70 people have died, Kentucky’s governor estimated, after severe weather and tornadoes caused catastrophic damage across several states https://t.co/iC4dNHTnZ1",
  "data/tweet-wsj/2021/12/1469770241605611528.json": "Quentin Durward, a neurosurgeon living in Dakota Dunes, S.D., has a 2020 Ford GT Heritage Edition that evokes the classic racers that beat Ferrari in the 1960s https://t.co/j6gXMBS9LH",
  "data/tweet-wsj/2021/12/1469826868639670273.json": "How Elon Musk became a high-profile cheerleader of China's Communist Party https://t.co/Rqs94GdfCB",
  "data/tweet-wsj/2021/12/1469891030224941056.json": "California Gov. Gavin Newsom wants to allow private citizens to sue gun manufacturers, modeling his proposal after the legal framework used in the Texas law banning abortions past six weeks https://t.co/E0Sddi1ere",
  "data/tweet-wsj/2021/12/1469841969685962753.json": "From @WSJopinion: The courts are repudiating the Biden Administration’s vaccine mandates at an astonishing pace https://t.co/E5HaxNzxyC",
  "data/tweet-wsj/2021/12/1469887261764374540.json": "Disappearing court documents, restricted access to data on ships and supplies: China closes off details about what’s happening inside the country https://t.co/uE1GZn4end",
  "data/tweet-wsj/2021/12/1469660776801751042.json": "China wants to put its first Atlantic military base in Equatorial Guinea, U.S. intelligence shows. The prospect has set off alarm bells in Washington. https://t.co/Nx8AjaBHI5",
  "data/tweet-wsj/2021/12/1469751371217965062.json": "From @WSJopinion: I’m no longer confident the institute can ethically push the boundaries of science for the good of humanity while working with institutions beholden to the regime in China, writes Michelle Bethel https://t.co/Jbq49hFIqp",
  "data/tweet-wsj/2021/12/1469845725546786819.json": "Apple’s vision for life after the iPhone is coming into view, writes @mims https://t.co/xMD8qM0Ges",
  "data/tweet-wsj/2021/12/1469864615228194817.json": "Investors are pouring money into the meme-based cryptocurrency Shiba Inu. Watch as WSJ retail investing reporter Caitlin McCabe explains why: https://t.co/fc1Delyowx",
  "data/tweet-wsj/2021/12/1469804206332784652.json": "Austria’s Covid-19 infections have plummeted and vaccination rates have soared after the country imposed a lockdown and said it would make the shots mandatory https://t.co/0TYCNdZNXx",
  "data/tweet-wsj/2021/12/1469834444253106177.json": "Millennials, feeling their mortality during Covid-19, start writing their wills. “It was a game-changer when my wife asked me if I’d want to be put on a ventilator if I needed one.” https://t.co/lyMEc4smo3",
  "data/tweet-wsj/2021/12/1469857059508297734.json": "Kentucky Gov. Andy Beshear said the number of deaths in his state could exceed 100 after a series of tornadoes ripped across parts of at least five states https://t.co/nS0ERcAFSz",
  "data/tweet-wsj/2021/12/1469996708964806656.json": "Why Mark Zuckerberg may be wrong about the metaverse as the inevitable next paradigm shift in the digital world https://t.co/QHiPpC0QuY",
  "data/tweet-wsj/2021/12/1470030836422561793.json": "People who had received a third shot of the Pfizer-BioNTech Covid-19 vaccine showed a level of neutralization against the Omicron variant about 100 times higher than those who had received two shots, a new Israeli study found https://t.co/YmkgUcx0Iv",
  "data/tweet-wsj/2021/12/1470042023835095047.json": "At 80, Paul Simon isn’t interested in writing a memoir. Instead, his new audiobook offers a “musical biography” of his iconic song catalog. https://t.co/CjVtyuZYRZ",
  "data/tweet-wsj/2021/12/1470038259275292673.json": "It's OK if you don't really understand cryptocurrency. This is how it works. https://t.co/ZR9QPdH3nP",
  "data/tweet-wsj/2021/12/1470052866408828940.json": "Chris Wallace said he is leaving Fox News, ending an 18-year-run as host of “Fox News Sunday,” the network’s flagship weekend show https://t.co/ENuQGR6Mpx",
  "data/tweet-wsj/2021/12/1470049669766078469.json": "Anne Rice, the gothic novelist widely known for her bestselling novel “Interview with the Vampire,” died late Saturday at the age of 80 https://t.co/qJhvEBPYGU",
  "data/tweet-wsj/2021/12/1469970331658076172.json": "Humanlike chatbots don’t help angry consumers. They just make them angrier. https://t.co/AShHOrXWb5",
  "data/tweet-wsj/2021/12/1470057133836226564.json": "Rupert Murdoch purchased a 340,000-acre Montana cattle ranch from the Koch family for roughly $200 million, making it the largest ranch sale in state history, people with knowledge of the deal said https://t.co/YhI24oAVkA",
  "data/tweet-wsj/2021/12/1469875925969997824.json": "Cybersecurity officials at major tech companies are scrambling to patch a serious flaw in a widely used piece of Internet software that security experts warn could unleash a new round of cyberattacks https://t.co/koO5rT9YzP",
  "data/tweet-wsj/2021/12/1470073766080299013.json": "Chris Wallace, who announced he is leaving Fox News “to try something new,” is headed to CNN+, according to people familiar with the matter https://t.co/OBEDZVC2zu",
  "data/tweet-wsj/2021/12/1470072232277905409.json": "Toyota is investing $1.25 billion and creating 1,750 jobs with a new electric-vehicle battery plant in rural Randolph County, N.C. https://t.co/8k0wLWlE5U",
  "data/tweet-wsj/2021/12/1470064681414975489.json": "People warned an Olympic gold-medal skier to keep quiet about one of his great passions. He went public with it anyway: He’s a hunter. https://t.co/PsloJTQLje",
  "data/tweet-wsj/2021/12/1470083568034537474.json": "The Biden administration unveiled steps to combat corruption globally, including new rules on U.S. real-estate purchases to prevent money laundering https://t.co/k8dOqoz5lx",
  "data/tweet-wsj/2021/12/1470098671668764677.json": "Omicron was able to elude two doses of the Covid-19 vaccine from Pfizer and BioNTech in initial lab testing, but three doses neutralized the variant, the companies said https://t.co/lIsyzTLv0l",
  "data/tweet-wsj/2021/12/1469811773071048704.json": "Your grandmother gave you cash in an envelope for the holidays. Should you consider giving her an NFT or cryptocurrency? https://t.co/fdVsCacWsm",
  "data/tweet-wsj/2021/12/1469962750721941510.json": "Like Vincent van Gogh and Herman Melville, photographer Vivian Maier didn’t become well known until after her death. What does the posthumous triumph of artists tell us about the nature of fame? https://t.co/TireZ079jw",
  "data/tweet-wsj/2021/12/1470143962891620362.json": "Due to the Amazon cloud outage, a couple had to \"manually\" feed their cats \"like in ancient times\" https://t.co/wYsNmyOHDf",
  "data/tweet-wsj/2021/12/1470133136663191561.json": "Alibaba fired a female employee who had accused her supervisor of rape. Her accusations had triggered widespread debate about the prevalence of sexual misconduct in the workplace. https://t.co/IyFwlaf0AC",
  "data/tweet-wsj/2021/12/1470177923097403393.json": "Vicente Fernández, the iconic Mexican king of the country’s traditional ranchera music, has died at age 81 https://t.co/yBC5jfr3Yp",
  "data/tweet-wsj/2021/12/1470181784109436936.json": "The United Arab Emirates is shifting to a 4½-day workweek that will start Monday and end on Friday at noon https://t.co/Pgxc9yFnFA",
  "data/tweet-wsj/2021/12/1470162823766593541.json": "From @WSJopinion: Yes, the crime wave is as bad as you think. Progressives gaslight the public by claiming things used to be worse, writes @Rafa_Mangual https://t.co/Cci0SiskQ0",
  "data/tweet-wsj/2021/12/1470211912847839239.json": "\"I want to make it perfectly clear that I believe every single member of my Congress thinks getting vaccinated is a good idea. But mandating it is not going to work,\" Senate Minority Leader Mitch McConnell said of a federal vaccine mandate https://t.co/lZiNeTkZXW",
  "data/tweet-wsj/2021/12/1470155283238469632.json": "Companies and governments around the world rushed over the weekend to fend off cyberattacks looking to exploit a serious flaw in a widely used piece of Internet software https://t.co/Ps3LzSzbl5",
  "data/tweet-wsj/2021/12/1470253408951144451.json": "French President Emmanuel Macron and other public figures say that “woke” movements reflecting American ideas of multiculturalism threaten French society https://t.co/BPNB92KJgu",
  "data/tweet-wsj/2021/12/1470113726519037953.json": "The Turkish lira has plummeted, but so far the world’s biggest emerging markets have avoided contagion, explains @ahirtens #WSJWhatsNow https://t.co/stWzsfg5WT",
  "data/tweet-wsj/2021/12/1470238323155345412.json": "Inflation should be about 3% by the end of 2022, says the chair of the Council of Economic Advisers https://t.co/N4ml2hsiy4",
  "data/tweet-wsj/2021/12/1470294946846584842.json": "It's OK if you don't really understand cryptocurrency. This is how it works. https://t.co/LoahdXZEBp",
  "data/tweet-wsj/2021/12/1470257221745393665.json": "Benedict Cumberbatch, Tom Blyth and Idris Elba are all British. And they’re all playing American cowboys. https://t.co/UMqD05O1ZC",
  "data/tweet-wsj/2021/12/1470328917982646275.json": "People who had received a third shot of the Pfizer-BioNTech Covid-19 vaccine showed a level of neutralization against the Omicron variant about 100 times higher than those who had received two shots, a new Israeli study found https://t.co/ezk3hMNCX8",
  "data/tweet-wsj/2021/12/1470264745857105927.json": "Take an early look at the front page of The Wall Street Journal https://t.co/qpQ9RDnVJi https://t.co/qKEf08bh9E",
  "data/tweet-wsj/2021/12/1470393096726794245.json": "Essay: If we succeed only in pushing the coronavirus out of the U.S. to the remote corners of the world, it will mutate and return to hold us hostage again and again https://t.co/3XrwLtbqmJ",
  "data/tweet-wsj/2021/12/1470406111329243139.json": "Nassar abuse victims reached a $380 million settlement with USA Gymnastics and the U.S. Olympic &amp; Paralympic Committee after last-minute insurer contributions and a $34 million direct contribution from the USOPC https://t.co/0Y5OBlvCDC",
  "data/tweet-wsj/2021/12/1470370435061661697.json": "Prime Minister Narendra Modi’s Twitter account was hacked, with a tweet to his more than 73 million followers falsely saying India was adopting bitcoin as legal tender  https://t.co/YoNJvtCX70",
  "data/tweet-wsj/2021/12/1470102470638673926.json": "Iran is stepping up deportations of Afghans trying to flee the Taliban and poverty https://t.co/MqrrMoueia",
  "data/tweet-wsj/2021/12/1470411973217107969.json": "From @WSJopinion: The Congressional Budget Office says the Build Back Better bill would add $3 trillion to the deficit over 10 years if its programs are made permanent. https://t.co/e71Kt5rtiu",
  "data/tweet-wsj/2021/12/1470151603793575941.json": "How Elon Musk became a high-profile cheerleader of China's Communist Party https://t.co/n0Gxq6IoaC",
  "data/tweet-wsj/2021/12/1470128873937543177.json": "Photos entered into evidence at Ghislaine Maxwell’s sex-trafficking trial include pictures of her kissing and hugging Jeffrey Epstein and giving him a foot rub on a private jet, providing a glimpse into how close the two were, prosecutors say https://t.co/kzrMssjleo",
  "data/tweet-wsj/2021/12/1470362876460240896.json": "Satellite images show the damage wrought on the town of Mayfield, Ky. after tornadoes ripped through the state and five others, destroying homes and businesses #WSJWhatsNow https://t.co/npI7khm3nw",
  "data/tweet-wsj/2021/12/1470219464637661184.json": "It’s not just the accent: Ted Lasso’s pop-culture references come so fast and furious that you’ve probably missed a lot. We’re here to help. https://t.co/faXBg1X0Ap",
  "data/tweet-wsj/2021/12/1470495023481434112.json": "Kim Kardashian says she has passed the “baby bar” exam in California after her fourth try: “I failed this exam 3 times in 2 years, but I got back up each time and studied harder and tried again until I did it!!!”\nhttps://t.co/ND81J9o7jh",
  "data/tweet-wsj/2021/12/1470574325296250880.json": "A House panel investigating the Capitol riot is set to recommend holding former Trump chief of staff Mark Meadows in contempt of Congress https://t.co/yR63HXaQhY",
  "data/tweet-wsj/2021/12/1470585605570674690.json": "Kim Kardashian says she has passed the “baby bar” exam in California after her fourth try: “I failed this exam 3 times in 2 years, but I got back up each time and studied harder and tried again until I did it!!!”\nhttps://t.co/BUND8TyNwa",
  "data/tweet-wsj/2021/12/1470600698823942144.json": "The U.S. Air Force discharged 27 airmen for refusing to get a coronavirus vaccine. They're among the first active duty service members to be removed for not meeting the mandate. https://t.co/DDs8RRgx5v",
  "data/tweet-wsj/2021/12/1470350309687975938.json": "A surge in lithium prices is setting off a scramble for supply and fueling fears about long-term shortages of a vital ingredient in electric-vehicle batteries https://t.co/ojJo2DH94L",
  "data/tweet-wsj/2021/12/1470472355013140487.json": "A Bass Pro Shops trucker hat with a fish on it has become trendy—among people who have no interest in fishing https://t.co/L6Py5tM8Nl",
  "data/tweet-wsj/2021/12/1470539318259335187.json": "California will again require masking in all public indoor settings regardless of vaccination status as it confronts rising case rates ahead of the winter holidays and uncertainty about the Omicron variant https://t.co/B7AY10bnw5",
  "data/tweet-wsj/2021/12/1470725298291462145.json": "Pfizer’s Covid-19 pill, which is up for FDA authorization, worked against Omicron in lab tests, the company said. A final analysis of a key study also confirmed the drug was 89% effective in high-risk adults. https://t.co/OCTGS8b9Qg",
  "data/tweet-wsj/2021/12/1470710190978830337.json": "Kroger is taking away paid emergency leave for unvaccinated employees who contract Covid-19, while a $50 monthly health surcharge will be added for some staff https://t.co/16OAvXlSh1",
  "data/tweet-wsj/2021/12/1470769802998337554.json": "The United Arab Emirates is threatening to pull out of a $23 billion deal to buy American-made F-35 aircraft, Reaper drones and other advanced munitions, officials said, with the U.A.E. citing onerous U.S. requirements to guard against Chinese espionage https://t.co/UCp70qQdJU",
  "data/tweet-wsj/2021/12/1470740953900191752.json": "Elon Musk tweeted that Tesla will make some merchandise buyable with the cryptocurrency dogecoin, which soared as much as 40% https://t.co/MgyBlk5pWu",
  "data/tweet-wsj/2021/12/1470657341846609928.json": "Toyota plans global sales of 3.5 million electric vehicles by 2030 and intends to make the Lexus brand 100% electric by 2035 https://t.co/CtAAq0d0HJ",
  "data/tweet-wsj/2021/12/1470347804564500480.json": "SenseTime, which had aimed to raise up to $767 million from the deal, says it is still committed to concluding its Hong Kong listing soon  https://t.co/8EjzyUlydL",
  "data/tweet-wsj/2021/12/1470824891779895303.json": "The Proud Boys and Oath Keepers were sued by the District of Columbia, which alleges the far-right groups “worked together to plot, publicize, recruit for, and finance” the Jan. 6 attack on the U.S. Capitol https://t.co/d8PZ1YFMDx",
  "data/tweet-wsj/2021/12/1470841063350968321.json": "Andrew Cuomo must relinquish millions of dollars he made on his Covid-era memoir when he was New York governor, a state ethics watchdog ordered https://t.co/fOaDrohDr0",
  "data/tweet-wsj/2021/12/1470498811655110661.json": "The U.S. Supreme Court turned down emergency requests by New York healthcare workers for a religious exemption from state requirements to vaccinate against Covid-19 https://t.co/n06BUWEXlh",
  "data/tweet-wsj/2021/12/1470869989242593284.json": "JPMorgan told unvaccinated employees in New York that they must work from home starting Tuesday. “It seems unfair to require our vaccinated employees to wear masks all day at their desks,” the bank said in the memo. \nhttps://t.co/N4uwhXKeg5",
  "data/tweet-wsj/2021/12/1470857402262208518.json": "Apple stores across the U.S. are returning to requiring face masks as Covid-19 cases surge. The new mask mandate will apply to all customers and employees, the company said. https://t.co/GEhTyPKWnK",
  "data/tweet-wsj/2021/12/1470892625565822980.json": "Former President Donald Trump lost his bid to shield his tax returns from the House Ways and Means Committee on Tuesday, after a federal judge dismissed the case https://t.co/LP1rBfe6TZ",
  "data/tweet-wsj/2021/12/1470926396562284544.json": "Stephen Curry broke the NBA record for career 3-pointers by making his 2,974th on Tuesday night. Here’s how he shot his way into history. https://t.co/vvMBSDMUz2",
  "data/tweet-wsj/2021/12/1470752006075785221.json": "Harvard nanoscience expert Charles Lieber goes on trial for what the government alleges were his efforts to conceal his links to the Wuhan University of Technology in China https://t.co/M7vhGHOEtI",
  "data/tweet-wsj/2021/12/1470385557226278912.json": "Some big hospital systems have dropped vaccine mandates after a judge blocked a Biden administration requirement for healthcare workers to get shots  https://t.co/uKOMcw3P58",
  "data/tweet-wsj/2021/12/1470948003498401797.json": "The House is preparing to vote on holding Mark Meadows, former President Donald Trump’s final chief of staff, in criminal contempt of Congress https://t.co/ZVAGxf1Wne",
  "data/tweet-wsj/2021/12/1470978191955308547.json": "The House voted unanimously to ban imports from China’s Xinjiang over concerns about the use of forced labor https://t.co/vvJEDLJJrO",
  "data/tweet-wsj/2021/12/1470902684047876096.json": "Pfizer’s Covid-19 pill, which is up for FDA authorization, worked against Omicron in lab tests, the company said. A final analysis of a key study also confirmed the drug was 89% effective in high-risk adults. https://t.co/2lfPU7arih",
  "data/tweet-wsj/2021/12/1471076354850447370.json": "The song ‘1-800-273-8255’—the national suicide prevention hotline—and Logic’s ensuing performances led to higher call volume and decrease in suicides, research shows https://t.co/9xtGEmLxNY",
  "data/tweet-wsj/2021/12/1471019722040881155.json": "Andrew Cuomo must relinquish millions of dollars he made on his Covid-era memoir when he was New York governor, a state ethics watchdog ordered https://t.co/QjrZyXpZeP",
  "data/tweet-wsj/2021/12/1471012171811332101.json": "Stephen Curry broke the NBA record for career 3-pointers by making his 2,974th on Tuesday night. Here’s how he shot his way into history. https://t.co/6xMMAMIIlu",
  "data/tweet-wsj/2021/12/1471156633044717574.json": "Elon Musk and Elizabeth Warren clashed on Twitter after the U.S. senator tweeted: “Let’s change the rigged tax code so The Person of the Year will actually pay taxes and stop freeloading off everyone else.” https://t.co/nAClI3Unc1",
  "data/tweet-wsj/2021/12/1471136740744339463.json": "Tesla Chief Executive Elon Musk and Sen. Elizabeth Warren clashed with one another on Twitter after the senator called on the billionaire chief executive to pay more taxes https://t.co/CKNuNbIDBO",
  "data/tweet-wsj/2021/12/1471242444247347211.json": "Russian President Vladimir Putin and his Chinese counterpart, Xi Jinping, agreed to rebuff Western intrusion into their countries’ internal affairs and boost efforts to defend their nations’ security interests https://t.co/LC84DnH09n",
  "data/tweet-wsj/2021/12/1470557988998066177.json": "The House panel investigating the Jan. 6 attack on the U.S. Capitol voted to recommend holding Mark Meadows, Donald Trump's final chief of staff, in criminal contempt of Congress for defying a congressional subpoena https://t.co/fkKYXeV4m5",
  "data/tweet-wsj/2021/12/1471249981269065732.json": "President Biden will nominate Caroline Kennedy to be U.S. ambassador to Australia, the White House said Wednesday https://t.co/XXhAtoIXv4",
  "data/tweet-wsj/2021/12/1470971528258928645.json": "The Democratic-controlled House has voted to hold Trump’s final chief of staff, Mark Meadows, in criminal contempt of Congress for defying a subpoena to testify to the panel investigating the Capitol riot https://t.co/1zzjK1p3t6",
  "data/tweet-wsj/2021/12/1471072573354041354.json": "During the pandemic, the number of people moving to California fell 38%, a new study found. In the San Francisco Bay Area, new arrivals plummeted 45%  https://t.co/9XVLV6m1t7",
  "data/tweet-wsj/2021/12/1471333019088736256.json": "From @WSJopinion: Whether war breaks out will depend on how badly Beijing and Moscow fear the global power shift in the next decade and how eager they will be to exploit their perceived current relative advantages to remake the world, writes @andrewmichta https://t.co/CwCfJH1Yuq",
  "data/tweet-wsj/2021/12/1471336810080989184.json": "President Biden will nominate Caroline Kennedy to be U.S. ambassador to Australia, the White House said Wednesday https://t.co/pplUHNOAh9",
  "data/tweet-wsj/2021/12/1471194242722709508.json": "Most Fed officials signaled they were prepared to raise rates at least three times next year to cool high inflation https://t.co/kkkOEFTTQy",
  "data/tweet-wsj/2021/12/1471393418559512577.json": "The Jacksonville Jaguars fired Urban Meyer, ending his tumultuous NFL tenure after just 13 games https://t.co/FisPOUX734",
  "data/tweet-wsj/2021/12/1471438813570510854.json": "Surging Covid-19 infections, hospitalizations and deaths are prompting South Korea to reverse plans to reopen and instead take some of the most aggressive measures against the virus of any country in the world  https://t.co/AwDUEv44X2",
  "data/tweet-wsj/2021/12/1471447551408848896.json": "“The science on lead is settled—there is no safe level of exposure”: The White House is set to announce a plan to help millions of U.S. households replace lead water pipes https://t.co/IIm6vV7Qky",
  "data/tweet-wsj/2021/12/1471326098894082050.json": "Reddit says it has confidentially filed paperwork with the SEC to begin the process of going public https://t.co/TQU87ILi49",
  "data/tweet-wsj/2021/12/1471495394232209418.json": "From @WSJopinion: Some 30 major cities across the U.S. are recording record or near-record homicides this year, writes @DanHenninger. Maybe voters are starting to regret the consequences of electing progressive prosecutors.\nhttps://t.co/CJJPbRYjfZ",
  "data/tweet-wsj/2021/12/1471118121817841667.json": "German officials are growing worried about the radicalization of some antivaccine militants as the country edges toward a general Covid-19 vaccine mandate that could come early next year https://t.co/EW6upqjm7R",
  "data/tweet-wsj/2021/12/1471404768463577091.json": "German officials are growing worried about the radicalization of some antivaccine militants as the country edges toward a general Covid-19 vaccine mandate that could come early next year https://t.co/6ZT4MOSacr",
  "data/tweet-wsj/2021/12/1471521771862040585.json": "Haitian kidnappers released the remaining 12 missionary hostages abducted two months ago. Five others had been freed earlier. https://t.co/U9mG8DqZ8b",
  "data/tweet-wsj/2021/12/1471587137514618884.json": "CDC advisers recommended adults take Pfizer or Moderna Covid vaccines over Johnson &amp; Johnson’s due to a risk of rare clotting cases tied to the J&amp;J shot https://t.co/MrUu8BgBeS",
  "data/tweet-wsj/2021/12/1471563621822078983.json": "Bruce Springsteen sold his music rights to Sony Music Entertainment for around $500 million, according to people familiar with the matter. The deal is the largest transaction ever for the life’s work of an individual artist. https://t.co/I32Vd4RecL",
  "data/tweet-wsj/2021/12/1471637537835954177.json": "The FDA is allowing women to get the abortion pill mifepristone by mail, lifting a requirement that they must go to a medical office or hospital to get it https://t.co/wyWmxtCfBs",
  "data/tweet-wsj/2021/12/1471617408528007171.json": "A gang called the Zouk family is running wild in Singapore. They are otters. “They aren’t nice little puppies.” https://t.co/ccTWELjJYJ",
  "data/tweet-wsj/2021/12/1471657678451757063.json": "A federal judge overturned a roughly $4.5 billion settlement between OxyContin maker Purdue and members of the Sackler family who own the drugmaker, a surprising decision that raises questions about the future of the company and its owners https://t.co/PnCb549Zki",
  "data/tweet-wsj/2021/12/1471721839999459330.json": "Knowing two languages makes you better at learning other languages, new research shows—and it also alters how you think https://t.co/w08nuJWdwp",
  "data/tweet-wsj/2021/12/1471123378539008012.json": "Millennials’ growing appetite for homeownership is boosting demand for housing that economists think will remain strong for years, explains @davidhodari #WSJWhatsNow https://t.co/a76VOyWWD2",
  "data/tweet-wsj/2021/12/1471744515413266434.json": "A gang called the Zouk family is running wild in Singapore. They are otters. “They aren’t nice little puppies.” https://t.co/bnkJSOXmZf",
  "data/tweet-wsj/2021/12/1471878375736324099.json": "The U.S. is considering redirecting military equipment once bound for Afghanistan to Ukraine to reinforce its defenses against Russia, officials said https://t.co/TwotInRSeg",
  "data/tweet-wsj/2021/12/1471812871264870406.json": "With dozens of opposition lawmakers in jail, Hong Kong is preparing to hold its first election under Beijing’s new rules, but polls point to a historic drop in turnout https://t.co/WeItU5vTRu",
  "data/tweet-wsj/2021/12/1472007015811764226.json": "A federal appeals court reinstated Biden’s Covid-19 requirements that large employers ensure workers are vaccinated or tested weekly for the virus https://t.co/yMF0U3Ypb6",
  "data/tweet-wsj/2021/12/1471997407198068739.json": "The decimated Brooklyn Nets are bringing back unvaccinated Kyrie Irving for road games, the latest unexpected twist in one of the world’s most consequential vaccine standoffs https://t.co/0N8nCgquUZ",
  "data/tweet-wsj/2021/12/1472023897990213635.json": "In a nuclear bunker under a mountain in New Jersey sits a remarkable secret treasure: tapes of every NBA game in the league’s archives https://t.co/kzsQSzkqUo",
  "data/tweet-wsj/2021/12/1472054072454885381.json": "Obituary: Nintendo videogame engineer Masayuki Uemura, who has died at 78, worked with a semiconductor maker to supply a chip that jolted “Super Mario Bros” to life https://t.co/vMkHkeKZ4w",
  "data/tweet-wsj/2021/12/1471808668639371266.json": "Electric-vehicle startup Rivian plans to start construction next year on a second U.S. manufacturing facility in Georgia, placing a hefty bet on its ability to steadily increase sales in the coming years https://t.co/XpCrzSmqgG",
  "data/tweet-wsj/2021/12/1471941406788931589.json": "Pfizer pushed back plans to seek authorization of its Covid vaccine in children 2 to 5 years old, after a weaker-than-expected immune response in a study https://t.co/tMYNYMwXdq",
  "data/tweet-wsj/2021/12/1472088002558140417.json": "From @WSJopinion: President Biden’s stalled agenda is no one’s fault but his own, the result of an epic miscalculation of his mandate and votes, writes @KimStrassel https://t.co/LmxXSCVn4z",
  "data/tweet-wsj/2021/12/1471548233851752451.json": "In an interview with WSJ, Vice President Kamala Harris said that she and President Biden have never discussed whether he plans to run for re-election https://t.co/sxu3YqJGUx https://t.co/mfEuznxKy5",
  "data/tweet-wsj/2021/12/1471861524432138246.json": "From @WSJopinion: If Democrats lack the votes to pass their spending bill, the fault lies with Democratic leaders who misjudged Sen. Joe Manchin as well as the political and policy moment https://t.co/YGhxmxbodz",
  "data/tweet-wsj/2021/12/1472160023161847813.json": "The Omicron variant appears better able to break into cells and evade immunity, and seems to replicate faster in the airways than the Delta variant https://t.co/9oGbCRDAeO",
  "data/tweet-wsj/2021/12/1472231448526655490.json": "An overdose epidemic that has swept across North America is leading more cities to try to decriminalize small amounts of heroin, fentanyl, cocaine and other drugs https://t.co/p29wC7bZCN",
  "data/tweet-wsj/2021/12/1472152195852341252.json": "Take a look at the front page of today's Wall Street Journal https://t.co/wYG6dx81C0 https://t.co/oufJ09n24o",
  "data/tweet-wsj/2021/12/1472276491186716675.json": "In a nuclear bunker under a mountain in New Jersey sits a remarkable secret treasure: tapes of every NBA game in the league’s archives https://t.co/KuqzpEgVkw",
  "data/tweet-wsj/2021/12/1472340991558496261.json": "Logic’s hit song “1-800-273-8255” led to higher call volume and a decrease in suicides, research shows https://t.co/0Msot0aLPw",
  "data/tweet-wsj/2021/12/1472363592049639424.json": "Some of the people who built the internet think it’s time for a reboot—starting with social media https://t.co/TRUEi1ya5i",
  "data/tweet-wsj/2021/12/1472272986648588297.json": "It's OK if you don't really understand cryptocurrency. This is how it works. https://t.co/GHZlGEwrwl",
  "data/tweet-wsj/2021/12/1472382441184714753.json": "CNN is closing its offices to nonessential employees as Covid-19 cases spike https://t.co/3tzmAVmnIo",
  "data/tweet-wsj/2021/12/1472378684183138304.json": "From @WSJopinion: America’s future depends on the blockchain, writes Jay Clayton. The U.S. needs to act fast to preserve its advantage in the ‘tokenization’ of our financial infrastructure. https://t.co/K5fqDfjitS",
  "data/tweet-wsj/2021/12/1472227689817849856.json": "Toyota plans global sales of 3.5 million electric vehicles by 2030 and intends to make the Lexus brand 100% electric by 2035 https://t.co/s2IhyPHdga",
  "data/tweet-wsj/2021/12/1472454184431767553.json": "Masayuki Uemura, who has died at 78, worked with Ricoh to supply a chip that jolted “Super Mario Bros” to life https://t.co/6mhQSMkZUk",
  "data/tweet-wsj/2021/12/1472401349883084806.json": "It’s not just the accent: Ted Lasso’s pop-culture references come so fast and furious that you’ve probably missed a lot. We’re here to help. https://t.co/kzvwI1LokL",
  "data/tweet-wsj/2021/12/1472325812766531591.json": "Namibia is positioning itself as a leader in the emerging market for green hydrogen made from renewable electricity, which has great potential in the country https://t.co/e5oJbp0LVY",
  "data/tweet-wsj/2021/12/1472484392975179780.json": "The FDA is allowing women to get the abortion pill mifepristone by mail, lifting a requirement that they must go to a medical office or hospital to get it https://t.co/El99q5BzNH",
  "data/tweet-wsj/2021/12/1472393782951829506.json": "Blockchain entrepreneur Jonathan Yantis purchased a 45,000 square foot Colorado mansion for $12.5 million from Cal Turner Jr., the former CEO of Dollar General https://t.co/zD1nDE5fw1",
  "data/tweet-wsj/2021/12/1472469272899334152.json": "Taiwan’s ruling party claimed a decisive victory in a referendum vote Saturday, in a setback for Beijing that removes a key obstacle to a U.S. trade deal with the democratically governed island https://t.co/JqfupaNKtI",
  "data/tweet-wsj/2021/12/1472476834008866816.json": "Knowing two languages makes you better at learning other languages, new research shows—and it also alters how you think https://t.co/u4I8iuuSnB",
  "data/tweet-wsj/2021/12/1472431536419086339.json": "The NFL eliminated weekly Covid-19 testing for vaccinated players who are asymptomatic, a move that reverses its past pandemic practice in a bid to keep players from being sidelined while not feeling sick. https://t.co/qNZG4f548a",
  "data/tweet-wsj/2021/12/1472575319332773899.json": "Sen. Joe Manchin said he won't support Democrats' Build Back Better plan, a decision that could doom President Biden's top domestic-policy priority https://t.co/kqCuOtoamN",
  "data/tweet-wsj/2021/12/1472423984046219268.json": "Actor Brian Baumgartner, known for playing Kevin Malone in “The Office,” was set to be a baseball player but injuries made him chart a new path  https://t.co/PYWflnHZCq",
  "data/tweet-wsj/2021/12/1472578732632248323.json": "An NYU grad has more than $160,000 in student loans and struggles to land a job in her field. So she sells her eggs. https://t.co/POJLtZDk3g",
  "data/tweet-wsj/2021/12/1472567429301776394.json": "Vaccines typically give a stronger antibody response than infection—possibly better for short-term protection—and infection triggers a response that evolves over time, which might be better for long-term protection https://t.co/wTqFowdf95",
  "data/tweet-wsj/2021/12/1472333386308067333.json": "People warned an Olympic gold-medal skier to keep quiet about one of his great passions. He went public with it anyway: He’s a hunter. https://t.co/28JyUGQU9f",
  "data/tweet-wsj/2021/12/1472593839290564613.json": "Hong Kong voters mostly shunned a citywide poll to select Beijing-approved candidates for the city’s legislature. “These choices aren’t actually choices, so it’s meaningless to vote,” said a 34-year-old who had no intention of voting. https://t.co/FISUEvD6sS",
  "data/tweet-wsj/2021/12/1472559873699233802.json": "Rising prices for wind and solar components are knocking the returns investors expect from renewable energy, adding a speed bump to the switch from fossil fuels  https://t.co/tvCOtPHbsH",
  "data/tweet-wsj/2021/12/1472629073352577030.json": "“Our hospitals, if things look like they are looking now, in the next week or two are going to be very stressed with people,” said Anthony Fauci, the top U.S. infectious disease expert https://t.co/5TUTOItc14",
  "data/tweet-wsj/2021/12/1472665279893225473.json": "“Spider-Man: No Way Home” opened to $253 million at the box office this weekend, setting a pandemic record and becoming the third-highest domestic debut of all time https://t.co/eqSNyI9ZGw",
  "data/tweet-wsj/2021/12/1472710871411482633.json": "Gabriel Boric, a former student protest leader and congressman, has been elected president of Chile at age 35 https://t.co/4J2G2wfsSo",
  "data/tweet-wsj/2021/12/1472707077567139846.json": "President Biden’s ambitious climate-change plans were thrown into doubt after Sen. Joe Manchin said he wouldn’t support his party’s roughly $2 trillion education, healthcare and climate package https://t.co/gR2feklj6r",
  "data/tweet-wsj/2021/12/1472722177959079938.json": "Many NYU graduate degrees don’t pay off. Comparing debt loads with early-career earnings, it ranked worst of any university in 15 graduate programs. https://t.co/1QhKkmyt5t",
  "data/tweet-wsj/2021/12/1472571193962205189.json": "Offices are becoming obsolete because of the pandemic. Here's what happens to them next. https://t.co/7GfqzJOik0",
  "data/tweet-wsj/2021/12/1472654241995149320.json": "NYU’s ignominious distinction: By many measures, it is among the worst schools for leaving families and graduate students drowning in debt. https://t.co/JdHx1Pxavn",
  "data/tweet-wsj/2021/12/1472397534639316998.json": "Lawyers for Ghislaine Maxwell are highlighting a fund that awarded nearly $125 million to Jeffrey Epstein’s victims as part of their effort to discredit four accusers who testified at trial. https://t.co/8Msf8be10Z",
  "data/tweet-wsj/2021/12/1472801469254545409.json": "Take an early look at the front page of The Wall Street Journal https://t.co/yO88w3biq4 https://t.co/Ifw0qztAVS",
  "data/tweet-wsj/2021/12/1472778838866341895.json": "Many NYU graduate degrees don’t pay off. Comparing debt loads with early-career earnings, it ranked worst of any university in 15 graduate programs. https://t.co/AXjgxPL2Qf",
  "data/tweet-wsj/2021/12/1472737272621637635.json": "European countries have set new restrictions in an effort to stem the spread of the Omicron variant, with the Netherlands going into lockdown and Ireland imposing a curfew https://t.co/Hvmap16g3u",
  "data/tweet-wsj/2021/12/1472635378259615752.json": "The Netherlands on Sunday became the first European government to reimpose a lockdown in the face of Omicron. Germany said it would curb travel from the U.K., while Ireland imposed a curfew. https://t.co/2QIZpOQjGe",
  "data/tweet-wsj/2021/12/1472820330695733250.json": "Chinese tennis star Peng Shuai denied accusing anyone of sexual assault, suggesting a global wave of concern for her safety was the result of misunderstandings https://t.co/vXuk5hLktg",
  "data/tweet-wsj/2021/12/1472892066577457159.json": "A booster dose of Moderna’s Covid-19 vaccine showed signs of working well against the Omicron variant, with the latest lab results suggesting people who are boosted may have good protection against the strain. https://t.co/6OfOSgWK79",
  "data/tweet-wsj/2021/12/1472909662974578695.json": "What Turkey’s currency crisis has to do with the global supply chain of Nutella  https://t.co/pO84QWP63u",
  "data/tweet-wsj/2021/12/1472922286202269703.json": "Billionaire Elon Musk, the world’s richest person, said he’ll pay more than $11 billion in taxes this year, a disclosure that came after saying last week that he would pay more taxes than any American in history this year https://t.co/atonhOJBmo",
  "data/tweet-wsj/2021/12/1472752758763700225.json": "YouTube TV and Disney reached a deal to restore access to Disney-owned channels, including ESPN and FX, for YouTube TV subscribers https://t.co/ss3tbc4CIt",
  "data/tweet-wsj/2021/12/1472894584770506757.json": "New research shows that just 0.01% of bitcoin holders controls 27% of the currency in circulation  https://t.co/94sXevu816",
  "data/tweet-wsj/2021/12/1472901119613579268.json": "“Spider-Man: No Way Home” opened to a record-setting $253 million at the box office this weekend, amid concerns the spread of the Omicron variant could slow moviegoing #WSJWhatsNow https://t.co/ZWYNcUWRnW",
  "data/tweet-wsj/2021/12/1472960012167352336.json": "Meet the ham sniffers of Spain. (Yes, their job is to sniff hams.) And this is their busy season. https://t.co/L6aR4KMe4B",
  "data/tweet-wsj/2021/12/1472978725516058628.json": "Donald Trump filed a lawsuit against New York Attorney General Letitia James, accusing her of a political vendetta and abusing her office to harass him https://t.co/hcajwIldPk",
  "data/tweet-wsj/2021/12/1472926344145211396.json": "Oracle is expected to pay about $95 a share for electronic-medical-records company Cerner, or more than $30 billion, people familiar say, in a deal that could be announced later today https://t.co/jAEBzzCUVZ",
  "data/tweet-wsj/2021/12/1473024160695738370.json": "Former President Donald Trump said he received a Covid-19 vaccine booster shot after previously saying he wasn’t likely to get the additional vaccine dose https://t.co/TXBQ5Fpkgo",
  "data/tweet-wsj/2021/12/1472997763314905088.json": "Florida officials are preparing to feed manatees lettuce and other greens in an effort to avoid mass starvation caused by poor water quality https://t.co/Yz6WgT6N0M",
  "data/tweet-wsj/2021/12/1473111090481537024.json": "Remember those giant JNCO jeans from the 1990s? Well, they're back in style. https://t.co/jIXdQuOZlM",
  "data/tweet-wsj/2021/12/1473103469938716684.json": "An NYU grad has more than $160,000 in student loans and struggles to land a job in her field. So she sells her eggs. https://t.co/Ka8tiptgtC",
  "data/tweet-wsj/2021/12/1473095939669872647.json": "The expert ham sniffer of Spain is “at the limit of human possibility” smelling 800 hams a day to make sure they are perfect for Christmas.​ ​“I will find a way to sniff 801. Perhaps 802 is possible.” https://t.co/gNnNMYjLWk",
  "data/tweet-wsj/2021/12/1473148760997912580.json": "Former President Donald Trump said he received a Covid-19 vaccine booster shot after previously saying he wasn’t likely to get the additional vaccine dose https://t.co/YAlsKu8kjs",
  "data/tweet-wsj/2021/12/1473129885325537282.json": "From @WSJopinion: On behalf of all Hispanic Americans, I say no más to this politically correct linguistic monstrosity, writes Charlotte Allen https://t.co/SKUDdi5Og5",
  "data/tweet-wsj/2021/12/1473171404199710720.json": "The expert ham sniffer of Spain smells 800 hams a day during the Christmas season. He is strained, he said, “at the limit of human possibility.” https://t.co/sjbcV6kNeN",
  "data/tweet-wsj/2021/12/1472846749362536454.json": "Nike is betting that sneakerheads will want to collect virtual kicks in the form of NFTs https://t.co/2vytkVJlFF",
  "data/tweet-wsj/2021/12/1473156312376692737.json": "A group of 12 missionaries held hostage made a daring overnight escape last week in Haiti, walking for miles over harsh terrain with children in tow, according to Christian Aid Ministries https://t.co/NRQO2eQ55M",
  "data/tweet-wsj/2021/12/1473235561553006598.json": "The U.S. plans to distribute 500 million free at-home Covid tests and send federal medical workers to overburdened hospitals, officials said https://t.co/eFPRHZGuMO",
  "data/tweet-wsj/2021/12/1473311074741100556.json": "From @WSJopinion: The party that constantly seeks control over our lives is now governing—or failing to govern—a nation that is spinning wildly out of control, writes @gerardtbaker https://t.co/XdHRYD5RcV",
  "data/tweet-wsj/2021/12/1473329946957393921.json": "An unprecedented peek inside a dinosaur egg revealed a perfectly preserved oviraptor—and a surprise about the way the animals hatched https://t.co/o0MxdBbEYw",
  "data/tweet-wsj/2021/12/1472981423187542016.json": "Tennis star Rafael Nadal said he tested positive for Covid-19 after arriving in Spain from a tournament in Abu Dhabi https://t.co/Nw8tidSI48",
  "data/tweet-wsj/2021/12/1473137415007182848.json": "The House committee investigating the Jan. 6 attack on the U.S. Capitol says it wants to question GOP Rep. Scott Perry about efforts to replace an acting attorney general https://t.co/XHuPYYmxPx",
  "data/tweet-wsj/2021/12/1473438172684197888.json": "A jury on Tuesday found Harvard professor Charles Lieber guilty on six counts related to payments he received from a Chinese government talent program https://t.co/vlEmHjm6FQ",
  "data/tweet-wsj/2021/12/1473435647662870528.json": "One hundred times as powerful as Hubble, the James Webb telescope could show the face of Abraham Lincoln on a penny from 24 miles away https://t.co/jft9LjMyqy",
  "data/tweet-wsj/2021/12/1473488522548060171.json": "An unprecedented peek inside a dinosaur egg revealed a perfectly preserved oviraptor—and a surprise about the way the animals hatched https://t.co/sZ3MSz2XoF",
  "data/tweet-wsj/2021/12/1473503620972912641.json": "One hundred times as powerful as Hubble, the James Webb telescope could show the face of Abraham Lincoln on a penny from 24 miles away https://t.co/nlPrIIAO5v",
  "data/tweet-wsj/2021/12/1473514897245982726.json": "A London court awarded the ex-wife of Dubai's ruler a divorce settlement of more than $728 million, in a rare case that pulled back the curtain on one of the world’s richest families https://t.co/eFunoArRWA",
  "data/tweet-wsj/2021/12/1473594215045206024.json": "On Friday, NASA will launch the largest and most powerful space telescope ever built https://t.co/esXgg3HHJq",
  "data/tweet-wsj/2021/12/1473526262341771266.json": "Take an early look at the front page of The Wall Street Journal https://t.co/qq4ZCyBiaa https://t.co/oAPTDzn4iK",
  "data/tweet-wsj/2021/12/1473465828980973569.json": "The Biden administration is considering another extension to the moratorium on student-loan payments put in place at the start of the pandemic https://t.co/kbTY0G1Hoy",
  "data/tweet-wsj/2021/12/1473705127022407692.json": "Breaking: The U.S. cleared use of a Covid-19 pill from Pfizer, the first drug that newly infected patients can now take at home to stay out of the hospital https://t.co/xsOgICOFyL",
  "data/tweet-wsj/2021/12/1473703272649220102.json": "The risk of hospitalization from Omicron is substantially lower than from Delta, new studies in Scotland and South Africa suggest https://t.co/sK44728fNN",
  "data/tweet-wsj/2021/12/1473692961816854542.json": "Elon Musk says his primary home is a “kinda awesome” $50,000 house that he rents in South Texas near the Mexican border. He also has been living in a mansion in Austin. https://t.co/KpEbxMYZJ7",
  "data/tweet-wsj/2021/12/1473720023625740297.json": "President Biden extended the pause on student-loan payments to May 1. It had been scheduled to expire at the end of January. https://t.co/qRtuCyyjJf",
  "data/tweet-wsj/2021/12/1473661292183535618.json": "The Omicron variant’s spread across the U.S. threatens to drive up cases, as many people head indoors during the cold weather. The season, it turns out, appears to play an important role in where Covid-19 strikes most. https://t.co/Cv861Um2Ra",
  "data/tweet-wsj/2021/12/1473782972138545156.json": "At least $100 billion has been stolen from Covid-19 relief programs designed to help individuals and businesses harmed by the pandemic, the U.S. Secret Service said https://t.co/D6lbb2gpcz",
  "data/tweet-wsj/2021/12/1473088352001970178.json": "Pandemic stress, the erosion of boundaries between personal and professional spheres, and an exhausted slide toward casualness are making many of us swear more https://t.co/A4e1PlBeMg",
  "data/tweet-wsj/2021/12/1473794244213104647.json": "Pop star Camila Cabello sold her Hollywood Hills home for $4.3 million after only nine days on the market https://t.co/66L91uN5uX",
  "data/tweet-wsj/2021/12/1473779152289419265.json": "TikTok was the world’s most visited site on the internet in 2021, surpassing last year’s leader, Google https://t.co/p8r8GtqtpD",
  "data/tweet-wsj/2021/12/1473741418866823173.json": "Amazon said all workers at its hundreds of U.S. warehouses will have to wear masks again starting Wednesday, a mandate prompted by the rapid spread of the coronavirus’s Omicron variant https://t.co/8gJhlwu0Mu",
  "data/tweet-wsj/2021/12/1473831991288242176.json": "President Biden said he's eager to run for reelection against Donald Trump in 2024, and expressed regret that he didn’t act more quickly to distribute Covid-19 tests to the public https://t.co/wfJDMPxubK",
  "data/tweet-wsj/2021/12/1473843319964852230.json": "New evidence has emerged that the Omicron variant may cause significantly less serious disease than earlier strains of Covid-19, as infections hit records in some parts of the U.S. https://t.co/fBX28L82f8",
  "data/tweet-wsj/2021/12/1473809357397794819.json": "Former Twitter CEO Jack Dorsey has triggered a debate among tech stalwarts over how decentralized the future internet may be https://t.co/Trd6BMjt2h",
  "data/tweet-wsj/2021/12/1473194049410637826.json": "Meet the ham sniffers of Spain. (Yes, their job is to sniff hams.) And this is their busy season. https://t.co/UMrIiueKXR",
  "data/tweet-wsj/2021/12/1473873516424482817.json": "The risk of hospitalization from Omicron is substantially lower than from Delta, new studies in Scotland and South Africa suggest https://t.co/A0Zm2dKiDa",
  "data/tweet-wsj/2021/12/1473869750258262016.json": "At least $100 billion has been stolen from Covid-19 relief programs designed to help individuals and businesses harmed by the pandemic, the U.S. Secret Service said https://t.co/DTiEwFCMKk",
  "data/tweet-wsj/2021/12/1473881061272793095.json": "The “Pillar of Shame,” a monument commemorating the victims of the Tiananmen Square massacre, stood at the University of Hong Kong for more than two decades until it was removed Thursday https://t.co/kACqTNFUSe",
  "data/tweet-wsj/2021/12/1473847104930033667.json": "Elon Musk says his primary home is a “kinda awesome” $50,000 house that he rents in South Texas near the Mexican border. He also has been living in a mansion in Austin. https://t.co/ZCv9iQ97JE",
  "data/tweet-wsj/2021/12/1473643299370065925.json": "Pope Francis appointed Sister Nathalie Becquart as the first woman to serve as an undersecretary of the Synod of Bishops earlier this year. “I felt as if I was at the beginning of a new adventure, called to go into the deep sea,” she said. https://t.co/seVUIRunTg",
  "data/tweet-wsj/2021/12/1473911292612198403.json": "From @WSJopinion: Alexandria Ocasio-Cortez is already the shadow Majority Leader, so she might as well try and make it official. If the Senate is so awful, run to win and clean it up. https://t.co/eac4pYrMVl",
  "data/tweet-wsj/2021/12/1473888641646747656.json": "Take an early look at the front page of The Wall Street Journal https://t.co/kQkuhLXIdk https://t.co/wvumghY6fF",
  "data/tweet-wsj/2021/12/1473767882135855119.json": "From @WSJopinion: Forcing immune, young, healthy, low-risk students to get a third vaccine shot is excessive and wasteful, writes @MartyMakary. Precious vaccine doses should be going to poor countries that still don’t have enough.\nhttps://t.co/yqZK9HgVPM",
  "data/tweet-wsj/2021/12/1474016988183810053.json": "The resurgence of Covid-19 in Europe means another Christmas in isolation for many elderly Italians. \"For people that age, seeing their loved ones is in most cases the only reason to live,\" said one psychologist. https://t.co/sz9pWy9Rp7",
  "data/tweet-wsj/2021/12/1473462061392879621.json": "In the first 10 months of this year, American workers handed in nearly 39 million resignations. Bosses say rampant workplace burnout is a big problem. https://t.co/jUhkm9JWse",
  "data/tweet-wsj/2021/12/1473996551215325187.json": "Elon Musk unloaded more Tesla stock on Wednesday, bringing the total value of his share sales to over $15 billion since he embarked on a selling spree last month #WSJWhatsNow https://t.co/tALbGcitdZ",
  "data/tweet-wsj/2021/12/1473981752058294272.json": "Can you pass a Covid test? Congratulations! You’re on the Orlando Magic. https://t.co/9YPXsIMbk9",
  "data/tweet-wsj/2021/12/1474071244299505665.json": "Joan Didion, the literary journalist and novelist whose writings included chronicles of life in Los Angeles and \"The Year of Magical Thinking,\" has died at 87 https://t.co/nmZdnT7fu2",
  "data/tweet-wsj/2021/12/1474075347230593030.json": "People infected with Omicron are between 50% to 70% less likely to be hospitalized than those with Delta, according to a U.K, study that adds to a growing body of evidence on the variant’s reduced severity in populations with high levels of immunity https://t.co/dwBDT5xK15",
  "data/tweet-wsj/2021/12/1473824459324809221.json": "U.S. Rep. Mary Gay Scanlon was carjacked at gunpoint in Philadelphia Wednesday as she walked to her car from a meeting, her office said",
  "data/tweet-wsj/2021/12/1473737610220740613.json": "The Chinese city of Xi’an on Wednesday ordered its 13 million residents to stay at home and avoid unnecessary outings in one of the biggest lockdowns in the country this year https://t.co/a4pGMpnH5c",
  "data/tweet-wsj/2021/12/1474104310216761355.json": "Breaking: Kimberly Potter, the former police officer who shot and killed Daunte Wright in a traffic stop, was found guilty of first and second degree manslaughter https://t.co/tPThSEK7s8",
  "data/tweet-wsj/2021/12/1473854639984553986.json": "A college a capella choir director first came up with the lyrics for “Merry Christmas Darling.” Then the Carpenters turned it into a seasonal hit. https://t.co/XvfsNzxxUb",
  "data/tweet-wsj/2021/12/1473641974246920200.json": "Almost two years into the pandemic that left millions doing their jobs from home, American workers say they are burned out, and employers are struggling to respond #WSJWhatsNow https://t.co/TIqSOoyjzC",
  "data/tweet-wsj/2021/12/1474171744609050624.json": "From @WSJopinion: If the GOP can’t learn to shake the Trump obsession with alleged election fraud, the former president could hand Democrats the White House—again, writes @KarlRove https://t.co/G64Z3JOyUH",
  "data/tweet-wsj/2021/12/1474035819606274048.json": "TikTok became the world’s most visited site in 2021, even surpassing Google, new research shows #WSJWhatsNow https://t.co/cxwvgPAtHz",
  "data/tweet-wsj/2021/12/1474031385845374997.json": "The U.S. cleared the use of Merck’s Covid-19 pill molnupiravir, the latest easy-to-use therapy that infected people can take to keep out of the hospital https://t.co/DUiAahMt3V",
  "data/tweet-wsj/2021/12/1474190629030793222.json": "Saudi Arabia has imported sensitive missile technology from the Chinese military and is manufacturing its own ballistic missiles, according to Saudi advisers and officials familiar with U.S. intelligence, raising new worries of a Middle East arms race  https://t.co/LO1ipeUSck",
  "data/tweet-wsj/2021/12/1474073326133854214.json": "“It’s like nothing anyone has ever seen before.” Jeff Bezos, Mark Zuckerberg and many others have poured money into Hawaii real estate since the start of the pandemic. https://t.co/4XlDEhF42X",
  "data/tweet-wsj/2021/12/1473941463331393539.json": "Elon Musk says his primary home is a “kinda awesome” $50,000 house that he rents in South Texas near the Mexican border. He also has been living in a mansion in Austin. https://t.co/1M4GTF6Lmt",
  "data/tweet-wsj/2021/12/1474049189818548240.json": "Federal judges have often fought off attempts by Congress to impose ethics or accountability rules. Lawmakers are making a new run at it now. https://t.co/4pt6jcblIe",
  "data/tweet-wsj/2021/12/1474198210008817668.json": "“It’s like nothing anyone has ever seen before.” Jeff Bezos, Mark Zuckerberg and many others have poured money into Hawaii real estate since the start of the pandemic. https://t.co/UWH36q5gvf",
  "data/tweet-wsj/2021/12/1474217035731193873.json": "United is canceling dozens of flights over the holiday weekend, as a surge of Covid-19 cases impacts crews. Delta also cited the variant as a factor behind a number of cancellations. https://t.co/uSbUhcztXk",
  "data/tweet-wsj/2021/12/1474341621638570002.json": "The James Webb Space Telescope—the Hubble’s successor—would be the biggest and most powerful observatory ever launched into space. Here’s how it will transform our understanding of the cosmos. https://t.co/TMXLUAn3vw",
  "data/tweet-wsj/2021/12/1474322735857872896.json": "Former South Korean President Park Geun-hye was pardoned in a surprise decision that will set her free after serving less than a quarter of her 22-year prison sentence for bribery and corruption https://t.co/INILkIpEUq",
  "data/tweet-wsj/2021/12/1474228392719532032.json": "Review: Keanu Reeves stars as Thomas Anderson in \"Matrix Resurrections,\" the fourth installment of the franchise https://t.co/4GMuhObwTy",
  "data/tweet-wsj/2021/12/1474224578478100531.json": "Kimberly Potter, the former police officer who shot and killed Daunte Wright in a traffic stop, was found guilty of first and second degree manslaughter https://t.co/ufUeLAf5IK",
  "data/tweet-wsj/2021/12/1474387107493945348.json": "One hundred times as powerful as Hubble, the James Webb telescope could show the face of Abraham Lincoln on a penny from 24 miles away https://t.co/B4e4c16Zrk",
  "data/tweet-wsj/2021/12/1474288792802676738.json": "LuLu Hypermarket has run out of artificial Christmas trees. That wouldn't be surprising except for one thing. It's in Saudi Arabia. https://t.co/H7ylQMIHMC",
  "data/tweet-wsj/2021/12/1474232144268517377.json": "Teachers fret as hundreds of books are pulled from school libraries, and the country’s largest teachers union pledges to challenge every new law that define how schools and colleges can teach subjects related to discrimination, race and gender https://t.co/Z7RAB6AQ5T",
  "data/tweet-wsj/2021/12/1474209484314660870.json": "Russian mercenaries have deployed to the African country of Mali, European governments said, opening a new front in a confrontation with the West at the same time as Moscow has gathered military forces around Ukraine https://t.co/YDa787KD5b",
  "data/tweet-wsj/2021/12/1474349151508996101.json": "Texas Instruments is worth $170 billion, and it’s thanks to analog chips, not calculators https://t.co/1DPxj9NwQx",
  "data/tweet-wsj/2021/12/1474443518089302021.json": "From @WSJopinion: Suddenly it’s fact that there’s no real way to stop a respiratory virus and maybe we should stop our heroic efforts that destroy so much about our lives in the pursuit of eradicating Covid, writes @karol https://t.co/unnkWhVnZh",
  "data/tweet-wsj/2021/12/1474081143003701248.json": "From @WSJopinion: A senator takes a stand against the American left’s style of doing politics, writes @DanHenninger https://t.co/VdnVDBKVk5",
  "data/tweet-wsj/2021/12/1474488043373486091.json": "New York said some workers who test positive for Covid-19, including teachers and grocery employees, could return to work after as little as five days https://t.co/Hp3hpJvGGI",
  "data/tweet-wsj/2021/12/1474534180310728719.json": "From @WSJopinion: Joe Manchin and John McCain appealed to their colleagues to do better for America and showed how regular order can be done, writes Joe Lieberman https://t.co/nT0EExK4Aj",
  "data/tweet-wsj/2021/12/1474575668402921476.json": "The expert ham sniffer of Spain smells 800 hams a day during the Christmas season. He is strained, he said, “at the limit of human possibility.” https://t.co/ofmHAMxz7W",
  "data/tweet-wsj/2021/12/1474583186625728517.json": "A college a capella choir director first came up with the lyrics for “Merry Christmas Darling.” Then the Carpenters turned it into a seasonal hit. https://t.co/F9ZCekQ3VT",
  "data/tweet-wsj/2021/12/1474624720502992902.json": "From @WSJopinion: You don’t cut poverty by increasing people’s reliance on government. You do it by making them self-reliant, writes Tomas J. Philipson https://t.co/PNxIEZ3ZV2",
  "data/tweet-wsj/2021/12/1474659988824018944.json": "The James Webb Space Telescope—the Hubble’s successor—would be the biggest and most powerful observatory ever launched into space. Here’s how it will transform our understanding of the cosmos. https://t.co/8K9VnqiYGq",
  "data/tweet-wsj/2021/12/1474586977785765889.json": "The Boy Scouts said a proposed settlement trust to compensate survivors of sexual abuse is now expected to exceed $2.6 billion https://t.co/UdJIA62XQb",
  "data/tweet-wsj/2021/12/1474511478204125185.json": "The rich are borrowing against their stocks more than ever before, banks say. Taxes are a big reason for the “buy, borrow, die” strategy. https://t.co/WP7i2VqegL",
  "data/tweet-wsj/2021/12/1474568115380011009.json": "What Turkey’s currency crisis has to do with the global supply chain of Nutella  https://t.co/FQQyKBEesw",
  "data/tweet-wsj/2021/12/1474724924380045313.json": "The James Webb Space Telescope, the largest, most powerful instrument of its type ever built, launched successfully to herald a new era of space discovery https://t.co/zg9Yxor1DP",
  "data/tweet-wsj/2021/12/1474598306928119814.json": "TV actors who aren’t vaccinated against Covid-19 are seeing their characters sent on a trip—or worse https://t.co/Yx4nPwOBI6",
  "data/tweet-wsj/2021/12/1474696790528208899.json": "Independent shops are thriving in Britain, offering hope for the global retail industry. “We can’t compete with Amazon on price,” says an independent bookseller. “But we offer something they don’t.” https://t.co/cZWn47SptB",
  "data/tweet-wsj/2021/12/1474703993905504257.json": "Pope Francis, in his annual Christmas message, highlighted the social impact of the pandemic while reiterating his previous calls for equitable distribution of Covid-19 vaccines https://t.co/x4WzR4cz5T",
  "data/tweet-wsj/2021/12/1474752810730283015.json": "Latin America, once a hot spot of Covid-19 deaths, now leads much of the world in vaccinations, as health policy makers rush to shield their countries from new variants roiling other regions https://t.co/hg7jGPo1LT",
  "data/tweet-wsj/2021/12/1474432182835941404.json": "Elon Musk unloaded more Tesla stock on Wednesday, bringing the total value of his share sales to over $15 billion since he embarked on a selling spree last month #WSJWhatsNow https://t.co/HEg82Zh9To",
  "data/tweet-wsj/2021/12/1474802159506104328.json": "An unprecedented peek inside a dinosaur egg revealed a perfectly preserved oviraptor—and a surprise about the way the animals hatched https://t.co/ZZUQ4qFzBU",
  "data/tweet-wsj/2021/12/1474855003558924294.json": "President Biden said he's eager to run for reelection against Donald Trump in 2024, and expressed regret that he didn’t act more quickly to distribute Covid-19 tests to the public https://t.co/Nea6jqcTjT",
  "data/tweet-wsj/2021/12/1474866310899245063.json": "Why Mark Zuckerberg may be wrong about the metaverse as the inevitable next paradigm shift in the digital world https://t.co/cST95DrhPK",
  "data/tweet-wsj/2021/12/1474907873893392388.json": "In the first 10 months of this year, American workers handed in nearly 39 million resignations. Bosses say rampant workplace burnout is a big problem. https://t.co/qyJ7MnHdUq",
  "data/tweet-wsj/2021/12/1474870099836293120.json": "TikTok was the world’s most visited site on the internet in 2021, according to Cloudflare https://t.co/dgHzGguy1n",
  "data/tweet-wsj/2021/12/1474745527346634752.json": "Thousands of seafarers are stuck at sea working beyond their maximum 11-month contracts, as Omicron’s emergence crimps cargo ship operators’ ability to change over crews https://t.co/5ujacnICLd",
  "data/tweet-wsj/2021/12/1474851464937885702.json": "Director Adam McKay says he wanted “Don’t Look Up” to be a laugh-out-loud comedy. But he also notes the risks in making such movies these days. https://t.co/Zl7TC0c5zR",
  "data/tweet-wsj/2021/12/1474945590974951437.json": "In his annual Christmas message, Pope Francis highlighted the social impact of the pandemic while reiterating his previous calls for equitable distribution of Covid-19 vaccines https://t.co/iTZGXSV1Vd",
  "data/tweet-wsj/2021/12/1474960709574438916.json": "Latin America leads the U.S. and much of the world in vaccinations. Applying a mix of Chinese, European and American vaccines, about 62% of South America’s population has received two shots or the single dose by Johnson &amp; Johnson. https://t.co/P7r0H2l0tZ",
  "data/tweet-wsj/2021/12/1474681365832650753.json": "Where in the world is Elon Musk? Despite selling his real estate, he can be found in a colossal, waterfront Austin mansion https://t.co/IOP7JJQv2q",
  "data/tweet-wsj/2021/12/1474862564505010180.json": "China is entering a new hyperpoliticized reality likely to do long-term damage to its economic performance, says China expert Barry Naughton https://t.co/nsGcgYV6dh",
  "data/tweet-wsj/2021/12/1475009759451484163.json": "Desmond Tutu, the Anglican archbishop who won the Nobel Peace Prize for helping to end apartheid, has died. https://t.co/6ca38JU4mo?",
  "data/tweet-wsj/2021/12/1474636035883687939.json": "A college a capella choir director first came up with the lyrics for “Merry Christmas Darling.” Then the Carpenters turned it into a seasonal hit. https://t.co/w6jTkE9j7I",
  "data/tweet-wsj/2021/12/1474553010839826432.json": "For Sian Proctor, part of the first all-civilian crew to orbit the Earth, the fear wasn't on the launchpad. The fear was that she would never get there. https://t.co/mzPakECNjB",
  "data/tweet-wsj/2021/12/1474990909485993984.json": "Russian mercenaries have deployed to the African country of Mali, European governments said, opening a new front in a confrontation with the West https://t.co/2HB0TLf5ft",
  "data/tweet-wsj/2021/12/1475051280800354304.json": "Desmond Tutu, an Anglican archbishop who led a global campaign to end South Africa’s racist policies and then helped in healing the nation’s wounds, has died at 90 https://t.co/1mUZANVsI9",
  "data/tweet-wsj/2021/12/1475089098285228039.json": "At least $100 billion has been stolen from Covid-19 relief programs designed to help individuals and businesses harmed by the pandemic, the U.S. Secret Service said https://t.co/mV4uiCOjKv",
  "data/tweet-wsj/2021/12/1475100350747131908.json": "The owners of a tech incubator in Rome are resurrecting a hydropower plant designed more than 125 years ago by Albert Einstein’s father https://t.co/URV4XzqyDU",
  "data/tweet-wsj/2021/12/1475081487573831684.json": "In a city where Russia triumphed 300 years ago, Ukrainians are mobilizing to resist another Russian leader, Vladimir Putin     https://t.co/NB1v459nvY",
  "data/tweet-wsj/2021/12/1475070163724771332.json": "An attack by Myanmar’s military killed dozens of people, including children, in a part of the country where resistance groups have been fighting the junta  https://t.co/TwJMS26hgn",
  "data/tweet-wsj/2021/12/1474938059078750210.json": "How the Taliban head-faked the world: “Monopoly of power is a story of failure,” a spokesman said—six months before the group seized Kabul and monopolized all power https://t.co/YSztGj5teT",
  "data/tweet-wsj/2021/12/1475115453181837319.json": "One hundred times as powerful as Hubble, the James Webb telescope could show the face of Abraham Lincoln on a penny from 24 miles away https://t.co/00uBHMxde2",
  "data/tweet-wsj/2021/12/1475096586350903300.json": "An NYU grad has more than $160,000 in student loans and struggles to land a job in her field. So she sells her eggs. https://t.co/yEr33NyiSu",
  "data/tweet-wsj/2021/12/1475145659556712452.json": "Anglican archbishop Desmond Tutu, who has died at age 90, led a global campaign to end South Africa’s racist policies and helped in healing the nation’s wounds https://t.co/S2OZRM0D25",
  "data/tweet-wsj/2021/12/1475138104633741314.json": "Former Twitter CEO Jack Dorsey has triggered a debate among tech stalwarts over how decentralized the future internet may be https://t.co/xaF8Hpa7wZ",
  "data/tweet-wsj/2021/12/1475164599964082176.json": "The expert ham sniffer of Spain smells 800 hams a day during the Christmas season. He is strained, he said, “at the limit of human possibility.” https://t.co/lMigsQHuKX",
  "data/tweet-wsj/2021/12/1475013591493496832.json": "No one in Japanese Prime Minister Fumio Kishida’s government will attend the Beijing Olympics. But Tokyo isn’t calling it a boycott. https://t.co/BqxmTMSdNi",
  "data/tweet-wsj/2021/12/1475221160086409227.json": "Doctors around the country say TikTok is driving an increase in teen patients convinced they have rare mental disorders: \"It can be tricky when there’s a strong clinging to a particular diagnosis.\"",
  "data/tweet-wsj/2021/12/1475202269889052674.json": "Former workers of AT&amp;T will see life insurance that was promised to them, in some cases decades ago, cut back unless they die by Dec. 31 https://t.co/CVvrvXQt8B",
  "data/tweet-wsj/2021/12/1475180875134517252.json": "What Turkey’s currency crisis has to do with the global supply chain of Nutella  https://t.co/35zrX5Ubym",
  "data/tweet-wsj/2021/12/1475240061771866121.json": "The owners of a tech incubator in Rome are resurrecting a hydropower plant designed more than 125 years ago by Albert Einstein’s father https://t.co/jdFfVmByd4",
  "data/tweet-wsj/2021/12/1474873854719938560.json": "“It’s like nothing anyone has ever seen before.” Jeff Bezos, Mark Zuckerberg and many others have poured money into Hawaii real estate since the start of the pandemic. https://t.co/sD5bHaGsQT",
  "data/tweet-wsj/2021/12/1475111690597449737.json": "As thousands of Venezuelan women leave their collapsing country in search of a better life, many are lured into sex trafficking https://t.co/kWeR0GsHhK",
  "data/tweet-wsj/2021/12/1475307996972519426.json": "New research shows that just 0.01% of bitcoin holders control 27% of the currency in circulation  https://t.co/r4pO4JelAE",
  "data/tweet-wsj/2021/12/1475304194412273669.json": "TikTok has become the new “Dr. Google” for teens, and some are diagnosing themselves with rare mental disorders. “It really messed with my head,” an 18-year-old said. https://t.co/hV8dZwDBHU",
  "data/tweet-wsj/2021/12/1475360831684624385.json": "Bees do it. Can we? When a dangerous, virus-carrying parasite enters the hive, bees spread out and foil its transmission. https://t.co/g0b1CIwnmv",
  "data/tweet-wsj/2021/12/1475353281878765570.json": "Former workers of AT&amp;T will see life insurance that was promised to them, in some cases decades ago, cut back unless they die by Dec. 31 https://t.co/gDfb6fBmd4",
  "data/tweet-wsj/2021/12/1475338178827595778.json": "Take an early look at the front page of The Wall Street Journal https://t.co/NKrus9IHJM https://t.co/1ry7Rmhrs3",
  "data/tweet-wsj/2021/12/1475530697918013440.json": "From @WSJopinion: Vice President Harris says the main threats to U.S. national security are climate change and American democracy. Can someone help her out? https://t.co/MV7yfTs4dE",
  "data/tweet-wsj/2021/12/1475492946518712323.json": "Edward O. Wilson, the pioneering Harvard biologist who argued for a new vision of human nature in “Sociobiology” and warned against the decline of ecosystems, has died. He was 92. https://t.co/JuxY31LMRB",
  "data/tweet-wsj/2021/12/1475485404556058628.json": "From @WSJopinion: Joe Manchin has no reason to apologize for asking that a bill to transform America be subject to regular Congressional order https://t.co/sJUSQQGpuT",
  "data/tweet-wsj/2021/12/1475440099722735616.json": "Pandemic’s hidden toll: millions in U.K. await treatment, but not for Covid-19 https://t.co/ppycPt5IzF",
  "data/tweet-wsj/2021/12/1475323072681062408.json": "Pope Francis appointed Sister Nathalie Becquart as the first woman to serve as an undersecretary of the Synod of Bishops earlier this year. “I felt as if I was at the beginning of a new adventure, called to go into the deep sea,” she said. https://t.co/3ECYUaxrrS",
  "data/tweet-wsj/2021/12/1475586144297529344.json": "U.S. officials have cut the number of days that they recommend people should isolate for after being infected with Covid-19 https://t.co/EVsEzAEjOh",
  "data/tweet-wsj/2021/12/1475666591597703168.json": "From @WSJopinion: If Congress is truly concerned about the Communist Chinese threat, cutting off the flow of Wall Street dollars that is funding Chinese tech growth should be its highest legislative priority, writes @robertcobrien https://t.co/UBv0hYkJfr",
  "data/tweet-wsj/2021/12/1475730766684426243.json": "The owners of a tech incubator in Rome are resurrecting a hydropower plant designed more than 125 years ago by Albert Einstein’s father https://t.co/K9Pt5pDDvG",
  "data/tweet-wsj/2021/12/1475560887738118156.json": "An NYU grad has more than $160,000 in student loans and struggles to land a job in her field. So she sells her eggs. https://t.co/9EDNBXmHf9",
  "data/tweet-wsj/2021/12/1475794923534303234.json": "The mummy of the Egyptian pharoah Amenhotep I, who lived more than 3,500 years ago, has been “digitally unwrapped,” thanks to CT scans https://t.co/VlICi6FH4k",
  "data/tweet-wsj/2021/12/1475779819031961602.json": "People who test positive for Covid-19 and don't have symptoms can isolate for five days instead of 10 the CDC has said https://t.co/Q2ejYDUk4K",
  "data/tweet-wsj/2021/12/1475681691456970755.json": "Where in the world is Elon Musk? Despite selling his real estate, he can be found in a colossal, waterfront Austin mansion https://t.co/0k8VK1j7ft",
  "data/tweet-wsj/2021/12/1475847767151067137.json": "From @WSJopinion: Joe Biden is running his presidency as if he were still a senator. That's a problem, writes @wjmcgurn. https://t.co/76rkiuhXXU",
  "data/tweet-wsj/2021/12/1475455193441619974.json": "“The toxic environment has been building for a long, long time before Jan. 6, but Jan. 6, just blew it up in flames.” Fallout from the attack on the Capitol fractured House relationships, further undercutting comity. https://t.co/jqwewH4Db4",
  "data/tweet-wsj/2021/12/1475988536650260487.json": "John Madden, Hall of Fame Oakland Raiders coach, longtime broadcaster and name behind the blockbuster football videogame, has died at 85 https://t.co/w5ZRYg17O2",
  "data/tweet-wsj/2021/12/1475844032144285697.json": "The U.S. touted female Afghan service members as a flagship accomplishment of its effort to empower women in Afghanistan. But almost all of them have been left behind, fearing for their lives. https://t.co/lP8RqJUr0T",
  "data/tweet-wsj/2021/12/1475964853651132419.json": "Why Mark Zuckerberg may be wrong about the metaverse as the inevitable next paradigm shift in the digital world https://t.co/LBdYWTcgVb",
  "data/tweet-wsj/2021/12/1475885510283382789.json": "The surge in Covid-19 cases could disrupt jury deliberations in British socialite Ghislaine Maxwell’s sex-trafficking trial, a federal judge warned Tuesday https://t.co/3XVskucqSb",
  "data/tweet-wsj/2021/12/1476004807596982273.json": "Harry Reid, the former Democratic Senate Majority leader who led during the Obama presidency, has died at age 82 https://t.co/fCFya3AYNc",
  "data/tweet-wsj/2021/12/1476036533199290368.json": "During a 50-year career in which the game he loved changed so dramatically, legendary broadcaster John Madden enjoyed a popularity that was one of the few constants https://t.co/SDZnIv8Q6l",
  "data/tweet-wsj/2021/12/1476044080262127616.json": "Elon Musk has converted more than 1.5 million options into stock and sold more than 934,000 shares to cover associated taxes https://t.co/NrRNjbqgNx",
  "data/tweet-wsj/2021/12/1475893076199710729.json": "From @WSJopinion: Unlike his 2020 campaign message, Biden now tells governors that there’s “no federal solution” to Covid. It’s the job of the states. https://t.co/XxJEhTvc2J",
  "data/tweet-wsj/2021/12/1476100719296102400.json": "The mummy of the Egyptian pharoah Amenhotep I, who lived more than 3,500 years ago, has been “digitally unwrapped,” thanks to CT scans https://t.co/5Pk3urp1WU",
  "data/tweet-wsj/2021/12/1476130920012861443.json": "The arrests of seven people linked to a popular Hong Kong pro-democracy news site dealt a new blow to press freedom in the city https://t.co/vyvYp3OgXm",
  "data/tweet-wsj/2021/12/1476183757191360523.json": "Football coach and commentator John Madden, who died Tuesday at age 85, made a complex sport sound like backyard fun. That’s a small part of Madden’s deep legacy, writes @JasonGay https://t.co/JXyMTddkvk",
  "data/tweet-wsj/2021/12/1476138451292639235.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/AUSGROYKD3",
  "data/tweet-wsj/2021/12/1476032770413666312.json": "It’s not just the accent: Ted Lasso’s pop-culture references come so fast and furious that you’ve probably missed a lot. We’re here to help. https://t.co/tDsFw6xTjY",
  "data/tweet-wsj/2021/12/1475927047541243908.json": "Produce, dairy and packaged food such as bread and juice are among many food items set to become more pricey next year https://t.co/BpBi9vgKkt",
  "data/tweet-wsj/2021/12/1476247935889334281.json": "From @WSJopinion: A 10-day treatment costs only $4 and appears to greatly reduce symptoms, hospitalization and death, writes Allysia Finley https://t.co/WlKISQDYfX",
  "data/tweet-wsj/2021/12/1475911990384209923.json": "A Russian judge dissolved one of the country’s oldest and most prestigious organizations dedicated to human rights on Tuesday, a move that government critics say furthers President Vladimir Putin’s assault on dissent https://t.co/zcDARBI1Ag",
  "data/tweet-wsj/2021/12/1476315777510826001.json": "Breaking: Ghislaine Maxwell, longtime confidante of Jeffrey Epstein, was found guilty of some sex-trafficking counts, capping a yearslong push to bring her to justice https://t.co/AIC07h192p",
  "data/tweet-wsj/2021/12/1475991219155185669.json": "“They have relocated musicians, soccer players and artists, and their lives were not at risk as much as ours.” Afghanistan’s former female troops, once hailed by the West, fear for their lives. https://t.co/VneqAnkIm3",
  "data/tweet-wsj/2021/12/1476289465085841412.json": "From @WSJopinion: Biden’s presidency is not accomplishing much and maybe was never intended to, writes Holman Jenkins https://t.co/XYseBkQ3zN",
  "data/tweet-wsj/2021/12/1476309568607166475.json": "A federal judge rejected Oklahoma’s attempt to halt a Covid-19 vaccine mandate for its National Guard members https://t.co/2dpJ3Vcdxi",
  "data/tweet-wsj/2021/12/1476398903947837440.json": "Ghislaine Maxwell was found guilty on five of six criminal counts in her sex-trafficking case, including sex trafficking of minors, which carries a maximum sentence of 40 years in prison https://t.co/WjY4c8SJvH",
  "data/tweet-wsj/2021/12/1476402718612799488.json": "Many NYU graduate degrees don’t pay off. Comparing debt loads with early-career earnings, it ranked worst of any university in 15 graduate programs. https://t.co/SiH6FYhYyH",
  "data/tweet-wsj/2021/12/1476440444624162819.json": "Former Facebook executives said that after the whistleblower's disclosures, CEO Mark Zuckerberg told employees not to apologize https://t.co/joBEYuq1gA",
  "data/tweet-wsj/2021/12/1476606552408834048.json": "The sex-trafficking conviction of British socialite Ghislaine Maxwell brings a measure of justice to the scores of women who accused disgraced financier Jeffrey Epstein of sexual abuse, the accusers and their lawyers said https://t.co/ilsNrkhhPI",
  "data/tweet-wsj/2021/12/1476485742612422656.json": "From Albus to Draco, Harry Potter fans named their children after characters of the beloved series. We asked them and their kids how that turned out. https://t.co/sJSwQSbqsx",
  "data/tweet-wsj/2021/12/1476455560102961153.json": "Shares of SenseTime jumped in their Hong Kong debut, after the Chinese AI company completed a $744 million IPO that had been delayed by tensions between Washington and Beijing  https://t.co/8H3vTq5tgW",
  "data/tweet-wsj/2021/12/1476587666380668934.json": "Tesla is recalling nearly half a million cars it has produced in recent years because of potential safety defects, federal regulators said, adding to previous recalls and other safety concerns that have hit the electric-vehicle maker this year https://t.co/6mRNtG8BGx",
  "data/tweet-wsj/2021/12/1476361152858841089.json": "What’s it like to be a muggle named Hermione? The children of Harry Potter fans talk about having a name from the series. One girl’s grandfather had to find a trick to remember it: “Her. My. Knee.” https://t.co/WdbTr4bgKO",
  "data/tweet-wsj/2021/12/1476659385325735941.json": "The CDC raised its travel warning for cruise ships to its highest level, telling Americans to avoid cruises regardless of their Covid-19 vaccination status https://t.co/WcXz21AlmV",
  "data/tweet-wsj/2021/12/1476040329627324419.json": "Review: The \"Harry Potter 20th Anniversary: Return to Hogwarts\" reunion special lacks the magic that made the original stories so great https://t.co/KsI75GHhi1",
  "data/tweet-wsj/2021/12/1476527264229732358.json": "Shortened quarantines pose a risk that some people will go on to spread Covid-19 after their isolation period expires, the WHO said https://t.co/ZbBc7WNE7O",
  "data/tweet-wsj/2021/12/1476689652937637892.json": "From @WSJopinion: China’s Communist Party views all economic activity as fundamentally political. This week’s crackdown illustrates how no one is safe doing business in Hong Kong. https://t.co/OqB2OMuf9n",
  "data/tweet-wsj/2021/12/1476614107809865736.json": "From @WSJopinion: The 2022 Olympics have been scheduled under the orchestration of a genocidal regime, writes @iguangcheng. Can any self-respecting democratic nation agree to attend? https://t.co/L0iIL0hiij"
}