{
  "data/tweet-economist/2021/9/1433384203513704449.json": "Chaos here in Marseille as Macron plunges into an (unfiltered) crowd on a housing estate in the northern banlieue. The estate was tidied up before his visit, and the police presence was heavy. But you don’t see many leaders do this sort of thing https://t.co/kS4kv8ENpU",
  "data/tweet-economist/2021/9/1433692229680386058.json": "Après Afghanistan: Europe ponders the uncomfortable thought that Macron may have been right about excessive reliance on America. My Charlemagne column in ⁦@TheEconomist⁩ this week https://t.co/wJcGMTeKG6  https://t.co/wJcGMTeKG6",
  "data/tweet-economist/2021/9/1433870796141772800.json": "What is the pandemic's true death toll? After months of work, we are launching our daily updating estimate of excess deaths around the world. With official deaths at 4.5m, I estimate the true tally to be between 9.3m and 18.1m, as of today https://t.co/z17BRF3Xwq",
  "data/tweet-economist/2021/9/1434227142984757258.json": "Our excess-deaths model, launched this week, is an exceptional piece of work by @Sondreus and @martgnz.  The central estimate is that 15.2m deaths have been caused by covid-19, more than three times the official toll of 4.6m https://t.co/k3GOYygJRT",
  "data/tweet-economist/2021/9/1434389304403451906.json": "Breaking news. \n\nG7 countries have such a glut of vaccine they can redistribute &gt;300m doses today with no impact on plans to jab or boost anyone over 12.   \n\nOver 2021, if they don’t redistribute one analysis says more than 1m lives will be lost.  By me. https://t.co/noH5dnAoxa",
  "data/tweet-economist/2021/9/1438842619631751168.json": "Macron's covid passports have been controversial, risky--and a spectacular success. By September 15 74% of the French (and 88% of over 12s) had received at least one dose, up from 54% on July 12. This is now higher than in 🇺🇸, 🇬🇧and 🇩🇪 in @TheEconomist\nhttps://t.co/zPxtHysMWg",
  "data/tweet-economist/2021/9/1441144110182658050.json": "Our The Economist/YouGov poll this week finds a clear majority of the public is in favor of abortion rights. Only 28% of adults want the Supreme Court to overturn Roe v Wade\n\nhttps://t.co/mQ1JbBdBYh",
  "data/tweet-economist/2021/9/1441316684732633100.json": "After the sub snub. Some on the French right are calling for a de Gaulle-like flourish. But Mr Macron is no anti-American. The geo-political conclusion he will probably draw from all this rather is that he was right about the need for European sovereignty https://t.co/LTsAvICCII",
  "data/tweet-economist/2021/9/1443645344487776264.json": "In this week's issue of @TheEconomist, I take a look at the latest research on greenhouse gas emissions. I find that cows are slow-cooking all of us. https://t.co/dTufPW5EQi"
}