{
  "data/tweet-wsj/2022/5/1520621562633801728.json": "The first cargo of Ukrainian corn to be exported via the Black Sea since Russia’s invasion set sail from a Romanian port Friday, dodging a Russian naval blockade that has all but halted Ukraine’s grain exports. https://t.co/1lA5ujfMEZ",
  "data/tweet-wsj/2022/5/1520666866749947904.json": "Vladimir Putin believes that Ukraine has no historical identity independent of Russia. Many Russian liberals and dissidents have traditionally agreed, writes @yarotrof. https://t.co/CHcPkhIQHx",
  "data/tweet-wsj/2022/5/1520731021313986560.json": "House Speaker Nancy Pelosi and a delegation of U.S. lawmakers met with Ukrainian President Volodymyr Zelensky in Kyiv on Saturday night, as Russia’s military advance stalled in Ukraine’s east https://t.co/uY8iz6r11d",
  "data/tweet-wsj/2022/5/1520644231685189633.json": "\"Are there any Nazis in the house?\" the Russian soldiers asked. The next day, they took away her son. https://t.co/So5X7eRA6O",
  "data/tweet-wsj/2022/5/1520580024964894720.json": "Performance reviews miss the gritty, granular, unique raw material of real performance. https://t.co/bYqH0HiFE3",
  "data/tweet-wsj/2022/5/1520792686185308161.json": "Vladimir Putin signed a law Sunday suspending certain visa preferences for nationals of most European countries, further alienating Moscow from the West https://t.co/U9c31yAIoV",
  "data/tweet-wsj/2022/5/1520800194182500353.json": "“Our delegation traveled to Kyiv to send an unmistakable and resounding message to the entire world: America stands firmly with Ukraine,” House Speaker Nancy Pelosi and other members of Congress said after meeting with President Volodymyr Zelensky. https://t.co/Vmjs0OojMp",
  "data/tweet-wsj/2022/5/1520659321947885570.json": "Without these traders, Russia will struggle to find buyers for its oil, the foundation of the country’s economic wealth. https://t.co/vocNKPo118",
  "data/tweet-wsj/2022/5/1520806516571389956.json": "When Florida Republicans approved a bill to strip Disney of its special tax privileges in, they failed to address a key question: Who's responsible for paying back nearly $1 billion in municipal debt used for infrastructure around Disney World?  \nhttps://t.co/AxKbfp44QY",
  "data/tweet-wsj/2022/5/1520852543345152001.json": "President Volodymyr Zelensky said Sunday that 100 people were evacuating the besieged Azovstal steel plant in Mariupol under the supervision of the United Nations, and would be taken to the southeastern city of Zaporizhzhya https://t.co/1aHfIIUyn4",
  "data/tweet-wsj/2022/5/1520844273553481728.json": "Vladimir Putin believes that Ukraine has no historical identity independent of Russia. Many Russian liberals and dissidents have traditionally agreed, writes @yarotrof. https://t.co/nMlFB66t3S",
  "data/tweet-wsj/2022/5/1520798991537090561.json": "A recent survey of U.S. consumers found more than 70% said they have switched to cheaper food and household staples, and nearly 40% said they were delaying purchases of big-ticket items https://t.co/iZp82falt0",
  "data/tweet-wsj/2022/5/1520912217155252225.json": "This CEO has let his employees work whenever they want—from wherever they want—for years. Here’s how he makes that work.  https://t.co/sq0yEy7uuV",
  "data/tweet-wsj/2022/5/1520953767780392960.json": "Elon Musk broke nearly every rule in the deal-making playbook. How he landed Twitter anyway. https://t.co/SkCn0MuDQr",
  "data/tweet-wsj/2022/5/1520870754249842691.json": "The U.S. holds one sanctions card close to the vest: Vladimir Putin's alleged girlfriend and the mother of at least three of his children, the government says. https://t.co/a1CT3PlYir",
  "data/tweet-wsj/2022/5/1520727267630108672.json": "From @WSJopinion: Unless the U.S. Supreme Court rules in my favor, teachers could be fired for praying over their lunch in the cafeteria if students can see them, writes Joe Kennedy https://t.co/AY9h2zpiW6",
  "data/tweet-wsj/2022/5/1521063957460660224.json": "Ukraine says it sank two Russian boats in the Black Sea with drone strikes, as explosions rang out once again in Russia’s border region of Belgorod https://t.co/0VwK6WyAYh",
  "data/tweet-wsj/2022/5/1521108520820690945.json": "Potential grand jurors in Georgia's Fulton County have been ordered to arrive at a courthouse Monday as part of a county prosecutor’s probe into alleged efforts by former President Donald Trump and others to overturn the state’s 2020 election results https://t.co/MYOL7doSxZ",
  "data/tweet-wsj/2022/5/1521134979002126337.json": "Could Russia’s Vladimir Putin be prosecuted for the crime of aggression? Some legal scholars are calling for a special tribunal like the one at Nuremberg that tried Nazi officials after World War II https://t.co/PZGuNUmJWY",
  "data/tweet-wsj/2022/5/1521119886759575554.json": "Israeli Foreign Minister Yair Lapid called Russian Foreign Minister Sergei Lavrov’s comments that Jews are the biggest anti-Semites ‘unforgivable’ https://t.co/JkqOeoXGXk",
  "data/tweet-wsj/2022/5/1521036830723952640.json": "How two Americans ended up bouncing around Ukraine’s front lines, figuring out how to fire Javelin missiles. https://t.co/knQOVFEsbb",
  "data/tweet-wsj/2022/5/1521097490140999683.json": "Millions of Grindr users had their location data collected from the gay-dating app and sold for years, people familiar with the matter said https://t.co/veK1PHlj4U",
  "data/tweet-wsj/2022/5/1521204129955254279.json": "TikTok brain is real, researchers say, and it’s affecting kids’ brain development. \"We’ve made kids live in a candy store.\" https://t.co/MVzYE4iqxq",
  "data/tweet-wsj/2022/5/1521181809438072832.json": "A special grand jury was selected Monday to hear evidence in a county prosecutor’s probe into efforts by former President Donald Trump and others to overturn Georgia’s 2020 election results https://t.co/e3LQOhI9Vw",
  "data/tweet-wsj/2022/5/1520972632325242887.json": "Kevin Hart is expanding his entertainment empire, backed by a $100 million investment from private-equity firm Abry Partners https://t.co/iEGMeEG6g6",
  "data/tweet-wsj/2022/5/1521294918806814721.json": "Ukraine says it sank two Russian boats in the Black Sea with drone strikes, as explosions rang out once again in Russia’s border region of Belgorod https://t.co/CfNE4d8Bky",
  "data/tweet-wsj/2022/5/1521282182224007170.json": "From @WSJopinion: For all the talk of Putin’s mistakes, he was right in guessing that NATO won’t fight for Ukraine, writes Yulia Latynina. And this is perhaps the biggest reason why he must be crushed. https://t.co/MVQC8rLdqH",
  "data/tweet-wsj/2022/5/1521358851051823111.json": "A leaked Supreme Court draft opinion published by Politico indicates justices may overturn Roe v. Wade, which established a constitutional right to an abortion https://t.co/GkrVkCkv8M",
  "data/tweet-wsj/2022/5/1521384119627915264.json": "Could Russia’s Vladimir Putin be prosecuted for the crime of aggression? Some legal scholars are calling for a special tribunal like the one at Nuremberg that tried Nazi officials after World War II. https://t.co/htiTWNhaat",
  "data/tweet-wsj/2022/5/1521482224880730115.json": "Russia doubled down Tuesday on its ever-wilder claims about Jews, neo-Nazis and Ukraine, accusing Israeli Foreign Minister Yair Lapid of making “anti-historical statements” when he said Jews didn’t murder themselves in the Holocaust https://t.co/POabpo1c6f",
  "data/tweet-wsj/2022/5/1521493560901742599.json": "From @WSJopinion: People on the left once viewed free speech as sacrosanct and championed speaking truth to power. Now they disparage open expression as a danger to democracy and minorities, writes Colin Wright. https://t.co/scdL9RqvVu",
  "data/tweet-wsj/2022/5/1521501096753123328.json": "President Biden is scheduled Tuesday to visit the Lockheed Martin Corp. plant in Troy, Ala., where the defense company is seeking workers to assemble the Javelin antitank missiles that have proved crucial to Ukraine’s defense against Russia https://t.co/ecKiRTULAR",
  "data/tweet-wsj/2022/5/1521550321079697413.json": "Ukrainian President Volodymyr Zelensky speaks with WSJ Editor in Chief Matt Murray at the #WSJCEOCouncil Summit https://t.co/H4pQt814Bu",
  "data/tweet-wsj/2022/5/1521577860850503681.json": "President Biden is considering limiting student loan forgiveness to borrowers who make less than $125,000 a year https://t.co/wtZgvKxnda",
  "data/tweet-wsj/2022/5/1521535085467643905.json": "The State Department has determined that women’s basketball star Brittney Griner is being wrongfully detained in Russia on drug charges, a significant change that puts the weight of the U.S. government behind the campaign for her release https://t.co/1IZTrkGoNh",
  "data/tweet-wsj/2022/5/1521515223567544323.json": "The Supreme Court confirmed that the Roe v. Wade draft ruling is authentic and ordered an investigation into how it was leaked https://t.co/ayoUChaqYv",
  "data/tweet-wsj/2022/5/1521591698895380482.json": "Elon Musk said he plans to take Twitter public again within a few years of buying the social-media company, according to people familiar with the matter https://t.co/GSXoZmngJ0",
  "data/tweet-wsj/2022/5/1521497342540750853.json": "NFT sales are flatlining. Is this the beginning of the end? https://t.co/d1odVLYHX6",
  "data/tweet-wsj/2022/5/1521595458283618305.json": "Ukrainian President Volodymyr Zelensky tells the #WSJCEOCouncil that companies still doing business in Russia are supporting its “war machine” https://t.co/w7KyCbkvXM https://t.co/dcbtkfsx91",
  "data/tweet-wsj/2022/5/1521423086465212416.json": "The SEC plans to add 20 staffers to its special unit devoted to investigating cryptocurrency frauds and other misconduct https://t.co/nfHcgYU9w0",
  "data/tweet-wsj/2022/5/1521605542082404352.json": "The U.S. and its allies should keep arms and aid flowing into Ukraine and not be deterred by threats from Russia, Polish President Andrzej Duda said https://t.co/kjILRcoNrQ",
  "data/tweet-wsj/2022/5/1521636975345868800.json": "Ukrainian President Volodymyr Zelensky described his shock at what he has witnessed during the war, alleging Russian forces have killed, tortured and mutilated civilians https://t.co/GCzuWNeex3 https://t.co/9WZuHZM2kV",
  "data/tweet-wsj/2022/5/1521697399424618496.json": "President Biden is considering limiting student loan forgiveness to borrowers who make less than $125,000 a year https://t.co/2rTBc7nvnb",
  "data/tweet-wsj/2022/5/1521538868587159552.json": "Invoking the words of Winston Churchill, British Prime Minister Boris Johnson pledged in an address to Ukraine’s parliament Tuesday to send more weapons to the country in its campaign to fend off the Russian invasion https://t.co/czNKzwIokl",
  "data/tweet-wsj/2022/5/1521686121431846914.json": "Ukrainian President Volodymyr Zelensky said \"leaving the Russian market is a must” for companies still there: “It’s not possible to do business with someone who tomorrow, instead of payment, will simply send rockets toward you.” https://t.co/blLjSpBUsO",
  "data/tweet-wsj/2022/5/1521682296264351745.json": "From @WSJopinion: The Ukraine war is not yet 10 weeks old, and it has already revolutionized world politics. The next 10 weeks could be even more dramatic, writes @wrmead. https://t.co/TNSrUxE9x8",
  "data/tweet-wsj/2022/5/1521812120475770880.json": "President Biden visited a Lockheed Martin plant as the defense company looks for workers to assemble Javelin antitank missiles to send to Ukraine. It comes amid the U.S.’s tightest labor market in 50 years. #WSJWhatsNow https://t.co/J9oAtBpz4l https://t.co/QsonvDflZv",
  "data/tweet-wsj/2022/5/1521453264872509440.json": "A leaked draft opinion revealed the Supreme Court may be poised to overturn Roe v. Wade, the precedent that established a constitutional right to an abortion #WSJWhatsNow https://t.co/nwqmV03pe7 https://t.co/XZ6AJeFhQA",
  "data/tweet-wsj/2022/5/1521826272317517826.json": "The Rock &amp; Roll Hall of Fame announced its latest inductees Wednesday, with Eminem, Dolly Parton, Duran Duran, Eurythmics, Carly Simon, Lionel Richie and Pat Benatar set to join the Cleveland institution’s pantheon https://t.co/VlPPyXL1px",
  "data/tweet-wsj/2022/5/1521818197883822082.json": "The solar-energy boom will trigger a landslide of electronic waste in coming decades. Some companies are already preparing for the recycling challenge. https://t.co/xSDMFvObTc",
  "data/tweet-wsj/2022/5/1521839286148116480.json": "Comedian Dave Chappelle was attacked on-stage during a show in Los Angeles Tuesday night. The suspect, who was armed with a knife, was arrested for assault with a deadly weapon, police said. https://t.co/ghwNQpjWir",
  "data/tweet-wsj/2022/5/1521761587857666049.json": "NFT sales are flatlining. Is this the beginning of the end? https://t.co/Jo1CQl4cku",
  "data/tweet-wsj/2022/5/1521754037820997632.json": "China's much larger economy is more difficult to cut off than Russia’s, but that doesn’t make it bulletproof https://t.co/3hfJZYBnvC",
  "data/tweet-wsj/2022/5/1521848404221075456.json": "Ukrainian forces are ousting Russian troops from a string of villages that were used to strike Kharkiv, regaining terrain that could blunt Russia’s attempt to conquer Donbas https://t.co/tlRRS5ERVL",
  "data/tweet-wsj/2022/5/1521844594538950656.json": "Bill Gates commented on Elon Musk's plan to purchase Twitter and how he could make misinformation online worse. #WSJCEOCouncil https://t.co/0E4mtWvjQI https://t.co/xkQMpurrcO",
  "data/tweet-wsj/2022/5/1521893726724845568.json": "Video shows the moment comedian Dave Chappelle was tackled onstage during a show in Los Angeles Tuesday night https://t.co/qDYLVL1BIm",
  "data/tweet-wsj/2022/5/1521678540575584258.json": "The European Union has proposed a new package of sanctions over Russia’s war in Ukraine, EU officials said, including a phased-in embargo on Russian oil imports https://t.co/8EUPTF4OL9",
  "data/tweet-wsj/2022/5/1521913504411836416.json": "The Fed raised interest rates by a half percentage point and approved plans to start shrinking its bond portfolio https://t.co/IeFndGFelO",
  "data/tweet-wsj/2022/5/1521586643681128450.json": "The sale of NFTs is dropping steeply, and as @paulvigna explains, there are two main reasons. #WSJWhatsNow https://t.co/94zo8fqKyT",
  "data/tweet-wsj/2022/5/1521901241638563840.json": "Bill Gates said he isn’t sure of Elon Musk’s motives in buying Twitter and that social media must play a role in curbing misinformation. \"The way that you make those platforms spread truth and not crazy stuff, there’s some real invention required there.\" https://t.co/ACBbpGVEa6",
  "data/tweet-wsj/2022/5/1521916892964962304.json": "The Federal Reserve's interest-rate hike on Wednesday was its sharpest since 2000. Here's how the change will affect your money. https://t.co/8oiiQUj8U4",
  "data/tweet-wsj/2022/5/1521961639486136327.json": "Walter Orthmann has worked for a Brazilian textile company for the past 84 years, a record for longest career with the same company, according to Guinness World Records https://t.co/ySwMSOF7vI",
  "data/tweet-wsj/2022/5/1521977980666449926.json": "Venture capitalist John Doerr and his wife, Ann Doerr, are giving Stanford University $1.1 billion to launch a new school focused on tackling challenges of climate change and sustainability issues https://t.co/kCZZCMZ8hE",
  "data/tweet-wsj/2022/5/1522003252450971648.json": "Goodbye, hand sanitizer and exercise bikes. Americans are back to their prepandemic habits, and companies are racing to catch up. https://t.co/zBsvnt4Qml",
  "data/tweet-wsj/2022/5/1521716289135382529.json": "A Shanghai nursing home put an elderly resident infected with Covid-19 into a body bag and loaded her into a crematorium van, only to realize that she was still alive https://t.co/80WsYWhIEV",
  "data/tweet-wsj/2022/5/1521985550953164801.json": "From @WSJopinion: I’ve never had a patient ask about my race in my 24 years of practicing medicine. But the Biden administration wants me to fixate on the race of my patients, writes Ralph Alvarado.\nhttps://t.co/c2P7v2uben",
  "data/tweet-wsj/2022/5/1521973046025805828.json": "At a time when much of the global focus is on Russia’s war with Ukraine, the Biden administration is preparing to refresh the message that the U.S. sees China, not Russia, as its biggest geopolitical rival https://t.co/5p3GylF02E",
  "data/tweet-wsj/2022/5/1521875297699864580.json": "U.S. Treasury Secretary Janet Yellen speaks with WSJ Editor in Chief Matt Murray at the #WSJCEOCouncil Summit https://t.co/ZagJkFwwL2",
  "data/tweet-wsj/2022/5/1522172266603323399.json": "Elon Musk said he has received letters from investors committing more than $7 billion in fresh financing to boost the equity part of his offer to buy Twitter  https://t.co/APg7jyuyo8",
  "data/tweet-wsj/2022/5/1522251548822282240.json": "Boeing is expected to move its headquarters to Arlington, Va., from Chicago, people familiar with the matter say https://t.co/sl3uWOGvHm",
  "data/tweet-wsj/2022/5/1522271205088235520.json": "From @WSJopinion: The Disinformation Governance Board is a terrible idea. Pull the plug. Shut it down now, writes @DanHenninger. https://t.co/ZuF1l350gA",
  "data/tweet-wsj/2022/5/1522305145249443843.json": "President Biden named Karine Jean-Pierre to be his new press secretary, elevating Jen Psaki’s top deputy to one of the White House’s most prominent roles ahead of November’s midterm elections https://t.co/f4CtWM6omJ",
  "data/tweet-wsj/2022/5/1522297665425272833.json": "The level of carbon dioxide in the atmosphere rose to a record high in April, indicating that efforts to rein in carbon emissions continue to fall short https://t.co/ZjvSwehEeZ",
  "data/tweet-wsj/2022/5/1522309767947071502.json": "The stock market took its biggest U-turn since the early days of the pandemic, posting its largest decline since 2020. The Dow dropped more than 1,000 points and the Nasdaq fell nearly 5%. https://t.co/pSuqlhZhRU",
  "data/tweet-wsj/2022/5/1522341105911709696.json": "Breaking: The FDA limited the use of the Johnson &amp; Johnson Covid vaccine after confirming 60 cases, including nine deaths, of a rare blood clotting condition https://t.co/ASB7zjiGg0",
  "data/tweet-wsj/2022/5/1522391965869948929.json": "The FDA has limited the use of the Johnson &amp; Johnson Covid vaccine after confirming 60 cases, including nine deaths, of a rare blood clotting condition https://t.co/ExnE1HsIsY",
  "data/tweet-wsj/2022/5/1522246655013269506.json": "The stock selloff accelerated, with the Dow falling more than 1,100 points and the Nasdaq losing 5% https://t.co/lD9zP8aKtl",
  "data/tweet-wsj/2022/5/1522361773613101056.json": "From @WSJopinion: The primary objective of the U.S., its allies and Taiwan isn’t to repel a Chinese attack but to prevent it from ever occurring. Effective deterrence is the key to national security, write Phil Gramm and @SenatorWicker. https://t.co/SJGu9PlzEX",
  "data/tweet-wsj/2022/5/1522199463279923200.json": "Elon Musk says he has received investment commitments from a range of investors to help fund his bid to take Twitter private. Here’s a look at the investors. https://t.co/YWdpDQeJqm",
  "data/tweet-wsj/2022/5/1522418418019880961.json": "Russia is intensifying strikes on Ukrainian infrastructure, seeking to disrupt deliveries of Western weapons as Moscow’s offensives in the east appear to have stalled https://t.co/jH9MFxYGt2",
  "data/tweet-wsj/2022/5/1522554854211829765.json": "The U.S. economy added 428,000 jobs in April for the twelfth straight month of gains. The jobless rate remained at 3.6%. https://t.co/YorPFSZnUJ",
  "data/tweet-wsj/2022/5/1522621513798664192.json": "A large explosion tore through an iconic hotel in downtown Havana on Friday, prompting rescue workers to rush to the scene to search for any victims or survivors trapped under the rubble https://t.co/qzowbEm5J9",
  "data/tweet-wsj/2022/5/1522638938091008000.json": "Breaking: At least eight people died and more than 30 were injured after an explosion at Cuba’s Hotel Saratoga. Preliminary reports blamed a gas leak. https://t.co/i1iIUA3lXt",
  "data/tweet-wsj/2022/5/1522656544197914625.json": "“If I knew that working at TikTok would cost me this much, I would never have taken the job.” Former U.S. employees describe a punishing schedule at the app that bills itself as the happiest place on the internet. https://t.co/pSCHyzS50k",
  "data/tweet-wsj/2022/5/1522735483717095426.json": "A federal judge has tossed out a lawsuit filed last year by former President Trump against Twitter and its then-chief executive Jack Dorsey over alleged censorship https://t.co/4l10KyeVFv",
  "data/tweet-wsj/2022/5/1522765706948976640.json": "House Speaker Nancy Pelosi said she will raise the minimum annual pay for Congressional staffers to $45,000. She also plans a vote next week on unionization, a first for the Democratic-led body. https://t.co/iuocdOMpaU",
  "data/tweet-wsj/2022/5/1522777006341083138.json": "From @WSJopinion: The actual threat to democratic norms is the left’s onslaught on the legitimacy of the Supreme Court. https://t.co/xXpVc1Uqpb",
  "data/tweet-wsj/2022/5/1522629840284889090.json": "House Speaker Nancy Pelosi said she will raise the minimum annual pay for Congressional staffers to $45,000. She also plans a vote next week on unionization, a first for the Democratic-led body. https://t.co/Wwm24bbFcX",
  "data/tweet-wsj/2022/5/1522626634481905668.json": "Former U.S. Treasury Secretary Larry Summers speaks with WSJ’s @NickTimiraos about the Fed’s rate increase and the U.S. economic outlook https://t.co/egavKJaveA",
  "data/tweet-wsj/2022/5/1522841209307377664.json": "As Russia’s war against Ukraine continues, it is impossible to determine an accurate death count. But expanding mass graves give a glimpse of the toll. https://t.co/g6Dbzf43A5",
  "data/tweet-wsj/2022/5/1522188141012164608.json": "Know someone who always seems to \"fail\" their way up the corporate ladder? Here's how (and why) they do it. https://t.co/zbt24H2Bbd",
  "data/tweet-wsj/2022/5/1522690191705899008.json": "Baby formula has been scarce for months, and the shortage is getting worse. “I didn’t think that I would get to the point where I’m constantly worried—can I feed my child?” said one mother. https://t.co/x965bE4ysG",
  "data/tweet-wsj/2022/5/1522584564983607297.json": "“Russia has covered itself in disgrace from head to toes here.” One Ukrainian village was liberated more than a month ago, but only now is it safe for residents to return. https://t.co/roTTczJMiK",
  "data/tweet-wsj/2022/5/1522278713366302721.json": "A vast reservoir of ancient water has been found thousands of feet under the ice in western Antarctica, scientists said in a paper. The first-of-its-kind discovery shows that there’s far more water under the Antarctic ice than scientists realized. https://t.co/DinMA8Tlou",
  "data/tweet-wsj/2022/5/1522943118068301824.json": "Essay: Anxiety feels bad, but it isn’t an emotional malfunction—it evolved to help us foresee problems and prepare to overcome them. What matters is how we respond to it. https://t.co/bP1aiZW76y",
  "data/tweet-wsj/2022/5/1522939401768431617.json": "President Biden is considering limiting student loan forgiveness to borrowers who make less than $125,000 a year https://t.co/kQdmsirkLF",
  "data/tweet-wsj/2022/5/1522716625857916929.json": "From @WSJopinion: Democrats blame their unpopularity on everything but their own failures, writes @KimStrassel https://t.co/qcchmRjBgU",
  "data/tweet-wsj/2022/5/1522958213951369216.json": "As children, they fled to Russia to escape the Nazis. Now, Russia’s invasion is seeing Ukrainian Holocaust survivors evacuating to Germany. \nhttps://t.co/ZFND0Yp6El",
  "data/tweet-wsj/2022/5/1522950660697862144.json": "Texas-based Tesla is among a small but growing number of U.S. companies offering to cover travel costs for employees who need to cross state lines for medical care, including an abortion https://t.co/JYlknxbgj0",
  "data/tweet-wsj/2022/5/1522569369565417473.json": "A SpaceX capsule carrying four astronauts returned to Earth early Friday, splashing down just off the coast of Florida, during a busy month for Elon Musk’s company #WSJWhatsNow https://t.co/NcjXYXyOtJ",
  "data/tweet-wsj/2022/5/1522946877410402305.json": "“I have two years to catch up on, and this is the time.\" Americans return to their prepandemic habits. https://t.co/0hs9T840mq",
  "data/tweet-wsj/2022/5/1523018603993661442.json": "Afghan women have been ordered by the Taliban to cover their faces in public and to avoid leaving their homes https://t.co/kGUgzDUnme",
  "data/tweet-wsj/2022/5/1523052604854784000.json": "TikTok brain is real, researchers say, and it’s affecting kids’ brain development. \"We’ve made kids live in a candy store.\" https://t.co/Kxk1C2fGFG",
  "data/tweet-wsj/2022/5/1523056343854174208.json": "From @WSJopinion: People on the left once viewed free speech as sacrosanct and championed speaking truth to power. Now they disparage open expression as a danger to democracy and minorities, writes Colin Wright. https://t.co/ld2UNPUBAQ",
  "data/tweet-wsj/2022/5/1523082535370113026.json": "Unheralded longshot Rich Strike surged up the rail in the homestretch to pull off a shocking upset in the 148th running of the Kentucky Derby. \nhttps://t.co/NEz5moFX9Z",
  "data/tweet-wsj/2022/5/1522648665877319681.json": "From @WSJopinion: If some version of Justice Alito’s opinion is adopted, the Justices who sign onto it will have done what they promised Congress: Decide cases on the legal and constitutional merits. https://t.co/s801yCkkpX",
  "data/tweet-wsj/2022/5/1523120604471197697.json": "Elon Musk broke nearly every rule in the deal-making playbook. How he landed Twitter anyway. https://t.co/fKddtC8yLS",
  "data/tweet-wsj/2022/5/1522924235429228546.json": "Jared Kushner’s fund plans to invest millions of Saudi Arabia’s money in Israeli startups, people familiar say, in a sign of warming ties between the rivals https://t.co/lzexxUnB1C",
  "data/tweet-wsj/2022/5/1523188478028124160.json": "Facebook blocked hospitals and charities in Australia last year. The company said it was an accident. Whistleblowers say it was a negotiating tactic. https://t.co/NnM1L6olI0",
  "data/tweet-wsj/2022/5/1523180918865022976.json": "Russian forces have taken grain from Ukrainian farms as part of an effort to hobble the country’s globally important agriculture sector, the Ukrainian government and farmers in the country said. https://t.co/tAhdqidukz",
  "data/tweet-wsj/2022/5/1523203571054833665.json": "Moscow is allowing importers to bring in Apple smartwatches, Lamborghinis, Sony PlayStations and dozens of other imported goods against the will of the companies that make them. https://t.co/oNzziNsNUt",
  "data/tweet-wsj/2022/5/1523253071173722112.json": "A Russian airstrike is believed to have killed some 60 villagers who had taken refuge in a school in the eastern Ukrainian region of Luhansk, authorities there said https://t.co/YeqIHRoOh3",
  "data/tweet-wsj/2022/5/1523260202166124544.json": "The risk of electricity shortages is rising throughout the U.S. And electric-grid operators are warning of rolling blackouts during heat waves or other peak periods as soon as this year. https://t.co/IEhPJCVmce",
  "data/tweet-wsj/2022/5/1523294198514200576.json": "Along Russia’s longest supply line, Ukrainian villagers risked their lives to help Ukraine’s military target Kremlin forces https://t.co/PuIxiJw1Cc",
  "data/tweet-wsj/2022/5/1522761911821127680.json": "From @WSJopinion: China should be worried that the war in Ukraine has Germany rethinking its conciliatory foreign policy, writes @josephsternberg https://t.co/CV0bbyeLlq",
  "data/tweet-wsj/2022/5/1523309276437045254.json": "Ukrainian forces making a last-ditch stand in the destroyed city of Mariupol have vowed to fight till the end: \"We are basically dead men.\" https://t.co/VPImHFkcTs",
  "data/tweet-wsj/2022/5/1523320576449736704.json": "First lady Jill Biden made an unannounced visit to Ukraine Sunday, meeting with the nation’s first lady, Olena Zelenska, near the country’s border with Slovakia https://t.co/8761bXuMhe",
  "data/tweet-wsj/2022/5/1523079001216290818.json": "Wage increases are registering at a historically high rate but aren’t keeping up with inflation. The result is many workers are receiving big raises—and may still be struggling to pay for more expensive gasoline, groceries and rent. https://t.co/Tm6JVtbyim",
  "data/tweet-wsj/2022/5/1523279045789687809.json": "As semiconductor makers look to boost output amid soaring demand, they face a new concern: not enough chips to make more chips, @ahirtens explains #WSJWhatsNow https://t.co/uI12ZDYuHA https://t.co/mlI8BQgwow",
  "data/tweet-wsj/2022/5/1523347022098878464.json": "“Kids are a guarantee that you can get in here, it’s as if they were visas.\" It’s easier for migrants to be let into the U.S. if they're with their children. So some have started arriving at the border with bogus families. https://t.co/CJXg48YLWf",
  "data/tweet-wsj/2022/5/1523369671663128577.json": "Jared Kushner’s new private-equity fund plans to invest millions of dollars of Saudi Arabia’s money in Israeli startups, in a sign of warming ties between two historic rivals https://t.co/TwsPyByFvH",
  "data/tweet-wsj/2022/5/1523403633693319170.json": "Ukrainian forces making a last-ditch stand in the destroyed city of Mariupol have vowed to fight till the end: \"We are basically dead men.\" https://t.co/wt3Wbmqxwy",
  "data/tweet-wsj/2022/5/1523498045907906560.json": "Japan said it would phase out and eventually ban the import of Russian oil, reversing its earlier stance after a meeting of Group of Seven leaders https://t.co/uIteBszfZF",
  "data/tweet-wsj/2022/5/1523411188133990400.json": "Marvel's “Dr. Strange in the Multiverse of Madness\" raked in $450 million at the global box office its opening weekend, signaling a promising rebound ahead after two years of disrupted summer movie seasons https://t.co/CuVdeErtrz",
  "data/tweet-wsj/2022/5/1523267734943170560.json": "Two Palestinians suspected of killing three Israelis in a bloody ax attack on Israel’s independence day were captured  https://t.co/BrCMwjQTQu",
  "data/tweet-wsj/2022/5/1523226246037270528.json": "French sportswear firm Salomon decided to start making sneakers in its home country. Building the supply chain hasn’t been easy in a country where shoemaking died out long ago. https://t.co/dP1iHJgMdt",
  "data/tweet-wsj/2022/5/1523612766405283842.json": "Elon Musk has cultivated close ties with Beijing to build Tesla’s business in China. Now that he is buying Twitter, WSJ looks at how China has used the social-media platform to promote its views, and why that’s raising concerns https://t.co/vGWJ3A9DE1",
  "data/tweet-wsj/2022/5/1523649022900191238.json": "Protesters in Poland drenched Moscow’s ambassador to Warsaw in red paint after swarming a local cemetery for Soviet soldiers who died in World War II, disrupting his embassy's attempts to commemorate the end of the conflict https://t.co/WctDLMvCLT",
  "data/tweet-wsj/2022/5/1523682975833018371.json": "U2's Bono and the Edge turned up in Ukraine to show support for its fight against Russia, performing in a Kyiv subway station. Singer Taras Topolia joined Bono in singing “Stand by Me”—changing the words to “Stand by Ukraine.” https://t.co/caAqTEcVU9",
  "data/tweet-wsj/2022/5/1523418744181035009.json": "From @WSJopinion: The end of Roe v. Wade will be good for America, writes @Peggynoonannyc. The mistaken abortion decision, a product of vanity, roiled and distorted our politics and poisoned our culture. https://t.co/cmPjLnZl1U",
  "data/tweet-wsj/2022/5/1523735829503426566.json": "TikTok brain is real, researchers say, and it’s affecting kids’ cognitive development. \"We’ve made kids live in a candy store.\" https://t.co/EM9sTccQRe",
  "data/tweet-wsj/2022/5/1523743389572911105.json": "Ukrainians with ties to Russia like 98-year-old Olha Tverdokhlibova didn’t embrace the invasion, despite what President Vladimir Putin might have expected https://t.co/w4JHh8t2ZT",
  "data/tweet-wsj/2022/5/1523739634295058434.json": "The risk of electricity shortages is rising throughout the U.S. And electric-grid operators are warning of rolling blackouts during heat waves or other peak periods as soon as this year. https://t.co/7v6zUiYlt1",
  "data/tweet-wsj/2022/5/1523835936639004672.json": "The Senate has passed a bill expanding police protections for Supreme Court justices to include their immediate family members, in the wake of protests following a leaked draft ruling indicating the court could overturn Roe v. Wade https://t.co/VHHCsX38CQ",
  "data/tweet-wsj/2022/5/1523830206233985024.json": "Protesters in Poland drenched Moscow’s ambassador to Warsaw in red paint Monday after swarming a local cemetery for Soviet soldiers who died in World War II https://t.co/QAsjtdRfN8",
  "data/tweet-wsj/2022/5/1523829248603086849.json": "An Andy Warhol portrait of Marilyn Monroe has sold for $195 million at Christie's, setting a record for an American artwork at auction https://t.co/0YUxoawBWz",
  "data/tweet-wsj/2022/5/1523840270323888135.json": "Elon Musk said his plans for Twitter are aligned with new European Union rules aimed at compelling social media companies to do more to police illegal content https://t.co/L8Di0X5gug",
  "data/tweet-wsj/2022/5/1523867944211648514.json": "Elon Musk has cultivated close ties with Beijing to build Tesla’s business in China. Now that he is buying Twitter, WSJ looks at how China has used the social-media platform to promote its views, and why that’s raising concerns https://t.co/UmqtY7rJDz",
  "data/tweet-wsj/2022/5/1523807591918411776.json": "Residents of recently Russian-occupied villages surrounding Kyiv are returning, removing debris from their rubble-strewn homes, planting vegetables and planning for the future https://t.co/iSXShej2H8",
  "data/tweet-wsj/2022/5/1523842774314934273.json": "An upstart financial firm backed by Peter Thiel and Bill Ackman has a message for American corporations: Focus on making money, not taking stands. https://t.co/8vZNiwsIKA",
  "data/tweet-wsj/2022/5/1523864176711585792.json": "Sri Lankan Prime Minister Mahinda Rajapaksa has resigned after months of mass protests against his government’s handling of an economic crisis that has led to double-digit inflation, rolling blackouts and acute shortages in fuel and medicines https://t.co/wb3iX58TJi",
  "data/tweet-wsj/2022/5/1523898165958692864.json": "South Korea’s new president said he would keep the door open for dialogue with North Korea and provide support for its fragile economy if Pyongyang stops developing nuclear weapons https://t.co/vRZWSZdeBr",
  "data/tweet-wsj/2022/5/1523826433797275649.json": "Attorney General Letitia James and state lawmakers say New York should pay for abortion access for low-income residents and out-of-state women https://t.co/5VNTY98eQy",
  "data/tweet-wsj/2022/5/1524026566862327815.json": "Miami locals complain that relocating New Yorkers are driving up apartment rents  https://t.co/MNXQrteYaU",
  "data/tweet-wsj/2022/5/1524081724187156480.json": "Breaking: Elon Musk said he would reverse Twitter’s ban on Donald Trump https://t.co/t0xSYveHcg",
  "data/tweet-wsj/2022/5/1524007622445355009.json": "Digital banking platform Greenwood, created for Black and Latino customers, is acquiring a private professional membership club called The Gathering Spot https://t.co/q7QyWIWbqz",
  "data/tweet-wsj/2022/5/1523728260219166723.json": "Spain’s Carlos Alcaraz has yet to win a major tennis tournament. But after the 19-year-old phenom buzzed through Rafael Nadal, Novak Djokovic and Alexander Zverev to win the Madrid Open, the tennis world is stirred, writes sports columnist @jasongay. https://t.co/YilO39Jslw?",
  "data/tweet-wsj/2022/5/1523905716888780802.json": "From @WSJopinion: NATO should admit Finland and Sweden ASAP, writes @JohnRDeni. It would enhance the alliance’s security and send a powerful message to Russia. https://t.co/VmdVYV8c8O",
  "data/tweet-wsj/2022/5/1524079343886123008.json": "Apple’s iPod helped revolutionize the music industry when it was introduced more than two decades ago. Now, music fans will soon bid adieu to the portable player. https://t.co/UAojD2WjGt",
  "data/tweet-wsj/2022/5/1524143520570880000.json": "Russia will likely be targeted by yet more U.S. sanctions and export controls in response to its invasion of Ukraine, a senior U.S. official said https://t.co/VcpXtOxUSg",
  "data/tweet-wsj/2022/5/1524169033570000898.json": "The Senate has voted to confirm Lisa Cook to the Federal Reserve, making her the first Black woman to sit on the central bank’s board https://t.co/yfRzSbF7pQ",
  "data/tweet-wsj/2022/5/1524158648645300229.json": "Volkswagen is set to resurrect the Scout off-road vehicle brand as part of its bid to expand in the U.S., the world’s most profitable automotive market, as war and Covid-19 cloud its prospects in Europe, China https://t.co/tLeDNwBtdm",
  "data/tweet-wsj/2022/5/1524211456933347328.json": "An organized crime prosecutor from Paraguay who was on his honeymoon in Colombia was assassinated Tuesday by gunmen who arrived at the private beach on jet skis https://t.co/sCfskLboU0"
}