{
  "data/tweet-stocks/2022/2/1488312568917725185.json": "Well, lookie here… https://t.co/oeLVWMa6OY",
  "data/tweet-stocks/2022/2/1489380615229169668.json": "🚨 NEWS | There is a heavy British military presence off the coast of Ireland in response to a Russian 'live-fire' naval exercise. You can see Typhoon jets, a Voyager tanker and P-8 Maritime Patrol Aircraft close to the Russian fleet. In addition, a British frigate is nearby. https://t.co/BIBz3XHcel",
  "data/tweet-stocks/2022/2/1489585049141972994.json": "Q4 Revenue Growth, YoY % Change...\nExxon Mobil $XOM: +86%\nTesla $TSLA: +65%\nGoogle $GOOGL: +32%\nVisa $V: +24%\nMicrosoft $MSFT: +20%\nFacebook $FB: +20%\nNetflix $NFLX: +16%\nS&amp;P 500 $SPY: +12%\nApple $AAPL: +11%\nJohnson &amp; Johnson $JNJ: +10%\nAmazon $AMZN: +9%\nJP Morgan $JPM: +1%",
  "data/tweet-stocks/2022/2/1489533067018526723.json": "WTF?  - $AMZN on 60X PE misses Sales, forward Sales, &amp; suffers blow out in operating costs of 15% =&gt; but books $12bn profit on RIVN (just fell 50% since IPO) to boost NPAT &amp; “beat” expectations https://t.co/DTUIlpD5XL",
  "data/tweet-stocks/2022/2/1489779174101422082.json": "GoFundMe 'Steals' $9 Million From Canada's \"Freedom Convoy\" Truckers Under Pressure From Trudeau https://t.co/CV0kX0Z0Ij",
  "data/tweet-stocks/2022/2/1489830167551877121.json": "BREAKING: \"Reclaim Ottawa\" group has called off their counter-protest to the truckers tomorrow after seeing that even more truckers and farmers are coming to the city from all over the provinces",
  "data/tweet-stocks/2022/2/1489829255194112004.json": "@TheRealKeean https://t.co/ok0BmaoapC",
  "data/tweet-stocks/2022/2/1489851203890651140.json": "Antifa group Riot Kitchen was arrested in Kenosha by US Marshals while planning attacks in the city and filling fuel cans. Their @GoFundMe is still active. https://t.co/jjmQdmT90j",
  "data/tweet-stocks/2022/2/1489849631626481667.json": "Far-left extremists occupied an entire hotel during the 2020 riots and raised hundreds of thousands on @GoFundMe: https://t.co/GMyl66w7Zh",
  "data/tweet-stocks/2022/2/1490420900470083586.json": "#BREAKING As of midnight tonight, police will be cutting off the fuel supply to convoy/occupation supporters. Anyone bringing gas, diesel &amp;/or propane will be charged with “assisting an illegal activity.”\n\nThis could be a game changer.\n\n#cdnpoli #antivaxxers #Ottawa https://t.co/Go0fKeoGCu",
  "data/tweet-stocks/2022/2/1490536951421849600.json": "Livorno, Italy, restaurants require \"covid passports\", empty, streets filled with people dining with their own food and drinks https://t.co/6Oasw1mrcD",
  "data/tweet-stocks/2022/2/1490858205484044289.json": "What’s great about what’s considered liberal now: war with Russia, unquestioning loyalty to pharmaceutical companies, reverence for the FBI and CIA and all of their honest work. This is like Gandalf saying “Actually let’s not destroy the ring. Let’s give it to Liz Cheney.”",
  "data/tweet-stocks/2022/2/1490857256946405378.json": "A pack of Antifa chased @MrAndyNgo down and attempted to murder him \n\nWatch this til the end\n\nIf they hadn’t let go of the chokehold here, he wouldn’t have made it \nhttps://t.co/K0CL9EvfPe",
  "data/tweet-stocks/2022/2/1490904179317293056.json": "In addition to being called by familiar ‘Ty’ by Putin, Macron does not get a motorcade at his plane - forced to go through terminal\n\nSeems like Russia wanted to make a point https://t.co/OKJvrXizD8",
  "data/tweet-stocks/2022/2/1491186511836217346.json": "*PFIZER DROPS 2.3% AFTER 2022 REVENUE FORECAST MISSES ESTIMATE\n\ntime to vaccinate embryos?",
  "data/tweet-stocks/2022/2/1491378463777116164.json": "If you’re ever doubting yourself, just remember that this individual was able to hack $3.6 billion worth of Bitcoin from an exchange https://t.co/VNxaVlF0yh",
  "data/tweet-stocks/2022/2/1491520179834134529.json": "$1MILLION painting is ruined after 'bored' security guard draws eyes on faceless figures 🤦\n\nFull story: https://t.co/9l8ThcRwkP https://t.co/IyfEbWMP9O",
  "data/tweet-stocks/2022/2/1491767928118784001.json": "Lavrov now saying Budapest memorandum didn’t apply because Maidan revolution was neo-Nazi fascist and the memorandum demanded respect of national minorities. My head is hurting too. https://t.co/KexZzTg2h2",
  "data/tweet-stocks/2022/2/1491802523723710465.json": "JUST IN - France to build up to 14 new nuclear reactors by 2035: Macron",
  "data/tweet-stocks/2022/2/1491887980759470082.json": "The Russian Foreign Minister just got British Foreign Secretary @TrussLiz to declare the UK does not recognize Russia's right to the region of Rostov \n\nThe UK ambassador had to step in and explain to her Rostov has been part of Russia for hundreds of years",
  "data/tweet-stocks/2022/2/1491909936263188480.json": "The last time we saw rate moves like this, Bear Stearns was not fine https://t.co/HGq6c2arNm",
  "data/tweet-stocks/2022/2/1491940762547806209.json": "BREAKING: The Ontario government says it has effectively frozen all donations made to the trucker convoy through GiveSendGo. It is now a criminal offence to have any \"dealing\" with money from donations through this platform. https://t.co/EhWWqe1V6J",
  "data/tweet-stocks/2022/2/1491953655301431331.json": "Price increases over last year (CPI report)\nUsed Cars: +40.5%\nGasoline: +40.0%\nGas Utilities: +23.9%\nMeats/Fish/Eggs: +12.2%\nNew Cars: +12.2%\nElectricity: +10.7%\nOverall CPI: +7.5%\nFood at home: +7.4%\nFood away from home: +6.4%\nTransportation: +5.6%\nApparel: +5.3%\nShelter: +4.4%",
  "data/tweet-stocks/2022/2/1491953632379613185.json": "Global Inflation Rates... https://t.co/G8gNKG4VKs",
  "data/tweet-stocks/2022/2/1492282693144522754.json": "Serious C-17 airbridge to Germany and Poland right now https://t.co/3mQYbecxDX",
  "data/tweet-stocks/2022/2/1492316507837284353.json": "“The Ukrainian military is on edge tonight. I have never heard them more stressed than during calls today,” U.S. official tells me",
  "data/tweet-stocks/2022/2/1492315840628338690.json": "A Ukrainian official close to the government’s thinking tells us “The situation is really serious and uncertain”. This is a distinct change in their tone.",
  "data/tweet-stocks/2022/2/1492254594872848385.json": "Russia has deployed 2S7 Malka howitzers both near Belgorod and in Crimea. Probably shows which areas Russia will seek to \"soften\".",
  "data/tweet-stocks/2022/2/1492589834195591170.json": "*RUSSIA SAYS U.S. SUBMARINE DETECTED IN RUSSIAN WATERS: IFX\n*RUSSIA SAYS US SUBMARINE LEFT ITS WATERS AFTER INTERCEPTION:IFX",
  "data/tweet-stocks/2022/2/1492942289974480896.json": "Jake Sullivan intentionally sabotaged relations with Russia by pushing a false flag story that his own team fabricated. Now he is National Security Advisor, tasked with advising the president on dealing with Russia. How is that even possible? Where is the media? https://t.co/y5KpjbH2vb",
  "data/tweet-stocks/2022/2/1493130198547673096.json": "Wow, hold up!\n\nI took the liberty of listening to the interview with the Ukrainian Ambassador to the U.K. on BBC Radio 5, he actually denied at 1:21:00 that he believes Ukraine will remove its goal on joining NATO. Listen at 1:21:00. My transcript below. https://t.co/zEPUSH540V https://t.co/myrCdwVBH0",
  "data/tweet-stocks/2022/2/1493212765049303040.json": "*RUSSIA'S LAVROV PROPOSES TO PUTIN TO CONTINUE TALKS WITH WEST\n*PUTIN SAID 'ALL RIGHT' IN RESPONSE TO LAVROV'S PROPOSAL",
  "data/tweet-stocks/2022/2/1493308175793152000.json": "So Zelensky was mocking the deep state too... and stocks crashed:\n\nZelenskiy spooked markets with what appeared to be a sarcastic comment about the rest of the world predicting a date for a Russian attack: BBG",
  "data/tweet-stocks/2022/2/1493392248649785345.json": "Are these the people who like to give lessons to other countries about democracy and freedom?\n\nThis is one of the top ranking countries in the “democracy index”?\n\nYour credibility on these topics is now worth 0.\nhttps://t.co/wCjh9bXwDt",
  "data/tweet-stocks/2022/2/1493391838706864129.json": "Federal Emergency Act so far rejected by New Brunswick, Quebec, Alberta, Saskatchewan and Manitoba.",
  "data/tweet-stocks/2022/2/1493438196289581061.json": "Appears to be T-80 tank companies on the move in Belgorod near the border with Ukraine. They will likely damage the roads and thus this phenomenon usually only happens when they’re in the final staging areas/near the border\n\nTrain-&gt;Flatbed-&gt;Roads https://t.co/Dn7fh17xuk",
  "data/tweet-stocks/2022/2/1493761164177666051.json": "Recent Planet imagery of the Pripyat river in Belarus near the RU-UA border shows a new bridge having been constructed earlier today. https://t.co/JFRxhEUW0j https://t.co/cMTpMGrkHP",
  "data/tweet-stocks/2022/2/1493788466932588545.json": "This is the tweet that got @DefiantLs Epstein’d https://t.co/J7nqPtReey",
  "data/tweet-stocks/2022/2/1493762432984137743.json": "Russia deployed multiple engineering pontoon bridge companies to Belarus from the Eastern Military District, which, of course, was not routine. https://t.co/eqwCqB9RbI",
  "data/tweet-stocks/2022/2/1494014127576076288.json": "The scope of authoritarianism imposed by Trudeau through decree is stunning. Most western media outlets are fine with it because its targets have the wrong ideology, but that's what's disturbing: harsh tyranny will encounter little resistance provided it's aimed correctly. https://t.co/tGTTfKNefw",
  "data/tweet-stocks/2022/2/1494085746839457803.json": "Charlie Munger:\n\n- \"Over the next 100 years currency is going to zero\"\n- \"Bitcoin is a venereal disease\"\n- \"Civilized people don't buy gold\"",
  "data/tweet-stocks/2022/2/1494121865945788418.json": "Based on conversations w/multiple Ukrainian soldiers, they were on edge last night &amp; are now taking concrete actions to prepare for a Russian attack.\n\nOne soldier texted me: “Measures are being taken. Finally…I think people finally realized the seriousness of the situation.”",
  "data/tweet-stocks/2022/2/1494148804551090176.json": "Video of Quintez Brown after he was bailed out of jail. @BLMLouisville paid $100,000 for his release. Brown, a #BLM activist &amp; militant black nationalist, is accused of trying to murder mayoral candidate @RunWithCraig in a shooting. https://t.co/6K4KCa8j0z",
  "data/tweet-stocks/2022/2/1494200796325597186.json": "Ukraine has the sovereign right to seek NATO membership, to choose its course.\n\nWe will not guarantee otherwise to Russia.",
  "data/tweet-stocks/2022/2/1494226383287066624.json": "OSCE HAS RECORDED MULTIPLE SHELLING INCIDENTS ALONG THE LINE OF CONTACT IN EAST UKRAINE IN EARLY HOURS OF THURSDAY - DIPLOMATIC SOURCE\n\nOSCE HAS RECORDED USE OF ARTILLERY, BASED ON REPORTS FROM BOTH SIDES - DIPLOMATIC SOURCE",
  "data/tweet-stocks/2022/2/1494320924673204235.json": "I wish journalists wrote the articles they think they are writing.\n\nSorry to say it, but your stories aren’t always balanced and often have a clear political bias.\n\nCalling it out isn’t harassment or journalist bashing. Everyone has a right to critique your story and it’s merits.",
  "data/tweet-stocks/2022/2/1494316856815099909.json": "NOW: Asked is it your sense Putin is going to go thru with it, Biden responds, “Yes… not now, in a matter of days.” https://t.co/MUHNiuyTFw",
  "data/tweet-stocks/2022/2/1494449397257674754.json": "Security kicks a guy out of the mall for wearing a Trump mask https://t.co/HoCxfXUukY",
  "data/tweet-stocks/2022/2/1494449137240129536.json": "Justin Trudeau is informed about the trucker protests https://t.co/eUdr0NZT2h",
  "data/tweet-stocks/2022/2/1494475847364976643.json": "\"children removed\" how, exactly? Why, exactly? By whom, exactly? Sent to where, exactly? And for how long, exactly? Think this through, Canadians. This is a bad decision. https://t.co/y2eFWbumoM",
  "data/tweet-stocks/2022/2/1494473943079653384.json": "\"accounts will be frozen\" means the Canadian government can now steal your money with the collusion of the banks because you provided financial support to a protest against the government. If you think this is a good idea you deserve what coming to you. https://t.co/u1Ts0XgbqZ",
  "data/tweet-stocks/2022/2/1494724615662448652.json": "RIA is quoting the head of the Russian-backed Donetsk People's Republic responding to the question of whether things are moving towards a war, and he says \"unfortunately, yes\" #Ukraine #Russia",
  "data/tweet-stocks/2022/2/1494749013081571332.json": "🚨Amid warnings of looming Russian air strike, Ukraine requested as recently as yesterday air defense capabilities from the US, including Anti-aircraft missile batteries, counter-fire radar systems, electronic jamming devices, and the MIM-104 Patriot surface-to-air missile system https://t.co/9KobcQhkM6",
  "data/tweet-stocks/2022/2/1494712875549605888.json": "🇷🇺⚡Men from 18 to 55 years old banned from leaving the territories controlled by the LPR and DPR. https://t.co/8QvQqOrmKn",
  "data/tweet-stocks/2022/2/1494858986990014468.json": "Just now, Oksana Marchenko who is the wife of Viktor Medvedchuk, leader of a Russian aligned party and a friend of President Putin has left Ukraine and entered Belarus. Her car was stopped by Ukrainian forces for inspections along the border. Looks like something is up tonight. https://t.co/WUf70XU1xP",
  "data/tweet-stocks/2022/2/1494915791296290816.json": "In my entire 3 years around the front this is the heaviest shelling i'v heard for a long time. Two locations are now under heavy shelling",
  "data/tweet-stocks/2022/2/1495140595664310272.json": "Had an urgent conversation with President @EmmanuelMacron. Informed about the aggravation on the frontline, our losses, the shelling of 🇺🇦 politicians &amp; international journalists. Discussed the need and possible ways of immediate de-escalation &amp; political-diplomatic settlement.",
  "data/tweet-stocks/2022/2/1495308775858790402.json": "Update: Ukraine's military reports 2 soldiers killed and 4 more injured today in what is certainly the most serious escalation along the eastern frontline in a long while. Heavy 120mm &amp; 82mm mortars, 122mm artillery &amp; automatic machine grenade launchers. Even tank fire recorded.",
  "data/tweet-stocks/2022/2/1495307732072775685.json": "Compare these two maps by @CSIS. The first one is from 27 January and the second from 18 February. https://t.co/S0vdbMiipH",
  "data/tweet-stocks/2022/2/1495199558040707094.json": "Re: the \"Zorro Squad\", or all the Russian military vehicles that (starting today) have Latin Z's painted on their sides. Ruslan has been monitoring this stuff nonstop for 8 years and has no idea what they are, and hasn't seen it before. So, assume the worst, I guess/fear. https://t.co/PsiWQLjjDX",
  "data/tweet-stocks/2022/2/1495449127550922760.json": "Two amphibious assault group are present now east and west of Crimea. The first group between Crimea and Odessa (with a six assault ships from the north and the Barents fleets), the second group in the Azov Sea (with the amphibious component of the Black Sea and Caspian Sea) https://t.co/eNEVlR98mB",
  "data/tweet-stocks/2022/2/1495180520686247945.json": "#Ukraine 🇺🇦 has summoned #Israel 🇮🇱's ambassador\n\nSome areas of recent tension:\n\n1) Israel reportedly requested Russian assistance in evacuating its citizens if war breaks out \n\n2) Israel has impeded arms shipments from the Baltic States to Ukraine",
  "data/tweet-stocks/2022/2/1495549143510568965.json": "NEW: Russia is deploying more armored equipment and troops near Belgorod, Soloti, Valuyki as close as 10 miles from the Ukrainian border.\n\nMost of the combat units at Soloti are now departing, per satellite images, heading south in the direction of Ukraine. \n\n📷:@Maxar https://t.co/9UssWs2FSU",
  "data/tweet-stocks/2022/2/1495798235134369799.json": "Russian forces destroyed Ukrainian forces that tried to infiltrate the border and took one Ukrainian POW: FSB Director Bortnikov",
  "data/tweet-stocks/2022/2/1495854125011148818.json": "Biden administration officials have discussed plans with the Ukrainian government for President Volodymyr Zelenskyy to leave Kyiv in the event of a Russian invasion, according to two people familiar with the discussions. @carolelee",
  "data/tweet-stocks/2022/2/1495848747951132672.json": "I look forward to the president whose crackhead son was given a multi-million dollar sinecure running Ukraine’s natural gas company explaining to us why this allegation is false. https://t.co/ZNzdsxdgYI",
  "data/tweet-stocks/2022/2/1495847554277425166.json": "This is not hype. This is not hysteria.  This is not a provocation.  Despite what Russia tries to allege, the cold hard truth is that Russia is right now trying to create a pretext for military action. 1/2\n\nhttps://t.co/3rVzLL660z",
  "data/tweet-stocks/2022/2/1495832639462387714.json": "\"Ukraine has been created by Russia - by a Bolshevik Russia\" - what a way for Putin to start off that address to the nation.",
  "data/tweet-stocks/2022/2/1496204425056161795.json": "WATCH: Documents being destroyed at the Russian Consulate in Odessa, Ukraine as diplomats prepare to evacuate https://t.co/OmWTQ3Qlf2",
  "data/tweet-stocks/2022/2/1496298891267956740.json": "To make himself independent of the West, Putin has stopped investing FX reserves in US govt bonds. #Russia now holds only $3.9bn in US govt bonds. The volume used to be $176bn in 2010. Putin has shifted many reserves into #gold. https://t.co/WnsKAdJK5c",
  "data/tweet-stocks/2022/2/1496578138972856324.json": "JUST IN - Large German health insurance company analyzed data from 10.9 million insured individuals regarding vaccination complications.\n\nThe new data is \"alarming,\" says BKK board member Schöfbeck in a report by WELT.\n\nhttps://t.co/KV4orAjUCB",
  "data/tweet-stocks/2022/2/1496624540998377475.json": "@PentagonPresSec \"They're telling you that this flame will liberate the people of Ukraine, but the Ukrainian people are free. They remember their past and are building their future,\" Zelensky says. \"Ukraine on your TV news and the real Ukraine are two totally different countries. Ours is real.\"",
  "data/tweet-stocks/2022/2/1496624512737157120.json": "@PentagonPresSec \"This step could be the start of a big war on the European continent. The whole world is talking about what could happen any day now,\" says Zelensky. \"Any provocation. Any flare-up – one that could burn everything.\"",
  "data/tweet-stocks/2022/2/1496624493955067908.json": "@PentagonPresSec He addresses Russians in Russian.\n\n\"We are divided by a shared border of more than 2,000km. Almost 200,000 of your troops and thousands of military vehicles are standing alongside it. Your leadership has ordered them to move forward, onto another country's territory.\"",
  "data/tweet-stocks/2022/2/1496622255035625479.json": "Zelenskiy appeals - in Russian - to the Russian people, to artists, actors, journalists and civil society, to stop Putin launching a war. \n\nSeems like it might already be too late for that. https://t.co/m55dpmVNvN",
  "data/tweet-stocks/2022/2/1496620815445643269.json": "Russian television is in full military swing and frenzy .  Two minutes of fireworks followed by Putin’s rant about defence, followed by news of Ukrainian attack on DNR LNR and saboteurs in Crimea.",
  "data/tweet-stocks/2022/2/1496628375141732354.json": "JUST IN: @OSCE_SMM reports aggressive action from Russian fighters in occupied areas -also rare sighting of Russian insignia. Unmanned aerial vehicle equipment seized; weapon loaded. Mission is only eyes/ears of intl community in occupied areas https://t.co/xpOAltw8S4 #Ukraine https://t.co/2QEqp6zbec",
  "data/tweet-stocks/2022/2/1496669411981283329.json": "The #Russian invasion of #Ukraine is now underway",
  "data/tweet-stocks/2022/2/1496668502660460549.json": "Crimea!!! Kalanchak outpost is under attack. Ukrainian soldiers and civilians are running away #Crimea #Ukraine #Crimea https://t.co/gemJ0TO2bA",
  "data/tweet-stocks/2022/2/1496663172329136131.json": "My bank accounts have been unfrozen,  now that the EA is over. \nTomorrow I'll close all of my BMO accounts after withdrawing my money.",
  "data/tweet-stocks/2022/2/1496675949512904704.json": "In the hours to come #Russia will \n-conduct strikes on air defense systems\n-move to cut off #Kyiv from eastern #Ukraine \n-move to cut off Ukraine’s military forces on the line of contact in the east to prevent them from falling back to defend Kyiv",
  "data/tweet-stocks/2022/2/1496675129639718915.json": "Russian Strategic Bomber radio net active. Cruise missile launches may be imminent.",
  "data/tweet-stocks/2022/2/1496690729200062464.json": "US official tells me: Right now we are seeing the pre assault fires. Expect this to go on for a few hours. Land attack to follow with ALL of the full forces Putin has arrayed. Explosions heard in Kiev, Odessa, Mariupol. “It’s begun.”",
  "data/tweet-stocks/2022/2/1496701258522140675.json": "Where I’m staying in Kharkiv, the staff is freaking out. “What is going on? I don’t watch the news. What is this?”",
  "data/tweet-stocks/2022/2/1496700995564445698.json": "Just a reminder that Zelensky never ordered a full mobilization because he was so convinced that invasion wasn’t going to happen… Too late to do that now",
  "data/tweet-stocks/2022/2/1496697407383523335.json": "Russia alone is responsible for the death and destruction this attack will bring, and the United States and its Allies and partners will respond in a united and decisive way. \n\nThe world will hold Russia accountable.",
  "data/tweet-stocks/2022/2/1496719104258056193.json": "President Zelenskyy reached out to me tonight and we just finished speaking. I condemned this unprovoked and unjustified attack by Russian military forces. I briefed him on the steps we are taking to rally international condemnation, including tonight at the UN Security Council.",
  "data/tweet-stocks/2022/2/1496711774984445958.json": "#Russia isn’t just focused on seizing eastern #Ukraine \n\nRussian military forces are working towards isolating #Kyiv at this very moment",
  "data/tweet-stocks/2022/2/1496721294498451457.json": "I know CNN &amp; MSNBC never aired this, so I figured I would. Spot on, don't you think? https://t.co/6V1vRKxP8p",
  "data/tweet-stocks/2022/2/1496869547760287745.json": "European nat gas prices now up 60%, biggest one day jump on record https://t.co/4992VMtkU5",
  "data/tweet-stocks/2022/2/1496879735795761159.json": "#Breaking #NewsMap \nThe Ukrainian front in Kherson totally collapsed.\nRussian troops reached the Dnepr and do not face any resistance.\nI geolocated them 130 km inside Ukraine.\nThe Ukrainian army says the situation is \"difficult\". Understatement of the year.\nThis is unbelievable. https://t.co/0yExuFmjXA",
  "data/tweet-stocks/2022/2/1497007638101774336.json": "Canceled comedian Louis CK to perform in Kyiv despite Russian invasion https://t.co/jxGBPW3Rys https://t.co/TUIvWSFT8c",
  "data/tweet-stocks/2022/2/1496983531318304773.json": "Zelensky claims enemy \"sabotage\" forces have entered Kyiv but he is staying",
  "data/tweet-stocks/2022/2/1497039976118505473.json": "Whatever was shot down over Kyiv was pretty big https://t.co/aV6a3VwPgX",
  "data/tweet-stocks/2022/2/1497081780595216390.json": "LIVE: Russian ambassador holds news conference in Tokyo https://t.co/by8dVWfL4B",
  "data/tweet-stocks/2022/2/1496989172233555968.json": "President Zelensky has confirmed that all 13 Ukrainian defenders on Snake Island were killed by Russian Navy attacks. They refused to surrender to Russia and were killed. https://t.co/4GIkjlquaD",
  "data/tweet-stocks/2022/2/1497217604808753185.json": "BREAKING: In a video conference call last night Ukraine President Zelensky told EU leaders: \"This might be the last time you see me alive\", two sources briefed on the call told me",
  "data/tweet-stocks/2022/2/1497251520202612747.json": "\"To all Ukrainian people: don't be scarred of those Chechens [brought by Russians] they're jackals and represents nothing. They're simply bearded people and we gonna shave them!\"\n\n#ukraine #war #russianinvasion https://t.co/EmNhreakvQ",
  "data/tweet-stocks/2022/2/1497267905003724800.json": "2 more merchant ships hit by Russian attacks in Black Sea.\n\nJapanese bulk carrier MV Namura Queen hit by a rocket at anchor off Yuzhne.\n\nMoldovan chemical tanker MV Millennial Spirit hit and set on fire 12 miles to the south\n\nhttps://t.co/fazJtNvJk6\n\nVideo: suvaribeyinnotdefteri https://t.co/p5BHZmUPIk",
  "data/tweet-stocks/2022/2/1497353074389630981.json": "Wow dying twice, super unlucky!!!!!!!! https://t.co/VS5zMgG1l9",
  "data/tweet-stocks/2022/2/1497380158822567938.json": "❗️ #Kyiv. More than 50 shots and explosions, machine gun fire in the area of Shulyavka and Zoo in the last 10 minutes.",
  "data/tweet-stocks/2022/2/1497419164335624194.json": "Exclusive: Zelensky asked from Israeli PM Bennet to mediate between #Ukraine and Russia, in the middle of the battle of #Kiev. They spoke via phone, and a source briefed about it told me: Israel is the only Western country that have a good enough relations with both countries.",
  "data/tweet-stocks/2022/2/1497413057638715392.json": "If you went to bed 5 trading days ago and just now woke up, you will be delighted to learn that the S&amp;P has moved exactly 0.00% https://t.co/OIyxjKSC4N",
  "data/tweet-stocks/2022/2/1497086119221116928.json": "https://t.co/QOaGNzCNMw",
  "data/tweet-stocks/2022/2/1497485490232172545.json": "For the first time in 67 days, Germany is buying Russian gas via the Yamal-Europe pipeline (throughout Belarous and Poland). The Mallnow pumping station is showing positive flows (chart). Since December 21, Gazprom had only shipped gas into Germany via NordStream 1 | #Ukraine https://t.co/8akUEGwmux",
  "data/tweet-stocks/2022/2/1497636703925850119.json": ".@ZelenskyyUa says Ukraine has gotten Europe to agree to cut Russia off from SWIFT. \"This is an important victory. It means billions &amp; billions in losses for Russia. That's the cost of its backstabbing invasion.\"\n(Germany reportedly supports a \"targeted\" partial SWIFT cutoff) https://t.co/o9pAVr3OPC",
  "data/tweet-stocks/2022/2/1497810642136297480.json": "Per Bellingcat, leaked telegram channels state that the Russian General Staff has ordered troops to take Kyiv by Monday, no matter the costs of human life\n\nPlease continue to provide aid and support to #Ukraine. #Russia cannot, and will not win",
  "data/tweet-stocks/2022/2/1497980518192885762.json": "☢️Putin: \"Western countries aren't only taking unfriendly economic actions against our country, but leaders of major Nato countries are making aggressive statements about our country. So I order to move Russia's deterrence(Nuclear) forces to a special regime of duty.\" https://t.co/ui68SGcKTS",
  "data/tweet-stocks/2022/2/1498024966582898691.json": "https://t.co/VJ97Axcfmw",
  "data/tweet-stocks/2022/2/1498069631168307201.json": "Former U.S. Ambassador to Russia McFaul: \"The people who know Putin the best -- people I know in Russia -- are worried about his recent nuclear statement. The people who know him the least are saying it's cheap talk.\"",
  "data/tweet-stocks/2022/2/1498068864940359686.json": "Ukrainian Member of Parliament Illia Kyva accuses the government of \"fascist tactics\", using civilians as \"human shields\", says Zelensky knew about the coming war &amp; refused diplomacy https://t.co/befI2Z85hv",
  "data/tweet-stocks/2022/2/1498067907053592576.json": "RUSSIAN CENTRAL BANK ORDERS MARKET PLAYERS TO REJECT FOREIGN CLIENTS' BIDS TO SELL RUSSIAN SECURITIES FROM 0400 GMT ON FEB 28 — CENTRAL BANK DOCUMENT SEEN BY REUTERS",
  "data/tweet-stocks/2022/2/1498091808227799040.json": "I will be filing a bill to sanction &amp; issue a lifetime visa ban for any govt official in #Ukraine who collaborates with #Russia to govern any part of the country \n\nAnd I hope the EU &amp; every NATO nation will do the same"
}