{
  "data/tweet-nytimes/2021/7/1410399381744984064.json": "Breaking News: A grand jury is said to have indicted the Trump Organization and one of its top executives, Allen Weisselberg, in connection with a tax investigation. https://t.co/IQv3vcBD97",
  "data/tweet-nytimes/2021/7/1410420412807270402.json": "A California couple who mowed down 36 protected Joshua trees to clear their land for a new house have been fined $18,000, a punishment the authorities hope will discourage others from uprooting the iconic desert plants. https://t.co/m9nSBKnXNk",
  "data/tweet-nytimes/2021/7/1410547353866604545.json": "Breaking News: Allen Weisselberg, a top executive at the Trump Organization, surrendered to the Manhattan district attorney’s office to face charges, officials said. https://t.co/7MmwhW22LE",
  "data/tweet-nytimes/2021/7/1410592796705181697.json": "A California couple who mowed down 36 protected Joshua trees to clear their land for a new house have been fined $18,000, a punishment the authorities hope will discourage others from uprooting the iconic desert plants. https://t.co/P1g5uBDqGF",
  "data/tweet-nytimes/2021/7/1410473260509184002.json": "“For nearly 50 years, this just sat in a basement and no one cared,” Questlove said about the Harlem Cultural Festival footage he watched on loop for months to make his new, acclaimed documentary, “Soul of Summer.” https://t.co/2T6dSsqAQV",
  "data/tweet-nytimes/2021/7/1410649670737670145.json": "Prince William and Prince Harry reunited briefly to unveil a statue of their mother, Princess Diana, on what would have been her 60th birthday.\n\n“Every day, we wish she were still with us,” the brothers said in a rare joint statement. https://t.co/26IGxZSqOD https://t.co/cALMO8pUxr",
  "data/tweet-nytimes/2021/7/1410648156497448963.json": "The Biden administration is expected to take its first steps Thursday toward finalizing a ban on surprise medical bills. Some experts see the policy as the most important consumer protection in health care to come out of Washington in more than a decade. https://t.co/6iE6EF28UU",
  "data/tweet-nytimes/2021/7/1410619229540335616.json": "The Delta variant is now responsible for about one in every four coronavirus infections in the U.S., according to CDC estimates. Here’s what scientists know (and what you should, too). https://t.co/CyfJUN507c https://t.co/5j68aEqOZ9",
  "data/tweet-nytimes/2021/7/1410636834741366787.json": "130 countries signed on to an American-led effort to create a 15% minimum corporate tax rate. The plan for a new global tax system would ensure multinational corporations pay a fair share of tax wherever they operate and earn profits. https://t.co/w4d9g7Xvxb",
  "data/tweet-nytimes/2021/7/1410670007156105226.json": "Breaking News: The Trump Organization was charged in a 15-year-long tax fraud scheme. Allen Weisselberg, Donald Trump’s long-serving chief financial officer, was also accused of avoiding taxes on $1.7 million in income. https://t.co/JWD1E8xjqZ",
  "data/tweet-nytimes/2021/7/1410680605877092359.json": "A California woman who falsely accused a Black teenager of stealing her phone and then attacked him at a New York City hotel was charged with a hate crime. A video of her confronting Keyon Harrold Jr., then 14, in December gained widespread attention. https://t.co/na5Avr4VO6",
  "data/tweet-nytimes/2021/7/1410679640314761219.json": "The wealth management firm that was set to take over as the co-conservator of Britney Spears’s estate, alongside her father, has requested to resign from the arrangement, citing Spears’s public objections to the conservatorship. https://t.co/flcolzKUK7",
  "data/tweet-nytimes/2021/7/1410702184250028036.json": "Mary Wallace Funk, a trailblazing 82-year-old pilot who was prevented from becoming an astronaut in the 1960s because she was a woman, will join Jeff Bezos on his rocket ship company’s first human flight into space, the company announced on Thursday. https://t.co/lSBv11IuND",
  "data/tweet-nytimes/2021/7/1410795398776639493.json": "The Johnson &amp; Johnson coronavirus vaccine is effective against the highly contagious Delta variant, even eight months after inoculation, the company reported on Thursday. https://t.co/yrSE7BV0Jx",
  "data/tweet-nytimes/2021/7/1410604798693429252.json": "Breaking News: The Supreme Court rejected California’s requirement that charities report the identities of major donors, siding with conservative groups who said the disclosures could lead to harassment. https://t.co/lU6a9z32EA",
  "data/tweet-nytimes/2021/7/1410861071364235268.json": "The American sprinter Sha’Carri Richardson, who was set to compete at the Tokyo Olympics this month, could miss the Games after testing positive for marijuana. https://t.co/X5wsYcQiUt",
  "data/tweet-nytimes/2021/7/1410893773081649153.json": "The Johnson &amp; Johnson coronavirus vaccine is effective against the highly contagious Delta variant, even eight months after inoculation, the company reported on Thursday. https://t.co/fSCXpMTQuy",
  "data/tweet-nytimes/2021/7/1410924986114756611.json": "A California woman who falsely accused a Black teenager of stealing her phone and then attacked him at a New York City hotel was charged with a hate crime. A video of her confronting Keyon Harrold Jr., then 14, in December gained widespread attention. https://t.co/rgBQ22GnQx",
  "data/tweet-nytimes/2021/7/1410772755226763264.json": "News Analysis: The criminal case against Donald Trump’s business could deliver a blow to his finances, and he remains the focus of a broader investigation in New York. https://t.co/V4fFC7xofx",
  "data/tweet-nytimes/2021/7/1410904847939948545.json": "Brianna McNeal, an Olympic hurdler who last month qualified for Tokyo, said she didn’t open her door to antidoping officials in 2020 because she was in bed recovering after an abortion.\n\nShe now feels compelled to speak about her abortion to clear her name.https://t.co/azFkgCXdUn",
  "data/tweet-nytimes/2021/7/1410952271374991360.json": "Breaking News: Sha’Carri Richardson, an Olympic gold-medal favorite in the 100 meters, apologized for a positive marijuana test. She was suspended for a month.\nhttps://t.co/9iv7qj249H",
  "data/tweet-nytimes/2021/7/1410887244559392772.json": "With little fanfare and no public ceremony, American troops and their Western allies departed Afghanistan’s largest air base.\n\nBagram, the sprawling outpost from which the U.S. waged war for nearly two decades, was handed over to the Afghan government.\nhttps://t.co/CHJmRqlh8F https://t.co/NrT0ATYvw8",
  "data/tweet-nytimes/2021/7/1411047028256280586.json": "Johnson &amp; Johnson said its Covid vaccine was effective against the highly contagious Delta variant, adding to the growing body of evidence that the most widely available Covid shots offer protection against its most dangerous variants. https://t.co/pc1yNKohgV",
  "data/tweet-nytimes/2021/7/1411077244437553157.json": "The track star Sha’Carri Richardson, who apologized for her marijuana use, said she had used the drug to cope with the news that her biological mother had died. Her chance to compete in the Olympics is now in jeopardy. https://t.co/YRFl3OsWzp",
  "data/tweet-nytimes/2021/7/1411122540269932546.json": "Donald Trump twice sought to talk on the phone with the Republican leader of Arizona’s largest county last winter as the Trump campaign tried to reverse the state’s election results, according to the official and records obtained by The Arizona Republic. https://t.co/epn7updDQZ",
  "data/tweet-nytimes/2021/7/1410735022521282563.json": "Democratic Senators Elizabeth Warren and Bob Casey are calling on federal agencies to increase oversight of conservatorship systems, following testimony from Britney Spears that she had been abused under her conservatorship. https://t.co/gwFZ5ymUxo",
  "data/tweet-nytimes/2021/7/1411318821265326081.json": "Facing 72-hour work weeks and rising housing prices, many young people in China fear they will be the first generation not to do better than their parents. They are now defying the country’s long-held prosperity narrative by refusing to participate in it. https://t.co/YidkEuci1A",
  "data/tweet-nytimes/2021/7/1411107449474629632.json": "Many millennials, thrust into adulthood circa 2008, have experienced two financial crises before turning 40. With savings tapped and retirement accounts drawn down, this generation’s window for achieving financial security may have already begun to close. https://t.co/M4b5VcNgm7",
  "data/tweet-nytimes/2021/7/1411414480886579204.json": "A leak in an underwater gas pipe sparked a swirling fire that raged for hours in the Gulf of Mexico on Friday, creating a biblical scene that drew comparisons to Mordor, the volcanic hellscape from “The Lord of the Rings.” https://t.co/3zOzOkv0Hm",
  "data/tweet-nytimes/2021/7/1411424532590694410.json": "Today, flying the American flag from the back of a pickup truck or over a lawn is increasingly seen as a clue, albeit an imperfect one, to a person’s political affiliation in a deeply divided nation. https://t.co/TODmHEmPsO",
  "data/tweet-nytimes/2021/7/1410880946631495684.json": "Prince William and Prince Harry reunited briefly to unveil a statue of their mother, Princess Diana, on what would have been her 60th birthday.\n\n“Every day, we wish she were still with us,” the brothers said in a rare joint statement.\nhttps://t.co/MXHzoI2GgY https://t.co/jWmS1FCeQ6",
  "data/tweet-nytimes/2021/7/1411479879611150339.json": "What the world needs now are trees, more trees 🌳 https://t.co/fLkRbXHP9g",
  "data/tweet-nytimes/2021/7/1411379227665043459.json": "Eleven men wearing military-style gear and claiming to be “foreign nationals” were arrested after an hourslong armed standoff beside a Massachusetts interstate. https://t.co/aQAxYPbwDI",
  "data/tweet-nytimes/2021/7/1411505085687992321.json": "130 countries signed on to an American-led effort to create a 15% minimum corporate tax rate. The plan for a new global tax system would ensure multinational corporations pay a fair share of tax wherever they operate and earn profits. https://t.co/Dbt6pox3LH",
  "data/tweet-nytimes/2021/7/1411469824245522432.json": "Brazilians have been enraged over how slowly their government moved to acquire coronavirus vaccines. Now, a corruption scandal involving vaccine deals has brought simmering tensions to a boil. https://t.co/7B3m0RhcD3",
  "data/tweet-nytimes/2021/7/1411389288206438403.json": "Who actually gets to ditch their masks? https://t.co/UJIAFrSk5j",
  "data/tweet-nytimes/2021/7/1411464791319842817.json": "Since 2008, a South Asian American child has been a champion at every Scripps National Spelling Bee. It’s a fascination with years of history. https://t.co/b8YWBTwYXE",
  "data/tweet-nytimes/2021/7/1411580586053996546.json": "The Johnson &amp; Johnson coronavirus vaccine is effective against the highly contagious Delta variant, even eight months after inoculation, the company reported — a finding that should reassure the 11 million Americans who have gotten the shot. https://t.co/sLBOsQGN0y",
  "data/tweet-nytimes/2021/7/1411510585225789440.json": "While it is not yet legal to sell or buy marijuana in New York, smoking a joint on the street is not a crime anymore. As long as they observe the same restrictions as on cigarettes, smokers can pretty much spark up where they like. https://t.co/kPGLOCHAJp",
  "data/tweet-nytimes/2021/7/1411595663142445062.json": "A California couple who mowed down 36 protected Joshua trees to clear their land for a new house have been fined $18,000, a punishment the authorities hope will discourage others from uprooting the iconic desert plants. https://t.co/JHIOtQXFl2",
  "data/tweet-nytimes/2021/7/1411681211450368001.json": "Bisexual people face discrimination from both gay people and straight people, a study found. It can directly impact their mental health, contributing to depression, stress and anxiety. https://t.co/EWof3V0PBp",
  "data/tweet-nytimes/2021/7/1411672417672613892.json": "A video last year showed a white ESPN reporter suggesting her colleague got a prized job because she is Black. The fallout at the network has been lasting. https://t.co/oFMRglpCHx",
  "data/tweet-nytimes/2021/7/1411802023700336644.json": "\"I love her more now than I did to begin with — which is saying a lot, because I loved her a lot,\" Jimmy Carter said of his wife, Rosalynn, as the former first couple approaches their 75th wedding anniversary. https://t.co/ED61J1NtsK",
  "data/tweet-nytimes/2021/7/1411842280751763459.json": "“For nearly 50 years, this just sat in a basement and no one cared,” Questlove said about the Harlem Cultural Festival footage he watched on loop for months to make his new, acclaimed documentary, “Soul of Summer.” https://t.co/EWgKZa89j3",
  "data/tweet-nytimes/2021/7/1411600686488428546.json": "Many millennials, thrust into adulthood circa 2008, have experienced two financial crises before turning 40. With savings tapped and retirement accounts drawn down, this generation’s window for achieving financial security may have already begun to close. https://t.co/eAe7NiKREH",
  "data/tweet-nytimes/2021/7/1411751690081087488.json": "Controlled Demolition Inc., the company hired to demolish the remaining section of the Champlain Towers South condo, has more than 70 years of experience bringing down some of the world’s biggest structures, including the Seattle Kingdome in 2000. https://t.co/RtQ61PCHmP",
  "data/tweet-nytimes/2021/7/1411942949689204738.json": "French prosecutors are investigating whether brands like Zara, Uniqlo and Skechers profited from “crimes against humanity” by using forced labor by Uyghurs in China. https://t.co/0AV672CrcD",
  "data/tweet-nytimes/2021/7/1411984468198498304.json": "Nearly 900 people in Rome showed up for an overnight vaccination drive targeting “people on the margins of society.” Live music and free espresso and Italian croissants also helped draw in the crowds. https://t.co/4BbdMoMUDS",
  "data/tweet-nytimes/2021/7/1412059554100166666.json": "\"I love her more now than I did to begin with — which is saying a lot, because I loved her a lot,\" Jimmy Carter said of his wife, Rosalynn, as the former first couple approaches their 75th wedding anniversary. https://t.co/zuYueiYrsl",
  "data/tweet-nytimes/2021/7/1412067520257957893.json": "Rep. Adam Kinzinger is one of the few Republicans speaking out against the big lie that the presidential election was stolen.\n\n“If you’re scared to tell the truth to people, I understand, but you need to find a different line of work,” he tells @NYTMag.\nhttps://t.co/URh0UeP2M3",
  "data/tweet-nytimes/2021/7/1412010911116759040.json": "In a case that has riveted Iran, a couple confessed to murdering and dismembering their son, years after killing a daughter and son-in-law.\n\n“I have no guilty conscience,” the 81-year-old husband said. “I killed people who were very morally corrupt.” https://t.co/f9MvXMn7iQ",
  "data/tweet-nytimes/2021/7/1412028520767889408.json": "Today, flying the American flag from the back of a pickup truck or over a lawn is increasingly seen as a clue, albeit an imperfect one, to a person’s political affiliation in a deeply divided nation. https://t.co/6cZF7DJgxK",
  "data/tweet-nytimes/2021/7/1412100234646278145.json": "The discovery of unmarked graves at former schools for Indigenous children in Canada has revived conversations about the profound damage inflicted on generations of Indigenous families.\n\nThese photos show the relentless effort to erode their culture\nhttps://t.co/q0Vch4sp2G https://t.co/TaWAKlH41R",
  "data/tweet-nytimes/2021/7/1411771803731697670.json": "Another condo building in South Florida was evacuated by firefighters Saturday night after a building inspector reported finding potentially dangerous structural issues. https://t.co/pelQBIOdY5",
  "data/tweet-nytimes/2021/7/1412086425089097733.json": "Eve Adams, a gay writer and Polish Jew, published “Lesbian Love,” one of the earliest examples of America lesbian literature, in 1925.\n\nShe was deported to Poland from the U.S. in 1927 and later died at Auschwitz.\n\nThis is her story.\nhttps://t.co/i2XeZ9dLYw",
  "data/tweet-nytimes/2021/7/1411835884455051270.json": "Breaking News: Demolition of the part of the Florida condo that is still standing will begin after 10 p.m. Eastern tonight, the authorities said. https://t.co/4i0PkqviPL",
  "data/tweet-nytimes/2021/7/1412146812186775554.json": "The discovery of unmarked graves at former schools for Indigenous children in Canada has revived conversations about the profound damage inflicted on generations of Indigenous families.\n\nThese photos show the relentless effort to erode their culture.\nhttps://t.co/FfzWD3avXj",
  "data/tweet-nytimes/2021/7/1412048650444943360.json": "How much did the coronavirus spread through private gatherings last year? Quite a lot, a new study found. It relied on a creative method that used health insurance claims data to look at Covid rates of families in the two weeks after a birthday. https://t.co/TtKyfdONwT",
  "data/tweet-nytimes/2021/7/1411545317493948417.json": "The number of U.S. children under 13 who need urgent mental health care is on the rise, and has been for years, interviews with mental health providers and hospital data reveal. https://t.co/AbxIBJEdVB",
  "data/tweet-nytimes/2021/7/1411691291767980038.json": "Engineers who have visited or examined photos of the wreckage of the Champlain Towers South condominium complex have been struck by a possible flaw in its construction. https://t.co/2uAB7egBhY",
  "data/tweet-nytimes/2021/7/1411731558856265731.json": "A leak in an underwater gas pipe sparked a swirling fire that raged for hours in the Gulf of Mexico on Friday, creating a biblical scene that drew comparisons to Mordor, the volcanic hellscape from “The Lord of the Rings.” https://t.co/ticchpDQrO",
  "data/tweet-nytimes/2021/7/1412105283300741126.json": "President Biden lauded America's progress against the coronavirus pandemic during an Independence Day celebration at the White House, saying that getting vaccinated is “the most patriotic thing you can do.”\nhttps://t.co/uGX7HDqPwY https://t.co/tHnDBsRh9q",
  "data/tweet-nytimes/2021/7/1412399012054016000.json": "Nikole Hannah-Jones, a Pulitzer Prize-winning journalist and New York Times Magazine correspondent, said she would join Howard University’s faculty, less than a week after trustees at the University of North Carolina voted to grant her tenure.\nhttps://t.co/PVjJbqIvwP",
  "data/tweet-nytimes/2021/7/1412451294086840324.json": "Jessica Springsteen, the daughter of Bruce Springsteen and Patti Scialfa, is ranked 27th in the world in show jumping and has a good chance to win a medal at the Tokyo Olympics. https://t.co/0JtQAmnq9v",
  "data/tweet-nytimes/2021/7/1412454889406578692.json": "Breaking News: Rachel Nichols will not work as a sideline reporter for the NBA finals, ESPN said. She will be replaced by Malika Andrews. https://t.co/eGjcuMtFaN",
  "data/tweet-nytimes/2021/7/1412466696120643585.json": "Breaking News: The Pentagon canceled a $10 billion contract with Microsoft after a legal fight over whether Donald Trump intervened in 2019 to shut down Amazon’s bid. https://t.co/LoPoRUBYR8",
  "data/tweet-nytimes/2021/7/1412531635342479367.json": "Breaking News: Sha’Carri Richardson will miss the Tokyo Olympics entirely after officials decided not to include her on a U.S. relay team. She previously lost her spot in the women’s 100 meters after failing a drug test for marijuana. https://t.co/IDLWDkcDgP",
  "data/tweet-nytimes/2021/7/1412516753331064839.json": "The Danish soccer player Christian Eriksen and the paramedics who helped save his life after he collapsed on the field during Denmark’s first game at Euro 2020 have been invited to attend Sunday’s final in London by UEFA, the tournament’s organizer. https://t.co/Ark23x7jf4",
  "data/tweet-nytimes/2021/7/1412560448248061952.json": "Breaking News: Eric Adams won the Democratic nomination for mayor of New York City, according to The Associated Press, putting him on track to become the second Black mayor in the history of the nation’s largest city. https://t.co/GNbrxPjPn6",
  "data/tweet-nytimes/2021/7/1412373316262838272.json": "As the appetite for cable news wanes, Rupert Murdoch is preparing to launch a new TV venture: Fox Weather.\n\nThe company is aggressively poaching star meteorologists, hoping to become a powerful new player in a sphere long dominated by the Weather Channel.\nhttps://t.co/oxG0YHNNW8",
  "data/tweet-nytimes/2021/7/1412582149451141121.json": "A New Jersey man who was caught on video shouting racist insults and harassing his neighbors was arrested twice and charged with several hate crimes, with his second arrest coming as people staged an hourslong protest outside his home. https://t.co/VRUCiTwkBC",
  "data/tweet-nytimes/2021/7/1412484045775282176.json": "Six months ago today, a pro-Trump mob stormed the U.S. Capitol. Watch our documentary mapping out how — and why — instigators set off a wave of violence that engulfed the building. https://t.co/FzgFHyEplC",
  "data/tweet-nytimes/2021/7/1412459354297712640.json": "Six months after the Jan. 6 riot, the U.S. Capitol Police is planning to expand operations outside Washington in an effort to better protect lawmakers, beginning with the opening of field offices in California and Florida. https://t.co/uvUhCEx7FU",
  "data/tweet-nytimes/2021/7/1412620369387831296.json": "Dilip Kumar, one of India’s earliest Method actors who ruled Hindi cinema in the 1950s and 1960s, died at 98. https://t.co/VPSbTwEUUf",
  "data/tweet-nytimes/2021/7/1412725779407020032.json": "Breaking News: President Jovenel Moïse of Haiti was assassinated in an attack at his home near the capital, Port-au-Prince, the prime minister said.\nhttps://t.co/lOLd2cpo2P",
  "data/tweet-nytimes/2021/7/1412573346403962883.json": "A lawyer representing Britney Spears in her conservatorship requested on Tuesday that he be allowed to step down, becoming the latest party to resign from the arrangement after Spears called it abusive at a hearing last month. https://t.co/YEGSIfsa4V",
  "data/tweet-nytimes/2021/7/1412737211158642691.json": "President Jovenel Moïse of Haiti was assassinated in an attack at his home on the outskirts of the capital, Port-au-Prince, the prime minister said.\n\nHis wife, Martine Moïse, was also shot and her condition was not immediately clear.\n\nFollow updates.\nhttps://t.co/99x2f3fvtK",
  "data/tweet-nytimes/2021/7/1412713068178640903.json": "Lil Nas X wants to be not just a pop star but a visibly gay one — founded on genuine pride and comfort. After years of hiding himself, he is trying to be a hitmaker, a pop star, an out gay man and a sexual being. @jazzedloon profiles him for @NYTMag. \nhttps://t.co/UYGJ6IB64z",
  "data/tweet-nytimes/2021/7/1412399717238165511.json": "White flags are being used in Malaysian cities to signify a need for food or other help, mostly by low-income families who have been financially affected by long lockdowns. Thousands of people, including artists and celebrities, have stepped in. https://t.co/EQlytZMHe6",
  "data/tweet-nytimes/2021/7/1412743264940273664.json": "Last month was the warmest June ever recorded in North America, researchers said. https://t.co/jt8cx8vSHI",
  "data/tweet-nytimes/2021/7/1412618652600393728.json": "More than 125 people who attended a religious camp in Texas last month have tested positive for Covid-19. Camp officials also warned that many more people may have been exposed to the virus. https://t.co/ijwma12VUX",
  "data/tweet-nytimes/2021/7/1412812864679731208.json": "Donald Trump announced plans to sue Facebook, Twitter and Google after the platforms have taken various steps to ban him or block him, and his political operation immediately began fund-raising. “If they can do it to me, they can do it to anyone,” he said. https://t.co/pVJJKdw1Fz",
  "data/tweet-nytimes/2021/7/1412559509566988291.json": "“Please get vaccinated now — it works, it’s free, it’s never been easier,” President Biden said on Tuesday as part of a renewed push to reach tens of millions of Americans who remain unvaccinated against the coronavirus. https://t.co/7r85H6xjUU https://t.co/I5k9R6gRyi",
  "data/tweet-nytimes/2021/7/1412806121513947139.json": "Senator Tammy Duckworth, an Army veteran who lost her legs in the Iraq war, talked to The New York Times about her efforts to end the U.S. government’s practice of deporting undocumented immigrants who served honorably in the military. https://t.co/9D6Y7SJRmU https://t.co/MJy5ppmYDi",
  "data/tweet-nytimes/2021/7/1412796098289283081.json": "Sen. Tammy Duckworth is pushing to end the government’s practice of deporting undocumented veterans.\n\n“People don’t even know that we are deporting veterans,” she told The New York Times. “We are actually deporting people who served honorably.”\nhttps://t.co/OxUSeWfGOQ",
  "data/tweet-nytimes/2021/7/1412899119211991044.json": "Breaking News: Jacob Zuma, South Africa’s ex-president, was taken to prison to begin a 15-month sentence, a stunning downfall for the former freedom fighter. https://t.co/Ha8sqiYJgu",
  "data/tweet-nytimes/2021/7/1412774701475192834.json": "President Biden plans to issue an executive order that will encourage federal regulators to crack down on noncompete clauses. The effort is meant to improve workers’ ability to get better jobs and boost competition across the economy.\nhttps://t.co/S7quiXzgw5",
  "data/tweet-nytimes/2021/7/1412909327967473673.json": "The extraordinary heat wave that scorched the Pacific Northwest last week would almost certainly not have occurred without global warming, an international team of climate researchers said Wednesday.\nhttps://t.co/YW5JiroDP0",
  "data/tweet-nytimes/2021/7/1412891393102696448.json": "England beat Denmark to advance to the Euro 2020 final against Italy. It will be the England soccer team's first appearance in a major tournament final since the 1966 World Cup. https://t.co/TYwsGwwVMZ",
  "data/tweet-nytimes/2021/7/1412992374398193664.json": "You would not believe your eyes if ten million fireflies lit up the world and blinked in sync. https://t.co/SXPQO4kY0R",
  "data/tweet-nytimes/2021/7/1413094263987003400.json": "There's a huge digital cat on a billboard in Tokyo. 🏙🐱🏙\n\nIt says “nyannichiwa” to passers-by, a blend of “konnichiwa,” or hello, and “nyan,” Japanese for “meow.” https://t.co/YzDyaLTIfw",
  "data/tweet-nytimes/2021/7/1413114412915953664.json": "Chicago is a city built for a different time. The time before climate change.\nhttps://t.co/VqxrZy0eAv",
  "data/tweet-nytimes/2021/7/1412879138478768131.json": "Pornography literacy classes are supposed to teach students how to critically assess what they see on the screen. But when a sex-positive educator taught her curriculum at two elite New York City schools recently, some parents were outraged.\nhttps://t.co/dny3bghY05",
  "data/tweet-nytimes/2021/7/1413167259988774915.json": "A digital calico cat the size of a yacht is melting hearts in Tokyo. Visitors are only treated to a few brief appearances per hour and it behaves like an actual cat — in the sense that it does whatever it pleases. https://t.co/qx4Ms4ujLE https://t.co/dEoRXGS84l",
  "data/tweet-nytimes/2021/7/1413157524073852931.json": "Breaking News: The Delta variant can sidestep the body’s immune defenses, scientists confirmed, but the fully vaccinated are still protected. https://t.co/dntJy3cbtw",
  "data/tweet-nytimes/2021/7/1413176327327387651.json": "A digital cat is melting hearts (and napping a lot) in Japan https://t.co/66PsUjcsaw",
  "data/tweet-nytimes/2021/7/1413151562965291010.json": "Chicago is a city built for a different time. The time before climate change. https://t.co/2ppfT9o93B",
  "data/tweet-nytimes/2021/7/1413178586144681984.json": "The Lincoln Project, a group focused on antagonizing Donald Trump during his re-election bid, is targeting corporations linked to Republicans who disputed the 2020 presidential vote and played down the attack on the U.S. Capitol on Jan. 6. https://t.co/ZgrFDRgJln",
  "data/tweet-nytimes/2021/7/1412954109792210945.json": "Breaking News: Four people suspected in the assassination of Haiti's president were killed by the police and two others were arrested, the country's police chief said. https://t.co/dfRuAKZ84i",
  "data/tweet-nytimes/2021/7/1413323650099556357.json": "Zaila Avant-garde became the first Black American student to win the Scripps National Spelling Bee. The winning word was “murraya.” https://t.co/rxwsPlfzeG https://t.co/YQPAuvg9TP",
  "data/tweet-nytimes/2021/7/1413294346938486785.json": "Zaila Avant-garde, a #SpellingBee finalist, has also set three Guinness world records:\n— The most basketballs dribbled simultaneously\n— The most basketballs bounces\n— The most bounce juggles in one minute \nhttps://t.co/ediS9Aj4nU",
  "data/tweet-nytimes/2021/7/1413344695581913095.json": "Pfizer and BioNTech said that they were developing a version of the coronavirus vaccine that targets Delta, a highly contagious variant. The companies also reported promising results from studies of people who received a third dose of the original vaccine. https://t.co/yBb7cpJsS9",
  "data/tweet-nytimes/2021/7/1413316417387180032.json": "Zaila Avant-garde correctly spelled “murraya” to win the 2021 Scripps National #SpellingBee. https://t.co/bMDP6PYz2p",
  "data/tweet-nytimes/2021/7/1413269187104026627.json": "The Scripps National #SpellingBee has become a source of pride within the South Asian American immigrant community: Since 2008, a South Asian American child has been a champion at every bee. https://t.co/QH8rkhIc3T",
  "data/tweet-nytimes/2021/7/1413430254236889090.json": "Zaila Avant-garde became the first Black American to win the Scripps National Spelling Bee.\n\nThe win adds to the 14-year-old’s list of accomplishments, which already includes three Guinness world records for dribbling, bouncing and juggling basketballs.\nhttps://t.co/yLOUCTLSnZ",
  "data/tweet-nytimes/2021/7/1413464242351575042.json": "Zaila Avant-garde became the first Black American student to win the Scripps National Spelling Bee. The winning word was “murraya.” https://t.co/oY54ylKbie https://t.co/kcVfv1KDJw",
  "data/tweet-nytimes/2021/7/1413494443370442753.json": "“M-U-R-R-A-Y-A.”\n\nWatch the moment Zaila Avant-garde, a 14-year-old from Louisiana, won the Scripps National Spelling Bee, becoming the first Black American to take the top spot in almost a century of contests. 🐝\nhttps://t.co/AZLqyIsnbu https://t.co/jTHuGf17rv",
  "data/tweet-nytimes/2021/7/1413475579903414274.json": "Zaila Avant-garde became the first Black American to win the Scripps National Spelling Bee.\n\nThe win adds to the 14-year-old’s list of accomplishments, which already includes three Guinness world records for dribbling, bouncing and juggling basketballs.\nhttps://t.co/nlgoaSfCdM",
  "data/tweet-nytimes/2021/7/1413471765641060354.json": "A new abortion law in Texas effectively deputizes citizens to enforce it — a legal innovation with broad implications for America’s courts.\n\nPeople may soon be able to sue abortion clinics, doctors and anyone helping a woman get the procedure in the state.\nhttps://t.co/t1EYSBTtZ4",
  "data/tweet-nytimes/2021/7/1413485603837161473.json": "The world’s top economic leaders are meeting to finalize a plan to put an end to tax havens and force corporations to pay tax wherever they operate.\n\nThe deal would be the biggest overhaul of the international tax system in a century.\nhttps://t.co/4gZxImD47Z",
  "data/tweet-nytimes/2021/7/1413537193386291210.json": "Zalia Avant-garde, 14, had already set three Guinness world records (dribbling, bouncing and juggling basketballs) by the time she spelled “murraya” on Thursday to clinch the Scripps National Spelling Bee title and become the first Black American winner. https://t.co/bqQwJulxsW https://t.co/U4Fj7VOOqo",
  "data/tweet-nytimes/2021/7/1413574198442737693.json": "Waist-deep water in the subway and flooded highways: Here’s how heavy rains affected New York City — and more severe weather is on the way as Tropical Storm Elsa made its way up the Northeast coast. https://t.co/mjOD38zLsa https://t.co/mFewfkdlIh",
  "data/tweet-nytimes/2021/7/1413579232949719044.json": "Zaila Avant-garde, 14, had already set three Guinness world records (dribbling, bouncing and juggling basketballs) by the time she spelled “murraya” on Thursday to clinch the Scripps National Spelling Bee title and become the first Black American winner. https://t.co/fuS58pKOxM https://t.co/aznBTI6fs8",
  "data/tweet-nytimes/2021/7/1413561094329839625.json": "The recent heatwave in the Western U.S. and Canada killed hundreds of millions of marine animals, scientists say. Dead mussels and clams coated rocks in the Pacific Northwest, shells gaping open as if they’d been boiled. Sea stars baked to death. https://t.co/bugFNV81ji",
  "data/tweet-nytimes/2021/7/1413571210303127553.json": "Haitian officials said they had requested that the U.S. send in troops to protect Haiti’s port, airport, gasoline reserves and other infrastructure. The nation has descended into turmoil in the wake of the assassination of President Jovenel Moïse. https://t.co/ejN8szTfDm",
  "data/tweet-nytimes/2021/7/1413649195463061505.json": "Waist-deep water in the subway and flooded highways: Here’s how heavy rains affected New York City on Thursday ahead of Tropical Storm Elsa's arrival.\nhttps://t.co/QcFBTLxu3f https://t.co/s0HUPv0kxl",
  "data/tweet-nytimes/2021/7/1413634077417222144.json": "President Biden fired the head of the Social Security Administration, Andrew Saul, who was a holdover from the Trump administration. https://t.co/vjVmzSWU2U",
  "data/tweet-nytimes/2021/7/1413455276963819529.json": "Breaking News: The IMF said it planned to issue $650 billion in reserve funds, creating money for poor countries to pay for vaccines, health care and debt.\nhttps://t.co/CFdJgE3HF5",
  "data/tweet-nytimes/2021/7/1413490679989350400.json": "Nights are warming faster than days across most of the U.S., with potentially deadly consequences.\n\nHere’s why rising overnight temperatures, fueled by climate change, can be so dangerous.\nhttps://t.co/iaDl2cGXcW",
  "data/tweet-nytimes/2021/7/1413724704775475201.json": "Californians have been asked to set their thermostats at 78 degrees or higher and cut water consumption by 15% as the West braces for another extreme heat wave this weekend. https://t.co/vaN6flV1fO",
  "data/tweet-nytimes/2021/7/1413739800931221507.json": "The Entomological Society of America said Wednesday that it was removing “gypsy moth” and “gypsy ant” as common names for two insects because the term is a slur used against Romani people. The news was a welcome surprise to many in the scientific community.https://t.co/uLpRosOtef",
  "data/tweet-nytimes/2021/7/1413694520903012354.json": "President Biden fired the head of the Social Security Administration, Andrew Saul, who was a holdover from the Trump administration. https://t.co/uo7eROjU2q",
  "data/tweet-nytimes/2021/7/1413865558337015812.json": "Breaking News: Charlottesville, Va., removed a statue of Robert E. Lee four years after it became the focal point of a deadly white nationalist rally. https://t.co/igJweRaSuP",
  "data/tweet-nytimes/2021/7/1413855550245330947.json": "Storms flooded New York City's subways on Thursday, stranding commuters and highlighting just how vulnerable the transit system is to heavy rain. And it's only going to get worse. https://t.co/Eg0gZkpn6X",
  "data/tweet-nytimes/2021/7/1413895825000964098.json": "Hospitals in a hot spot in Missouri are short on ventilators as the Delta variant spreads, with severe cases chiefly among the unvaccinated. https://t.co/aV6zcsLjg3",
  "data/tweet-nytimes/2021/7/1413881964600381444.json": "Ashleigh Barty won the Wimbledon women's singles title. She is the first Australian woman to do so since Evonne Goolagong Cawley won in 1980. https://t.co/ALU1Cm0A6s",
  "data/tweet-nytimes/2021/7/1413956215265271808.json": "At this former dairy farm, the cows don’t have to produce milk, the pigs sleep late and no animal serves a human need — other than helping us rethink how we eat. https://t.co/4SQKwwK2Ki",
  "data/tweet-nytimes/2021/7/1413961233712173060.json": "Last month was the hottest June on record in North America. 1,200 daytime records were broken in the final week.\n\nBut there was an even greater number of daily records set by a different — and maybe more dangerous — measure: overnight temperatures. https://t.co/KJhv5KeZ7L",
  "data/tweet-nytimes/2021/7/1413986399133523969.json": "Saturday’s Copa América final against Brazil is another chance to deliver the title that Messi and Argentina have chased for a generation. https://t.co/gYO89DjEjd",
  "data/tweet-nytimes/2021/7/1414050558659420160.json": "Lionel Messi finally won a major title with his national team after years of agonizing failures as Argentina beat Brazil to win the Copa América. https://t.co/fZzjgjNjis",
  "data/tweet-nytimes/2021/7/1414078875848658947.json": "Nigeria upset a Team U.S.A. team stacked with N.B.A. stars, becoming the first African team to beat the U.S. men’s national team.\nhttps://t.co/PL5QpqRLwk",
  "data/tweet-nytimes/2021/7/1414215412531834880.json": "Lionel Messi finally ticked the last empty box in his soccer career on Saturday night, leading Argentina past Brazil, 1-0, in the final of the Copa América. https://t.co/eJPffY3C9N",
  "data/tweet-nytimes/2021/7/1413972627685875718.json": "A 62-year-old Texas man who waited hours into the night to cast his ballot in the 2020 presidential primary was arrested this week on charges of illegal voting. https://t.co/AQPvRDp6B2",
  "data/tweet-nytimes/2021/7/1414264206656954377.json": "Breaking News: Novak Djokovic won his 20th Grand Slam title after defeating Matteo Berrettini in a Wimbledon final, tying him with Roger Federer and Rafael Nadal. https://t.co/q2lN8i27u0",
  "data/tweet-nytimes/2021/7/1414112222457077765.json": "A tiny Leonardo da Vinci sketch the size of a Post-it note sold for about $12.2 million on Thursday.\n\nThe delicate silverpoint study “Head of a Bear\" is thought to date from the early 1480s. https://t.co/GugtyUJiBq",
  "data/tweet-nytimes/2021/7/1414293433875902467.json": "Cleansing your timeline with David Harbour and his four-month-old puppy. https://t.co/SjwaU7IzM2 https://t.co/e7QK7xrXor",
  "data/tweet-nytimes/2021/7/1414288412371308544.json": "It’s never too late: Vijaya Srivastava took her first swimming lesson at age 68. She’s now a daily swimmer. https://t.co/1kxENu1DxC https://t.co/237EymFYJP",
  "data/tweet-nytimes/2021/7/1414253189440868357.json": "Before Zaila Avant-garde became the first Black American to win the Scripps National Spelling Bee, other Black students faced decades of discrimination and doubts about their abilities. https://t.co/hRcDgKpe7H",
  "data/tweet-nytimes/2021/7/1414343068040507402.json": "Breaking News: Italy rallied to beat England and win #Euro2020, dashing English hopes for their first major title since the 1966 World Cup. https://t.co/dPspUeRzpn",
  "data/tweet-nytimes/2021/7/1414338725207752708.json": "Shouting “Freedom” and other anti-government slogans, hundreds of Cubans took to the streets in cities around the country on Sunday to protest food and medicine shortages, in a remarkable eruption of discontent not seen in nearly 30 years. https://t.co/BbqQPLrNiE",
  "data/tweet-nytimes/2021/7/1414285882853634059.json": "Richard Branson of Virgin Galactic's successful trip to the edge of space is the first stride made amongst billionaire entrepreneurs seeking to make an industry out of space tourism. https://t.co/dlumGPBKsk",
  "data/tweet-nytimes/2021/7/1414313598525005838.json": "Covid-19 breathalyzers are real. They could change everything about how we test for diseases. https://t.co/feP9hgHOMC",
  "data/tweet-nytimes/2021/7/1413689453994983428.json": "Patricia Marroquin Norby is the Met's first Native American curator and its first curator of Native American art. The museum has her to thank for a bold Land and Water Statement in the American wing laying out the museum's intention of honoring Native art. https://t.co/Rq5OuF5XEe",
  "data/tweet-nytimes/2021/7/1414393333833682954.json": "\"The stadium, after all that noise, after all those songs, after all those dreams, stood silent, dumbstruck, and stared straight back,\" @RorySmith writes after England lost to Italy in the #Euro2020 final. https://t.co/3ScVR9ypF2 https://t.co/zpEER8AQ43",
  "data/tweet-nytimes/2021/7/1414077005218320384.json": "Sea otters run hot. It’s not just a manner of speaking: Scientists have found that the furry mammals’ metabolisms work at a rate three times what might normally be expected from a creature their size, burning swiftly through calories. https://t.co/Bfju8rkgxv",
  "data/tweet-nytimes/2021/7/1414263237495988225.json": "Pope Francis greeted the faithful from a balcony at Gemelli hospital in Rome on Sunday, his first public appearance since undergoing colon surgery last week. https://t.co/YBfYgFc2wb https://t.co/Isr10LgoI5",
  "data/tweet-nytimes/2021/7/1414224249577951240.json": "Richard Branson, the 70-year-old British billionaire and founder of Virgin Galactic, is going to space today as part of a bid to make commercial spaceflight a reality. Follow along live: https://t.co/urL2u5CCs9",
  "data/tweet-nytimes/2021/7/1414400383540207617.json": "Italian fans took to the streets to celebrate Italy’s win in the #Euro2020 final over England. For many, the win seemed to symbolize renewal after adversity. https://t.co/yrM34tX120",
  "data/tweet-nytimes/2021/7/1414280887127134218.json": "New York Times journalists went behind the front lines in Ethiopia as a scrappy force of guerrilla fighters overcame one of Africa's strongest armies. https://t.co/GB2tVYzDk2",
  "data/tweet-nytimes/2021/7/1414132394546933760.json": "Starved for PDA, some are taking New York’s reopening as a cue to start “swallowing each other’s faces.” https://t.co/0opih3dng1",
  "data/tweet-nytimes/2021/7/1414509879688060929.json": "Italian fans took to the streets to celebrate Italy’s win in the #Euro2020 final over England. For many, the win seemed to symbolize renewal after adversity. https://t.co/gxAwZtqSa6 https://t.co/fiHelgtYVb",
  "data/tweet-nytimes/2021/7/1414471952081768450.json": "Mathew Rosengart, a prominent lawyer, has had discussions with Britney Spears about representing her in her conservatorship battle. He plans to attend a hearing to begin the process of taking over as her counsel, a person briefed on the matter said. https://t.co/qcnZP6tTU9",
  "data/tweet-nytimes/2021/7/1414465742515445763.json": "Since China introduced its sweeping national security law in Hong Kong, tens of thousands of people have made plans to leave the city and start new lives elsewhere. \n\n“Nothing is as difficult as staying in a city that is lacking freedom,” one woman said. https://t.co/m8NJ3VquBj",
  "data/tweet-nytimes/2021/7/1414545090811514892.json": "Three players on England’s soccer team who missed penalty kicks in the Euro 2020 final became the target of racist attacks on social media.\n\nLondon’s Metropolitan Police said it would investigate the bigotry, which Prime Minister Boris Johnson condemned. https://t.co/I3MvLbccmu",
  "data/tweet-nytimes/2021/7/1414565226071085056.json": "Malta will ban visitors over the age of 12 unless they’re fully vaccinated against the coronavirus. It is the first EU country to impose such restrictions as the island sees an increase in cases amid the Delta variant’s spread. https://t.co/vkSBLrMf1W",
  "data/tweet-nytimes/2021/7/1414524959876071425.json": "The Bootleg fire in Oregon is burning out of control as the West endures its third heat wave this summer. The blaze has scorched more than 143,000 acres, threatening a major power grid. https://t.co/9iAwvLrxWY",
  "data/tweet-nytimes/2021/7/1414278339645386753.json": "Millions of British fans will be watching the Euro 2020 final, basking not just in the team’s success on the field, but as a microcosm of a nation seemingly enthusiastic about its evolving identity as a more tolerant, multiracial, and multi-ethnic society. https://t.co/JrcLx2JhFH",
  "data/tweet-nytimes/2021/7/1414619734084145162.json": "Breaking News: Thousands of Cubans on Sunday protested power outages, food shortages and a lack of medicine — an astonishing act of defiance against a government known for quashing dissent. President Biden called the protests a \"clarion call for freedom.\" https://t.co/GpjTBga9y7 https://t.co/DUAE6WeFuS",
  "data/tweet-nytimes/2021/7/1414550121795162112.json": "Shouting “Freedom” and other anti-government slogans, hundreds of Cubans took to the streets in cities around the country on Sunday to protest food and medicine shortages, in a remarkable eruption of discontent not seen in nearly 30 years. https://t.co/iJnMDGQUwQ",
  "data/tweet-nytimes/2021/7/1414631630803816450.json": "Breaking News: Texas Democrats are making plans to flee the state on chartered flights to Washington, D.C., a dramatic attempt to block a sweeping Republican bill to restrict voting. It's unclear if enough will join to prevent the bill from moving forward. https://t.co/9bTdtaBwnn",
  "data/tweet-nytimes/2021/7/1414647737577086979.json": "Breaking News: The FDA is planning to warn that the Johnson &amp; Johnson coronavirus vaccine can increase the risk of a rare nerve condition known as Guillain-Barré syndrome. https://t.co/HP3GFKFzsG",
  "data/tweet-nytimes/2021/7/1414686016355581956.json": "Protests over the imprisonment of the former South African president Jacob Zuma have escalated into looting and other destructive lawlessness. Some analysts and activists said the uprising was born of deeper issues of poverty and lack of opportunity. https://t.co/p0r51WJ7Tl https://t.co/YBGrImtSOo",
  "data/tweet-nytimes/2021/7/1414678458966364160.json": "The Biden administration will begin sending up to $300 a month per child to most American families in the coming days, intensifying a debate over whether to make the subsidies permanent. The payments will cut child poverty by nearly half, experts estimate. https://t.co/mw2nt4FiSk",
  "data/tweet-nytimes/2021/7/1414615580666122243.json": "The three England soccer players who failed to convert their penalty kicks in the Euro 2020 final shootout — Marcus Rashford, Jadon Sancho and Bukayo Saka — are among the youngest members of a youthful and diverse team that swept to the tournament final. https://t.co/zCgZZwbJVk https://t.co/0hbJAEbzNr",
  "data/tweet-nytimes/2021/7/1414683989277880324.json": "Breaking News: A group of Texas Democrats fled the state in an effort to block a GOP-backed voting law. More than 50 Democrats signed on, an official involved said, enough to prevent Republicans from attaining the quorum needed to conduct business. https://t.co/iPjADFdXK7",
  "data/tweet-nytimes/2021/7/1414547623382589443.json": "Fox News hosts have repeatedly blasted President Biden’s Covid vaccine plan, even as areas with comparatively low inoculation rates face outbreaks. https://t.co/69Ug3Wzbm1",
  "data/tweet-nytimes/2021/7/1414739862926811144.json": "Allen Weisselberg was removed from his leadership roles at dozens of Trump Organization subsidiaries after being indicted by New York prosecutors. https://t.co/4752IMJJaS",
  "data/tweet-nytimes/2021/7/1414766603586134024.json": "Henry Parham, a solider in the only all-Black combat unit to land on the beaches of Normandy on D-Day, has died. He was 99. https://t.co/r2e4mmzfu2",
  "data/tweet-nytimes/2021/7/1414625641673134080.json": "The U.S. Capitol Police is badly damaged, demoralized and depleted six months after the attack by a violent mob. More than 70 officers have retired or resigned since the Jan. 6 riot, which cost the lives of two members of the force. https://t.co/LLZeZHZppY",
  "data/tweet-nytimes/2021/7/1414801793641504773.json": "President Emmanuel Macron of France announced new vaccination requirements, including mandatory inoculation for health care workers and proof of immunization or a recent negative test to enter restaurants and cultural venues. https://t.co/MNNzf9qvfl",
  "data/tweet-nytimes/2021/7/1414647518667984897.json": "Government officials in South Africa deployed the military on Monday to confront violent unrest after protests over the imprisonment of Jacob Zuma devolved into looting and other destructive lawlessness fed in part by poverty and scant opportunity. https://t.co/2hh1dxzat3",
  "data/tweet-nytimes/2021/7/1414862430191116288.json": "President Emmanuel Macron of France announced new vaccination requirements, including mandatory inoculation for health care workers and proof of immunization or a recent negative test to enter restaurants and cultural venues. https://t.co/p5j03UEypB",
  "data/tweet-nytimes/2021/7/1414889878547050509.json": "The Biden administration will begin sending up to $300 a month per child to most American families in the coming days, intensifying a debate over whether to make the subsidies permanent. The payments will cut child poverty by nearly half, experts estimate. https://t.co/F4xS7JJn1S",
  "data/tweet-nytimes/2021/7/1414931535002750977.json": "A surge in Covid shot appointments in France followed an announcement of new vaccination requirements, including mandatory inoculation for health care workers and proof of immunization or a negative test to enter restaurants and cultural venues. https://t.co/fBDZyS2t4S",
  "data/tweet-nytimes/2021/7/1414970818543620097.json": "Fans quickly repaired a mural of Marcus Rashford, a Black player on England’s soccer team who played in the Euro 2020 final, after it was defaced with racist remarks. https://t.co/BD3CkhFAok https://t.co/N49eye8Nsv",
  "data/tweet-nytimes/2021/7/1415008407711518720.json": "Mj Rodriguez became the first transgender person to land an #Emmys nomination in a lead acting category. \n\nShe was nominated for best actress in a drama for the final season of “Pose.” https://t.co/EqrnrXzcfe https://t.co/KvlbBitbok",
  "data/tweet-nytimes/2021/7/1414996519577608193.json": "Breaking News: Russia’s most aggressive ransomware group, blamed for multiple attacks on the U.S., suddenly went offline. Who made that happen is a mystery. https://t.co/6E7lgjcpn3",
  "data/tweet-nytimes/2021/7/1414883560348168217.json": "A graphic Covid-19 ad in Australia is facing a backlash. Critics say the video, which shows a young woman with severe symptoms, unfairly blames younger people, most of whom are ineligible for vaccination amid the country’s slow rollout. https://t.co/tvKPUUemAA",
  "data/tweet-nytimes/2021/7/1415029533850357760.json": "Jean Smart became a double nominee at the #Emmys:\nBest actress in a comedy series for \"Hacks\"\nBest supporting actress in a limited series for “Mare of Easttown”\nhttps://t.co/b2tAeoYorn https://t.co/hUoNGoMLhW",
  "data/tweet-nytimes/2021/7/1415042107102875658.json": "Kate Winslet has won plenty of awards in her acting career, but “I honestly don’t think I’ve ever been so excited about a nomination,” she said of her Emmy nod for “Mare of Easttown.” https://t.co/2aKfQaDMPq",
  "data/tweet-nytimes/2021/7/1414922585842798632.json": "“Landslide” by Michael Wolff tells the dramatic and unprecedented story of the weeks after the 2020 presidential election from inside the White House. Here's Nicholas Lemann's review. https://t.co/ALLtOlyF4t",
  "data/tweet-nytimes/2021/7/1415066015701028864.json": "Almost an entire family from Texas — a father, mother, and three of their kids — were charged on Tuesday with breaching the Capitol on Jan. 6. “We were in capital!!…I do mean IN the building!!” Dawn Munn wrote in a Facebook message obtained by the FBI. https://t.co/zt3quio2TN",
  "data/tweet-nytimes/2021/7/1415061456018624513.json": "A mural of Marcus Rashford was vandalized with racist slurs after England lost Euro 2020. Within hours, fans filled it with messages of support. Israel, an 8-year-old Black boy from Manchester, where Rashford grew up, told him: \"I'm still proud of you.\" https://t.co/wtkLXJ7Qv6",
  "data/tweet-nytimes/2021/7/1415106286140731392.json": "The Utah Division of Wildlife Resources said that last week it used planes to stock fish in about 200 lakes that are inaccessible by vehicle. The division said it has aerial-stocked fish since the 1950s and that they have a high survival rate. https://t.co/HP2BEDHezI https://t.co/eV5qC7CRpk",
  "data/tweet-nytimes/2021/7/1415104226179657728.json": "Breaking News: An Iranian-American journalist living in Brooklyn was the target of an international kidnapping plot orchestrated by an Iranian intelligence network, federal prosecutors said. https://t.co/Dnp6s96iMV",
  "data/tweet-nytimes/2021/7/1415140255771004932.json": "Norwegian Cruise Line sued Florida on Tuesday over a state law that would fine businesses up to $5,000 if they force customers to provide proof of vaccination. The company accused the state of preventing it from “safely and soundly” resuming trips. https://t.co/Ua7e5bYS89",
  "data/tweet-nytimes/2021/7/1415024490359230467.json": "Our documentary examining the legal conservatorship that’s controlled Britney Spears’s life for more than a decade, and her struggle to break free, has been nominated for an Emmy. Times subscribers in the U.S. can watch it on our site. https://t.co/elfcU4VCjk",
  "data/tweet-nytimes/2021/7/1415227101435813889.json": "He searched for his kidnapped son for nearly 24 years. He drove across more than 300,000 miles of China by motorbike. He displayed photos of his two-year-old boy.\n\nThis week, Guo Gangtang's search finally ended. https://t.co/LbmYdIL7a6",
  "data/tweet-nytimes/2021/7/1415073576315727874.json": "Chicago is a city built for a different time. The time before climate change. https://t.co/KjDSbMwfSN https://t.co/w7pvUa7KC1",
  "data/tweet-nytimes/2021/7/1415302609695608834.json": "Italy announced plans to bar large cruise ships from entering Venice and declared the city’s lagoon a national monument.\n\nThe ban, demanded for decades by residents and environmentalists, takes effect on Aug. 1. https://t.co/CRXeSCg6Eg",
  "data/tweet-nytimes/2021/7/1415295093851017220.json": "Sen. Chuck Schumer of New York plans to propose legislation on Wednesday to decriminalize marijuana at the federal level.\n\nThe draft bill would remove marijuana from the Controlled Substances Act and begin regulating and taxing it. https://t.co/AEyzKLsoqJ",
  "data/tweet-nytimes/2021/7/1415306370857979911.json": "The Utah Division of Wildlife Resources said that last week it used planes to stock fish in about 200 lakes that are inaccessible by vehicle. The division said it has aerial-stocked fish since the 1950s and that they have a high survival rate. https://t.co/oHWlwAO80K https://t.co/tm1UFSMgM6",
  "data/tweet-nytimes/2021/7/1415282453917454344.json": "A Massachusetts restaurant closed for a “day of kindness” after customers behaved rudely toward its employees. The verbal abuse had worsened since the eatery was allowed to fully reopen.\n\n“I never thought it would become this,” the co-owner said. https://t.co/fRZLALEwnS",
  "data/tweet-nytimes/2021/7/1415264869482385410.json": "Even after 24 years of searching, Guo Gangtang never gave up hope that he would find his kidnapped son.\n\nThis week, they were reunited. https://t.co/vHWpaN6s1a https://t.co/9gk1vcSSuE",
  "data/tweet-nytimes/2021/7/1415071062027558912.json": "The UN plans to form a panel to investigate systemic racism in policing against people of African descent, adding international weight to demands in the U.S. for accountability for police killings of African Americans, and reparations for victims. https://t.co/3nRXBachpP",
  "data/tweet-nytimes/2021/7/1415334329866244104.json": "Breaking News: Parts of the Amazon are now emitting more carbon dioxide than they absorb, reducing the forest’s ability to be a buffer for climate change, a new study found. Deforestation and global warming have contributed to the change. https://t.co/bzj2E1Y5CW",
  "data/tweet-nytimes/2021/7/1415011910936891397.json": "Tennessee’s top immunization official said she was fired from her job after writing a memo describing a State Supreme Court ruling from 1987 that suggested that some teenagers might be allowed to get vaccines without their parents’ permission. https://t.co/15BfDowU86",
  "data/tweet-nytimes/2021/7/1415336560560590855.json": "Breaking News: Parts of the Amazon are now emitting more carbon dioxide than they absorb, reducing the forest’s ability to be a buffer for climate change, a new study found. \n\n\"This is a negative loop,\" said an author of the paper. https://t.co/O6LiBaxdIi https://t.co/plQ1BQGmhr",
  "data/tweet-nytimes/2021/7/1415196629146144779.json": "European officials are preparing to introduce legislation to phase out fossil fuels far more quickly than other economies have pledged to do. https://t.co/9LtjjtgYJr",
  "data/tweet-nytimes/2021/7/1415412040684998662.json": "Breaking News: The FBI failed to respond quickly to accusations of sexual abuse against the former USA Gymnastics doctor Larry Nassar, allowing him to abuse dozens of more victims, a federal report said. https://t.co/7851jvlrX1",
  "data/tweet-nytimes/2021/7/1415375382765768704.json": "Indonesia reported more than 54,500 coronavirus cases on Wednesday. “Based on the last three days' data, I can say clearly that Indonesia has become the new epicenter in the world,” said an epidemiologist. https://t.co/FPMslPJ1Pa",
  "data/tweet-nytimes/2021/7/1415428474429394947.json": "Britney Spears can hire her own lawyer, a Los Angeles judge said on Wednesday. The decision comes three weeks after the singer denounced the conservatorship that has long controlled her life in an impassioned courtroom speech. https://t.co/MbXjw7ifDu",
  "data/tweet-nytimes/2021/7/1415393349893242881.json": "Olivia Rodrigo visited the White House on Wednesday, joining the Biden administration’s ongoing efforts to use the young and famous to reach the young and unvaccinated. https://t.co/ViO82A9KYv",
  "data/tweet-nytimes/2021/7/1415432193925685248.json": "Olivia Rodrigo, the 18-year-old pop star with the No. 1 album in the country, visited the White House on Wednesday and joined the Biden administration’s efforts to use the young and influential to reach the young and unvaccinated. https://t.co/Fbcshrz6Vd https://t.co/ReI5DuC8dD",
  "data/tweet-nytimes/2021/7/1415446055341154309.json": "Olivia Rodrigo, the 18-year-old pop star with the No. 1 album in the country, visited the White House to encourage the young and unvaccinated to get their shots. The singer has millions of followers on social media who hang on her every word. https://t.co/DuBcsF2nqy",
  "data/tweet-nytimes/2021/7/1415457345031786500.json": "Britney Spears won permission Wednesday to hire her own lawyer to represent her as she fights to end the 13-year conservatorship that has governed her life. Last month, Spears called the arrangement abusive and told the court that she wanted it to end. https://t.co/mTEAKsG3Cn",
  "data/tweet-nytimes/2021/7/1415453610998173700.json": "As the Delta coronavirus variant rips through conservative areas, Republicans are slowly starting to publicly condemn vaccine hesitancy and misinformation. \"The politicization of vaccination is an outrage and frankly moronic,” said Senator Mitt Romney. https://t.co/9NKat6JUaG",
  "data/tweet-nytimes/2021/7/1415389443561766914.json": "The number of extremely hot days is rising around the world. See how your hometown has changed since your birth — and how much hotter it may get. https://t.co/vXNuYn12So",
  "data/tweet-nytimes/2021/7/1415405760046112769.json": "Responding to a surge of Delta variant cases, President Emmanuel Macron stopped short of mandating vaccines in France, but made it clear that unvaccinated people's lives would quickly become miserable, with potential restrictions on travel and dining. https://t.co/YXh8VFyrBZ",
  "data/tweet-nytimes/2021/7/1415396952485896199.json": "Coca-Cola changed the flavor of its soda in 1985 and enraged a nation. Now, the company is doing it again, risking another outcry. https://t.co/tRoVsUG2hH",
  "data/tweet-nytimes/2021/7/1415274909421514753.json": "A mural of Marcus Rashford was vandalized with racist slurs after England lost Euro 2020. Within hours, fans filled it with messages of support. Israel, an 8-year-old Black boy from Manchester, where Rashford grew up, told him: \"I'm still proud of you.\" https://t.co/N41cX0mfgy https://t.co/f15MIqq6rv",
  "data/tweet-nytimes/2021/7/1415448309511110656.json": "Breaking News: Top Democrats agreed to include a tax on imports from nations that lack aggressive climate change policies as part of their $3.5 trillion budget plan. https://t.co/a6yG65mlYE",
  "data/tweet-nytimes/2021/7/1415420894793457664.json": "Sen. Chuck Schumer of New York proposed ambitious legislation on Wednesday to decriminalize marijuana at the federal level, putting his weight as majority leader behind a growing movement to unwind the decades-old war on drugs. https://t.co/RnoCadwdfN https://t.co/TTaEuOFbii",
  "data/tweet-nytimes/2021/7/1415486464213884932.json": "Johnson &amp; Johnson issued a voluntary recall on Wednesday for five of its sunscreen sprays after testing found low levels of benzene, a carcinogen, in the products. Consumers were told to stop using the products and throw them out. https://t.co/T7ZW3XS7HP",
  "data/tweet-nytimes/2021/7/1415503634205483008.json": "The cost of medical treatment for survivors of gun injuries in the U.S. amounts to at least $1 billion each year, but is likely much higher, according to a federal watchdog. https://t.co/L3aZ2ec1i4",
  "data/tweet-nytimes/2021/7/1415488811866468353.json": "After backlash, a ban on a swim cap designed for Black hair is being reconsidered ahead of the Summer Olympic Games in Tokyo. “This is so much bigger than banning a type of cap,” said Lia Neal, a two-time Olympic medalist. https://t.co/0KBxbDjS5K",
  "data/tweet-nytimes/2021/7/1415562429132644355.json": "The Biden administration is expected to announce that it will restore protections to Tongass National Forest in Alaska, one of the world’s largest intact temperate rain forests. Former President Donald Trump had previously stripped away the protections. https://t.co/G8nCupVS3p",
  "data/tweet-nytimes/2021/7/1415647348546539526.json": "The Biden administration is expected to announce that it will restore protections to Tongass National Forest in Alaska, one of the world’s largest intact temperate rain forests. Former President Donald Trump had previously stripped away the protections. https://t.co/FP1PgUZ2QJ",
  "data/tweet-nytimes/2021/7/1415624697811767296.json": "A 55-year-old man has been hospitalized in China after contracting the H5N6 strain of avian flu. Chinese state news media said that the risk of large-scale transmission was low. https://t.co/l844JijHDN",
  "data/tweet-nytimes/2021/7/1415612134810062849.json": "Next week, for the first time on a broadcast, fans of Major League Baseball can watch a game in which they might not hear a man’s voice.\n\nThe Baltimore Orioles versus the Tampa Bay Rays will be called entirely by women. https://t.co/8gPVyOYrGF",
  "data/tweet-nytimes/2021/7/1415661215054012417.json": "As the Delta coronavirus variant rips through conservative areas, Republicans are slowly starting to publicly condemn vaccine hesitancy and misinformation. \"The politicization of vaccination is an outrage and frankly moronic,” said Senator Mitt Romney. https://t.co/yFMMRkUbO1",
  "data/tweet-nytimes/2021/7/1415672582053842951.json": "Next week, for the first time on a broadcast, fans of Major League Baseball can watch a game in which they might not hear a man’s voice.\n\nThe Baltimore Orioles versus the Tampa Bay Rays will be called entirely by women. https://t.co/lVfqTu4agN",
  "data/tweet-nytimes/2021/7/1415653651935281155.json": "Johnson &amp; Johnson issued a voluntary recall on Wednesday for five of its sunscreen sprays after testing found low levels of benzene, a carcinogen, in the products. Consumers were told to stop using the products and throw them out. https://t.co/OzKCfPtxaF",
  "data/tweet-nytimes/2021/7/1415682142462373889.json": "Breaking News: At least 40 people are dead in Germany and Belgium after violent storms sent water surging from rivers and sewage systems into streets and homes. https://t.co/ubmqrTVw3U",
  "data/tweet-nytimes/2021/7/1415725393483603968.json": "Olivia Rodrigo, the 18-year-old pop star with the No. 1 album in the country, visited the White House on Wednesday to encourage the young and unvaccinated to get their shots. The singer has millions of followers on social media who hang on her every word. https://t.co/5BeexQbPjr",
  "data/tweet-nytimes/2021/7/1415702723916410885.json": "A homeopathic doctor in California is the first person to face federal charges for selling fake Covid vaccination cards, the authorities said. She faces up to 20 years in prison and hundreds of thousands of dollars in fines. https://t.co/IM1WuRSkKt",
  "data/tweet-nytimes/2021/7/1415767004297023492.json": "A Dutch 18-year-old would become the youngest person ever to go to space on Jeff Bezos' Blue Origin rocket launch scheduled for Tuesday. Oliver Daemen takes the spot of another passenger who paid $28 million for the seat but had a scheduling conflict. https://t.co/SPvWMEGdH0",
  "data/tweet-nytimes/2021/7/1415789845130223619.json": "Los Angeles County will require masks to be worn indoors regardless of vaccination status, officials said, as the highly contagious Delta variant spreads throughout California. The mandate will begin Saturday night, just before midnight.\nhttps://t.co/7QP10O2eZd",
  "data/tweet-nytimes/2021/7/1415418343536922628.json": "He has been unable to speak since he was paralyzed in 2003. Now, in a once unimagined accomplishment, an implant in the speech area of his brain is starting to give him back a voice. \"It's very much like getting a second chance to talk again.\" https://t.co/DM7IfgmIkW",
  "data/tweet-nytimes/2021/7/1415755593369985029.json": "Hundreds of thousands of white flags will be planted along the National Mall in Washington for two weeks in September to memorialize the more than 600,000 people who have died from Covid-19 in the U.S. https://t.co/I00jV3T4eE",
  "data/tweet-nytimes/2021/7/1415863780530135041.json": "A homeopathic doctor in California is the first person to face federal charges for selling fake Covid vaccination cards, the authorities said. She faces up to 20 years in prison and hundreds of thousands of dollars in fines. https://t.co/dqPoPycIdj",
  "data/tweet-nytimes/2021/7/1415812934492639235.json": "Breaking News: There were 1,300 people unaccounted for after flooding in Germany led to frantic rescue efforts, authorities said. https://t.co/6e66XX4Lv9",
  "data/tweet-nytimes/2021/7/1415400760674766851.json": "The spread of the Delta variant will set vaccinated and unvaccinated communities in the U.S. on very different paths, data from around the world suggests. https://t.co/46ePsv3p6A",
  "data/tweet-nytimes/2021/7/1415756839237586957.json": "Breaking News: A jury found the gunman who killed 5 people in an Annapolis, Maryland, newsroom in 2019 criminally responsible. He will spend the rest of his life in prison. https://t.co/zpJDNHTxcr",
  "data/tweet-nytimes/2021/7/1415853750309228559.json": "The chairwoman of the Congressional Black Caucus, Rep. Joyce Beatty, was arrested on Thursday on Capitol Hill along with eight activists who were demonstrating for voting rights.\nhttps://t.co/BF5DRMVRKZ",
  "data/tweet-nytimes/2021/7/1415935001254846465.json": "Esther Bejarano, an Auschwitz survivor, played the accordion in the camp's orchestra. Decades later, she spoke out against fascism and racism, using music as well as words. She died on Saturday at 96. https://t.co/H6eNVKTOXS",
  "data/tweet-nytimes/2021/7/1415876370471825410.json": "President Biden’s surgeon general used his first formal advisory to deliver a broadside against tech and social media companies, which he accused of not doing enough to stop the spread of dangerous health misinformation — especially about Covid-19. https://t.co/t1YH6PiCoR",
  "data/tweet-nytimes/2021/7/1415989621578780684.json": "A woman has joined a U.S. Navy special warfare unit for the first time. \n\nShe is the first female graduate of a training pipeline that feeds the Navy SEALs and other elite commando units, the Navy said. https://t.co/lhdgLm6UTL",
  "data/tweet-nytimes/2021/7/1416070138542149642.json": "The chairwoman of the Congressional Black Caucus, Rep. Joyce Beatty, was arrested on Thursday on Capitol Hill after demonstrating for voting rights. \n\n“You can arrest me. You can’t stop me. You can’t silence me,” Beatty wrote in a tweet after her arrest. https://t.co/x274RK98SF https://t.co/TyF6jFGJyO",
  "data/tweet-nytimes/2021/7/1416027361288630274.json": "Pope Francis cracked down on the use of the old Latin Mass, putting restrictions on where it can be celebrated and who can celebrate it. The move, a blow to conservative Catholics, is a big step toward putting the liturgy on the side of modernization. https://t.co/Rgf4kCOPPT",
  "data/tweet-nytimes/2021/7/1416095917309050886.json": "Ida B. Wells, an investigative reporter who exposed the systematic lynching of black men in the South, was born 159 years ago today. She was considered the most famous Black woman in the U.S.\n\nHer obituary is part of our Overlooked series.\nhttps://t.co/WD6Vy6WFAV",
  "data/tweet-nytimes/2021/7/1416052529755037699.json": "One of the few issues on which Democrats and Republicans seem to agree: “Free Britney.” https://t.co/w8ONMnros0",
  "data/tweet-nytimes/2021/7/1416098506775928833.json": "Scenes of devastation from the floods came from all around Western Europe as the death toll passed 125 on Friday. Hundreds more people remain missing in Belgium and Germany. \n\nHere’s the latest: https://t.co/NMJzDMiy3q https://t.co/ubgsWoMwrW",
  "data/tweet-nytimes/2021/7/1416062591013642244.json": "Democrats’ $3.5 trillion budget plan will propose expanding the public education system to include free prekindergarten and community college. https://t.co/ailzoVdoge",
  "data/tweet-nytimes/2021/7/1416149486980710401.json": "Breaking News: A federal judge in Texas ruled DACA unlawful, saying that Barack Obama exceeded his authority when he created the program by executive order. The program has shielded hundreds of thousands of undocumented young adults from deportation. https://t.co/fF4TqW8kB1",
  "data/tweet-nytimes/2021/7/1416193462467182593.json": "Biz Markie, the innovative rapper, DJ and producer whose “Just a Friend” became an unlikely hit, died at 57.\nhttps://t.co/j0we0Jf3SJ",
  "data/tweet-nytimes/2021/7/1416014778728857606.json": "Fully vaccinated Americans could be allowed to enter Canada by mid-August, Prime Minister Justin Trudeau said Thursday. Immunized travelers from all countries may be welcome in September. https://t.co/zsRkO8MdK2",
  "data/tweet-nytimes/2021/7/1416195975291490309.json": "A woman has joined a U.S. Navy special warfare unit for the first time. \n\nShe is the first female graduate of a training pipeline that feeds the Navy SEALs and other elite commando units, the Navy said. https://t.co/WquD0stMbn",
  "data/tweet-nytimes/2021/7/1416200992186638337.json": "As the highly contagious Delta variant of the coronavirus fuels outbreaks in the U.S., the director of the CDC warned on Friday that “this is becoming a pandemic of the unvaccinated.”\nhttps://t.co/S3w1fLf0dc",
  "data/tweet-nytimes/2021/7/1416231231482699776.json": "President Biden unleashed his growing frustration with social media on Friday when he said platforms like Facebook are “killing people” by allowing disinformation about the coronavirus vaccine to spread online.\nhttps://t.co/eU5g6Y1uu4",
  "data/tweet-nytimes/2021/7/1416111660989833222.json": "Summer temperatures have shifted toward more extreme heat over the past several decades. https://t.co/dPXsNbduew",
  "data/tweet-nytimes/2021/7/1416241266682118146.json": "Was the 1995 pink Chanel skirt suit Olivia Rodrigo wore to the White House meant to channel Elle Woods in “Legally Blonde”? Or was she referencing Cher Horowitz in “Clueless”? Or was the choice inspired by Jackie Kennedy Onassis?\n\nYes. https://t.co/CfdR6HvNUk",
  "data/tweet-nytimes/2021/7/1416352255884812291.json": "These are the cookies that anyone who asks you to make chocolate chip cookies is asking for — the kind that demands to be dunked into a glass of ice-cold milk. https://t.co/CJ8CNwo9E1",
  "data/tweet-nytimes/2021/7/1416417462430670854.json": "Watch: We used radar technology to peer through the clouds at the devastation caused by floods in multiple European towns. https://t.co/2qg2mT98IT https://t.co/8rMmO8KnCj",
  "data/tweet-nytimes/2021/7/1416382261180702720.json": "The Starbucks of the Right? The Black Rifle Coffee Company doubled its sales by leaning into America’s culture war. Now it’s trying to distance itself from some of its fans. https://t.co/CuoCo34Okc",
  "data/tweet-nytimes/2021/7/1416158633885380613.json": "\"Roadrunner,\" a new documentary about Anthony Bourdain, uses 45 seconds of an AI-generated voice that sounds like him. \"You are successful, and I am successful,\" the voice says, reading from an email he sent to a friend, \"and I’m wondering: Are you happy?\" https://t.co/KtOKbdYXxg",
  "data/tweet-nytimes/2021/7/1416397339644907526.json": "A 6-year-old was killed and five adults were wounded on Friday night in a shooting in Washington, according to the police. https://t.co/cu0iu3STgf",
  "data/tweet-nytimes/2021/7/1416492930001420294.json": "Floods swept Germany, fires ravaged the American West and another heat wave loomed, driving home the reality that the world’s richest nations remain unprepared for the intensifying consequences of climate change. https://t.co/afSyS8iC7w",
  "data/tweet-nytimes/2021/7/1416138070227918852.json": "“Roadrunner,” a new documentary on Anthony Bourdain, uses archival footage and interviews from his inner circle to look at how he became a worldwide icon and what might have contributed to his death by suicide in 2018. https://t.co/VURT69a7iT",
  "data/tweet-nytimes/2021/7/1416563426000785410.json": "Because Western scientists for so long stigmatized menstruation, and excluded input from female physicians who might have been more willing to study functions of female biology, science got a late start collecting quality data on menstruation. https://t.co/W4a2kRfJct",
  "data/tweet-nytimes/2021/7/1416462739388747777.json": "“This one I can feel.” \n\nRob Thompson, a water witch, claims that he can locate gushing streams of water beneath the earth’s bedrock. Amid California’s extreme drought, his services are in demand — but not everyone is convinced. https://t.co/SO5BB5iKGe",
  "data/tweet-nytimes/2021/7/1416588497734062084.json": "Breaking News: A shooting outside a Nationals-Padres baseball game in Washington prompted fans and players to scramble for safety. The game was halted until Sunday. https://t.co/rr1U2Cci2h",
  "data/tweet-nytimes/2021/7/1416724456421068800.json": "Older men and women who walked for six months showed improvements in white matter and memory, while those who danced or did stretching exercises did not. https://t.co/1651BA6gvn",
  "data/tweet-nytimes/2021/7/1416497948213485568.json": "“I don’t think there’s a thing in the world we could do to get them to get vaccinated.”\n\nWhile much of the U.S. tiptoes toward normalcy, the coronavirus is swamping hospitals in Arkansas, where vaccine hesitancy and refusal run high. https://t.co/96zWnq0lMi",
  "data/tweet-nytimes/2021/7/1416755905585192965.json": "Erin Gilmer, a lawyer and disability rights activist who fought for medical privacy, lower drug prices and a more compassionate health care system as she confronted a cascade of illnesses that left her unable to work or get out of bed, has died at 38. https://t.co/vjFCx6hWNt",
  "data/tweet-nytimes/2021/7/1416769116476686342.json": "A group of biologists and other scientists believe humans began growing cannabis about 12,000 years ago — and not just for food, but also for hemp and, yes, probably to get high. https://t.co/405dQ9bw2Q",
  "data/tweet-nytimes/2021/7/1416752142552117254.json": "A federal jury in Wisconsin found that Walmart had violated the Americans with Disabilities Act and awarded an ex-employee with Down syndrome more than $125 million in damages. https://t.co/qve0zcKIiB",
  "data/tweet-nytimes/2021/7/1416654000213086213.json": "These quick from-scratch condiments, dressings, toppings and seasonings make every dish — even the laziest snacks — taste special. https://t.co/v4DJFF7iFP https://t.co/xXXbbcgjqM",
  "data/tweet-nytimes/2021/7/1416407366287953928.json": "Towns in multiple European countries have been devastated by floods. We used radar technology to look through the clouds at the damage below. https://t.co/asYcD6G1ny",
  "data/tweet-nytimes/2021/7/1416827631228657666.json": "Mat George, co-host of \"She Rates Dogs,\" a popular podcast known for his humorous takes on dating, pop culture and his identity as a gay man, was struck and killed by a car as he crossed the street on Saturday in what the authorities called a hit-and-run. https://t.co/llutCTePJo",
  "data/tweet-nytimes/2021/7/1416840212706217990.json": "Thurgood Marshall became the first Black Supreme Court justice, and the stories he told his clerks revealed how he helped break down America’s color line, Stephen L. Carter writes in @NYTMag. https://t.co/RN8r8iNsrv",
  "data/tweet-nytimes/2021/7/1416482843224596482.json": "After bidding scandals, human rights outrages, overburdened host cities, rampant cheating, a pandemic — and, sure, thrilling competitions — has the world had enough of the Olympics? https://t.co/jzSM0X12gk",
  "data/tweet-nytimes/2021/7/1416931066569543680.json": "Older men and women who walked for six months showed improvements in white matter and memory, while those who danced or did stretching exercises did not. https://t.co/FazgDj1gwa",
  "data/tweet-nytimes/2021/7/1416925777111703558.json": "A federal jury in Wisconsin found that Walmart had violated the Americans with Disabilities Act and awarded an ex-employee with Down syndrome more than $125 million in damages. https://t.co/TPkOMQf421",
  "data/tweet-nytimes/2021/7/1416970007750365187.json": "Canada’s vaccination rate is now higher than the U.S. rate by about one percentage point. https://t.co/AIh63Wlzjj",
  "data/tweet-nytimes/2021/7/1417076774219964419.json": "Katie Hopkins, a British right-wing commentator, will be deported from Australia after bragging about flouting hotel quarantine rules.\n\nShe had entered the country to take part in a reality show and was required to isolate for two weeks.\nhttps://t.co/N9RKmLKqmb",
  "data/tweet-nytimes/2021/7/1417082674552971265.json": "Breaking News: The U.S. is expected to formally accuse China of hacking Microsoft and is set to organize allies to condemn Beijing, according to a senior official.\nhttps://t.co/egWwPV6LEz",
  "data/tweet-nytimes/2021/7/1416853150896726025.json": "Turkish officials invited journalists to witness what they described as Greece illegally pushing migrants back out to sea. Here’s what we saw. https://t.co/lRQJJ9UlBQ",
  "data/tweet-nytimes/2021/7/1417113265109405701.json": "In Opinion\n\nDolly Parton tried to get people vaccinated, but in Tennessee \"the bonehead politicians running this state managed to overcome even the good will generated by its favorite daughter,\" Margaret Renkl writes in a guest essay.\nhttps://t.co/9Mjjv6GUsA",
  "data/tweet-nytimes/2021/7/1417163591774613506.json": "Indiana University can require students to be vaccinated against the coronavirus, a federal judge affirmed on Monday. It appeared to be the first ruling upholding a Covid vaccine mandate by a university. https://t.co/daZdNmbm3E",
  "data/tweet-nytimes/2021/7/1417176157422764037.json": "Thousands of Native American children were forcibly removed from their families and sent to U.S. boarding schools dedicated to eradicating Indigenous culture.\n\nMany died. Those who lived are still struggling to make sense of who they were and who they are.\nhttps://t.co/IxNyfY9c2E",
  "data/tweet-nytimes/2021/7/1417245393990131712.json": "Ben &amp; Jerry’s will stop selling its ice cream in Israeli-occupied territories, the company announced Monday, plunging itself into one of the world's most fraught issues and angering many prominent Israelis. https://t.co/W5yECRXEsr",
  "data/tweet-nytimes/2021/7/1417221470284091395.json": "Prince Harry is writing “an intimate and heartfelt” memoir, Penguin Random House announced on Monday. “I’m writing this not as the prince I was born but as the man I have become,” he said in a statement accompanying the announcement. https://t.co/Kp4Aa4UIA3",
  "data/tweet-nytimes/2021/7/1417170182842331137.json": "The first person to have pleaded guilty to storming the Capitol on Jan. 6 was sentenced on Monday to eight months in prison. Paul Hodgkins of Florida admitted to breaching the Senate floor with the intention of disrupting the peaceful transition of power. https://t.co/FvHlLSvKxS",
  "data/tweet-nytimes/2021/7/1417292184559276044.json": "Representative Marjorie Taylor Greene was suspended from Twitter for 12 hours, the company said on Monday, after she posted messages that violated its policy against sharing misleading information about the coronavirus. https://t.co/nG5Kn5JXJh",
  "data/tweet-nytimes/2021/7/1417282368486977545.json": "Pedro Castillo, a political outsider, was elected president of Peru on Monday, becoming the country’s first left-wing leader in more than a generation. https://t.co/axZYMaX365",
  "data/tweet-nytimes/2021/7/1417255452430241798.json": "The American Academy of Pediatrics recommends universal masking in schools this fall for those over the age of 2, even if they have been vaccinated. The recommendation is a departure from the guidance issued by the CDC earlier this month. https://t.co/xLgB3cgl4U",
  "data/tweet-nytimes/2021/7/1417329703447318528.json": "People who test positive for the coronavirus should distance themselves from not only humans, but pet cats and dogs as well. “You cannot cuddle them,” one scientist said. https://t.co/cvaQie7dBr",
  "data/tweet-nytimes/2021/7/1417441678001123331.json": "The death toll from the coronavirus pandemic in India so far is likely to exceed three million — nearly 10 times the official figure — making it one of the worst human tragedies in the nation’s history, according to a comprehensive new study.\nhttps://t.co/upckhSJsdV",
  "data/tweet-nytimes/2021/7/1417341016844251136.json": "In Opinion\n\nRepublican devotion to pleasing Donald Trump \"is putting the whole nation at risk,\" writes Paul Krugman. \"In fact, it will almost surely kill large numbers of Americans in the next few months.\" https://t.co/VSgP5vgmlx",
  "data/tweet-nytimes/2021/7/1417242913596219396.json": "Wally Funk, 82, will be the oldest person ever to travel to space on Tuesday, in Jeff Bezos’ rocket. She has probably spent more time in airplanes as a pilot than the three men she is going to space with have spent as airplane passengers. https://t.co/4AnSX56hHW",
  "data/tweet-nytimes/2021/7/1417476027350200322.json": "Breaking News: Jeff Bezos, the world’s richest person, completed a short trip to space in a Blue Origin rocket, a milestone in his company’s spaceflight ambitions.\nhttps://t.co/ijdSkU3gV6",
  "data/tweet-nytimes/2021/7/1417480677361074182.json": "People who test positive for the coronavirus should distance themselves from not only humans, but pet cats and dogs as well. “You cannot cuddle them,” one scientist said. https://t.co/xLsVM3YBZC",
  "data/tweet-nytimes/2021/7/1417178692736987137.json": "Luke Prokop, 19, on Monday became the first player with an NHL contract to publicly announce that he is gay. A prospect with the Nashville Predators, Prokop said he was “no longer scared to hide who I am.” https://t.co/J2RBXmO3r6",
  "data/tweet-nytimes/2021/7/1417485741727301639.json": "A Ugandan weight lifter who went missing in Japan last week was found by the police.\n\nJulius Ssekitoleko, who did not make his country’s Olympic squad, left a note saying he wished to work in Japan before he disappeared.\nhttps://t.co/HhD258P2Ly",
  "data/tweet-nytimes/2021/7/1417439200610295816.json": "Wally Funk was one of 13 women who went through a rigorous astronaut-training program in the 1960s. Like the others, she was ultimately denied the opportunity because of her gender. \n\nShe will finally get her trip to space today, in Jeff Bezos’ rocket. https://t.co/GeUsx9zTwM",
  "data/tweet-nytimes/2021/7/1417514070379540483.json": "Wally Funk, 82, has probably spent more time in airplanes as a pilot than Jeff Bezos and the other men she just went into space with have spent as airplane passengers. She fought for decades to be an astronaut, but was shut out because of her gender. https://t.co/kYHXaveplR https://t.co/mTDjRkKuFu",
  "data/tweet-nytimes/2021/7/1417535849135329282.json": "Norway’s women's beach handball players were each fined 150 euros for wearing shorts rather than bikini bottoms. Men are allowed to wear shorts. A spokeswoman for the International Handball Federation said she did not know the reason for the rules. https://t.co/DUuaoGKhIi",
  "data/tweet-nytimes/2021/7/1417517427630477315.json": "Watch the moment Jeff Bezos and three others launched into space on Tuesday, fulfilling a goal more than 20 years in the making. https://t.co/0F9yD59Xwn https://t.co/cMXEIIhQTn",
  "data/tweet-nytimes/2021/7/1417561319650234371.json": "President Biden hosted a ceremony honoring the Tampa Bay Buccaneers’ 2021 Super Bowl win, where the quarterback Tom Brady stole the show with a pair of political jokes that appeared to be jabs at Donald Trump. https://t.co/CQeWvxIqc5 https://t.co/tBmM9Pv6Uh",
  "data/tweet-nytimes/2021/7/1417566200150872064.json": "Harvey Weinstein, who was convicted in New York in 2020 and sentenced to 23 years in prison, was transferred to California on Tuesday to face a new round of sex crime charges. https://t.co/0ojPC2vzvE",
  "data/tweet-nytimes/2021/7/1417563806541230089.json": "“I also want to thank every Amazon employee and every Amazon customer because you guys paid for all of this,” Jeff Bezos said during a news conference after his spaceflight. His remarks prompted swift critical reactions, including from members of Congress. https://t.co/daPwOfZlqf",
  "data/tweet-nytimes/2021/7/1417620366294409216.json": "\"Senator Paul,\" Dr. Anthony Fauci said during a Senate hearing on Tuesday, \"you do not know what you are talking about, quite frankly, and I want to say that officially.\" \n\nRead more: https://t.co/jI60pxWS6o https://t.co/PJydwlzJg5",
  "data/tweet-nytimes/2021/7/1417591418000789505.json": "Watch Jeff Bezos and his fellow passengers on the Blue Origin flight play with Skittles and experiment with gravity on their trip to space on Tuesday. https://t.co/XIYuIzEgmu https://t.co/vEV30rz2dL",
  "data/tweet-nytimes/2021/7/1417537422036963336.json": "Sharks get a bad rap. So researchers and officials are rethinking the phrase “shark attacks” to describe the moments when sharks and humans meet — instead adopting terms like \"incidents\" and \"encounters\" to help change public perception of the animals. https://t.co/xULexw5B0X",
  "data/tweet-nytimes/2021/7/1417570011997212678.json": "Survivors of Covid-19 and relatives of those who died from it in the U.S. are organizing into a vast grass-roots force to lobby for things like disability benefits; paid sick leave; research on “long haulers” and a national holiday to honor its victims.  https://t.co/QN46Yttugd",
  "data/tweet-nytimes/2021/7/1417691798785433600.json": "Breaking News: The Milwaukee Bucks beat the Phoenix Suns in six games for their first NBA championship in 50 years. https://t.co/0nPQWKsb28",
  "data/tweet-nytimes/2021/7/1417762035920683009.json": "Britain’s women’s soccer team became the first athletes to take a knee at the Olympics. Chile's players then joined the demonstration.\nhttps://t.co/g7UYniPUBp",
  "data/tweet-nytimes/2021/7/1417797781775847426.json": "\"Senator Paul,\" Dr. Anthony Fauci said during a Senate hearing on Tuesday, \"you do not know what you are talking about, quite frankly, and I want to say that officially.\" \n\nRead more: https://t.co/I8rOm7xuim https://t.co/ifhWUnm5v6",
  "data/tweet-nytimes/2021/7/1417814325964705795.json": "Breaking News: Pfizer and BioNTech reached a deal with a South African vaccine maker to bottle Covid shots. The doses would be sent exclusively to African nations.\nhttps://t.co/ILTMUhZ9Dv",
  "data/tweet-nytimes/2021/7/1417519700985237508.json": "Americans owe nearly twice as much medical debt as was previously known, a new study has found. Collection agencies held $140 billion in unpaid medical bills in 2018, the most recent year that data is available. https://t.co/mynqgvUpqG",
  "data/tweet-nytimes/2021/7/1417607660812345346.json": "J.&amp;J.’s Covid vaccine is much less effective against the Delta and Lambda variants than against the original virus, a new study suggests. The finding is at odds with those from smaller studies published by the company. https://t.co/yfmolLjPu8 https://t.co/AjQfEp68AI",
  "data/tweet-nytimes/2021/7/1417883343971131398.json": "Maria Taylor, a popular ESPN studio host, has left the company, ESPN announced Wednesday.\n\nThe departure had been expected since early this month, when The New York Times reported on disparaging comments made about Taylor by her colleague, Rachel Nichols. https://t.co/7NtN7x1OWB",
  "data/tweet-nytimes/2021/7/1417904720480555013.json": "Speaker Nancy Pelosi will bar two Trump allies from the committee investigating the Jan. 6 Capitol riot, she said, because of \"statements made and actions taken by these members.\" https://t.co/pwfYntKC63",
  "data/tweet-nytimes/2021/7/1417927388000833539.json": "Thirty-one former chiefs of staff to Democratic senators have written an open letter calling for “repeal or reform” of the filibuster, saying it no longer serves its original purpose and is now being abused as a way to block and stall legislation. https://t.co/Bx5NF5GAcP",
  "data/tweet-nytimes/2021/7/1417879574982139912.json": "The effects of fires in the western U.S. and Canada are being felt thousands of miles from the flames. https://t.co/oO6bHvpzII https://t.co/WrN2SGI0BK",
  "data/tweet-nytimes/2021/7/1417933666639040515.json": "A new law in Maine aims to take the cost burden of recycling away from taxpayers to manufacturers. One environmental advocate said the change could be “transformative.” Many nations with similar laws have seen their recycling rates soar. https://t.co/Yc8Bojpr0B",
  "data/tweet-nytimes/2021/7/1417929903345909761.json": "Iran is facing a severe water shortage, caused by a drought worsened by climate change and government mismanagement. Demonstrators shouting, “I am thirsty!” have taken to the streets, demanding relief and that local officials resign. https://t.co/PJubP5CczO https://t.co/TeJAHlDRmw",
  "data/tweet-nytimes/2021/7/1417947527157006337.json": "PG&amp;E, California’s largest electricity provider, said it plans to put 10,000 miles of power lines underground after the utility’s equipment was blamed for a series of wildfires. https://t.co/AdOGEmwcWM",
  "data/tweet-nytimes/2021/7/1418045652853010436.json": "An estimated 1.5 million children worldwide lost a mother, father or other caregiving relative in the first 14 months of the pandemic, according to a new study. More than a million lost primary caregivers.\nhttps://t.co/SauMgBE4x5",
  "data/tweet-nytimes/2021/7/1418168967982690310.json": "YouTube removed videos from President Jair Bolsonaro of Brazil for spreading misinformation about the coronavirus. https://t.co/GycCrDqhpy",
  "data/tweet-nytimes/2021/7/1417997856363974656.json": "600 tons of dead fish have piled up on Florida’s beaches this summer because of the harmful algal blooms known as a red tide. Pollution and climate change appear to be making the algal blooms, which are a natural phenomenon, worse. https://t.co/hLvRe9XndL",
  "data/tweet-nytimes/2021/7/1418173611119104001.json": "He was alone in Alaska, sleep-deprived and nearly out of ammunition. Well, he wasn't really alone. A bear was following him.\n\nBut then help arrived. https://t.co/gJzNwIAaUU",
  "data/tweet-nytimes/2021/7/1418050693156462592.json": "The Spanish artistic swimmer Ona Carbonell is expressing her “disappointment and disillusionment” that it is not practical to bring her son to Japan for the Tokyo Olympics while she is breastfeeding him.\nhttps://t.co/6iGsbRm6WW",
  "data/tweet-nytimes/2021/7/1418228138274873344.json": "Breaking News: An artificial intelligence lab called DeepMind predicted the shapes of hundreds of thousands of proteins in hours — a task that takes scientists years. The technology could greatly accelerate medical and scientific research.\nhttps://t.co/L9ZBTamYh5",
  "data/tweet-nytimes/2021/7/1418151346411393032.json": "Executives at Activision Blizzard sexually harassed women, a California state agency said in a lawsuit, and male employees openly joked about rape and drank alcohol while engaging in “inappropriate behavior” toward women at their cubicles. https://t.co/WgXWYQNaMB",
  "data/tweet-nytimes/2021/7/1418284763568381953.json": "Italy said it will require vaccination proof or a negative Covid test for many social activities, including indoor dining and attending shows, as debate grows over limits being placed on the unvaccinated. France made a similar announcement last week.\nhttps://t.co/gGfwhhOgKc",
  "data/tweet-nytimes/2021/7/1418280965462544386.json": "The FBI said some of the 4,500 tips it received about Justice Brett Kavanaugh during its investigation into sexual misconduct allegations against him were given to the Trump White House, leading some Democrats to call the process a sham. https://t.co/vp4eq75JLC",
  "data/tweet-nytimes/2021/7/1418043157032443905.json": "Speaker Nancy Pelosi moved on Wednesday to bar two of Donald Trump’s most vociferous Republican defenders in Congress from joining a select committee to investigate the Jan. 6 riot at the U.S. Capitol.  https://t.co/YuMWFZjIe8",
  "data/tweet-nytimes/2021/7/1418161423138578445.json": "The Hong Kong police arrested five people behind a children's story book that portrayed the police as wolves. The suspects, who are leaders of a speech therapists' union, have been accused of instilling hatred of the government in children. https://t.co/QtxkZtYZE5",
  "data/tweet-nytimes/2021/7/1418320471716683777.json": "Former congresswoman Abby Finkenauer, a Democrat, announced on Thursday she will run against Senator Charles Grassley, Republican of Iowa, next year. She accused Grassley and other top Republicans of \"remaining silent\" about the Capitol attack on Jan. 6.\nhttps://t.co/uJ2xEgnwrq",
  "data/tweet-nytimes/2021/7/1418209357888512006.json": "And now for your moment of Zen: \"The Daily Show\" turns 25 years old today.\n\nThe creators Madeleine Smithberg and Lizz Winstead reflect on the early days, how the show was inspired by a bad date and discovering Stephen Colbert on \"Good Morning America.\" https://t.co/sFapnEHB2t",
  "data/tweet-nytimes/2021/7/1418356466424164359.json": "As the Delta variant spreads among the unvaccinated, some fully vaccinated people are wondering if they need masks again. While being fully vaccinated protects against Covid, most experts say masks remain a wise precaution in certain settings for everyone. https://t.co/vBZRyJlTvb",
  "data/tweet-nytimes/2021/7/1418269637742055429.json": "Speaker Nancy Pelosi is said to be considering appointing a second anti-Trump Republican, Representative Adam Kinzinger of Illinois, to the House select committee investigating the Jan. 6 Capitol riot. https://t.co/coDfYB2tBh",
  "data/tweet-nytimes/2021/7/1418263345774350339.json": "Unusually heavy rains engulfed roads and bridges, flooding towns and cities in central China. The extreme weather has killed 33 people, displaced 250,000, and caused widespread disruption. https://t.co/2705X9UBaJ https://t.co/OVQmEfeg50",
  "data/tweet-nytimes/2021/7/1418408038088777729.json": "Thanks to a NASA robot that landed on Mars in 2018, scientists now have a map of the red planet’s inner workings down to its core, the first ever made of another planet. https://t.co/6nmk58ZJSD",
  "data/tweet-nytimes/2021/7/1418270879629316102.json": "Though Covid vaccines protect against serious illness, they are not perfect shields against the virus, particularly not the Delta variant. Experts say “breakthrough” infections are still relatively uncommon. Here’s why they occur. https://t.co/Hi4lpcUUNV",
  "data/tweet-nytimes/2021/7/1418405534584221709.json": "Argentina has become the first country in Latin America to officially recognize gender nonbinary people. https://t.co/9jKp8uNGr1",
  "data/tweet-nytimes/2021/7/1418413078052495362.json": "\"I never lost strength.\" A Staten Island man who spent 23 years in prison for a murder that he did not commit was exonerated on Thursday after a number of witnesses were identified, including a person walking with the victim at the time of the shooting. https://t.co/lfUscda6WJ",
  "data/tweet-nytimes/2021/7/1418445790129926146.json": "Simone Biles has five Olympic medals, 25 world championship medals and several moves named for her.\n\nNow she has an emoji. https://t.co/d8Ixfa9w5f",
  "data/tweet-nytimes/2021/7/1418540667383451650.json": "Several hundred people are gathered near Olympic Stadium in Tokyo to protest holding the Games during the pandemic. The stadium is quiet enough that they are audible during the ceremony. https://t.co/5gtlk6YROh\n\nhttps://t.co/7TBSguuOFB",
  "data/tweet-nytimes/2021/7/1418530102338535434.json": "\"I never lost strength.\" A Staten Island man who spent 23 years in prison for a murder that he did not commit was exonerated on Thursday after a number of witnesses were identified, including a person walking with the victim at the time of the shooting. https://t.co/wyBQGuMxlD",
  "data/tweet-nytimes/2021/7/1418558779499614216.json": "\"The hot, shirtless Tongan flagbearer from Rio is BACK!\"\n\nPita Taufatofua became an overnight sensation five years ago when he marched shirtless and in a traditional Tongan outfit at the opening ceremonies in 2016 and 2018. He is back for #Tokyo2020. https://t.co/lSzzr8Lsf4 https://t.co/bT2HlMoKhO",
  "data/tweet-nytimes/2021/7/1418572893601009674.json": "A giant rotating Earth made of drones appeared above Olympic Stadium at the #Tokyo2020 opening ceremony as John Lennon’s “Imagine” played. https://t.co/vzWDufG2nQ https://t.co/iIQjEr6Vpa",
  "data/tweet-nytimes/2021/7/1418579437508046849.json": "Breaking News: Cleveland’s baseball team will become the Guardians after the current season, dropping the controversial “Indians” name it has used for over 100 years. https://t.co/Z2ulI6mfLK",
  "data/tweet-nytimes/2021/7/1418516254197960705.json": "Naomi Osaka, Simone Biles and Gwen Berry are among the Black women who will carry the burden of delivering standout performances in Tokyo. The Olympic movement disrespects and fails to support them, writes Kurt Streeter.\nhttps://t.co/s7zDkO9GdT",
  "data/tweet-nytimes/2021/7/1418586701916692484.json": "The torch relay at the #Tokyo2020 Olympics ended with the tennis star Naomi Osaka lighting the cauldron.\n\nShe followed in the footsteps of Muhammad Ali, Paavo Nurmi, Rafer Johnson, Midori Ito, Yuna Kim and Wayne Gretzky. https://t.co/K5L0obAUj9",
  "data/tweet-nytimes/2021/7/1418582959792304130.json": "\"For those not watching, some guys dressed in blue and white with their heads encased in giant ping-pong (?) balls covered in felt just enacted what appeared to be every single Olympic sport,\" writes @sarahlyall.\n\nFollow live updates: https://t.co/Hnv0Nqthnj https://t.co/8vX6yVYKYg",
  "data/tweet-nytimes/2021/7/1418597716490440705.json": "Breaking News: Some Florida hospitals have more Covid patients than at any point in the pandemic, as national alarm rises over lagging vaccination rates in parts of the U.S. https://t.co/1mi6OZKbiB",
  "data/tweet-nytimes/2021/7/1418590505714298881.json": "A night of music and celebration played out in Olympic Stadium in Tokyo mainly for a television audience, concluding with the tennis star Naomi Osaka lighting the cauldron. Let the #Tokyo2020 Games begin.\nhttps://t.co/KONuer8SpY https://t.co/eEWgQmPbjp",
  "data/tweet-nytimes/2021/7/1418503676298240000.json": "Thanks to a NASA robot that landed on Mars in 2018, scientists now have a map of the red planet’s inner workings down to its core, the first ever made of another planet. https://t.co/hxSK67LEDl",
  "data/tweet-nytimes/2021/7/1418618005378973696.json": "Naomi Osaka lit the Olympic cauldron at the #Tokyo2020 opening ceremony. https://t.co/ocZmGE8NOG https://t.co/XD4g9NAzXi",
  "data/tweet-nytimes/2021/7/1418635801395671041.json": "Formal Olympian wardrobes are often very traditional, or even boring; they generally resemble golf pro outfits. They are rarely “cool” — and rarely available to smaller countries with less promotional muscle.\n\nBut this year Liberia changed that narrative.\nhttps://t.co/MrI1aqR7z9",
  "data/tweet-nytimes/2021/7/1418592013205786630.json": "The Olympics have officially kicked off. We followed four elite athletes and deconstructed what makes each one’s technique so special.\n\nTo visualize the athletes’ movements, we used video and data captured during training sessions to create 3-D models. https://t.co/yERntcV9YV",
  "data/tweet-nytimes/2021/7/1418720094704832514.json": "“Folks are supposed to have common sense, but it’s time to start blaming the unvaccinated folks, not the regular folks,” Gov. Kay Ivey of Alabama said during a news conference on Thursday. “It’s the unvaccinated folks that are letting us down.” https://t.co/CJ5mOhIQXN",
  "data/tweet-nytimes/2021/7/1418736464729346050.json": "Chicago Public Schools will require everyone to wear masks in school buildings when the new academic year starts, regardless of their vaccination status, according to guidelines the school system released.\nhttps://t.co/PLybxeDXtV",
  "data/tweet-nytimes/2021/7/1418753780867293185.json": "Pita Taufatofua is back for the Tokyo Olympics. \n\nHe became an overnight sensation five years ago when he marched shirtless and in a traditional Tongan outfit at the opening ceremonies in 2016 and 2018. He repeated the performance for this year's ceremony. https://t.co/Oj0FHOVV3a https://t.co/GSiYyDKI8J",
  "data/tweet-nytimes/2021/7/1418771696836911116.json": "This giant rotating Earth — made of drones — appeared above Olympic Stadium at the #Tokyo2020 opening ceremony as John Lennon’s “Imagine” played. https://t.co/7KVwBWbR7b https://t.co/7KfcNXbFwg",
  "data/tweet-nytimes/2021/7/1418781147362889735.json": "Naomi Osaka followed in the footsteps of Muhammad Ali, Paavo Nurmi, Rafer Johnson, Midori Ito, Yuna Kim and Wayne Gretzky and lit the Olympic cauldron to cap Friday's opening ceremony.\nhttps://t.co/QMsUB3Ljr6 https://t.co/o24TVNx7Wr",
  "data/tweet-nytimes/2021/7/1418784797758042113.json": "Few people were there to witness the #Tokyo2020 opening ceremony. But New York Times photographers were. Here's what they saw. https://t.co/e0rT3Fp3dw https://t.co/ysRyAtGfo4",
  "data/tweet-nytimes/2021/7/1418828327025094656.json": "She's competing in the Tokyo Olympics as Singapore's only female rower. But when the coronavirus hit her home country last year, Joan Poh put her training on hold — and returned to her job as a frontline nurse. https://t.co/2944B6ctfJ https://t.co/N2dLSaAn9X",
  "data/tweet-nytimes/2021/7/1418873650057461768.json": "France is moving closer to making vaccines mandatory for everyone. And Mario Draghi, the Italian prime minister, followed the French example. “The appeal to not getting vaccinated is an appeal to die,” he said. https://t.co/RRztc1oy9p",
  "data/tweet-nytimes/2021/7/1418900040202981380.json": "Simone Biles, the most decorated gymnast in history, routinely executes gymnastics moves considered so dangerous that other women won't even attempt them. Her judges aren't including them in their scoring. https://t.co/kSJhQVkSxI",
  "data/tweet-nytimes/2021/7/1418721735013281792.json": "Breaking News: U.S. health officials increasingly think people who are 65 or older or immunocompromised will need Covid vaccine booster shots. https://t.co/94ahOBfeKp",
  "data/tweet-nytimes/2021/7/1418687646226911242.json": "Astronomers have found moons in the making in a ring of rock and gas orbiting an exoplanet nearly 400 light-years from Earth. https://t.co/UCzIQiNYRt",
  "data/tweet-nytimes/2021/7/1418893739448279042.json": "Even as Japan celebrates the accomplishments of its “hafu” athletes — “half,” as in half-Japanese and half-something else — they must still contend with xenophobia in a society whose ideas of nationhood are tied to race. https://t.co/hPcdt3sYx8",
  "data/tweet-nytimes/2021/7/1418925624643686415.json": "Simone Biles, the most decorated gymnast in history, routinely executes gymnastics moves considered so dangerous that other women won't even attempt them. Judges aren’t scoring her moves high enough. https://t.co/6du7I05AgT",
  "data/tweet-nytimes/2021/7/1418908841677398016.json": "It’s Day 1 of the #Tokyo2020 Olympics! Keep track of live updates and the medal count here: https://t.co/2gfZlQe5xJ https://t.co/KM6LB5ciZq",
  "data/tweet-nytimes/2021/7/1418922922689826817.json": "Mark Herring, 60, had a fatal heart attack after the police swarmed his house following a fake 911 call. Federal prosecutors said he became the target of \"swatting\" after he refused to give up his coveted Twitter handle. https://t.co/fk7O5gmE6L",
  "data/tweet-nytimes/2021/7/1418967994533822468.json": "So you're vaccinated. Do you need a mask? Here's what to know. https://t.co/wpEt4tm1sO https://t.co/joDwgDmI9w",
  "data/tweet-nytimes/2021/7/1418989375132733442.json": "An osteopathic physician in Florida has become the chief spreader of coronavirus misinformation online. He's reaching a far larger audience than other vaccine skeptics, an analysis by The New York Times found.\nhttps://t.co/EgjN15ogBx",
  "data/tweet-nytimes/2021/7/1418998197192699904.json": "Defiant, colorful and proud, thousands of Hungarians march through Budapest to support the country’s embattled L.G.B.T.Q. community and protest the far-right policies of Prime Minister Viktor Orban.  https://t.co/02T2u7QLvo",
  "data/tweet-nytimes/2021/7/1418907578101293068.json": "On a single day this week, more than 660,000 people across the U.S. pushed up their sleeves and got their coronavirus vaccines. We asked some of them: Why now? https://t.co/SD15kodmBp",
  "data/tweet-nytimes/2021/7/1419086494669623300.json": "Jackie Mason, who kept the borscht belt style of comedy alive and found success with a series of one-man shows on Broadway, died at 93. https://t.co/68S0lTTwbV",
  "data/tweet-nytimes/2021/7/1419081821468377090.json": "Two words: Simone Biles.\n\nEarly Sunday morning Eastern time, the American gymnastics star will take to the uneven bars, the beam, the vault and the floor for the first time at the #Tokyo2020 Olympics. https://t.co/yUGDUMljro",
  "data/tweet-nytimes/2021/7/1419116118111932416.json": "The U.S. just won its first medals at #Tokyo2020.\n\nThe swimmer Chase Kalisz 🇺🇸 won gold in the men’s 400-meter individual medley. Jay Litherland 🇺🇸 took the silver. https://t.co/9Z1ea9Bcsv",
  "data/tweet-nytimes/2021/7/1419130927373033474.json": "The U.S., with Simone Manuel swimming the anchor leg, won the bronze medal in the women’s 4x100-meter freestyle relay at #Tokyo2020. https://t.co/5kFjbDrJay",
  "data/tweet-nytimes/2021/7/1419085020665425921.json": "In 2016, Simone Manuel, 24, became the first Black female swimmer to win an individual Olympic gold medal. She set a female record with seven medals at the 2019 World Championships, cementing her dominance as a freestyle sprinter. \n\nHere's how she does it: https://t.co/ufRfsEGSio https://t.co/45A14IXyQt",
  "data/tweet-nytimes/2021/7/1419162548646121482.json": "Yuto Horigome, a Japanese skateboarder, won gold in the men's street competition at the #Tokyo2020 Olympics, just eight miles from where he grew up. 🛹 https://t.co/eJBo5lBQNA",
  "data/tweet-nytimes/2021/7/1419154907299450886.json": "Kimia Alizadeh, a taekwondo fighter, became a hero after becoming the first woman to win an Olympic medal for Iran in 2016.\n\nNow, at #Tokyo2020, she is part of a refugee team. And she beat an Iranian opponent. https://t.co/JZn6wupFPu",
  "data/tweet-nytimes/2021/7/1419175608085532673.json": "The U.S. gymnast Sunisa Lee, 18, is favored to win an individual medal in the uneven bars, one of the hardest events in women’s gymnastics. \n\nWe spent time with her in Minnesota as she prepared for her Olympic debut: https://t.co/Afgn7LhP3W https://t.co/9F0uqeAjbJ",
  "data/tweet-nytimes/2021/7/1419187991659098112.json": "Simone Biles usually owns the floor exercise. But after a wildly difficult routine at the #Tokyo2020 Olympics, the American gymnastics star is currently in second place, behind Vanessa Ferrari of Italy. \n\nFollow along live: https://t.co/6yrPMjiF6t https://t.co/FdrMGQiwvZ",
  "data/tweet-nytimes/2021/7/1419228431296860167.json": "Defiant, colorful and proud, thousands of Hungarians marched for Budapest Pride while protesting the far-right policies of Prime Minister Viktor Orban. https://t.co/D7FKqUZEiU https://t.co/SgpFua4ntC",
  "data/tweet-nytimes/2021/7/1418947847542775815.json": "The sport of 3x3 basketball is new to the Olympics but it already has a GOAT: Dusan Bulut of Serbia. We tracked him down: https://t.co/sjnCFHPRu5",
  "data/tweet-nytimes/2021/7/1419222150662213635.json": "\"Something I didn’t learn until after my father’s suicide is that depression can cause chronic gastrointestinal torment, much as stress can cause back pain, or sadness can cause tears,\" Maura Kelly writes. https://t.co/K5icX3SJM9",
  "data/tweet-nytimes/2021/7/1419149177645412354.json": "Which country has won the most medals so far at the #Tokyo2020 Olympics?\n\nIt's currently 🇺🇸 followed by 🇨🇳. Follow live updates and results from the Games: https://t.co/m3JIk40htl https://t.co/PRBWYB3ZRQ",
  "data/tweet-nytimes/2021/7/1419315278375161861.json": "Members of the German women’s gymnastics team competed in ankle-length unitards at the #Tokyo2020 Olympics. https://t.co/uPX2mu6mye",
  "data/tweet-nytimes/2021/7/1419313579619241990.json": "With an opening match win against China, Naomi Osaka returns to the public stage, and the court. https://t.co/OeJAeSgEsq",
  "data/tweet-nytimes/2021/7/1419319047662018569.json": "More children are dying from Covid-19 in Indonesia than in any other country, says the head of the Indonesian Pediatric Society, Dr. Aman Bhakti Pulungan. He blames adults: “They refuse to wear a mask. They bring their children to crowded places.” https://t.co/VUhEXOA2R7",
  "data/tweet-nytimes/2021/7/1419370635374039043.json": "Americans have been hearing for months about the frightening rise of the Delta variant. But the virus is not the root cause of surging infection rates in parts of the country. Vaccine refusal and hesitancy are to blame.  https://t.co/TtdbYy4FpI",
  "data/tweet-nytimes/2021/7/1419373438993580037.json": "Breaking News: Bob Moses, a civil rights pioneer who faced violence when registering Black voters in the 1960s and later promoted math education, is dead at 86. https://t.co/K2epMGmpO1",
  "data/tweet-nytimes/2021/7/1419180265025544195.json": "Simone Biles does gymnastics moves that are so difficult, she can fall and still win a competition. \n\nLook for her at some point in the #Tokyo2020 Olympics to launch a powerful Yurchenko double pike vault. It will be named for her if she completes it. https://t.co/QI2FLXQZ11",
  "data/tweet-nytimes/2021/7/1419385739557605379.json": "As climbing makes its Olympics debut, the Czech athlete Adam Ondra enters the Games as the sport’s biggest star. \n\nWe deconstructed his climbing technique in videos and graphics: https://t.co/uu8qwWZkZH https://t.co/MGhAQpbPDU",
  "data/tweet-nytimes/2021/7/1419446118195269638.json": "Simone Biles, the most decorated gymnast in history, routinely executes gymnastics moves considered so dangerous that other women won't even attempt them. Judges aren’t scoring her moves high enough. https://t.co/ibCjnhYUvi",
  "data/tweet-nytimes/2021/7/1419432030341902339.json": "A conservative Tennessee radio host is urging vaccinations after being hospitalized with Covid. “Phil would like for his listeners to know that while he has never been an ‘anti-vaxer’ he regrets not being more vehemently ‘pro-vaccine,'” his station said. https://t.co/9hSwqwon4T",
  "data/tweet-nytimes/2021/7/1419472949199970308.json": "Margaret MacNeil of Canada 🇨🇦 just won the women's 100-meter butterfly at #Tokyo2020. \n\nFollow the Olympics swimming live: https://t.co/uDuUyVgHyi",
  "data/tweet-nytimes/2021/7/1419486090839433216.json": "The U.S. swimmer Katie Ledecky 🇺🇸 met her match at #Tokyo2020. She lost the 400-meter freestyle to Ariarne Titmus of Australia 🇦🇺. https://t.co/ktwCzc2RrS",
  "data/tweet-nytimes/2021/7/1419451166992347139.json": "“This moment requires a serious, cleareyed, nonpartisan approach. We are duty bound to conduct a full investigation on the worst attack on the Capitol since 1814 and to make sure it can never happen again,\" Representative Adam Kinzinger said. https://t.co/E8gtsEsSIT",
  "data/tweet-nytimes/2021/7/1419497012651773953.json": "Caeleb Dressel 🇺🇸 led the U.S. to victory in the men's 4x100-meter freestyle relay at #Tokyo2020. https://t.co/rTLvFltDWk",
  "data/tweet-nytimes/2021/7/1419483870009901059.json": "Americans have been hearing for months about the frightening rise of the Delta variant. But the virus is not the root cause of surging infection rates in parts of the country. Vaccine refusal and hesitancy are to blame.  https://t.co/PW4mjJaQt3",
  "data/tweet-nytimes/2021/7/1419530260547244034.json": "She's 13 years old. She's a skateboarder. And she's an Olympic gold medalist. \n\nMomiji Nishiya of Japan 🇯🇵 takes 🥇 in the women's street final at #Tokyo2020. https://t.co/AXfeHMXiAz",
  "data/tweet-nytimes/2021/7/1419571962582552578.json": "Members of the German women’s gymnastics team competed in ankle-length unitards at the #Tokyo2020 Olympics. https://t.co/ZNC2nyWJ0l",
  "data/tweet-nytimes/2021/7/1419613549651976196.json": "Dr. Anthony Fauci is promoting an expensive plan to work on “prototype” vaccines to protect against the next global health threat that could come from 20 virus families. https://t.co/NPcKflGfVm",
  "data/tweet-nytimes/2021/7/1419604934299996164.json": "Oksana Chusovitina, a 46-year-old gymnast representing Uzbekistan, got a standing ovation after finishing her last ever Olympic event.\n\nMany younger athletes lined up to take selfies with the the gymnastics “icon,” who has competed at eight Games.\nhttps://t.co/WymOgvmLEm",
  "data/tweet-nytimes/2021/7/1419409666417778689.json": "A growing industry of back-alley disinformation firms are exploding in scale. They meddle in elections and promote falsehoods on behalf of clients who can claim deniability, escalating this era of unreality. https://t.co/mgFsfLRbYH",
  "data/tweet-nytimes/2021/7/1419628620390281217.json": "She's 13 years old. She's a skateboarder. And she's an Olympic gold medalist. \n\nMomiji Nishiya of Japan 🇯🇵 won gold in the women's street final at #Tokyo2020. https://t.co/WWwSPcfr7Y",
  "data/tweet-nytimes/2021/7/1419034676589649920.json": "Jeff Bezos has become the Dorian Gray of dorkiness, a fun-house mirror through which a sizable contingent of usually white men, approaching middle age and unpossessed of Ryan Gosling’s looks, should see themselves, Jacob Bernstein writes. https://t.co/trFxde2qAT",
  "data/tweet-nytimes/2021/7/1419457452337160193.json": "Facing deep mistrust, Louisiana health officials are struggling to stem misinformation as they try to vaccinate more people and beat back the virus. https://t.co/E3CjKgO81j",
  "data/tweet-nytimes/2021/7/1419653686146572297.json": "Breaking News: New York will require city workers to be vaccinated by mid-September or face weekly testing, Mayor Bill de Blasio is expected to announce.\nhttps://t.co/dEAH6K5BEJ",
  "data/tweet-nytimes/2021/7/1419662581585879043.json": "At 13, Momiji Nishiya is one of the youngest Olympic gold medalists. Representing Japan, she was the winner of the women’s street skateboarding competition. https://t.co/RzX75PJMPc https://t.co/jXnzrOmqGp",
  "data/tweet-nytimes/2021/7/1419672639170355203.json": "When the German women’s gymnastics team walked onto the competition floor on Sunday wearing ankle-length unitards, as opposed to leotards, they were setting an example for athletes “who may feel uncomfortable or even sexualized in normal suits.” https://t.co/3IMfmEegzY https://t.co/uw2Eb9OHdd",
  "data/tweet-nytimes/2021/7/1419648711022546946.json": "Oksana Chusovitina, a 46-year-old gymnast representing Uzbekistan, got a standing ovation after finishing her last ever Olympic event. This is her eighth Olympics.\n\n“I think it’s time now, really,” she said of retirement. “I want to be a mom and a wife.” https://t.co/vsGUJMwA2j https://t.co/tEYpdjkAcG",
  "data/tweet-nytimes/2021/7/1419420978468343811.json": "A South Korean broadcaster showed photographs associating pizza with Italy, Chernobyl with Ukraine and Count Dracula with Romania in its coverage of the opening ceremony. Now, it's apologized. https://t.co/Xt7brfwZEi",
  "data/tweet-nytimes/2021/7/1419705352069787649.json": "Until Monday, the Philippines had never won an Olympic gold medal. Then Hidilyn Diaz, a weight lifter at her fourth Games, finally broke the nearly century-long drought — and achieved two Olympic records in the process. https://t.co/cAmboFaxUW",
  "data/tweet-nytimes/2021/7/1419722209334026240.json": "Breaking News: The Department of Veterans Affairs will require its health care workers to be vaccinated against Covid. It's the first federal agency to do so as concern grows about unvaccinated people contributing to the Delta variant's rapid spread. https://t.co/6v6IW1lQyW",
  "data/tweet-nytimes/2021/7/1419695966236577801.json": "Nearly 60 major medical organizations, including the American Medical Association and the American Nurses Association, called on Monday for mandatory vaccination of U.S. health care workers, citing an ethical obligation. https://t.co/fwXp0U3Sgi",
  "data/tweet-nytimes/2021/7/1419769434957402115.json": "Breaking News: Britney Spears has asked a court to remove her father from the conservatorship that has controlled her life and finances for more than 13 years. Her new lawyer filed a motion on Monday, a month after Spears called the arrangement abusive. https://t.co/QNPSFtAgWU",
  "data/tweet-nytimes/2021/7/1419730528840921101.json": "“‘Jeopardy!’ is a cultural touchstone, and for a Black man to occupy that podium is significant.” Read our interview from last month with LeVar Burton, who on Monday will start his stint as a guest host on the show. https://t.co/AkVh1Q9b7k",
  "data/tweet-nytimes/2021/7/1419822366683803649.json": "Youth was served to a global audience at the #Tokyo2020 Games on Monday when two 13-year-old skateboarders fought to the final trick to determine the winner of the women’s street competition. https://t.co/YodhLpoBi9 https://t.co/qZvnU3s5Yb",
  "data/tweet-nytimes/2021/7/1419804745800290305.json": "Flooding in London and Belgium caused widespread structural damage and evacuations for residents. Much of Western Europe has been under flood warnings for the past few weeks. https://t.co/sKW6FRIj2x https://t.co/ihGpenDzY3",
  "data/tweet-nytimes/2021/7/1419731764264771594.json": "California will require all state employees and health care workers to be vaccinated or face regular testing, Gov. Gavin Newsom announced. The new requirement will apply to roughly 246,000 public employees, he said. https://t.co/Fyf4GsZynN",
  "data/tweet-nytimes/2021/7/1419797199320453122.json": "For a country officially barred from the Olympics, Russia is very much a presence at this summer’s #Tokyo2020 Games.\n\n“Actually,” one Russian journalist admitted this week, “it does not feel like we are banned.”\nhttps://t.co/AfEggJmodT",
  "data/tweet-nytimes/2021/7/1419867662717497358.json": "Until Monday, the Philippines had never won an Olympic gold medal. Then Hidilyn Diaz, a weight lifter at her fourth Games, finally broke the nearly century-long drought at #Tokyo2020 — and achieved two Olympic records in the process. https://t.co/iBKMic1nWT https://t.co/PdDruBCQAO",
  "data/tweet-nytimes/2021/7/1419848505284300803.json": "Lydia Jacoby 🇺🇸 upset Lilly King, a fellow American, in the 100-meter breaststroke at #Tokyo2020, winning in 1:04.95. 🏊‍♀️\n\nLilly King had been undefeated in the event since 2015 and is the current world-record holder. https://t.co/vXSAt19meR",
  "data/tweet-nytimes/2021/7/1419847775391518722.json": "Lydia Jacoby of the U.S. 🇺🇸 just took the gold in the women’s 100-meter breaststroke at #Tokyo2020. \n\nLilly King 🇺🇸, the winner in 2016, won bronze, behind Tatjana Schoenmaker 🇿🇦. https://t.co/x5Nev31pQF https://t.co/B0uM3LW5l2",
  "data/tweet-nytimes/2021/7/1419835949668872210.json": "Flora Duffy took home gold in the women's triathlon event at the #Tokyo2020 Games. It was the first gold medal for Bermuda at the Olympic Games, and only the second medal in the country's history. https://t.co/43aSxDf7Mh https://t.co/NVUS0BMGSX",
  "data/tweet-nytimes/2021/7/1419741849514921993.json": "A generational gap has emerged between young workers who have fully embraced remote work and older colleagues who value being in a physical workspace. \"You can’t force anyone to do anything these days,\" one CEO said. \"You can only urge.\" https://t.co/mDObGlIksX",
  "data/tweet-nytimes/2021/7/1419986173313916928.json": "Breaking News: Simone Biles, the world's most decorated gymnast, has pulled out of the women's gymnastics team final. A USA gymnastics official confirmed the news but did not provide a reason. https://t.co/Zy0qLMfRgG",
  "data/tweet-nytimes/2021/7/1419991006708211714.json": "Leading to this summer, Simone Biles couldn’t wait for the #Tokyo2020 Olympics. Not for them to start. For them to end.\n\nThe weight she carried as the face of the sport had become a burden. And the pressure on her body had become what she called “unreal.\" https://t.co/U8W1oSpSZl",
  "data/tweet-nytimes/2021/7/1419960772306907136.json": "The gymnast Sunisa Lee, 18, will be one of four representing the U.S. in the team competition at the Olympics. She is favored to win an individual medal in the uneven bars, one of the hardest events in gymnastics. https://t.co/YU3V9fybiZ https://t.co/EprjoeY0RD",
  "data/tweet-nytimes/2021/7/1420004970666070046.json": "Breaking News: Russia won the gold in a dramatic women's gymnastics team final at the #Tokyo2020 Olympics after Simone Biles withdrew. The U.S. won silver and Britain won bronze. https://t.co/3HS6uGwCLj",
  "data/tweet-nytimes/2021/7/1419890983790018564.json": "Breaking News: Naomi Osaka 🇯🇵 is out of the #Tokyo2020 Olympics.\n\nThe Japanese tennis superstar lost the third round of the women’s singles tennis tournament to Marketa Vondrousova of the Czech Republic. https://t.co/Y2CUloN3h4",
  "data/tweet-nytimes/2021/7/1420022289911910414.json": "Breaking News: The CDC will recommend that some vaccinated people resume wearing masks indoors under certain circumstances, in a sharp turnabout from the agency’s position since May. https://t.co/YDDcj0rZ3y",
  "data/tweet-nytimes/2021/7/1419997356632809474.json": "Simone Biles pulled out of the women's gymnastics team final at the Tokyo Olympics. \"Simone has withdrawn from the team final competition due to a medical issue,\" USA Gymnastics said.\n\nThe competition is now on its last rotation. Follow live updates: https://t.co/UBqRy9kkYQ https://t.co/0XUYDFqRR0",
  "data/tweet-nytimes/2021/7/1419764512476090376.json": "The Biden administration said this month that it would begin allowing foreign-born veterans who were deported to return to the U.S. and help them become American citizens. https://t.co/pndRHYY0Yq",
  "data/tweet-nytimes/2021/7/1420040670845227009.json": "Breaking News: Simone Biles said she withdrew from the women’s gymnastics team final because she wasn’t in a good place mentally to compete after so much pressure to win. It is not clear whether she will compete in her individual events. https://t.co/J5fiOBxeYu",
  "data/tweet-nytimes/2021/7/1420050265869328390.json": "Simone Biles left the women’s gymnastics final because she was afraid she would be injured if she continued in a rattled state of mind, she said. Even before the event, she said she began “fighting all of those demons,” and couldn’t hold them back. https://t.co/Src7Djwe7U https://t.co/VhLDemfRKA",
  "data/tweet-nytimes/2021/7/1420042553945112579.json": "Representative Liz Cheney, one of just two House Republicans willing to serve on the #January6thCommission, focused her opening remarks on Donald Trump’s role, urging lawmakers to find out “what happened every minute of that day in the White House.” https://t.co/VZ8sdv3T7q",
  "data/tweet-nytimes/2021/7/1420051388550328330.json": "In Opinion\n\n“America was attacked, and we deserve to know why and how it happened,\" writes Representative Adam Kinzinger, one of two House Republicans serving on the #January6thCommission, in a guest essay. https://t.co/MOxNNj63BN",
  "data/tweet-nytimes/2021/7/1419700516838313994.json": "Pfizer and Moderna are expanding the size of their Covid vaccine studies in children ages 5 to 11 at the urging of the FDA — a precautionary measure designed to detect rare side effects. https://t.co/JmhvFZYIFV",
  "data/tweet-nytimes/2021/7/1420070240390680579.json": "In Opinion\n\nSimone Biles “is dismantling unhealthy notions of what it takes to succeed and how a female champion is allowed to look,” @lindsaycrouse writes. “On the mat and off, she is redefining female power in sports.” https://t.co/jPreiTrrOj",
  "data/tweet-nytimes/2021/7/1420090709370101769.json": "In excruciating detail, four police officers who defended the Capitol during the Jan. 6 riot testified to the #January6thCommission about the violence, racism and hostility they suffered. https://t.co/5sIQqmwPbi https://t.co/o80dbKiWHf",
  "data/tweet-nytimes/2021/7/1420107989936181248.json": "Watch two House Republicans, Representatives Liz Cheney and Adam Kinzinger, speak out against members of their party during the first hearing of the House select committee investigating the Jan. 6 Capitol riot. https://t.co/GkQjCAS49W https://t.co/qZUTxkImqz",
  "data/tweet-nytimes/2021/7/1420107071966547975.json": "Breaking News: Vaccinated people should resume wearing masks in schools and in public indoor spaces in parts of the U.S. where the coronavirus is surging, the CDC recommended on Tuesday, a sharp turnabout from its advice just two months ago. https://t.co/KM17sV5IP3",
  "data/tweet-nytimes/2021/7/1420114278816886785.json": "The Washington Post will require all employees to show proof that they are vaccinated against the coronavirus as a condition of employment, starting when workers return to the office in September, the newspaper’s publisher said on Tuesday. https://t.co/QBEpEqGH0e",
  "data/tweet-nytimes/2021/7/1420123354477043713.json": "Breaking News: The Biden administration is considering requiring all federal employees to get Covid vaccines or submit to regular testing and other requirements. https://t.co/5pHg89bBjF",
  "data/tweet-nytimes/2021/7/1420053898954424328.json": "Following Naomi Osaka's loss on Tuesday, many of the online comments in Japan referred disparagingly to her mental health. Some questioned her identity or right to represent Japan, exposing some of the nation’s racist impulses. https://t.co/ifXO1DdNtj",
  "data/tweet-nytimes/2021/7/1420139463532032001.json": "\"Telling the truth shouldn’t be hard\": Four officers who defended the Capitol during the Jan. 6 riot testified to lawmakers on Tuesday, describing in excruciating detail the traumatic events they witnessed. https://t.co/gdbrFxhM9n https://t.co/Rr40gXRw4C",
  "data/tweet-nytimes/2021/7/1420142219240124422.json": "The White House has instructed staff to begin wearing masks again indoors, after the CDC said on Tuesday that people vaccinated against Covid-19 should resume wearing masks in public indoor spaces in parts of the country where the virus is surging. https://t.co/sOZcBTpRko",
  "data/tweet-nytimes/2021/7/1420099185748201483.json": "A one-of-a-kind album by the Wu-Tang Clan, which Martin Shkreli paid $2 million for at auction, has been sold by the U.S. to cover the debt that the disgraced pharmaceutical executive owed the government. https://t.co/2Togwkqmuw",
  "data/tweet-nytimes/2021/7/1420183502461542403.json": "In Opinion\n\nSimone Biles “is dismantling unhealthy notions of what it takes to succeed and how a female champion is allowed to look,” @lindsaycrouse writes. “On the mat and off, she is redefining female power in sports.” https://t.co/wdYLD8hzI2",
  "data/tweet-nytimes/2021/7/1420128911984312324.json": "A swastika was found in one of the State Department building’s elevators, Secretary of State Antony Blinken said on Tuesday.\n\n\"Anti-Semitism is not a relic of the past. It has no place in the U.S., at the State Department or anywhere else,\" he said. https://t.co/Gn8vjukZWf",
  "data/tweet-nytimes/2021/7/1420222907507253254.json": "History made. Katie Ledecky 🇺🇸, winner of the first women’s 1,500-meter freestyle in Olympic history. #Tokyo2020 https://t.co/JgtZ1gB7fP",
  "data/tweet-nytimes/2021/7/1420227535330287617.json": "Katie Ledecky 🇺🇸, the world’s best distance swimmer, dominated the new Olympic women’s race. She swam 1,500 meters in 15:37.34. https://t.co/avpSyZKL0n https://t.co/l8B3AYpemp",
  "data/tweet-nytimes/2021/7/1420179738967040003.json": "With the Russian team leading by more than a point and Simone Biles suddenly withdrawn from competition, the U.S. women's gymnastics team's medal hopes at #Tokyo2020 rested on Suni Lee.\n\nIt was, she said, \"the most pressure I’ve ever felt in my life.\" https://t.co/9S0gzMoQUp https://t.co/aUGiKZR94e",
  "data/tweet-nytimes/2021/7/1420268795260817412.json": "Breaking News: Simone Biles will not compete in the all-around gymnastics competition after withdrawing from the team finals because of a mental health issue. https://t.co/9ECuI5KdKr",
  "data/tweet-nytimes/2021/7/1420078386001625098.json": "The pandemic changed life for everyone, but in different ways. Data from the American Time Use Survey — which every year asks thousands of people to track every minute of a single day — reflects how Covid-19 led to a sudden rupture of daily life. \nhttps://t.co/nXLVfKo2tn",
  "data/tweet-nytimes/2021/7/1420200290448560129.json": "LL Cool J, Elvis Costello, Andrea Bocelli, Carlos Santana and the New York Philharmonic will join Bruce Springsteen and others at the Central Park concert New York City is planning, Mayor Bill de Blasio said Tuesday. Proof of vaccination will be required. https://t.co/2NmwiyMuKQ",
  "data/tweet-nytimes/2021/7/1420157311566323713.json": "Simone Biles lost her way midair while vaulting in the women's gymnastics team final at #Tokyo2020 on Tuesday, later explaining that she'd been struggling with the pressure placed on her and wasn't in a good place to compete.\n\nHere's what happened. https://t.co/PGTe9YQBbx",
  "data/tweet-nytimes/2021/7/1420343295717355522.json": "Simone Biles, after withdrawing from two Olympic events because of a mental health issue, has joined a growing group of elite athletes who have rejected a long tradition of stoicism. https://t.co/jKUOpDpkby",
  "data/tweet-nytimes/2021/7/1420330708640337924.json": "A police officer in Aurora, Colorado, was charged with felony assault after using his gun to beat an unarmed man and choking him during an arrest captured by body cameras, the city’s police chief announced.\n\n“This is not police work,” she angrily said. https://t.co/S8Os8lCnCd",
  "data/tweet-nytimes/2021/7/1420217476281950209.json": "President Biden is considering requiring all civilian federal employees to be vaccinated against the coronavirus or be forced to submit to regular testing, social distancing, mask requirements and restrictions on most travel, officials said on Tuesday. https://t.co/6TApkfuRMF",
  "data/tweet-nytimes/2021/7/1420242649324441600.json": "Two of America’s largest reservoirs, Lake Powell and Lake Mead, have reached record lows as the U.S. West experiences what scientists are calling a \"megadrought.\" https://t.co/E8HSLMyTUo",
  "data/tweet-nytimes/2021/7/1420345808336171014.json": "History made. \n\nKatie Ledecky 🇺🇸, winner of the first Olympic women’s 1,500-meter freestyle. #Tokyo2020 https://t.co/CiQQ4ETddi",
  "data/tweet-nytimes/2021/7/1420164607998627848.json": "A former babysitter who served a few months in jail for shaking a 5-month-old boy so forcefully 37 years ago that he suffered permanent brain damage now faces a possible life sentence after his death from those injuries in 2019, at age 35. https://t.co/4mwO73G2tm",
  "data/tweet-nytimes/2021/7/1420408723617591297.json": "Simone Biles’s withdrawal from Olympic events reflects a cultural shift, as some athletes put mental health above an appearance of invincibility. https://t.co/6yr4lGGeLn",
  "data/tweet-nytimes/2021/7/1420111832644263940.json": "He was a retired New York City cop, a decorated member of the force for 20 years. Now he finds himself on the other side of the law: He’s accused of attacking a Capitol police officer on Jan. 6. https://t.co/pAS1OkDkbo",
  "data/tweet-nytimes/2021/7/1420440534108315652.json": "Breaking News: President Biden is expected to announce that all civilian federal employees must be vaccinated against the coronavirus or submit to regular testing and other safety restrictions. https://t.co/GBm9bZSa8P",
  "data/tweet-nytimes/2021/7/1420381787503611912.json": "Breaking News: The U.S. women’s three-on-three basketball team won a gold medal in the sport’s Olympic debut, defeating the Russian team, 18-15. https://t.co/Th0jFHOowf",
  "data/tweet-nytimes/2021/7/1420454043802079233.json": "“Arthur,” the beloved children’s show on PBS, is coming to a close after 25 years. The show’s final season will air in the winter of 2022. https://t.co/DqYAqNaMa3",
  "data/tweet-nytimes/2021/7/1420272831972192259.json": "Katie Ledecky 🇺🇸 had just over an hour to recover from the biggest disappointment of her Olympic career, a fifth-place finish in the 200-meter freestyle.\n\nShe did it in style, taking gold in the 1,500-meter freestyle. https://t.co/6TDnpaxBwR",
  "data/tweet-nytimes/2021/7/1420321122873233409.json": "Katie Ledecky 🇺🇸, the world’s best distance swimmer, dominated the new Olympic women’s race. She swam 1,500 meters in 15:37.34. https://t.co/l94UYONMqh https://t.co/VZHdtE4zEL",
  "data/tweet-nytimes/2021/7/1420433922152935429.json": "The CDC now advises that vaccinated people be tested for the coronavirus if they come into contact with someone with Covid-19, even if they have no symptoms. Previously, it only recommended vaccinated people get tested if they were experiencing symptoms. https://t.co/IMhxLK7pH9",
  "data/tweet-nytimes/2021/7/1420529523490279424.json": "Bob Odenkirk, the star of the AMC series “Better Call Saul,” was said to be in stable condition on Wednesday evening after suffering what his representatives said was “a heart-related incident.”\nhttps://t.co/Upy1gI5Gu0",
  "data/tweet-nytimes/2021/7/1420560900508033028.json": "Bobby Finke of the U.S. 🇺🇸 just won the first men’s 800-meter freestyle at the Olympics. He just bided his time, and then caught and passed the rest of the leaders in the #Tokyo2020 race. https://t.co/MF7M0eF14X",
  "data/tweet-nytimes/2021/7/1420552166490755073.json": "The history of women's gymnastics is full of stories of athletes who sustained life-altering injuries after being pressured to compete when they didn't feel up to it. https://t.co/4UJRXIQgr6",
  "data/tweet-nytimes/2021/7/1420537089255428098.json": "Dusty Hill, the quiet, bearded bass player who made up one third of ZZ Top, one of the best-selling rock bands of the 1980s, died at 72. https://t.co/r2A0DEjJTQ",
  "data/tweet-nytimes/2021/7/1420581123629924352.json": "Simone Biles wrote in a tweet that the reaction to her decision to withdraw from the team competition earlier this week has helped her realize that there’s more to life than competing and winning medals. https://t.co/I29mQFwPbO",
  "data/tweet-nytimes/2021/7/1420575777582632963.json": "Caeleb Dressel of the U.S. 🇺🇸 just won the men’s 100-meter freestyle, and his first individual medal. https://t.co/laFUyhel7l",
  "data/tweet-nytimes/2021/7/1420431007807856651.json": "Google will require employees who return to the company’s offices to be vaccinated against the coronavirus. It also said it would push back its official return-to-office date to mid-October from September, as the Delta variant sweeps through the U.S. https://t.co/9fR09U1abl",
  "data/tweet-nytimes/2021/7/1420534643124748291.json": "Two NYPD officers were fired this year after engaging in “shocking professional and sexual misconduct” with a 15-year-old girl from one of the department’s youth programs, a disciplinary trial judge wrote. They have not been criminally charged. https://t.co/cEy3pzvel0",
  "data/tweet-nytimes/2021/7/1420596734791667713.json": "China 🇨🇳 set a world record to win the women’s 4x200 free relay, shocking an Australian 🇦🇺 team that was expected to win but finished third. The U.S. 🇺🇸, anchored by Katie Ledecky, won the silver. https://t.co/HZq6j2XfDh",
  "data/tweet-nytimes/2021/7/1420587403216101376.json": "President Biden will formally announce on Thursday that all civilian federal employees must be vaccinated against the coronavirus or be forced to submit to regular testing, social distancing, mask requirements and restrictions on most travel. https://t.co/2suHmxADR0",
  "data/tweet-nytimes/2021/7/1420678026002640898.json": "Simone Biles, by saying “no,” bowing out this week, and standing up for her well-being in a sports world that commodifies athletes and prizes winning at all costs, has surpassed all of her gymnastics achievements in importance, @kurtstreeter writes. https://t.co/1TH3scZDxH",
  "data/tweet-nytimes/2021/7/1420732956809834499.json": "Breaking News: Sunisa Lee of the U.S. has won the women's Olympic all-around gymnastics gold, hitting routine after routine at the most important competition of her life. Rebeca Andrade of Brazil wins silver and Angelina Melnikova of Russia takes bronze. https://t.co/9mFjG6nRYM",
  "data/tweet-nytimes/2021/7/1420597462079782912.json": "Starting Friday, Disney World in Florida will require guests older than 2 to wear masks in indoor spaces, reversing its policy that allowed fully vaccinated guests to go without them.\nhttps://t.co/rScq02FMEr",
  "data/tweet-nytimes/2021/7/1420746706187022338.json": "Sunisa Lee, a Hmong American teenager from Minnesota who trained every day through grueling practices and painful injuries, won the women's gymnastics all-around gold medal on Thursday. https://t.co/V4qriK9qL1 https://t.co/nSFgL2woVW",
  "data/tweet-nytimes/2021/7/1420737154356023297.json": "Sunisa Lee of the U.S. has won the gold medal in the women's gymnastics all-around at #Tokyo2020. https://t.co/j1Kp5LDHbu https://t.co/hIJqrEvjzy",
  "data/tweet-nytimes/2021/7/1420662926730530819.json": "To celebrate Louis Vuitton’s 200th birthday, the windows of the brand’s stores will be filled with trunks, the pieces that Vuitton founded his company on, designed by 200 people. Contributors include BTS, Drake and Gloria Steinem. https://t.co/7A4Xh9TYZi",
  "data/tweet-nytimes/2021/7/1420738404564746244.json": "The U.S.'s Sunisa Lee, 18, just won the women’s all-around gymnastics gold at the #Tokyo2020 Olympics. \n\nTo understand what makes Lee so good, we spent time with her in Minnesota as she prepared for her Olympic debut. https://t.co/nGKyC8PhuN",
  "data/tweet-nytimes/2021/7/1420745185110106120.json": "As the U.S. and the world watched, Sunisa Lee won the gold medal in the #Tokyo2020 individual women's all-around gymnastics competition. Here's a close look — move by move — at how she did it. https://t.co/IAlitdgqnd",
  "data/tweet-nytimes/2021/7/1420784969333497865.json": "Rebeca Andrade of Brazil did not know if she would even qualify for #Tokyo2020. When the 22-year-old gymnast won silver in the all-around on Thursday, she became the first Brazilian to win any Olympic medal in women’s gymnastics. https://t.co/shdVZEByBh https://t.co/2kzl5oqE36",
  "data/tweet-nytimes/2021/7/1420757281168187409.json": "As droughts continue and water temperatures climb, salmon in parts of Oregon and California are developing health issues. \"Imagine the heat that we’re feeling. They’re feeling it 10 times worse in that river. They’re suffocating.” https://t.co/ECiRtm6aWP https://t.co/mwtrAdmClT",
  "data/tweet-nytimes/2021/7/1420835750728421383.json": "Breaking News: Theodore McCarrick, the former archbishop of Washington expelled by Pope Francis, was charged with sexually assaulting a 16-year old boy in 1974. It's the first time such a high-ranking Catholic official has faced criminal charges. https://t.co/dr8IBcSKB1",
  "data/tweet-nytimes/2021/7/1420655357895057408.json": "A smartphone app launched by the French government gives $350 to 18-year-olds for cultural purchases like books, music and performance tickets. Many are spending it on manga. https://t.co/KuMiFJHLhc",
  "data/tweet-nytimes/2021/7/1420879343312674817.json": "Breaking News: The CDC is expected to release data showing that vaccinated people may transmit the Delta variant, a finding that prompted its new masking advice. https://t.co/d4sbdnqVwR",
  "data/tweet-nytimes/2021/7/1420919997161951233.json": "Breaking News: Military members will be subject to the same Covid-19 vaccination rules that President Biden outlined for civilian federal workers, the Pentagon said. https://t.co/ka3AVqXkPi",
  "data/tweet-nytimes/2021/7/1420749732066979844.json": "Disney World will require guests older than 2 to wear masks in indoor spaces starting Friday. The policy reversal follows a surge in local cases and a new mask recommendation from the CDC. https://t.co/vukxrV9ZEf",
  "data/tweet-nytimes/2021/7/1420940251460079616.json": "Sunisa Lee, a Hmong American teenager from Minnesota, won the gold medal in the #Tokyo2020 individual women's all-around gymnastics competition. Rebeca Andrade of Brazil won silver and Angelina Melnikova of Russia took bronze. https://t.co/HvU4RZO7MD https://t.co/ztpDsh98tg",
  "data/tweet-nytimes/2021/7/1420927980637802504.json": "🇿🇦 Tatjana Schoenmaker broke the world record in the women’s 200-meter breaststroke to win the gold at #Tokyo2020.\n🇺🇸 Lilly King took silver and 🇺🇸 Annie Lazor took bronze. https://t.co/UqtR8TPzCW https://t.co/9FJHwMi7C4",
  "data/tweet-nytimes/2021/7/1420972977005412354.json": "Breaking News: The Delta variant is as contagious as chickenpox and may be spread by vaccinated people as easily as the unvaccinated, an internal C.D.C. report said.\nhttps://t.co/hDs1FOIPMt",
  "data/tweet-nytimes/2021/7/1420911015076696069.json": "Sunisa Lee 🇺🇸 was impressive on the uneven bars in the women's gymnastics all-around at #Tokyo2020. Her routine is the hardest in the world, and earned her the best score of her group — 15.3. https://t.co/VAaKFc58qx https://t.co/u4111e8Ylm",
  "data/tweet-nytimes/2021/7/1420798824667389959.json": "Most countries are eager for Olympic glory. But China is so obsessed with winning gold that tens of thousands of children in government-run training schools are pushed from a young age to win at niche sports in hopes of dominating the top podium spots. https://t.co/rYDEN8cyFB",
  "data/tweet-nytimes/2021/7/1421057997497843714.json": "The Delta variant is as contagious as chickenpox and may be spread by vaccinated people as easily as the unvaccinated, according to an internal CDC report. The immediate next step for the agency is to “acknowledge the war has changed,” it said. https://t.co/dt91Uv4MXH",
  "data/tweet-nytimes/2021/7/1421108874128547846.json": "Breaking News: Broadway theaters will require audiences to be vaccinated and wear masks when they reopen. Children under 12 must show a negative test. https://t.co/zP37bpL0td",
  "data/tweet-nytimes/2021/7/1421103304361316357.json": "An San of South Korea won her third gold medal on Friday, taking first place in the women’s individual archery competition at #Tokyo2020. But some social media users have been attacking her — for her short haircut. https://t.co/5Hc7AHpxxT",
  "data/tweet-nytimes/2021/7/1420987570494783489.json": "Albert Bandura, a psychologist whose landmark studies transformed the field, died at 95. His most famous experiments, involving children's aggression towards an inflatable Bobo the clown doll, challenged basic tenets of classical behaviorism. https://t.co/jmckqZ0d7V",
  "data/tweet-nytimes/2021/7/1421131047572492288.json": "Breaking News: Donald Trump pressed Justice Department officials in December to say the 2020 election was corrupt to help him try to overturn the results, documents show. https://t.co/aAiX7Xhr1t",
  "data/tweet-nytimes/2021/7/1420888204719403013.json": "Sunisa Lee won the gold medal in the individual all-around gymnastics competition, continuing a U.S victory streak that began when Carly Patterson earned the title in 2004.\nhttps://t.co/5FGblt78yl",
  "data/tweet-nytimes/2021/7/1420806374699806721.json": "Many U.S. employees are unlikely to take a \"sad day\" for their mental health or are scared of being punished for doing so. If you’re among the hesitant, experts say it’s time to start thinking about how to protect your well-being. https://t.co/DonkHPMIX1",
  "data/tweet-nytimes/2021/7/1421089474780483592.json": "In Opinion\n\n\"Many South Korean women refuse to return to antiquated ideals of unquestioning, uncomplaining mothers and caregivers,\" says Hawon Jung, a writer, in a guest essay. \"Our feminist awakening has given us the language to redefine our lives.\" https://t.co/qZOh9Vi3Ea",
  "data/tweet-nytimes/2021/7/1421163096224280579.json": "Breaking News: Vaccinated people with breakthrough infections of the Delta variant may spread the virus to others just as easily as unvaccinated people, the CDC reported. Infections in vaccinated people are thought to be comparatively rare. https://t.co/ffJ4gIDgRw",
  "data/tweet-nytimes/2021/7/1420791247111872517.json": "In Opinion\n\n\"When George Washington wanted to protect his soldiers from smallpox, he made vaccinations mandatory,\" writes @ezraklein. \"It worked.\" https://t.co/xoK1KqfqYx",
  "data/tweet-nytimes/2021/7/1421173235467620354.json": "Breaking News: Donald Trump’s tax returns must be turned over to congressional investigators, the Justice Department said, paving the way for the end of a yearslong fight. https://t.co/pS4ajpkaqp",
  "data/tweet-nytimes/2021/7/1421195166879260683.json": "Some people who once rejected the coronavirus vaccine or simply waited too long are speaking from hospital beds, at funerals and in obituaries about their regrets. https://t.co/1ipcN3PiNK",
  "data/tweet-nytimes/2021/7/1421136028220411907.json": "Snoop Dogg smoked an enormous blunt while discussing his own cultural relevance and the persistent racism in the business world with our Corner Office columnist, @dgelles. “I just try to do me,” Snoop said. https://t.co/IVmioo971u",
  "data/tweet-nytimes/2021/7/1421085692663418880.json": "Sunisa Lee became the fifth consecutive American woman to win the title of best all-around gymnast in the world on Thursday.\n\nHer #Tokyo2020 victory resonated back home in Minnesota, particularly with its Hmong American community, in which she was raised. https://t.co/SQNnic1P9d https://t.co/xfZxD38G6V",
  "data/tweet-nytimes/2021/7/1421198966687993863.json": "The U.S. women’s soccer team beat the Netherlands in a penalty shootout, advancing to the semifinals on Friday. See more photos from #Tokyo2020. https://t.co/KieJyuIxKr https://t.co/3tv1xN8rP4",
  "data/tweet-nytimes/2021/7/1421174394412486665.json": "Celebrities who cross genres can risk diluting their brand. Snoop Dogg — who can be in the new Addams Family movie, on a Corona commercial, on VH1 with Martha Stewart, run an investment fund and still release new music — is not one of them. https://t.co/CP4oJpyA3f https://t.co/6CoKLOskHQ",
  "data/tweet-nytimes/2021/7/1421289137605419011.json": "Katie Ledecky of the U.S. won gold in the women’s 800-meter freestyle, her final race of #Tokyo2020. It is an event she has dominated her entire career. https://t.co/0ygoruS885",
  "data/tweet-nytimes/2021/7/1421283638788952065.json": "Caeleb Dressel of the U.S. won his third gold medal, cementing his status as a breakout star of #Tokyo2020. https://t.co/uWnHZHsnfu",
  "data/tweet-nytimes/2021/7/1421307147288256515.json": "In Opinion\n\n\"Anyone suffering from anxiety deserves compassion and love, rather than cruelty and judgment,\" writes Jennifer Finney Boylan in a guest essay. https://t.co/RNzJ0V7jYY",
  "data/tweet-nytimes/2021/7/1421214030597918727.json": "“I read all kinds of things about the vaccine and it scared me,\" Mindy Greene said. \n\nShe and her husband, the father to their four children, thought they'd be OK without it. Now he's on a ventilator, hospitalized with complications from Covid-19. https://t.co/fdZMSx1ylj https://t.co/sni4lhXtfR",
  "data/tweet-nytimes/2021/7/1421312180583084032.json": "Walmart and Disney join a growing group of businesses requiring vaccination. https://t.co/gvURJeyV0p",
  "data/tweet-nytimes/2021/7/1421339856710537219.json": "A third of white-tailed deer tested in four states during a federal study had been exposed to the coronavirus. The percentage was highest in Michigan, where 60% of the animals tested positive for antibodies. https://t.co/rVffbvGzqh",
  "data/tweet-nytimes/2021/7/1421409056607059973.json": "The body of Danish Siddiqui, a Pulitzer Prize-winning Reuters photojournalist who was killed in southern Afghanistan, was badly mutilated while in the custody of the Taliban, officials said. https://t.co/c1fbHwYyBw",
  "data/tweet-nytimes/2021/7/1421455819867033609.json": "Breaking news: Elaine Thompson-Herah of Jamaica wins 🥇the 100-meter dash. Jamaica swept the race with Shelly-Ann Fraser-Pryce in second and Shericka Jackson in third. https://t.co/emjBdJbH6N",
  "data/tweet-nytimes/2021/7/1421459392331927554.json": "Elaine Thompson-Herah of Jamaica broke the Olympic record in the women’s 100-meter dash, defending her gold from Rio. She ran the race in 10.61 seconds #Tokyo2020 https://t.co/DdKaJKRMVW https://t.co/tWFZ9MRUyC",
  "data/tweet-nytimes/2021/7/1421468213494300674.json": "Elaine Thompson-Herah is the fastest woman in the world #Tokyo2020 https://t.co/bti78Fx2h3 https://t.co/KM1LitsFLQ",
  "data/tweet-nytimes/2021/7/1421433374510616577.json": "What’s the difference between running the 100 meters, the 800 meters and running a marathon? We invited three elite runners to run on the world’s fastest treadmill to find out. https://t.co/qKCDvtPHkI https://t.co/vlEMjbeAxH",
  "data/tweet-nytimes/2021/7/1421274451316985864.json": "Kahlil Greene was elected as Yale’s first Black student body president in 2019, when he was a sophomore. Off-campus, he is known to his more than 447,000 TikTok followers as a self-described “Gen-Z historian.” https://t.co/0uzghe8AxZ",
  "data/tweet-nytimes/2021/7/1421500929090768898.json": "During introductions for the team épée competition, three U.S. fencers wore pink masks in an effort to protest the presence of a teammate who has been accused of sexual misconduct.\nhttps://t.co/PuMwh1W7wc",
  "data/tweet-nytimes/2021/7/1421514756943384578.json": "Months after the violent attack on the Capitol, Republicans have mounted a new effort to rewrite history, painting the accused rioters as patriotic “political prisoners” and blaming House Speaker Nancy Pelosi for the violence. https://t.co/JOaklTLczD",
  "data/tweet-nytimes/2021/7/1421300845568790533.json": "Caeleb Dressel of the U.S. won his third gold medal in #Tokyo2020, beating his own world record in the 100-meter butterfly. https://t.co/xaBVwh3Z8s https://t.co/QQr2kSaXde",
  "data/tweet-nytimes/2021/7/1421580208482799617.json": "At least 233 staff members at two major San Francisco hospitals, most of them fully vaccinated, tested positive for the coronavirus. Most, according to a hospital official, involved the Delta variant. https://t.co/MA5vviDq89",
  "data/tweet-nytimes/2021/7/1421489603324829702.json": "Over six decades, Johnny Ventura, a.k.a. “the Elvis of Merengue” or “the Black Horse,” released more than 100 albums and won six Latin Grammys, including a lifetime achievement award, in 2006. He died at 81. https://t.co/qRULCyo2Dq",
  "data/tweet-nytimes/2021/7/1421568873384615938.json": "Provincetown thought it was safe to return to prepandemic partying. It wasn’t. \n\nThe quirky beach community at the tip of Cape Cod has taught the U.S. a sobering lesson: vaccinated people can spread the virus. https://t.co/RdGkWfpgq6"
}