{
  "data/tweet-nytimes/2022/6/1531807477095972866.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/fCeia4GPZo",
  "data/tweet-nytimes/2022/6/1531790145955020806.json": "Rafael Nadal beat Novak Djokovic in four sets to reach the French Open semifinals in a thrilling addition to their long rivalry. https://t.co/qgwhrhBA8X",
  "data/tweet-nytimes/2022/6/1531788134341541889.json": "In Opinion\n\n\"America’s goal is straightforward,\" President Biden writes in a guest essay. \"We want to see a democratic, independent, sovereign and prosperous Ukraine with the means to deter and defend itself against further aggression.\" https://t.co/c2AM54y140",
  "data/tweet-nytimes/2022/6/1531832958994227201.json": "The Russian military, demoralized after three months of war, is still facing morale and other problems, seven weeks after the Kremlin sent a new commander to oversee a refocused invasion, American officials say. https://t.co/WICddQYBem",
  "data/tweet-nytimes/2022/6/1531945422129926145.json": "Sarah Palin lost her bid for a new trial in her libel case against The New York Times. A judge ruled that she had failed to produce “even a speck” of evidence to prove the newspaper had defamed her in a 2017 editorial. https://t.co/4Jx0iqVPHE",
  "data/tweet-nytimes/2022/6/1531893389314121729.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/wTtbsQd3X4",
  "data/tweet-nytimes/2022/6/1532044326733328384.json": "Elon Musk told SpaceX and Tesla employees that they were required to “spend a minimum of 40 hours in the office per week.” Those who did not do so would be fired, he wrote in a memo. https://t.co/eOwVV5UIGp https://t.co/pHzcnIDHm1",
  "data/tweet-nytimes/2022/6/1532021676677922818.json": "The Russian journalist Dmitri Muratov — whose paper suspended publication in late March, saying Russia’s press laws made it impossible to truthfully cover the war in Ukraine — will be auctioning his Nobel Peace Prize medal to benefit Ukrainian refugees. https://t.co/VZCVkZxmz1",
  "data/tweet-nytimes/2022/6/1532055902555099138.json": "Breaking News: The verdict in the Johnny Depp-Amber Heard trial is expected to be announced soon. Follow our live coverage. https://t.co/p4jBMSQyXF",
  "data/tweet-nytimes/2022/6/1532059477066731520.json": "After winning the Nobel Peace Prize, the journalist Dmitri Muratov said he thought the honor should have gone to a different Russian: the jailed opposition leader Aleksei Navalny. Now, he will auction it to help children who are refugees from Ukraine.\nhttps://t.co/JMgo2mtnNm https://t.co/FtdmydqjwK",
  "data/tweet-nytimes/2022/6/1532086163078631436.json": "Breaking News: A jury found Johnny Depp was defamed by his ex-wife, Amber Heard, in a Washington Post essay in which she described herself as a “public figure representing domestic abuse.” Heard was defamed by one of Depp’s lawyers, the jury found. https://t.co/0hFmUqNVCF",
  "data/tweet-nytimes/2022/6/1532097935563005952.json": "A jury found that Johnny Depp was defamed by Amber Heard when she described herself in a Washington Post essay as a “public figure representing domestic abuse,” but also found that she had been defamed by one of his lawyers. Read the latest: https://t.co/Ri0SE1vBiT https://t.co/2G4m0iPIYP",
  "data/tweet-nytimes/2022/6/1532103478369300484.json": "Johnny Depp said the jury “gave me my life back.” Amber Heard said she’s “heartbroken.”\n\nGet the latest following the verdict, in which a jury found that Depp was defamed by Heard but also that she'd been defamed by one of his lawyers. https://t.co/vumYhF2P3M https://t.co/3rOeNa2KY8",
  "data/tweet-nytimes/2022/6/1532088674317484034.json": "Breaking News: Sheryl Sandberg, the chief operating officer of Meta and the second in command to Mark Zuckerberg, said she was stepping down after 14 years. https://t.co/XlAL6zpeWe",
  "data/tweet-nytimes/2022/6/1532134961339412480.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/zfs5ayvggf https://t.co/IIWD3S54gl",
  "data/tweet-nytimes/2022/6/1532093536631496709.json": "Breaking News: The man accused of the racist shooting at a Buffalo supermarket that left 10 Black residents dead was charged with a 25-count indictment, including murder charges as hate crimes and domestic terrorism. https://t.co/xGqoFpC7Jj",
  "data/tweet-nytimes/2022/6/1532140570461851648.json": "Breaking News: Multiple people were shot and some were killed at a medical building in Tulsa, Oklahoma, the police said. The gunman is also dead. https://t.co/FdK5vhHOFS",
  "data/tweet-nytimes/2022/6/1532150130241044481.json": "Breaking News: In its largest student loan forgiveness action ever, the U.S. Education Dept. will cancel $5.8 billion owed by students of Corinthian Colleges. https://t.co/S5MKUs6KIB",
  "data/tweet-nytimes/2022/6/1531995262935355392.json": "A woman who approached a bison at Yellowstone National Park was gored by the animal on Monday, according to park officials. Her condition was not released, and it was unclear whether she had survived. https://t.co/bHlV2l41zW",
  "data/tweet-nytimes/2022/6/1532202883818704896.json": "Beto O’Rourke renewed his criticism of Gov. Greg Abbott over gun laws in Texas. “Not only did he not take action to save the lives of our kids,” O’Rourke said, “he took action to make it more certain that we would lose the lives of our kids.” https://t.co/RpkYJgQyAR",
  "data/tweet-nytimes/2022/6/1532197837894823941.json": "The Ukrainian national soccer team defeated Scotland, 3-1, on Wednesday, bringing Ukraine within reach of its second World Cup appearance. https://t.co/VNwVAQI0Wq",
  "data/tweet-nytimes/2022/6/1532195311300620294.json": "For six weeks, the defamation case that the actor Johnny Depp filed against his ex-wife Amber Heard offered a rare instance of high-profile #MeToo charges and countercharges being hashed out in the public spotlight of a courtroom. https://t.co/ItJXGvuXZ0",
  "data/tweet-nytimes/2022/6/1532124854899572736.json": "A 150-mile leisurely bike ride from Trieste, Italy, through Slovenia, to the ancient city of Pula, Croatia, brims with ancient traditions, sublime food and perched-village photo ops. https://t.co/jOeFDUHQX5 https://t.co/9sX6biHURi",
  "data/tweet-nytimes/2022/6/1532014220425961473.json": "In Opinion\n\n“I thought Vladimir Putin had invaded Ukraine. I was wrong. Putin had invaded Europe,” Thomas Friedman writes. “He shouldn’t have done that. This could be the biggest act of folly in a European war since Hitler invaded Russia in 1941.”\nhttps://t.co/mjvMBuMOeU",
  "data/tweet-nytimes/2022/6/1532255733387083782.json": "Queen Elizabeth II is celebrating 70 years on the British throne — her Platinum Jubilee. \n\nThe festivities will begin with a military parade, a flyover, a gun salute and the royal family’s appearance on the balcony of Buckingham Palace. Follow along live. https://t.co/7V2qH8J3Kg",
  "data/tweet-nytimes/2022/6/1532301015009177603.json": "Breaking News: Doctors successfully transplanted a 3-D printed ear made of living human cells, a major milestone in bioengineering. https://t.co/CdeAdCdoUx",
  "data/tweet-nytimes/2022/6/1532289697883496449.json": "The Ukrainian national soccer team defeated Scotland, 3-1, on Wednesday, bringing Ukraine within reach of its second World Cup appearance. https://t.co/Zt4c9G7CkA https://t.co/8h8ga5yjfz",
  "data/tweet-nytimes/2022/6/1532229292192681984.json": "The Natalie Medical Building, where a gunman opened fire and killed four people, is part of the campus of the Saint Francis Hospital in Tulsa.\n\nIt is home to ambulatory and breast cancer surgery centers, the hospital’s website says. https://t.co/oLv04nJ5M6",
  "data/tweet-nytimes/2022/6/1532275862892167168.json": "Queen Elizabeth II's seven decades on the throne: in photos. 👑\n\nHer long reign has made her a witness to cultural upheavals from the Beatles to Brexit, and political leaders from Winston Churchill to Boris Johnson. #PlatinumJubilee https://t.co/tIXJDxjXrm https://t.co/moYZNbyFPu",
  "data/tweet-nytimes/2022/6/1532311849160560645.json": "Prince George, Prince Louis and Princess Charlotte waved from the lead carriage during the Trooping the Color parade.\n\nQueen Elizabeth II is not attending this part of the #PlatinumJubilee events, but younger royals are featuring prominently. Watch live. https://t.co/sYscQ5uVhr https://t.co/jEeluoH3KQ",
  "data/tweet-nytimes/2022/6/1532299284489674753.json": "Barack Obama paid tribute to Queen Elizabeth II in a video message in which he said they had formed their own “special relationship.”\n\nFollow live updates on the #PlatinumJubilee celebrations. https://t.co/r2LBd7leXh https://t.co/Evum96FfL7",
  "data/tweet-nytimes/2022/6/1532304674560278528.json": "Crowds erupted in applause as Prince George, Princess Charlotte, Prince Louis and other members of the British royal family rode down the Mall in carriages and on horseback.\n\nWatch Queen Elizabeth II's #PlatinumJubilee celebrations live. https://t.co/cXViIsjfM6 https://t.co/tBSsrCo2ZG",
  "data/tweet-nytimes/2022/6/1532327606410006528.json": "In what was almost certain to be the emotional highlight of the #PlatinumJubilee, Queen Elizabeth II stepped out onto the balcony of Buckingham Palace. \n\nWatch the celebrations live. https://t.co/v5whDCyP1Z https://t.co/MeY00gcqb0",
  "data/tweet-nytimes/2022/6/1532112279692509185.json": "The Biden administration said on Wednesday it would cut in half the amount it charges companies to build wind and solar projects on federal lands, a move designed to encourage development of renewable energy. https://t.co/9VwIC8h7Jc",
  "data/tweet-nytimes/2022/6/1532316180349845505.json": "Johnny Depp has been the face of Dior’s Sauvage men’s scent since 2015. The verdict is still out on whether Depp’s defamation case against Amber Heard hurt or helped sales, writes our fashion critic, Vanessa Friedman. https://t.co/UCsvuWstx9",
  "data/tweet-nytimes/2022/6/1532167637890899970.json": "Frightened students. Phone calls. Memorials and stuffed animals. From the University of Texas in 1966, to Columbine in 1999 and now Uvalde, the images of school shootings across America reveal hauntingly similar scenes. https://t.co/ofQrdQuwhG https://t.co/AwW2OJiPhP",
  "data/tweet-nytimes/2022/6/1532190287434481665.json": "They oversee the flow of billions of dollars from Putin-connected Russians to companies involved in superyachts and villas. Now they’ve drawn the attention of a U.S. task force that is trying to disrupt the Russian war machine. https://t.co/KNKQ4fUuI1",
  "data/tweet-nytimes/2022/6/1532373732567687168.json": "Prince Louis didn’t appear to enjoy the military flyover for Queen Elizabeth II’s #PlatinumJubilee. The 4-year-old is the fifth in line to the British throne.\nhttps://t.co/dby2Q541ak https://t.co/UlQRmkwFwz",
  "data/tweet-nytimes/2022/6/1532369023903666178.json": "People who drank moderate amounts of coffee, 1.5 to 3.5 cups per day, were up to 30% less likely to die during a multiple year study period than those who didn’t drink coffee, new research found. https://t.co/55ehLTgbUZ",
  "data/tweet-nytimes/2022/6/1532022940883116036.json": "In Opinion\n\n\"We are not encouraging or enabling Ukraine to strike beyond its borders,\" President Biden writes in a guest essay. \"We do not want to prolong the war just to inflict pain on Russia.\" https://t.co/xU3nGxXFtY https://t.co/Sn8BA9uzkW",
  "data/tweet-nytimes/2022/6/1532180236925812739.json": "In the final moments of her life, Eva Mireles, a teacher at Robb Elementary School, was on the phone with her husband, a school district police officer. The call was among the new details that have added to the shifting portrait of the shooting in Uvalde. https://t.co/SOpZwt6ytX",
  "data/tweet-nytimes/2022/6/1532385063198916608.json": "Breaking News: A New York appeals court upheld Harvey Weinstein’s 2020 sex-crimes conviction, raising the likelihood he'll serve most of his 23-year sentence. https://t.co/qkRorc2iWl",
  "data/tweet-nytimes/2022/6/1532350075137138689.json": "Queen Elizabeth II was joined on the Buckingham Palace balcony by four generations of Britain’s royal family for her #PlatinumJubilee.\n\nIt was a smaller group than in previous jubilee years, with Prince Andrew and Prince Harry missing from the lineup.\nhttps://t.co/p9eVu3C8DU",
  "data/tweet-nytimes/2022/6/1532392879200559105.json": "“The Wire” premiered 20 years ago, in June 2002. The creators David Simon and Ed Burns discussed why it has only become more relevant — and why it would never be made today. https://t.co/HK4DC61b3g",
  "data/tweet-nytimes/2022/6/1532319897564372996.json": "Ukraine accused Russia of forcibly deporting hundreds of thousands of Ukrainians from occupied territories. President Volodymyr Zelensky called the campaign “one of Russia’s most heinous war crimes.”\nhttps://t.co/nNReJBRSxw",
  "data/tweet-nytimes/2022/6/1532410185221799942.json": "Breaking News: The gunman who killed four people at a Tulsa medical building underwent back surgery last month and the doctor who performed it was one of the victims, police said. His weapons included an AR-15-style rifle he bought hours before the attack. https://t.co/lddrAIQxdj",
  "data/tweet-nytimes/2022/6/1531938636417073156.json": "The U.S. will send Ukraine advanced rocket systems and munitions as part of a new $700 million package of military aid intended to help Ukrainians fight back against Russia, President Biden said on Tuesday. https://t.co/Sjvc44IRsp",
  "data/tweet-nytimes/2022/6/1532431882448666625.json": "Doctors successfully transplanted a 3-D printed ear made of living human cells. The new ear, transplanted in March, will continue to regenerate cartilage tissue, giving it the look and feel of a natural ear, said the biotech company that made the implant. https://t.co/gCmmBnOsKF https://t.co/DZbke2sNUN",
  "data/tweet-nytimes/2022/6/1532205391265898496.json": "Having something to look forward to can boost your mood and lower your stress, studies suggest. Whether it's something small or large, like trying a new book or planning a trip, here are ways to incorporate the power of anticipation into everyday life. https://t.co/53fSJN7WaT",
  "data/tweet-nytimes/2022/6/1532454033667112975.json": "Breaking News: President Biden plans to travel to Saudi Arabia this month to rebuild relations in an effort to lower gas prices in the U.S. and isolate Russia. https://t.co/N2roZNSZbS",
  "data/tweet-nytimes/2022/6/1532346340201713664.json": "After he heard two loud noises he recognized as gunfire, Gannon Gill, a physician assistant, led his patient to safety at the Tulsa medical center that was the site of a mass shooting. https://t.co/sHhCA81Bst",
  "data/tweet-nytimes/2022/6/1532462077163585536.json": "“We value the comfort and self-regard of men, especially famous ones, more than we value the safety and dignity of women, even famous ones,” our critic @aoscott writes on the Johnny Depp-Amber Heard trial verdict. https://t.co/EOt3nrQCKr",
  "data/tweet-nytimes/2022/6/1532457042471952384.json": "The gunman who killed four people at a Tulsa medical building underwent back surgery last month and the doctor who performed it was one of the victims, police said. His weapons included an AR-15-style rifle he bought hours before the attack. https://t.co/IoqGq6jHjL https://t.co/byUy3Sk2sd",
  "data/tweet-nytimes/2022/6/1532515933834575901.json": "Breaking News: In a speech, President Biden urged Congress to ban assault-style weapons, expand background checks and pass “red flag” laws. https://t.co/jzZ8Q3Tfvt https://t.co/mJ6zqFAXvA",
  "data/tweet-nytimes/2022/6/1532540282050383872.json": "Breaking News: New York lawmakers passed a set of gun bills to raise the minimum age to buy a semiautomatic rifle to 21 and revise the state’s “red flag” laws.\nhttps://t.co/0ZIxXejuXX",
  "data/tweet-nytimes/2022/6/1532440701962797062.json": "Glittery butterflies. TikTok. Superman. Encanto. These are just a few of the details that families of the victims of the Uvalde mass shooting provided about their children to the team creating customized caskets for their funeral services. https://t.co/gkIUN2Y3TY https://t.co/maNlcjase2",
  "data/tweet-nytimes/2022/6/1532517192041898009.json": "Zaila Avant-garde was 14 last year when she became the first Black American to win the Scripps National Spelling Bee. Her ambitions do not stop there. She wants to play for the WNBA, work at NASA and develop a way for humans to survive longer in space. https://t.co/b1k5h3ym5s https://t.co/hu3euykPGW",
  "data/tweet-nytimes/2022/6/1532399184644546561.json": "At least a half-dozen current and former Proud Boys, the far-right nationalist group that was at the forefront of Jan. 6 Capitol riot, have secured seats on the Miami-Dade Republican Executive Committee, seeking to influence local politics from the inside. https://t.co/O7lyLahPur",
  "data/tweet-nytimes/2022/6/1532538833815879689.json": "“This is not about taking away anyone’s guns,” President Biden said in a speech calling on Congress to pass new federal gun legislation, including stopping the sale of assault-style weapons, expanding background checks and passing “red flag” laws. https://t.co/lW6DP428ML https://t.co/C400givGlO",
  "data/tweet-nytimes/2022/6/1532563421971025934.json": "Harini Logan, 14, won the Scripps National #SpellingBee, claiming victory in a blistering, first-of-its-kind spell-off that capped a marathon duel. The eighth-grader from San Antonio, Texas, was reinstated earlier in the final round. https://t.co/G3j9QFgQUQ https://t.co/UCY0g2ICKp",
  "data/tweet-nytimes/2022/6/1532487242320695314.json": "Queen Elizabeth II celebrated 70 years on the throne Thursday, as the first day of the Platinum Jubilee celebrations kicked off in London. The festivities included a military parade, a 41-gun salute and a 70-aircraft flyover. https://t.co/HOWsRNQmJp",
  "data/tweet-nytimes/2022/6/1532426868925812736.json": "Florida’s Supreme Court refused to consider a challenge to a new voting map approved by the Republican State Legislature that a lower court said illegally diluted the power of Black voters. https://t.co/yPl9PmorIy",
  "data/tweet-nytimes/2022/6/1532666989654818817.json": "Prince Harry and his wife, Meghan, have arrived for the service at St. Paul’s Cathedral, their first public appearance during the queen's #PlatinumJubilee celebrations. \n\nWatch live. https://t.co/eSGV3X15Mn https://t.co/Tvgsb1Ney1",
  "data/tweet-nytimes/2022/6/1532671574863667203.json": "It was a moment that royal watchers had been waiting for.\n\nPrince Harry and his wife, Meghan, made their first appearance at the #PlatinumJubilee. The prince surrendered his senior royal status in 2020 when the couple left Britain to live in California. https://t.co/eXwFs6vNey https://t.co/f1NaCmGFAT",
  "data/tweet-nytimes/2022/6/1532683444609859585.json": "Prince Harry and his wife, Meghan, walked hand-in-hand into St. Paul’s Cathedral, drawing loud cheers from the crowd outside and turning every head inside.\n\nIn the #PlatinumJubilee's meticulous choreography, their highly visible arrival was no accident.  https://t.co/BjIlyltqKX https://t.co/5rSSdINpn1",
  "data/tweet-nytimes/2022/6/1532670974868566017.json": "Johnny Depp’s victory against Amber Heard — when he was awarded more than $10 million in damages — could embolden others accused of abuse or misconduct to try their luck with juries, lawyers say. https://t.co/7JA4I8ChSD",
  "data/tweet-nytimes/2022/6/1532614334416883712.json": "Prince Harry and his wife, Meghan, are expected to make their first big appearance at Queen Elizabeth II's #PlatinumJubilee.\n\nThey will attend a service at St. Paul’s Cathedral, but the queen herself will skip the event. Follow live. https://t.co/LeusTsxQqq",
  "data/tweet-nytimes/2022/6/1532558372574306324.json": "Breaking News: Harini Logan, 14, won the 2022 Scripps National #SpellingBee after the competition headed to an unprecedented spell-off. She correctly spelled 21 words in 90 seconds. https://t.co/6cPy9YNee5",
  "data/tweet-nytimes/2022/6/1532774298976387074.json": "Breaking News: A day before the Jan. 6 assault on the Capitol, an aide to Mike Pence warned of a security risk to the vice president, saying President Donald Trump was going to publicly turn on him. https://t.co/5UGbG0bJi3",
  "data/tweet-nytimes/2022/6/1532764052497244162.json": "Barbados dropped Queen Elizabeth II as its head of state and became a republic. Now, six other Caribbean nations may follow.\nSince the Black Lives Matter movement, calls for reparations for Britain’s brutal role in the slave trade have been rising. https://t.co/X0lvWxxODW",
  "data/tweet-nytimes/2022/6/1532786713403203584.json": "Breaking News: The police chief who oversaw the response to a mass shooting in Uvalde, Texas, arrived on scene without his police radio, a law enforcement official said. A tactical team ultimately ignored directives not to breach the classroom. https://t.co/sShSGMqXxG",
  "data/tweet-nytimes/2022/6/1532703469504806912.json": "Breaking News: The U.S. hiring spree continued in May: Employers added 390,000 jobs and average hourly earnings rose 5.2% from a year ago. https://t.co/gj7PFTSYf2",
  "data/tweet-nytimes/2022/6/1532416796913029120.json": "Tosca Musk, Elon Musk’s younger sister, is the force behind Passionflix, a streaming service dedicated to adaptations of romance novels and erotic fan fiction. The online service costs $6 a month and organizes content by a “barometer of naughtiness.” https://t.co/nAx8KBaA5r",
  "data/tweet-nytimes/2022/6/1532760743040409600.json": "Breaking News: Peter Navarro, a White House adviser to Donald Trump, was charged with contempt of Congress for defying a subpoena from the Jan. 6 inquiry. https://t.co/sLYPtgRgDG",
  "data/tweet-nytimes/2022/6/1532820429131358209.json": "Representative Chris Jacobs, a Republican from New York, embraced gun control measures after the shootings in Buffalo and Uvalde, Texas. A week later, facing his party’s anger, he’s ending his re-election run. https://t.co/N6bypC4Tmd",
  "data/tweet-nytimes/2022/6/1532779179275583489.json": "Carbon dioxide in the atmosphere hit its highest level ever as humans pumped 36 billion tons of the planet-warming gas in 2021. https://t.co/8IfPjsxO8P",
  "data/tweet-nytimes/2022/6/1532633225922748417.json": "Barack Obama paid tribute to Queen Elizabeth II in a video message in which he said they had formed their own “special relationship.” https://t.co/eAqQqgn0Qm https://t.co/0LIP3q2phX",
  "data/tweet-nytimes/2022/6/1532745191202902017.json": "After mass shootings in the U.S., proposals to ban assault weapons follow. And gunmakers respond — by adapting guns in ways that keep them legal, but nearly indistinguishable from illegal assault weapons. https://t.co/0hyD4um6CW",
  "data/tweet-nytimes/2022/6/1532791759234912264.json": "The amount of carbon dioxide in the atmosphere broke a record in May, scientists said on Friday. Humans pumped 36 billion tons of the planet-warming gas into the atmosphere in 2021, more than in any previous year. https://t.co/3epCfNwl3z https://t.co/gstZUXSUd0",
  "data/tweet-nytimes/2022/6/1532701161114980357.json": "Zaila Avant-garde was 14 last year when she became the first Black American to win the Scripps National Spelling Bee. Her ambitions do not stop there. She wants to play for the WNBA, work at NASA and develop a way for humans to survive longer in space. https://t.co/XBoTSvwZX9 https://t.co/kFZsi5XZjs",
  "data/tweet-nytimes/2022/6/1533011186698141696.json": "Having something to look forward to can boost your mood and lower your stress, studies suggest. Whether it's something small or large, like trying a new book or planning a trip, here are ways to incorporate the power of anticipation into everyday life. https://t.co/lsaPt7uh7Y",
  "data/tweet-nytimes/2022/6/1533100027425574914.json": "Dozens of mariachi musicians had traveled to Uvalde with the hope that they could deliver a dose of comfort. With trumpets, strings and serenades, their music speaks to a community’s profound sorrow. https://t.co/m9iO3mpZ8f https://t.co/X2lju8kcPd",
  "data/tweet-nytimes/2022/6/1532875244771344384.json": "Breaking News: The Justice Department declined to charge Mark Meadows and Dan Scavino, two former Trump aides, for stonewalling the Jan. 6 inquiry. https://t.co/EWblVEZLli",
  "data/tweet-nytimes/2022/6/1533081163023237120.json": "Raquel Fortun is one of only two forensic pathologists in the Philippines. Before her, there had been no independent inquiry into the country's drug war. She has used her skills to show how other doctors falsely claimed some victims died natural deaths.\nhttps://t.co/ySiccf2z0V https://t.co/3qIp1F0KtJ",
  "data/tweet-nytimes/2022/6/1532854673388052483.json": "Special Olympics lifted its Covid vaccine requirement for athletes and staff after Florida officials threatened a $27.5 million fine over the mandate. Gov. Ron DeSantis, who has blocked vaccine and mask mandates, criticized the requirement on Friday. https://t.co/u6sBybMQJc",
  "data/tweet-nytimes/2022/6/1533071093052985350.json": "A 150-mile leisurely bike ride from Trieste, Italy, through Slovenia, to the ancient city of Pula, Croatia, brims with ancient traditions, sublime food and perched-village photo ops. https://t.co/xB4y3iVKMZ https://t.co/fR4IndCwIy",
  "data/tweet-nytimes/2022/6/1533144309154951169.json": "If four key gun control proposals now being considered in Congress had been law since the Columbine High School in 1999, they might have changed the course of 35 mass shootings that killed 446, a New York Times analysis found. https://t.co/DQEllQAcfi",
  "data/tweet-nytimes/2022/6/1533171778385858565.json": "If ever there was a potent symbol of how much Russia’s invasion of Ukraine has altered Europe, the sight of this enormous battleship in Stockholm, bristling with 26 warplanes and 2,400 Marines and sailors, would certainly be it. https://t.co/VKf2iDHQjC https://t.co/sRMB3lyxpA",
  "data/tweet-nytimes/2022/6/1533130220395454465.json": "Drivers in Miami faced slashing rains and flooded streets as a rapidly growing weather system moved into the South Florida region. https://t.co/zMSiS73aLq https://t.co/IURSembeBz",
  "data/tweet-nytimes/2022/6/1533190746869747713.json": "Dozens of mariachi musicians had traveled to Uvalde with the hope that they could deliver a dose of comfort. With trumpets, strings and serenades, their music speaks to a community’s profound sorrow. https://t.co/aefNYCmhbm https://t.co/N2Ay5XaKt7",
  "data/tweet-nytimes/2022/6/1533182310224474115.json": "President Emmanuel Macron of France, who has sought to position himself as the world’s chief negotiator with the Kremlin, pleaded Saturday to not \"humiliate\" Russia.\n\nUkraine’s foreign minister said Macron's advice \"can only humiliate France.\" https://t.co/DWbIoZdhkI",
  "data/tweet-nytimes/2022/6/1533164693266870274.json": "An emergency services dispatcher in Buffalo who was accused of hanging up on a 911 call from a supermarket employee during the mass shooting in May has been fired. The employee said the dispatcher yelled at her for whispering as she hid during the attack. https://t.co/ytiXrh11cY",
  "data/tweet-nytimes/2022/6/1533183076381114368.json": "“We value the comfort and self-regard of men, especially famous ones, more than we value the safety and dignity of women, even famous ones,” our critic writes on the Johnny Depp-Amber Heard trial verdict. https://t.co/tNWFewWQBJ",
  "data/tweet-nytimes/2022/6/1533198661081042944.json": "A former Air Force sergeant who participated online in an extremist anti-government movement was sentenced to 41 years in prison for murdering a federal security officer and injuring another outside a courthouse in Oakland, California. https://t.co/8Yq2O1yKOs",
  "data/tweet-nytimes/2022/6/1533145310339407873.json": "The police chief who oversaw the response to a mass shooting in Uvalde, Texas, arrived on scene without his police radio, a law enforcement official said. A tactical team ultimately ignored directives not to breach the classroom. https://t.co/oxClOIGg1c",
  "data/tweet-nytimes/2022/6/1533258571902865409.json": "Here is a collection of booze-free beverages for the season. https://t.co/EFyIh5P3j0 https://t.co/ycBVpU9uyp",
  "data/tweet-nytimes/2022/6/1533175528827527168.json": "John Fetterman, a heart patient, will be battling Dr. Mehmet Oz, a heart surgeon, in Pennsylvania for the Senate seat deemed most within reach for a Democratic takeover. Fetterman's recent health struggles have left some Democrats with a distinct unease. https://t.co/FUx1d80wkS",
  "data/tweet-nytimes/2022/6/1533441661732376576.json": "A boy who played Little League. A girl who dreamed of becoming a veterinarian. Several children who had just made the honor roll. \n\nIn all, 21 people — 19 students and two teachers — were killed by a gunman in Uvalde, Texas. These are their stories. https://t.co/T066oSv1Nv",
  "data/tweet-nytimes/2022/6/1533472229618491392.json": "Breaking News: Rafael Nadal beat Casper Ruud for his 14th title in Paris and his 22nd major trophy, extending his lead on the all-time list. https://t.co/UOu0W0hW66",
  "data/tweet-nytimes/2022/6/1533503927806832641.json": "\"There were a lot of happy tears.\"\n\nIt was a small trial, just 18 rectal cancer patients, every one of whom took the same drug.\n\nBut the results were astonishing. The cancer vanished in every single patient. https://t.co/mYnlfUkKAs",
  "data/tweet-nytimes/2022/6/1533492623981305856.json": "Rafael Nadal on Sunday extended his men’s singles record of 22 Grand Slam titles with a win in straight sets over Casper Ruud. The victory secured Nadal his 14th men’s singles title at the tournament, extending a French Open record. https://t.co/maRQonAR56 https://t.co/aKG3sPhDR8",
  "data/tweet-nytimes/2022/6/1533473755187630081.json": "For months after Russia invaded their country, the members of Ukraine’s national soccer team were unable to hold so much as a practice together, let alone play a game.\n\nOn Sunday, they will play Wales for a place in the World Cup. https://t.co/W5WjfAbsI2",
  "data/tweet-nytimes/2022/6/1533551964017119235.json": "It was a small trial, just 18 rectal cancer patients, every one of whom took the same drug.\n\nBut the results were astonishing. The cancer vanished in every single patient, and no further treatment was necessary. https://t.co/bW2SRCE5ft",
  "data/tweet-nytimes/2022/6/1533578589450412035.json": "Dozens were believed to be dead in southwestern Nigeria after assailants attacked a Catholic church on Sunday, firing on worshipers as they celebrated Mass, officials said. It was the deadliest attack on a church in years in Africa’s most populous nation. https://t.co/VopVcshQl4",
  "data/tweet-nytimes/2022/6/1533524363609268230.json": "Platinum Jubilee celebrations ended Sunday, with Queen Elizabeth II making another appearance on the Buckingham Palace balcony.\n\nOn Monday, Britain pivots from joyful tributes to the queen’s 70-year reign to renewed political ructions over Boris Johnson. https://t.co/C2jzmgFa7R https://t.co/dgzuh2jrBQ",
  "data/tweet-nytimes/2022/6/1533532667446190082.json": "The New York Times assessed four key gun-control proposals currently before Congress and found that they could have changed the course of dozens of mass shootings since the Columbine massacre in 1999. https://t.co/YbS6nB39wQ",
  "data/tweet-nytimes/2022/6/1533560556275236864.json": "Queen Elizabeth II joined other members of the royal family on the balcony of Buckingham Palace, as four days of Platinum Jubilee celebrations came to an end on Sunday. https://t.co/YZ4ny7Ge2I https://t.co/MIbBanbngP",
  "data/tweet-nytimes/2022/6/1532965435783749633.json": "California has some 700 certified farmers’ markets, featuring some of the world’s best produce — but it took legislative changes in the 1970s to help them flourish. https://t.co/LiaUFpa663 https://t.co/EwObwjB9N9",
  "data/tweet-nytimes/2022/6/1533721615053340673.json": "Prime Minister Boris Johnson of Britain will face a no-confidence vote that could force him from power.\n\nFollow our live updates. https://t.co/et1ZfYzBeg https://t.co/p5B8x4akFQ",
  "data/tweet-nytimes/2022/6/1533776728170143745.json": "The British military announced that it would send its most sophisticated multiple-launch rocket system to Ukraine, joining the U.S. in providing long-range artillery as Russia hits Ukrainian positions across the eastern front.\nhttps://t.co/FyYYc1noHg",
  "data/tweet-nytimes/2022/6/1533622248476708864.json": "Three people were killed and 12 others were injured, officials said, in a shooting on a packed street in downtown Philadelphia.\n\nOther shootings in Tennessee, Virginia, Arizona and South Carolina over the weekend left six more dead and dozens injured. https://t.co/xXWxNxegxc",
  "data/tweet-nytimes/2022/6/1533795885267689474.json": "President Volodymyr Zelensky met soldiers and handed out military awards near the frontline in eastern Ukraine, in a visit aimed at boosting morale.\n\n“I am proud of everyone with whom I met, whom I shook hands with,” he said of his visit.\nhttps://t.co/hshtbG131A https://t.co/4tSJMsDW3W",
  "data/tweet-nytimes/2022/6/1533815526576857088.json": "Breaking News: Elon Musk threatened to pull out of his $44 billion deal with Twitter, accusing the platform of “resisting” requests for data about fake accounts.\nhttps://t.co/CsYvrHAa2N",
  "data/tweet-nytimes/2022/6/1533811218187751425.json": "\"There were a lot of happy tears.\"\n\nIt was a small trial, just 18 rectal cancer patients, every one of whom took the same drug.\n\nBut the results were astonishing. The cancer vanished in every single patient. https://t.co/OwTCoylWYl",
  "data/tweet-nytimes/2022/6/1533801393210933248.json": "The U.S. alerted 14 countries, mostly in Africa, that Russian ships carrying stolen Ukrainian grain could be headed their way, posing a dilemma to countries facing dire food shortages.\nhttps://t.co/nl9tmN49uP",
  "data/tweet-nytimes/2022/6/1533900635183190016.json": "Breaking News: Five members of the Proud Boys, including the group’s former leader, Enrique Tarrio, were charged with seditious conspiracy for their roles in the Jan. 6 riot. https://t.co/2CdBwxo57q",
  "data/tweet-nytimes/2022/6/1533718441491943429.json": "Breaking News: Prime Minister Boris Johnson of Britain faces a no-confidence vote after months of crisis over lockdown-breaking parties at Downing Street.\n\nFollow our live updates. https://t.co/lfUGE9MKZK",
  "data/tweet-nytimes/2022/6/1533122672460185603.json": "A day before the Jan. 6 assault on the Capitol, an aide to Mike Pence warned of a security risk to the vice president, saying President Donald Trump was going to publicly turn on him. https://t.co/qP538AW6x8",
  "data/tweet-nytimes/2022/6/1533833617310371842.json": "The president of Mexico, Andrés Manuel López Obrador, will not attend the Summit of the Americas. Obrador said he made the decision, a blow to President Biden, because Cuba, Nicaragua and Venezuela were not invited to the meeting. https://t.co/tHOvxinp7H",
  "data/tweet-nytimes/2022/6/1533992156599296007.json": "A Florida woman was charged with manslaughter on Monday after her 2-year-old boy found a gun in their home and accidentally shot his father in the back, killing him, the authorities said.\nhttps://t.co/zgL0FnCvbF",
  "data/tweet-nytimes/2022/6/1533519037677936641.json": "Suffolk County on Long Island aggressively uses New York's \"red flag\" law to take guns from people in crisis. A New York Times examination of more than 100 cases filed in the county shows how that law has defused dozens of dangerous situations. https://t.co/qvDU5gCWNY",
  "data/tweet-nytimes/2022/6/1534002230264795136.json": "A federal judge ruled on Monday that Louisiana’s new congressional map represented a racial gerrymander and must be redrawn. https://t.co/C2HiM4OEeD",
  "data/tweet-nytimes/2022/6/1533919184450686976.json": "\"Crying in H Mart\"  has stayed on the New York Times best-seller list for more than 40 weeks. We spoke to Michelle Zauner about the runaway best seller — and what comes next. https://t.co/NNQJ96zC7M",
  "data/tweet-nytimes/2022/6/1534014802401583104.json": "A British journalist and a Brazilian expert on Indigenous peoples have been reported missing deep inside the Amazon rainforest, after the expert’s organization said it had received threats for its work monitoring illegal mining and fishing in the area. https://t.co/VMQQqUv9wl",
  "data/tweet-nytimes/2022/6/1534101126949355520.json": "A British journalist and a Brazilian expert on Indigenous peoples have been reported missing deep inside the Amazon rainforest, after the expert’s organization said it had received threats for its work monitoring illegal mining and fishing in the area. https://t.co/fF5RwHk8lG",
  "data/tweet-nytimes/2022/6/1533914134403751944.json": "Three Tempe, Arizona, police officers are on paid leave amid an investigation into their response to a man who jumped into a lake and, despite his repeated pleas for help, drowned as the officers watched, newly released video footage and records show. https://t.co/u66Oww7iAQ",
  "data/tweet-nytimes/2022/6/1534165842862145538.json": "A Florida woman was charged with manslaughter on Monday after her 2-year-old boy found a gun in their home and accidentally shot his father in the back, killing him, the authorities said.\nhttps://t.co/7I9kIECv2v",
  "data/tweet-nytimes/2022/6/1534089801581854720.json": "Fiji handed over to the U.S. a $325 million superyacht that American investigators say is owned by a Russian billionaire on a U.S. sanctions list, the island nation’s top prosecutor said.\nhttps://t.co/1JGgrRoRn0",
  "data/tweet-nytimes/2022/6/1534150946531561472.json": "A federal judge ruled on Monday that Louisiana’s new congressional map represented a racial gerrymander and must be redrawn. https://t.co/S8k667gFg4",
  "data/tweet-nytimes/2022/6/1533921702777966593.json": "Federal authorities intend to seize two aircraft believed to be owned by Roman Abramovich, saying that the Russian oligarch violated strict U.S. export regulations linked to Russia’s invasion of Ukraine, according to new court filings. https://t.co/Am2hBoQPIX",
  "data/tweet-nytimes/2022/6/1534222438300635136.json": "All new smartphones, tablets and laptops in the EU will be required to use a USB-C charger by 2026, under an agreement reached on Tuesday. The new law had been opposed by companies including Apple. https://t.co/tqsjWKGi5t",
  "data/tweet-nytimes/2022/6/1534272901255512066.json": "Exclusive: The NFL star Deshaun Watson, who has been accused of sexual misconduct during massage appointments, used resources provided by the Houston Texans, including nondisclosure agreements, to make appointments with more women than previously known. https://t.co/uUMPmv7E41 https://t.co/kLHTo8HdrN",
  "data/tweet-nytimes/2022/6/1534305472869806082.json": "Matthew McConaughey, a native of Uvalde, Texas, spoke at the White House on Tuesday to honor the victims of the mass shooting and urge bipartisan action on gun safety measures.\n\n“Children were left not only dead, but hollow,” McConaughey said. https://t.co/8dq1JaFVKZ",
  "data/tweet-nytimes/2022/6/1534256849800810497.json": "A bowl of toxic dust is threatening to poison the air around Salt Lake City, as climate change and rapid population growth shrink Utah's Great Salt Lake. https://t.co/BWyjW3gATG https://t.co/9Dx6DJrj1r",
  "data/tweet-nytimes/2022/6/1534324345220259841.json": "Matthew McConaughey, a native of Uvalde, Texas, spoke at the White House on Tuesday about the victims of the mass shooting in his hometown. He also spoke about a need for “responsible gun ownership,” including new gun safety regulations. https://t.co/kHS6svwFqS https://t.co/Vo4DEFfNkn",
  "data/tweet-nytimes/2022/6/1534301730002845698.json": "Monkeypox can be transmitted through the air, at least over short distances, similar to Covid, the CDC said. Airborne transmission is only a small factor in the overall spread, and experts say there are no firm estimates regarding how much it contributes. https://t.co/GoDq2f0DIY",
  "data/tweet-nytimes/2022/6/1534214882647846913.json": "The minimum age for elite figure skaters will gradually be increased to 17 over three years and be in place in time for the 2026 Olympics. A doping scandal involving the 15-year-old Russian Kamila Valieva sparked a debate about age limits. https://t.co/4yuHs2vjz0 https://t.co/hD1M8mC68q",
  "data/tweet-nytimes/2022/6/1534184694580924420.json": "Disneyland apologized to a couple after an employee at its Paris park disrupted their marriage proposal, snatching the ring and ushering them off a stage. \n\nThe man had been planning the proposal for months. “They can’t give us the moment back,” he said. https://t.co/J5L7uyYzPn",
  "data/tweet-nytimes/2022/6/1534375428277907463.json": "Breaking News: The Justice Department is investigating a retired U.S. general, who now heads a think tank, for secretly lobbying for Qatar, documents show. https://t.co/z9GayyukeX",
  "data/tweet-nytimes/2022/6/1534387743085699073.json": "Chesa Boudin, San Francisco’s progressive district attorney, was ousted by voters who grew agitated by persistent property crimes. https://t.co/MMWVwIWbNn",
  "data/tweet-nytimes/2022/6/1534492527017041920.json": "Breaking News: More than 90 women plan to sue the FBI for early failures in its investigation of Larry Nassar, the former doctor for USA Gymnastics who was convicted on state sexual abuse charges.\nhttps://t.co/Jm85rAiBCF",
  "data/tweet-nytimes/2022/6/1534349502915694600.json": "Doctors are being kidnapped to treat wounded gang members. Medical clinics are being charged an extortion fee. As criminal organizations in Mexico control more territory in rural regions, health care workers are increasingly ensnared in the violence. https://t.co/OCwCg8Ugk9",
  "data/tweet-nytimes/2022/6/1534509331961548800.json": "Miah Cerrillo, an 11-year-old who survived the school shooting in Uvalde, Texas, by smearing herself in a classmate’s blood and pretending to be dead, will testify on Wednesday at a House hearing on gun violence.\nhttps://t.co/teiDBrg4gV",
  "data/tweet-nytimes/2022/6/1534203594878201856.json": "Caviar bumps — in which a dollop of the fish roe is eaten (not snorted) off the back of one’s hand — have become a trendy way to consume the pricey delicacy.\n\n“People used to get high off of drugs. Now, we’re getting high off the food.”\nhttps://t.co/4zFaLhCMID",
  "data/tweet-nytimes/2022/6/1534567203625914368.json": "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to Congress the horrors he saw in an emergency room after the massacre, including children \"pulverized\" and \"decapitated\" by bullets.\n\n\"Those mothers' cries, I will never get out of my head.\" https://t.co/nesUOoDBE2",
  "data/tweet-nytimes/2022/6/1534573540250374145.json": "Zeneta Everhart brought a searing and emotional firsthand account to Congress of the damage done to her son, an employee at the Tops supermarket, by a racist gunman armed with an assault-style weapon in the Buffalo mass shooting. https://t.co/JMkX7UrIuZ https://t.co/IqKBjELV3p",
  "data/tweet-nytimes/2022/6/1534616273774071810.json": "Miah Cerrillo, a fourth grader who survived the Uvalde shooting by smearing a dead classmate’s blood on herself, described the attack to Congress. “He shot my friend that was next to me,” she said. “And I thought he would come back to the room.” https://t.co/u9of8xocf5 https://t.co/Fh1LS4HyHW",
  "data/tweet-nytimes/2022/6/1534631372878487553.json": "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to Congress seeing children so \"pulverized\" and \"decapitated\" by bullets \"that the only clue as to their identities was their blood-spattered cartoon clothes still clinging to them.\" https://t.co/w32qyGkFTx https://t.co/Tk4pFze2iD",
  "data/tweet-nytimes/2022/6/1534154494812069888.json": "Exiled leaders from the Russian-occupied city of Mariupol warned of the growing risk of disease outbreaks because sewage systems are not working, dead bodies are still rotting in the streets and tens of thousands of people do not have access to clean water.https://t.co/GqV3Bn72xF",
  "data/tweet-nytimes/2022/6/1534609986994814976.json": "Those from Uvalde, Texas, shared emotional testimonies during a House hearing on gun violence, hours before the lawmakers were scheduled to vote on a package of gun control measures, including prohibiting sales of semiautomatic rifles to people under 21. https://t.co/OAIyd6GZYf https://t.co/h6f0uywkx6",
  "data/tweet-nytimes/2022/6/1534651500768776200.json": "Kimberly Rubio, whose daughter was killed in the Uvalde school shooting, delivered an emotional speech to Congress about the final moments she spent with her daughter and the traumatic events of that day. https://t.co/eYDE0pCNoI https://t.co/1GWq25WgCD",
  "data/tweet-nytimes/2022/6/1534641458124410880.json": "Zeneta Everhart, whose son survived a racist attack on the Buffalo supermarket where he worked, described to Congress his wounds in detail and told lawmakers that “no citizen needs an AR-15.” https://t.co/cWZ7ChzxZW https://t.co/drHuXLKNHt",
  "data/tweet-nytimes/2022/6/1534671693066772486.json": "Dr. Roy Guerrero, a pediatrician in Uvalde, Texas, described to Congress the horrors he saw in an emergency room after the massacre, including children \"pulverized\" and \"decapitated\" by bullets.\n\n“I know I’ll never forget what I saw that day.” https://t.co/bF6xcnyT2z https://t.co/SvQ5eTRf7q",
  "data/tweet-nytimes/2022/6/1534658775466090496.json": "Breaking News: Donald Trump and two of his adult children are set to be questioned under oath next month by the New York State attorney general’s office as part of a civil investigation into his company’s business practices in New York. https://t.co/dqPpjnQngn",
  "data/tweet-nytimes/2022/6/1534701858090106880.json": "From 1907 to 1932, 32 states passed explicit eugenics laws that allowed the government to sterilize the “insane,” the “feebleminded,” the “dependent” and the “diseased” — all of whom were deemed incapable of making their own decisions about reproduction. https://t.co/5V05FQZW1X",
  "data/tweet-nytimes/2022/6/1534732042256146432.json": "The House voted to bar the sale of semiautomatic weapons to people under the age of 21 and ban the sale of large-capacity magazines, as parents of victims and survivors of mass shootings made wrenching appeals for Congress to act on gun violence. https://t.co/FXgyeaOf3I https://t.co/gnTe6n0qyR",
  "data/tweet-nytimes/2022/6/1534682563406614529.json": "Breaking News: The House approved a wide-ranging package of gun control legislation that includes raising the age to buy semiautomatic weapons to 21 and banning high-capacity magazines. But the measure is certain to go nowhere in the Senate. https://t.co/rid54vdSfe",
  "data/tweet-nytimes/2022/6/1534467808897249280.json": "Eight years after the Sewol ferry disaster killed 250 high school students in South Korea, their families continue to struggle with the lessons the tragedy brought to bear. https://t.co/gvkyoHGggV https://t.co/vkMm5BXVog",
  "data/tweet-nytimes/2022/6/1534734544137605122.json": "Oris Buckner, who as New Orleans’s only Black homicide detective in the early 1980s exposed one of the worst cases of police violence in the city’s history, leading to the conviction of three officers on civil rights charges, has died at 70. https://t.co/Y9ANzPKQNu",
  "data/tweet-nytimes/2022/6/1534636422782668806.json": "Twitter plans to give Elon Musk access to a large swath of its data, potentially down to its very last tweet, after he threatened to pull out of a $44 billion deal for the company, saying it has refused to give him information about fake accounts. https://t.co/XMKUDwtswh",
  "data/tweet-nytimes/2022/6/1534849048099921921.json": "The House on Wednesday voted to bar the sale of semiautomatic weapons to people under the age of 21 and ban the sale of large-capacity magazines, as parents of victims and survivors of mass shootings made appeals for Congress to act on gun violence. https://t.co/HdwZSMChin https://t.co/NyjWkubpbY",
  "data/tweet-nytimes/2022/6/1534583550862925825.json": "The Olympic gymnasts Simone Biles and McKayla Maroney are among more than 90 women suing the FBI for its failure to investigate Larry Nassar when it received credible information that he sexually abused girls. They are seeking over $1 billion in damages. https://t.co/vEs4p1IaX8",
  "data/tweet-nytimes/2022/6/1534868007763296256.json": "Ahead of the Jan. 6 House committee's public hearings on Thursday, we pieced together the narrative of Donald Trump’s monthslong campaign to subvert American democracy and cling to power. https://t.co/KouxWcjFuy",
  "data/tweet-nytimes/2022/6/1534938941476032516.json": "Breaking News: Ryan Kelley, a Republican running for governor in Michigan who was at the Capitol during the Jan. 6 attack, was arrested Thursday. He's the first person running in a major state or federal race to be charged in connection with the assault. https://t.co/OCUiy2aZq0",
  "data/tweet-nytimes/2022/6/1534899396017631234.json": "The Jan. 6 House committee plans to open a prime-time hearing on Thursday by playing previously unreleased video of Donald Trump’s top aides and family members testifying, as well as footage revealing the role of the Proud Boys in the assault.\nhttps://t.co/9EAlD64xdH",
  "data/tweet-nytimes/2022/6/1534958580809474048.json": "Ahead of the Jan. 6 House committee's public hearings on Thursday, we pieced together the narrative of Donald Trump’s monthslong campaign to cling to power. Here’s some of our previous reporting breaking down Jan. 6 and the events leading up to it. 🧵 https://t.co/dJkUvHtp1U https://t.co/XYwmoqrxSK",
  "data/tweet-nytimes/2022/6/1534991371047780352.json": "Breaking News: Heavily armed Uvalde officers waited an hour to confront the gunman, even as on-scene supervisors were told wounded students were trapped, in part because a commander feared for officers' safety, documents seen by The New York Times show. https://t.co/9Fer3IYNS6",
  "data/tweet-nytimes/2022/6/1534920805842309120.json": "Electric vehicle charging stations built with government money should be placed along Interstates every 50 miles, be able to charge cars quickly and be located no more than a mile from a major highway, new rules proposed by the Biden administration say. https://t.co/U48absgF2G",
  "data/tweet-nytimes/2022/6/1534856615928676352.json": "Volodymyr Titulenko has long been haunted by childhood memories of World War II. Now, at 82, the artist is capturing the horrors of the war in Ukraine on canvas.\n\nHe has one final project in mind: “I will paint a mural to celebrate the Ukrainian victory.”\nhttps://t.co/iUX0QMVy8V https://t.co/BQCcikJAiI",
  "data/tweet-nytimes/2022/6/1534999270004248578.json": "Breaking News: Heavily armed Uvalde officers waited an hour to confront the gunman, even as on-scene supervisors were told wounded students were trapped, in part because a commander feared for officers’ safety, documents seen by The New York Times show. https://t.co/PYouAyFpVm https://t.co/W050udvyO7",
  "data/tweet-nytimes/2022/6/1534945018720710656.json": "Sales of plastic water bottles and other single-use plastic products will be phased out at national parks and on public lands in the U.S. over the next decade, the Interior Department said this week. https://t.co/eTXKDNVl4Z",
  "data/tweet-nytimes/2022/6/1534966082158612509.json": "A British researcher, affiliated with a Belgian university, wrote pseudoscientific theories to justify racism. Only after his work cited by the gunman who killed 10 Black people in a racist attack in Buffalo did the school suspend the relationship. https://t.co/lope7MorRF",
  "data/tweet-nytimes/2022/6/1535084358016581639.json": "Bill Barr, the former attorney general, testified to the Jan. 6 committee that Donald Trump’s repeated claims of fraud in the 2020 election were false, saying he told Trump that he “didn’t want to be a part of it.” https://t.co/Kf5QBFAgPz https://t.co/eAvxf9R9nC",
  "data/tweet-nytimes/2022/6/1535075555271393283.json": "Caroline Edwards, the first Capitol Police officer injured on Jan. 6, 2021, testified on Thursday in the first committee hearing about the attack. \"They dared to question my loyalty, they dared to question my honor,\" Edwards said. Follow live updates: https://t.co/l9OwaZKUN3 https://t.co/0OpYw0azK7",
  "data/tweet-nytimes/2022/6/1535073762160386048.json": "“Donald Trump was at the center of this conspiracy,” said Rep. Bennie Thompson of Mississippi, the chairman of the Jan. 6 committee, during the first public hearing on the Capitol riot.\n\nFollow live updates: https://t.co/fXDr4lBbay https://t.co/ZnWPi94CkF",
  "data/tweet-nytimes/2022/6/1535068046859051019.json": "Video testimony from Jared Kushner was featured prominently during the Jan. 6 hearing on Thursday, in which he said that he dismissed threats of resigning by the White House counsel as “whining.” https://t.co/FfFyB5vvYE",
  "data/tweet-nytimes/2022/6/1535065984171646984.json": "At the first public hearing by a House committee investigating the Jan. 6, 2021, assault on the Capitol, lawmakers painted the attack as a brazen coup led by Donald Trump.\n\nHere are some of the key moments from the first part of the hearing’s opening: https://t.co/ClcgNjlFfr",
  "data/tweet-nytimes/2022/6/1535064964117012480.json": "Videotaped testimony of Ivanka Trump and Donald Trump aides was shown during the Jan. 6 hearing, in which they said the president was given information demonstrating not only that he had lost the 2020 election, but that the fraud he cited didn’t exist. https://t.co/vQNGVd8qFo",
  "data/tweet-nytimes/2022/6/1535062980324368388.json": "In the first Jan. 6 Committee public hearing, Rep. Liz Cheney began her opening remarks by stating that all the testimony committee has gathered shows how Donald Trump was trying to “destroy” the U.S. government. Follow live updates: https://t.co/gHWo5WJB6F https://t.co/Jk9uDizUEk",
  "data/tweet-nytimes/2022/6/1534976652379406356.json": "Breaking News: A white Grand Rapids, Michigan, police officer will be charged with second-degree murder for fatally shooting Patrick Lyoya, a Black man, during a traffic stop in April. https://t.co/iKcEgU5NCt",
  "data/tweet-nytimes/2022/6/1534903493479305217.json": "Ahead of the Jan. 6 House committee's public hearings on Thursday, we pieced together the narrative of Donald Trump’s monthslong campaign to subvert American democracy and cling to power. https://t.co/GseZqimsyP https://t.co/FLgbOy0An1",
  "data/tweet-nytimes/2022/6/1535090147250905092.json": "In the first Jan. 6 hearing, Caroline Edwards, a Capitol Police officer, described how she confronted protesters during the attack. The mob ended up pushing a bike rack into her, pinning her to the ground and knocking her unconscious. https://t.co/HYJvJw3HBa https://t.co/Dx43CrCi1i",
  "data/tweet-nytimes/2022/6/1535105751609446417.json": "Rep. Liz Cheney, Republican of Wyoming, gave a preview of testimony to be revealed in hearings concerning Donald Trump’s actions during the Jan. 6 attack on the U.S. Capitol. https://t.co/WwU1kDet2U https://t.co/KnxhgzcZCO",
  "data/tweet-nytimes/2022/6/1535132173757448192.json": "“I will sacrifice everything to make sure that the America my grandfather defended is here for many years to come,” said Caroline Edwards, a Capitol Police officer who clashed with rioters during the Jan. 6 attack and suffered a concussion. https://t.co/4v8oGReoWy https://t.co/Xnp13y8QTq",
  "data/tweet-nytimes/2022/6/1535069263576309781.json": "The House committee investigating the Jan. 6, 2021, riot began laying out on Thursday what they described as a methodical conspiracy, led and coordinated by Donald Trump, to remain in power, which culminated in the worst attack on the Capitol since 1814. https://t.co/DfI09o1DCt",
  "data/tweet-nytimes/2022/6/1535200128738394113.json": "News Analysis: During the Jan. 6 hearing, Donald Trump was depicted as a would-be autocrat willing to shred the Constitution to hang onto power at all costs. https://t.co/uVBQukCr5F",
  "data/tweet-nytimes/2022/6/1535015172997275677.json": "Carl Paladino, a Republican running for a House seat in New York, praised Adolf Hitler in a radio interview last year for how he \"aroused the crowd\" in his speeches, describing the fascist dictator as \"the kind of leader we need today.\" https://t.co/redsWKsTS5",
  "data/tweet-nytimes/2022/6/1535241116806787077.json": "Breaking News: U.S. inflation accelerated, with consumer prices rising 8.6% in the year through May, a rapid pace that is making it increasingly difficult for people to afford everyday purchases.\nhttps://t.co/di8cQRnGwg",
  "data/tweet-nytimes/2022/6/1535270143378456576.json": "Breaking News: The Biden administration is ending the requirement that air travelers bound for the U.S. must show a negative coronavirus test before boarding flights, a senior administration official said. https://t.co/HrtHM1Qj7H",
  "data/tweet-nytimes/2022/6/1535126351321124865.json": "Jared Kushner was featured prominently in videotaped testimony at the Jan. 6 House committee hearings, saying that he had dismissed repeated threats to resign by Pat Cipollone, the White House counsel, as “whining.” https://t.co/68pth3DwIU https://t.co/pZg0IQGzgW",
  "data/tweet-nytimes/2022/6/1535252472121507841.json": "President Volodymyr Zelensky urged the EU to accept Ukraine’s bid to join the bloc and remove it from the “gray zone” between the EU and Russia.\n\n“It will prove that words about Ukraine being a part of the European family are not just words,” he said.\nhttps://t.co/ZZyMFpo1Dv",
  "data/tweet-nytimes/2022/6/1535101962064171032.json": "In videotaped testimony, Ivanka Trump, the former president’s daughter, said that she “accepted” former Attorney General William Barr’s assessment dismissing Donald Trump’s claims of election fraud. https://t.co/OSezMA3Dcx https://t.co/9nyXAhxJvk",
  "data/tweet-nytimes/2022/6/1535154859468541952.json": "In video interviews played during the Jan. 6 House committee hearings, Ivanka Trump accepted the notion that there had been no fraud in the 2020 election. Jared Kushner complained that a White House counsel had been “whining.” https://t.co/cTJMINNDAn",
  "data/tweet-nytimes/2022/6/1535275646544494593.json": "“The Wire,” which premiered in June 2002, told a sweeping story of crime, punishment and institutional disintegration in Baltimore.\n\n20 years on, some of the show’s stars looked back and broke down some of its most pivotal scenes.\nhttps://t.co/1mZ0lkKCHW",
  "data/tweet-nytimes/2022/6/1535262057129562112.json": "More than 300 people, 77 of them children, were imprisoned in a dark, dank basement in Yahidne, a village near Ukraine’s capital, for nearly a month. They were a human shield for the Russian troops based there. \nhttps://t.co/KsXoHjyEBs",
  "data/tweet-nytimes/2022/6/1535343553609711619.json": "More than 19 million people watched the first hearing of the House committee’s investigation into the Jan. 6 attack, preliminary ratings from Nielsen show — in the ballpark of a big “Sunday Night Football” game or the Thanksgiving Day Parade. https://t.co/gsDbmaCwPh",
  "data/tweet-nytimes/2022/6/1535348595523735561.json": "Donald Trump, long known for distancing himself from or tossing aside staff members who contradicted him while he was in the White House, discovered a new target on Friday: Ivanka Trump, his eldest daughter. https://t.co/I43BtcbUog",
  "data/tweet-nytimes/2022/6/1535341079112863745.json": "The House Jan. 6 committee opened a landmark set of hearings by showing video of Donald Trump's aides testifying that his claims of a stolen election were false. Here's a rundown of Thursday's session. https://t.co/b6Da4nRYjT https://t.co/9EYNjXSKbu",
  "data/tweet-nytimes/2022/6/1535376277900775429.json": "There are signs that a nascent Ukrainian insurgency is growing in potency, allowing Ukraine's military to deliver deadly strikes on Russian-controlled territory. https://t.co/go5MPDW6hh",
  "data/tweet-nytimes/2022/6/1535381365738426370.json": "Steph Curry, Golden State’s star point guard, has been using the “tunnel walk” — in which NBA players make their way from an underground arena entrance to the locker room — to showcase the work of independent Black designers. https://t.co/9mMri2OshN",
  "data/tweet-nytimes/2022/6/1535008075547136000.json": "The Jan. 6 committee will open its landmark series of public hearings on Thursday by playing previously unreleased video testimonies from people close to Donald Trump, as well as footage revealing the role of the Proud Boys in the attack. Follow updates: https://t.co/h2RSVGAZL6",
  "data/tweet-nytimes/2022/6/1535336031251210240.json": "The number of transgender young people in the U.S. has risen significantly, according to new estimates based on CDC health surveys conducted from 2017 to 2020. https://t.co/qOeXCmcSko https://t.co/6kFmIymZJX",
  "data/tweet-nytimes/2022/6/1535396405715550211.json": "“Tonight I say this to my Republican colleagues who are defending the indefensible,” Rep. Liz Cheney said. “There will come a day when Donald Trump is gone, but your dishonor will remain.”\n\nWatch key moments from the first night of the Jan. 6 hearings. https://t.co/AZeg9sYEqq https://t.co/2N8Mfr1iQi",
  "data/tweet-nytimes/2022/6/1535441711425626112.json": "For some patients with metastatic tumors not significantly affected by other forms of chemotherapy, the treatment halted their cancer’s growth. https://t.co/sceT4WW2OQ",
  "data/tweet-nytimes/2022/6/1535517224437485569.json": "There are signs that a nascent Ukrainian insurgency is growing in potency, allowing Ukraine's military to deliver deadly strikes on Russian-controlled territory. https://t.co/qP579nqioP",
  "data/tweet-nytimes/2022/6/1535386347741102085.json": "Every cigarette sold in Canada will carry a warning under a new federal regulation, said to be the first of its kind in the world. The nation’s health agency proposed that “Poison in every puff” be printed on the paper around the filter. https://t.co/tIiy3qgII8",
  "data/tweet-nytimes/2022/6/1535502611130064896.json": "After a fortune in cash was stolen from the farmhouse of Cyril Ramaphosa, the president of South Africa, he kept the theft secret. Now that word is out, critics ask what he was hiding. https://t.co/empFKtmDrC",
  "data/tweet-nytimes/2022/6/1535619144875393025.json": "In union meetings, Capitol Hill back rooms and party gatherings, Democrats are quietly worrying about President Biden's leadership, age and ability to rescue the party. They're increasingly viewing him as an anchor that should be cut loose in 2024. https://t.co/XfYVTHceuy https://t.co/VyjhNRelfp",
  "data/tweet-nytimes/2022/6/1535651837616979970.json": "\"This is a renaissance.\"\n\nThe nation's HBCUs are experiencing a boom in enrollment, as they're embraced by a generation shaped by the first Black president, Black Lives Matter and shifting views on what constitutes the pinnacle of higher education. https://t.co/t3mqgCDiVJ https://t.co/lWY77YbT9n",
  "data/tweet-nytimes/2022/6/1535659385246064643.json": "After the Jan. 6 attack, Mike Pompeo and Steven Mnuchin — the secretary of state and Treasury secretary at the time — discussed the possibility of invoking the 25th Amendment to remove Donald Trump from office. https://t.co/kRza7RK2Pm",
  "data/tweet-nytimes/2022/6/1535532821128916993.json": "A $630,225 political donation to Britain’s Conservative Party in 2018 had been flagged as a suspicious after being linked to a Russian bank account. Officials now say there’s no evidence that a crime was committed and have declined to investigate.\nhttps://t.co/6O6kHVnCLz",
  "data/tweet-nytimes/2022/6/1535648070326800385.json": "Tim Hortons collected data on customers' daily lives with a mobile phone app that tracked users around the clock, anywhere in the world, even when the app was closed, a scathing report by four privacy commissioners in Canada found. https://t.co/QWr3WIPGZF",
  "data/tweet-nytimes/2022/6/1535712248550891520.json": "After Uvalde, Buffalo and hundreds of other mass shootings, protests organized by March for Our Lives drew thousands of people across the country Saturday to demonstrate against gun violence and call for federal legislation limiting military-style weapons. https://t.co/ttEg7jKmHo https://t.co/1VrIicKrKx",
  "data/tweet-nytimes/2022/6/1535398929780678657.json": "The number of transgender young people in the U.S. has risen significantly, according to new estimates based on CDC health surveys conducted from 2017 to 2020. https://t.co/Rl1opPjW80",
  "data/tweet-nytimes/2022/6/1535629197238050819.json": "The worst drought in four decades, and a rise in food prices caused by the war in Ukraine, have left almost half of Somalia’s people facing food shortages. At least 448 children have died from severe acute malnutrition since January, according to UNICEF. https://t.co/fmmOCIRbkS",
  "data/tweet-nytimes/2022/6/1535762314116448256.json": "Thousands gathered in Washington, D.C., and in other cities across the country to condemn mass shootings and to call for federal legislation to restrict the use of military-style weapons. https://t.co/7kDFDid8B8 https://t.co/TizC4jZgQv",
  "data/tweet-nytimes/2022/6/1535708489154273280.json": "In South Texas, where guns are woven into the culture, Archbishop Gustavo García-Siller is urging his community to reconsider. He's joining a collection of bishops who have pushed for the church to take a more forceful position in the debate over firearms. https://t.co/diG6QL2BHn https://t.co/uf96Zpwcjx",
  "data/tweet-nytimes/2022/6/1535621654520422403.json": "Better treatment for mental illness would do little to curb gun violence, @amybarnhorst says. Higher age requirements for gun purchases and \"red flag\" laws would have more impact, she says. Listen to the full conversation with @NYTLiz and @DrJDFord. https://t.co/hEXFMMPVZw https://t.co/csKWruslBp",
  "data/tweet-nytimes/2022/6/1535795272487473152.json": "\"The Wire,\" which premiered in June 2002, told a sweeping story of crime, punishment and institutional disintegration in Baltimore. 20 years on, some of the show’s stars looked back and broke down some of its most pivotal scenes. https://t.co/DSrAPjCiJb",
  "data/tweet-nytimes/2022/6/1535780194002186241.json": "The Versace dress that Britney Spears wore to marry Sam Asghari this week was a symbol of her new era of independence — and a nod of sorts to her own 1990s trendsetting self. https://t.co/blxdKbtb68",
  "data/tweet-nytimes/2022/6/1535678276508827655.json": "In Opinion\n\nThe prime-time Jan. 6 committee hearing \"was about Trump as a callous monster, and many will come away convinced that he should be criminally charged and put in jail,\" @maureendowd writes. \"Lock him up!\" https://t.co/HS5zUYC73s",
  "data/tweet-nytimes/2022/6/1535739562089119744.json": "\"This is a renaissance.\"\n\nThe nation's HBCUs are experiencing a boom in enrollment, as they're embraced by a generation shaped by the first Black president, Black Lives Matter and shifting views on what constitutes the pinnacle of higher education. https://t.co/t3mqgCDiVJ https://t.co/72A7lV24cF",
  "data/tweet-nytimes/2022/6/1535309591847780352.json": "Ukraine is running short of Soviet-era ammunition and has not received enough from its allies, hampering its artillery war in the country’s east to keep the Russians at bay, officials say. https://t.co/ywhQPFaG6l",
  "data/tweet-nytimes/2022/6/1535700913289052162.json": "Moderna’s coronavirus vaccine for children under 6 is effective in preventing symptomatic infection without causing worrisome side effects, the Food and Drug Administration said on Friday night. https://t.co/hPQVyjlpVS",
  "data/tweet-nytimes/2022/6/1535984014519111681.json": "Dozens of members of a white supremacist group were arrested on Saturday in Idaho before they could act on plans to riot at a local Pride event, police said. An apparent leader of the group had a seven-page document outlining a plan in extensive detail. https://t.co/46cSB8tihH",
  "data/tweet-nytimes/2022/6/1535975304782614535.json": "The day before Jan. 6, 2021, Mike Pence's chief counsel laid out in a three-page memo that the vice president would violate federal law if he bowed to pressure from Donald Trump to interfere with the certification of Joe Biden's victory. https://t.co/dWVJxlOnX3",
  "data/tweet-nytimes/2022/6/1535693352334675971.json": "He had means, motive and opportunity. But did Donald Trump commit a crime?\n\nSeveral former prosecutors and veteran lawyers said the first prime-time Jan. 6 committee hearing offered the makings of a credible criminal case. https://t.co/W2qELdQVI0",
  "data/tweet-nytimes/2022/6/1536036881238044672.json": "A Senate gun safety plan endorsed by 10 Republicans and 10 Democrats falls far short of reforms long championed by gun control activists and a majority of congressional Democrats. It amounts to notable, albeit narrow, progress amid deep party divisions. https://t.co/WEFNp05vCL https://t.co/KNCaulTD1s",
  "data/tweet-nytimes/2022/6/1536059544559882240.json": "Dozens of members of the right-wing group Patriot Front were detained and charged with conspiracy to riot, after the police said they received a tip that a group of people had jumped into a U-Haul van near a Pride event in Coeur d’Alene, Idaho. https://t.co/nagfJxDerE https://t.co/Sd1CKTVmGb",
  "data/tweet-nytimes/2022/6/1535991577264500742.json": "It’s soft. It’s vegan. It’s made from fossil fuels.\n\nThe fashion industry has been transformed by the rebranding of synthetic materials into hip alternatives like \"vegan leather,\" a marketing masterstroke meant to suggest environmental virtue. https://t.co/sGYW1z8Gx0",
  "data/tweet-nytimes/2022/6/1536067085310238726.json": "They were sterilized without consent as young girls. What does the government owe them — and thousands of other living victims? https://t.co/bBSQ8cxe2D",
  "data/tweet-nytimes/2022/6/1536065922309443586.json": "Google placed an engineer on paid leave after dismissing his claim that its artificial intelligence is sentient. The company’s human resources department said he had violated Google’s confidentiality policy. https://t.co/GUcDXAFT8K",
  "data/tweet-nytimes/2022/6/1535750136759975937.json": "On the 108th day of Vladimir Putin’s unprovoked war on Ukraine, Russia appeared no closer to victory. But its forces did appear to be making slow, methodical and bloody progress toward control of eastern Ukraine. https://t.co/Z3WbcC5WxH",
  "data/tweet-nytimes/2022/6/1536092547965149186.json": "Of the 10 Republican senators supporting a bipartisan deal on gun safety, four are leaving Congress at the end of the year and five are not up for re-election for another four years. Only Mitt Romney of Utah will face voters in 2024. https://t.co/ERcK7TwGwY https://t.co/q3YKb1MZlx",
  "data/tweet-nytimes/2022/6/1536101060493852672.json": "President Jair Bolsonaro of Brazil is trailing in polls for the country’s presidential race. He said that if he loses, it will most likely be thanks to a stolen vote.\n\nNow he has enlisted a new ally in his fight against the electoral process: the military. https://t.co/lta4NLNiV8",
  "data/tweet-nytimes/2022/6/1536124998213156865.json": "The House Jan. 6 committee plans to use the testimony of Donald Trump's own campaign manager, Bill Stepien, against the former president on Monday, as it lays out evidence that Trump knowingly spread the lie that the 2020 election was stolen. https://t.co/JH6gAv2PIU",
  "data/tweet-nytimes/2022/6/1536018483275874305.json": "Breaking News: Senators struck a bipartisan deal on a narrow set of gun safety measures, bringing them closer to ending a yearslong congressional impasse. https://t.co/ecWuK8VSkN",
  "data/tweet-nytimes/2022/6/1536185991995830273.json": "Jennifer Hudson just became an EGOT at the #TonyAwards. 🏆\n\nWhen \"A Strange Loop\" won best new musical, Hudson, one of the show’s co-producers, joined a select group of people who have won an Emmy, Grammy, Oscar and Tony. https://t.co/aP7CS5W3hZ https://t.co/tT8ec5wPSM",
  "data/tweet-nytimes/2022/6/1536156557867622402.json": "Patti LuPone, one of Broadway’s most beloved stars, won her third Tony Award for her showstopping performance as Joanne in the revival of Stephen Sondheim’s \"Company.\" #TonyAwards https://t.co/63hBqIELkM https://t.co/uXpyMkHzBP",
  "data/tweet-nytimes/2022/6/1536182518730326017.json": "Myles Frost, 22, won his first Tony Award for his depiction of Michael Jackson in “MJ.” In his acceptance speech, he thanked his mom. \n\n\"You taught me and showed me what a strong Black woman is and what it means to raise a strong Black man.\" #TonyAwards https://t.co/UWbyVb7s3y https://t.co/60cwKAgJzq",
  "data/tweet-nytimes/2022/6/1536089721545404416.json": "McDonald’s restaurants reopened in Russia this weekend, but without the Golden Arches. After the American fast-food giant pulled out this spring to protest Vladimir Putin's invasion of Ukraine, a Siberian oil mogul bought its 840 Russian stores. https://t.co/G6n3PMgwlO https://t.co/EEwaOFPgz7",
  "data/tweet-nytimes/2022/6/1536180037824675840.json": "Joaquina Kalukango, who plays a resilient Civil War-era bar owner in “Paradise Square,” just won her first Tony for best leading actress in a musical. #TonyAwards https://t.co/y60b9VDy0e https://t.co/aWF34sGoMb",
  "data/tweet-nytimes/2022/6/1535615232147595264.json": "Gasoline prices reached a grim milestone on Saturday, as the national average for regular gasoline reached $5 a gallon.\n\nA year ago, gas sold for $3.08. https://t.co/fUY7k4OYA8",
  "data/tweet-nytimes/2022/6/1535980251402194945.json": "For 20 years, the U.S. military tightly controlled what the world saw of Guantánamo Bay detainees. Few explicit images of prisoners became public. Until now.\n\nThe New York Times obtained photos from the secret Pentagon archive of the prison's first days. https://t.co/E3mOQXArSv",
  "data/tweet-nytimes/2022/6/1536302419021266944.json": "Jennifer Hudson became an EGOT at the #TonyAwards on Sunday. 🏆\n\nWhen \"A Strange Loop\" won best new musical, Hudson, one of the show's co-producers, joined a select group of people who have won an Emmy, Grammy, Oscar and Tony. https://t.co/eVPpp8hgwr https://t.co/i4UwkWL1V1",
  "data/tweet-nytimes/2022/6/1536205760362864642.json": "Google has settled a class-action lawsuit that accused it of systematically underpaying women, promising to provide $118 million in monetary relief and invite outsiders to review its practices. https://t.co/fswrnMGIfX",
  "data/tweet-nytimes/2022/6/1536328809301024773.json": "Google placed an engineer on paid leave after dismissing his claim that its AI is sentient.\n\nThe company said its systems imitated conversational exchanges but did not have consciousness. https://t.co/zDUdQENPhs https://t.co/yAingzDnQV",
  "data/tweet-nytimes/2022/6/1535995363366260736.json": "The New York Times obtained secret Pentagon photos of the first prisoners brought to Guantánamo Bay.\n\nIf taken by news photographers, these images of the wartime prison would not survive censorship rules imposed by the U.S. military at Guantánamo today. https://t.co/YRUsuzBtQq https://t.co/DLjVTzcnfE",
  "data/tweet-nytimes/2022/6/1536337604085530624.json": "The criminal trial of a man who carried a Confederate flag into the Capitol during the Jan. 6 attack begins on Monday. The man and his son have been charged with crimes including obstructing the final certification of the presidential election.\nhttps://t.co/AINQkL4jNj",
  "data/tweet-nytimes/2022/6/1536218836315389953.json": "Andrew Giuliani said he will not be able to attend the first Republican debate in the New York City governor’s race unless he sends proof of his Covid vaccination status, which he will not do. He says he is unvaccinated and has \"natural immunity.\" https://t.co/HxNwYP2h5E",
  "data/tweet-nytimes/2022/6/1536383891602386946.json": "Breaking News: Former Attorney General Bill Barr suggested Donald Trump had grown \"detached from reality\" on his election fraud claims, as multiple aides testified to the House Jan. 6 committee they told him he'd lost. https://t.co/bNinLyfQd8",
  "data/tweet-nytimes/2022/6/1536366561304678403.json": "Fox News is broadcasting the second day of the House committee hearing on the Jan. 6 attack after not carrying the first day. The network's hosts told their audience that the committee hearing last week was nothing more than \"propaganda.\" https://t.co/hOV3ctrd0z",
  "data/tweet-nytimes/2022/6/1536359649917779970.json": "Breaking News: A new Ohio law cuts the training required for teachers and staff to carry guns in schools to a maximum of 24 hours, down from 700. https://t.co/3QG6sWZcCK",
  "data/tweet-nytimes/2022/6/1536074623816806405.json": "Al Horford, the Boston Celtics center, is the first Dominican player in the N.B.A. finals. With the way he’s competing, it’s hard to tell he hasn’t been here before. https://t.co/x74S7D99rE",
  "data/tweet-nytimes/2022/6/1536380381259341829.json": "The House committee investigating the Jan. 6 attack began Monday’s hearing with its chairman laying out how it would show that Donald Trump knowingly spread the lie that the 2020 election was stolen from him. https://t.co/tK1k8sH8YK https://t.co/b4kvYrz49O",
  "data/tweet-nytimes/2022/6/1536372842136469505.json": "Russia earned what is very likely a record 93 billion euros in revenue from exports of oil, gas and coal in the first 100 days of the country’s invasion of Ukraine. The revenue exceeds what Russia is spending on the war. https://t.co/bNJuqRRsmf",
  "data/tweet-nytimes/2022/6/1536407248968335362.json": "Breaking News: Donald Trump’s aides testified to the House Jan. 6 committee, one after another, that they told him claims of a stolen election were bogus, but that he pushed them anyway. https://t.co/1yFAit4zYC",
  "data/tweet-nytimes/2022/6/1536413125930586112.json": "The House Jan. 6 committee hearing focused on the origins and spread of President Trump’s lie of a stolen election, including efforts to raise money off the false claims. https://t.co/brudl2F0zQ https://t.co/ij3nPyQSZM",
  "data/tweet-nytimes/2022/6/1536309164732973057.json": "In Opinion\n\nReforming Australia’s gun laws was possible thanks largely to “the shared norm of bipartisanship and the willingness of conservatives, acting on principle, to risk alienating their base,” says Aaron Timms, a writer from Sydney, in a guest essay.https://t.co/4iWjnZzQOf",
  "data/tweet-nytimes/2022/6/1536420649203290113.json": "The one big theme on the second day of the Jan. 6 committee's hearings was that Donald Trump was told repeatedly that his \"big lie\" about a fraudulent election was baseless — but he made the fake claim on election night anyway. Here are some takeaways. https://t.co/21zr7nVfIk",
  "data/tweet-nytimes/2022/6/1536400558214594561.json": "Kevin Spacey was charged with four counts of sexual assault on Monday in London. The actor will appear in a London court on Thursday to start a likely lengthy trial. https://t.co/uXcxXcBacK",
  "data/tweet-nytimes/2022/6/1536449628056567808.json": "Former Attorney General Bill Barr suggested Donald Trump had grown \"detached from reality\" on his election fraud claims, as multiple aides testified to the House Jan. 6 committee they told him he'd lost. https://t.co/hz63dMOD8M https://t.co/0ge515g0x4",
  "data/tweet-nytimes/2022/6/1536473504106921987.json": "A mountain in Yellowstone National Park, named for an Army officer who led a massacre in which at least 173 Native Americans were slaughtered, has been renamed First Peoples Mountain in honor of America’s Indigenous people, the National Park Service said. https://t.co/z2RgaiBuxk",
  "data/tweet-nytimes/2022/6/1536465974559481858.json": "On the second day of hearings, the Jan. 6 committee used interviews with Donald Trump’s own family and closest advisers to illustrate how he rejected advice and falsely claimed he won the election. https://t.co/Ohi2vmFIHV https://t.co/vXjzcSNJer",
  "data/tweet-nytimes/2022/6/1536394745014099969.json": "The House Jan. 6 committee hearing included testimony from Chris Stirewalt, the former political editor of Fox News, who described in detail his data-driven analysis that concluded on election night that President Trump had lost. https://t.co/OXnOEsi6A5 https://t.co/HgO249sdPw",
  "data/tweet-nytimes/2022/6/1536508742166007811.json": "The FDA on Monday approved a drug that restores hair growth in many alopecia patients by blocking the immune system from attacking hair follicles. https://t.co/zxfmWCsdlh",
  "data/tweet-nytimes/2022/6/1536496158402613248.json": "The Jan. 6 committee said that Donald Trump’s campaign, a related political action committee and his allies raised $250 million by claiming they were fighting widespread election fraud at a time when they knew there was none. https://t.co/tESBYTZ9dU https://t.co/TSvFeVj2ih",
  "data/tweet-nytimes/2022/6/1536470995258703874.json": "Former Attorney General Bill Barr suggested Donald Trump had grown \"detached from reality\" on his election fraud claims, as multiple aides testified to the House Jan. 6 committee they told him he'd lost. https://t.co/ePvQiEoaOH https://t.co/4aSQt2itzs",
  "data/tweet-nytimes/2022/6/1536181593101975553.json": "Meet Daniel Naroditsky, the New York Times's new chess columnist. He's an author, tutor and chess grandmaster — the highest title given to competitors by the International Chess Federation. He will be publishing his first Times chess puzzle on Monday. https://t.co/ZbjT7mlSFa",
  "data/tweet-nytimes/2022/6/1536513770981294082.json": "Several of Donald Trump’s closest advisers urged him not to declare victory on election night in 2020. Instead, he listened to Rudy Giuliani. https://t.co/Aw4H42TtlB",
  "data/tweet-nytimes/2022/6/1536460921576603652.json": "Eugene Goodman, the Capitol Police officer who led a pro-Trump mob away from the entrance to the Senate chamber during the Jan. 6 attack, testified for the first time on Monday about his experience holding off the rioters. https://t.co/HvjSzN3wJ8 https://t.co/7WCT9GfMJs",
  "data/tweet-nytimes/2022/6/1536317512547172355.json": "Three doses of the Pfizer-BioNTech coronavirus vaccine appear to be effective in preventing Covid illness in children under 5, the FDA said on Sunday. https://t.co/hQxyHmJB4M",
  "data/tweet-nytimes/2022/6/1536498710988959745.json": "Brittney Griner’s WNBA team, the Phoenix Mercury, met with U.S. State Department officials to discuss the status of her detainment. She has been held in Russia since Feb. 17, after customs officials accused her of carrying hashish oil in her luggage. https://t.co/IFkBcLsGBE",
  "data/tweet-nytimes/2022/6/1536634621701591040.json": "President Volodymyr Zelensky gave a speech wearing a T-shirt designed by a Singaporean teenager.\n\n“It’s a young Ukrainian girl defiantly painting a new future because self-belief is the best middle finger to oppression,” the 16-year-old designer said.\nhttps://t.co/6h4Ej8gj1f",
  "data/tweet-nytimes/2022/6/1536646168012267520.json": "Russia earned what is very likely a record 93 billion euros in revenue from exports of oil, gas and coal in the first 100 days of the country’s invasion of Ukraine, a new analysis shows. The revenue exceeds what Russia is spending on the war. https://t.co/rNDfnIhFee",
  "data/tweet-nytimes/2022/6/1536619732685791232.json": "In Opinion\n\n“The longer Germany, the most powerful and influential country on the continent, hesitates, the more devastation Mr. Putin can unleash,” says Jagoda Marinić, who writes about German politics. “There should be no more time for delay.”\nhttps://t.co/Y1NQif5vA1",
  "data/tweet-nytimes/2022/6/1536673831120785409.json": "Derek Kammerzell, an assistant police chief in Kent, Washington, was placed on paid administrative leave after he taped a Nazi insignia to his office door in 2020.\n\nHe will now be paid more than $1.5 million to resign.\nhttps://t.co/IC8NHrg6pd",
  "data/tweet-nytimes/2022/6/1536715108281421826.json": "The FDA on Monday approved a drug that restores hair growth in many alopecia patients by blocking the immune system from attacking hair follicles. https://t.co/hOCzDr6Y34",
  "data/tweet-nytimes/2022/6/1536430737464999936.json": "SpaceX can launch a giant new rocket to orbit from South Texas, the FAA said on Monday. Starship is central to NASA’s plans to return to the moon as well as the vision of Elon Musk, the company’s founder, to colonize Mars. https://t.co/K80jGaaQsF",
  "data/tweet-nytimes/2022/6/1536689942772035585.json": "Houston hasn’t ended homelessness, but it shows progress is possible.\n\nThrough cooperation, trust and grinding effort, the city has made remarkable progress moving people from the streets into homes of their own. https://t.co/sk2GLxNOpl",
  "data/tweet-nytimes/2022/6/1536747867997601793.json": "The FDA on Monday approved a drug that restores hair growth in many alopecia patients. The approval is important for insurance coverage of these expensive drugs, which have a list price of nearly $2,500 a month. https://t.co/4RQPr0DrnH https://t.co/pR8hmVtm0g",
  "data/tweet-nytimes/2022/6/1536721386709852161.json": "Lizzo, a Grammy-winning singer, changed a lyric on her song “Grrrls” within days of its release after it was criticized for containing a derogatory term for people with disabilities. “This is the result of me listening and taking action,” she said. https://t.co/bvGSvkT0va",
  "data/tweet-nytimes/2022/6/1536708817127366656.json": "Happy, an elephant that has been at the Bronx Zoo for more than 40 years, is not a person, New York’s highest court ruled. The decision was a legal blow for animal rights activists who argued she was being illegally detained. \nhttps://t.co/9UcbVnbCI6 https://t.co/kxS5hFbIUc",
  "data/tweet-nytimes/2022/6/1536781784603578371.json": "Flooding caused by record rainfall washed away roads and destroyed houses in Yellowstone National Park. Visitors were evacuated and entrances were closed. It was unclear when the park would reopen. https://t.co/PVuIE94TuZ https://t.co/H0YggLQm2C",
  "data/tweet-nytimes/2022/6/1536804256187031553.json": "After nearly a decade together, the seven members of BTS need some time apart.\n\nThe K-pop juggernaut will take a break to allow its members to explore solo careers, the singers announced by video. https://t.co/ve5IKhs3gg",
  "data/tweet-nytimes/2022/6/1536818282208141312.json": "After nearly a decade together, the seven members of BTS need some time apart.\n\nThe K-pop juggernaut will take a break to allow its members to explore solo careers, the singers announced by video. https://t.co/h3CViKnxVe https://t.co/qWm3IPW93O",
  "data/tweet-nytimes/2022/6/1536755419598692353.json": "Why do cats love catnip? They brim with euphoria, getting high off the stuff. Researchers believe it has an evolutionary advantage. https://t.co/2sUvYUu8UA https://t.co/nBSApgETyl",
  "data/tweet-nytimes/2022/6/1536672054631710720.json": "South Asian nations, home to hundreds of millions of humanity’s most vulnerable, are on the front lines of climate change.\n\nAs climatic extremes become the norm, it’s growing more difficult to address poverty, food security and health challenges.\nhttps://t.co/iqlhtPVZX4 https://t.co/XvAjPGbRRC",
  "data/tweet-nytimes/2022/6/1536846004733059075.json": "Chess is an ancient game that traces its roots back to India. Let reading this guide be your first step toward learning one of the most popular board games of all time. https://t.co/UfEsoHLv13",
  "data/tweet-nytimes/2022/6/1536966807294197761.json": "BTS is taking some time apart — a move that J-Hope called a \"healthy, important part of our plan that will let BTS grow stronger.\" \n\nThe seven members, each an individual pop sensation, will take some time to explore their solo identities, they said.\nhttps://t.co/TttAEQTMbv https://t.co/eLAgCx79uW",
  "data/tweet-nytimes/2022/6/1536917692011188225.json": "Rep. Nancy Mace, a Republican who clashed with Donald Trump after the Jan. 6 attack, fended off a primary challenge in South Carolina. \nhttps://t.co/nXGZzD5Cfb",
  "data/tweet-nytimes/2022/6/1536951660106465281.json": "President Biden plans to appoint Keisha Lance Bottoms, the former mayor of Atlanta, to his White House staff as a senior adviser, a White House official said.\n\nShe will succeed Cedric Richmond as head of the White House Office of Public Engagement. https://t.co/X9O8zdTxo2",
  "data/tweet-nytimes/2022/6/1537027232757174280.json": "Herschel Walker, the Republican nominee for Senate from Georgia, who has often spoken out against absentee fathers, publicly acknowledged having fathered a second son with whom he is not in contact. https://t.co/xWytvFJ3KJ",
  "data/tweet-nytimes/2022/6/1537008537204838401.json": "Three women in China were savagely beaten by a group of men after one of the women rejected an advance.\n\nThe attack set off a debate over women’s rights and the threat of sexual violence. It also highlighted how divisive feminism remains in the country.\nhttps://t.co/JPA2gw6Uai",
  "data/tweet-nytimes/2022/6/1536896294161108992.json": "Russian and Belarusian tennis players will be allowed to compete in the U.S. Open. \"We chose not to hold the individual athletes accountable for the decisions of their respective governments,\" said the chief executive of the U.S. Tennis Association. https://t.co/wvTxMNrTHq",
  "data/tweet-nytimes/2022/6/1536926486250266625.json": "Sharon Oster, an economist who shattered glass ceilings in academia as the first woman to become a tenured professor of the Yale School of Management and later as the first woman to be named its dean, died on Friday. She was 73. https://t.co/wy9MnytZ0z",
  "data/tweet-nytimes/2022/6/1537042310344716289.json": "President Biden plans to appoint Keisha Lance Bottoms, the former mayor of Atlanta, to his White House staff as a senior adviser, a White House official said.\n\nShe will succeed Cedric Richmond as head of the White House Office of Public Engagement. https://t.co/lr02E5tFEb",
  "data/tweet-nytimes/2022/6/1537095109895913472.json": "President Biden chastised some of the largest oil companies for profiteering off surging energy prices. \"At a time of war, refinery profit margins well above normal being passed directly onto American families are not acceptable,\" he wrote in a letter. https://t.co/QO5z0P4prZ",
  "data/tweet-nytimes/2022/6/1537032200478150657.json": "Women can no longer access a legal abortion in Oklahoma and South Dakota. In Missouri, they can no longer make an appointment.\n\nRoe v. Wade remains the law of the land, but health care providers in some states are operating as if it were overturned.\nhttps://t.co/iIBNEmTamk",
  "data/tweet-nytimes/2022/6/1536838469439434753.json": "Bayou Dave has spent the last dozen years ridding a trash-choked Houston waterway of plastic and Styrofoam. He and his longtime deckhand haul the equivalent of about 250 full garbage bags out of the water each week. https://t.co/sneyK1pci8 https://t.co/wH6Lwg44Y9",
  "data/tweet-nytimes/2022/6/1537135459008143361.json": "Breaking News: The Federal Reserve raised interest rates by 0.75%, the biggest single increase since 1994, signaling its urgency in the fight against inflation. https://t.co/LXMt53ittm",
  "data/tweet-nytimes/2022/6/1537130593154113536.json": "Breaking News: President Biden promised another $1 billion in military aid to Ukraine, including more long-range weapons. https://t.co/2dcAMWMLeH",
  "data/tweet-nytimes/2022/6/1537152233988571136.json": "Over 10,000 visitors have evacuated Yellowstone after heavy rains and severe flooding slammed the national park, destroying roads and threatening homes. \"I’ve heard this is a thousand-year event,\" said the superintendent of the park. https://t.co/6QG0Ujeufh https://t.co/PWHWGbwCbF",
  "data/tweet-nytimes/2022/6/1537151742076407808.json": "A man who toured the Capitol with Rep. Barry Loudermilk the day before the Jan. 6 attack later marched on the building, the Jan. 6 committee said. The complex was closed to the public at the time and the group entered three different office buildings. https://t.co/4KdVV5oWgz",
  "data/tweet-nytimes/2022/6/1537185701770448897.json": "Confirmed: Dogs are still great. https://t.co/Bk9HnyLR9Q https://t.co/zpNmiPOtOD",
  "data/tweet-nytimes/2022/6/1537170617501466629.json": "Internet Explorer was officially retired Wednesday. The web browser, introduced by Microsoft in 1995, was loved and loathed by a generation. \"Even though I don’t use it anymore, I'm still going to miss the idea of it,\" said one user. https://t.co/tmJG7DQx1A",
  "data/tweet-nytimes/2022/6/1537225966488940544.json": "A Delaware man who flew a Confederate battle flag inside the Capitol on Jan. 6, 2021, was convicted with his son on Wednesday by a federal judge of the top count in their indictment: obstructing the certification of the 2020 presidential vote. https://t.co/WdQnZ4lAoV",
  "data/tweet-nytimes/2022/6/1537161346311245826.json": "Breaking News: FDA advisers recommended that the Moderna and Pfizer coronavirus vaccines be authorized for children as young as 6 months old. Regulators could authorize both vaccines for use on an emergency basis later this week. https://t.co/iShu6oifTt",
  "data/tweet-nytimes/2022/6/1537253668780638208.json": "President Biden signed an executive order on Wednesday aimed at protecting LGBTQ people from a cascade of legislation in conservative states that increasingly targets the rights of gays, lesbians, transgender youth and others. https://t.co/dtvh3S3nop",
  "data/tweet-nytimes/2022/6/1537060633686024194.json": "Breaking News: Over the course of 10 months, nearly 400 car crashes in the U.S. involved advanced driver-assistance technologies, data from the country's top auto-safety regulator revealed.\nhttps://t.co/YVJr0zqNQe",
  "data/tweet-nytimes/2022/6/1537194492142526466.json": "A fisherman has confessed that he helped kill a British journalist and a Brazilian expert on Indigenous peoples and then went with the authorities to look for their bodies, according to Brazilian federal police. The men were missing since June 5. https://t.co/xljSUWz0al",
  "data/tweet-nytimes/2022/6/1537263716022071296.json": "Scientists are raising the alarm that in the coming years destruction related to climate change will reach nearly all 423 national parks in the U.S., which are particularly vulnerable to rising temperatures. https://t.co/10JvAYTzyw",
  "data/tweet-nytimes/2022/6/1537063861056065538.json": "“Lightyear,” an animated Disney film, is facing bans or restrictions in parts of Southeast Asia and the Middle East over a scene that shows a kiss between two women.\n\nThe United Arab Emirates has banned the film, and Malaysia has asked Disney to cut scenes.https://t.co/JiTzQKE2UF",
  "data/tweet-nytimes/2022/6/1537356839024738304.json": "The leaders of France, Germany and Italy traveled to Ukraine on Thursday and will meet with President Volodymyr Zelensky for the first time since Russia’s invasion began. The visit comes as questions mount over European support for Ukraine.\nhttps://t.co/G9TerIdNTR https://t.co/QPyfy80jUF",
  "data/tweet-nytimes/2022/6/1537280073123913728.json": "Breaking News: A lawyer advising Donald Trump claimed to know about a “heated fight” among Supreme Court justices over whether to hear 2020 election arguments. https://t.co/4XCCSKmaDc",
  "data/tweet-nytimes/2022/6/1537366379568848896.json": "Students in Hong Kong will soon be given textbooks that say Hong Kong was never a British colony. \n\nThe books are part of China’s effort to instill a historical narrative in a city where a pro-democracy movement was crushed. https://t.co/m7Qolkigcg",
  "data/tweet-nytimes/2022/6/1537159295921541126.json": "The 41-year-old who leads the crypto exchange Kraken has challenged the use of preferred pronouns, debated who can use racial slurs and called women in the U.S. “brainwashed\" — igniting a culture war among his more than 3,000 workers. https://t.co/u8M588awki",
  "data/tweet-nytimes/2022/6/1537418491191611392.json": "The leaders of Italy, Germany, France and Romania met with President Volodomyr Zelensky of Ukraine in Kyiv in a show of support. The European leaders also toured Irpin, where Russian soldiers are accused of committing atrocities.\n\nFollow our updates.\nhttps://t.co/dVzH4YgYSn https://t.co/OkVS0vpekU",
  "data/tweet-nytimes/2022/6/1537433831459807234.json": "A new Beyoncé album is coming.\n\nThe new project, called “Renaissance,” apparently with the subtitle “Act I,” will be released on July 29, according to the the singer’s social media accounts.\nhttps://t.co/ljzQdoR9o5",
  "data/tweet-nytimes/2022/6/1537475802228572163.json": "Herschel Walker, the Republican nominee for Senate in Georgia who has been a frequent critic of absentee fathers, has now acknowledged having fathered three additional children he had not previously mentioned publicly. https://t.co/T8R3g7w25q",
  "data/tweet-nytimes/2022/6/1537461686927515648.json": "A wooden gallows, carrying a chilling threat against officials in the Capitol building, remains one of the most disturbing images from the Jan. 6 attack, though who built it remains a mystery. It may be mentioned again in Thursday’s hearing. https://t.co/riA6bjEvwv https://t.co/yhXYMm7TrR",
  "data/tweet-nytimes/2022/6/1537491603979390980.json": "Judge J. Michael Luttig, who consulted with an adviser to Mike Pence ahead of Jan. 6, testified that if Pence obeyed Donald Trump's \"orders\" about Electoral College votes, it would have \"plunged\" America into \"a revolution within a constitutional crisis.\" https://t.co/Gpx6mzAY4Z",
  "data/tweet-nytimes/2022/6/1537483713466204160.json": "The House Jan. 6 committee released footage of a man who toured the Capitol complex with a Republican lawmaker the day before the attack. The man later marched on the building while making threats against Speaker Nancy Pelosi and other Democrats. https://t.co/1lfo4rHenR https://t.co/lm9uM05hQc",
  "data/tweet-nytimes/2022/6/1537499018661617665.json": "SpaceX employees wrote an open letter to executives about Elon Musk’s behavior on Twitter, calling it “a frequent source of distraction and embarrassment.” The letter follows recently publicized allegations of sexual misconduct against Musk. https://t.co/kAPvwUQGD9",
  "data/tweet-nytimes/2022/6/1537521834794557440.json": "Breaking News: John Eastman, who advised Donald Trump on overturning the 2020 election, sought a pardon from Rudy Giuliani after the Capitol riot, the Jan. 6 panel said. https://t.co/M2IYG6XGMJ",
  "data/tweet-nytimes/2022/6/1537515393807536134.json": "If Mike Pence obeyed Donald Trump’s orders not to certify the Electoral College votes, it would have put the U.S. into “a revolution within a constitutional crisis,” J. Michael Luttig, a retired judge said to the vice president's advisor ahead of Jan. 6. https://t.co/vFumpDySvJ https://t.co/tHLx2tmx3U",
  "data/tweet-nytimes/2022/6/1537520436485013508.json": "Federico Carboni on Thursday became the first person in Italy to die by legal assisted suicide. Paralyzed 12 years ago in a traffic accident, he faced a series of legal, bureaucratic and financial hurdles in his pursuit of death. https://t.co/doRy32tnkQ",
  "data/tweet-nytimes/2022/6/1537538016532733955.json": "President Volodymyr Zelensky of Ukraine appeared in the form of a hologram before four European digital festivals on Thursday, asking the region’s innovators to help rebuild his country. “We live in a time of super opportunities,” he said. https://t.co/9TNJMaZ7me",
  "data/tweet-nytimes/2022/6/1537413460262277120.json": "Ghislaine Maxwell, pleading for mercy two weeks before she is to be sentenced in her sex-trafficking case, had her lawyers send a memo to the judge blaming her actions on a \"difficult, traumatic childhood\" and on her relationship with Jeffrey Epstein. https://t.co/SOjR0H8qKg",
  "data/tweet-nytimes/2022/6/1537550612317057025.json": "John Eastman, the lawyer who insisted that Mike Pence had the power to unilaterally reject the Electoral College results before they were certified, suggested days after the Capitol riot that he should be on the list for a presidential pardon. https://t.co/bcXI68HxGP https://t.co/AEjVkRjgBx",
  "data/tweet-nytimes/2022/6/1537502673070698497.json": "Breaking News: A lawyer advising Donald Trump on his plan to overturn the election acknowledged to him that it was illegal, an aide to Mike Pence testified. https://t.co/Dey4KnqTIu",
  "data/tweet-nytimes/2022/6/1537485325521817600.json": "Representative Liz Cheney, the vice chairwoman of the House Jan 6. committee, started the panel's third public hearing by describing Donald Trump's efforts to stay in office as \"illegal and unconstitutional.\" https://t.co/lPfIOvIANn",
  "data/tweet-nytimes/2022/6/1537616044147281920.json": "A lawsuit filed last week by a South Florida synagogue challenges new legislation in the state banning most abortions after 15 weeks, saying it violates the State Constitution’s right to privacy and freedom of religion.\nhttps://t.co/KgwMUfVPPj",
  "data/tweet-nytimes/2022/6/1537385769823870976.json": "Students in Hong Kong will soon be given textbooks that say Hong Kong was never a British colony.\n\nThe books are part of China’s effort to instill a historical narrative in a city where a pro-democracy movement was crushed. https://t.co/Ubm7X1xmk3",
  "data/tweet-nytimes/2022/6/1537640718956744705.json": "Golden State won its fourth title in eight seasons, beating the Boston Celtics in Game 6 of the NBA finals. \nhttps://t.co/JDxwbTu3UR",
  "data/tweet-nytimes/2022/6/1537706637573619717.json": "SpaceX fired employees who helped write and distribute an open letter criticizing Elon Musk's public behavior and tweeting, said three employees with knowledge of the situation. https://t.co/WWxZRuXEzj",
  "data/tweet-nytimes/2022/6/1537545567978520583.json": "For many of Johnny Depp’s fans, “the actor’s physical appeal offered an external manifestation of inner worth,” Rhonda Garelick writes. While Amber Heard’s beauty “was frequently held against her, offered as proof of her capacity to deceive.” https://t.co/OvWdEzlCVa",
  "data/tweet-nytimes/2022/6/1537752002264014848.json": "Golden State won the NBA championship after defeating the Boston Celtics, 103-90, on Thursday.\n\nStephen Curry was named the most valuable player of the finals. “Without him, none of this happens,” Golden State Coach Steve Kerr said.\nhttps://t.co/t6aAeWqiET https://t.co/Z6YmIU4rCx",
  "data/tweet-nytimes/2022/6/1537745296704299008.json": "Breaking News: The European Commission recommended Ukraine for EU candidacy, the first formal step in a process that normally takes more than a decade. https://t.co/8hty3nKPUV",
  "data/tweet-nytimes/2022/6/1537532998547021824.json": "Mike Pence made it clear he's considering a 2024 presidential bid by traveling to early states and endorsing candidates opposed by Donald Trump. Pence told The New York Times he's heard gratitude from voters for refusing to bend to pressure. https://t.co/RE0GGvWphX",
  "data/tweet-nytimes/2022/6/1537657589051314181.json": "BTS has become not only a cultural sensation, but also a powerful stakeholder in South Korea's economy.\n\nIn just one day after the group announced it would be taking a break to focus on solo projects, the band's label, HYBE, saw its stock price plunge 28%. https://t.co/WAyHLCue8C https://t.co/yTTzDa6yh9",
  "data/tweet-nytimes/2022/6/1537483900498235393.json": "Revlon filed for bankruptcy this week. The cosmetics brand has struggled to attract younger shoppers who are choosing celebrity makeup lines like those by Kylie Jenner and Rihanna. https://t.co/HNp9DMAoIl",
  "data/tweet-nytimes/2022/6/1537774583046193155.json": "SpaceX fired employees who helped write and distribute an open letter criticizing Elon Musk's public behavior and tweeting, said three employees with knowledge of the situation. https://t.co/IPVl2XIuBr",
  "data/tweet-nytimes/2022/6/1537796874853355523.json": "Breaking News: Vince McMahon, the WWE executive, has stepped down while the company investigates allegations of misconduct against him.\nhttps://t.co/vDxY2k9cXL",
  "data/tweet-nytimes/2022/6/1537554388482506753.json": "Donald Trump condemned Mike Pence even as he knew rioters were violently storming the Capitol while his vice president was inside, the House committee investigating Jan. 6 said.\n\nPence fled for his life, and at one point was just 40 feet away from the mob. https://t.co/H4oxgU3DpZ",
  "data/tweet-nytimes/2022/6/1537760734033199106.json": "President Vladimir Putin’s appearance at the St. Petersburg International Economic Forum was delayed by “large-scale” cyberattacks on the conference’s computer systems, the Kremlin said.\nhttps://t.co/w61L2C0GOL"
}