{
  "data/tweet-wsj/2021/7/1410395268625977345.json": "Comedian Kevin Hart is building an entertainment empire, signing deals with major streaming platforms, publishing a children's book and debuting an Olympics show. His success is earning him praise: “He’s ambitious and he wants to win.\" https://t.co/oRTNCOl8b5",
  "data/tweet-wsj/2021/7/1410421669169188864.json": "A New York grand jury has indicted the Trump Organization and its CFO with tax-related crimes that will be made public Thursday in court, people familiar with the matter said https://t.co/nHRzmZHBw8",
  "data/tweet-wsj/2021/7/1410448104801853449.json": "The original files of the source code for the World Wide Web were sold at auction as a nonfungible token, or NFT, for $5.4 million https://t.co/0F06uNYEFo",
  "data/tweet-wsj/2021/7/1410512278282199042.json": "Chinese leader Xi Jinping warned that foreign bullies will be “battered and bloodied,” as his ruling Communist Party marked its 100th anniversary https://t.co/AClgML2pWh",
  "data/tweet-wsj/2021/7/1410553802537717762.json": "As New York Gov. Andrew Cuomo gears up to campaign for a fourth term, a poll suggests that more than 60% of voters would rather see him resign immediately or not run again https://t.co/e82AEcxJCx",
  "data/tweet-wsj/2021/7/1410436759591268354.json": "The U.S. and Taiwan revived dormant trade and investment talks and pledged to keep supply chains free from forced labor, in a dig at China, which has objected to the negotiations https://t.co/37wrj4ZeLM",
  "data/tweet-wsj/2021/7/1410402836232474628.json": "Rental cars are hard to find in Hawaii. “By the time I checked, the only options were Teslas and Maseratis.” Tourists are turning to Craigslist, bikes and moving vans. https://t.co/hZE6q2yA2y",
  "data/tweet-wsj/2021/7/1410560051954257921.json": "Trump Organization CFO Allen Weisselberg surrendered to New York prosecutors as he and the company face charges over its tax dealings https://t.co/Qu3WCGk3hK",
  "data/tweet-wsj/2021/7/1410557566095081477.json": "Swedish fashion chain H&amp;M put a number on the cost of upsetting China: about $75 million in lost sales last quarter https://t.co/OY9V8LBr49",
  "data/tweet-wsj/2021/7/1410610416737157132.json": "From @WSJopinion: The Chinese Communist Party’s 100th anniversary is no occasion for joy, as the Party retains its grip on power and threatens global peace https://t.co/C3ckirt9qu",
  "data/tweet-wsj/2021/7/1410608185291927566.json": "The Supreme Court ruled California went too far in requiring charities to disclose their major donors, finding the policy infringed on First Amendment rights https://t.co/VWvucJWdcs",
  "data/tweet-wsj/2021/7/1410624168605978625.json": "The U.S. has won international backing for a global minimum corporate tax, including support from China and India, people familiar with the matter say. It's a major step toward a final deal. https://t.co/S9UY45gqxx",
  "data/tweet-wsj/2021/7/1410595325874745344.json": "Singapore is making plans to shift to a new phase in Covid-19 management—one in which the virus still circulates but becomes more manageable, like the flu  https://t.co/IP5zThz8VM",
  "data/tweet-wsj/2021/7/1410620742442573825.json": "House Speaker Nancy Pelosi named Liz Cheney to the Jan. 6 Capitol riot select committee, tapping the Republican congresswoman as one of her eight picks https://t.co/bPWCWsnQCI",
  "data/tweet-wsj/2021/7/1410648159508893698.json": "Companies are paying $1,000, and more, to hire housekeepers, food servers, drivers and other hourly workers as companies grow more desperate to fill open roles https://t.co/eG3iBtXDHG",
  "data/tweet-wsj/2021/7/1410672314547589120.json": "Breaking: The Trump Organization was indicted for fraud and its finance chief Allen Weisselberg was indicted for grand larceny in the first criminal case resulting from a multiyear probe into Donald Trump's business affairs https://t.co/flgupK6w6N",
  "data/tweet-wsj/2021/7/1410708554244399105.json": "Patients receiving emergency medical care would no longer get surprise medical bills from providers outside their insurance network under a rule issued Thursday by the Biden administration https://t.co/KDSFV8i8us",
  "data/tweet-wsj/2021/7/1410745065664782350.json": "The Justice Department ordered a halt to federal executions until it reviews its death-penalty policies, a reversal from the Trump administration https://t.co/IfF7B3Eh39",
  "data/tweet-wsj/2021/7/1410753856334671872.json": "Virgin Galactic said Richard Branson plans to board a flight that will launch for space on July 11, nine days before outgoing Amazon CEO Jeff Bezos https://t.co/omkINkOCxW",
  "data/tweet-wsj/2021/7/1410577270901780489.json": "Worker filings for jobless claims fell to 364,000 last week, reaching a new pandemic low as layoffs continue to recede https://t.co/HrvfaKdWsd",
  "data/tweet-wsj/2021/7/1410776499100303365.json": "One way 2021 is worse than 2020? Drought. Depleted snowpack and dry weather could mean higher food prices in coming months. https://t.co/GR3dxkx8Bn",
  "data/tweet-wsj/2021/7/1410724928752476163.json": "Caster Semenya won’t defend her 800-meter Olympic title because her testosterone levels exceed a 2018 limit imposed by track’s governing body on female athletes competing in distances between 400 meters and 1500 meters. https://t.co/PA2RDPos15",
  "data/tweet-wsj/2021/7/1410691076218834951.json": "A former top Wells Fargo executive said leaders at the bank acted like a mafia to suppress internal critics, according to a recorded phone call submitted to a U.K. court https://t.co/PqBlFTkQha",
  "data/tweet-wsj/2021/7/1410587751049728004.json": "Jeffrey Epstein’s New Mexico ranch, which includes a roughly 30,000-square-foot main home, a private air strip and a yurt, is hitting the market for $27.5 million https://t.co/DxjhJ57eay",
  "data/tweet-wsj/2021/7/1410732477425930240.json": "California Gov. Gavin Newsom will face a recall election Sept. 14, when voters will determine whether or not the first-term Democrat should be removed and, if so, who should replace him https://t.co/jI90gSGAhQ",
  "data/tweet-wsj/2021/7/1410823575670505474.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/IBJOt1lqsq",
  "data/tweet-wsj/2021/7/1410761419235205122.json": "Singapore is making plans to shift to a new phase in Covid-19 management—one in which the virus still circulates but becomes more manageable, like the flu  https://t.co/9Yofpz21Mi",
  "data/tweet-wsj/2021/7/1410921714066804738.json": "Virgin Galactic founder Richard Branson announced plans to head to space on July 11, nine days before outgoing Amazon CEO Jeff Bezos’s scheduled trip on a Blue Origin spacecraft #WSJWhatsNow https://t.co/8CExiskbH8",
  "data/tweet-wsj/2021/7/1410939380009734157.json": "The U.S. added 850,000 jobs in June and the jobless rate was 5.9%, as the labor market heated up after a spring lull https://t.co/MoY1RyEmOY",
  "data/tweet-wsj/2021/7/1410833135567347716.json": "From @WSJopinion: As challenges multiply (as they most likely will), will we see more missteps, unforced errors and lack of discipline? asks @KarlRove https://t.co/DzocXIqT7Q",
  "data/tweet-wsj/2021/7/1410954623578423303.json": "Sprinting star Sha’Carri Richardson tested positive for a chemical found in marijuana, invalidating her win in the U.S. trials and likely knocking her out of the women’s 100 meters at the Tokyo Olympics https://t.co/eFhx6oRdz4",
  "data/tweet-wsj/2021/7/1410957703359434752.json": "Almost half the U.K.’s recent Covid-19 deaths are of people who have been vaccinated, but scientists say the figures so far offer reassurance that vaccines offer substantial protection against the Delta variant https://t.co/gBPnWigoii",
  "data/tweet-wsj/2021/7/1410937297126576130.json": "Search-and-rescue teams resumed work at the partially collapsed Surfside, Fla. condominium after a roughly 14-hour pause Thursday due to safety concerns. The rescue effort could also be impeded by approaching Tropical Storm Elsa. #WSJWhatsNow https://t.co/SNhycBx1Gt",
  "data/tweet-wsj/2021/7/1410978367462121478.json": "The White House will urge the U.S. military to remove sexual harassment and assault cases from the chain of command and hand them off to independent military lawyers, administration officials said https://t.co/dZBaCs9Ksy",
  "data/tweet-wsj/2021/7/1410980348670906378.json": "Older generations of Americans will hand down some $70 trillion of wealth between 2018 and 2042. It will be the greatest wealth transfer in modern history: “We told our children that we are going to give them a head start in life.\" https://t.co/lIX8Y2z2zb",
  "data/tweet-wsj/2021/7/1410987915560292353.json": "From @WSJopinion: “Seeing America as it was and as it is today shouldn’t make us love our country any less,” writes @donnabrazile. “Patriotism requires that we face up to our past, including slavery and racism.”\nhttps://t.co/CP2Tz0M31X",
  "data/tweet-wsj/2021/7/1411033215305981963.json": "Peter Buffett has received more than $1 billion of his father’s Berkshire Hathaway fortune to give away as he sees fit. It is one small part of an enormous intergenerational transfer of wealth that is only just beginning https://t.co/j5mtl41kBI",
  "data/tweet-wsj/2021/7/1410942599205212166.json": "Washington Wire: More Republican women have announced plans to run for House seats in 2022 than at this point in any recent election cycle, say GOP officials https://t.co/71gAiSDjwZ",
  "data/tweet-wsj/2021/7/1410605213073899528.json": "The Supreme Court upheld Arizona voting regulations, overturning an appeals court ruling that they discriminated against minority voters https://t.co/Sz9heCvisG",
  "data/tweet-wsj/2021/7/1411154002629234691.json": "Comedian Kevin Hart is building an entertainment empire, signing deals with major streaming platforms, publishing a children's book and debuting an Olympics show. His success is earning him praise: “He’s ambitious and he wants to win.\" https://t.co/GyUwF3g9l5",
  "data/tweet-wsj/2021/7/1410799146362097666.json": "New York hospitals have a surplus of PPE, with millions of masks and pallets of disposable isolation gowns piling up. It will take months to use them up, a hospital executive says. “We bought so much of it.” https://t.co/WEpMnPsUDQ",
  "data/tweet-wsj/2021/7/1411161562946154496.json": "\"I knew I needed help. I just didn't know how to ask for it,\" says CC Sabathia, a six-time All-Star pitcher who struggled with alcoholism off the field https://t.co/mARM1ey0el",
  "data/tweet-wsj/2021/7/1411174776094216192.json": "The ransomware group behind the hack of meatpacker JBS has begun an attack that could affect hundreds of organizations, cybersecurity experts say https://t.co/8QeKRwnlW5",
  "data/tweet-wsj/2021/7/1411210633798901760.json": "Essay: \"Declaration of Independence,\" John Trumbull's classic painting of a historic scene from 1776, captures the rivalry between Thomas Jefferson and John Adams that helped shape the American creed https://t.co/G55zwlJ1n4",
  "data/tweet-wsj/2021/7/1411297441396232196.json": "At least 10 of the 26 doctors in Indonesia who died from Covid-19 this month had received both doses of the Chinese-made vaccine that is being used in many parts of the developing world https://t.co/rYCdcqQByL",
  "data/tweet-wsj/2021/7/1411286137709154305.json": "From @WSJopinion: The media won’t talk about this, and Republicans are so far missing in action, but Americans need to understand the stakes. Biden’s entitlement proposal is the biggest long-term economic threat in his agenda, writes The Editorial Board.\nhttps://t.co/Fl2NTSGkmH",
  "data/tweet-wsj/2021/7/1411263525180297216.json": "Companies are paying $1,000, and more, to hire housekeepers, food servers, drivers and other hourly workers https://t.co/pHyvHIrwhm",
  "data/tweet-wsj/2021/7/1411301244535181316.json": "The developers of the collapsed Surfside condominium tower worked around local building codes by adding a penthouse that wasn’t part of the original plan, a review of town building records shows https://t.co/xZHJTr7ktZ",
  "data/tweet-wsj/2021/7/1411327629752520709.json": "Chinese leader Xi Jinping warned that foreign bullies would be “battered and bloodied,” as his ruling Communist Party marked its 100th anniversary https://t.co/zO3lMLEU8l",
  "data/tweet-wsj/2021/7/1411354130786963467.json": "Observers of North Korea sense that Kim Jong Un’s weight loss has potential political undertones, providing stark imagery that the Supreme Leader is suffering alongside his citizens who face food shortages and an economic crisis https://t.co/TewvKdk9yu",
  "data/tweet-wsj/2021/7/1411346549750259714.json": "The Vatican said it indicted a cardinal and nine other people in connection with a costly investment in London real estate, the source of one the biggest scandals of Pope Francis’s reign https://t.co/IeR9vw31op",
  "data/tweet-wsj/2021/7/1411357831190794242.json": "For the residents of popular Italian destinations like Rome, Venice and Florence, the return of tourism after the pandemic is economically crucial. But they’ll miss having their cities to themselves. https://t.co/GwnVmepFYl",
  "data/tweet-wsj/2021/7/1411384327385108486.json": "Before the collapse, an engineering firm warned of a “major error” at Champlain Towers South that could cause concrete deterioration to “expand exponentially.” Here’s what we know about conditions at the Florida condo building. https://t.co/az2gG0JzvO",
  "data/tweet-wsj/2021/7/1411388016925368322.json": "Because marijuana sales are still illegal at the federal level in the U.S., many banks won’t work with cannabis companies. New legislation may change that. #WSJWhatsNow https://t.co/rtLsjtASbK",
  "data/tweet-wsj/2021/7/1411101134803120130.json": "Saudi Prince Khalid bin Salman, the country’s defense minister and brother of Crown Prince Mohammed bin Salman, is scheduled to visit Washington next week https://t.co/O8nXpQprQG",
  "data/tweet-wsj/2021/7/1411414473018167305.json": "Brazil’s Supreme Court authorized prosecutors to investigate President Jair Bolsonaro over allegations he turned a blind eye to possible corruption in a contract to buy India’s Covaxin Covid-19 vaccine https://t.co/KVEmsAvHyA",
  "data/tweet-wsj/2021/7/1411425788436664322.json": "The U.S. will allow Americans to select the gender designation on their passport without requiring a medical certification, enabling citizens to have passports that match their gender identity https://t.co/hngFX7dZVn",
  "data/tweet-wsj/2021/7/1411422034937073665.json": "The maker of Cheerios cereal and Betty Crocker cake mix—facing its highest costs in a decade—said it is raising prices across nearly all its grocery categories around the world https://t.co/NukOP546sK",
  "data/tweet-wsj/2021/7/1411376757379321857.json": "Bharat Biotech, of India, said its Covid-19 vaccine was effective against the coronavirus and provided significant protection against the Delta variant in late-stage clinical trials https://t.co/mTFbaqKMeD",
  "data/tweet-wsj/2021/7/1411459792913174529.json": "A former Chinese Communist Party academic, now critic of the regime, is urging the U.S. to abandon \"naive\" hopes to engage with Beijing https://t.co/MYT9vpLBAW",
  "data/tweet-wsj/2021/7/1411452222228029445.json": "Boom Technology is trying to revive supersonic travel, but the most ambitious part of its plan might be to run its aircraft on 100% sustainable fuels https://t.co/pffJhl0kmI",
  "data/tweet-wsj/2021/7/1411444758782910471.json": "Residents of the collapsed Florida building were warned in April of extensive damage by the condo board president, who urged them to pay $15 million to fix issues https://t.co/JCcKCZuWsP",
  "data/tweet-wsj/2021/7/1411418234172153866.json": "In her first term on the bench, Justice Amy Coney Barrett in many ways defied the predictions of conservatives and liberals  https://t.co/czob8BCq8L",
  "data/tweet-wsj/2021/7/1411395593533067268.json": "With Cambodia’s borders still closed, one of the world’s most famous landmarks is a ghost town while the tourist hub of Siem Reap has reverted back into a sleepy country village. A travel writer reflects on a possible silver lining to the visitor ban. https://t.co/XKfOiivvUg",
  "data/tweet-wsj/2021/7/1411471815805972482.json": "Search-and-rescue efforts were paused in Surfside on Saturday as teams prepare to demolish the remaining part of Champlain Towers South with explosives, which could happen as soon as Sunday https://t.co/4GLebdTGCA",
  "data/tweet-wsj/2021/7/1411463532818972677.json": "One day, AI could create versions of people who’ve died—not only as static replicas but as evolving digital entities that may steer companies or influence world events https://t.co/FeEC7euN2w",
  "data/tweet-wsj/2021/7/1411308798761914374.json": "Missouri has the highest rate of new Covid-19 cases in the U.S. as patients are younger and unvaccinated https://t.co/LC74KG744w",
  "data/tweet-wsj/2021/7/1411542813582503939.json": "The ransomware group behind the hack of meatpacker JBS has begun an attack that may have infected as many as 40,000 computers world-wide, cybersecurity experts say https://t.co/bCeX6mY7Dl",
  "data/tweet-wsj/2021/7/1411640956647096320.json": "Almost half the U.K.’s recent Covid-19 deaths are of people who have been vaccinated, but scientists say the figures so far offer reassurance that vaccines offer substantial protection against the Delta variant https://t.co/eeyESHN8fq",
  "data/tweet-wsj/2021/7/1411652267464404993.json": "The AstraZeneca Covid-19 vaccine provides a strong bump to immunity when given as a third dose, or booster, more than six months after the second shot, according to a study https://t.co/dVAekWIxN4",
  "data/tweet-wsj/2021/7/1411637421163352065.json": "Virgin Galactic said Richard Branson plans to board a flight that will launch for space on July 11, nine days before outgoing Amazon CEO Jeff Bezos https://t.co/mWhCSLu4hG",
  "data/tweet-wsj/2021/7/1411648528280178690.json": "From @WSJopinion: Of the 64% of Americans who have heard about critical race theory, 58% view it unfavorably, including 72% of political independents, writes @realchrisrufo. That’s a major liability for the political left. \nhttps://t.co/uPXQ21Z69Z",
  "data/tweet-wsj/2021/7/1411633417414905859.json": "Washington Wire: More Republican women have announced plans to run for House seats in 2022 than at this point in any recent election cycle, say GOP officials https://t.co/nUb3FJgSVW",
  "data/tweet-wsj/2021/7/1411693812406235138.json": "The maker of Cheerios cereal and Betty Crocker cake mix—facing its highest costs in a decade—said it is raising prices across nearly all its grocery categories around the world https://t.co/xsxAKATHsB",
  "data/tweet-wsj/2021/7/1411659829567971331.json": "A shortage of small, single-family homes is leaving some millennial first-time buyers frustrated and out of luck in a hot housing market https://t.co/fNdLGPPErY",
  "data/tweet-wsj/2021/7/1411708901553213441.json": "A nearby condo tower that was almost identical to the one that collapsed in Surfside, Fla., had more consistent maintenance, residents say https://t.co/EfYWxQUPrO",
  "data/tweet-wsj/2021/7/1411716509320294400.json": "A former Chinese Communist Party academic, now critic of the regime, is urging the U.S. to abandon \"naive\" hopes to engage with Beijing https://t.co/fmlWjaIgNg",
  "data/tweet-wsj/2021/7/1411735317678379009.json": "Tyson Foods said it is recalling about 8.5 million pounds of chicken products that the company and federal officials said could be contaminated with harmful bacteria https://t.co/N7Ja9LUSrr",
  "data/tweet-wsj/2021/7/1411728784487821318.json": "A new ransomware attack linked to the group that hit meat producer JBS stretched into a third day as cybersecurity officials scrambled to remediate an attack they believe likely infected hundreds of organizations and tens of thousands of computers https://t.co/MoVs4R2qgj",
  "data/tweet-wsj/2021/7/1411701431485272066.json": "The Delta variant’s spread is a warning sign that the tactics that helped crush Australia’s previous Covid-19 outbreaks may not work this time https://t.co/H9wW6ALAd4",
  "data/tweet-wsj/2021/7/1411686284477743104.json": "As Jeff Bezos steps aside as Amazon's CEO, the company is expanding faster than ever. Here's a look at the personal and professional empires he created. https://t.co/GHBWpGdtj5",
  "data/tweet-wsj/2021/7/1411679958599180299.json": "China ordered app-store operators to remove the app of ride-hailing giant Didi Global’s China arm, saying it has serious problems involving illegal collection of personal data https://t.co/C7kP34ge3Z",
  "data/tweet-wsj/2021/7/1411724027643805701.json": "Bitcoin needs a reason to exist. Ransomware may be it. https://t.co/4Gh6I34cFg",
  "data/tweet-wsj/2021/7/1411505100674244609.json": "Jean shorts, or jorts, are flying off shelves. Here’s why the uniform of the barbecue dad is now seen as high fashion. https://t.co/WkN4Mh0M6u",
  "data/tweet-wsj/2021/7/1411856132470149124.json": "People infected with Covid-19 after getting the Pfizer or Moderna vaccine carried less virus and had shorter cases than unvaccinated people who became infected, CDC researchers found https://t.co/aNIIUevHFM",
  "data/tweet-wsj/2021/7/1411757963019161600.json": "Workers in Surfside, Fla., were in the final, frenzied leg of preparing the partially collapsed condo for demolition, which could happen as early as Sunday evening, as officials fear the structure can't tolerate the winds and rain of an approaching storm https://t.co/ICBj7o4feF",
  "data/tweet-wsj/2021/7/1411746674066788359.json": "From @WSJopinion: “Drill, baby, drill” might be onto something, but not what you think. Deep drilling provides access to heated water, and geothermal energy that is carbon-free, clean, and green. It’s the future of energy, writes @AndyKessler. \nhttps://t.co/7hEfMI50C9",
  "data/tweet-wsj/2021/7/1411867470848266244.json": "The developers of the collapsed Surfside condominium tower worked around local building codes by adding a penthouse that wasn’t part of the original plan, a review of town building records shows https://t.co/KHdrI5qTVC",
  "data/tweet-wsj/2021/7/1411791990535118849.json": "Amusement parks are bumping up wages and handing out perks to attract enough workers amid the country’s reopening this summer. It is a boon for teens seeking summer jobs. https://t.co/FzbXgTw9dI",
  "data/tweet-wsj/2021/7/1411859927270838277.json": "At 21, Ben Pasternak has raised millions to launch three NYC-based startups and his products are carried by Target and Sam’s Club. “My goal was to never go to school again.” https://t.co/x689vkhgX4",
  "data/tweet-wsj/2021/7/1411905200164593665.json": "More than half of Latin America’s school-age children still aren’t back in classrooms: “Human capital and productivity will be hit for an entire generation,” an economist warns. https://t.co/oNIG6lneDm",
  "data/tweet-wsj/2021/7/1411739114567778306.json": "Democrats and Republicans agree that billions of dollars in new highway spending would boost productivity and growth, but economic research suggests it would generate little, if any, long-term gains https://t.co/VXD1K3mTCh",
  "data/tweet-wsj/2021/7/1411935413074378754.json": "Observers of North Korea sense that Kim Jong Un’s weight loss has potential political undertones, providing stark imagery that the Supreme Leader is suffering alongside his citizens who face food shortages and an economic crisis https://t.co/GjESN8pKax",
  "data/tweet-wsj/2021/7/1411690006930812928.json": "Volkswagen is investing in electric vehicles more than other legacy car makers in the U.S. Will it be enough for the EV revolution? #WSJWhatsNow https://t.co/p9CZAdslHT https://t.co/QBVCckMFzr",
  "data/tweet-wsj/2021/7/1411890107553099777.json": "A crucial next step in the hunt for Covid-19’s origins is to examine China's wild animal farms. But almost all of the animals are gone. https://t.co/JIcedokU0F",
  "data/tweet-wsj/2021/7/1411965598616145922.json": "Comedian Kevin Hart is building an entertainment empire, signing deals with major streaming platforms, publishing a children's book and debuting an Olympics show. His success is earning him praise: “He’s ambitious and he wants to win.\" https://t.co/9Z9LUucGmX",
  "data/tweet-wsj/2021/7/1411761801847508996.json": "The Biden administration is hoping to reach Black Americans who have declined to get vaccinated with the help of barbershops and hair salons in their communities https://t.co/28qOlTZfTC",
  "data/tweet-wsj/2021/7/1412005528612507649.json": "Facebook, Google and Twitter have warned they could remove services in Hong Kong over planned data-protection laws that they say could put staff at risk https://t.co/yO0J65akLq",
  "data/tweet-wsj/2021/7/1412014671457030146.json": "Workers are trading jobs, enticed by the guarantee of flexible schedules and continued work from home https://t.co/ntR9f1kNxm",
  "data/tweet-wsj/2021/7/1412052429496107012.json": "Older generations of Americans will hand down some $70 trillion of wealth between 2018 and 2042. It will be the greatest wealth transfer in modern history. https://t.co/y4RUiHcNSi",
  "data/tweet-wsj/2021/7/1412056235587911683.json": "Observers of North Korea sense that Kim Jong Un’s weight loss has potential political undertones, providing stark imagery that the Supreme Leader is suffering alongside his citizens who face food shortages and an economic crisis https://t.co/HWcGRU0iS6",
  "data/tweet-wsj/2021/7/1412076569926029314.json": "The Delta Covid-19 variant is surging across Africa, overwhelming hospitals and forcing new lockdowns on the continent with the fewest vaccines and weakest healthcare systems https://t.co/WGmdykw0fd",
  "data/tweet-wsj/2021/7/1412067520769634310.json": "The Taliban have gained a lucrative new source of income, taking over the main trade gateway into Tajikistan, and beginning to collect customs revenues, as some of Afghanistan’s neighbors tacitly cooperate with the insurgent group https://t.co/oLaUzWimFQ",
  "data/tweet-wsj/2021/7/1412095280628047880.json": "Europe finally reopened its doors to American tourists. Here are some things to consider while planning a trip. https://t.co/EqAGDQLS3s",
  "data/tweet-wsj/2021/7/1411999573715865606.json": "Leading economists came to the defense of Andreu Mas-Colell, who must pay a €2.8 million penalty amid a Spanish judicial crackdown on former Catalan officials accused of aiding secessionism https://t.co/BhWyc6Boua",
  "data/tweet-wsj/2021/7/1412109019108368385.json": "Wilmer Valderrama, who played Fez on \"That ‘70s Show,\" took the station wagon with him after the show wrapped its last episode #WSJWhatsNow https://t.co/e9WU7wgbeV https://t.co/GNzHtgLfss",
  "data/tweet-wsj/2021/7/1412135976114262017.json": "Volkswagen is selling the Bugatti hypercar business to create a new company jointly owned by a Croatian electric car startup and VW’s sports-car unit Porsche https://t.co/sIaNNvoUc5",
  "data/tweet-wsj/2021/7/1412116614267482115.json": "The highly transmissible Delta variant is now the most common strain of Covid-19 circulating in the U.S., but the CDC says fully vaccinated Americans don’t necessarily need to put on face masks again https://t.co/1B44GJUIS7",
  "data/tweet-wsj/2021/7/1412101526802382850.json": "The maker of Cheerios cereal and Betty Crocker cake mix—facing its highest costs in a decade—said it is raising prices across nearly all its grocery categories around the world https://t.co/Dix5wEe4j4",
  "data/tweet-wsj/2021/7/1412146800409165824.json": "People infected with Covid-19 after getting the Pfizer or Moderna vaccine carried less virus and had shorter cases than unvaccinated people who became infected, CDC researchers found https://t.co/REq0ImFfky",
  "data/tweet-wsj/2021/7/1412143023685869569.json": "Boom Technology is trying to revive supersonic travel, but the most ambitious part of its plan might be to run its aircraft on 100% sustainable fuels https://t.co/oO47EJi7sS",
  "data/tweet-wsj/2021/7/1412105269585354756.json": "Big companies want to hire remote workers—as long as they're not from Colorado https://t.co/B1KmQqlCLf",
  "data/tweet-wsj/2021/7/1412158109397798921.json": "Leading economists came to the defense of Andreu Mas-Colell, an economist and former Harvard professor, who must pay a €2.8 million penalty amid a Spanish judicial crackdown on former Catalan officials accused of aiding secessionism https://t.co/7cUqOe1qID",
  "data/tweet-wsj/2021/7/1412199691765403651.json": "The AstraZeneca Covid-19 vaccine provides a strong bump to immunity when given as a third dose, or booster, more than six months after the second shot, according to a study https://t.co/laGazAqq7F",
  "data/tweet-wsj/2021/7/1412226083647283205.json": "Older generations of Americans will hand down some $70 trillion of wealth between 2018 and 2042. It will be the greatest wealth transfer in modern history. https://t.co/PYYL9eYilV",
  "data/tweet-wsj/2021/7/1412195857273921537.json": "At 21, Ben Pasternak has raised millions to launch three NYC-based startups and his products are carried by Target and Sam’s Club. “My goal was to never go to school again.” https://t.co/tB8JRvD0xp",
  "data/tweet-wsj/2021/7/1412210945145835521.json": "A Honduran court convicted the former chairman of a local hydroelectric company of ordering the 2016 assassination of Berta Cáceres, an indigenous-rights leader and environmental crusader https://t.co/nsQaozb800",
  "data/tweet-wsj/2021/7/1412086402460930051.json": "Months after February’s freeze, many Texans are still living in damaged homes after learning too late that they had inadequate insurance https://t.co/ulsSG7FmpV",
  "data/tweet-wsj/2021/7/1412150554046914560.json": "In the days before the collapse, Champlain Towers South condo owners pressed Surfside officials to approve additional construction work, including \"numerous improvements that must be made to assure that this building structure remains safe\" https://t.co/X3LivNoXTY",
  "data/tweet-wsj/2021/7/1412018422754385927.json": "Virgin Galactic founder Richard Branson announced plans to head to space on July 11, nine days before outgoing Amazon CEO Jeff Bezos’s scheduled trip on a Blue Origin spacecraft #WSJWhatsNow https://t.co/Ef0mgHn276",
  "data/tweet-wsj/2021/7/1412233632488493057.json": "Europe finally reopened its doors to American tourists. Here are some things to consider while planning a trip. https://t.co/Ob8Uup86L3",
  "data/tweet-wsj/2021/7/1412260054632484870.json": "The Delta variant’s spread is a warning sign that the tactics that helped crush Australia’s previous Covid-19 outbreaks may not work this time https://t.co/BfvUqgAlVT",
  "data/tweet-wsj/2021/7/1412297790735228929.json": "Vaccines are helping rich nations avoid big rises in deaths as the Delta variant drives up Covid-19 infections, while developing countries running short on shots are battling deadly surges https://t.co/6vE78XfNWl",
  "data/tweet-wsj/2021/7/1412271375469928449.json": "Take an early look at the front page of The Wall Street Journal https://t.co/QJcLlexAez https://t.co/OQ4t0Zsw9Y",
  "data/tweet-wsj/2021/7/1412361964735631360.json": "Denmark’s best player, Christian Eriksen, only played 42 minutes of Euro 2020 before his on-field cardiac arrest. But three weeks later, his longshot teammates are one game from their first final since 1992. https://t.co/QaJM7ZKRim",
  "data/tweet-wsj/2021/7/1412350646825664514.json": "Americans are facing the steepest gasoline prices in nearly seven years as prices for West Texas Intermediate surge  https://t.co/JW83gy9kED",
  "data/tweet-wsj/2021/7/1412390377877913603.json": "JPMorgan and Goldman are calling employees back to the office. Rivals like Citigroup are touting their flexibility, hoping it will help them poach top talent. https://t.co/aumWxDYFe0",
  "data/tweet-wsj/2021/7/1412383347658088449.json": "Toyota’s decision to build a stockpile of chips for its cars paid off by lifting it above perennial top dog GM in the U.S. for the first time https://t.co/fUxln8I5wN",
  "data/tweet-wsj/2021/7/1412398293515132929.json": "Some of the world’s largest oil companies will have to help foot a $7.2 billion bill to clean up offshore wells they used to own https://t.co/F3g3CT9qJ2",
  "data/tweet-wsj/2021/7/1412407259175526406.json": "Nearly 140 companies in the S&amp;P 500, including Netflix, said their median worker was paid at least $100,000 last year. Others, including Amazon and Starbucks, said their median worker made less than $30,000. https://t.co/OQRp6EuDXW",
  "data/tweet-wsj/2021/7/1412414794678910976.json": "Data from Israel shows Pfizer’s vaccine protected 64% of inoculated people during an outbreak of the Delta variant, down from 94% before, but retains its potency to prevent severe illness https://t.co/o9uG9bVjTu",
  "data/tweet-wsj/2021/7/1412098649220395008.json": "Digital advertisers say they have lost much of the granular data that made mobile ads on iOS devices effective and justified their prices https://t.co/LwsHCIVetH",
  "data/tweet-wsj/2021/7/1412366212965699587.json": "Supermarkets are stocking up on everything from sugar to frozen meat as food prices increase, driving shortages and squeezing the food supply chain #WSJWhatsNow https://t.co/F01mudopDA",
  "data/tweet-wsj/2021/7/1412418601945026569.json": "Bitcoin and other cryptocurrencies didn’t get much attention in Washington until recently. Now regulators are signaling they want more control over an asset that has pushed further into Wall Street activities without investor and consumer protections. https://t.co/bsxEJefiSf",
  "data/tweet-wsj/2021/7/1412393908877807632.json": "The highly contagious Delta variant of Covid-19 is gaining ground where vaccination rates are lower. In Wyoming, events like rodeos now present new risks. https://t.co/3znIUDaTqW",
  "data/tweet-wsj/2021/7/1412434430887669760.json": "At one hospital, an uninsured person getting a stent after a heart attack could be billed around $66,226 for the procedure. An insurance company would be charged just $17,895 there for the same thing. https://t.co/m8V8cBscIr",
  "data/tweet-wsj/2021/7/1412452557029576707.json": "San Francisco has one of the highest vaccination rates in the country but one of the lowest return-to-work rates. The decreased foot traffic has meant many of the stores and restaurants in the business district remain closed. “It’s a ghost town.\" https://t.co/aBqV78StTV",
  "data/tweet-wsj/2021/7/1412475218069753862.json": "From @WSJopinion: Governments were once the chief impediments to free speech and free markets, but extremely large private companies may have become the greater danger, writes @JBSay https://t.co/9Pxbw50rAN",
  "data/tweet-wsj/2021/7/1412534335882792970.json": "Sprinter Sha'Carri Richardson won't be competing in the Tokyo Olympics. U.S. officials declined to select her for a relay, saying all athletes \"must adhere to the current anti-doping code\" https://t.co/SS9htFLMQ4",
  "data/tweet-wsj/2021/7/1412543150133022722.json": "Delivery company Grubhub plans to roll out food-delivering robots across U.S. college campuses from this fall, as automation grows in a sector turbocharged by the pandemic https://t.co/qwuo7uFQvt",
  "data/tweet-wsj/2021/7/1412603547892473858.json": "San Francisco has one of the highest vaccination rates in the country but one of the lowest return-to-work rates. Many of the stores and restaurants in the business district remain closed. “It’s a ghost town.\" https://t.co/mqiwmHUhT2",
  "data/tweet-wsj/2021/7/1412596004893954049.json": "Israel will send about 700,000 expiring Pfizer shots to South Korea, in what is set to be the world’s first Covid-19 vaccine swap https://t.co/vmkodzk1io",
  "data/tweet-wsj/2021/7/1412614882852225030.json": "The World Health Organization recommended that Covid-19 patients with severe or critical disease be given a type of anti-inflammatory drug found to reduce the risk of death by 13% in the sickest patients when taken in combination with steroids https://t.co/hec80aNZz4",
  "data/tweet-wsj/2021/7/1412569576861220865.json": "From @WSJopinion: A federal judge upholds Ohio’s right to cut its income taxes despite a federal prohibition, and it should encourage other states to do so https://t.co/pspIP6P2I7",
  "data/tweet-wsj/2021/7/1412652633698062338.json": "Data from Israel shows Pfizer’s vaccine protected 64% of inoculated people during an outbreak of the Delta variant, down from 94% before, but retains its potency to prevent severe illness https://t.co/KCMbC44AXd",
  "data/tweet-wsj/2021/7/1412633771636056065.json": "Take an early look at the front page of The Wall Street Journal https://t.co/EGnz7QuLtd https://t.co/Z3dLCyodD2",
  "data/tweet-wsj/2021/7/1412588452571496450.json": "“It’s just calls and typing and typing and typing.” What has it been like for kids watching their parents work from home this past year? Here’s what five kids around the country had to say. https://t.co/mtAc98NnmD",
  "data/tweet-wsj/2021/7/1412725247862784002.json": "Haitian President Jovenel Moïse was assassinated at his private residence, an official said, amid deepening political instability in the Caribbean nation https://t.co/HVoqKr3rvj",
  "data/tweet-wsj/2021/7/1412684854114897920.json": "In a Mozilla study, 71% of videos that YouTube viewers flagged as objectionable had been recommended by YouTube’s algorithms \nhttps://t.co/JmC28lgpME",
  "data/tweet-wsj/2021/7/1412698079162212353.json": "New research into rare blood clots associated with the AstraZeneca Covid-19 vaccine identified specific amino acids targeted by antibodies in recipients of the shot https://t.co/cmNvtu6njI",
  "data/tweet-wsj/2021/7/1412732538234281989.json": "Data from Israel suggests Pfizer’s vaccine is less effective at protecting against infections caused by the Covid-19 Delta variant, but still prevents severe illness #WSJWhatsNow https://t.co/6lnlmjMFsF",
  "data/tweet-wsj/2021/7/1412611103595585536.json": "From @WSJopinion: U.S. defense leaders have a problem: What they say doesn’t line up with what they do. The mismatch is apparent in the latest Pentagon budget, writes @RepElaineLuria. https://t.co/TzEIaFm5p0",
  "data/tweet-wsj/2021/7/1412783995889258498.json": "The U.S. Air Force was largely responsible for a 2017 mass shooting in Texas for failing to enter the gunman's criminal history into a database, a judge ruled https://t.co/yVwfjwDtDW",
  "data/tweet-wsj/2021/7/1412809312397824000.json": "Donald Trump has sued Facebook, Twitter and Google, seeking to restore his social-media accounts after he was suspended following the Jan. 6 riot https://t.co/qITQlvOyZr",
  "data/tweet-wsj/2021/7/1412788546746957825.json": "\"Shall we leave?'' Afghanistan's most educated and successful men and women are weighing plans to escape before the Taliban upends their country https://t.co/QZVzymQmF4",
  "data/tweet-wsj/2021/7/1412838857633054724.json": "Amtrak plans to spend $7.3 billion to replace aging railcars and locomotives, adding more comfortable seating, improved disabled access, individual power outlets and improved food service https://t.co/R4EhHpqazx",
  "data/tweet-wsj/2021/7/1412759513569148931.json": "In a Mozilla study, 71% of videos that YouTube viewers flagged as objectionable had been recommended by YouTube’s algorithms https://t.co/jXywTNwDyj",
  "data/tweet-wsj/2021/7/1412875341245423623.json": "From @WSJopinion: The woke are angry, humorless, and worst of all, vindictive. Surrender is not an option, writes Joseph Epstein https://t.co/RuKeC0L2sS",
  "data/tweet-wsj/2021/7/1412773415065460740.json": "Gunman assassinated Haitian President Jovenel Moïse, storming his house in the capital. Who did it and what was the motive is still unclear. Here's what we know. https://t.co/MrjG4HkPTG",
  "data/tweet-wsj/2021/7/1412882888740200450.json": "Federal Reserve officials suggested that they might need to pull back their support for the economy sooner than they had anticipated because of stronger-than-expected growth this year https://t.co/yKPiZ75KDN",
  "data/tweet-wsj/2021/7/1412900500039770120.json": "Harry Kane’s extra-time goal gave England a 2-1 win and a first major-tournament final in 55 years. The Three Lions will play Italy on Sunday for the Euro title. https://t.co/g8a0CoCnQR",
  "data/tweet-wsj/2021/7/1412920625673420804.json": "From @WSJopinion: Today China is rising, Russia is resurgent, and the U.S. is again consumed by division and self-doubt. Will the U.S. disprove the forecasts of decline again, or was Nixon ahead of his time? https://t.co/zvie5f9XUT",
  "data/tweet-wsj/2021/7/1412867791351431173.json": "Eric Adams, the winner of the New York City Democratic mayoral primary, spent the first day after his victory discussing public safety while his top two opponents conceded the race https://t.co/7kbYoMw36n",
  "data/tweet-wsj/2021/7/1412957885391425543.json": "Four suspected killers of Haiti's president were fatally shot by the police and two others were captured, the country's police chief said https://t.co/vYFIgS5cpY",
  "data/tweet-wsj/2021/7/1412928193443602436.json": "California’s power-grid manager is taking emergency steps to secure extra electricity as a hot, dry summer increases the risk of blackouts https://t.co/ei8IExtCK8",
  "data/tweet-wsj/2021/7/1412954605055627264.json": "Farmers have long relied on insects, wind and human workers to help pollinate crops. Now, advances in AI are helping some startups develop another way: robots. https://t.co/GhmMWJcKTO",
  "data/tweet-wsj/2021/7/1412968456723566596.json": "The Tampa Bay Lightning won their second Stanley Cup in just over nine months, defeating the Montreal Canadiens 1-0 to claim back-to-back titles https://t.co/lhtp92e5Ay",
  "data/tweet-wsj/2021/7/1412992382702870531.json": "Take an early look at the front page of The Wall Street Journal https://t.co/xrZvMZuMl2 https://t.co/lNpTHEV4zt",
  "data/tweet-wsj/2021/7/1412999917119975424.json": "“I don’t buy expensive art or jewelry. I’ve become a plant collector.” Home gardeners and plant aficionados alike are building and maintaining greenhouses in their own backyards. https://t.co/anGZDMEJhI",
  "data/tweet-wsj/2021/7/1413022562154696709.json": "Deaths in Indonesia from Covid-19 rose sharply as the fast-spreading Delta variant of the coronavirus overwhelms the largely unvaccinated country’s healthcare system https://t.co/A0VSaXTRDB",
  "data/tweet-wsj/2021/7/1413037670150836231.json": "The Taliban said Afghanistan's basic rights will be respected. The country's most-educated men and women don't believe it. Many are packing before it's too late. https://t.co/xXq0w5rrqv",
  "data/tweet-wsj/2021/7/1413059355990237184.json": "The Tokyo Olympics likely won't have spectators in the stands after Japan declared a new state of emergency due to Covid-19 https://t.co/i8OLpRITl8",
  "data/tweet-wsj/2021/7/1412984831030538242.json": "The highly transmissible Delta variant has become the dominant coronavirus strain circulating in the U.S., according to federal data https://t.co/SpdvocPcwG",
  "data/tweet-wsj/2021/7/1413102556730036230.json": "Michael Avenatti is set to be sentenced in a Manhattan federal courtroom for trying to extort Nike for more than $20 million, capping a public downfall since his representation of Stormy Daniels https://t.co/WvKEnkKqtv",
  "data/tweet-wsj/2021/7/1413110587664515078.json": "“They took the babies.” Multiple attacks conducted within hours of each other spotlight the terrifying frequency of what has become a routine and brutal business in Nigeria. https://t.co/SBb67NkBTn",
  "data/tweet-wsj/2021/7/1413091032384868354.json": "Investors gave millions of dollars to two South African teenagers for bitcoin investments when crypto prices were soaring. Now the brothers have disappeared, leaving them hunting for their money.  https://t.co/ARPsdtiyaj",
  "data/tweet-wsj/2021/7/1413132041437294594.json": "The Tokyo Olympics will be held without spectators, the organizers said, after Japan declared a new state of emergency that will continue through the end of the Games due to a rise in Covid-19 infections https://t.co/sobCObKLsv",
  "data/tweet-wsj/2021/7/1413143382206009354.json": "In the billionaire space race, Richard Branson and Jeff Bezos are using different methods. We show through these immersive videos how they plan to get there and back. https://t.co/GRJ4u8msQX",
  "data/tweet-wsj/2021/7/1413158771887681546.json": "Biden is expected to announce that Afghan translators who helped U.S. forces will be moved to other countries, pending admission to the U.S., officials say https://t.co/hCXYuv9eiD",
  "data/tweet-wsj/2021/7/1413150970972839942.json": "\"How the hell am I going to pay this off?\" Columbia film grads say the university blew off their worries about six-digit costs. One administrator's suggestion: Watch the president's dogs. https://t.co/qap1VNS5iQ",
  "data/tweet-wsj/2021/7/1413147119058186249.json": "First it said farewell to its Marlboro Man ads. Now, the biggest U.S. cigarette maker is getting rid of its 18,000-acre Marlboro Ranch in Montana where smokers went on all-expense-paid trips. https://t.co/irWIX2viwf",
  "data/tweet-wsj/2021/7/1413180923533737992.json": "Big Tech has been illegally deputized as the censorship arm of the U.S. government. This should alarm you no matter your political persuasion. It is unacceptable, unlawful and un-American, writes Donald Trump https://t.co/TOyVnglcD6",
  "data/tweet-wsj/2021/7/1413212221782515714.json": "Michael Avenatti was sentenced to 2½ years in prison for trying to extort Nike for more than $20 million. The prison term caps a public downfall for the lawyer who represented Stormy Daniels in her legal battles with former President Donald Trump. https://t.co/ctQBvwQ5BL",
  "data/tweet-wsj/2021/7/1413230224096088064.json": "Elite U.S. universities turned master's programs into cash cows—with students' debt loads pushing way past $100K. What they can't pay falls to taxpayers. https://t.co/Y8N8LzeoLp",
  "data/tweet-wsj/2021/7/1413222622532456450.json": "Despite past support for Uyghur militants in Xinjiang, the Taliban say they won’t interfere in China’s internal affairs as they continue their advance across Afghanistan https://t.co/gWzl78k5wR",
  "data/tweet-wsj/2021/7/1413267620996976641.json": "Pfizer plans to seek U.S. authorization for a Covid-19 booster shot and is developing an updated vaccine that better targets the Delta variant https://t.co/QV1z9tKvpF",
  "data/tweet-wsj/2021/7/1413272896399679488.json": "The slight risk of children dying from Covid-19 might be even lower than previously thought, researchers found in comprehensive new studies https://t.co/jqoyD66OfX",
  "data/tweet-wsj/2021/7/1413298128103555075.json": "Columbia and other wealthy universities steer master's students to federal loans that can exceed $250,000. After graduation, many learn the debt is well beyond their means. https://t.co/VO2VrQVK7g",
  "data/tweet-wsj/2021/7/1413313210736943105.json": "Short on space, but love your building and don't want to move? Buy the apartment next door and combine the two. https://t.co/UXszmiWEt0",
  "data/tweet-wsj/2021/7/1413030124392419329.json": "The U.S. has assured the U.K. Julian Assange won't be held in a Supermax jail if extradited, and could serve any custodial sentence in his native Australia https://t.co/PM7uh3RRq6",
  "data/tweet-wsj/2021/7/1413357260965810182.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/F1UfSff18A",
  "data/tweet-wsj/2021/7/1413286844364623881.json": "One of Novak Djokovic's most useful weapons: the tactical bathroom break. Including this year's French Open final, we found at least a dozen instances since 2013. In 10 of 12 cases, Djokovic came back and won the very next set. https://t.co/9uJKl0p2c4",
  "data/tweet-wsj/2021/7/1413254835097546754.json": "U.S. Covid-19 hospitalizations are up as the Delta variant spreads, especially among the unvaccinated https://t.co/8tMs0ctiJV",
  "data/tweet-wsj/2021/7/1413290588414357504.json": "From @WSJopinion: New York's presumptive next mayor Eric Adams beat the field by emphasizing the crime problem. It's a lesson for fellow Democrats. https://t.co/srEZxHtj29",
  "data/tweet-wsj/2021/7/1413426486657363969.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/BmprYG7JbW",
  "data/tweet-wsj/2021/7/1413347229885210625.json": "The idea of endowing a machine with the ability to see, hear, touch, taste and smell has long seemed far-fetched. Not anymore. https://t.co/KqfZSb6GoC",
  "data/tweet-wsj/2021/7/1413468675294711808.json": "New York subway passengers waded through knee-high water in flooded stations, as Tropical Storm Elsa bears down on the region #WSJWhatsNow https://t.co/fWqbv7yewx",
  "data/tweet-wsj/2021/7/1413482104554278912.json": "President Biden is targeting technology, agriculture, healthcare and shipping in an order aiming to boost competition and limit corporate dominance https://t.co/CqfiDXSIuS",
  "data/tweet-wsj/2021/7/1413455696188743687.json": "Pfizer will seek clearance from regulators to distribute a Covid-19 booster shot, amid a rise in new virus strains #WSJWhatsNow https://t.co/E4JK3jFxNC",
  "data/tweet-wsj/2021/7/1413524611866808322.json": "Colombia’s government said that at least six of the 17 suspects involved in the brazen assassination of Haiti’s president, Jovenel Moïse, were retired members of that country’s armed forces https://t.co/KIr4IPQeuP",
  "data/tweet-wsj/2021/7/1413335874889191425.json": "From @WSJopinion: The Biden administration can spin things as much as they want. But facts are stubborn, and here they show great and growing harm to America, writes @KarlRove. https://t.co/i0A00g6KkD",
  "data/tweet-wsj/2021/7/1413486872622419969.json": "Coal-fired power plants aren’t just the heaviest polluters; they are also expensive to run. Companies are using an old-school move to raise money to pay for shutdowns. https://t.co/p33gB0NSRf",
  "data/tweet-wsj/2021/7/1413565522759794689.json": "President Biden signed a broad executive order that aims to promote competitive markets across the U.S. economy and limit corporate dominance https://t.co/51Az5YYMm6",
  "data/tweet-wsj/2021/7/1413460467117400065.json": "As the Taliban appears to be on the cusp of seizing power in Afghanistan, panic is spreading through neighboring Pakistan https://t.co/7V97gc1ojq",
  "data/tweet-wsj/2021/7/1413294353880129536.json": "When he attempted the fastest Atlantic crossing, his vessel capsized. He tried to fly a hot-air ballon around the world but crash-landed. Richard Branson is ready for his next high-profile act: flying to the edge of space. https://t.co/XsLJNpy36S",
  "data/tweet-wsj/2021/7/1413621515229278220.json": "President Biden warned Russian President Vladimir Putin on Friday the U.S. would take “any necessary action” to defend U.S. infrastructure and businesses from ransomware attacks https://t.co/w1OmlG8DJx",
  "data/tweet-wsj/2021/7/1413544661239615490.json": "The FDA has asked for a federal investigation of its own doctors who met with the makers of an Alzheimer's drug prior to its approval https://t.co/nmMzsoD7EF",
  "data/tweet-wsj/2021/7/1413630324010012672.json": "Essay: The exploding deer population of the eastern U.S. is bad news for wild lands and suburban gardens. To bring the numbers down, some wildlife experts suggest eating more venison. https://t.co/Oe0sR3Mvrv",
  "data/tweet-wsj/2021/7/1413637146238496768.json": "Biden fired Social Security Commissioner Andrew Saul after he declined a request to resign, the White House said https://t.co/IAkLkLoIfs",
  "data/tweet-wsj/2021/7/1413624019308400662.json": "English soccer fans are so unaccustomed to winning that they borrowed the song \"Sweet Caroline\" from another long-suffering sports team that finally won: the Boston Red Sox https://t.co/dWxslWYqxv",
  "data/tweet-wsj/2021/7/1413569646356312065.json": "President Biden spoke Friday with Russian President Vladimir Putin amid rising concern over ransomware attacks in the U.S. https://t.co/41ZruFYf5c",
  "data/tweet-wsj/2021/7/1413664330747424774.json": "“Nobody will feel confident in his commercial space flights if he is unwilling to do it himself.” Richard Branson is taking a risk this Sunday, flying to space and back in a stunt that would assure future customers that space tourism is safe. https://t.co/kWxzyA2q30",
  "data/tweet-wsj/2021/7/1413699504470204422.json": "When it’s hot, your skin dissipates about 90% of your body’s heat. But sweating alone isn’t enough to cool you down.  https://t.co/XAMmfa8Snp",
  "data/tweet-wsj/2021/7/1413679413712064512.json": "On July 14, 1921, Nicola Sacco and Bartolomeo Vanzetti were convicted of murder. A century later, the case continues to stir debate about immigration, politics and justice in America. https://t.co/wSGPbunTM5",
  "data/tweet-wsj/2021/7/1413535967563112456.json": "The spread of the Delta variant is raising fresh concerns about the efficacy of Chinese vaccines, which have been central to inoculation efforts in the developing world https://t.co/OVW9IECIDG",
  "data/tweet-wsj/2021/7/1413826612097921026.json": "Investors gave millions of dollars to two South African teenagers for bitcoin investments when crypto prices were soaring. Now the brothers have disappeared, leaving them hunting for their money.  https://t.co/aKatfZQqO6",
  "data/tweet-wsj/2021/7/1413807743400615940.json": "In the billionaire space race, Richard Branson and Jeff Bezos are using different methods. We show through these immersive videos how they plan to get there and back. https://t.co/uqrO9o87G8",
  "data/tweet-wsj/2021/7/1413785345062223874.json": "Figures from Australia's Delta variant outbreak suggest that two vaccine doses offer significant protection against severe illness and hospitalization https://t.co/mZ9aHpv8D9",
  "data/tweet-wsj/2021/7/1413652962262585347.json": "\"Black Widow\" Review: Scarlett Johansson and Florence Pugh star as sisters reunited in this emotional and action-packed addition to the Marvel Cinematic Universe https://t.co/zncJM4nW1R",
  "data/tweet-wsj/2021/7/1413849512821600256.json": "An uninsured person could be billed around $66,000 for getting a stent after a heart attack—more than three times what an insurance company would be charged at the same hospital for the same thing https://t.co/Jhvc8V6c8z",
  "data/tweet-wsj/2021/7/1413841702075392000.json": "The rich are borrowing against their stocks more than ever before, banks say. Taxes are a big reason for the “buy, borrow, die” strategy. https://t.co/Rd66NpjL9t",
  "data/tweet-wsj/2021/7/1413513823697346570.json": "Schools should stay open this fall, even in places where Covid cases are rising, the CDC said. Unvaccinated students and teachers should wear masks. https://t.co/fm9LITKOtR",
  "data/tweet-wsj/2021/7/1413838199860961291.json": "Saudi Arabia has again sharply limited the numbers allowed to perform the hajj, the once-in-a-lifetime pilgrimage that Muslims save years for. “I need to pray in Mecca.” https://t.co/Ft4pWPfi5J",
  "data/tweet-wsj/2021/7/1413830421574455296.json": "Nearly 140 companies in the S&amp;P 500, including Netflix, said their median worker was paid at least $100,000 last year. Others, including Amazon and Starbucks, said their median worker made less than $30,000. https://t.co/LEKyBFG0HU",
  "data/tweet-wsj/2021/7/1413878049989402624.json": "Top-ranked Ashleigh Barty won Wimbledon in three sets, beating Karolina Pliskova in the final to capture her second Grand Slam singles title https://t.co/QQYYKp0GxF",
  "data/tweet-wsj/2021/7/1413792644652797954.json": "Take a look at the front page of today's Wall Street Journal https://t.co/vM8vBCkt4g https://t.co/FyQSXvuRY6",
  "data/tweet-wsj/2021/7/1413887014865354757.json": "A Robert E. Lee statue—the focus of white supremacists’ 2017 protest that left one dead in Charlottesville, Va.—has been removed from its stone pedestal https://t.co/WQKYjIZ6HF",
  "data/tweet-wsj/2021/7/1413805220560257025.json": "Jimmy Jam &amp; Terry Lewis, the legendary songwriting duo behind hits by Janet Jackson, Mariah Carey and Mary J. Blige, finally step into the limelight with the release of their first album as recording artists https://t.co/W1IwCDMnFn",
  "data/tweet-wsj/2021/7/1413853034392731661.json": "Theranos founder Elizabeth Holmes goes on trial next month on charges that she defrauded investors and patients about her blood-testing startup. Here’s everything you need to know about the case. https://t.co/BvIq2ZVdwY",
  "data/tweet-wsj/2021/7/1413894565849964547.json": "Hedge funds walloped by the meteoric rise of stocks such as GameStop and AMC in January are still struggling to get out from under those losses https://t.co/uY3XDAFsaa",
  "data/tweet-wsj/2021/7/1413928530988175364.json": "Amtrak plans to spend $7.3 billion to replace aging railcars and locomotives, adding more comfortable seating, individual power outlets and “a more contemporary food service experience” https://t.co/gAlKJiwDwH",
  "data/tweet-wsj/2021/7/1413883257846997001.json": "JPMorgan and Goldman are calling employees back to the office. Rivals like Citigroup are touting their flexibility, hoping it will help them poach top talent. https://t.co/KiTIaZ2zKD",
  "data/tweet-wsj/2021/7/1413932291374600198.json": "\"Shall we leave?'' Afghanistan's most educated and successful men and women are weighing plans to escape before the Taliban upends their country. https://t.co/DMns6h2Pqo",
  "data/tweet-wsj/2021/7/1413939588213653506.json": "The biggest U.S. cigarette maker is getting rid of its 18,000-acre Marlboro Ranch in Montana, where smokers went on all-expenses-paid trips https://t.co/de3OdW6AI5",
  "data/tweet-wsj/2021/7/1413875757026357248.json": "When he attempted the fastest Atlantic crossing, his vessel capsized. He tried to fly a hot-air ballon around the world but crash-landed. Richard Branson is ready for his next high-profile act: flying to the edge of space. https://t.co/4dNQyOJehG",
  "data/tweet-wsj/2021/7/1413951237838540801.json": "In a Mozilla study, 71% of videos that YouTube viewers flagged as objectionable had been recommended by YouTube’s algorithms https://t.co/X80reZ8BD6",
  "data/tweet-wsj/2021/7/1413992457306583047.json": "Figures from Australia's Delta variant outbreak suggest that two vaccine doses offer significant protection against severe illness and hospitalization https://t.co/wNBnIpGq3J",
  "data/tweet-wsj/2021/7/1413966281695506432.json": "From @WSJopinion: If Facebook, Twitter, and YouTube can censor me, they can censor youーand believe me, they are, writes Donald Trump https://t.co/vCCaT3INuZ",
  "data/tweet-wsj/2021/7/1413800212724920320.json": "Facial recognition for one-to-one identification has become one of the most widely used applications of artificial intelligence. Hackers are pioneering new ways of tricking those systems. https://t.co/L0Tp0QxynJ",
  "data/tweet-wsj/2021/7/1413717144840327168.json": "Here's an early look at the front page of The Wall Street Journal's weekend edition https://t.co/zb2wYQE00Q https://t.co/ciZ7PEPvZS",
  "data/tweet-wsj/2021/7/1413977580332584961.json": "Pfizer will seek clearance from regulators to distribute a Covid-19 booster shot, amid a rise in new virus strains #WSJWhatsNow https://t.co/hCQBXLoZWx",
  "data/tweet-wsj/2021/7/1414060645985800192.json": "G-20 finance chiefs endorsed an overhaul of the rules for taxing international companies, a landmark achievement of global cooperation after years of tensions https://t.co/p1aLEDgJuO",
  "data/tweet-wsj/2021/7/1414056877885956100.json": "The biggest U.S. cigarette maker is getting rid of its 18,000-acre Marlboro Ranch in Montana, where smokers went on all-expenses-paid trips https://t.co/iM5IgQlv2r",
  "data/tweet-wsj/2021/7/1413973854817505285.json": "Alcohol always requires care in a professional setting. After more than a year in lockdown, colleagues may need to remind themselves of the right way to do work drinks. https://t.co/VdMZ8M54k7",
  "data/tweet-wsj/2021/7/1414030446476906508.json": "We’ve spent much of the pandemic isolated. As we go back out into the world, we’re coming face-to-face with more B.S., @EBernsteinWSJ writes https://t.co/ml8UwHmpT2",
  "data/tweet-wsj/2021/7/1414046799397064707.json": "From @WSJBooks: A Nobel Prize-winning psychologist and economist and his co-authors explain how noise undermines the workings of professionals in fields such as medicine, law and economics. “Wherever there is judgment, there is noise.” https://t.co/mbD4A06Zsx",
  "data/tweet-wsj/2021/7/1414079511235334146.json": "Hedge funds that were battered by the surge in meme stocks like GameStop and AMC are still struggling to recover https://t.co/TYxDoR1WMu",
  "data/tweet-wsj/2021/7/1413936146820784128.json": "San Francisco has one of the highest vaccination rates in the country but one of the lowest return-to-work rates. Many of the stores and restaurants in the business district remain closed. “It’s a ghost town.\" https://t.co/150OjmhsTO",
  "data/tweet-wsj/2021/7/1414109729710907395.json": "Banks say their wealthy clients are borrowing more than ever before, often using loans backed by their stocks and bonds. Taxes are a big reason for the “buy, borrow, die” strategy. https://t.co/jfC5JVhw6O",
  "data/tweet-wsj/2021/7/1414173896895569924.json": "As the Taliban appears to be on the cusp of seizing power in Afghanistan, panic is spreading through neighboring Pakistan https://t.co/MdubsLWU98",
  "data/tweet-wsj/2021/7/1413924732416708612.json": "Supermarkets are stocking up on everything from sugar to frozen meat as food prices increase, driving shortages and squeezing the food supply chain #WSJWhatsNow https://t.co/Pk23jbkv6L",
  "data/tweet-wsj/2021/7/1414185229183508482.json": "From @WSJopinion: Parents have every right, even a duty, to fight back against the invasion of progressive politics in their schools, writes The Editorial Board https://t.co/KKtrQ4tdwG",
  "data/tweet-wsj/2021/7/1414094631487393792.json": "The “mega back door Roth IRA conversion” is a useful, but little-known, way to grow your retirement account tax free. @annetergesen explains the strategy, which is available in a number of 401(k) plans. https://t.co/a1H8NDjEPG",
  "data/tweet-wsj/2021/7/1414196539313037312.json": "In the billionaire space race, Richard Branson and Jeff Bezos are using different methods. We show through these immersive videos how they plan to get there and back. https://t.co/oALEmTPnZf",
  "data/tweet-wsj/2021/7/1414211652204048391.json": "Amtrak plans to spend $7.3 billion to replace aging railcars and locomotives, adding more comfortable seating, individual power outlets and “a more contemporary food service experience” https://t.co/ueJCzLu6Q8",
  "data/tweet-wsj/2021/7/1414233581233315844.json": "Richard Branson is traveling to the edge of space aboard a Virgin Galactic vehicle. Watch live coverage: https://t.co/geuK903tcT",
  "data/tweet-wsj/2021/7/1414246003507703816.json": "Billionaire Richard Branson and five others flew to the edge of space, in a flight aimed at spurring a new space-tourism industry. Watch live: https://t.co/8x4UjPHBxg https://t.co/QNM5hLgyzU",
  "data/tweet-wsj/2021/7/1414241853780733952.json": "Netflix said their median worker was paid at least $100,000 last year, while Amazon and Starbucks said their median worker made less than $30,000 https://t.co/7xJpTi1F2Y",
  "data/tweet-wsj/2021/7/1413996534761459719.json": "In the billionaire space race, Richard Branson and Jeff Bezos are using different methods. We show through these immersive videos how they plan to get there and back. https://t.co/Cr2uMvQPbU",
  "data/tweet-wsj/2021/7/1414263398297182214.json": "Novak Djokovic won Wimbledon for the sixth time. His 20 men's Grand Slam singles titles tie Roger Federer and Rafael Nadal for the most all-time. https://t.co/5oXzlWu9u9",
  "data/tweet-wsj/2021/7/1414258700404109313.json": "Richard Branson landed successfully after reaching the edge of space in a flight aimed at spurring a new, multibillion-dollar space-tourism industry https://t.co/LXwCdF6O0F",
  "data/tweet-wsj/2021/7/1414256956815167493.json": "From @WSJopinion: The GOP could make real gains in Michigan next year, including replacing Gov. Gretchen Whitmer. But it won’t happen if the party spends the next year peering down a rabbit hole of 2020 conspiracy theories. https://t.co/Lfe9cTexWO",
  "data/tweet-wsj/2021/7/1414273870140485633.json": "The biggest U.S. cigarette maker is getting rid of its 18,000-acre Marlboro Ranch in Montana, where smokers went on all-expenses-paid trips https://t.co/cVQ4vrBQIV",
  "data/tweet-wsj/2021/7/1414277445780484105.json": "Marvel spinoff “Black Widow” ruled this weekend’s box office, grossing $80 million in the U.S. and Canada, according to preliminary studio estimates. The film also generated more than $60 million globally through Disney+. https://t.co/Jg0lUkcOPp",
  "data/tweet-wsj/2021/7/1414285148393193477.json": "“There is still no smoking gun.” Scientists are searching for the origin of the coronavirus that caused Covid-19. Some worry they may never find it. https://t.co/bd2c8G8EjO",
  "data/tweet-wsj/2021/7/1414310626877485057.json": "Billionaire entrepreneur Richard Branson and five crew members successfully traveled to the edge of space aboard a Virgin Galactic spacecraft https://t.co/Wep12TbxJE",
  "data/tweet-wsj/2021/7/1414313617403564040.json": "An uninsured person could be billed around $66,000 for getting a stent after a heart attack—more than three times what an insurance company would be charged at the same hospital for the same thing https://t.co/XIgjG6yqOc",
  "data/tweet-wsj/2021/7/1414307322910941194.json": "Hundreds of ticketless fans rushed into Wembley Stadium ahead of England’s European Championship final showdown with Italy https://t.co/R9NIKn4oU8",
  "data/tweet-wsj/2021/7/1414328790176649216.json": "Farmers have long relied on insects, wind and human workers to help pollinate crops. Now, advances in AI are helping some startups develop another way. https://t.co/iSYk58njV0",
  "data/tweet-wsj/2021/7/1414344391293120512.json": "Italy defeated England in a shootout to win soccer's European Championship, securing the trophy for the first time since 1968 https://t.co/NgGINX6dkY",
  "data/tweet-wsj/2021/7/1414355082993455106.json": "“This is a virus that we’re going to have to learn to live with,” said an infectious-disease specialist. “We’re going to have Covid-19 patients for the foreseeable future.” https://t.co/sSkuVfLw5n",
  "data/tweet-wsj/2021/7/1414215432911958016.json": "The world's largest crypto exchange, Binance, froze just as bitcoin plunged. Hundreds of traders have banded together to get their money back. https://t.co/Cqplaad5pf",
  "data/tweet-wsj/2021/7/1414358882391101446.json": "At 26, Andrea Fletcher has worked for Google, Apple and Roblox. She says her career in software engineering really began with her childhood love of logic and math puzzles. https://t.co/x239ybaR0W",
  "data/tweet-wsj/2021/7/1414370191795015693.json": "Hundreds of Cubans took to the streets in demonstrations in Havana and at least six other cities throughout the Communist island, demanding an end to the dictatorship and protesting the lack of food and Covid-19 vaccines https://t.co/8mhqeGu26n",
  "data/tweet-wsj/2021/7/1414373990538399748.json": "\"Shall we leave?'' Afghanistan's most educated and successful men and women are weighing plans to escape before the Taliban upends their country. https://t.co/z0RvCiRzmK",
  "data/tweet-wsj/2021/7/1413947396816613381.json": "\"How the hell am I going to pay this off?\" Columbia film grads say the university blew off their worries about six-digit costs. One administrator's suggestion: Watch the president's dogs. https://t.co/KWPM99rdlC",
  "data/tweet-wsj/2021/7/1414389083187601412.json": "Elon Musk bought a ticket for his own space ride with Virgin Galactic, the company said. Tickets have sold for $250,000 each, and the company has collected $80 million in sales and deposits. https://t.co/1OFl9Eaw2w",
  "data/tweet-wsj/2021/7/1414377735661756416.json": "Scientists are searching for the origin of the coronavirus that caused Covid-19. Some worry they may never find it. https://t.co/DZlg0Acgn5",
  "data/tweet-wsj/2021/7/1414404183323811842.json": "JPMorgan and Goldman are calling employees back to the office. Rivals like Citigroup are touting their flexibility, hoping it will help them poach top talent. https://t.co/hD56ctfu3Y",
  "data/tweet-wsj/2021/7/1414411730936078340.json": "\"How the hell am I going to pay this off?\" Columbia film grads say the university blew off their worries about six-digit costs. One administrator's suggestion: Watch the president's dogs. https://t.co/lN4goNt9ys",
  "data/tweet-wsj/2021/7/1414434397382643718.json": "Scientists are searching for the origin of the coronavirus that caused Covid-19. Some worry they may never find it. https://t.co/cKFED31U1E",
  "data/tweet-wsj/2021/7/1414464547633631232.json": "Elon Musk bought a ticket for his own space ride with Virgin Galactic, the company said. Tickets have sold for $250,000 each, and the company has collected $80 million in sales and deposits. https://t.co/2Agko0SLwW",
  "data/tweet-wsj/2021/7/1413864608264249346.json": "“Black Widow” arrives on the big screen just as Marvel also focuses on churning out TV series. To compare the strategies, we broke down every action sequence in “Black Widow,” “WandaVision,” “Falcon and the Winter Soldier” and “Loki.” https://t.co/ItUyvPfzUK",
  "data/tweet-wsj/2021/7/1414441925764059136.json": "Take an early look at the front page of The Wall Street Journal https://t.co/8HsujKaGsw https://t.co/CPplMTJqQx",
  "data/tweet-wsj/2021/7/1414419311331000324.json": "First it said farewell to its Marlboro Man ads. Now, the biggest U.S. cigarette maker is getting rid of its 18,000-acre Marlboro Ranch in Montana where smokers went on all-expenses-paid trips. https://t.co/DoWCOwHZ0w",
  "data/tweet-wsj/2021/7/1414509854434136064.json": "The U.S. could be headed for several years of higher inflation than households and investors have seen since the early 1990s, according to economists surveyed by The Wall Street Journal https://t.co/2RIYYPTpsk",
  "data/tweet-wsj/2021/7/1414545786768134144.json": "Elon Musk bought himself a ticket to space with Virgin Galactic, which on Sunday carried Richard Branson and five crew members on a successful test flight #WSJWhatsNow https://t.co/rmmP89JXxe",
  "data/tweet-wsj/2021/7/1414457018262466561.json": "New Yorkers last year cheered the pandemic's frontline workers from windows and balconies every night. As the city reopens, a few noisemakers are still at it. https://t.co/e5Dm48hUtd",
  "data/tweet-wsj/2021/7/1414558263333490688.json": "Large crowds gathered to watch Italy defeat England in a penalty shootout in the Euro 2020 final, dashing England’s hopes of winning its first major men's soccer title in 55 years #WSJWhatsNow https://t.co/jutrtc61Lm",
  "data/tweet-wsj/2021/7/1414524949214203913.json": "At 26, Andrea Fletcher has worked for Google, Apple and Roblox. She says her career in software engineering really began with her childhood love of logic and math puzzles. https://t.co/l2X2TB5aZ6",
  "data/tweet-wsj/2021/7/1414523536497168387.json": "Flipkart, the Indian e-commerce startup backed by Walmart, has jumped in value to nearly $38 billion https://t.co/dLrT1uUJ5f",
  "data/tweet-wsj/2021/7/1414494750359658499.json": "“This is a virus that we’re going to have to learn to live with,” said an infectious-disease specialist. “We’re going to have Covid-19 patients for the foreseeable future.” https://t.co/zCuOtb0eTk",
  "data/tweet-wsj/2021/7/1414562723376025607.json": "Elon Musk, Stephen Colbert and Khalid: After Richard Branson’s celebrity-packed, live-streamed space flight, Virgin Galactic now has to get paying customers aboard https://t.co/ORZe6FvwIq",
  "data/tweet-wsj/2021/7/1414608345349201924.json": "Three Black players who missed penalty kicks in England’s European Championship loss were targeted by thousands of racist social-media posts, bringing calls of condemnation from Prince William and U.K. Prime Minister Boris Johnson https://t.co/oqXLDJr8KS",
  "data/tweet-wsj/2021/7/1414606146984423424.json": "Virgin Galactic founder Richard Branson’s trip to the edge of space opens the door to space tourism, but the company’s long-term vision may be too down to Earth for space-loving investors, explains @jonsindreu #WSJWhatsNow https://t.co/Mttpf0cNGI",
  "data/tweet-wsj/2021/7/1414597771332628484.json": "Elon Musk took the stand to defend Tesla's roughly $2.1 billion deal for SolarCity in 2016 from allegations he led Tesla to overpay for the home-solar company https://t.co/8I9zjs5aUl",
  "data/tweet-wsj/2021/7/1414626886878171150.json": "Richard Branson approached the customer experience of his space tourism business like he did with airlines, cruise ships and trains: with a notebook. Here are a few of his observations, both from space and after he came back to earth. https://t.co/0lPT3ml5OY",
  "data/tweet-wsj/2021/7/1414634887831867398.json": "Cuba's Communist government intensified a crackdown on protesters, arresting at least 80 people, activists said. President Biden expressed support for the demonstrators. https://t.co/gcLl9VYvza",
  "data/tweet-wsj/2021/7/1414641998108282888.json": "From @WSJopinion: “I guarantee you every unit in the Navy is up to speed on their diversity training,” said one recently retired senior enlisted leader. “I’m sorry that I can’t say the same of their ship-handling training.” https://t.co/NerRX6gq4n",
  "data/tweet-wsj/2021/7/1414667760949415945.json": "The FDA plans to warn that Johnson &amp; Johnson's Covid-19 vaccine is linked to a very small incidence of cases of a rare neurological disorder, a person familiar with the matter said https://t.co/jgQVM4nnuc",
  "data/tweet-wsj/2021/7/1414332454312325126.json": "Elon Musk heads back to court. A potentially billion-dollar question: Did he control Tesla’s takeover of SolarCity?  https://t.co/oWsKpZ3nwi",
  "data/tweet-wsj/2021/7/1414683514352672769.json": "Cuban citizens have taken to the the streets to protest for the first time in more than six decades as the country’s economic crisis and the pandemic lead to deteriorating living conditions and shortages. Here's what you need to know. https://t.co/yQhufMvjHj",
  "data/tweet-wsj/2021/7/1414680661940637696.json": "The Trump Organization has removed finance chief Allen Weisselberg as an officer at some of its subsidiaries, after prosecutors accused him and the company of a 15-year tax-fraud scheme, according to public filings and people familiar with the matter https://t.co/F9DIIQihRh",
  "data/tweet-wsj/2021/7/1414702398958936066.json": "France will only allow people who are vaccinated or recently tested negative for Covid-19 to enter bars, restaurants and malls in France starting from August, as the country tries to check the spread of the Delta variant  https://t.co/RHGu9vsK34",
  "data/tweet-wsj/2021/7/1414713717661605888.json": "McDonald’s owners are adding emergency child care, tuition assistance and other benefits, as many U.S. restaurants are struggling to hire enough workers to run their businesses https://t.co/ufMFFXghWX",
  "data/tweet-wsj/2021/7/1414721235666178050.json": "In a rare show of dissent, thousands of Cubans took to the streets to protest food and medicine shortages and to call for an end to the country's dictatorship, videos show. #WSJWhatsNow https://t.co/6yw3RliLNb",
  "data/tweet-wsj/2021/7/1414732578976829441.json": "Shohei Ohtani isn't the best two-way player since Babe Ruth. He's better. https://t.co/1yv3dKftww",
  "data/tweet-wsj/2021/7/1414725036133470209.json": "Microsoft agreed to buy cybersecurity provider RiskIQ, a deal that would add to Microsoft’s portfolio of security services amid a rise in online attacks. https://t.co/o7BgKVnpb0",
  "data/tweet-wsj/2021/7/1414751451734282240.json": "Haiti sits on the brink of anarchy amid hunger, gang violence and a power vacuum following the assassination of the country’s president. https://t.co/eG4ciiVKJr",
  "data/tweet-wsj/2021/7/1414785425164623873.json": "Blimps in recent decades have been most conspicuous as floating billboards. But some companies are reappraising the airship as a travel experience, with one planning to fly people in a luxury blimp buoyed by helium sometime between 2024 and 2025. https://t.co/NKpA5BUcgK",
  "data/tweet-wsj/2021/7/1414762772697649155.json": "Six months into office, President Biden has been slow to define his Cuba policy. Now, the widespread street protests and the communist government’s violent crackdown may have forced the issue and Biden faces a challenging political landscape. https://t.co/9722pdEN5B",
  "data/tweet-wsj/2021/7/1414708660467605511.json": "Two of the politicians competing for power in Haiti after the assassination of President Jovenel Moïse are close to an agreement that they hope will stabilize the embattled Caribbean nation and lead to fresh elections, one of the politicians involved said https://t.co/ZrH6hH3QRz",
  "data/tweet-wsj/2021/7/1414653425820839936.json": "Autocrats have seemed to hold the upper hand in the epic struggle with democracies, writes @GeraldFSeib. Cuba’s new unrest frames the key question: Can authoritarian regimes survive? https://t.co/Bnz7TZ1ppg",
  "data/tweet-wsj/2021/7/1414849605519515652.json": "Israel began administering a booster shot of Pfizer's Covid-19 vaccine to people with weak immune systems, as it confronts an outbreak of the Delta variant https://t.co/seXMBGnndQ",
  "data/tweet-wsj/2021/7/1414789212449251334.json": "From @WSJopinion: The White House’s strategy to avoid ethical compromises with Hunter Biden’s art sale: Keep everything secret https://t.co/nHHNS29VWk",
  "data/tweet-wsj/2021/7/1414868464347623434.json": "France fined Google for allegedly violating orders to negotiate paid deals with news publishers, upping the ante in a global fight over whether tech companies should pay for news https://t.co/MTxsRmmizv",
  "data/tweet-wsj/2021/7/1414907960837345280.json": "The day after Virgin Galactic sent founder Richard Branson to the edge of space, the company’s shares posted their worst performance in more than a year #WSJWhatsNow https://t.co/OEoDB0iaZT",
  "data/tweet-wsj/2021/7/1414924242127314945.json": "Cuba’s Communist government deployed security forces across the country and communications with the outside world were disrupted amid large-scale protests #WSJWhatsNow https://t.co/hDa0CZJIi8",
  "data/tweet-wsj/2021/7/1414925740815044626.json": "U.S. consumer prices rose 5.4% in June from a year ago, keeping inflation at the highest annual rate in 13 years as the economic recovery gained steam https://t.co/HbP9VXcWMp",
  "data/tweet-wsj/2021/7/1414928865206603776.json": "The pandemic pushed many restaurant and bar workers to find new careers. Many say they will never go back.  https://t.co/Zqv3dcMhaI",
  "data/tweet-wsj/2021/7/1414966622482227211.json": "Thailand became the latest country to signal waning confidence in a Chinese vaccine against the highly contagious Delta variant, saying it would offer booster shots of Western doses to healthcare workers https://t.co/gHdghgiuOz",
  "data/tweet-wsj/2021/7/1415000594637631496.json": "Olivia Rodrigo is teaming up with the White House to encourage young people to get vaccinated against Covid-19 https://t.co/Wv1T7UODAn",
  "data/tweet-wsj/2021/7/1414988673934929920.json": "Texas state House members voted to send law enforcement to find and return absent Democrats “under warrant of arrest, if necessary,” a day after dozens of Democratic House members fled the state in an effort to kill election legislation https://t.co/IN38XjGDEp",
  "data/tweet-wsj/2021/7/1414985521982550017.json": "Looting and violence triggered by former President Jacob Zuma's arrest are broadening to reflect more deep-seated problems in Africa’s most developed economy, where a third pandemic lockdown is exacerbating serious inequities and joblessness https://t.co/N56n7h2ACO",
  "data/tweet-wsj/2021/7/1414951528675385360.json": "With the no-spectator rule at the Tokyo Games, big sponsors—including brewer Asahi with its “Tokyo 2020 Official Beer”—risk seeing their investment lose fizz https://t.co/CDG0FG5wwu",
  "data/tweet-wsj/2021/7/1415057205292830720.json": "The world wants everything from Simone Biles, and she keeps on giving it. The 24-year-old pulls off some of the most difficult skills in gymnastics better than any of her competitors, then adds unimaginable ones. https://t.co/vf68EG5o87",
  "data/tweet-wsj/2021/7/1415027026533273601.json": "Norwegian Cruise Line has sued Florida’s surgeon general, challenging the state’s barring of businesses from requiring proof of Covid-19 vaccination https://t.co/dafmHineB0",
  "data/tweet-wsj/2021/7/1415023277395828740.json": "A group of dissident Cuban artists set out to challenge the government with street performances and viral videos—and helped spark an uprising  https://t.co/0iScrt0UaU",
  "data/tweet-wsj/2021/7/1414959058700931075.json": "United Airlines and a regional airline partner, Mesa, are hoping to use a new electric plane by Heart Aerospace to revitalize short-haul flying https://t.co/RKmtgbZozH",
  "data/tweet-wsj/2021/7/1414687285023551488.json": "Virgin Galactic positioned itself to raise as much as $500 million through stock sales, a day after its founder, British billionaire Richard Branson, and five other crew members flew to the edge of space https://t.co/Bc56HVMrUb",
  "data/tweet-wsj/2021/7/1415094962803335170.json": "Shohei Ohtani isn’t the “Japanese Babe Ruth.\" He leads the major leagues in home runs and is the first player ever to be selected as an All-Star as a pitcher and hitter. Nobody—not even the legendary Babe—has ever done anything like this before. https://t.co/tMTtvgqzF2",
  "data/tweet-wsj/2021/7/1415087423600594953.json": "Italy suspended the passage of large cruise ships through the historic center of Venice, resolving, for now, a long-running dispute over the lucrative cruise-ship traffic that has helped keep Venice’s economy afloat but infuriated many residents https://t.co/ttTMHUNKhj",
  "data/tweet-wsj/2021/7/1415068554752405505.json": "President Biden will nominate former Arizona Republican Sen. Jeff Flake to serve as ambassador to Turkey, the White House said https://t.co/LMnHbc2ORX",
  "data/tweet-wsj/2021/7/1414619308764901388.json": "Dollar General has reported 31 consecutive years of growth and is opening new U.S. stores every day. Here’s how the discount retailer keeps expanding while keeping prices low. https://t.co/3fPCYcVYXG https://t.co/9R5SP55M8p",
  "data/tweet-wsj/2021/7/1415174252807004161.json": "A federal jury convicted a former bank executive on charges that he helped arrange $16 million in loans to Paul Manafort, in exchange for help getting a job in the Trump administration https://t.co/7d4cCGhqUb",
  "data/tweet-wsj/2021/7/1415151606694391810.json": "After a turbulent year, Christie’s said Tuesday that millennials in Asia and cryptocurrency collectors are splurging on blue-chip art, bidding up everything from jewelry to Jean-Michel Basquiat https://t.co/OzC5sSvA5H",
  "data/tweet-wsj/2021/7/1415123541679280131.json": "Democrats on the Senate Budget Committee agreed to a $3.5 trillion climate, education and antipoverty plan, Majority Leader Chuck Schumer said https://t.co/TEyC5UBUgF",
  "data/tweet-wsj/2021/7/1415132708804702208.json": "Iranian intelligence agents plotted to kidnap a U.S.-based human-rights activist and critic of the Islamic Republic and forcibly return her to Iran, federal prosecutors said, marking an escalation of Iran's attempts to silence dissidents https://t.co/ShUvqaBSZd",
  "data/tweet-wsj/2021/7/1415155363897303040.json": "A divided federal appeals court held that the federal government may not bar federally licensed gun dealers from selling handguns to law-abiding citizens under 21 years old https://t.co/YdDueqMZJW",
  "data/tweet-wsj/2021/7/1415136490795982854.json": "U.S. and Turkish officials have made progress in talks on a plan for Turkish troops to run Kabul’s international airport, which would enable foreign embassies to remain in Afghanistan after the American military withdrawal, Turkey’s defense minister said https://t.co/76e6OzX5iX",
  "data/tweet-wsj/2021/7/1415049675695132674.json": "President Biden will blast efforts in Republican-controlled states to tighten voting rules and call on Congress to advance stalled legislation in a speech Tuesday https://t.co/0zfxy3UkFg",
  "data/tweet-wsj/2021/7/1415073583727058949.json": "From @WSJopinion: A medication doesn’t change its function when the occupant of the White House changes. The case for getting as many people as possible vaccinated shouldn’t be demonized by politics, writes @GerardTBaker. https://t.co/iYFbviwUqc",
  "data/tweet-wsj/2021/7/1415281170607132676.json": "After dozens of House Democrats fled Texas to prevent the passage of a bill imposing stricter voting rules, state lawmakers voted to have them returned “under warrant of arrest, if necessary” #WSJWhatsNow https://t.co/sH4LYqZuZ2",
  "data/tweet-wsj/2021/7/1415271802452992001.json": "Italy suspended the passage of large cruise ships through the center of Venice, amid divisions between residents who want them banned and the tourism industry #WSJWhatsNow https://t.co/mlfnXcJ1ih",
  "data/tweet-wsj/2021/7/1415310777767059466.json": "Drug overdose deaths in the U.S. surged nearly 30% last year to a record high, driven largely by the proliferation of fentanyl and amplified by the stress and isolation of the pandemic https://t.co/3vy7WHrDti",
  "data/tweet-wsj/2021/7/1415227093797978112.json": "When pro-cyclist Lachlan Morton set out to ride the entire Tour de France route unsupported, even he couldn’t be sure he’d make it to Paris. But in the predawn hours of Tuesday, he rolled onto the Champs-Élysées. https://t.co/O47ggfwMuF",
  "data/tweet-wsj/2021/7/1414747687082094599.json": "In the quest to understand how the Covid-19 pandemic began, one persistent mystery is an Italian woman who researchers say they can no longer find. https://t.co/gC54SNyd5b",
  "data/tweet-wsj/2021/7/1415354798254215168.json": "Breaking: The Justice Department's inspector general is set to release a report highly critical of the FBI’s failure in 2015 to probe allegations that former national gymnastics team physician Larry Nassar sexually assaulted athletes, people familiar say https://t.co/sRKFPuyLnz",
  "data/tweet-wsj/2021/7/1415289987642318852.json": "Federal Reserve Chairman Jerome Powell said inflation had increased notably and would likely remain elevated in the coming months before moderating https://t.co/rM6WhbKxVd",
  "data/tweet-wsj/2021/7/1415419600368504833.json": "The FBI disregarded Olympic gymnasts' complaints of sexual assault by doctor Larry Nassar and made false statements to cover mistakes, Justice Department investigators said https://t.co/bkoFC7AVdN",
  "data/tweet-wsj/2021/7/1415423385396563970.json": "A man who hadn't uttered a word in a decade was able to \"speak\" thanks to a brain implant, which transcribed his words as he imagined them https://t.co/8t5M69fEfv",
  "data/tweet-wsj/2021/7/1415404502526488577.json": "From @WSJopinion: Ultimately, Critical Race Theory is about blaming your problems on other people—based on their race—which might be the last thing we should be teaching our children, writes @jasonrileywsj https://t.co/dAHQqxd2KN",
  "data/tweet-wsj/2021/7/1415447198591066114.json": "Johnson &amp; Johnson is recalling Neutrogena and Aveeno spray sunscreens from U.S. stores after detecting a potentially cancer-causing chemical in some samples https://t.co/Et5rPMc1JI",
  "data/tweet-wsj/2021/7/1415457352464076800.json": "Britney Spears retained a new lawyer who promised to petition the court to remove her father from his role as her conservator https://t.co/DxmaMCgAcV",
  "data/tweet-wsj/2021/7/1415468706856046596.json": "“It should be required watching.” Why real coaches are taking notes from Ted Lasso. https://t.co/EdRMoA3sPn",
  "data/tweet-wsj/2021/7/1415464896314097666.json": "Parts of China are planning to bar residents who haven’t been vaccinated against Covid-19 from public venues, sparking criticism  https://t.co/ozy3P1d44L",
  "data/tweet-wsj/2021/7/1415498873406164998.json": "Review: Three years after Anthony Bourdain's death by suicide, a documentary attempts to take the measure of the larger-than-life man. @JoeMorgenstern reviews “Roadrunner: A Film About Anthony Bourdain” https://t.co/ccVmhQrril",
  "data/tweet-wsj/2021/7/1415521548291690501.json": "A man who hadn't uttered a word in a decade was able to \"speak\" thanks to a brain implant, which transcribed his words as he imagined them https://t.co/k3O1AYz0WA",
  "data/tweet-wsj/2021/7/1415532859977314309.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/QYkOkPGiKg",
  "data/tweet-wsj/2021/7/1415551762996637696.json": "Drug overdose deaths in the U.S. surged nearly 30% last year to a record high, driven largely by the proliferation of fentanyl and amplified by the stress and isolation of the pandemic https://t.co/BKPwqCzxYA",
  "data/tweet-wsj/2021/7/1415629149063061507.json": "Johnson &amp; Johnson said it was recalling some of its sunscreens from U.S. stores, after detecting benzene, a potentially cancer-causing chemical, in some samples #WSJWhatsNow https://t.co/uJHx9H8dw7",
  "data/tweet-wsj/2021/7/1415600794628415491.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/bOz3h1hbyy",
  "data/tweet-wsj/2021/7/1415638549945360385.json": "Catastrophic rainfall affects Germany and its neighbors as scientists say extreme weather is becoming more frequent        https://t.co/QrKts0giFE",
  "data/tweet-wsj/2021/7/1415647836050493441.json": "Britney Spears shared a video of her turning cartwheels after a judge said she could hire a lawyer of her choosing as she seeks to remove her father as her conservator #WSJWhatsNow https://t.co/PdaGWMEI4q",
  "data/tweet-wsj/2021/7/1415683849409863703.json": "Elite universities in recent years have awarded thousands of master’s degrees that don’t provide graduates enough early career earnings to begin paying down their federal student loans, a WSJ analysis of Education Department data found https://t.co/hu9dXhSS04",
  "data/tweet-wsj/2021/7/1415695207513874433.json": "As videos and messages spread through smartphones, feeding protests across Cuba, the government switched off the web and telephones to tame the “wild stallion” https://t.co/3a0kssm2n7",
  "data/tweet-wsj/2021/7/1415704527001505792.json": "Johnson &amp; Johnson is recalling some Neutrogena and Aveeno spray sunscreens after detecting benzene, a potentially cancer-causing chemical, in some samples. Here's what to know. https://t.co/lvVTkwBZtI",
  "data/tweet-wsj/2021/7/1415721597764255744.json": "The head of the U.K.’s domestic intelligence service, MI5, said the agency is doubling the resources it devotes to tackling threats from Russia, China and Iran—and faces a challenge from right-wing extremists, many of them teenagers https://t.co/7bXyLCU9yC",
  "data/tweet-wsj/2021/7/1415189384236777472.json": "Encouraging entrepreneurs used to be a key part of economic development in Xinjiang, but priorities have shifted with Xi Jinping’s security crackdown https://t.co/wmJwQusbPp",
  "data/tweet-wsj/2021/7/1415760613649833992.json": "President Biden welcomed Angela Merkel to the White House for what is likely her final visit as Germany’s chancellor https://t.co/byHrCekJq0",
  "data/tweet-wsj/2021/7/1415801606193434630.json": "Intel is exploring a $30 billion deal to buy chip maker GlobalFoundries, people familiar with the matter said. It would be Intel's largest acquisition. https://t.co/BgG6xQDMHe",
  "data/tweet-wsj/2021/7/1415857503057891338.json": "Dozens of people were feared dead and many more were missing as the worst flooding in decades caused houses to collapse in Germany, Belgium and other parts of western Europe https://t.co/N8qxfflxbx",
  "data/tweet-wsj/2021/7/1415849935329808390.json": "New York Gov. Andrew Cuomo will be questioned by state investigators as part of a probe into accusations that he sexually harassed multiple women https://t.co/oU4RmMlf4S",
  "data/tweet-wsj/2021/7/1415604584622473217.json": "Angela Merkel’s farewell visit to Washington will broadcast a friendlier tone between the U.S. and Europe, but will likely do little to reverse the long-term divergence of interests https://t.co/pQFHifGhfu",
  "data/tweet-wsj/2021/7/1415893481717911553.json": "Take an early look at the front page of The Wall Street Journal https://t.co/XlMV7OTcBm https://t.co/RZR12SytJv",
  "data/tweet-wsj/2021/7/1415831090833641474.json": "At age 36, Joshua Vish is the oldest lifeguard at the Dormont, Pa., pool. The job pays $15 an hour and is a dream come true—maybe even a life-saver. “It feels very much like, ‘Finally!’” https://t.co/6zVrIbHOhc",
  "data/tweet-wsj/2021/7/1415751816126603267.json": "Some of the former Colombian soldiers arrested for suspected involvement in the assassination of Haiti’s president took part in a training program with the U.S. military, the Pentagon said https://t.co/nXTIOTM4CP",
  "data/tweet-wsj/2021/7/1415936772736004096.json": "President Biden said the situation in Hong Kong is deteriorating and the administration is preparing a U.S. business advisory that would lay out what may happen as China continues a crackdown there  https://t.co/fMNLTP59P1",
  "data/tweet-wsj/2021/7/1416004926996729856.json": "Around 100 people have died in catastrophic flooding across parts of western Germany, Belgium and other parts of western Europe, with hundreds still missing #WSJWhatsNow https://t.co/Do5wOgbu8a",
  "data/tweet-wsj/2021/7/1415985826702536708.json": "The U.S. is warning businesses about the increasing risks of operating in Hong Kong, as China tightens its grip on the city https://t.co/dVtpSPqTd0",
  "data/tweet-wsj/2021/7/1416021573463588865.json": "More states are blocking school mandates for masks and vaccines, despite CDC recommendations and a Covid-19 surge  https://t.co/hzs6KMc6qF",
  "data/tweet-wsj/2021/7/1415970738264330241.json": "Rescuers are racing to find survivors from catastrophic flooding in Western Europe as the death toll rose to at least 100, with many more still missing https://t.co/PgZdGaXKxg",
  "data/tweet-wsj/2021/7/1415966976627953667.json": "Take an early look at the front page of The Wall Street Journal https://t.co/lq3Yok7EXp https://t.co/ieag0iup99",
  "data/tweet-wsj/2021/7/1415861286856953858.json": "On July 30, Prince's estate will release 'Welcome 2 America,\" an album he recorded in 2010 and then mysteriously shelved. And on July 9, Paisley Park, his longtime recording studio and home, unveiled an exhibition of hundreds of pairs of his custom shoes. https://t.co/o1VzPepp5D",
  "data/tweet-wsj/2021/7/1415846180811124738.json": "The biggest hip-hop album of the year so far isn’t a 2021 release—it was already blaring out of car windows a year ago. A look at how the posthumous debut album from late New York rapper Pop Smoke became a cultural phenomenon. https://t.co/3pGUvdLtHF",
  "data/tweet-wsj/2021/7/1416072663211069440.json": "Like a \"steamroller in slow motion\": China ramps up surveillance and restrictions on its 6.3 million Tibetans https://t.co/pfwwo8pOfz",
  "data/tweet-wsj/2021/7/1416046245378994177.json": "From @WSJopinion: The vaccines are as good as first heralded, even against new variants. That unvaccinated people are still being hospitalized underscores the need to get as many people vaccinated as possible, write Drs. @LeslieBienen and @MonicaGandhi9. https://t.co/7xcQrC5dxd",
  "data/tweet-wsj/2021/7/1416120801397547010.json": "“They’re killing people.” President Biden blasted Facebook and other social-media companies over the spread of misinformation around Covid-19 vaccines on their platforms. https://t.co/mSmqMH5huX",
  "data/tweet-wsj/2021/7/1416019794625798144.json": "A frenzied U.S. housing market is showing signs of calming down as more houses, especially at the high end, are listed for sale #WSJWhatsNow https://t.co/vRzQnHEhEE",
  "data/tweet-wsj/2021/7/1416123224862175236.json": "Breaking: More than a million arrests have been made at the U.S.-Mexico border so far this year, higher than any full-year total since at least 2005 https://t.co/M63TC2eET9",
  "data/tweet-wsj/2021/7/1416082746443771906.json": "Watch: Oliver Daemen, the 18-year-old who is set to be the youngest person to fly to space, speaks about his planned Blue Origin flight with Jeff Bezos https://t.co/hjqF27C5kB",
  "data/tweet-wsj/2021/7/1416149403736358914.json": "The spread of the Delta variant and rising Covid-19 cases prompted seven California counties to recommend wearing masks indoors even if fully vaccinated https://t.co/JMmtZpPHud",
  "data/tweet-wsj/2021/7/1416168379635863566.json": "The decision to do away with the requirement that women pilgrims need a close male relative to accompany them is the latest move by Saudi Arabia to loosen some restrictions https://t.co/GnvBcxXttL",
  "data/tweet-wsj/2021/7/1415797103935344641.json": "Stories about children asked to dig graves, as well as the discovery of a rib bone and tooth, helped investigators locate more than 200 remains near a former school in Kamloops, British Columbia, a researcher said https://t.co/97ex9inLWo",
  "data/tweet-wsj/2021/7/1415778269543157761.json": "Coronavirus cases and deaths have climbed rapidly in Indonesia in recent weeks, as the Delta variant has helped fuel a devastating surge that echoes the one that tore through India in the spring https://t.co/W5ygEgOPfK",
  "data/tweet-wsj/2021/7/1416221149898358785.json": "From @WSJopinion: You can oppose state coercion and still favor the life-saving benefits of mass Covid vaccination, writes The Editorial Board https://t.co/AxrfFg6d6r",
  "data/tweet-wsj/2021/7/1416253862382653442.json": "Here's an early look at the front page of The Wall Street Journal's weekend edition https://t.co/FIJBxEFs2E https://t.co/SfMz3nkO7U",
  "data/tweet-wsj/2021/7/1416261418039578624.json": "Meet gallium, the weird metal that melts in your hand and is powering a revolution in electronics https://t.co/GwVYwfFo0P",
  "data/tweet-wsj/2021/7/1416299170974076928.json": "Developing countries in Southeast Asia are increasingly turning to Western vaccines, marking a shift from a reliance on Chinese vaccines earlier in the year https://t.co/CIC7AWkIr0",
  "data/tweet-wsj/2021/7/1416211053453713409.json": "A federal judge invalidated DACA, ruling that program is unlawful because Congress never gave the executive branch the power to grant mass reprieves to immigrants who are in the U.S. without authorization https://t.co/dVTC33aoBv",
  "data/tweet-wsj/2021/7/1416336940601839619.json": "The chip world’s most important machines are made near corn fields in the Netherlands. The U.S. is trying to block China from buying them.  https://t.co/4CVmkqEOEu",
  "data/tweet-wsj/2021/7/1416329374413037575.json": "Take a look at the front page of today's Wall Street Journal https://t.co/DGfdTh6nZl https://t.co/yvSBjlAOD4",
  "data/tweet-wsj/2021/7/1416374667867299840.json": "The world wants everything from Simone Biles, and she keeps on giving it. The 24-year-old pulls off some of the most difficult skills in gymnastics better than any of her competitors, then adds unimaginable ones. https://t.co/M3heaI7C17",
  "data/tweet-wsj/2021/7/1416206043613433857.json": "Watch: NASA is planning two missions to Venus to assess if the now-toxic planet once had an ocean, continents and life. Scientists are beginning the effort on Earth, with training sensors and machine-learning systems. https://t.co/gJ1zQz2vZA",
  "data/tweet-wsj/2021/7/1415982064336265218.json": "The Cannes Film Festival plans to screen a controversial documentary on Hong Kong’s 2019 pro-democracy unrest, courting another film-industry clash with Beijing https://t.co/RmekIcfr0m",
  "data/tweet-wsj/2021/7/1416291603107483649.json": "Like a \"steamroller in slow motion\": China ramps up surveillance and restrictions on its 6.3 million Tibetans https://t.co/Z6fuMFaa0Q",
  "data/tweet-wsj/2021/7/1416359547371933697.json": "From @WSJopinion: There's a strong case to be made that social-media censorship violates the Constitution, writes Vivek G. Ramaswamy. If his lawyers do better in court than in their initial filing, Trump can win. https://t.co/rymWDXWZGj",
  "data/tweet-wsj/2021/7/1416393517325238273.json": "Gas-fired stoves are emerging as a burning issue as American cities consider phasing out natural-gas hookups to homes and businesses to reduce carbon emissions https://t.co/JWzxmLN6ef",
  "data/tweet-wsj/2021/7/1416355783059681283.json": "Yield farmers chase double-digit interest rates on crypto holdings, but it’s risky: “It’s the virtual equivalent of handing your money to a stranger.”  https://t.co/AFgmdBOYGn",
  "data/tweet-wsj/2021/7/1416404857553047561.json": "Niger is among a small group of nations on the southern edge of the Sahara that so far has mostly escaped the coronavirus scourge https://t.co/XdsVCRKBcc",
  "data/tweet-wsj/2021/7/1416241268892573698.json": "The chairman of smartphone maker Xiaomi has given company shares worth more than $2 billion to charity, in the latest huge donation by a Chinese mogul as Beijing deepens its crackdown on the country’s tech sector https://t.co/QoW7QtGTrh",
  "data/tweet-wsj/2021/7/1416438814969585668.json": "Stablecoins, digital currencies pegged to national currencies like the U.S. dollar, are increasingly seen as a potential risk not just to crypto markets, but to the capital markets as well https://t.co/EsCwDSbcpA",
  "data/tweet-wsj/2021/7/1416419960495169545.json": "Theranos founder Elizabeth Holmes goes on trial next month on charges that she defrauded investors and patients about her blood-testing startup. Here’s everything you need to know about the case. https://t.co/GXhOJg4ANa",
  "data/tweet-wsj/2021/7/1416503034281140231.json": "From @WSJopinion: “I guarantee you every unit in the Navy is up to speed on their diversity training,” said one recently retired senior enlisted leader. “I’m sorry that I can’t say the same of their ship-handling training.” https://t.co/P8LGEtXoPj",
  "data/tweet-wsj/2021/7/1416525668536434688.json": "“It should be required watching.” Why real coaches are taking notes from Ted Lasso. https://t.co/Nt9hAfTgbs",
  "data/tweet-wsj/2021/7/1416555863431651335.json": "The world wants everything from Simone Biles, and she keeps on giving it. The 24-year-old pulls off some of the most difficult skills in gymnastics better than any of her competitors, then adds unimaginable ones. https://t.co/Voagi8U69N",
  "data/tweet-wsj/2021/7/1416548301441208320.json": "From @WSJopinion: Ultimately, Critical Race Theory is about blaming your problems on other peopleーbased on their raceーwhich might be the last thing we should be teaching our children, writes @jasonriley https://t.co/1tMUXBRYnA",
  "data/tweet-wsj/2021/7/1416540744123301890.json": "NASA said its aging Hubble Space Telescope was back in action after fixing a glitch that had sidelined the aging Earth-orbiting observatory for weeks https://t.co/sxpEtEsSs9",
  "data/tweet-wsj/2021/7/1416521871307202561.json": "There’s a new kind of digital nomad emerging since the pandemic began: one who makes longer stays, takes fewer flights and maybe even puts down roots https://t.co/Gq3wy6dyY1",
  "data/tweet-wsj/2021/7/1416495465261064204.json": "As the Taliban appears to be on the cusp of seizing power in Afghanistan, panic is spreading through neighboring Pakistan https://t.co/Hgm6aP4jL2",
  "data/tweet-wsj/2021/7/1416461447320772611.json": "Johnson &amp; Johnson said it was recalling some of its sunscreens from U.S. stores, after detecting benzene, a potentially cancer-causing chemical, in some samples #WSJWhatsNow https://t.co/sy2CI9UQXP",
  "data/tweet-wsj/2021/7/1416614134230159363.json": "Two athletes staying at the Olympic Village in Tokyo have tested positive for Covid-19 and have been moved to quarantine https://t.co/iZ4yrBVPeT",
  "data/tweet-wsj/2021/7/1416669095156649987.json": "Thailand became the latest country to signal waning confidence in a Chinese vaccine against the highly contagious Delta variant, saying it would offer booster shots of Western doses to healthcare workers https://t.co/TkCKN0gyaz",
  "data/tweet-wsj/2021/7/1416691759162265604.json": "The chip world’s most important machines are made near corn fields in the Netherlands. The U.S. is trying to block China from buying them.  https://t.co/88VdT1RUS0",
  "data/tweet-wsj/2021/7/1416721944783867909.json": "From @WSJopinion: A medication doesn’t change its function when the occupant of the White House changes. The case for getting as many people as possible vaccinated shouldn’t be demonized by politics, writes @GerardTBaker. https://t.co/UoY1G2blX9",
  "data/tweet-wsj/2021/7/1416729555562344448.json": "Thousands of university programs across the U.S. are leaving students with big debts and skimpy incomes. Was your degree worth it? Use our tool to search and compare schools, programs and earnings after graduation. https://t.co/V4mLYxTvIQ",
  "data/tweet-wsj/2021/7/1416740804786278409.json": "Contractors and manufacturers are struggling to bid on jobs as prices of materials such as pipes, boards and steel keep rising https://t.co/GvEgSd6TO0",
  "data/tweet-wsj/2021/7/1416759727095173124.json": "The vast majority of patients driving up Covid-19 hospitalizations in parts of the U.S. are unvaccinated, according to hospitals, some of which are reactivating surge plans used in the peak of the pandemic https://t.co/X1LKsppUlq",
  "data/tweet-wsj/2021/7/1416767256122597387.json": "Companies don’t have enough workers. Workers say they can’t find jobs. What’s going on? https://t.co/a2wvROzRoo",
  "data/tweet-wsj/2021/7/1416608705987088390.json": "Venice Beach is the site of one of the nation’s most aggressive efforts to help people out of tent-filled encampments and into housing while making its popular beach area more accessible to tourists and residents https://t.co/MkrkbHu32O",
  "data/tweet-wsj/2021/7/1416789987140509699.json": "The world wants everything from Simone Biles, and she keeps on giving it. The 24-year-old pulls off some of the most difficult skills in gymnastics better than any of her competitors, then adds unimaginable ones. https://t.co/AhTJnBZcAJ",
  "data/tweet-wsj/2021/7/1416782358871748612.json": "From @WSJopinion: The price of Republicans losing the Senate was always going to be steep, and on Tuesday Democrats presented America with the bill: $4.1 trillion https://t.co/H5D9YXG8XC",
  "data/tweet-wsj/2021/7/1416774844822261764.json": "Scientists are searching for the origin of the coronavirus that caused Covid-19. Some worry they may never find it. https://t.co/Joe1gBaEF7",
  "data/tweet-wsj/2021/7/1416797411935129604.json": "Italy suspended the passage of large cruise ships through the center of Venice, amid divisions between residents who want them banned and the tourism industry #WSJWhatsNow https://t.co/7HtGSdHkUl",
  "data/tweet-wsj/2021/7/1416786104196476938.json": "Dozens of school districts and states are spending chunks of their federal stimulus cash on one-time bonuses to teachers and staff, over the objections of some parents and others who claim such payments violate the intent https://t.co/Ioz54CJKUp",
  "data/tweet-wsj/2021/7/1416755898547113987.json": "Grocery brands and restaurants are employing creative strategies to offset the highest cost inflation they’ve faced in over a decade. Here are five ways that they are making up for higher costs. https://t.co/N9enZjl6JO",
  "data/tweet-wsj/2021/7/1416808750015557638.json": "Boris Johnson’s office said the U.K. prime minister will remain in isolation for the next 10 days after his health minister tested positive for the coronavirus, just hours before a plan to drop almost all Covid-19 restrictions in England comes into effect https://t.co/HdTBb2lATs",
  "data/tweet-wsj/2021/7/1416146910956691460.json": "Five senior officers of the country’s National Police have been detained in connection with the assassination last week of President Jovenel Moïse, Haiti’s National Police chief said https://t.co/fE7qVD6rB6",
  "data/tweet-wsj/2021/7/1416816310785298437.json": "Collin Morikawa arrived in Sandwich, England having never played in a British Open. Now, he is the 2021 champion. https://t.co/dGdZKAuIQJ",
  "data/tweet-wsj/2021/7/1416737013873717252.json": "SpaceX has more than 1,000 satellites beaming high-speed internet to Earth, but China promises to offer higher speeds with the launch of what it calls the world’s first 6G satellite #WSJWhatsNow https://t.co/ZGTRGTCBH8 https://t.co/PrZDOOxTsc",
  "data/tweet-wsj/2021/7/1416771004957970434.json": "Highway crews might mow them down all summer, but pop-up native plants—so common in some regions they’re not valued—deserve a spot in your plot. Here, all the tips you need. https://t.co/D67vwGf31o",
  "data/tweet-wsj/2021/7/1416835194808643587.json": "Why are American kids speaking with British accents? Blame pandemic \"Peppa Pig\" marathons. \"Can we turn the telly on?\" https://t.co/Cd4WHvOZtm",
  "data/tweet-wsj/2021/7/1416838968629420041.json": "Covid-19 restrictions on Florida-based cruise ships will remain in place, after a federal appeals court temporarily blocked a lower-court ruling that would have lifted the regulations https://t.co/wSBroRORbB",
  "data/tweet-wsj/2021/7/1416804990438551556.json": "The long-feared possibility that the Covid-19 pandemic could disrupt the Tokyo Olympics is rapidly emerging as a reality, as Games organizers scramble to deal with a rising load of athletes and officials who are testing positive upon arrival in Japan https://t.co/p8Di9hubYW",
  "data/tweet-wsj/2021/7/1416831406781739012.json": "President Biden’s attack on Facebook on Friday followed months of mounting private frustration inside his administration over the social-media giant’s handling of vaccine misinformation, according to U.S. officials https://t.co/aUiYXhDl3w",
  "data/tweet-wsj/2021/7/1416865405914730497.json": "The pandemic pushed many restaurant and bar workers to find new careers. Many say they will never go back.  https://t.co/twknF1nBjk",
  "data/tweet-wsj/2021/7/1416869148567691271.json": "Iceland, with its inexhaustible number of natural wonders, has been welcoming American tourists back for months. For one first-time visitor and his bird-obsessed partner, the trip was well worth the wait. https://t.co/jmHizdToGm",
  "data/tweet-wsj/2021/7/1416854053221453826.json": "Today’s billionaire space race is the latest chapter in a centuries-old competition among the wealthy seeking greater heights, be it Italian noble families erecting ever-taller towers on their palazzos to today’s Billionaires’ Row in Manhattan https://t.co/hQ9suNDVnb",
  "data/tweet-wsj/2021/7/1416876691792842752.json": "From @WSJopinion: You can oppose state coercion and still favor the life-saving benefits of mass Covid vaccination, writes The Editorial Board https://t.co/qQmI2EZptY",
  "data/tweet-wsj/2021/7/1416899348152078336.json": "There’s a reason why American preschoolers are talking about petrol stations and making mince pies: pandemic favorite Peppa Pig https://t.co/FuwfzD3LAG",
  "data/tweet-wsj/2021/7/1416918233697988609.json": "Review: Three years after Anthony Bourdain's death by suicide, a documentary attempts to take the measure of the larger-than-life man. @JoeMorgenstern reviews “Roadrunner: A Film About Anthony Bourdain” https://t.co/8zat0Jj7Xj",
  "data/tweet-wsj/2021/7/1416914451257864192.json": "JPMorgan and Goldman are calling employees back to the office. Rivals like Citigroup are touting their flexibility, hoping it will help them poach top talent. https://t.co/tKR0KqRYqD",
  "data/tweet-wsj/2021/7/1416861609461526537.json": "The $3.5 trillion budget plan from congressional Democrats would finance a transition to cleaner power, but it is expected to face opposition from parts of the energy industry and their industrial customers over provisions likely to raise their costs https://t.co/cxmCnUXFb4",
  "data/tweet-wsj/2021/7/1416940892930314240.json": "\"Shall we leave?'' Afghanistan's most educated and successful men and women are weighing plans to escape before the Taliban upends their country. https://t.co/RognLfgnbc",
  "data/tweet-wsj/2021/7/1416959750194016257.json": "Several high-profile M.B.A. programs have decided not to offer hybrid learning this fall. The hope, deans say, is to restore the traditional experience to its pre-pandemic norms, with in-person networking, socializing and overseas trips. https://t.co/HbUOJGICdT",
  "data/tweet-wsj/2021/7/1416933337852268547.json": "The idea of endowing a machine with the ability to see, hear, touch, taste and smell has long seemed far-fetched. Not anymore. https://t.co/iAdDrLATEF",
  "data/tweet-wsj/2021/7/1416980902677291010.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/Z26Gr2f8tB",
  "data/tweet-wsj/2021/7/1416971092078514176.json": "Normally a depreciating asset, some used cars are worth more now than they were new. “It just seems like we’re in fantasyland,” an auto dealer says. https://t.co/LERlxf44CE",
  "data/tweet-wsj/2021/7/1416703557978427396.json": "Flooding moved to southern and eastern parts of Germany and into neighboring Austria, as heavy rainfall over Alpine regions swelled rivers and overwhelmed several towns in the valleys  https://t.co/MMJGumPFnO",
  "data/tweet-wsj/2021/7/1417008834305007620.json": "The vast majority of patients driving up Covid-19 hospitalizations in parts of the U.S. are unvaccinated, according to hospitals, some of which are reactivating surge plans used in the peak of the pandemic https://t.co/qrZSo3bM26",
  "data/tweet-wsj/2021/7/1416954710158946304.json": "Zoom said it plans to buy cloud software provider Five9 in an all-stock deal valued at about $14.7 billion https://t.co/M3GVahfGRx",
  "data/tweet-wsj/2021/7/1416925820103372808.json": "More long Covid-19 patients are pushing to investigate what they believe is fueling some of their debilitating long-term symptoms: dormant viruses that have been reactivated by Covid-19 https://t.co/XZPKZCMnir",
  "data/tweet-wsj/2021/7/1417050353699282944.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/e0YGLDmLz3",
  "data/tweet-wsj/2021/7/1417096022031994880.json": "The Biden administration publicly blamed hackers affiliated with China’s main intelligence service for a far-reaching cyberattack on Microsoft email software this year, senior administration officials said https://t.co/gmfPogLGHQ",
  "data/tweet-wsj/2021/7/1416891788292411395.json": "At age 36, Joshua Vish is the oldest lifeguard at the Dormont, Pa., pool. The job pays $15 an hour and is a dream come true—maybe even a life-saver. “It feels very much like, ‘Finally!’” https://t.co/nCLpnySbwb",
  "data/tweet-wsj/2021/7/1417115936788733960.json": "The Dow fell nearly 500 points and bond yields slid, as investors worried that the spread of the coronavirus Delta variant could hold back the global economy https://t.co/DON1fBjRxD",
  "data/tweet-wsj/2021/7/1417107115500527618.json": "Meetings are multiplying. There’s the 25-minute client touch-base, the general life catch-up with your manager, the bite-size performance feedback session, the meeting to prep for the meeting. “It just never ends.” https://t.co/8rQdC4e0r4",
  "data/tweet-wsj/2021/7/1417099414745849858.json": "“It was like New Year’s Eve.” As the clock struck midnight Sunday, partygoers in England ditched their face masks and streamed into nightclubs as the country lifted almost all Covid-19 restrictions. https://t.co/hzF07cfXLi",
  "data/tweet-wsj/2021/7/1416993740808413184.json": "A Tokyo court gives prison sentences to two Americans who helped former Nissan chief Carlos Ghosn escape Japan https://t.co/jWAtXCNS67",
  "data/tweet-wsj/2021/7/1417100778305736707.json": "Before-and-after images show the extent of damage in German towns hit by the region’s worst flooding in decades. Image: @Maxar #WSJWhatsNow https://t.co/Mw3vpfkJvf",
  "data/tweet-wsj/2021/7/1417145597623259139.json": "Breaking: The U.S. attorney general is sharply limiting prosecutors’ ability to obtain records of reporters’ contacts when investigating government leaks of sensitive information, curtailing a longstanding practice https://t.co/ZSLyZQGNMj",
  "data/tweet-wsj/2021/7/1417166326230143000.json": "The Dow industrials dropped nearly 900 points, putting the index on track for its worst one-day decline since October https://t.co/witp2gZFXH",
  "data/tweet-wsj/2021/7/1417191728646393856.json": "The Pentagon will house about 2,500 Afghans at a military base in Virginia as the first part of a White House plan to evacuate interpreters and translators who worked with U.S. forces during the war https://t.co/fde1UDpLjo",
  "data/tweet-wsj/2021/7/1417216447575732224.json": "Indiana University can require its students to submit proof of Covid-19 vaccination before returning to campus this fall, a federal judge ruled https://t.co/JcS5U0GaKm",
  "data/tweet-wsj/2021/7/1417186252491743232.json": "From @WSJopinion: If the president thinks pre-pandemic voting laws are racist, why didn’t he object to them before now, asks Barton Swaim https://t.co/bOmyf5gadJ",
  "data/tweet-wsj/2021/7/1417118288988020740.json": "BioNTech, the company behind one of the Covid-19 vaccines, has agreed to acquire a U.S. manufacturing plant from a unit of Gilead Sciences in a deal aimed at strengthening its core business of developing cutting-edge cancer therapies https://t.co/yi9AHRhUUa",
  "data/tweet-wsj/2021/7/1417218746595282947.json": "The U.S. is proposing raising penalties for large hospitals that don’t publish their prices to as much as $2 million a year from $109,500 https://t.co/wb4dbMTeYf",
  "data/tweet-wsj/2021/7/1417261741659107331.json": "Ben &amp; Jerry’s plans to stop selling ice cream in West Bank settlements and East Jerusalem, citing “our values” https://t.co/diwzcOzUJ0",
  "data/tweet-wsj/2021/7/1417125867013160960.json": "Values of U.S. electric-vehicle startups have surged. The biggest winner: the world’s largest exporter of oil. Saudi Arabia has a nearly $20 billion profit on Lucid Motors. https://t.co/3KdelqF5at",
  "data/tweet-wsj/2021/7/1417291949799788546.json": "In 1999, roughly seven million girls in the U.S. were playing soccer. Each had a 0.00031% chance of making the Tokyo Olympics roster. Sam and Kristie Mewis both did it. \n\nHere's how their parents helped get them there. https://t.co/aUykxmR8WE",
  "data/tweet-wsj/2021/7/1417322142203588608.json": "Indiana University can require its students to submit proof of Covid-19 vaccination before returning to campus this fall, a federal judge ruled https://t.co/NTcOXjRrBJ",
  "data/tweet-wsj/2021/7/1417295727148113926.json": "Eric Brodkowitz had two job offers coming out of Yale. One was from Goldman Sachs. The other was from the Israeli national baseball team. He said yes to both—working remotely and helping Israel qualify for the Olympics. https://t.co/j3qg8dsUuW",
  "data/tweet-wsj/2021/7/1417343022921101312.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/B9UsiUJDdl",
  "data/tweet-wsj/2021/7/1417314580364210176.json": "States overpaid billions in unemployment assistance after enhanced and extended benefits were approved last year, according to a U.S. government watchdog https://t.co/aiPxVlezNh",
  "data/tweet-wsj/2021/7/1417371221444997129.json": "The Canadian government said it would allow fully vaccinated Americans to enter the country for recreational or tourist activities beginning Aug. 9 https://t.co/wm1iACsm5K",
  "data/tweet-wsj/2021/7/1417412737785909253.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/UyloAT3UWl",
  "data/tweet-wsj/2021/7/1417378768642060311.json": "Pedro Castillo, a far-left union activist whose rise has jarred Peru’s political establishment, was declared president-elect https://t.co/WISJJ5tiOV",
  "data/tweet-wsj/2021/7/1417318392651034625.json": "From @WSJopinion: The real rate on capital gains, taking inflation into account, would be so high that investors could dramatically change their behavior, badly harming the economy and job market, write Aharon Friedman and Stephen Miran https://t.co/LnwSIfNheU",
  "data/tweet-wsj/2021/7/1417454245826207757.json": "Blue Origin founder Jeff Bezos is preparing to head into space Tuesday on the company’s first crewed flight, with the rocket set to take off at 9 a.m. EDT. Here’s what you need to know. #WSJWhatsNow https://t.co/R1mBdk7tgl",
  "data/tweet-wsj/2021/7/1417473187525373954.json": "Jeff Bezos and three passengers launched for the edge of space, on a flight the Amazon founder hopes will kick-start an expansive new era for human space travel https://t.co/ncJL5CEDR9",
  "data/tweet-wsj/2021/7/1417458810277535751.json": "A rocket will carry Amazon founder Jeff Bezos and three others to the edge of space on Blue Origin’s first crewed flight.  https://t.co/Zd7Zqtkgjg",
  "data/tweet-wsj/2021/7/1417424092668612609.json": "Ben &amp; Jerry’s plans to stop selling ice cream in West Bank settlements and East Jerusalem, citing “our values” https://t.co/wVh69SXlb6",
  "data/tweet-wsj/2021/7/1417488241637445649.json": "Pool owners across the U.S. are cashing in on their underused pool by listing with the company Swimply, which some media reports have dubbed the “Airbnb for backyard pools” https://t.co/MAs2J0nfQU",
  "data/tweet-wsj/2021/7/1417507107507785733.json": "Empty stadiums. A resurgent virus. Angry voters. The Tokyo Olympics are turning into a nightmare for Japan’s leaders. https://t.co/cut0aiWgeR",
  "data/tweet-wsj/2021/7/1417527263323725825.json": "The true tally of Covid-19 deaths in India following a spring surge is likely close to 10 times higher than the country’s official count, marking the pandemic as one of the worst tragedies to ever hit the South Asian nation, according to a new study https://t.co/QBAOK8hnXi",
  "data/tweet-wsj/2021/7/1417533552359510017.json": "From @WSJopinion: If data are incomplete and flawed, so too will be the decisions derived from them. The government shouldn’t try to push vaccines on healthy kids using faulty data, writes Dr. Marty Makary. https://t.co/kaNBpMjlge",
  "data/tweet-wsj/2021/7/1417301492344700930.json": "Major drugmakers and distributors are nearing a $26 billion deal with states to resolve thousands of opioid lawsuits, people familiar with the matter say https://t.co/Ymdj4Brx5d",
  "data/tweet-wsj/2021/7/1417563080381419532.json": "Tom Barrack, an investor and longtime Trump ally, was arrested on charges that he acted as a foreign agent of the U.A.E. and lied to federal investigators https://t.co/ED1thKbv4v",
  "data/tweet-wsj/2021/7/1417562192111706123.json": "Harvey Weinstein was extradited to California on Tuesday to face sex-crimes charges, after more than a year of delays because of the pandemic and his health https://t.co/M4ScvUrWuL",
  "data/tweet-wsj/2021/7/1417553436208476169.json": "Apple is delaying its return to the office by at least a month as the Covid-19 Delta variant has led to a rise in infections and hospitalizations https://t.co/WXJBTyhM5I",
  "data/tweet-wsj/2021/7/1417582609421455382.json": "From @WSJopinion: President Biden ought to be enjoying an economic boom as lockdowns end. Instead his policies have abetted a spike in inflation that is outstripping gains in wages. https://t.co/SXZowhD6e7",
  "data/tweet-wsj/2021/7/1417591410119770113.json": "The U.S. will drop opposition to Russia's controversial Nord Stream 2 gas pipeline in a deal with Germany to allow its completion, officials said https://t.co/LEOC9tLnQT",
  "data/tweet-wsj/2021/7/1417557434453819392.json": "“I was like ohhhhh, thank you, but yeah, I found another job.” Amid a hiring crunch, people are hearing back about positions they applied for years ago. https://t.co/3JHNrFb6y5",
  "data/tweet-wsj/2021/7/1417545353440727048.json": "Hackers working for the Chinese government compromised more than a dozen U.S. pipeline operators nearly a decade ago, the Biden administration revealed Tuesday https://t.co/huTzANG3cZ",
  "data/tweet-wsj/2021/7/1417601494791204864.json": "Pool owners across the U.S. are cashing in on their underused pool by listing with the company Swimply, which some media reports have dubbed the “Airbnb for backyard pools” https://t.co/PdKiZ0sMD1",
  "data/tweet-wsj/2021/7/1417658130578743299.json": "The true tally of Covid-19 deaths in India following a spring surge is likely close to 10 times higher than the country’s official count, marking the pandemic as one of the worst tragedies to ever hit the South Asian nation, according to a new study https://t.co/2jMn0CUCZ2",
  "data/tweet-wsj/2021/7/1417643038969630731.json": "“I guess it took them awhile to get back to me.” In a red-hot labor market, workers are finally hearing back from jobs they applied to years ago, in high school. https://t.co/8Rqsp79g96",
  "data/tweet-wsj/2021/7/1417622866389053446.json": "A 22-year-old California man pleaded guilty Tuesday to murder and other charges in connection with a deadly attack at a synagogue in the San Diego suburb of Poway in 2019 https://t.co/MdUS9UiCxy",
  "data/tweet-wsj/2021/7/1417519781578674176.json": "Prime Minister Yoshihide Suga defended his decision to hold the Tokyo Olympics during a pandemic, saying Japan has a fraction of the Covid-19 cases of Western countries and is more disciplined in preventing infections https://t.co/puVOMEvSWx",
  "data/tweet-wsj/2021/7/1417510912689328136.json": "Hundreds of Cubans who took part in nationwide street demonstrations last week face charges of inciting unrest, authorities say, raising concerns among rights advocates of summary trials without due process https://t.co/4YPNRGc9Wk",
  "data/tweet-wsj/2021/7/1417676972843483138.json": "Pool owners across the U.S. are cashing in on their underused pool by listing with the company Swimply, which some media reports have dubbed the “Airbnb for backyard pools” https://t.co/wf2Ug2sQT8",
  "data/tweet-wsj/2021/7/1417692075575975940.json": "The Milwaukee Bucks are the NBA champions for the first time in 50 years after beating the Phoenix Suns https://t.co/y21nrwF3Ep",
  "data/tweet-wsj/2021/7/1417661877358931968.json": "A new app called Bimble lets locals easily share their favorite spots from coffee shops to tiny hotels—creating and swapping idiosyncratic travel guides with like-minded wanderers https://t.co/Kg8RXrITWH",
  "data/tweet-wsj/2021/7/1417684538571042818.json": "One of America’s biggest landlords is teaming up with an insurance company, a global investment company and a Texas pension fund to buy $5 billion of U.S. houses to turn into rentals https://t.co/hlEHmjqN0u",
  "data/tweet-wsj/2021/7/1417703407742291969.json": "Empty stadiums. A resurgent virus. Angry voters. The Tokyo Olympics are turning into a nightmare for Japan’s leaders. https://t.co/pSzX0ik0yD",
  "data/tweet-wsj/2021/7/1417707200349446147.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/Fbrb4CyND3",
  "data/tweet-wsj/2021/7/1417696345197060100.json": "U.S. life expectancy dropped by 1.5 years in 2020, the biggest decline in generations, as Covid-19, drug overdoses and homicides took more American lives https://t.co/phj764vE6y",
  "data/tweet-wsj/2021/7/1417767577422553089.json": "Empty stadiums. A resurgent virus. Angry voters. The Tokyo Olympics are turning into a nightmare for Japan’s leaders. https://t.co/nehANbbgO1",
  "data/tweet-wsj/2021/7/1417710981736710146.json": "Hackers working for the Chinese government compromised more than a dozen U.S. pipeline operators nearly a decade ago, the Biden administration said https://t.co/FxVWQYBbUY",
  "data/tweet-wsj/2021/7/1417820402030505984.json": "Videos shared online show people trapped in a subway car submerged in chest-high water and cars floating down the street, as parts of central China were hit by heavy flooding #WSJWhatsNow https://t.co/z8eR9muAv3",
  "data/tweet-wsj/2021/7/1417822050165612551.json": "The U.S. Women’s soccer team kicked off the Tokyo Olympics with a stunning 3-0 loss to Sweden—and a dent in their gold-medal hopes. https://t.co/mcR5bxWQId",
  "data/tweet-wsj/2021/7/1417829237856296960.json": "\"Cave syndrome\" is keeping some vaccinated people from resuming their pre-Covid-19 lives. The Delta variant isn't helping. https://t.co/3MP9jszeqh",
  "data/tweet-wsj/2021/7/1417782668847104002.json": "News reports and social-media posts from China’s Henan province show inundated neighborhoods, submerged cars, residents stranded in schools and workplaces, and flooded subways with commuters in water up to chest-deep https://t.co/3oCtIdBJO2",
  "data/tweet-wsj/2021/7/1417809115708071944.json": "U.S. life expectancy dropped by 1.5 years in 2020, the biggest decline in generations, as Covid-19, drug overdoses and homicides took more American lives https://t.co/9XSt7zZReH",
  "data/tweet-wsj/2021/7/1417889337577021442.json": "A veteran of the CIA’s hunt for bin Laden will lead a team investigating the mysterious “Havana syndrome,” people familiar with the matter said https://t.co/1oEpAJjabh",
  "data/tweet-wsj/2021/7/1417904410798264324.json": "Speaker Nancy Pelosi rejected two of five Republicans, Reps. Jim Jordan and Jim Banks, from serving on the panel investigating the Jan. 6 Capitol riot https://t.co/oIVdVdm9Zc",
  "data/tweet-wsj/2021/7/1417775133943533570.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/U0TwF8Kx5H",
  "data/tweet-wsj/2021/7/1417843072419966976.json": "New York Gov. Andrew Cuomo is starting to lose some of his major donors as he fights off a state sexual-harassment probe and a federal investigation into how his administration handled Covid-19 in nursing homes https://t.co/ii109Xpyvd",
  "data/tweet-wsj/2021/7/1417919214908755973.json": "When German politicians flocked to the scenes of last week’s devastating floods that left more than 170 dead, they all agreed on one thing: The record rainfalls and ensuing disaster were the product of climate change. https://t.co/6QBIkJgNvK",
  "data/tweet-wsj/2021/7/1417620337366339587.json": "Amazon founder Jeff Bezos successfully completed the first manned mission of Blue Origin’s New Shepard spacecraft. We look back at the remarkable career of the world’s richest man. https://t.co/40Lg4lv0Y9 #WSJWhatsNow https://t.co/MPgmKnTSEf",
  "data/tweet-wsj/2021/7/1417863019636400131.json": "Apple’s biggest iPhone manufacturing site suffered temporary power outages from the flood hitting central China, but the damage appeared to be limited https://t.co/23Kj2vbA9K",
  "data/tweet-wsj/2021/7/1418010410368786432.json": "Giannis Antetokounmpo delivered a historically legendary performance in Milwaukee’s NBA championship run. The worrisome news for the rest of the league? He’s still getting better, writes @JasonGay https://t.co/DAKwn1hdBM",
  "data/tweet-wsj/2021/7/1417992811702591489.json": "Elon Musk says he wants to ensure bitcoin mining uses more renewable energy before the electric-vehicle maker resumes accepting the cryptocurrency https://t.co/Ml0GoQ2sPk",
  "data/tweet-wsj/2021/7/1417926112395550731.json": "From @WSJopinion: Democrats have provided few details of what they plan to include in Sen. Bernie Sanders’s $3.5 trillion budget proposal, and now we know why. The real cost is $5 trillion or more. https://t.co/Irw1TpWIMD",
  "data/tweet-wsj/2021/7/1418016711580737538.json": "A lot of men grew out their hair, Brad Pitt-style, during lockdown—and many plan to bring their long locks back to the office https://t.co/XJ9N8wagXh",
  "data/tweet-wsj/2021/7/1417985271925194752.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/GnCsRq1n8c",
  "data/tweet-wsj/2021/7/1418054457133314048.json": "From @WSJopinion: For the last 15 months, epidemiologists have said that the new coronavirus was likely to evolve and become endemic. Americans and the media haven’t wanted to understand what this means, writes Holman Jenkins. https://t.co/j24Bc64wpu",
  "data/tweet-wsj/2021/7/1418065819565797377.json": "Take an early look at the front page of The Wall Street Journal https://t.co/6uXvmevlMZ https://t.co/gIjjLl9bA4",
  "data/tweet-wsj/2021/7/1417869494907805699.json": "Kim Jong Un is a millennial himself, but the 37-year-old North Korean dictator is showing little tolerance for the country's youth—warning young people to reject foreign culture, including K-pop and overzealous hugs https://t.co/FIMQljovcB",
  "data/tweet-wsj/2021/7/1417952570849603587.json": "Residents of a Surfside, Fla., waterfront condominium a few blocks from last month’s deadly building collapse have voluntarily evacuated after an engineer identified structural problems https://t.co/AiQ2ygfOjh",
  "data/tweet-wsj/2021/7/1418103540552187909.json": "Elon Musk says he wants to ensure bitcoin mining uses more renewable energy before the electric-vehicle maker resumes accepting the cryptocurrency https://t.co/nBwTBI7jjU",
  "data/tweet-wsj/2021/7/1417995324728152065.json": "Attorney General Merrick Garland issued a memo saying the department wouldn’t advise White House of pending investigations https://t.co/5LuiwixXZh",
  "data/tweet-wsj/2021/7/1418002877755412489.json": "From @WSJopinion: If it seems backwards to you that Biden has tapped the likes of China to lecture America on racial progress, you’re not alone, writes @jasonrileywsj https://t.co/QiN08gN4YX",
  "data/tweet-wsj/2021/7/1418167713302781953.json": "A startup says it has cracked the elusive long-duration battery puzzle  https://t.co/j7tSdzq1Wl",
  "data/tweet-wsj/2021/7/1418182812931403776.json": "A veteran of the CIA’s hunt for bin Laden will lead a team investigating the mysterious “Havana syndrome,” people familiar with the matter said https://t.co/hBZeJnSJLo",
  "data/tweet-wsj/2021/7/1418205463477248010.json": "China rejected the WHO’s proposal for a second phase of investigation into Covid-19’s origins and has put forward its own proposal to seek evidence in other countries  https://t.co/DwMbBbp6su",
  "data/tweet-wsj/2021/7/1418156397007675398.json": "PG&amp;E said that it plans to bury 10,000 miles of power lines to reduce wildfire risk throughout Northern California at an estimated cost of up to $20 billion, reversing its earlier stance that doing so would be prohibitively expensive https://t.co/iJG4BYCWWs",
  "data/tweet-wsj/2021/7/1418046905561632772.json": "Last month, it was widely reported that \"Call Her Daddy\" host Alex Cooper signed a contract with Spotify worth $60 million. She says her understanding of millennials is the key to her success: “In negotiations, I own the audience they all want.” https://t.co/tkfJmXzBNq",
  "data/tweet-wsj/2021/7/1418220554331451399.json": "From @WSJopinion: A troubling pattern is emerging in President Biden’s foreign policy: Officials talk tough—then follow up with diplomacy that amounts to little. https://t.co/F4hbyzI0rk",
  "data/tweet-wsj/2021/7/1417797782543478784.json": "Australia will host the Olympics for a third time with the Summer Games to be held in Brisbane in 2032 https://t.co/mF09iaqvJP",
  "data/tweet-wsj/2021/7/1418243232748785669.json": "Sen. Lindsey Graham is lobbying fellow Republicans to leave Washington and deny Democrats the quorum needed to pass their $3.5 trillion spending bill. Some colleagues don’t like the idea. \"Not a big fan of those kinds of things.\" https://t.co/YdNkcCKLyR",
  "data/tweet-wsj/2021/7/1418262095330746371.json": "Mercedes-Benz said it is gearing up to go all-electric by the end of the decade, announcing that it plans to invest more than $47 billion between 2022 and 2030 into battery electric vehicles https://t.co/NShCUZWUqn",
  "data/tweet-wsj/2021/7/1418213299586408448.json": "The median U.S. home price hit a record $363,300 in June, up 23.4% from a year earlier, as strong demand pushed home sales higher https://t.co/4abFXcye28",
  "data/tweet-wsj/2021/7/1418270376698818564.json": "Twitter, Facebook and other platforms would be stripped of liability protections if they spread public-health misinformation, a Senate bill proposes https://t.co/hB1jC2nWry",
  "data/tweet-wsj/2021/7/1417990315055755265.json": "PG&amp;E said that it plans to bury 10,000 miles of power lines to reduce wildfire risk throughout Northern California at an estimated cost of up to $20 billion, reversing its earlier stance that doing so would be prohibitively expensive https://t.co/F8DpnmiHYv",
  "data/tweet-wsj/2021/7/1418296619695583242.json": "The U.S. military is preparing to house as many as 35,000 Afghan interpreters and family members at two American bases, in Kuwait and in Qatar, U.S. officials said https://t.co/OjvmRlCuuc",
  "data/tweet-wsj/2021/7/1418311278712528900.json": "Mississippi asked the Supreme Court Thursday to abolish federal abortion rights, arguing that the landmark Roe v. Wade decision violates states’ 10th-Amendment powers to decide public policy within their borders https://t.co/mfyqrK6lln",
  "data/tweet-wsj/2021/7/1418335335000403968.json": "Intel's CEO said the global chip-industry shortage could stretch into 2023 https://t.co/Gyu6CzRfXl",
  "data/tweet-wsj/2021/7/1418367799018332161.json": "Covid-19 vaccines are holding up well against the Delta variant because it isn’t so different from the original strain that it can evade the shots https://t.co/FBkFXhB4Ct",
  "data/tweet-wsj/2021/7/1418371548432539650.json": "From @WSJopinion: Speaker Nancy Pelosi views the committee as a hammer to use against Republicans in 2022, and her veto of the two GOP members proves it, writes The Editorial Board https://t.co/23iAqj86u2",
  "data/tweet-wsj/2021/7/1417805328192884737.json": "JPMorgan’s one-time grant of stock options reflects the board’s desire to keep Jamie Dimon at the helm for several more years https://t.co/yqSFRtyq0J",
  "data/tweet-wsj/2021/7/1418386642377838596.json": "Companies are passing along higher costs to consumers—for now. “I don’t think anyone knows what the word transitory is really going to turn out to mean.” https://t.co/kms2ZJ4XnS",
  "data/tweet-wsj/2021/7/1418413087527522304.json": "Review: A new \"American Masters\" documentary on PBS celebrates Buddy Guy, featuring archival footage and original interviews with Chicago’s pioneer blues guitarist https://t.co/OzVRcgChvf",
  "data/tweet-wsj/2021/7/1418397985818435584.json": "Jason Sudeikis, who plays soccer coach \"Ted Lasso\" on the hit Apple TV+ series, talks about playing the video game FIFA to learn the game’s basics, the moment he knew streaming was for real, and buying a car for the first time last year https://t.co/6gO3DQBpcr",
  "data/tweet-wsj/2021/7/1418428198564634627.json": "Hong Kong police arrested five people over a series of picture books that portray sheep being targeted by wolves—an allusion to China’s crackdown on pro-democracy supporters https://t.co/qtZKWmVOl6",
  "data/tweet-wsj/2021/7/1418431966651813888.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/ux55DOg2Cz",
  "data/tweet-wsj/2021/7/1418435724056178689.json": "China rejected the WHO’s proposal for a second phase of investigation into Covid-19’s origins and has put forward its own proposal to seek evidence in other countries  https://t.co/X6xfXeYM3t",
  "data/tweet-wsj/2021/7/1418443290366590979.json": "Twitter, Facebook and other platforms would be stripped of liability protections if they spread public-health misinformation, a Senate bill proposes https://t.co/GPomv0ZXJt",
  "data/tweet-wsj/2021/7/1418488573431582720.json": "Mercedes-Benz said it is gearing up to go all-electric by the end of the decade, announcing that it plans to invest more than $47 billion between 2022 and 2030 into battery electric vehicles https://t.co/sGf2ViV9c7",
  "data/tweet-wsj/2021/7/1418473496930406402.json": "Hong Kong’s national-security police arrested five people for allegedly conspiring to commit sedition through a series of picture books that portray sheep being targeted by wolves—an allusion to China’s crackdown on pro-democracy supporters in the city https://t.co/f6YnhAzv4O",
  "data/tweet-wsj/2021/7/1418499910828281856.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/mMRU57tlC7",
  "data/tweet-wsj/2021/7/1418496148814323713.json": "Covid-19 vaccines are holding up well against the Delta variant because it isn’t so different from the original strain that it can evade the shots https://t.co/g5jtvUn9oY",
  "data/tweet-wsj/2021/7/1418558024713744387.json": "In the race to develop shots against Covid-19, mRNA vaccines beat out many traditional approaches. Now, the technology is squaring up to an old viral nemesis: influenza. https://t.co/NJazP2EM88",
  "data/tweet-wsj/2021/7/1418485039667552259.json": "The stadium-sized listening party previewed Kanye’s 10th solo studio album, which was expected to arrive sometime on Friday  https://t.co/jxVUV4miLo",
  "data/tweet-wsj/2021/7/1418375371788103684.json": "Essay: In cities like Seattle, Louisville and New York, murder rates skyrocketed in 2020. One big reason: police departments pulling back under public pressure, writes John Jay College of Criminal Justice professor Peter Moskos. https://t.co/f7OTuvtGis",
  "data/tweet-wsj/2021/7/1418231980848828423.json": "The U.S.’s emerging China policy borrows from the Trump hard line while adding more allies to increase leverage against Beijing. “What gets Beijing’s attention the most is not just when it’s the United States doing something,” says a U.S. official. https://t.co/CyyZ83myef",
  "data/tweet-wsj/2021/7/1418628248821456898.json": "Data from Israel suggests Pfizer’s vaccine has become less effective in preventing infection of Covid-19 in recent weeks, although it remains a robust bulwark against serious illness as governments scramble to respond to the spread of the Delta variant https://t.co/QrvtJgFJjx",
  "data/tweet-wsj/2021/7/1418688635633872898.json": "Disney wants to move many of its famed Imagineers from Southern California to a new campus in Orlando, where about $570 million in tax incentives await https://t.co/xBM0PLI3Gr",
  "data/tweet-wsj/2021/7/1418669783604776968.json": "The former CEO of student-lending giant Sallie Mae admits he had a hand in the rising expense of higher education. \"There was no question in my mind I knew what was going on.\" https://t.co/AiU1SHwgms",
  "data/tweet-wsj/2021/7/1418715080234094593.json": "The U.S. bought 200 million additional Covid-19 vaccine doses from Pfizer Inc. and partner BioNTech SE at about $24 a shot, above the $19.50 price of previous deals https://t.co/fiMIGY6cHm",
  "data/tweet-wsj/2021/7/1418594290905780234.json": "Disney wants to move many of its famed Imagineers from Southern California to a new campus in Orlando, where about $570 million in tax incentives await https://t.co/eYIgYXF0Bh",
  "data/tweet-wsj/2021/7/1418749046072696833.json": "Sallie Mae’s former CEO is learning firsthand about the rising costs of college—a trend he helped establish—now that he is paying tuition checks for his grandchildren. “It’s criminal,” he said of what schools are charging. https://t.co/8jUqVjeygC",
  "data/tweet-wsj/2021/7/1418741494173818880.json": "Electric-vehicle drivetrains employ fewer than 20 moving parts, compared with hundreds for the gas-powered version. The transition is upending the auto industry. https://t.co/7ebWAJZrLx",
  "data/tweet-wsj/2021/7/1418786782183890949.json": "After more than a year of remote work arrangements, CEOs have a message for their staff: Enough https://t.co/2wIRJmDQE5",
  "data/tweet-wsj/2021/7/1418730193464827910.json": "In the race to develop shots against Covid-19, mRNA vaccines beat out many traditional approaches. Now, the technology is squaring up to an old viral nemesis: influenza. https://t.co/9R26GL6UCy",
  "data/tweet-wsj/2021/7/1418850994033725443.json": "Russia is banned from the Games, but its athletes are competing as ROC—and fighting to maintain their identities. #Tokyo2020 https://t.co/9xwnkHgU9H",
  "data/tweet-wsj/2021/7/1418873938923433990.json": "Barely six days after reaching the Tour de France podium in Paris, Richard Carapaz took the second Olympic gold in Ecuador's history. https://t.co/OKc1clzTEV",
  "data/tweet-wsj/2021/7/1418884924703191048.json": "European countries nudge people to get Covid-19 shots by introducing restrictions on daily life for the unvaccinated  https://t.co/58CAnvX3Ou",
  "data/tweet-wsj/2021/7/1418707501265084427.json": "Covid-19’s Delta variant is proliferating world-wide, threatening unvaccinated populations and economic recovery. Here's a look at how it spread: https://t.co/b06tPlAhrq #WSJWhatsNow https://t.co/qmDPyZgo5O",
  "data/tweet-wsj/2021/7/1418926506437488649.json": "“I was like ohhhhh, thank you, but yeah, I found another job.” Amid a hiring crunch, people are hearing back about positions they applied for years ago. https://t.co/DnP2iA86W4",
  "data/tweet-wsj/2021/7/1418896247340113921.json": "From @WSJopinion: The vaccine’s benefits may outweigh its risks for healthy kids, but the government shouldn’t try to push that conclusion based on faulty data, writes Dr. @MartyMakary https://t.co/9KuwnDnVwb",
  "data/tweet-wsj/2021/7/1418937800066486278.json": "Florida is recording more Covid-19 cases than any other U.S. state, as hospitalizations in some areas increase at the fastest rate since the start of the pandemic https://t.co/eQzGRH7A74",
  "data/tweet-wsj/2021/7/1418941572247429121.json": "The true tally of Covid-19 deaths in India is likely close to 10 times higher than the country’s official count, making the pandemic one of the worst tragedies to ever hit the South Asian nation, according to a new study https://t.co/BVc0LJzKCf",
  "data/tweet-wsj/2021/7/1418956719129088002.json": "\"Cave syndrome\" is keeping some vaccinated people from resuming their pre-Covid-19 lives. The Delta variant isn't helping. https://t.co/Pk2nboIPT4",
  "data/tweet-wsj/2021/7/1418949182761603081.json": "The food industry faces the steepest inflation in a decade. And there's a good chance you're paying more for your meals—whether you notice it or not. https://t.co/FK3jKzfxWb",
  "data/tweet-wsj/2021/7/1418964288883023872.json": "A veteran of the CIA’s hunt for Osama bin Laden will lead a team investigating the mysterious “Havana syndrome,” people familiar with the matter said https://t.co/PucnTo1yhz",
  "data/tweet-wsj/2021/7/1418960433562755072.json": "Sen. Bernie Sanders has morphed this year from antiestablishment outsider to White House deal maker https://t.co/pUprjfFyhJ",
  "data/tweet-wsj/2021/7/1418609377854955523.json": "Police in Canada are investigating more than 15 fires set at churches that politicians and law enforcement officials speculate are being targeted by those angry over the discoveries of unmarked graves at schools for indigenous children https://t.co/8my4elBEqk",
  "data/tweet-wsj/2021/7/1418979409764233228.json": "A man renting out his private pool online expects to have earned $111,000 by the end of the summer—enough to cover what it cost to build it eight years ago https://t.co/LnknTjcZhX",
  "data/tweet-wsj/2021/7/1418952882313908242.json": "After 16 months of enduring remote work as a viable pandemic-era solution, many CEOs have a message for their staff: Enough. https://t.co/Tg7j40s0wY",
  "data/tweet-wsj/2021/7/1418820770608951296.json": "Alabama Gov. Kay Ivey, whose state ranks poorly on Covid-19 vaccination rates, made an urgent plea for residents to get the shot, becoming the latest GOP official to step up calls for inoculation https://t.co/Jr18a8vxux",
  "data/tweet-wsj/2021/7/1418934064971665412.json": "Noncompete clauses, which have proliferated to ensnare janitors, baristas, schoolteachers and entry-level workers, are under new federal scrutiny https://t.co/2xuj7WQzim",
  "data/tweet-wsj/2021/7/1418986884089487368.json": "Eric Brodkowitz had two job offers coming out of Yale. One was from Goldman Sachs. The other was from the Israeli national baseball team. He said yes to both—working remotely and helping Israel qualify for the Olympics. https://t.co/WBPVosV9HQ",
  "data/tweet-wsj/2021/7/1418947102374305795.json": "Alex Morgan and Christen Press scored goals off the bench and the U.S. women's soccer team cruised to a 6-1 victory against New Zealand. https://t.co/gRjIno7VtG",
  "data/tweet-wsj/2021/7/1419009599752056838.json": "Companies don’t have enough workers. Workers say they can’t find jobs. What’s going on? https://t.co/OhaQNylyKj",
  "data/tweet-wsj/2021/7/1419054905654923264.json": "The desert capital's main coronavirus ward has been empty for months. Masks are almost unheard of and many days go by without a single person testing positive for Covid-19. Welcome to Niger, the land that coronavirus somehow forgot. https://t.co/bPT2IveWpt",
  "data/tweet-wsj/2021/7/1419069961478225924.json": "In 1999, roughly seven million girls in the U.S. were playing soccer. Each had a 0.00031% chance of making the Tokyo Olympics roster. Sam and Kristie Mewis both did it. \n\nHere's how their parents helped get them there. https://t.co/B0i9X0bNKd",
  "data/tweet-wsj/2021/7/1419090044288122884.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/799m6J612r",
  "data/tweet-wsj/2021/7/1419086663708553222.json": "Ratings for the Tokyo Olympics opening ceremony declined about 36% compared to the 2016 Games https://t.co/QZ270tcD8E",
  "data/tweet-wsj/2021/7/1419062392210788352.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/N53L9NqzvC",
  "data/tweet-wsj/2021/7/1419013291876261888.json": "“It’s going to be OK. Trust me.” One devoted gear head put two years into making this 1952 pickup truck look like nothing else on the road. https://t.co/1722arjMrA",
  "data/tweet-wsj/2021/7/1419107672520069121.json": "Using data from “marsquakes,” scientists got their first look at the interior of Mars. They found at least one big surprise. https://t.co/rU8lysvExi",
  "data/tweet-wsj/2021/7/1419122768289882113.json": "A lot of men grew out their hair, Brad Pitt-style, during lockdown—and many plan to bring their long locks back to the office https://t.co/J0RInNBqw2",
  "data/tweet-wsj/2021/7/1419140365823709184.json": "Jackie Mason, a rabbi-turned-comedian who was known for his sharp wit and piercing social commentary, has died at 93 https://t.co/tQYL6nAAwA",
  "data/tweet-wsj/2021/7/1419155466236698625.json": "Florida is recording more Covid-19 cases than any other U.S. state, as hospitalizations in some areas increase at the fastest rate since the start of the pandemic https://t.co/zZUrXXidd1",
  "data/tweet-wsj/2021/7/1419130308314767360.json": "Kim Jong Un is a millennial himself, but the 37-year-old North Korean dictator is showing little tolerance for the country's youth—warning young people to reject foreign culture, including K-pop and overzealous hugs https://t.co/zJVrE4EndH",
  "data/tweet-wsj/2021/7/1418971777674399748.json": "Simone Biles is a special gymnast. But in one of the most important changes to her training since 2016, she’s not being coached that way. https://t.co/JVvdOjs9sv",
  "data/tweet-wsj/2021/7/1419213349125074945.json": "Team USA swimmers raced to their best-ever start at an Olympics, winning medals in every event of the first finals session, including the first U.S. gold medal of the games in any sport https://t.co/tmEa2sZOYs",
  "data/tweet-wsj/2021/7/1419247576730243083.json": "Millions of people remain at risk of developing long Covid, with a bewildering array of potentially debilitating symptoms https://t.co/mATyGwyukt",
  "data/tweet-wsj/2021/7/1419205808206848005.json": "European countries nudge people to get Covid-19 shots by introducing restrictions on daily life for the unvaccinated  https://t.co/7MogdqmQIr",
  "data/tweet-wsj/2021/7/1419277534005538819.json": "\"Cave syndrome\" is keeping some vaccinated people from resuming their pre-Covid-19 lives. The Delta variant isn't helping. https://t.co/FGXLdNSAUD",
  "data/tweet-wsj/2021/7/1419269981070635008.json": "Meetings are multiplying. There’s the 25-minute client touch-base, the general life catch-up with your manager, the bite-size performance feedback session, the meeting to prep for the meeting. “It just never ends.” https://t.co/IPnnNJSKr0",
  "data/tweet-wsj/2021/7/1419285212207460357.json": "Star U.S. swimmer Katie Ledecky is slated to race every individual freestyle distance from 200 meters up to 1,500 meters—a total of four individual events—plus the women’s 4×200-meter freestyle relay https://t.co/6ru3EHJE2s",
  "data/tweet-wsj/2021/7/1419145415258222594.json": "From @WSJopinion: Critical race theory rejects the principle of equality of opportunity. Its adherents insist that equality of opportunity is a myth, not a reality, in today’s America, writes @BillGalston https://t.co/u5NJIgYL8X",
  "data/tweet-wsj/2021/7/1419310098674028557.json": "The U.S. men's basketball team suffered a 83-76 defeat to France in their opening game at the Tokyo Olympics https://t.co/GL1ctBadcH",
  "data/tweet-wsj/2021/7/1419307720541417474.json": "Companies don’t have enough workers. Workers say they can’t find jobs. What’s going on? https://t.co/JN2oAh29tp",
  "data/tweet-wsj/2021/7/1419254871296036867.json": "The road to a third-straight Olympic gold medal for the Simone Biles-led U.S. women’s gymnastics team will not be the coronation everyone has been expecting https://t.co/7LOnG7MRGT",
  "data/tweet-wsj/2021/7/1419337913620439047.json": "U.S. swimmer Katie Ledecky is slated to race every individual freestyle distance from 200 meters up to 1,500 meters, plus the women’s 4×200-meter freestyle relay. No other swimmer in the world has ever attempted such an audacious agenda at the Olympics. https://t.co/1whhw2QKb4",
  "data/tweet-wsj/2021/7/1419322828088922114.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/WryW68ox69",
  "data/tweet-wsj/2021/7/1419353037534109702.json": "Russia is banned from the Olympics, but Russian athletes can still compete—just without a bear symbol or the national anthem https://t.co/ct8pBRrK26",
  "data/tweet-wsj/2021/7/1419198266634342402.json": "Social media is an established, mainstream career field, but workers say it’s sometimes still treated as a job for rookies, both through pay grades and interpersonal dynamics https://t.co/TLrSWzAxzJ",
  "data/tweet-wsj/2021/7/1419368424707395586.json": "Florida is recording more Covid-19 cases than any other U.S. state https://t.co/hKt1GQhYQT",
  "data/tweet-wsj/2021/7/1419383238691336194.json": "Lee Kiefer became the first American ever to win the gold medal in women’s foil fencing. She’s also in medical school, so she was waking up at 5 a.m. and going to work during the worst days of the pandemic. https://t.co/4gNL2MaGHJ",
  "data/tweet-wsj/2021/7/1419361461151879169.json": "In 1999, roughly seven million girls in the U.S. were playing soccer. Each had a 0.00031% chance of making the Tokyo Olympics roster. Sam and Kristie Mewis both did it. \n\nHere's how their parents helped get them there. https://t.co/HZadtbg5UN",
  "data/tweet-wsj/2021/7/1419376844944642048.json": "A space company trying to go public didn’t tell potential investors that its satellite-hauling technology failed, that it lost contact with a satellite in space and that its Russian founder had been deemed a national-security risk by the U.S., the SEC said https://t.co/ntZ2u6VO9I",
  "data/tweet-wsj/2021/7/1419420972227207174.json": "A man renting out his private pool online expects to have earned $111,000 by the end of the summer https://t.co/XcNwE3rqs5",
  "data/tweet-wsj/2021/7/1419413408357752834.json": "From @WSJopinion: Biden’s anticapitalist policies will likely hurt low-income folks the most by squishing job creation, squelching opportunity. Those losses cancel out the equity handouts, writes @AndyKessler. https://t.co/hXiWZore1a",
  "data/tweet-wsj/2021/7/1419409658037555202.json": "Kim Jong Un is a millennial himself, but the 37-year-old North Korean dictator is showing little tolerance for the country's youth—warning young people to reject foreign culture, including K-pop and overzealous hugs https://t.co/Ec5pZTDwcf",
  "data/tweet-wsj/2021/7/1419417237463740419.json": "“I was like ohhhhh, thank you, but yeah, I found another job.” Amid a hiring crunch, people are hearing back about positions they applied for years ago. https://t.co/0Ph3Cxo8Tv",
  "data/tweet-wsj/2021/7/1419451161342627846.json": "Lee Kiefer became the first American ever to win the gold medal in women’s foil fencing. She’s also in medical school, so she was waking up at 5 a.m. and going to work during the worst days of the pandemic. https://t.co/uEbHmrXNY9",
  "data/tweet-wsj/2021/7/1419443602346979333.json": "Russia is banned from the Olympics, but Russian athletes can still compete—just without a bear symbol or the national anthem https://t.co/JKgzQSCIx2",
  "data/tweet-wsj/2021/7/1419356839536377857.json": "The food industry faces the steepest inflation in a decade. And there's a good chance you're paying more for your meals—whether you notice it or not. https://t.co/GkmvMpnkpz",
  "data/tweet-wsj/2021/7/1419477627736363011.json": "Eric Brodkowitz had two job offers coming out of Yale. One was from Goldman Sachs. The other was from the Israeli national baseball team. He said yes to both—working remotely and helping Israel qualify for the Olympics. https://t.co/cSbJm3ZZGd",
  "data/tweet-wsj/2021/7/1419466283423346688.json": "A lot of men grew out their hair, Brad Pitt-style, during lockdown—and many plan to bring their long locks back to the office https://t.co/8ZRpcsAQMr",
  "data/tweet-wsj/2021/7/1419458711714684929.json": "More health officials are turning to the sewers to monitor Covid-19 transmission and spot early signs of outbreaks https://t.co/WmMnMw3n3J",
  "data/tweet-wsj/2021/7/1419485170218975235.json": "Rep. Adam Kinzinger, who had voted to impeach then-President Trump on charges of inciting insurrection, joins the Jan. 6 committee after Speaker Nancy Pelosi rejected two Republican selections https://t.co/2BKfj0y3jg",
  "data/tweet-wsj/2021/7/1419470050478772226.json": "Every second you watch or rewatch a video on TikTok, it’s tracking you. Our investigation reveals the one piece of information the app needs to decide what you see. https://t.co/vgWYnKM6Vx",
  "data/tweet-wsj/2021/7/1419504006540496899.json": "Anna Kiesenhofer’s name did not appear on any list of pre-race favorites, writes @jasongay, but the Austrian mathematician managed to outduel a Dutch superteam and win Olympic gold https://t.co/bMfebXxZm7",
  "data/tweet-wsj/2021/7/1419515340053176320.json": "Covid-19 immunity wanes in people fully vaccinated with the Pfizer-BioNTech shot, but most still won’t need a third dose, the CEO of BioNTech said https://t.co/GACwDZ52Jw",
  "data/tweet-wsj/2021/7/1419496455904059394.json": "Overall in the U.S., 86 large fires have burned close to 1.5 million acres in 12 states as of Sunday https://t.co/Iwt3sfCan3",
  "data/tweet-wsj/2021/7/1419462533174464516.json": "After more than a year of sealing themselves off at home, some people are finding social activities difficult. The Delta variant isn't helping. https://t.co/dgZvPnpqrd",
  "data/tweet-wsj/2021/7/1419519117242011655.json": "Take an early look at the front page of The Wall Street Journal https://t.co/9AeTWPQeW1 https://t.co/OlgBzfm4iR",
  "data/tweet-wsj/2021/7/1419587055517061126.json": "The Delta variant is changing calculations of governments around the world, raising doubts about how quickly they can leave the coronavirus pandemic behind https://t.co/gowvJp6B1O",
  "data/tweet-wsj/2021/7/1419631048812548101.json": "Recent flooding in cities around the world has overwhelmed transit systems and highlighted vulnerabilities in metropolitan infrastructure #WSJWhatsNow https://t.co/TKvxxV0vFN",
  "data/tweet-wsj/2021/7/1419439822486179840.json": "Olympic gymnast Simone Biles talks with @wsjmag about what keeps her calm during a competition, the trait that's essential to her success, and the one thing she'd like to be remembered for #WSJWhatsNow https://t.co/BJRiCEDam4",
  "data/tweet-wsj/2021/7/1419662589966102536.json": "From @WSJopinion: Rand Paul is right that Anthony Fauci and other officials haven’t been candid about U.S. funding for gain-of-function research on coronaviruses in China, writes The Editorial Board https://t.co/XL7c45XuMO",
  "data/tweet-wsj/2021/7/1419658795970666497.json": "LeVar Burton is set to host \"Jeopardy!\" as the game show continues its search for a successor to Alex Trebek. The former \"Reading Rainbow\" star is the 12th host to take a turn in the role, following a fan campaign. https://t.co/XezTljkiQv",
  "data/tweet-wsj/2021/7/1419575752396247042.json": "The price of bitcoin jumped to a six-week high, with some investors attributing the rally to short positions being liquidated and speculation that Amazon may be venturing into digital currencies https://t.co/rsMvavEBUU",
  "data/tweet-wsj/2021/7/1419590852700160003.json": "Take an early look at the front page of The Wall Street Journal https://t.co/34cd3eoReU https://t.co/Np7xJPFJ5h",
  "data/tweet-wsj/2021/7/1419697547178807300.json": "New York City will require its entire workforce to either be vaccinated against Covid-19 or be tested weekly for the virus after Labor Day, city officials said Monday https://t.co/8K9siD1U3B",
  "data/tweet-wsj/2021/7/1419730506581790721.json": "The Biden administration released guidance saying long-term Covid could be a disability under the ADA if it limits a major life activity https://t.co/w12pslblrZ",
  "data/tweet-wsj/2021/7/1419743094673707013.json": "About 60 groups, including the American Nurses Association and the American Medical Association, called on their employers to mandate vaccination among workers in healthcare facilities https://t.co/YVDimsJelx",
  "data/tweet-wsj/2021/7/1419748177700347907.json": "California, New York City and the Department of Veterans Affairs issued Covid-19 vaccination mandates for public employees—the first state, major U.S. city and federal agency to do so https://t.co/kI9sdR6VxO",
  "data/tweet-wsj/2021/7/1419753152862113794.json": "The House’s select committee probing the Jan. 6 attack on the Capitol by supporters of former President Donald Trump won’t hesitate to subpoena members of Congress or Trump, said the panel’s chairman https://t.co/Xx76nV5HHM",
  "data/tweet-wsj/2021/7/1419757279579156482.json": "Tesla posted a record quarterly profit of $1.1 billion, as it largely evaded the effects of the chip shortage that has constricted the global auto industry https://t.co/qefQp0hBpR",
  "data/tweet-wsj/2021/7/1419790906627174405.json": "LeVar Burton is set to host \"Jeopardy!\" as the game show continues its search for a successor to Alex Trebek. The former \"Reading Rainbow\" star is the 12th host to take a turn in the role, following a fan campaign. https://t.co/39HA5Yk548",
  "data/tweet-wsj/2021/7/1419809787760480260.json": "Scores of Cubans who participated in recent mass protests have received sentences of up to one year in prison or house arrest in summary trials without due process, civil rights activists and relatives of detainees say https://t.co/kEGGqVbV4K",
  "data/tweet-wsj/2021/7/1419836199116714000.json": "Britney Spears’s new lawyer moved to have her father removed from the helm of her 13-year-old conservatorship, calling the arrangement toxic https://t.co/pzaRyjoskZ",
  "data/tweet-wsj/2021/7/1419794666522914820.json": "While Covid-19 vaccinations are highly effective at preventing hospitalizations or death from the virus, they’re not foolproof in preventing infection. These breakthrough cases are raising broader questions about immunity in the long term. https://t.co/DongAVRgZC #WSJWhatsNow https://t.co/LhgbDfc6if",
  "data/tweet-wsj/2021/7/1419802275657224195.json": "Simone Biles defies gravity and physics to continually push the boundaries of Olympics gymnastics. We break down how she does it. https://t.co/BbVYBGymH1",
  "data/tweet-wsj/2021/7/1419832445701173248.json": "Afghan migrants fleeing the Taliban’s advance are making arduous journeys through Iran to reach Turkey, which already hosts millions of Syrian refugees https://t.co/duR8JJ0krX",
  "data/tweet-wsj/2021/7/1419772727980871682.json": "President Biden named his first set of nominees to lead U.S. attorneys’ offices across the country, including the first Black Americans to lead several offices and at least one nominee known for taking progressive positions https://t.co/vwYp6eDws1",
  "data/tweet-wsj/2021/7/1419726747373875201.json": "She almost makes it look easy. But when Simone Biles executes the wildly difficult skills her competitors won’t even attempt, there are complex physics at work. We show you step-by-step how it’s all possible. https://t.co/vB3irJ6TVl",
  "data/tweet-wsj/2021/7/1419897485900881921.json": "Japanese tennis star Naomi Osaka is out of the Olympics after losing in straight sets, just days after lighting the flame in the opening ceremony https://t.co/5uweqiPEsX",
  "data/tweet-wsj/2021/7/1419892832198971404.json": "British swimmer Tom Dean’s last year was interrupted by not one but two positive Covid-19 tests that sidelined him twice. He still won Olympic gold in Tokyo. https://t.co/UmRGIdKYAK",
  "data/tweet-wsj/2021/7/1419768264469663746.json": "Increasing numbers of Afghans are fleeing their homes, with many headed to Turkey, say migrant aid groups. If the flow continues to escalate, it could echo the wave of Syrian refugees who fled that country’s bloody civil war. https://t.co/sFRJP9FR5S",
  "data/tweet-wsj/2021/7/1419907938773356553.json": "BioNTech said it would invest some of the profits from the Covid-19 vaccine it markets with Pfizer into developing shots for malaria and tuberculosis in Africa, part of the company’s plan to establish a production hub for innovative medicines https://t.co/7UcHMk7Vqc",
  "data/tweet-wsj/2021/7/1419900414581956609.json": "North Korea reopened the cross-border phone line with South Korea, raising the prospect that the Kim Jong Un regime could be ready for engagement again https://t.co/uS9AWiSIBl",
  "data/tweet-wsj/2021/7/1419940646614355969.json": "Tokyo set a new daily record for Covid-19 cases, reporting 2,848 new infections on the fifth day of the Summer Olympics https://t.co/ukEtBr4wr4",
  "data/tweet-wsj/2021/7/1419885304769622093.json": "From @WSJopinion: From climate to Covid, politics and hubris have disconnected scientific institutions from the philosophy and method that ought to guide them https://t.co/qSuMg6HtT3",
  "data/tweet-wsj/2021/7/1419266192997552134.json": "Could a pill treat Covid-19? Three companies are racing to prove they have the right formula https://t.co/ZKoPrOEtkh",
  "data/tweet-wsj/2021/7/1419968314919591965.json": "Simone Biles defies gravity and physics to continually push the boundaries of Olympics gymnastics. We break down how she does it. https://t.co/UzWCE6YUth",
  "data/tweet-wsj/2021/7/1419851301551231004.json": "When he wakes up, Joe Jonas starts his day with meditation and then turns to Duolingo. “I’m learn­ing Ital­ian very slowly,” says the singer-song­writer, 31. “I want to be able to get lost in the coun­try­side; that’s my goal.” https://t.co/rnnMVhQLMp",
  "data/tweet-wsj/2021/7/1420019552201674754.json": "Japan beat the U.S. 2-0 to claim the Olympic gold medal in softball, as the home team held Team USA to just three hits and ground down American pitching https://t.co/187h75BEQv",
  "data/tweet-wsj/2021/7/1420042437800644615.json": "Breaking: The CDC will recommend vaccinated people resume masking indoors in certain places, a person familiar said, changing its guidance as the Delta variant spreads https://t.co/jpUg9HKSDR",
  "data/tweet-wsj/2021/7/1420012629863567362.json": "The U.S. women’s gymnastics team's decade of dominance ended as Russian gymnasts won Olympic gold. Simone Biles withdrew after one event with a medical issue. https://t.co/93Uv1WhrHr",
  "data/tweet-wsj/2021/7/1420048988510769153.json": "Simone Biles said she pulled out of the Olympic team final because she wasn't in the right mental place to continue. Her status for future events is uncertain. https://t.co/IvEMSOKowJ",
  "data/tweet-wsj/2021/7/1420058951199113224.json": "Police officers who defended the Capitol on Jan. 6 described a harrowing confrontation with rioters, in testimony at a House select committee’s first public hearing https://t.co/eFdeJw1Aom",
  "data/tweet-wsj/2021/7/1420096228117913602.json": "The U.S. government found a buyer for the Wu-Tang Clan album owned by Martin Shkreli that had only one physical copy in existence https://t.co/gBSqQxfxUT",
  "data/tweet-wsj/2021/7/1420055156901699585.json": "Satellite imagery appeared to show China building a new network of silos for launching nuclear missiles, a U.S. think tank said, the second such project that American analysts have accused Beijing of advancing in recent weeks https://t.co/8ccGbyJXL7",
  "data/tweet-wsj/2021/7/1419972091710001153.json": "The worst frost to strike Brazil’s coffee-growing region in more than 25 years is set to cut a chunk out of next year’s crop, sending prices of the bean to six-year highs on global markets https://t.co/WRNWOyVwvY",
  "data/tweet-wsj/2021/7/1420138204498472966.json": "Israel authorized Pfizer’s Covid-19 vaccine for vulnerable children 5 to 11 years old, as cases of the highly contagious Delta variant rise sharply https://t.co/sE3B0jf28t",
  "data/tweet-wsj/2021/7/1420128135308357633.json": "Rep. Marjorie Taylor Greene and two other House Republican lawmakers are suing Speaker Nancy Pelosi after being fined $500 for refusing to wear masks on the House floor https://t.co/4XhwEzhGV0",
  "data/tweet-wsj/2021/7/1420168411229954050.json": "Russia isn’t officially competing in Tokyo as a country but rather as ROC, for Russian Olympic Committee. Here’s why Russia’s 2014 doping scandal has continuing consequences at the Tokyo Olympics, and what it means for its athletes. \n https://t.co/FuBXaTTH53",
  "data/tweet-wsj/2021/7/1420210933494951937.json": "GOP state Rep. Jake Ellzey won a special election runoff for a U.S. House seat in Texas, AP projects, upsetting Trump-endorsed Republican Susan Wright https://t.co/TS1ox09CbY",
  "data/tweet-wsj/2021/7/1420217478085582849.json": "The Justice Department says it wouldn’t defend Rep. Mo Brooks against a lawsuit alleging the Republican helped incite the Jan. 6 riot at the Capitol  https://t.co/0kGD0rmcQf",
  "data/tweet-wsj/2021/7/1420228787162259457.json": "Saudi Arabia is set to impose one of the world’s most sweeping vaccine mandates in an attempt to combat hesitancy toward the Covid-19 shots in the kingdom https://t.co/EQAZYpE9rc",
  "data/tweet-wsj/2021/7/1420240118644940801.json": "Police officers who defended the Capitol on Jan. 6 described a harrowing confrontation with rioters, in testimony at a House select committee’s first public hearing. “We fought hand to hand, inch by inch,” officer Aquilino Gonell said. https://t.co/dpLLJ3hmpM",
  "data/tweet-wsj/2021/7/1420238564286140416.json": "Take an early look at the front page of The Wall Street Journal https://t.co/YOKEyHDoRz https://t.co/UylWrslElz",
  "data/tweet-wsj/2021/7/1420255216159625216.json": "Satellite imagery appeared to show China building a new network of silos for launching nuclear missiles, a U.S. think tank said https://t.co/tYLQH4BxcS",
  "data/tweet-wsj/2021/7/1420251454166740993.json": "Katie Ledecky won her first gold medal of the Tokyo Olympics in the 1,500-meter freestyle. In victory, it was also clear how much the rest of the world has caught up to her. https://t.co/pcB7EOTrq9",
  "data/tweet-wsj/2021/7/1420271755336339458.json": "Simone Biles is withdrawing from the individual all-around final at the Tokyo Olympics, a day after pulling out of the team competition https://t.co/RtGySqAkPO",
  "data/tweet-wsj/2021/7/1420311837955010567.json": "Israel authorized Pfizer’s Covid-19 vaccine for vulnerable children 5 to 11 years old, as cases of the highly contagious Delta variant rise sharply https://t.co/5ATbFgObLg",
  "data/tweet-wsj/2021/7/1420319384174743552.json": "North Korea reopened a cross-border phone line with South Korea for the first time since Pyongyang severed all communication with the Seoul government in June 2020 https://t.co/1OBwMJARLH",
  "data/tweet-wsj/2021/7/1420247682367598593.json": "From @WSJopinion: I didn’t run for Congress to sit on Zoom in my district office or to have a colleague cast a vote on my behalf. It’s time for House members to stop using the pandemic as an excuse to not show up to work, writes Rep. @timburchett https://t.co/g4DbyugVnG",
  "data/tweet-wsj/2021/7/1420330734989029393.json": "The Biden administration is proposing a rule that would accelerate federal procurement policy to require a higher level of American-made products https://t.co/N32iePU3Rd",
  "data/tweet-wsj/2021/7/1420351349229752322.json": "Pfizer raised its full-year forecast for sales of its Covid-19 vaccine to about $33.5 billion, a nearly 30% increase https://t.co/GqX0vsDBUX",
  "data/tweet-wsj/2021/7/1420349590524645378.json": "Nearly one-quarter of white evangelicals don’t want the Covid-19 vaccine, according to a new study https://t.co/1aGuLlTyMI",
  "data/tweet-wsj/2021/7/1420360918630912004.json": "The Wharton School of the University of Pennsylvania will mark a milestone this fall: A majority of incoming M.B.A. candidates will be women https://t.co/YbNQj5UB9C",
  "data/tweet-wsj/2021/7/1420353350843854858.json": "U.S. gymnastics star Simone Biles withdrew from Thursday’s Olympic individual all-around final, a day after she pulled out of the team competition citing mental health reasons #WSJWhatsNow https://t.co/oT2FNMm5bX",
  "data/tweet-wsj/2021/7/1420372246045073414.json": "Eight years ago, Simone Biles had to be pulled off the competition floor by her then-coach over her mental state. In 2021, the greatest gymnast of all time insisted to team staff that she was removing herself. https://t.co/OAX8yCqLQL",
  "data/tweet-wsj/2021/7/1420315632680284164.json": "Take an early look at the front page of The Wall Street Journal https://t.co/wnnbhjm0eY https://t.co/iMqJWkfRKj",
  "data/tweet-wsj/2021/7/1420364693265321985.json": "Police in the flood-hit Chinese city of Zhengzhou have been stopping people from taking photos of the most heavily affected areas, telling reporters they can’t cover the flood response without official clearance https://t.co/1QumsEBVse",
  "data/tweet-wsj/2021/7/1420391647398006787.json": "Team USA became the first women's 3x3 basketball Olympic gold medalists by defeating the Russian Olympic Committee 18-15 https://t.co/5sjsUdBG4t",
  "data/tweet-wsj/2021/7/1420429231419428868.json": "Google will require all its on-campus workers to be vaccinated against Covid-19 and is delaying its return to the office until mid-October https://t.co/u0W14hK2nZ",
  "data/tweet-wsj/2021/7/1420427511863943168.json": "President Biden plans to announce that federal workers must be vaccinated or be regularly tested for Covid-19, a person familiar said. The policy is still under review. https://t.co/2Rhctso89m",
  "data/tweet-wsj/2021/7/1420412039609163776.json": "A bipartisan group of negotiators has reached a deal on the \"major issues\" of the roughly $1 trillion infrastructure package, GOP Sen. Rob Portman said https://t.co/uWnI0Epwaq",
  "data/tweet-wsj/2021/7/1420368487432794120.json": "The chip shortage is about to hit the iPhone and other goods as Apple and Tesla feel the impact of a significant disruption to the global supply of microprocessors, a sign that the semiconductor crisis is affecting some of the best-supplied companies https://t.co/mvF5sNdDw1",
  "data/tweet-wsj/2021/7/1420462840578772998.json": "China’s foreign minister met with a top Taliban official on Chinese soil, a sign Beijing is stepping up diplomatically as the U.S. withdraws from the country https://t.co/IVfF5twbvR",
  "data/tweet-wsj/2021/7/1420398667635232775.json": "Simone Biles hit pause at the Olympics, and the widening conversation about mental health in sports has another indelible moment, writes @jasongay https://t.co/U887PHLher",
  "data/tweet-wsj/2021/7/1420496831692386304.json": "From @WSJopinion: Under pressure from the latest surge in Covid-19 cases, the dam is beginning to break. It’s time to start requiring Covid vaccines, writes William Galston https://t.co/iPgSzN7IY9",
  "data/tweet-wsj/2021/7/1420506987268296710.json": "Apple plans to require employees and customers to wear masks in more than half its U.S. retail stores regardless of their vaccination status https://t.co/yP82R8heXc",
  "data/tweet-wsj/2021/7/1420515683071369223.json": "Newly released data show that the efficacy of the Pfizer vaccine protecting against symptomatic Covid-19 dropped every two months, to 84% after six months from a peak of 96% within two months of vaccination https://t.co/4BMQ75EM4L",
  "data/tweet-wsj/2021/7/1420489604931727361.json": "Bankrupt gun maker Remington has offered to pay nearly $33 million to nine families who lost loved ones in the Sandy Hook school massacre to settle claims that its marketing practices were in part responsible for the shooting https://t.co/4clQXqBTxn",
  "data/tweet-wsj/2021/7/1420521963223650306.json": "ZZ Top’s Dusty Hill, the long-bearded bassist for the million-selling Texas blues rock trio known for such hits as “Legs” and “Gimme All Your Lovin’,” has died at age 72 https://t.co/0KxUvG6hnV",
  "data/tweet-wsj/2021/7/1420477952324689920.json": "Delta poses a bigger threat than earlier strains for people spending significant time indoors with other people who are infected, scientists warn. Here's what you need to know. https://t.co/IN4G1t0lh7",
  "data/tweet-wsj/2021/7/1420527008937824260.json": "Google and Facebook will require all employees at their U.S. campuses to be vaccinated, joining a number of public and private enterprises taking new precautions as the highly infectious Delta variant of Covid-19 sweeps across the U.S. https://t.co/jYjnQxSBGE",
  "data/tweet-wsj/2021/7/1420377260050329605.json": "China’s government is planning to introduce new laws in Hong Kong and Macau that could bar foreign entities and individuals in the cities from complying with sanctions against China, according to people familiar with the discussions https://t.co/HruhOux0Uk",
  "data/tweet-wsj/2021/7/1420583644868096003.json": "The Himalayan nation of Bhutan completed a rapid-fire Covid-19 vaccination campaign, fully inoculating 90% of its eligible adult population, a bright spot in the region https://t.co/MDIHhB1peI",
  "data/tweet-wsj/2021/7/1420591190815252481.json": "This summer, men are sporting casual t-shirts—not stiff button-downs—under their suits as a way to comfortably reengage with more pulled-together looks. “The T-shirt under gave that sense of ‘I’m put together, but it’s not overly formal.’” https://t.co/hs1r4lNIZ0",
  "data/tweet-wsj/2021/7/1420549663850221570.json": "The dino nugget craze has spawned new shapes. But first, makers had to perfect Baby Yoda's ears. https://t.co/80ZEOqXOF8",
  "data/tweet-wsj/2021/7/1420409989504585731.json": "A Chinese court sentenced outspoken farming magnate Sun Dawu to 18 years in jail for allegedly causing public disorder, and a multitude of other offenses https://t.co/ufaZjb9eKx",
  "data/tweet-wsj/2021/7/1420613835086512129.json": "Take an early look at the front page of The Wall Street Journal https://t.co/9coGlloieR https://t.co/mVGPM1dlRE",
  "data/tweet-wsj/2021/7/1420669685922680837.json": "An 8.2-magnitude earthquake struck off the coast of Alaska, prompting a tsunami warning for some coastal regions https://t.co/yonFvOGNfh",
  "data/tweet-wsj/2021/7/1420681779183226883.json": "AstraZeneca, which pledged last year to distribute its Covid-19 vaccine at no profit during the pandemic, continued to lose money on the shot https://t.co/r8HWVZZlJs",
  "data/tweet-wsj/2021/7/1420732057756569604.json": "Breaking: Sunisa Lee won the Olympics gymnastics all-around final, securing a fifth-straight gold for the U.S. women in an event that was missing Simone Biles https://t.co/pTt9eZ2VlU",
  "data/tweet-wsj/2021/7/1420724822942834696.json": "U.S. GDP grew at a 6.5% annual rate in the second quarter, up slightly from earlier in the year. The economy’s size now exceeds its pre-pandemic level. https://t.co/hLY6bm6yzz",
  "data/tweet-wsj/2021/7/1420718483025940487.json": "Companies like Apple will require people to mask up indoors regardless of vaccination status, while some states bring back mask mandates to tackle the fast-spreading coronavirus Delta variant #WSJWhatsNow https://t.co/roAlok2Fni",
  "data/tweet-wsj/2021/7/1420640282249400326.json": "The Ever Given made it to port. It took three months and more than a dozen tug boats, but the giant container ship pulled into Rotterdam on Thursday morning. https://t.co/plI94tfSRc",
  "data/tweet-wsj/2021/7/1420734634896277505.json": "Nikola founder Trevor Milton was charged by federal prosecutors with making false statements to the electric-truck startup's investors https://t.co/oIZ3uGpazG",
  "data/tweet-wsj/2021/7/1420798737203572741.json": "Scarlett Johansson is suing Disney over the release of \"“Black Widow,” saying that releasing the film simultaneously in theaters and on its Disney+ streaming service breached her contract https://t.co/0MdErV9dve",
  "data/tweet-wsj/2021/7/1420793010321776645.json": "Disney will begin mandating that guests at Walt Disney World and Disneyland wear masks when indoors, effective Friday. All Disney parks employees will wear face coverings indoors, as well. https://t.co/kucPzy7o1G",
  "data/tweet-wsj/2021/7/1420766282505457665.json": "The Biden administration asked Congress to extend a federal eviction moratorium set to expire Saturday, citing concerns over the Delta variant https://t.co/9yPGezPY7q",
  "data/tweet-wsj/2021/7/1420829539438104576.json": "President Biden is calling for $100 payments to every newly vaccinated American, to be paid by state and local governments with stimulus funds https://t.co/jGMGtUHjrH",
  "data/tweet-wsj/2021/7/1420825223243485189.json": "The Senate voted 98-0 to pass a $2 billion supplemental spending bill to fund Capitol security upgrades and pay for emergency aid to resettle Afghan refugees who worked alongside U.S. troops https://t.co/9ht6pXHzAp",
  "data/tweet-wsj/2021/7/1420814744181788674.json": "Bayer said expenses from lawsuits accusing its Roundup weedkiller of causing cancer could rise to more than $16 billion—significantly more than the company had planned for https://t.co/GhhWcx1p2t",
  "data/tweet-wsj/2021/7/1420849148534870017.json": "The decision to put “Black Widow” on Disney+ is projected to have cost Scarlett Johansson more than $50 million, a person familiar with details of her contract claimed https://t.co/eFpULwFMq0",
  "data/tweet-wsj/2021/7/1420387343673040901.json": "Fencing had a problem. “Literally, guys were not fencing.” This is the new rule on display at the Olympics that has fixed just that. https://t.co/zAfkdwQlyu",
  "data/tweet-wsj/2021/7/1420878079480803329.json": "From @WSJopinion: Ivermectin is a safe and effective antiparasitic. Moreover, the drug can help treat Covid. So why is the FDA attacking a drug it previously approved? ask David R. Henderson and Charles L. Hooper https://t.co/KR2pPEmZ4Z",
  "data/tweet-wsj/2021/7/1420864243755372547.json": "Israel will offer a booster shot to people 60 and over who already received two shots of the Pfizer Covid-19 vaccine https://t.co/dGlxauB2ls",
  "data/tweet-wsj/2021/7/1420907005854818307.json": "The CEO of MyPillow, one of Fox News’s big advertisers, said he is pulling his ads from the network after it refused to run a commercial promoting an event linked to claims of widespread election fraud https://t.co/vxHq6LZ3v3",
  "data/tweet-wsj/2021/7/1420900733885501441.json": "Former Cardinal Theodore McCarrick, once a powerful leader in the U.S. Catholic Church, has been charged with sexually assaulting a 16-year-old boy in Massachusetts in 1974 https://t.co/wv7ydFKZGh",
  "data/tweet-wsj/2021/7/1420915823267434499.json": "From @WSJopinion: Shutting down schools was among the most destructive policies of the pandemic, and a new report by McKinsey &amp; Co. quantifies the harm https://t.co/yl8fdJxk5W",
  "data/tweet-wsj/2021/7/1420919599898451975.json": "Instead of trying to change China, Western governments are now beginning to copy it, starting with an embrace of state-driven investment https://t.co/GjQp3VebmE",
  "data/tweet-wsj/2021/7/1420938464036638721.json": "The Biden administration threatened to sue Texas over an order from its governor banning the transportation of migrants within the state by anyone other than law enforcement https://t.co/iYIZKBZWhB",
  "data/tweet-wsj/2021/7/1420949821423239172.json": "As the highly transmissible Delta variant spreads, more vaccinated Americans are reporting they have tested positive for Covid-19. Here’s what you need to know about these so-called \"breakthrough\" cases. https://t.co/QAHjtRB5SL",
  "data/tweet-wsj/2021/7/1420972469024923652.json": "Scarlett Johansson is suing Disney over the streaming release of “Black Widow,” saying it breached her contract. The decision to release the film on Disney+ is projected to have cost Johansson more than $50 million, a person familiar claimed. https://t.co/Nk63wSahDw",
  "data/tweet-wsj/2021/7/1420995093654278144.json": "Billie Eilish’s new album, “Happier Than Ever,” is here, setting up an important test of the 19-year-old artist’s commercial and critical appeal after her four-times-platinum debut in 2019 https://t.co/ZemudfrVMb",
  "data/tweet-wsj/2021/7/1421010586297569288.json": "A Hong Kong protester who was the first to be charged under a national-security law imposed by Beijing was sentenced to nine years in prison https://t.co/1qB6ZESKVS",
  "data/tweet-wsj/2021/7/1421034101721731073.json": "The first plane carrying more than 200 Afghan interpreters and their families departed for the U.S., beginning a major evacuation effort https://t.co/XGke9eMOyC",
  "data/tweet-wsj/2021/7/1420968663100923906.json": "Take an early look at the front page of The Wall Street Journal https://t.co/5xQPDPcm8q https://t.co/dsSenTw8yq",
  "data/tweet-wsj/2021/7/1421058306429366273.json": "Novak Djokovic lost in the men’s tennis semifinals in Tokyo, ending his bid to win Olympic gold and all four Grand Slam titles in the same year https://t.co/nJdbVUQ8sU",
  "data/tweet-wsj/2021/7/1421066653538869251.json": "Scarlett Johansson’s suit against Disney could be a bellwether for the entertainment industry, as media giants prioritize streaming services in pursuit of growth #WSJWhatsNow https://t.co/EUKs8BlfWZ",
  "data/tweet-wsj/2021/7/1420934717306642435.json": "The dino nugget craze has spawned new shapes. But first, makers had to perfect Baby Yoda's ears. https://t.co/yq1D62nmKh",
  "data/tweet-wsj/2021/7/1421100781235757059.json": "A day after grabbing the most coveted crown in women’s gymnastics, Sunisa Lee is adamant about one thing: she is going to Auburn University in the fall https://t.co/qde5pxcwG4",
  "data/tweet-wsj/2021/7/1421104580121792512.json": "The Delta variant now accounts for the vast majority of Covid-19 cases in the U.S. Here's a look at the unique combination of mutations that has led to this more infectious version of the coronavirus, prompting revised mask guidelines. https://t.co/vd7LjixtsP",
  "data/tweet-wsj/2021/7/1421126179004760068.json": "The head of the players association for the U.S. men’s soccer team said that the U.S. women’s team should be paid the same as or more than the men, according to an amicus brief filed on Friday in support of the women’s equal-pay lawsuit appeal https://t.co/wxcqIPG65l",
  "data/tweet-wsj/2021/7/1420738382540382214.json": "The price of Arabica beans is rising as a cold snap strikes Brazil, the world’s biggest coffee producer, and threatens to drive up costs at cafes and breakfast tables around the world #WSJWhatsNow https://t.co/PGFUL1l2fh",
  "data/tweet-wsj/2021/7/1421111943260221446.json": "After staggering through group-stage play, the U.S. women's soccer team beat the Netherlands in a penalty-kick shootout to advance to the semifinals at the Tokyo Olympics https://t.co/bsib0WFGCq",
  "data/tweet-wsj/2021/7/1420795036338475009.json": "Health experts predict the number of \"breakthrough\" cases of Covid-19 will rise, but they say these cases also illustrate the strength of the vaccines, by protecting most people against grave illness https://t.co/hBagFEmaFf",
  "data/tweet-wsj/2021/7/1421163326638366727.json": "A handwritten note from Trump's call with top DOJ officials: \"Just say that the election was corrupt + leave the rest to me and the R. Congressmen\" https://t.co/vFC1J1VeGg",
  "data/tweet-wsj/2021/7/1421175733083332610.json": "Vaccinated people infected with the Delta variant may spread the virus, the CDC said, citing a recent outbreak that prompted its new guidance on mask wearing https://t.co/pZIOPP1tWV",
  "data/tweet-wsj/2021/7/1421146085180026880.json": "Hong Kong police arrested a 40-year-old man on suspicion of insulting the Chinese national anthem after videos circulated online of people waving a colonial Hong Kong flag and booing when the song played during an Olympics ceremony, police said https://t.co/qbm0uS2fJO",
  "data/tweet-wsj/2021/7/1421202708741111809.json": "From @WSJopinion: I lost my husband to Covid just two weeks before Moderna’s vaccine became available. My prayer is that not one more person dies from this virus. I encourage Americans to get their vaccine before it’s too late, writes Rep. @jbletlow. https://t.co/x4DkYYfXmx",
  "data/tweet-wsj/2021/7/1421195160155721729.json": "Loch Ness braces for the death of its most famous tourist attraction: What if Nessie isn’t real? https://t.co/tsgyaF5V7z",
  "data/tweet-wsj/2021/7/1421232908468170754.json": "The Biden administration sued Texas on Friday, saying an order from its governor banning the transportation of migrants within the state by anyone other than law enforcement impinges on the federal government’s exclusive control over immigration matters https://t.co/sF9vyGM3x0",
  "data/tweet-wsj/2021/7/1421241728556802053.json": "A former Obama administration official who criticized Trump-era immigration policies was confirmed by the Senate on Friday as the director of the nation’s legal-immigration agency https://t.co/gtIAAenBBo",
  "data/tweet-wsj/2021/7/1421270659410300929.json": "Refusing a Covid-19 vaccine in South Africa could now drive up your life-insurance premium similar to other risk factors such as smoking, a South African insurer said this week, in a move that is likely to be watched closely by other industry players https://t.co/HfBv85JDE4",
  "data/tweet-wsj/2021/7/1421187609615798280.json": "The Ever Given, stuck for days in Suez and now in Rotterdam, is drawing tourists. $13 tickets to ride a ferry boat past the 1,300-foot vessel are sold out through Sunday. https://t.co/Tl0FxHHu25",
  "data/tweet-wsj/2021/7/1421300843140288515.json": "Loch Ness braces for the death of its most famous tourist attraction: What if Nessie isn’t real? https://t.co/4ob0sKr6GI",
  "data/tweet-wsj/2021/7/1421315950515736576.json": "The former Colombian soldiers jailed in Haiti in the assassination of President Jovenel Moïse said they didn’t kill him and thought they were on a DEA mission to arrest the leader https://t.co/4SOuCuD4KZ",
  "data/tweet-wsj/2021/7/1421331051767554054.json": "Workers are burned out. Is a four-day week the cure? https://t.co/VUzHInmiRM",
  "data/tweet-wsj/2021/7/1421346155586334722.json": "A regulatory crackdown by Beijing wiped some $400 billion off the value of U.S.-listed Chinese companies this month. Now, some investors are asking whether China Inc. is worth the risk. https://t.co/DLoRds1Zs1",
  "data/tweet-wsj/2021/7/1421365055120158724.json": "A handwritten note from Trump's call with top DOJ officials: \"Just say that the election was corrupt + leave the rest to me and the R. Congressmen\" https://t.co/swRxuIawjW",
  "data/tweet-wsj/2021/7/1421323517505810432.json": "The real problem with artificial intelligence, writes tech columnist @mims: It’s not actually intelligent. https://t.co/s45JxftzhV",
  "data/tweet-wsj/2021/7/1421357484544040962.json": "A regulatory crackdown by Beijing wiped some $400 billion off the value of U.S.-listed Chinese companies this month. Now, some investors are asking whether China Inc. is worth the risk. https://t.co/vHWU0SmTaR",
  "data/tweet-wsj/2021/7/1421372578397044737.json": "Amazon was fined about $887 million by an EU privacy regulator for violations related to its advertising https://t.co/Yao8PNtaHQ",
  "data/tweet-wsj/2021/7/1421415589315231746.json": "The unlikely baseball star of the Tokyo Games is a slow-moving vehicle that ferries pitchers to the mound in a giant baseball mitt. https://t.co/EWDZ7oIlPB",
  "data/tweet-wsj/2021/7/1421433006854651904.json": "From @WSJopinion: No one should expect the CCP to cooperate with a real inquiry into the origins of Covid-19. More disappointing is the lack of candor from American scientists and officials whose conflicts of interest deserve more scrutiny. https://t.co/PIwKWIIZHa",
  "data/tweet-wsj/2021/7/1421459390318661640.json": "What makes the Delta variant so dangerous for unvaccinated people https://t.co/jKVDtRXmlT",
  "data/tweet-wsj/2021/7/1421255553939087367.json": "Why is Scarlett Johansson suing Disney? Her lawsuit over the streaming release of \"Black Widow\" doesn't specify the amount she is seeking, but Disney's move is projected to have cost the actress over $50 million, a person familiar with her contract claimed https://t.co/21iUtWP0Hq",
  "data/tweet-wsj/2021/7/1421500927031320583.json": "For the Tokyo Olympics, the German gymnastics team chose unitards over leotards, while Norwegian beach handball players recently rejected bikini bottoms in favor of shorts. Will female athletes change the status quo? https://t.co/GiHWSF1A9g",
  "data/tweet-wsj/2021/7/1421436502152781828.json": "The real problem with artificial intelligence, writes tech columnist @mims: It’s not actually intelligent. https://t.co/jGbyHJnUDW",
  "data/tweet-wsj/2021/7/1421516041809694730.json": "French protesters took to the streets for the third consecutive Saturday to protest new restrictions on people unvaccinated against Covid-19 https://t.co/tJLKL4JGpz",
  "data/tweet-wsj/2021/7/1421504719105794058.json": "A recent analysis found that one in four hospital workers with direct contact with patients was not vaccinated against Covid-19 https://t.co/2dYn1W4SB6",
  "data/tweet-wsj/2021/7/1421527338169286659.json": "The U.S. loves solar power, but the panels are made using Chinese coal. Governments and companies are looking for emissions cuts at the source. https://t.co/3aYz8hUzdJ",
  "data/tweet-wsj/2021/7/1421538704913543173.json": "Anna Kiesenhofer’s name did not appear on any list of pre-race favorites, writes @jasongay, but the Austrian mathematician managed to outduel a Dutch superteam and win Olympic gold https://t.co/X0PvyGjrDN",
  "data/tweet-wsj/2021/7/1421542447079989254.json": "Workers are burned out. Is a four-day week the cure? https://t.co/o8xQ7lDBvG",
  "data/tweet-wsj/2021/7/1421561369258774528.json": "When the pandemic closed pools in March 2020, one man opened his backyard pool to Katie Ledecky to let her keep chasing her Olympic dream https://t.co/wnweuhcv0J",
  "data/tweet-wsj/2021/7/1421599101515452416.json": "Satellite imagery appeared to show China building a new network of silos for launching nuclear missiles, a U.S. think tank said https://t.co/o51O4To8GY",
  "data/tweet-wsj/2021/7/1421610138306293761.json": "For the Tokyo Olympics, the German gymnastics team chose unitards over leotards, while Norwegian beach handball players recently rejected bikini bottoms in favor of shorts. Will female athletes change the status quo? https://t.co/nRNY1gYfAe",
  "data/tweet-wsj/2021/7/1421587725518581761.json": "Recent flooding in cities around the world has overwhelmed transit systems and highlighted vulnerabilities in metropolitan infrastructure #WSJWhatsNow https://t.co/WmKh6eOS5a",
  "data/tweet-wsj/2021/7/1421576458481422340.json": "From @WSJopinion: Biden has fallen fast to 50% approval. How long will his old pals, the moderate Democrats, hang on for the descent? asks @DanHenninger https://t.co/3JFGhVepbW",
  "data/tweet-wsj/2021/7/1421455608566386693.json": "Novak Djokovic didn’t just miss out on the Golden Slam. He missed out on any medal at all at these Olympics after he lost in the singles and withdrew from mixed doubles. https://t.co/8qHFStJZBh",
  "data/tweet-wsj/2021/7/1421493388289904643.json": "Sunisa Lee’s nails are as much a winning fashion statement and testament to her exquisite maneuvering as they are a subtle extension of her Hmong roots in Minnesota https://t.co/dSKHrbtPCs",
  "data/tweet-wsj/2021/7/1421602838879289344.json": "A rowing instructor shares six exercises to build strong and ache-free knees, with no boat required https://t.co/H6bL3eJzB2",
  "data/tweet-wsj/2021/7/1421327303901069312.json": "Here's an early look at the front page of The Wall Street Journal's weekend edition https://t.co/SFNi4CbF4e https://t.co/wO7RBvXy92"
}