{
  "author": "Fivebag",
  "original_created_utc": 1628780964,
  "title": "I just called my bank to ask why they’ve declined a transaction to binance.",
  "created_utc": 1628818268,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apparently I have exceeded my limit which is in place to protect customers. I queried to what the timeframe and amount of this limit is. They replied “We do not discuss limits to the general public.” I asked if there were any limits in place to protect customers from gambling addictions to which she replied I’m unaware. Given that she was quite clued up on the rules around crypto but not around gambling says a whole lot. I made a complaint and left it at that. My conclusion, the banks are scared.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/p31rz3/i_just_called_my_bank_to_ask_why_theyve_declined/",
  "subreddit": "CryptoCurrency",
  "id": "p31rz3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Apparently I have exceeded my limit which is in place to protect customers. I\nqueried to what the timeframe and amount of this limit is. They replied “We do\nnot discuss limits to the general public.” I asked if there were any limits in\nplace to protect customers from gambling addictions to which she…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "顧客保護のために設けられている限度額を超えてしまったようです。I\n限度額の期間と金額はどうなっているのかと質問しました。彼らは、「私たちは\n限度額については一般の方にはお話しできません」とのことでした。私は、お客様をゲームから守るための制限があるかどうかを尋ねました。\nギャンブル依存症からお客様を守るための限度額はあるのかと尋ねると、彼女は...",
      "title": "銀行に電話して、なぜバイナンスへの取引を拒否したのかを尋ねたところです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，我已经超过了我的限额，这是为了保护客户而设置的。I\n我询问了这个限额的时间框架和金额。他们回答说：\"我们\n不向公众讨论限额\"。我问是否有任何限制\n我问是否有任何限制，以保护客户免受赌博成瘾的影响，她...",
      "title": "我刚刚打电话给我的银行，问他们为什么拒绝向binance进行交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，我已經超過了我的限額，這是爲了保護客戶而設置的。I\n我詢問了這個限額的時間框架和金額。他們回答說：\"我們\n不向公衆討論限額\"。我問是否有任何限制\n我問是否有任何限制，以保護客戶免受賭博成癮的影響，她...",
      "title": "我剛剛打電話給我的銀行，問他們爲什麼拒絕向binance進行交易。"
    }
  ]
}