{
  "author": "scratch82",
  "original_created_utc": 1636326637,
  "title": "I miss the old r/cc",
  "created_utc": 1636333948,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not OG by any means, I&#39;ve been here only from 2017. But I remember learning from here a lot. Bunch of techical posts and comments I didn&#39;t understand, that pushed me to learn more. \nThe narrative was different. It was why the blockchain is needed, and of course about the decentralization. \nMoons degraded this sub. Everybody is posting the same things all the time that majority wants to hear. Techical analasis are so rare. I cannot remember when I found the new and interesting project here.\nAnd now LRC. It is everywhere, in every comment. Vitalik was speaking about it year ago that it was his favourite L2 solution (because of the decentralization). This GME thing is just riding the wave. There are numerous nft projects, but this is GME and the pump and shilling follows. How much is this really different from doge and shiba shills?</p>\n\n<p>Edit: for people asking why it has a comedy flair. I didn&#39;t want to be a hypocrite and farm moons while criticizing moons.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qp0d39/i_miss_the_old_rcc/",
  "subreddit": "CryptoCurrency",
  "id": "qp0d39",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not OG by any means, I've been here only from 2017. But I remember learning\nfrom here a lot. Bunch of techical posts and comments I didn't understand, that\npushed me to learn more. The narrative was different. It was why the blockchain\nis needed, and of course about the decentralization. Moons…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は決してOGではなく、2017年からここに来ただけです。でも、ここで学んだことは\nここから多くのことを学んだことを覚えています。私が理解できなかった技術的な投稿やコメントの数々が、私の背中を押してくれました。\nもっと学びたいと思わせてくれました。語り口も違っていました。それは、なぜブロックチェーンが必要なのか\n必要なのか、そしてもちろん非中央集権についてでした。ムーン...",
      "title": "昔のr/ccが懐かしいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我绝不是OG，我从2017年才来到这里。但我记得我从这里学到了\n从这里学到了很多。一堆我不理解的技术性帖子和评论，促使我学习更多。\n促使我学习更多。叙述是不同的。这就是为什么区块链\n是需要的，当然还有关于去中心化的。月亮...",
      "title": "我怀念以前的r/cc"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我絕不是OG，我從2017年纔來到這裏。但我記得我從這裏學到了\n從這裏學到了很多。一堆我不理解的技術性帖子和評論，促使我學習更多。\n促使我學習更多。敘述是不同的。這就是爲什麼區塊鏈\n是需要的，當然還有關於去中心化的。月亮...",
      "title": "我懷念以前的r/cc"
    }
  ]
}