{
  "author": "CountOfMonkeyCrisco",
  "the_new_excerpt": "Many exchanges offer interest rates on your bitcoin and other cryptocurrencies\nwhen you deposit with them. When shopping for the best interest rates, pay\nattention to whether the rate is APR or APY. The difference is subtle, but\nimportant, especially for large amounts.\n\nAPR, or Annual Percentage…",
  "original_created_utc": 1622859318,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "多くの取引所では、お客様のビットコインやその他の暗号通貨を金利で\nを預けることができます。最適な金利を探す際には\nレートがAPRかAPYかに注意してください。この違いは微妙ですが、特に多額の\n特に大きな金額の場合は重要です。\n\nAPR（Annual Percentage）とは...",
      "title": "APRとAPYの違いに注意"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "许多交易所为您的比特币和其他加密货币提供利率。\n当你在他们那里存款时。在购买最佳利率时，请注意\n注意该利率是APR还是APY。区别很细微，但\n很重要，特别是对于大额资金。\n\nAPR，或称年度百分比...",
      "title": "注意APR与APY"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "許多交易所爲您的比特幣和其他加密貨幣提供利率。\n當你在他們那裏存款時。在購買最佳利率時，請注意\n注意該利率是APR還是APY。區別很細微，但\n很重要，特別是對於大額資金。\n\nAPR，或稱年度百分比...",
      "title": "注意APR與APY"
    }
  ],
  "title": "Pay attention to APR vs APY",
  "created_utc": 1622878404,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Many exchanges offer interest rates on your bitcoin and other cryptocurrencies when you deposit with them.  When shopping for the best interest rates, pay attention to whether the rate is APR or APY.  The difference is subtle, but important, especially for large amounts.</p>\n\n<p>APR, or Annual Percentage RATE, gives you the rate at which your original deposit accrues interest.  If you allow it to compound, rolling the interest into the original amount, the APR number does not take that interest into account - so you&#39;re also earning interest on your interest.</p>\n\n<p>APY, or Annual Percentage YIELD, gives you the amount at which your deposit will pay out after one year.  It takes the interest that you&#39;re earning into account on that payout.  You&#39;re not earning any additional interest on the interest, because it&#39;s already been factored into the APY number.</p>\n\n<p>This site has a handy calculator to help you see the difference: <a href=\"https://www.aprtoapy.com/\">https://www.aprtoapy.com/</a></p>\n</div><!-- SC_ON -->",
  "score": 496,
  "permalink": "/r/CryptoCurrency/comments/nsldgq/pay_attention_to_apr_vs_apy/",
  "subreddit": "CryptoCurrency",
  "id": "nsldgq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881320
}