{
  "author": "nickeljorn",
  "original_created_utc": 1654599352,
  "title": "Bill Clinton has been described as having an indescribable pull by people on Reddit/social media who have seen him in person. Have people who saw deceased charismatic presidents (Such as Reagan, FDR, and JFK) in person said similar things?",
  "created_utc": 1654613384,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I saw a Reddit comment last night that was a reply to someone saying their wife saw Bill Clinton on a commercial flight and the comment was joking &amp;quot;Be glad she didn&amp;#39;t leave you. I&amp;#39;ve been in his presence once, and I don&amp;#39;t have the words to describe it.&amp;quot; and it got me thinking: Clinton, Kennedy, and Reagan are seen as the big three charismatic presidents such as in &lt;a href=\"https://deadpresidents.tumblr.com/post/9338919263/other-than-lbj-and-nixon-are-there-any-other\"&gt;this blog post&lt;/a&gt; comparing their ability to communicate (the same blogger explains &lt;a href=\"https://deadpresidents.tumblr.com/post/25036568044/rebloggable-by-request-presidential-charisma-and\"&gt;here&lt;/a&gt; why he doesn&amp;#39;t include Obama) but unlike Clinton, Kennedy and Reagan died before Reddit/social media as we know it today existed. Did people say they had an indescribable pull, such as in letters or articles? What about even older charismatic presidents such as FDR?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 292,
  "permalink": "/r/AskHistorians/comments/v6sdj6/bill_clinton_has_been_described_as_having_an/",
  "subreddit": "AskHistorians",
  "id": "v6sdj6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I saw a Reddit comment last night that was a reply to someone saying their wife\nsaw Bill Clinton on a commercial flight and the comment was joking \"Be glad she\ndidn't leave you. I've been in his presence once, and I don't have the words to\ndescribe it.\" and it got me thinking: Clinton, Kennedy, and…"
}