{
  "author": "NebulaRat",
  "original_created_utc": 1654026849,
  "title": "Does anyone else NOT get a \"workout high\" after physical activity?",
  "created_utc": 1654043854,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Anyone else have this issue? | Do you have a work around? \nI&amp;#39;m not physically fit, slightly overweight, and getting into my late 30&amp;#39;s - just dieting doesn&amp;#39;t work anymore so I actually have to MOVE now to maintain my current weight \nThoughts? Tips? \nI don&amp;#39;t get an endorphin rush, if anything no matter what kind of exercise I do ( or what type - strength training, cardio, sports -- you name it ) I always feel sick after, or just plan exhausted, like I want to lie down and take a nap - don&amp;#39;t bother me, don&amp;#39;t talk to me. If I have to exercise at the start of my day -- the rest of my day is f#cked. If anything I get the opposite and instead of endorphins -- I get really pissed off after&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/v1yity/does_anyone_else_not_get_a_workout_high_after/",
  "subreddit": "NoStupidQuestions",
  "id": "v1yity",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Anyone else have this issue? | Do you have a work around? I'm not physically\nfit, slightly overweight, and getting into my late 30's - just dieting doesn't\nwork anymore so I actually have to MOVE now to maintain my current weight\nThoughts? Tips? I don't get an endorphin rush, if anything no matter…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この問題が発生した人はいますか？| 回避策はありますか？私は体力がなく、少し太っています。\n30代後半にさしかかり、少し太り気味です。\n今の体重を維持するためには、実際に動かないといけないんです。\n感想は？コツは？私はエンドルフィンのラッシュを得ることはありません、どちらかといえば問題なし...",
      "title": "運動後に \"ワークアウトハイ \"にならない人はいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还有人有这个问题吗？| 你有解决的办法吗？我的身体状况不好\n我身体不好，略微超重，而且快到30岁了--只靠节食已经不行了，所以我实际上必须\n所以我现在必须要动起来才能保持我现在的体重。\n有什么想法？有何建议？我没有得到内啡肽的刺激，如果有的话，不管...",
      "title": "还有人在体育活动后没有得到 \"锻炼的兴奋 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還有人有這個問題嗎？| 你有解決的辦法嗎？我的身體狀況不好\n我身體不好，略微超重，而且快到30歲了--只靠節食已經不行了，所以我實際上必須\n所以我現在必須要動起來才能保持我現在的體重。\n有什麼想法？有何建議？我沒有得到內啡肽的刺激，如果有的話，不管...",
      "title": "還有人在體育活動後沒有得到 \"鍛鍊的興奮 \"嗎？"
    }
  ]
}