{
  "author": "Set1Less",
  "original_created_utc": 1641566158,
  "title": "Facts: Retail is not interested in BTC. Retail is chasing alt plays, NFTs and other trades where they can make money, and not Bitcoin. Bitcoin's network effect is stagnating massively and growth is falling off a cliff.",
  "created_utc": 1641591441,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, its wrong to say retail is not in crypto anymore - Anecdotal, I was just in an NFT free mint that got sold out in literally 10 mins. Its a little obscure project which might very well go to zero in about 2 weeks, but even this one&amp;#39;s discord server has over 10k users in just about 3 days. &lt;/p&gt;\n\n&lt;p&gt;And there are hundreds if not more such NFTs projects all over cryptoverse. This is all retail for you. &lt;/p&gt;\n\n&lt;p&gt;Now, lets not turn this into NFT hate thread, I like to gamble on NFTs, some gamble on sports, some gamble on coins..so let that be.. its not the main topic of this post. &lt;/p&gt;\n\n&lt;p&gt;My point is that the retail are still in crypto as a whole. Some of them surely left with the crash, but many are around. To mint these NFTs you definitely need some crypto. Activity across many networks are still growing. OpenSea still is guzzling gas and is the top most used dapp. &lt;/p&gt;\n\n&lt;p&gt;The retail are just not interested in BTC at all. Many users are playing play to earn games or gambling NFTs. They are just not interested in buying Bitcoin&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Key stats:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;BTC activity is still at 2018 bear market levels. It hasnt grown at all. &lt;a href=\"https://www.blockchain.com/charts/n-transactions\"&gt;https://www.blockchain.com/charts/n-transactions&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This one is even more worrying for BTC - people have literally stopped using BTC since July: &lt;a href=\"https://jochen-hoenicke.de/queue/#BTC,1y,weight\"&gt;https://jochen-hoenicke.de/queue/#BTC,1y,weight&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;There is no network effect growth whatsoever. Without network effect, the price doesnt grow much. In the absence of clear valuation models like discounted cash flow, network growth and volume transacted has been used to arrive at valuations for networks/blockchains, and here you have BTC&amp;#39;s network growth falling off a cliff. &lt;/p&gt;\n\n&lt;p&gt;With other networks, people are not just investing and forgetting about it, but actively doing things - whether its lending or swapping tokens or minting some dumb jpeg. This brings people to explore the network, as seen by the rise in number of participants in almost every chain that has managed to get limelight. All of these chains have growing txn/day stats. &lt;/p&gt;\n\n&lt;p&gt;With Bitcoin, all one can do is invest and forget. In contrast to the above networks, the txn/day is still at 2018 levels. &lt;/p&gt;\n\n&lt;p&gt;A BTC argument is that LN adoption is increasing, but there is no real evidence for that. You cannot know how many LN transactions happen a day, and just volume increase to a few hundred million cannot substantiate tremendous growth. &lt;/p&gt;\n\n&lt;p&gt;Sound money, censorship resistance etc are all good narratives but if the network usage is stagnating like above, it is really a cause to worry.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?auto=webp&amp;s=336f021827e8ed159ada471d6b22706a12eb85a9",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=c678277ad3f4daf9b6f597e0acc99e9ce95df892",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=1151def96655ea95ca7eb0541432bbc6ea585c9e",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=5d5d39c02f1b7cfa732c8ebe19ff3aa643606d14",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=345e22d983e7cbde0d425a9e1aa32b3310d10c98",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=d130951052967b370dea2bcc48b0595934f03ba4",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/aQy0F5ffyxuVrJric2vC6bEIxXqS6OUsxFeGkXyZaNQ.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=24d1664cbb740f20c8ede84121da3923e1f23fb0",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "HVIl84KweZp5wH4zZZupMNm-2Dgny_F6wf7rS1mBaWE"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ry8rsx/facts_retail_is_not_interested_in_btc_retail_is/",
  "subreddit": "CryptoCurrency",
  "id": "ry8rsx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "First of all, its wrong to say retail is not in crypto anymore - Anecdotal, I\nwas just in an NFT free mint that got sold out in literally 10 mins. Its a\nlittle obscure project which might very well go to zero in about 2 weeks, but\neven this one's discord server has over 10k users in just about 3…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず第一に、リテールがもう暗号に参入していないというのは間違っています。\nNFTのフリーミントに行ったところ、文字通り10分で完売してしまいました。これは\n2週間くらいでゼロになるかもしれない、ちょっと無名なプロジェクトですが\nこのDiscordサーバーでさえ、わずか3時間ほどで1万人以上のユーザーが...",
      "title": "事実 リテールはBTCに興味がない。リテールはアルトプレイ、NFT、その他儲かる取引を追いかけており、ビットコインには興味がない。ビットコインのネットワーク効果は大きく停滞し、成長は崖っぷちに立たされています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，说零售业不再参与加密货币是错误的。\n我刚刚参加了一个NFT免费铸币厂，10分钟内就被卖光了。它是一个\n它是一个不起眼的小项目，很可能在2周内归于零，但\n甚至这个项目的迪斯科服务器在短短3分钟内就有超过1万名用户......",
      "title": "事实。零售商对BTC不感兴趣。零售商正在追逐替代游戏、NFT和其他他们可以赚钱的交易，而不是比特币。比特币的网络效应正在大规模停滞，增长正在从悬崖上跌落。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，說零售業不再參與加密貨幣是錯誤的。\n我剛剛參加了一個NFT免費鑄幣廠，10分鐘內就被賣光了。它是一個\n它是一個不起眼的小項目，很可能在2周內歸於零，但\n甚至這個項目的迪斯科服務器在短短3分鐘內就有超過1萬名用戶......",
      "title": "事實。零售商對BTC不感興趣。零售商正在追逐替代遊戲、NFT和其他他們可以賺錢的交易，而不是比特幣。比特幣的網絡效應正在大規模停滯，增長正在從懸崖上跌落。"
    }
  ]
}