{
  "author": "TaxShield",
  "the_new_excerpt": "GUANGZHOU, China — Alibaba has launched a slew of new cloud computing products\nas the Chinese e-commerce giant looks to expand across Asia.\n\nCloud computing is seen as a key profit driver for Alibaba over the long term\nand in the past few years, it has been boosting its presence aggressively\noutside…",
  "original_created_utc": 1623176082,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中国・広州 - アリババは、中国の電子商取引大手であるアリババが、クラウドコンピューティングの新製品を多数発表しました。\n中国の大手電子商取引企業であるアリババは、アジアでの事業拡大を目指し、クラウドコンピューティングの新製品を多数発表しました。\n\nクラウドコンピューティングは、アリババにとって長期的に重要な収益の柱となると考えられています。\nアリババは、クラウドコンピューティングを長期的な収益の柱と考えており、ここ数年、海外でのプレゼンスを積極的に高めてきました。\n外に...",
      "title": "アリババはクラウド製品を拡大し、ライブストリーミングショッピングでアマゾンに対抗する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "中国广州--阿里巴巴推出了一系列新的云计算产品。\n这家中国电子商务巨头希望在亚洲各地扩张。\n\n从长远来看，云计算被视为阿里巴巴的一个关键利润驱动因素。\n在过去的几年里，它一直在积极地提高其在亚洲以外地区的影响力。\n外界...",
      "title": "阿里巴巴在与亚马逊的斗争中通过直播购物扩大云产品范围"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "中國廣州--阿里巴巴推出了一系列新的雲計算產品。\n這家中國電子商務巨頭希望在亞洲各地擴張。\n\n從長遠來看，雲計算被視爲阿里巴巴的一個關鍵利潤驅動因素。\n在過去的幾年裏，它一直在積極地提高其在亞洲以外地區的影響力。\n外界...",
      "title": "阿里巴巴在與亞馬遜的鬥爭中通過直播購物擴大雲產品範圍"
    }
  ],
  "title": "Alibaba expands cloud products with livestream shopping in its battle against Amazon",
  "created_utc": 1623224036,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>GUANGZHOU, China — Alibaba has launched a slew of new cloud computing products as the Chinese e-commerce giant looks to expand across Asia.</p>\n\n<p>Cloud computing is seen as a key profit driver for Alibaba over the long term and in the past few years, it has been boosting its presence aggressively outside of China.</p>\n\n<p>On Tuesday, Alibaba announced plans to open a new data center in the Philippines by the end of the year and launched a third data center in Indonesia. Expanding data centers allows cloud providers to boost their capacity in certain countries or regions.</p>\n\n<p>Alibaba also launched a cloud-based livestreaming product designed for online shopping. It will allow e-commerce players to launch a live stream shopping feature on their websites or apps that are hosted on Alibaba’s cloud.</p>\n\n<p>Livestream shopping usually involves a host talking about products that customers can buy directly via the live broadcast. It has become very popular in China and is growing in other parts of Asia.</p>\n\n<p>The Chinese e-commerce firm hopes that such a product can help it stand out from U.S. rivals including Microsoft and Amazon in the cloud market.</p>\n\n<p>In the Asia-Pacific region, Alibaba was the biggest public cloud market vendor at the end of 2020 with a 19.2% share, according to IDC, boosted by success in China. Amazon was second with a 10.5% share.</p>\n\n<p>However, in the global market, Alibaba still trails Microsoft, Amazon and Google.</p>\n\n<p>Alibaba’s cloud announcements come after it reported its first net loss as a public company in the January to March quarter. The company was hit with a massive $2.8 billion fine as a result of an anti-monopoly investigation by Chinese authorities.</p>\n\n<p>Maggie Wu, Alibaba’s CFO, said the company would invest “incremental profits and additional capital” in “new businesses and key strategic areas” in its current fiscal year.</p>\n\n<p>In China, Alibaba faces growing competition from other technology giants including Huawei and Tencent which more recently have stepped up their cloud computing investments.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/06/08/alibaba-cloud-expands-products-with-livestream-shopping-data-centers.html\">https://www.cnbc.com/2021/06/08/alibaba-cloud-expands-products-with-livestream-shopping-data-centers.html</a></p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/stocks/comments/nvajui/alibaba_expands_cloud_products_with_livestream/",
  "subreddit": "stocks",
  "id": "nvajui",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404888032
}