{
  "author": "ThrowAwaydntopnddins",
  "original_created_utc": 1654895705,
  "title": "Inflation always reminds me of one of Henry Ford's most famous quotes: \"'It is perhaps well enough that the people of the nation do not know or understand our banking and monetary system, for if they did I believe there would be a revolution before tomorrow morning'\"",
  "created_utc": 1654919896,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Our modern day financial system is essentially a giant ponzi scheme and pyramid scheme with extra steps, it&amp;#39;s the extra steps that make it be too confusing for the laymen to understand what&amp;#39;s happening, allowing the system to continue instead of having it get overturned and reinvented: &lt;a href=\"https://medium.com/coinmonks/the-modern-financial-system-is-a-debt-based-pyramid-scheme-and-an-investment-based-ponzi-scheme-e37c4154b9\"&gt;https://medium.com/coinmonks/the-modern-financial-system-is-a-debt-based-pyramid-scheme-and-an-investment-based-ponzi-scheme-e37c4154b9&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;A more academic version of the article on the Nasdaq with links to sources, instead of like the previous link that more so tries to use imagery to better relay the message: &lt;a href=\"https://www.nasdaq.com/articles/bitcoin-fixes-the-modern-fiat-ponzi-scheme-2021-09-14\"&gt;https://www.nasdaq.com/articles/bitcoin-fixes-the-modern-fiat-ponzi-scheme-2021-09-14&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s sad that people don&amp;#39;t see this yet, but Bitcoin has started a fascinating trend that leads people down a rabbit whole of financial education that allows them to see this fiat Ponzi and Securities Pyramid scheme for the scans they are. &lt;/p&gt;\n\n&lt;p&gt;We only have a few hundred million people today in this space, and I&amp;#39;d say only a few tens of millions have been in it long enough learning about it, to better comprehend the giant scam with extra steps that is the traditional financial system. &lt;/p&gt;\n\n&lt;p&gt;What happens in 4 years when we&amp;#39;re projecting over a billion users, and likely by then a few hundred million users who&amp;#39;ve learned enough about the financial system to understand the scam that it is? Will we get the revolution over night that Henry Ford prophesized?&lt;/p&gt;\n\n&lt;p&gt;If not then, then what happens in 10 years when we project 5+ billion users with a few billions having learned enough to better understand the Fiat Ponzi and Securities Pyramid scams with extra steps?&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;re a long time hodler then you already know what happens. Eventually your banks fails you as they do everyone all the time, and Bitcoin offers you a work around. After that, things become much clearer seeing how Bitcoin can do for you everything your bank does for you without all the inefficiency&amp;#39;s. &lt;/p&gt;\n\n&lt;p&gt;Even getting loans against your Bitcoin is an easier process with better rates than a banking loan, and anyone who&amp;#39;s been in long enough to start doing that has learned enough to only ever do it with the smallest portion of their holdings to not be at risk of not having more Bitcoin in reserves to cover a margin call.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;F.A. Hayek&lt;/strong&gt; once said:  &lt;a href=\"https://www.youtube.com/watch?v=9-uo-KfnkhI\"&gt;&amp;quot;I don&amp;#39;t believe we shall ever have a good money again before we take the thing out of the hands of government, that is, we can&amp;#39;t take them violently out of the hands of government, all we can do is by some sly roundabout way introduce something that they can&amp;#39;t stop.&amp;quot;&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;So tell me, what happens in 20 years when 7+ billions of people are projected to be using Bitcoin like people have grown to use email today, and even more billions having learned enough from their curiosity in it to see the old financial system for the giant convoluted scam that it is? &lt;/p&gt;\n\n&lt;p&gt;Bitcoin&amp;#39;s adoption rate has held strong for 13 years, and for those thirteen years it has grown at twice the speed of the first internet.&lt;/p&gt;\n\n&lt;p&gt;If you study what happens to adoptees after they start studying Bitcoin and the financial system, to better understand why Bitcoin goes up in value over time like it does,  then you know the usual result is we Hodlers start denominating everything in Bitcoin, saving in Bitcoin. And dollars and other fiat currencies? Well we keep as few those as we need. Hell the oldest of us in this space don&amp;#39;t keep any dollars anymore. We have credit and debit cards that we can pay with our Bitcoin so we never have to touch that fiat shit again.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 351,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?auto=webp&amp;s=5ce2da82b3dc45b8f09de47050ef8177d800b484",
          "width": 1200,
          "height": 673
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=954c40c1c3d0cc4833eba1584862de622684d519",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=ac5d1383b90d76b65dd355e84d94e021e75dd888",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=3b168144c0d8f5dc73a74354ef9f71b0c2b50c0a",
            "width": 320,
            "height": 179
          },
          {
            "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=eb93642f98f228401eaf2db22d19adfd6d2b8cf8",
            "width": 640,
            "height": 358
          },
          {
            "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=c6b07380761cacbb9f0fc48a5e5ad0ba9ab5fd24",
            "width": 960,
            "height": 538
          },
          {
            "url": "https://external-preview.redd.it/UXYoYN2ZD0YUEWIcIqPJoBUdQn5QgdfBUmiLcZJyvB4.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=13c70e0c5626928f7d9c25e83a901777b7021b39",
            "width": 1080,
            "height": 605
          }
        ],
        "variants": {},
        "id": "LJlx0bQJkBOoPVeM_WYdyOoXtS3gWhBkDsxtf9I7xXk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/v9hsne/inflation_always_reminds_me_of_one_of_henry_fords/",
  "subreddit": "CryptoCurrency",
  "id": "v9hsne",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Our modern day financial system is essentially a giant ponzi scheme and pyramid\nscheme with extra steps, it's the extra steps that make it be too confusing for\nthe laymen to understand what's happening, allowing the system to continue\ninstead of having it get overturned and…"
}