{
  "author": "MVIVN",
  "original_created_utc": 1641916360,
  "title": "Why do so many women have a Cashapp link in their social media bios even when they don’t appear to be selling anything?",
  "created_utc": 1641932246,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Genuinely curious, are there people just randomly sending money to women online for nothing? I’m not talking about people who have an OnlyFans or something like that, but just regular social media profiles (on Instagram or Twitter or Facebook or whatever) which just have Cashapp in their bio? What’s up with that? Is there a reason? Cashapp doesn’t exist in my country so maybe I’m just misunderstanding its purpose.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/s1g22s/why_do_so_many_women_have_a_cashapp_link_in_their/",
  "subreddit": "TooAfraidToAsk",
  "id": "s1g22s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Genuinely curious, are there people just randomly sending money to women online\nfor nothing? I’m not talking about people who have an OnlyFans or something like\nthat, but just regular social media profiles (on Instagram or Twitter or\nFacebook or whatever) which just have Cashapp in their bio?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純粋に疑問なのですが、ネットで適当に女性にお金を送っている人がいるのでしょうか？\nということでしょうか？OnlyFansとかをやっている人のことではありません。\nしかし、普通のソーシャルメディアのプロフィール（InstagramやTwitterなど）は\nFacebookとかで、bioにキャシャップって書いてあるやつ？",
      "title": "なぜ多くの女性が、何も売っていないように見えても、ソーシャルメディアのバイオグラフィーにCashappのリンクを貼っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的很好奇，有没有人在网上随意给女人送钱的？\n毫无意义的？我说的不是那些有OnlyFans或类似的东西的人。\n但只是普通的社交媒体资料（在Instagram或Twitter或\n脸书或其他什么），只是在他们的简历上有Cashapp？",
      "title": "为什么这么多女性在她们的社交媒体上有一个Cashapp链接，即使她们看起来并没有在销售任何东西？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的很好奇，有沒有人在網上隨意給女人送錢的？\n毫無意義的？我說的不是那些有OnlyFans或類似的東西的人。\n但只是普通的社交媒體資料（在Instagram或Twitter或\n臉書或其他什麼），只是在他們的簡歷上有Cashapp？",
      "title": "爲什麼這麼多女性在她們的社交媒體上有一個Cashapp鏈接，即使她們看起來並沒有在銷售任何東西？"
    }
  ]
}