{
  "author": "Shhhimhiding-0-",
  "original_created_utc": 1650311022,
  "title": "My cousin said a guy was “soft” because he was respectful and a gentleman, am I overthinking that this is a messed up way of judging anyone?",
  "created_utc": 1650322814,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’d like some opinions on this if that’s cool with y’all. So yesterday I went to a family dinner yesterday with some of my extended family for my grandmother’s birthday and I got to see a few of my cousins and while we’re catching up one of my cousins who was now in college says that she stopped talking to a guy even though he was very respectful and a gentleman took her on a date and everything but dropped him because he didn’t have that same “oomph” that NY guys have (we live in NY and we’re from a Caribbean family so the guys around us are known to be very “masculine” AKA aggressive, short tempered and rude) and when she saw me smiling and roll my eyes she asked my other female cousin and one of my male cousins and they both agreed that guys out of NY are “soft” because they’re not like that. Now that kinda got me thinking because I’m the opposite of a lot of guys in NY I’m very calm, soft spoken, polite and easygoing (though for survivability sake I don’t tolerate anyone’s nonsense and my NY/Caribbean side comes out quick if I’m aggravated) and it made me think that it’s kinda bs judging someone for their demeanor like that and saying a person is soft or weak because of it and I won’t lie it did bring back some unpleasant memories both in my love life and life in general that I’ve gotten a lot of crap from others because I had the same demeanor. So I’d like y’all opinions on the whole thing, do y’all think it’s right or fair to judge someone and dismiss them because of a demeanor like that? Btw I’m not saying that anyone is entitled to date anyone else simply because they’re nice, that’s not what I’m saying at all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/NoStupidQuestions/comments/u6lne4/my_cousin_said_a_guy_was_soft_because_he_was/",
  "subreddit": "NoStupidQuestions",
  "id": "u6lne4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’d like some opinions on this if that’s cool with y’all. So yesterday I went to\na family dinner yesterday with some of my extended family for my grandmother’s\nbirthday and I got to see a few of my cousins and while we’re catching up one of\nmy cousins who was now in college says that she stopped…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしよろしければ、ご意見をお聞かせください。で、昨日は\n昨日は祖母の誕生日ということで、親戚一同で食事会をしました。\n誕生日にいとこたちに会って、話を聞いているうちに、そのうちの一人が\n大学生になった従姉妹が、「もうやめた」と言うので...。",
      "title": "従兄弟がある男のことを「尊敬できる、紳士的な人だからソフト」と言ったのですが、これは誰かを判断する上でめちゃくちゃな考え方だと思うのですが、私の考えすぎでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你们不介意的话，我想听听你们的意见。所以昨天我去了\n昨天我和我的一些大家庭一起参加了一个家庭晚宴，为我的祖母过生日。\n我见到了我的几个表兄弟姐妹，当我们叙旧的时候，我的一个表兄弟姐妹现在正和我在一起。\n我的一个表妹现在已经上大学了，她说她不再...",
      "title": "我的表弟说一个人是 \"软 \"的，因为他很尊重人，很有绅士风度，我是不是想多了，这对任何人来说都是一种混乱的判断方式？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你們不介意的話，我想聽聽你們的意見。所以昨天我去了\n昨天我和我的一些大家庭一起參加了一個家庭晚宴，爲我的祖母過生日。\n我見到了我的幾個表兄弟姐妹，當我們敘舊的時候，我的一個表兄弟姐妹現在正和我在一起。\n我的一個表妹現在已經上大學了，她說她不再...",
      "title": "我的表弟說一個人是 \"軟 \"的，因爲他很尊重人，很有紳士風度，我是不是想多了，這對任何人來說都是一種混亂的判斷方式？"
    }
  ]
}