{
  "author": "NandimukhFonesyXv",
  "original_created_utc": 1637705985,
  "title": "Is it normal to feel just fine about never wanting to be around people in large amounts or in crowded spaces again? I’m 30 and perfectly okay with delivery, drive thru, and going into minimally populated places for the rest of my life...",
  "created_utc": 1637718336,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Or is it just the introvert at me. During the height of the pandemic last year I loved using the pandemic as a reason to not attend parties or obligatory family gatherings for not going. Now since things are allegedly better regarding the pandemic people are expecting to see more of me or wanting to have parties again. And I feel 100% fine alone (with my kids) at home. Is this normal for a human to feel this way. Just the thought of going to a party or having a lot of guests over is stressing and overwhelming.</p>\n</div><!-- SC_ON -->",
  "score": 328,
  "permalink": "/r/NoStupidQuestions/comments/r0owdw/is_it_normal_to_feel_just_fine_about_never/",
  "subreddit": "NoStupidQuestions",
  "id": "r0owdw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Or is it just the introvert at me. During the height of the pandemic last year I\nloved using the pandemic as a reason to not attend parties or obligatory family\ngatherings for not going. Now since things are allegedly better regarding the\npandemic people are expecting to see more of me or wanting to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "それとも、私が内向的なだけなのでしょうか。去年のパンデミックの最中、私は\nパンデミックを理由にして、パーティーや義務的な家族の集まりに参加しないのが好きでした。\n行っていませんでした。今、パンデミックに関して状況が良くなっていると言われているので\n今では、パンデミックに関する状況が改善されたと言われているので、人々は私の姿をもっと見ることを期待していたり、私を見たいと思っていたりします。",
      "title": "大量の人や混雑した場所には二度と行きたくないと思うのは普通のことでしょうか？私は30歳ですが、配達やドライブスルー、人通りの少ない場所に行くのは一生平気です...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "还是说这只是我内向的表现。在去年大流行病的高峰期，我\n我喜欢以大流行病为理由，不参加聚会或强制性的家庭聚会。\n不去的理由。现在，由于据称关于大流行病的情况有所好转，人们期待\n人们期待看到更多的我，或者想要......",
      "title": "再也不想大量地与人打交道或在拥挤的空间里，感觉刚刚好，这是否正常？我已经30岁了，在我的余生中，完全可以接受送外卖、开车、进入人少的地方......"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "還是說這只是我內向的表現。在去年大流行病的高峯期，我\n我喜歡以大流行病爲理由，不參加聚會或強制性的家庭聚會。\n不去的理由。現在，由於據稱關於大流行病的情況有所好轉，人們期待\n人們期待看到更多的我，或者想要......",
      "title": "再也不想大量地與人打交道或在擁擠的空間裏，感覺剛剛好，這是否正常？我已經30歲了，在我的餘生中，完全可以接受送外賣、開車、進入人少的地方......"
    }
  ]
}