{
  "author": "roberthonker",
  "original_created_utc": 1640798046,
  "title": "I'm tired of people acting like Centralization is okay. You make money off it in the short term, but centralization will never last. It defeats the entire purpose of crypto.",
  "created_utc": 1640809889,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Over the past few months I&amp;#39;ve noticed a trend on this sub where lots of people seem to think that centralized blockchains are fine. I saw this with SOL quite a bit. The reality is that centralized crypto is horrible and it defeats the entire reason why crypto is so great.&lt;/p&gt;\n\n&lt;p&gt;Centralized crypto is somewhere between decentralized crypto and the traditional system, but it is the worst of both worlds. &lt;strong&gt;Centralized crypto is not immutable (transactions can be reversed, look at ETC), it&amp;#39;s not trustless and it&amp;#39;s not censorship resistant&lt;/strong&gt; which are the most important benefits of a decentralized blockchain.&lt;/p&gt;\n\n&lt;p&gt;A centralized blockchain defeats the entire benefit of blockchain itself, which is decentralization. There is no point in using a centralized blockchain, a SQL server would work a lot better. I fully expect to be downvoted and have people in the comments attacking me for this, but the reality is that centralization is horrible and should never be justified.&lt;/p&gt;\n\n&lt;p&gt;You may make some money on a centralized coin, which is great! All the more power to you. But don&amp;#39;t pretend that it&amp;#39;s okay for the long term. Centralization is antithetical to all the crypto stands for.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 242,
  "permalink": "/r/CryptoCurrency/comments/rrd5m7/im_tired_of_people_acting_like_centralization_is/",
  "subreddit": "CryptoCurrency",
  "id": "rrd5m7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Over the past few months I've noticed a trend on this sub where lots of people\nseem to think that centralized blockchains are fine. I saw this with SOL quite a\nbit. The reality is that centralized crypto is horrible and it defeats the\nentire reason why crypto is so great.\n\nCentralized crypto is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数カ月、このサブタイトルで多くの人が次のような傾向にあることに気づきました。\n中央集権的なブロックチェーンでいいと思っているようです。私はこれをSOLでかなり見ました\nを少し。現実には、中央集権的な暗号は恐ろしいものであり、そのために\n暗号が素晴らしいのは、そのためなのです。\n\n中央集権的な暗号は...",
      "title": "一元化は大丈夫みたいな態度はもう飽きたよ。短期的にはそれで儲けることができますが、中央集権は決して長続きしません。暗号の全目的を打ち破ってしまうのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几个月里，我注意到这个子网站的一个趋势，很多人\n似乎认为中心化的区块链是好的。我在SOL上经常看到这种情况。\n的。现实是，中心化的加密货币是可怕的，它违背了\n它违背了加密货币之所以如此伟大的全部原因。\n\n中心化的加密货币是...",
      "title": "我已经厌倦了人们表现得好像中央集权是可以的。你在短期内靠它赚钱，但集中化永远不会持久。它违背了加密货币的整个目的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾個月裏，我注意到這個子網站的一個趨勢，很多人\n似乎認爲中心化的區塊鏈是好的。我在SOL上經常看到這種情況。\n的。現實是，中心化的加密貨幣是可怕的，它違背了\n它違背了加密貨幣之所以如此偉大的全部原因。\n\n中心化的加密貨幣是...",
      "title": "我已經厭倦了人們表現得好像中央集權是可以的。你在短期內靠它賺錢，但集中化永遠不會持久。它違背了加密貨幣的整個目的。"
    }
  ]
}