{
  "author": "tumoureater",
  "original_created_utc": 1650563991,
  "title": "WHERE THE FUCK DO GUYS GET CONFIDENCE FROM?!",
  "created_utc": 1650571987,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve noticed this so many times that girls just don’t have as much confidence than guys. LIKE WHY. And that includes me. I know girls with so much potential but just don’t have enough confidence. And a guy will literally be saying shit and acting like shit but come off as if he rules the fucking world. I know I’m generalising and not every girl or guy is like that but istg in the institutions where I have studied, it’s always like this. LIKE WHY. AND HOW. \nToday two guys came up to us to tell us a few jokes and then called us “the saddest group of girls” cuz we didn’t laugh at them. LIKE YOU WERE THE ONE PERFORMING. And after they left, we started overthinking on how we’re probably so lame and should’ve fake laughed to look better. Obviously we then just called ourselves out and shut up.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/u8tjb0/where_the_fuck_do_guys_get_confidence_from/",
  "subreddit": "TooAfraidToAsk",
  "id": "u8tjb0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve noticed this so many times that girls just don’t have as much confidence\nthan guys. LIKE WHY. And that includes me. I know girls with so much potential\nbut just don’t have enough confidence. And a guy will literally be saying shit\nand acting like shit but come off as if he rules the fucking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何度も気づいたことだが、女の子は自信がないのだ\n男より少ないんです なぜか？それは私も同じです。多くの可能性を秘めた女の子を知っています\nでも自信がないんだ そして、男は、文字通り、くだらないことを言い\nまるで自分が支配しているかのように...",
      "title": "男はどこで自信をつけるんだ！？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经注意到很多次了，女生就是没有男生那么多的自信\n比男生多。比如说，为什么呢？这也包括我。我知道女孩有这么多的潜力\n但就是没有足够的自信。而一个男人简直就是在说废话\n并表现得像狗屎一样，但却表现得好像他统治了整个他妈的...",
      "title": "男人们的信心是从哪里来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經注意到很多次了，女生就是沒有男生那麼多的自信\n比男生多。比如說，爲什麼呢？這也包括我。我知道女孩有這麼多的潛力\n但就是沒有足夠的自信。而一個男人簡直就是在說廢話\n並表現得像狗屎一樣，但卻表現得好像他統治了整個他媽的...",
      "title": "男人們的信心是從哪裏來的？"
    }
  ]
}