{
  "author": "sgtslaughterTV",
  "the_new_excerpt": "It never ceases to amaze me how many \"moonboys\" we get in this subreddit that\ndon't know how to read a post. I'll just copy and paste all of my original\nthoughts from my comment in the relevant thread here:\n\n>…",
  "original_created_utc": 1618873044,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このサブレディットには、記事の読み方を知らない「ムーンボーイ」がたくさんいることに驚きを隠せません。\n記事の読み方を知らない「ムーンボーイ」が多いことに驚かされます。私のオリジナルの考えをすべてコピー＆ペーストします。\nこのスレッドでの私のコメントから、私のオリジナルの考えをすべてコピー＆ペーストします。\n\n>...",
      "title": "リアリティチェック。中国はビットコインを投資の選択肢とは言っていない - 中国の中央銀行で働くある人物（Li Bo）が言ったのだ。Stay grounded"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "它永远不会停止惊奇我有多少 \"月光族 \"我们得到在这个subreddit，\n不知道怎么看帖子。我就把我的原创全部复制粘贴到这里。\n我在相关帖子中的想法。\n\n>…",
      "title": "现实检查。中国没有称比特币为投资替代品--一个在中国央行工作的人（李波）这么做了。坚守阵地"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "它永遠不會停止驚奇我有多少 \"月光族 \"我們得到在這個subreddit，\n不知道怎麼看帖子。我就把我的原創全部複製粘貼到這裏。\n我在相關帖子中的想法。\n\n>…",
      "title": "現實檢查。中國沒有稱比特幣爲投資替代品--一個在中國央行工作的人（李波）這麼做了。堅守陣地"
    }
  ],
  "title": "Reality Check: China did NOT call Bitcoin an investment alternative - One person working at the central bank of China (Li Bo) did. Stay grounded",
  "created_utc": 1618908280,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It never ceases to amaze me how many &quot;moonboys&quot; we get in this subreddit that don&#39;t know how to read a post. I&#39;ll just copy and paste all of my original thoughts from my comment in the relevant thread here:             </p>\n\n<blockquote>\n<p>李波：我们认为比特币和稳定币是加密资产。加密资产是投资的选项，它本身不是货币。它是另类投资，本身不是货币。所以我们认为加密资产将来应该发挥主要作用（的地方），是作为一种投资工具或者是替代性投资。把它作为一种投资工具的话，很多国家包括中国也正在研究，也就是对于这样一种投资方式应该有怎样的一种监管环境。虽然这个监管规则是最低的监管规则，但是仍然要有监管规则。以及也要确保对于这类资产的投机不会造成严重的金融风险，这是必须要做到的。也就是说，我们想出来需要怎样的监管规则之前，会继续保持现在的举措和做法。              </p>\n</blockquote>\n\n<p>Translation: <em>We believe that Bitcoin and stablecoins are crypto assets. Crypto assets are an investment item, they themselves are not currencies. So we believe that (the main place) crypto assets will develop is to become a substitute investment or investment tool. If we examine it as an investment tool, many countries including China are researching just what kind of environment would be appropriate for these investment tools. Although these regulatory rules will be to a minimum, these are still regulatory rules [this is stressed as rules that must be followed]. It is also necessary to ensure that speculation of these assets will result in minimizing financial risk. Before we role out and new regulations or laws with regards to crypto assets, we must ensure that the present laws and practices are being followed.</em>               </p>\n\n<p>We can&#39;t forget this is quite literally &quot;Xi Jinping&#39;s China&quot; that we&#39;re talking about. I say quite litererally because Jack Ma, one of China&#39;s richest men, disappeared for a couple of months for simply voicing a disagreement with the CCP. Now I daresay that we need to keep a close eye on Li Bo for the next couple of months.                  </p>\n\n<p>My final take: I said China would be getting on board sooner or later. I am nearly, positively, 100% certain that new regulations will revolve around strictly custodial services surrounding bitcoin unless the amount is below a particular threshhold in USD or RMB.              </p>\n\n<p>You can find my previous takes here in a different thread - <a href=\"https://old.reddit.com/r/CryptoCurrency/comments/j4e2iz/the_state_of_cryptocurrency_in_china_if_anyone/\">https://old.reddit.com/r/CryptoCurrency/comments/j4e2iz/the_state_of_cryptocurrency_in_china_if_anyone/</a>                </p>\n\n<p>And don&#39;t forget: they don&#39;t want crypto opened up to normies! why? This three minute video should ge the point across: <a href=\"https://www.youtube.com/watch?v=OAK7Rq6YFz4\">https://www.youtube.com/watch?v=OAK7Rq6YFz4</a></p>\n\n<p><strong>EDIT:</strong> This is what the media is trying to make you think with a different entirely fabricated example:                  </p>\n\n<p><strong>&quot;The Speaker of The House comes out as a vegan.&quot;</strong> is the headline we read on Monday from the New York Times.<br/>\nTuesday rolls along. Some Chinese news outlet publishes this headline: <strong>&quot;America is going green and loves eating vegan.&quot;</strong> because of Monday&#39;s headline.                  </p>\n\n<p>Anything sound funny about that?</p>\n</div><!-- SC_ON -->",
  "score": 285,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/MvcDGZKyP9Ft9-qUspfnMZhr-k4TTZtHXQ5kvy0uo6w.jpg?auto=webp&s=8a3b44ee87ad539c84320c34af98a8e20abe3eba",
          "width": 480,
          "height": 360
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/MvcDGZKyP9Ft9-qUspfnMZhr-k4TTZtHXQ5kvy0uo6w.jpg?width=108&crop=smart&auto=webp&s=11bb188eaf7a6f4d4a5cdc4f366f4e8e827892bf",
            "width": 108,
            "height": 81
          },
          {
            "url": "https://external-preview.redd.it/MvcDGZKyP9Ft9-qUspfnMZhr-k4TTZtHXQ5kvy0uo6w.jpg?width=216&crop=smart&auto=webp&s=238fc1e36b3c22b461bc1d1b4e39056d3d83ce79",
            "width": 216,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/MvcDGZKyP9Ft9-qUspfnMZhr-k4TTZtHXQ5kvy0uo6w.jpg?width=320&crop=smart&auto=webp&s=038dcf3fa64f616e4aadda481d5576d149e608fc",
            "width": 320,
            "height": 240
          }
        ],
        "variants": {},
        "id": "XmkrLReXZmVUSIdxGwx__EMeF847V6IvNhhV1d1gSTQ"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mucv40/reality_check_china_did_not_call_bitcoin_an/",
  "subreddit": "CryptoCurrency",
  "id": "mucv40",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521491
}