{
  "author": "waughandy",
  "original_created_utc": 1625563503,
  "title": "I understand now why not everybody will be rich",
  "created_utc": 1625600058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi guys,</p>\n\n<p>I started crypto in January and I know a lot of people who do the same in the last 6 months. Now, when I speak to them, nobody want to invest more, because they have already lost a lot ! Not all, but some invested at the ath and now, they only want to wait to be at the ath again to invest...</p>\n\n<p>Some others already forget about the cryptos, they were soooo sure to become rich and now this is like it never happened.</p>\n\n<p>So now I understand that during a bear market, this is hard to continue to invest. But I will, and the fact that a lot abandon to invest during this time motivate me more to invest! Because now I know that this is only the people that really believe that will be rich or ultimatly more wealthy than before!</p>\n\n<p>I will continue to DCA min 10 years and I will see what happened !</p>\n\n<p>Thank you all, I am with all of us, believers!</p>\n\n<p>&#x200B;</p>\n\n<p>Edit : I know and think too that this isn&#39;t the bear already but people already abandon so imagine during the real bear! More and more people will abandon and stop believe in crypto !</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/oerge7/i_understand_now_why_not_everybody_will_be_rich/",
  "subreddit": "CryptoCurrency",
  "id": "oerge7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi guys,\n\nI started crypto in January and I know a lot of people who do the same in the\nlast 6 months. Now, when I speak to them, nobody want to invest more, because\nthey have already lost a lot ! Not all, but some invested at the ath and now,\nthey only want to wait to be at the ath again to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は1月に暗号を始めましたが、この6ヶ月間に同じことをした人をたくさん知っています。\nこの6ヶ月間に同じことをしている人をたくさん知っているよ。今、彼らに話を聞くと、誰もがもっと投資したいと思っていません。\nなぜなら、彼らはすでにかなりの損失を出しているからです。すべてではありませんが、一部の人はアスファルトに投資し、今も投資しています。\n全員ではありませんが、何人かはアスファルトで投資して、今はアスファルトに戻るのを待ちたいと思っています。",
      "title": "みんながお金持ちになれない理由がわかりました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我在一月份开始做加密货币，我知道很多人在过去6个月里也在做同样的事情。\n过去6个月，我知道很多人也在做同样的事情。现在，当我和他们交谈时，没有人愿意再投资，因为\n因为他们已经损失惨重了! 不是所有的人，但有些人是在第1阶段和现在投资的。\n他们只想等着再次进入A股市场，以...",
      "title": "我现在明白了为什么不是每个人都会成为富人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我在一月份開始做加密貨幣，我知道很多人在過去6個月裏也在做同樣的事情。\n過去6個月，我知道很多人也在做同樣的事情。現在，當我和他們交談時，沒有人願意再投資，因爲\n因爲他們已經損失慘重了! 不是所有的人，但有些人是在第1階段和現在投資的。\n他們只想等着再次進入A股市場，以...",
      "title": "我現在明白了爲什麼不是每個人都會成爲富人"
    }
  ]
}