{
  "author": "MonoGatuno",
  "original_created_utc": 1627900965,
  "title": "How did armies deal with rapists prior to rape becoming a war crime post-WW2?",
  "created_utc": 1627932119,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"/u/sunagainstgold\">u/sunagainstgold</a> touched on this in their excellent answer on sexual violence in the Middle Ages. I thought that this was distinct enough to merit its own question. </p>\n\n<p>&#x200B;</p>\n\n<p>My question is, broadly, what were the consequences for soldiers who raped and / or sexually assaulted people (civilians, prisoners, or other members of their own military) during the two World Wars. I&#39;m aware this is a very broad question, so here are some more specific ones I&#39;m particularly curious about:</p>\n\n<ul>\n<li>If a German soldier on the Eastern front raped a Soviet citizen would he be in trouble for rape or for race mixing? Or both? Or not at all? </li>\n<li>If the rape was male on male, would the authorities of the time consider this worse due to the homosexual aspect of the crime? </li>\n<li>If rape wasn&#39;t explicitly a war crime, what were those rapists who were punished (assuming there were any) convicted of, and under what rules? </li>\n<li>I know the Duke of Wellington punished looters and rapists during his campaigns in France and Spain in order to gain the support of the local populations. Did the armies of the two World Wars use the same rationale?</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/owbxvi/how_did_armies_deal_with_rapists_prior_to_rape/",
  "subreddit": "AskHistorians",
  "id": "owbxvi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "u/sunagainstgold [/u/sunagainstgold] touched on this in their excellent answer\non sexual violence in the Middle Ages. I thought that this was distinct enough\nto merit its own question.\n\n\n\nMy question is, broadly, what were the consequences for soldiers who raped and /\nor sexually assaulted people…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "u/sunagainstgold [/u/sunagainstgold]さんは、次のような素晴らしい回答でこのことに触れています。\n中世における性的暴力について。私は、これは独立した質問に値するほど明確であると思いました。\n私の質問は大まかに言って\n\n\n\n私の質問は、大まかに言えば、レイプした兵士の結果はどうだったのか、ということです。\n人をレイプしたり、性的に暴行したりした兵士は、どのような結果になったのでしょうか？",
      "title": "第二次世界大戦後、レイプが戦争犯罪となる前に、軍隊はレイプ犯にどのように対処していたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "u/sunagainstgold [/u/sunagainstgold] 在他们出色的回答中提到了这一点\n关于中世纪的性暴力。我认为这一点足够独特\n值得有自己的问题。\n\n\n\n我的问题是，从广义上讲，强奸和/或性侵犯人的士兵的后果是什么？\n我的问题是，从广义上讲，那些强奸和/或性侵犯的士兵会有什么后果...",
      "title": "在二战后强奸成为战争罪之前，军队是如何处理强奸犯的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "u/sunagainstgold [/u/sunagainstgold] 在他們出色的回答中提到了這一點\n關於中世紀的性暴力。我認爲這一點足夠獨特\n值得有自己的問題。\n\n\n\n我的問題是，從廣義上講，強姦和/或性侵犯人的士兵的後果是什麼？\n我的問題是，從廣義上講，那些強姦和/或性侵犯的士兵會有什麼後果...",
      "title": "在二戰後強姦成爲戰爭罪之前，軍隊是如何處理強姦犯的？"
    }
  ]
}