{
  "author": "guyastronomer",
  "the_new_excerpt": "Remember, the fundamentals are the same and there’s no reason to sell any right\nnow. Currently there is a lot of fear and fud in the market which is the best\ntime to accumulate. If you’ve done your research and know what you’re entering\ninto, it’s crypto in the end, prices will come down but it will…",
  "original_created_utc": 1623127232,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ファンダメンタルズは同じであり、今すぐに売る理由はないことを忘れてはならない。\n今、売る理由はない。現在、市場には多くの恐怖と偽りがあり、それは蓄積するのに最適な時期です。\n蓄積するのに最適な時期です。リサーチをして、自分が何に参入しているのかを知っているのであれば\n最終的には暗号です。価格は下がるでしょうが、それは...。",
      "title": "私はBTCを売っていない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "记住，基本面是一样的，没有理由现在就卖掉任何东西。\n现在。目前，市场上有很多恐惧和虚假的东西，这是最好的\n积累的最佳时机。如果你已经做了研究，并知道你进入的是什么\n入的是加密货币，价格会下降，但它会...",
      "title": "我不卖任何BTC"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "記住，基本面是一樣的，沒有理由現在就賣掉任何東西。\n現在。目前，市場上有很多恐懼和虛假的東西，這是最好的\n積累的最佳時機。如果你已經做了研究，並知道你進入的是什麼\n入的是加密貨幣，價格會下降，但它會...",
      "title": "我不賣任何BTC"
    }
  ],
  "title": "I’m not selling any BTC",
  "created_utc": 1623160504,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Remember, the fundamentals are the same and there’s no reason to sell any right now. Currently there is a lot of fear and fud in the market which is the best time to accumulate. If you’ve done your research and know what you’re entering into, it’s crypto in the end, prices will come down but it will recover and we will be happy in a few months. It does not matter even if you bought high, close the charts and enjoy your daily life.</p>\n\n<p>P.S I bought @ an average of 36.5k and I’m already out of fiat from buying the dips. Now I store it in my cold wallet and enjoy the ride.</p>\n</div><!-- SC_ON -->",
  "score": 223,
  "permalink": "/r/Bitcoin/comments/nuwhjc/im_not_selling_any_btc/",
  "subreddit": "Bitcoin",
  "id": "nuwhjc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404878618
}