{
  "author": "d_d0g",
  "original_created_utc": 1644797856,
  "title": "Coinbase just shut themselves down",
  "created_utc": 1644835243,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Coinbase just released a floating QR code during commercial time of the Super Bowl. It was fitting for a random 1980’s style science fiction b-roll clip.&lt;/p&gt;\n\n&lt;p&gt;I went there and their server was down almost immediately. They basically just DDoS’d themselves. I hope some of you were able to enter the competition. I was locked out completely.&lt;/p&gt;\n\n&lt;p&gt;This is hilarious but also shows the power of advertising while providing a glimpse into the future. The mainstream events are now glaringly obvious and cannot be ignored.&lt;/p&gt;\n\n&lt;p&gt;Even if we continue the winter, adoption is picking up tremendously. Looking forward to seeing the next crypto commercial. Let’s go!&lt;/p&gt;\n\n&lt;p&gt;Edit: it was only down about 5 minutes but that doesn’t change anything about welcoming all these newbs with a righteous downed server.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 312,
  "permalink": "/r/CryptoCurrency/comments/srx2mi/coinbase_just_shut_themselves_down/",
  "subreddit": "CryptoCurrency",
  "id": "srx2mi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Coinbase just released a floating QR code during commercial time of the Super\nBowl. It was fitting for a random 1980’s style science fiction b-roll clip.\n\nI went there and their server was down almost immediately. They basically just\nDDoS’d themselves. I hope some of you were able to enter the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Coinbaseは、SuperのコマーシャルタイムにフローティングQRコードをリリースしたばかりです。\nボウル 1980年代風のランダムなSFのBロールクリップにふさわしいものでした。\n\n私はそこに行きましたが、彼らのサーバーはほとんどすぐにダウンしました。彼らは基本的に\nDDoSを行いました。このような状況下で、皆様の中にエントリーされた方がいらっしゃれば幸いです...",
      "title": "Coinbaseが閉鎖されました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Coinbase刚刚在超级碗的广告时间发布了一个浮动二维码。\n碗。这对于一个随机的1980年代风格的科幻小说b-roll片段来说是很合适的。\n\n我去了那里，他们的服务器几乎立刻就坏了。他们基本上就是\nDDoS'd自己。我希望你们中的一些人能够进入...",
      "title": "Coinbase刚刚关闭了自己"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Coinbase剛剛在超級碗的廣告時間發佈了一個浮動二維碼。\n碗。這對於一個隨機的1980年代風格的科幻小說b-roll片段來說是很合適的。\n\n我去了那裏，他們的服務器幾乎立刻就壞了。他們基本上就是\nDDoS'd自己。我希望你們中的一些人能夠進入...",
      "title": "Coinbase剛剛關閉了自己"
    }
  ]
}