{
  "author": "Accomplished-Design7",
  "original_created_utc": 1637106936,
  "title": "If you didn't sell during the May crash you sure as hell shouldn't sell now",
  "created_utc": 1637141451,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The May crash was a real crash, this is nothing, and if you survived that please do yourself a favor and not paper hand your cryptos. The real bull run hasn&#39;t even started, I do not want anyone of you lads to be missing out on the inevitable parabolic run that is to come. These dips are necessary and healthy if we want a strong runup.</p>\n\n<p>I bought throughout the May crash and this dip isn&#39;t giving me any red for those purchases of mine. I like this dip, so I can lower the average buys that I recently bought. You haven&#39;t lost anything unless you have sold in the red.</p>\n\n<p>If this is your first crash, then stay collected and calm. These lows are needed for new highs, don&#39;t be the one selling your cryptos to the whale while they are scooping up during the red days. Stay strong and keep your diamond hands stronger.</p>\n\n<p>Edit: P.S Not financial advice </p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/qvlsb9/if_you_didnt_sell_during_the_may_crash_you_sure/",
  "subreddit": "CryptoCurrency",
  "id": "qvlsb9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The May crash was a real crash, this is nothing, and if you survived that please\ndo yourself a favor and not paper hand your cryptos. The real bull run hasn't\neven started, I do not want anyone of you lads to be missing out on the\ninevitable parabolic run that is to come. These dips are necessary…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "5月のクラッシュは本物のクラッシュだったが、今回は何でもない。\n生き残った人は、自分のためにも、暗号を紙で渡さないようにしてください。本当のブルランはまだ始まっていません。\nまだ始まってもいないのに、これから始まる必然的なパラボリックランを誰にも逃して欲しくないのです。\n避けて通れないパラボリックランを見逃して欲しくない。このようなディップは必要です...",
      "title": "5月の暴落時に売らなかった人は、今は絶対に売るべきではない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "5月的暴跌是真正的暴跌，这不算什么，如果你在暴跌中幸存下来，请\n请帮你自己一个忙，不要把你的加密货币放在纸上。真正的牛市还没有开始\n我不希望你们中的任何一个人错过了即将到来的\n错过即将到来的必然的抛物线运行。这些下跌是必要的...",
      "title": "如果你没有在五月的暴跌中卖出，你现在肯定不应该卖出。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "5月的暴跌是真正的暴跌，這不算什麼，如果你在暴跌中倖存下來，請\n請幫你自己一個忙，不要把你的加密貨幣放在紙上。真正的牛市還沒有開始\n我不希望你們中的任何一個人錯過了即將到來的\n錯過即將到來的必然的拋物線運行。這些下跌是必要的...",
      "title": "如果你沒有在五月的暴跌中賣出，你現在肯定不應該賣出。"
    }
  ]
}