{
  "author": "Tfish",
  "original_created_utc": 1636464057,
  "title": "With the recent Travis Scott event in mind, how was the 1991 Metallica Moscow show able to keep upwards of 500k people from incident?",
  "created_utc": 1636476002,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know it gets exaggerated to upwards of 1.5 million, and it definitely looks like it from the videos of the crowd. </p>\n\n<p>But somehow this enormous grouping of people, most of whom have never been to a metal concert in their life, managed to have fun without any deaths occurring as a result of the gigantic crowd, to my knowledge. </p>\n\n<p>Any music historians have an idea as to why this event was somehow different from the recent Travis Scott one, even though the crowd at the former was significantly larger and the atmosphere encouraged more violent crowd reaction?</p>\n</div><!-- SC_ON -->",
  "score": 246,
  "permalink": "/r/AskHistorians/comments/qq3jg5/with_the_recent_travis_scott_event_in_mind_how/",
  "subreddit": "AskHistorians",
  "id": "qq3jg5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know it gets exaggerated to upwards of 1.5 million, and it definitely looks\nlike it from the videos of the crowd.\n\nBut somehow this enormous grouping of people, most of whom have never been to a\nmetal concert in their life, managed to have fun without any deaths occurring as\na result of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "150万人以上に誇張されているのは知っているし、観客の映像を見ると確かにそのように見える。\n観客の映像を見ると、確かにそのように見えます。\n\nしかし、なぜかこの巨大な集団は、ほとんどの人がメタルコンサートに行ったことがない。\nメタルコンサートに行ったことがない人がほとんどなのに、この巨大な集団は、なんとか死なずに楽しく過ごすことができました。\n楽しむことができたのです...",
      "title": "最近のトラビス・スコットのイベントを念頭に、1991年のメタリカのモスクワ公演では、なぜ500k以上の人が事件に巻き込まれずに済んだのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道这个数字被夸大到150万以上，而且从人群的视频来看，绝对是这样的\n从人群的视频来看，绝对是这样的。\n\n但不知何故，这群巨大的人，其中大多数人一生中从未去过金属音乐会。\n他们中的大多数人一生中都没有去过金属音乐会，却能在没有任何死亡发生的情况下获得乐趣。\n的结果是...",
      "title": "考虑到最近的特拉维斯-斯科特事件，1991年莫斯科的Metallica演出是如何让多达50多万人远离事件的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道這個數字被誇大到150萬以上，而且從人羣的視頻來看，絕對是這樣的\n從人羣的視頻來看，絕對是這樣的。\n\n但不知何故，這羣巨大的人，其中大多數人一生中從未去過金屬音樂會。\n他們中的大多數人一生中都沒有去過金屬音樂會，卻能在沒有任何死亡發生的情況下獲得樂趣。\n的結果是...",
      "title": "考慮到最近的特拉維斯-斯科特事件，1991年莫斯科的Metallica演出是如何讓多達50多萬人遠離事件的？"
    }
  ]
}