{
  "author": "DMBCBCB",
  "the_new_excerpt": "I'm reading all of these posts on Reddit about people putting all of their money\ninto GME at $270 or $300 a share. I assume at least a few of these are\nlying/manipulating, but a good number of them are legit. Here is a fact: many of\nthese people are going to lose a lot of money, money that they…",
  "original_created_utc": 1611760740,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在Reddit上读到了所有这些帖子，关于人们把所有的钱。\n以每股270元或300元的价格进入GME。我想其中至少有几家是\n撒谎/操纵，但其中有不少是合法的。这里有一个事实：许多\n这些人将失去很多钱，钱，他们... ...",
      "title": "好吧，我去头，在这里做个Debbie Downer。我很担心小的/没有经验的/年轻的投资者。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在Reddit上讀到了所有這些帖子，關於人們把所有的錢。\n以每股270元或300元的價格進入GME。我想其中至少有幾家是\n撒謊/操縱，但其中有不少是合法的。這裏有一個事實：許多\n這些人將失去很多錢，錢，他們... ...",
      "title": "好吧，我去頭，在這裏做個Debbie Downer。我很擔心小的/沒有經驗的/年輕的投資者。"
    }
  ],
  "title": "OK, I'll go head and be the Debbie Downer here: I am very worried for small/inexperienced/young investors.",
  "created_utc": 1611769263,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m reading all of these posts on Reddit about people putting all of their money into GME at $270 or $300 a share. I assume at least a few of these are lying/manipulating, but a good number of them are legit. Here is a fact: many of these people are going to lose a lot of money, money that they often can not afford to lose. I was that person in the past. It is a terrible, terrible feeling. A feeling I never want anyone to have.</p>\n\n<p>On one hand, I love seeing the hedge fund guys taken down and pretty much hope they all get taken down. I think most of them are dubious and/or bad people. On the other hand, I see that a bunch of young and inexperienced investors--often not wealthy investors--are risking too much of their net worth on a highly speculative, frenzied bubble.</p>\n\n<p>JUST WHILE WRITING THIS the stock has gone down $50. In just a few mins! Yes, I know it could jump back up again. Folks, this is crazy. Please do not invest any money you can&#39;t afford to lose. This is pure gambling at this point, no different than a roulette wheel. Similar to a roulette wheel, you should never gamble more money than you can easily afford to lose for fun. Please be careful folks, I hate to see young/inexperienced people get hurt because they got caught up in something emotional and fun.</p>\n\n<p>And speaking of the roulette wheel, you can take $100 and put it on 32 red right now at a casino. If it comes in you will have thousands of dollars. It&#39;s just that easy folks! Making money via gambling is just that easy. You don&#39;t even need the stock market.</p>\n\n<p>Be careful and safe out there everyone. Sincerely, your mom.</p>\n\n<p>Disclosure: I have absolutely no dog in this fight either way, financially speaking anyway. I own no options or securities related to this discussion in any way.</p>\n\n<p>EDIT: My main point is about people (esp. young/inexperienced people) putting *everything* into this thing (or any other investment). My main point is not &quot;no one should buy GME.&quot; Please understand this difference.</p>\n\n<p>EDIT #2: some of you have flattered with me with comments/questions suggesting that I am an expert. I am no such thing, certainly not about stocks. I am only someone who has a bit of experience/age built up. I am not an expert on stock investing. I am an expert on blowing money as a young person. I blew money on bad investments. I blew money on material possessions that in retrospect are worthless. I blew money on addiction-related things such as drugs and gambling. You can ask me about that. Short answer: it was terrible and felt horrible then and now. Being an irresponsible, reckless young person sucks and I hope no one has to go through it while at the same time I recognize that *some* people will always go through this as long as there are human beings.</p>\n</div><!-- SC_ON -->",
  "score": 746,
  "permalink": "/r/stocks/comments/l66m3f/ok_ill_go_head_and_be_the_debbie_downer_here_i_am/",
  "subreddit": "stocks",
  "id": "l66m3f",
  "is_self": true,
  "media": null,
  "is_video": false
}