{
  "author": "AGROCRAG004",
  "original_created_utc": 1659800066,
  "title": "The ETH merge may be the catalyst for another huge leg down...",
  "created_utc": 1659861318,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I really think there is a more than likely chance that when the ETH merge happens, or right before it will trigger a massive “buy the rumor sell the news” event.&lt;/p&gt;\n\n&lt;p&gt;ETH has been pumping recently and I suspect this is the “buy the rumor” phase.&lt;/p&gt;\n\n&lt;p&gt;IF there is to be lower lows and another big leg down in the crypto markets I think the ETH merge could be the perfect storm that provides that. &lt;/p&gt;\n\n&lt;p&gt;So, I guess to hedge against this possibility I would be taking some profits on the way up. Or at least keeping dry powder on the side to see how things play out sept-dec.&lt;/p&gt;\n\n&lt;p&gt;Also, if the merge doesn’t go off perfectly that could also be reason for a sell off in the mid to short term. I would argue there’s a much higher chance the merge has issues or gets pushed out and delayed further.&lt;/p&gt;\n\n&lt;p&gt;What do you guys think?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 317,
  "permalink": "/r/CryptoCurrency/comments/whr2dt/the_eth_merge_may_be_the_catalyst_for_another/",
  "subreddit": "CryptoCurrency",
  "id": "whr2dt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I really think there is a more than likely chance that when the ETH merge\nhappens, or right before it will trigger a massive “buy the rumor sell the news”\nevent.\n\nETH has been pumping recently and I suspect this is the “buy the rumor” phase.\n\nIF there is to be lower lows and another big leg down in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "本当に、ETHが合併したら、可能性が高くなると思います。\nが起こるか、その直前に大規模な「噂を買ってニュースを売る」イベントが発生する可能性が高\nイベントが発生する可能性が高いと思います。\n\nETHは最近急騰しており、私はこれが「噂を買う」局面ではないかと考えています。\n\nこのまま安値を更新し、さらに大きな下げがあるとしたら......。",
      "title": "ETHの合併をきっかけに、再び大きな下げ足を見せるかもしれない...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的认为，当ETH合并时，有更大的可能是\n发生时，或者就在它之前，将引发大规模的 \"买入谣言卖出新闻 \"事件。\n事件。\n\nETH最近一直在上涨，我怀疑这就是 \"买入谣言 \"的阶段。\n\n如果会有更低的低点和另一个大的跌幅，在...",
      "title": "ETH合并可能是另一个巨大跌幅的催化剂..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的認爲，當ETH合併時，有更大的可能是\n發生時，或者就在它之前，將引發大規模的 \"買入謠言賣出新聞 \"事件。\n事件。\n\nETH最近一直在上漲，我懷疑這就是 \"買入謠言 \"的階段。\n\n如果會有更低的低點和另一個大的跌幅，在...",
      "title": "ETH合併可能是另一個巨大跌幅的催化劑..."
    }
  ]
}