{
  "author": "Colosso95",
  "original_created_utc": 1631993246,
  "title": "What's the history behind the stereotypical \"young kid propeller hat\"? When was it invented and why is it so representative of the image of a male child?",
  "created_utc": 1632007277,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You see it in many types of media, even today, maybe accompanied by an oversized lollypop and a pair of overalls.<br/>\nYou might use it to dress up an adult man for the comedic effect of making him look like a kid.  </p>\n\n<p>My questions are: when and why has this hat been created? Why is it still so representative of the image of a young brat? Was it used in a famous depiction of a child?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/pqssgg/whats_the_history_behind_the_stereotypical_young/",
  "subreddit": "AskHistorians",
  "id": "pqssgg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You see it in many types of media, even today, maybe accompanied by an oversized\nlollypop and a pair of overalls.\nYou might use it to dress up an adult man for the comedic effect of making him\nlook like a kid.\n\nMy questions are: when and why has this hat been created? Why is it still…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今でも様々なメディアで目にすることがありますが、特大のローリーポップとオーバーオールを伴っているかもしれません。\n大きなロリポップとオーバーオールを伴って。\n大人の男性が子供のように見えるような、コミカルな効果を狙った着こなしにも\n笑いを誘うために、大人の男性に着せることもあるでしょう。\n\n私の疑問は、この帽子がいつ、何のために作られたのか？なぜ今でも...。",
      "title": "若い子のプロペラ帽」というステレオタイプの背景にはどんな歴史があるのでしょうか？いつ発明されたのか、なぜ男の子供のイメージを代表するものなのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你在许多类型的媒体上看到它，甚至在今天，也许伴随着一个超大的棒棒糖和一双工作服。\n棒棒糖和一双工作服。\n你可能会用它来装扮一个成年男子，使他看起来像个孩子，以达到喜剧效果。\n看起来像个孩子。\n\n我的问题是：这顶帽子是什么时候和为什么被创造出来的？为什么它仍然...",
      "title": "刻板的 \"年轻孩子螺旋桨帽 \"背后有什么历史？它是什么时候发明的，为什么它能代表一个男性儿童的形象？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你在許多類型的媒體上看到它，甚至在今天，也許伴隨着一個超大的棒棒糖和一雙工作服。\n棒棒糖和一雙工作服。\n你可能會用它來裝扮一個成年男子，使他看起來像個孩子，以達到喜劇效果。\n看起來像個孩子。\n\n我的問題是：這頂帽子是什麼時候和爲什麼被創造出來的？爲什麼它仍然...",
      "title": "刻板的 \"年輕孩子螺旋槳帽 \"背後有什麼歷史？它是什麼時候發明的，爲什麼它能代表一個男性兒童的形象？"
    }
  ]
}