{
  "author": "Crackingteapot",
  "original_created_utc": 1628003102,
  "title": "How were people tracked down in the middle ages?",
  "created_utc": 1628077040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today we have plenty of way of finding people from pinging phones to passport checks. </p>\n\n<p>In TV and film we often see a character be hunted by knights or guards across country and they will often &quot;Pick up a trail&quot; which seems a tad far fetched. </p>\n\n<p>So how were outlaws pursued across country? Say a high profile traitor to the kingdom of Mercia in the 9th century, as an example of the time period I&#39;m after.</p>\n\n<p>Cheers in advance folks</p>\n</div><!-- SC_ON -->",
  "score": 239,
  "permalink": "/r/AskHistorians/comments/ox5c4l/how_were_people_tracked_down_in_the_middle_ages/",
  "subreddit": "AskHistorians",
  "id": "ox5c4l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today we have plenty of way of finding people from pinging phones to passport\nchecks.\n\nIn TV and film we often see a character be hunted by knights or guards across\ncountry and they will often \"Pick up a trail\" which seems a tad far fetched.\n\nSo how were outlaws pursued across country? Say a high…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、私たちは、電話を鳴らしたり、パスポートをチェックしたりと、人を見つける方法をたくさん持っています。\n調べることができます。\n\nテレビや映画では、登場人物が国中の騎士や衛兵に追われる場面がよくあります。\n国中で騎士や衛兵に追われる場面をよく目にしますが、彼らはしばしば「痕跡を拾う」と言いますが、これは少し突飛な話です。\n\nでは、無法者はどのようにして国中を追われたのでしょうか？例えば、高...",
      "title": "中世の人々はどのようにして追跡されたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，我们有很多方法可以找到人，从电话定位到护照检查。\n检查。\n\n在电视和电影中，我们经常看到一个角色被骑士或卫兵在全国范围内追捕。\n他们往往会 \"追踪\"，这似乎有点牵强。\n\n那么，不法分子是如何在全国范围内被追捕的呢？说一个高...",
      "title": "在中世纪，人们是如何被追踪的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，我們有很多方法可以找到人，從電話定位到護照檢查。\n檢查。\n\n在電視和電影中，我們經常看到一個角色被騎士或衛兵在全國範圍內追捕。\n他們往往會 \"追蹤\"，這似乎有點牽強。\n\n那麼，不法分子是如何在全國範圍內被追捕的呢？說一個高...",
      "title": "在中世紀，人們是如何被追蹤的？"
    }
  ]
}