{
  "author": "homrqt",
  "original_created_utc": 1655006657,
  "title": "Anybody else see these massive dips and get hungrier because you can buy more crypto for less?",
  "created_utc": 1655051669,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if the crypto fever has completely consumed me at this point but while people are screaming and crying over the red, I&amp;#39;m smiling and buying. I DCA every week and my averages are looking awesome, even if my overall value is down over the past 6 months. When I first got into crypto I treaded a little too lightly and didn&amp;#39;t invest what I should have. Now we are on the cusp of rolling back some of these crypto values several years and I feel like my second chance is coming. Barring a societal collapse from which we never recover, I look forward to some steep economic declines if it means I can buy up a lot of crypto for way less fiat. Have I completely lost it or is anyone else on the same page as me as far as this potentially being a huge buying opportunity? I don&amp;#39;t know about you boys, but I&amp;#39;m stacking up like a mad man right now.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/vadvg1/anybody_else_see_these_massive_dips_and_get/",
  "subreddit": "CryptoCurrency",
  "id": "vadvg1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I don't know if the crypto fever has completely consumed me at this point but\nwhile people are screaming and crying over the red, I'm smiling and buying. I\nDCA every week and my averages are looking awesome, even if my overall value is\ndown over the past 6 months. When I first got into crypto I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この時点で暗号熱に完全に飲み込まれたのかどうかは分かりませんが\n人々が赤に悲鳴をあげて泣いている間、私は笑顔で買い続けています。I\n毎週DCAしていますが、全体的な価値は下がっても、私の平均は素晴らしいです。\n過去6ヶ月の間、私の全体的な価値は下がっていますが。私が最初に暗号に入ったとき、私は...",
      "title": "これらの大規模なディップを見て、より多くの暗号を安価に購入できるため、より空腹になる人はいますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道在这一点上加密货币的热度是否已经完全吞噬了我，但\n当人们在为红色而尖叫和哭泣时，我却在微笑着购买。I\n每周的DCA，我的平均数看起来很好，即使我的整体价值在过去6个月里是\n在过去6个月里，我的平均数看起来很好。当我第一次进入加密货币时，我...",
      "title": "还有人看到这些巨大的跌幅而变得更加饥饿，因为你可以用更少的钱买到更多的加密货币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道在這一點上加密貨幣的熱度是否已經完全吞噬了我，但\n當人們在爲紅色而尖叫和哭泣時，我卻在微笑着購買。I\n每週的DCA，我的平均數看起來很好，即使我的整體價值在過去6個月裏是\n在過去6個月裏，我的平均數看起來很好。當我第一次進入加密貨幣時，我...",
      "title": "還有人看到這些巨大的跌幅而變得更加飢餓，因爲你可以用更少的錢買到更多的加密貨幣？"
    }
  ]
}