{
  "author": "Ragefan66",
  "original_created_utc": 1635179472,
  "title": "One of the top posts here 3 weeks ago was literally \"DON'T FOMO INTO SHIB\", it has gone up 250% since then.",
  "created_utc": 1635194360,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Nobody here truly has any idea what they&#39;re talking about. Even I, like many others, was completely trashing DOGE on this sub when it was $.02, and I watched as it went up to $.70.</p>\n\n<p>You can have the best tokenomics in the universe but it doesn&#39;t mean shit if people aren&#39;t hyped on it and buying it. Are you really buying crypto for the underlying tech or are you buying it with the hope that the value rises and one day you can sell it to someone else at a much higher price? Hype is invaluable. </p>\n\n<p>A coin like Solana has amazing technology behind it but you wouldnt buy it if it went down 98% every year since inception, even if it had the exact same technology. The smart people are here for the money, if we were here for the tech we would be DCA&#39;ing into things like IPhones and not Crypto.</p>\n</div><!-- SC_ON -->",
  "score": 274,
  "permalink": "/r/CryptoCurrency/comments/qfkktw/one_of_the_top_posts_here_3_weeks_ago_was/",
  "subreddit": "CryptoCurrency",
  "id": "qfkktw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Nobody here truly has any idea what they're talking about. Even I, like many\nothers, was completely trashing DOGE on this sub when it was $.02, and I watched\nas it went up to $.70.\n\nYou can have the best tokenomics in the universe but it doesn't mean shit if\npeople aren't hyped on it and buying it.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいる誰もが、自分が何を言っているのか、本当に分かっていません。私も、他の多くの人と同様に\n他の多くの人と同じように、DOGEが$.02だったとき、このサブサイトでDOGEを完全にゴミ箱に入れていたし、$.70まで上がるのを見ていた。\n70ドルまで上がったのを見ていました。\n\n宇宙一のトークンを持っていても、人々がそれに熱狂しなければ意味がありません。\n人々がそれに熱狂して買わなければ意味がありません....",
      "title": "3週間前のここでのトップ記事の一つは、文字通り「DON'T FOMO INTO SHIB」で、それから250％も上昇しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这里没有人真正知道他们在谈论什么。甚至我，像许多人一样\n其他人，在DOGE还是0.02美元的时候，就对它进行了彻底的抨击，而我眼睁睁看着它涨到了0.70美元。\n看着它涨到了0.70美元。\n\n你可以拥有宇宙中最好的象征性的东西，但如果人们不对它进行炒作，它就没有任何意义。\n人们对它不感兴趣，不买它，那就没有任何意义....。",
      "title": "3周前，这里的一个热门帖子简直就是 \"DON'T FOMO INTO SHIB\"，从那时起，它已经上涨了250%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏沒有人真正知道他們在談論什麼。甚至我，像許多人一樣\n其他人，在DOGE還是0.02美元的時候，就對它進行了徹底的抨擊，而我眼睜睜看着它漲到了0.70美元。\n看着它漲到了0.70美元。\n\n你可以擁有宇宙中最好的象徵性的東西，但如果人們不對它進行炒作，它就沒有任何意義。\n人們對它不感興趣，不買它，那就沒有任何意義....。",
      "title": "3周前，這裏的一個熱門帖子簡直就是 \"DON'T FOMO INTO SHIB\"，從那時起，它已經上漲了250%。"
    }
  ]
}