{
  "author": "JJVMT",
  "the_new_excerpt": "Also, as a point of contrast, I can understand why middle-aged and older adults\nof the time were scandalized by Beavis and Butthead (whose protagonists\nregularly and recklessly engaged in rather serious criminal behavior for fun),\nbut The Simpsons just doesn't strike me as being anywhere near that…",
  "original_created_utc": 1618274420,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "また、対照的に、当時の中高年が「ビーバス・アンド・バットヘッド」（その主人公は、「ビーバス・アンド・バットヘッド」と呼ばれています。\n当時の中高年が『ビーバス＆バットヘッド』（主人公たちが遊び半分でかなり深刻な犯罪行為に手を染めていた）を不審に思ったのもわかる。\nしかし、The Simpsonsは、私にはそのようには思えません。)\nしかし、ザ・シンプソンズはそれに近いとは思えないのですが...。",
      "title": "サウスパーク』の後の世界では、今ではかなりおとなしくて無邪気な印象を受けますが、90年代に子供だった私が思い出す『ザ・シンプソンズ』は、90年代の中高年にとっては純粋にスキャンダラスで衝撃的な作品でした。それはなぜか？好みの世代間格差は理解できるが、それが引き起こした道徳的な怒りは理解できない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "另外，作为对比，我也可以理解为什么中老年人\n当时的人都被 \"瘪三 \"和 \"布特海德\"（其主人公）丑化了。\n经常和不计后果地从事相当严重的犯罪行为，并以此为乐）；)\n但《辛普森一家》并没有给我留下深刻印象... ...",
      "title": "虽然现在看来，《辛普森一家》在我们后南派三叔的世界里还算平淡无奇，但我记得作为90年代的孩子，在90年代的中老年人看来，《辛普森一家》是真正的丑闻和震惊。为什么会这样呢？我把握住了口味上的代沟，却没有把握住它所引发的道德愤怒。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "另外，作爲對比，我也可以理解爲什麼中老年人\n當時的人都被 \"癟三 \"和 \"布特海德\"（其主人公）醜化了。\n經常和不計後果地從事相當嚴重的犯罪行爲，並以此爲樂）；)\n但《辛普森一家》並沒有給我留下深刻印象... ...",
      "title": "雖然現在看來，《辛普森一家》在我們後南派三叔的世界裏還算平淡無奇，但我記得作爲90年代的孩子，在90年代的中老年人看來，《辛普森一家》是真正的醜聞和震驚。爲什麼會這樣呢？我把握住了口味上的代溝，卻沒有把握住它所引發的道德憤怒。"
    }
  ],
  "title": "While it now seems fairly tame and innocent in our post-South-Park world, The Simpsons—I recall as a child of the 90s—was genuinely scandalous and shocking to middle-aged and older adults in the 1990s. Why was that? I grasp the generational divide in taste, but not the moral outrage it provoked.",
  "created_utc": 1618283761,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Also, as a point of contrast, I <em>can</em> understand why middle-aged and older adults of the time were scandalized by <em>Beavis and Butthead</em> (whose protagonists regularly and recklessly engaged in rather serious criminal behavior for fun), but <em>The Simpsons</em> just doesn&#39;t strike me as being anywhere near that level, and the strong reaction to it by the authority figures of my childhood seemed disproportionate to me.</p>\n</div><!-- SC_ON -->",
  "score": 124,
  "permalink": "/r/AskHistorians/comments/mprcyv/while_it_now_seems_fairly_tame_and_innocent_in/",
  "subreddit": "AskHistorians",
  "id": "mprcyv",
  "is_self": true,
  "media": null,
  "is_video": false
}