{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "*This is not investment advice. I am not a financial advisor or a finance professional. You should always conduct your own due diligence and might not want to make investment decisions based on what strangers say on the internet. You should not invest money you aren't prepared to lose.*\n\nSo I saw a heart-wrenching post yesterday about someone whose portfolio is down like 70% and they're feeling awful about it. Posts like that are popping up all the time now, even though the S&amp;P is still over 4000 points and the Nasdaq is \"only\" in correction territory.\n\nI'm not one to tell you to buy or sell, I have no idea what's in your portfolio.\n\nBut I will say this: Remember why you bought the stock in the first place. You (hopefully) bought it because you thought it was a buy at that price. If nothing in the underlying business has changed, e.g. revenues are not down, debt is not mounting and management isn't facing prison for wire fraud, then that means that the only difference between now and last Monday is how much someone else last paid for that same stock. \n\nIf you don't have faith in the company, then sure, sell. But know this: If you sell, then it's not \"the market\" that buys what you're selling, it's your counterparty that does the buying. You don't know who that counterparty is, but whether it's an individual or an institution, they're buying what you're selling for 50% of what you initially paid for it, which means that someone out there thinks it's a buy at the price you're willing to sell it for.\n\nI believe that the reason why people engage in the \"buy high sell low\" investment strategy is because the only reason they bought a stock was because it was going up --&gt; buy high. In order to be consistent, then, the only reason to sell would logically be when the stock goes down. It's a horrible strategy, but you can't argue that it isn't consistent. That being said, the reason why most people fail at picking stocks and trading is because they seem to have an insatiable need to hoard complete dog shit.\n\nThe price of a stock is just whatever the buyer paid for it. The value of a stock is something rather different. Whoever buys what you're selling seems to think the opposite of what you think.\n\nIf you gambled and are now in the red, then there's nothing I can say to that. But if your portfolio is down and you are baffled because your DD on a company says the opposite of what's happening to its share price, then I don't really understand why you'd care.",
  "author_fullname": "t2_9g20gqs8",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "The market isn't who buys your stocks",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "suggestion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_saq65i",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.77,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 44,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Meta",
  "can_mod_post": false,
  "score": 44,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1642931325,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;This is not investment advice. I am not a financial advisor or a finance professional. You should always conduct your own due diligence and might not want to make investment decisions based on what strangers say on the internet. You should not invest money you aren&amp;#39;t prepared to lose.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;So I saw a heart-wrenching post yesterday about someone whose portfolio is down like 70% and they&amp;#39;re feeling awful about it. Posts like that are popping up all the time now, even though the S&amp;amp;P is still over 4000 points and the Nasdaq is &amp;quot;only&amp;quot; in correction territory.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not one to tell you to buy or sell, I have no idea what&amp;#39;s in your portfolio.&lt;/p&gt;\n\n&lt;p&gt;But I will say this: Remember why you bought the stock in the first place. You (hopefully) bought it because you thought it was a buy at that price. If nothing in the underlying business has changed, e.g. revenues are not down, debt is not mounting and management isn&amp;#39;t facing prison for wire fraud, then that means that the only difference between now and last Monday is how much someone else last paid for that same stock. &lt;/p&gt;\n\n&lt;p&gt;If you don&amp;#39;t have faith in the company, then sure, sell. But know this: If you sell, then it&amp;#39;s not &amp;quot;the market&amp;quot; that buys what you&amp;#39;re selling, it&amp;#39;s your counterparty that does the buying. You don&amp;#39;t know who that counterparty is, but whether it&amp;#39;s an individual or an institution, they&amp;#39;re buying what you&amp;#39;re selling for 50% of what you initially paid for it, which means that someone out there thinks it&amp;#39;s a buy at the price you&amp;#39;re willing to sell it for.&lt;/p&gt;\n\n&lt;p&gt;I believe that the reason why people engage in the &amp;quot;buy high sell low&amp;quot; investment strategy is because the only reason they bought a stock was because it was going up --&amp;gt; buy high. In order to be consistent, then, the only reason to sell would logically be when the stock goes down. It&amp;#39;s a horrible strategy, but you can&amp;#39;t argue that it isn&amp;#39;t consistent. That being said, the reason why most people fail at picking stocks and trading is because they seem to have an insatiable need to hoard complete dog shit.&lt;/p&gt;\n\n&lt;p&gt;The price of a stock is just whatever the buyer paid for it. The value of a stock is something rather different. Whoever buys what you&amp;#39;re selling seems to think the opposite of what you think.&lt;/p&gt;\n\n&lt;p&gt;If you gambled and are now in the red, then there&amp;#39;s nothing I can say to that. But if your portfolio is down and you are baffled because your DD on a company says the opposite of what&amp;#39;s happening to its share price, then I don&amp;#39;t really understand why you&amp;#39;d care.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "ad4d2f7a-65e6-11e5-bb9c-12dbb48ad70d",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "saq65i",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Agreeable_Flight_107",
  "discussion_type": null,
  "num_comments": 39,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/saq65i/the_market_isnt_who_buys_your_stocks/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/saq65i/the_market_isnt_who_buys_your_stocks/",
  "subreddit_subscribers": 3556253,
  "created_utc": 1642946808,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1642931325,
  "the_new_excerpt": "This is not investment advice. I am not a financial advisor or a finance\nprofessional. You should always conduct your own due diligence and might not\nwant to make investment decisions based on what strangers say on the internet.\nYou should not invest money you aren't prepared to lose.\n\nSo I saw a…"
}