{
  "author": "deaghton",
  "the_new_excerpt": "Title unfortunately describes these past couple of weeks of me losing just about\neverything and now this crypto crash is happening but life is still good because\nI have my dogs, my immediate family and good friends. For all those wondering\nwhy this crash is happening, I believe it is a myriad of…",
  "original_created_utc": 1621788786,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルは残念ながら、私がほぼすべてを失ったこの数週間を表しています。\n全てを失い、今は暗号の暴落が起きていますが、それでも人生は順調です。\n私には、犬、肉親、そして良い友人がいるからです。なぜこのような暴落が起きているのかと疑問に思っている人のために\nなぜこのような暴落が起きているのか、私はそれは無数の...",
      "title": "離婚して、家も車も仕事も失って、今は暗号が出血している...なぜ人生はまだいいのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题不幸地描述了过去几周我失去了几乎所有的东西\n一切，现在又发生了加密货币崩溃，但生活仍然很好，因为\n我有我的狗，我的直系亲属和好朋友。对于所有那些想知道\n为什么会发生这种崩溃，我相信这是无数的......",
      "title": "离婚，失去了我的房子、汽车和工作，现在加密货币在流血......为什么生活还不错。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題不幸地描述了過去幾周我失去了幾乎所有的東西\n一切，現在又發生了加密貨幣崩潰，但生活仍然很好，因爲\n我有我的狗，我的直系親屬和好朋友。對於所有那些想知道\n爲什麼會發生這種崩潰，我相信這是無數的......",
      "title": "離婚，失去了我的房子、汽車和工作，現在加密貨幣在流血......爲什麼生活還不錯。"
    }
  ],
  "title": "Getting divorced, lost my house, my car, my job and now crypto is bleeding...why life is still good.",
  "created_utc": 1621832453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Title unfortunately describes these past couple of weeks of me losing just about everything and now this crypto crash is happening but life is still good because I have my dogs, my immediate family and good friends.  For all those wondering why this crash is happening, I believe it is a myriad of economic changes currently taking place and there is definitely a bright spot on the other side of this.</p>\n\n<p>With a little luck, the “little people”, like myself may be able to change their lives for the better in a short period of time.  </p>\n\n<p>When life is harsh, especially if fucking crashes like these happen as often as they do lately in addition to all the other ancillary bull shut that takes place randomly, remember to consider the good things in life first before dwelling on depressing news and events.  </p>\n\n<p>Excited for crypto to change the world for the better, just going to take a little bit longer than we want but the good things always take patience and especially this year, I am trying to be as patient as any sane person in these tumultuous times.  </p>\n\n<p>Cheers to all in their endeavors and remember to smoke a bowl, grab some goodies and get lost in movies and the outdoors right now because I know I need to.</p>\n</div><!-- SC_ON -->",
  "score": 361,
  "permalink": "/r/CryptoCurrency/comments/njbrcc/getting_divorced_lost_my_house_my_car_my_job_and/",
  "subreddit": "CryptoCurrency",
  "id": "njbrcc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197385272
}