{
  "author": "toastedlactose",
  "original_created_utc": 1639227526,
  "title": "Is Genghis Khan a name or title?",
  "created_utc": 1639269298,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context, I&amp;#39;m doing some first-time research on the Mongol Empire. I&amp;#39;ve been looking into its origin and leaders and am confused about Genghis Khan, is that his name, or a title given to him? I&amp;#39;ve seen that as his name, but I&amp;#39;ve also seen it as a title. For example, Britannica Encyclopedia says he &amp;quot;was elected Genghis Khan&amp;quot;, while most sources refer to Genghis Khan as his name. Any explanation on this would be greatly appreciated.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/rdz9ku/is_genghis_khan_a_name_or_title/",
  "subreddit": "AskHistorians",
  "id": "rdz9ku",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For context, I'm doing some first-time research on the Mongol Empire. I've been\nlooking into its origin and leaders and am confused about Genghis Khan, is that\nhis name, or a title given to him? I've seen that as his name, but I've also\nseen it as a title. For example, Britannica Encyclopedia says…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "文脈上、私はモンゴル帝国について初めて研究しているのです。私はこれまで\nその起源や指導者について調べていて、チンギス・ハーンについて混乱しています。\n彼の名前なのか、それとも彼に与えられた称号なのか？彼の名前として見たことがありますが、同時に\n肩書きとして見ることができます。例えば、ブリタニカ百科事典によると",
      "title": "ジンギスカンは名前なのか肩書きなのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了了解情况，我正在做一些关于蒙古帝国的首次研究。我一直在\n我一直在研究它的起源和领导人，对成吉思汗感到困惑。\n他的名字，还是给他的一个头衔？我见过这是他的名字，但我也见过这是一个称号。\n但我也看到它是一个头衔。例如，《大英百科全书》说...",
      "title": "成吉思汗是一个名字还是一个头衔？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了瞭解情況，我正在做一些關於蒙古帝國的首次研究。我一直在\n我一直在研究它的起源和領導人，對成吉思汗感到困惑。\n他的名字，還是給他的一個頭銜？我見過這是他的名字，但我也見過這是一個稱號。\n但我也看到它是一個頭銜。例如，《大英百科全書》說...",
      "title": "成吉思汗是一個名字還是一個頭銜？"
    }
  ]
}