{
  "author": "bigbear0083",
  "the_new_excerpt": "Good Saturday morning to all of you here on r/stocks [/r/stocks]. I hope\neveryone on this sub made out pretty nicely in the market this past week, and is\nready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning April 19th,…",
  "original_created_utc": 1618665335,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks [/r/stocks]をご覧の皆さん、土曜日の朝はおはようございます。今回は\nこのサブにいる皆さんは、先週の市場でうまく稼いで、新しいトラディショナルなゲームの準備ができていると思います。\n新しい週を迎える準備ができていることと思います。\n\nここでは、今週の取引の準備のために知っておくべきことをお伝えします。\n4月19日からの取引に備えて、知っておくべきことをまとめました...",
      "title": "2021年4月19日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家周六早上好。我希望\n每个人都在这个子上做了相当不错的市场在过去的一周，和是\n为未来新的交易周做好准备。\n\n以下是你需要知道的一切，让你为本交易周做好准备。\n4月19日开始，...",
      "title": "2021年4月19日开始的交易周华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks[/r/stocks]上，大家週六早上好。我希望\n每個人都在這個子上做了相當不錯的市場在過去的一週，和是\n爲未來新的交易周做好準備。\n\n以下是你需要知道的一切，讓你爲本交易周做好準備。\n4月19日開始，...",
      "title": "2021年4月19日開始的交易周華爾街一週前瞻"
    }
  ],
  "title": "Wall Street Week Ahead for the trading week beginning April 19th, 2021",
  "created_utc": 1618679465,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday morning to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning April 19th, 2021.</p>\n\n<h1><strong>Concerns over inflationary pressure on earnings will test stocks in the week ahead - <a href=\"https://www.cnbc.com/2021/04/16/investors-look-for-hints-of-inflation-in-earnings-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Earnings will be the major focus for investors in the week ahead, as they home in on whether rising costs are squeezing margins and signaling a build in inflationary pressures.</p>\n\n<hr/>\n\n<p>From Coca-Cola and IBM to Johnson &amp; Johnson and Netflix, investors will hear from a broad swath of corporate America.</p>\n\n<hr/>\n\n<p>So far, with one week in, companies are beating earnings estimates by a wide margin of more than 84%, according to Refinitiv.</p>\n\n<hr/>\n\n<p>This three-month period is the first to be compared to year earlier profits that were affected by the pandemic. Profit growth for the S&amp;P 500 is a stunning 30.2% for the quarter so far, based on actual reports and estimates.</p>\n\n<hr/>\n\n<p>That makes it the best three-month period since the third quarter of 2010, according to FactSet.</p>\n\n<hr/>\n\n<h1>Signs of margin pressures?</h1>\n\n<p>Major banks, like JPMorgan Chase, Goldman Sachs and Bank of America reported better than expected profits in the past week.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 ended the week at a record high of 4,185, a gain of 1.4%. The Dow, higher for a fourth week, gained 1.2 to end the week at a record 34,200. Nasdaq gained 1.1% for the week, finishing at 14,052.</p>\n\n<hr/>\n\n<p>Utilities was the best performing major S&amp;P sector, gaining 3.7%, followed by materials, up 3.2% and health care, up 2.9%. Technology was up 1%. Financials were up 0.7%, while industrials were up 0.6%.</p>\n\n<hr/>\n\n<p>Lori Calvasina, head of U.S. equity strategy at RBC, said she is watching the coming week’s earnings for signs of margin pressures from higher commodity prices, supply chain issues and other cost factors.</p>\n\n<hr/>\n\n<p>“Those big forces that are threatening margins right now don’t really apply to financials. They apply more to industrial companies, the material companies and consumer companies,” she said.</p>\n\n<hr/>\n\n<p>“I think [sectors] like the industrials will give you color on margins,” Calvasina added. “Margins really are the big question mark going forward. I’m definitely watching and listening to see what companies are going to say about taxes.”</p>\n\n<hr/>\n\n<p>President Joe Biden has proposed raising corporate taxes to 28% from 21% to help pay for his infrastructure plan.</p>\n\n<hr/>\n\n<p>While the fate of the tax hike is still not clear, the increase in other costs is apparent. Fuel costs have risen sharply with a 30% rise in oil prices since the beginning of the year. Lumber prices in the futures market are at an all-time high and copper futures are up about 17% year-to-date.</p>\n\n<hr/>\n\n<p>Calvasina said companies face a headwind and a tailwind.</p>\n\n<hr/>\n\n<p>“Companies are saying we found new ways to cut costs. When revenues come back, margins are going to explode to the upside,” she said. “Some of the Covid-related costs will come down. Those are some of the positives.”</p>\n\n<hr/>\n\n<p>But not every company will see those benefits. “We could start to see wage pressures come back. Rising commodity costs — increases in PPI and increases in CPI — those are negatives for margins,” Calvasina said, referring to the producer price and consumer price indexes.</p>\n\n<hr/>\n\n<h1>Searching for hints of inflation</h1>\n\n<p>Peter Boockvar, chief investment officer at Bleakley Advisory Group, said he is also watching the margin comments carefully for impact on individual stocks, but also for what they broadly say about inflation seeping into the economy.</p>\n\n<hr/>\n\n<p>“What’s going to be the most interesting thing about earnings are profit margins. Some companies are going to get squeezed because they’re going to see price increases and others aren’t because they can pass it on,” said Boockvar.</p>\n\n<hr/>\n\n<p>He said he will pay close attention to whether the semiconductor shortage is showing up in tech companies’ earnings. Automakers have already taken a hit and have scaled back production due to the lack of chips.</p>\n\n<hr/>\n\n<p>The CPI for March showed a pick-up in headline inflation to 2.6% year-over-year. A 9.1% jump in gasoline prices contributed to the gain.</p>\n\n<hr/>\n\n<p>Some of the gains in inflation this spring are expected to be temporary because of the comparison to very low levels last year when the economy was shutdown.</p>\n\n<hr/>\n\n<p>Other than earnings, the week should be fairly quiet. Federal Reserve speakers have taken a hiatus and are in a blackout period ahead of the late April meeting.</p>\n\n<hr/>\n\n<p>“It’s really going to be attention shifting to earnings and the inflation story,” said Boockvar.</p>\n\n<hr/>\n\n<h1>Economic rebound</h1>\n\n<p>In the past week, economic reports underscored how strong the economic momentum could be in the second quarter. Retail sales for March were up nearly 10%, and jobless claims were the lowest of the recovery.</p>\n\n<hr/>\n\n<p>There is little data in the week ahead, aside from PMI manufacturing and services data Friday. But the markets will keep a close eye on unemployment figures after Thursday’s report of 576,000 new claims — the lowest level since the early days of the pandemic.</p>\n\n<hr/>\n\n<p>“The large claims decline suggests that job separation rates may finally be normalizing, a good sign for April payrolls,” note Barclays economists. A surprise 916,000 jobs were added in March, and economists have said they now expect a string of reports showing payrolls are up by 1 million or more.</p>\n\n<hr/>\n\n<p>However, Stephen Stanley, chief economist at Amherst Pierpont, says it may be too early to read too much into the claims data, and the coming week’s report will be important.</p>\n\n<hr/>\n\n<p>He said the drop in claims was driven by sharp drops in a number of states, including more than half in California and even larger percentage declines in Kentucky and Virginia.</p>\n\n<hr/>\n\n<p>“Unfortunately, I have no confidence that these moves won’t be at least partially reversed next week,” he wrote. “Continuing claims in the special pandemic programs continue to seesaw up and down every week, with the latest reading, for the period ended March 27, being a down week.”</p>\n\n<hr/>\n\n<h1>Watching bonds</h1>\n\n<p>Stock investors will also be watching the bond market, where yields declined in the past week and then reversed. The 10-year Treasury was at 1.59% Friday, after tumbling sharply on Thursday.</p>\n\n<hr/>\n\n<p>Yields move opposite price, and the 10-year is the most widely watched bond security, as it impacts mortgage rates and other loans.</p>\n\n<hr/>\n\n<p>“The 10-year will now trade in the 1.50% to 1.75% trading range,” said Boockvar.</p>\n\n<hr/>\n\n<p>“It’ll break below that if inflation is transitory and it will break above if it’s proven to be otherwise,” he added. “I think we priced in the last inflation stats and then we’ll take into account what the real world is saying, from companies.”</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/c7J5krZ.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/lhy7AaR.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/UW7ZbbU.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/uom4C2h.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/l0cX2LH.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/jpa2DZe.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/PgmZlAV.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/3Rugxjf.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/gmHwRAL.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/po0gflq.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/j0oHK6M.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/jJcd0lq.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/qX9lwYh.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Jvf27dw.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Four Reasons The Future Looks Bright For The Bulls</h1>\n\n<p>“I look to the future because that’s where I’m going to spend the rest of my life.” George Burns</p>\n\n<p>The bull market continues, with the S&amp;P 500 Index now up more than 10% in 2021. With stocks up more than 80% from the March 2020 lows, the reality is a well-deserved break or consolidation could happen at any time. Looking to the future, as George Burns said above, we would be a buyer of any material weakness, as we believe this bull market is alive and well as we’ll discuss more in this blog.</p>\n\n<p>Here are four bullish stats we’ve found recently that indeed suggest this bull market could still have plenty of life left.</p>\n\n<p>First, the S&amp;P 500 Index was up just under 6% in the first quarter, an area we’d call the sweet spot. Looking back since 1950, when the S&amp;P 500 was up between 5-10% in the first quarter, the rest of the year (so the final three quarters) gained another 12.4% on average and was higher 86.7% of the time. Compare this to when the S&amp;P 500 was up &gt;10% in the first quarter and the returns drop to 6.5% the rest of the year. Lastly, if the first quarter was negative, then the rest of the year was up only 3%. Sweet spot indeed.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Second, the December Low Indicator has bulls smiling. This was created by Lucien Hooper, a Forbes columnist in the 1970s, and it simply says that if the S&amp;P 500 closes beneath the December low during the first quarter then future weakness could be in the cards. But if this critical level holds, then higher prices could be around the corner.</p>\n\n<p>As the LPL Chart of the Day shows, stocks held above the December lows in 2021 and this could mean continued higher prices, as the S&amp;P 500 was up more than 18% on average previous years when this level held and incredibly was higher 33 out of 35 years.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-CHart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Third, the S&amp;P 500 was up nearly 54% in the 12 months ending March 2021, one of the largest yearly gains ever. Looking at previous times that had significant 12-month returns shows the potential for weak returns 1, 3, and 6 months later. This makes sense, as stocks could need some time to catch their breath. The good news? One year later the S&amp;P 500 was higher more than 90% of the time, with only the year after the 1987 crash in the red. “It might seem counterintuitive to most investors, but big rallies like we’ve seen tend to mark the start of bull markets, not the end, so we wouldn’t bet on this bull market ending anytime soon,” explained LPL Financial Chief Market Strategist Ryan Detrick.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-CHart-4.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Lastly, overall market breadth is extremely strong. Again, this could suggest near-term there could be an exhaustion point, but this isn’t what you see at the end of bull markets, in fact, it tends to usually happen at the start of new bull markets. Currently, more than 95% of the components in the S&amp;P 500 are above their 200-day moving average, a level only seen two other times, in December 2003 and September 2009. Looking back at 2004 and 2010, 2004 saw consolidation a good part of the year, while 2010 had a well-deserved 16% correction after the huge gains off the March 2009 lows. But the key point is after extreme market breadth like we are seeing now, overall higher prices and the bull market lasted for many more years.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2021/04/4.14.21-Blog-Chart-5.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Looking to the future, as George Burns said, we believe it could be a bright one for equity investors, particularly when we consider the return potential for stocks compared to cash and high-quality bonds.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>B.I.G. Tips - Boom Goes the Retail Sales</h1>\n\n<p>After a lousy report for the month of February when freak weather across the south temporarily shut down several areas of the south, Retail Sales bounced back with a vengeance in March as vaccine rollouts accelerated and stimulus checks were spent.</p>\n\n<p>The moves higher in Retail Sales over the last few months have been incredible. As shown below, while it took 40 months to make a new high following their pre-Financial Crisis peak, COVID only caused a five-month drought without a new high. From the low in April 2020, Retail Sales have bounced 50%!</p>\n\n<p>Even more impressive, though, is not only are total Retail Sales above their pre-COVID peak, but they are more than 17% above that peak just 14 months ago. The second chart shows the 14-month rate of change in Retail Sales since 1992. While the post-COVID decline was the steepest on record, the 14-month gain is the highest on record. Ironically, had it not been for COVID and the stimulus it resulted in, there is no way Retail Sales levels would be where they are now.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/Retail-Sales-14-months.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Growth a Market Cap Story</h1>\n\n<p>Last week, we repeatedly noted how there has been rotation back into growth-oriented sectors like Technology and Consumer Discretionary. For example, mega-cap names like Tesla (TSLA), Apple (AAPL), and Amazon (AMZN) have been some of the top performers in the second quarter whereas they were some of the worst performers in Q1. As a result of the strong performance of these names which all have heavy weights in the S&amp;P 500 Growth ETF (IVW), the ETF has undergone some notable price action over the past couple of weeks. At the start of April, IVW finally broke back above its 50-DMA after repeatedly failing to do so throughout March. Last week, that rally continued as the ETF also broke out above its February highs.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/041221-IVW.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>That sort of strong technical picture is not true for all growth stocks though. Instead, it is more of a market cap story. The Russell 2,000 Growth ETF (IWO) has been stuck in a downtrend over the past few months with another failed attempt to change that last week. Whereas IVW is extremely overbought (at least two standard deviations above its 50-DMA) as of Friday&#39;s close, IWO is trading below its 50-DMA.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/041221-IWO.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>In the chart below we show small-cap growth relative to large-cap growth through the ratio of IWO to IVW. Throughout the fall and winter, small-cap growth had been outpacing its large-cap peers as the ratio shot higher. But in mid-February, the ratio peaked and in the past month, it has more sharply pulled back as a rotation into large-cap growth has taken place. In fact, the ratio has fallen over 10% in the past month! As shown in the second chart below, there have not been many times since the two ETFs began trading in 2000 in which the ratio has fallen as sharply in such a span of time. The most recent instance was one year ago during and in the immediate aftermath of the bear market. Before that, it was almost a decade since the next most recent occurrence.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW-1M-Chg.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<p>With just five prior occurrences, there is not a particularly large sample size for these types of moves, but returns have tended to be strong following past times that the ratio of IWO to IVW has fallen by at least 10 percentage points in a single month. For both ETFs, returns have been stronger than their relative norms over the following weeks and months. Small-cap growth has perhaps performed slightly better on average although that is due to smaller declines following the late 2000 instance. In other words, big outperformance of large-cap growth in the past has been generally good for growth stocks.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/04/041221-IWO-IVW-Perf.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Sell in May??? Post-Election-Year “Worst Months” Mixed</h1>\n\n<p>Our Seasonal Switching Strategy, which is based upon the “Best Six Months” in conjunction with our MACD Technical Buy and Sell Signal signals, has a solid long-term track record of outperformance with potentially less risk compared to a buy and hold approach. Since 1950, DJIA’s average annual gain has been 8.5%. Over the same time period, DJIA has lost an average 0.7% during the “Worst Six Months,” May through October, and gained an average 8.8% during the “Best Six Months,” November through April.</p>\n\n<p>In post-election years, the historically worst performing year of the four-year cycle (page 130, STA 2021), the “Worst Months” have not been all that bad with more positive periods than negative, but average gains over the six or four month (NASDAQ’s Worst Months are July-October) period are still paltry. It is also worth noting that the one election year with a double-digit “Worst Months” S&amp;P 500 gain, 1980, was followed by a tough “Worst Months” in 1981 (shaded in light grey in table).</p>\n\n<h6><strong>(<a href=\"https://www.stocktradersalmanac.com/UploadedImage/AIN_0521_20210415_Worst_Months_by_Election_Cycle_table.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/po0gflq.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/S1pKqwL.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/IAo7GlZ.jpg\">CLICK HERE FOR THIS MONTH&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/SnFSpnl.png\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 4.19.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/j8avW5c.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 4.19.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/LL4z8Pi.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  4.20.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/7FM5dh1.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 4.20.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/qMSF98e.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 4.21.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/jzM0cgh.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 4.21.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/FztoCal.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 4.22.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/3jn4RTu.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 4.22.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/bivztrJ.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 4.23.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/nh8sgYV.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 4.23.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Netflix, Inc. $546.54</h1>\n\n<p><strong>Netflix, Inc. (NFLX)</strong> is confirmed to report earnings at approximately 4:00 PM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $2.98 per share on revenue of $7.13 billion and the Earnings Whisper ® number is $3.04 per share. Investor sentiment going into the company&#39;s earnings release has 75% expecting an earnings beat The company&#39;s guidance was for earnings of approximately $2.97 per share. Consensus estimates are for year-over-year earnings growth of 89.81% with revenue increasing by 23.62%. The stock has drifted lower by 3.3% from its open following the earnings release to be 7.0% above its 200 day moving average of $510.91. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, April 7, 2021 there was some notable buying of 5,037 contracts of the $540.00 call and 5,032 contracts of the $540.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 7.3% move on earnings and the stock has averaged a 6.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=NFLX&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Coca-Cola Company $53.68</h1>\n\n<p><strong>Coca-Cola Company (KO)</strong> is confirmed to report earnings at approximately 6:55 AM ET on Monday, April 19, 2021. The consensus earnings estimate is $0.50 per share on revenue of $8.57 billion and the Earnings Whisper ® number is $0.52 per share. Investor sentiment going into the company&#39;s earnings release has 48% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 1.96% with revenue decreasing by 0.36%. Short interest has increased by 38.6% since the company&#39;s last earnings release while the stock has drifted higher by 6.5% from its open following the earnings release to be 7.0% above its 200 day moving average of $50.17. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, April 15, 2021 there was some notable buying of 10,841 contracts of the $57.50 call expiring on Friday, September 17, 2021. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 1.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=KO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Johnson &amp; Johnson $162.24</h1>\n\n<p><strong>Johnson &amp; Johnson (JNJ)</strong> is confirmed to report earnings at approximately 6:40 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $2.31 per share on revenue of $21.99 billion and the Earnings Whisper ® number is $2.41 per share. Investor sentiment going into the company&#39;s earnings release has 57% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 0.43% with revenue increasing by 6.28%. Short interest has increased by 21.1% since the company&#39;s last earnings release while the stock has drifted lower by 4.4% from its open following the earnings release to be 6.7% above its 200 day moving average of $152.11. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, April 13, 2021 there was some notable buying of 2,687 contracts of the $160.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 2.5% move on earnings and the stock has averaged a 2.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=JNJ&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Cleveland-Cliffs Inc $17.99</h1>\n\n<p><strong>Cleveland-Cliffs Inc (CLF)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Thursday, April 22, 2021. The consensus earnings estimate is $0.51 per share on revenue of $4.16 billion and the Earnings Whisper ® number is $0.36 per share. Investor sentiment going into the company&#39;s earnings release has 79% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1,175.00% with revenue increasing by 1,058.45%. Short interest has decreased by 22.5% since the company&#39;s last earnings release while the stock has drifted higher by 10.0% from its open following the earnings release to be 62.0% above its 200 day moving average of $11.10. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Friday, April 16, 2021 there was some notable buying of 5,991 contracts of the $22.00 call expiring on Friday, May 21, 2021. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CLF&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>AT&amp;T Corp. $29.95</h1>\n\n<p><strong>AT&amp;T Corp. (T)</strong> is confirmed to report earnings at approximately 6:35 AM ET on Thursday, April 22, 2021. The consensus earnings estimate is $0.77 per share on revenue of $42.70 billion and the Earnings Whisper ® number is $0.78 per share. Investor sentiment going into the company&#39;s earnings release has 64% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 8.33% with revenue decreasing by 0.18%. The stock has drifted higher by 2.9% from its open following the earnings release to be 3.1% above its 200 day moving average of $29.05. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, April 7, 2021 there was some notable buying of 160,188 contracts of the $25.00 call expiring on Friday, January 21, 2022. Option traders are pricing in a 3.3% move on earnings and the stock has averaged a 3.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=T&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Procter &amp; Gamble Co. $137.25</h1>\n\n<p><strong>Procter &amp; Gamble Co. (PG)</strong> is confirmed to report earnings at approximately 7:00 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $1.19 per share on revenue of $17.96 billion and the Earnings Whisper ® number is $1.30 per share. Investor sentiment going into the company&#39;s earnings release has 61% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 1.71% with revenue increasing by 4.33%. Short interest has increased by 8.8% since the company&#39;s last earnings release while the stock has drifted higher by 3.6% from its open following the earnings release to be 2.5% above its 200 day moving average of $133.93. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, April 12, 2021 there was some notable buying of 10,373 contracts of the $145.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 1.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=PG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Abbott $124.35</h1>\n\n<p><strong>Abbott (ABT)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $1.33 per share on revenue of $10.73 billion and the Earnings Whisper ® number is $1.37 per share. Investor sentiment going into the company&#39;s earnings release has 75% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 104.62% with revenue increasing by 38.88%. Short interest has increased by 37.2% since the company&#39;s last earnings release while the stock has drifted higher by 7.9% from its open following the earnings release to be 13.6% above its 200 day moving average of $109.50. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, April 15, 2021 there was some notable buying of 3,027 contracts of the $126.00 call expiring on Friday, April 30, 2021. Option traders are pricing in a 3.2% move on earnings and the stock has averaged a 1.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=ABT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Snap Inc. $61.25</h1>\n\n<p><strong>Snap Inc. (SNAP)</strong> is confirmed to report earnings at approximately 4:10 PM ET on Thursday, April 22, 2021. The consensus estimate is for a loss of $0.05 per share on revenue of $742.04 million and the Earnings Whisper ® number is ($0.02) per share. Investor sentiment going into the company&#39;s earnings release has 63% expecting an earnings beat The company&#39;s guidance was for revenue of $720.00 million to $740.00 million. Consensus estimates are for year-over-year earnings growth of 37.50% with revenue increasing by 60.45%. The stock has drifted higher by 8.6% from its open following the earnings release to be 45.0% above its 200 day moving average of $42.23. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Thursday, April 15, 2021 there was some notable buying of 19,755 contracts of the $58.00 call expiring on Friday, May 7, 2021. Option traders are pricing in a 14.9% move on earnings and the stock has averaged a 16.8% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SNAP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Lockheed Martin Corp. $391.81</h1>\n\n<p><strong>Lockheed Martin Corp. (LMT)</strong> is confirmed to report earnings at approximately 7:30 AM ET on Tuesday, April 20, 2021. The consensus earnings estimate is $6.32 per share on revenue of $16.41 billion and the Earnings Whisper ® number is $6.48 per share. Investor sentiment going into the company&#39;s earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 3.95% with revenue increasing by 4.85%. Short interest has increased by 41.2% since the company&#39;s last earnings release while the stock has drifted higher by 15.6% from its open following the earnings release to be 7.7% above its 200 day moving average of $363.71. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. Option traders are pricing in a 2.9% move on earnings and the stock has averaged a 2.2% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=LMT&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>International Business Machines Corp. $133.59</h1>\n\n<p><strong>International Business Machines Corp. (IBM)</strong> is confirmed to report earnings at approximately 4:15 PM ET on Monday, April 19, 2021. The consensus earnings estimate is $1.67 per share on revenue of $17.38 billion and the Earnings Whisper ® number is $1.73 per share. Investor sentiment going into the company&#39;s earnings release has 39% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 9.24% with revenue decreasing by 1.09%. Short interest has increased by 9.8% since the company&#39;s last earnings release while the stock has drifted higher by 10.7% from its open following the earnings release to be 8.3% above its 200 day moving average of $123.31. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Tuesday, April 6, 2021 there was some notable buying of 11,216 contracts of the $145.00 call expiring on Friday, June 18, 2021. Option traders are pricing in a 5.2% move on earnings and the stock has averaged a 4.8% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=IBM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great week ahead <a href=\"/r/stocks\">r/stocks</a>.</p>\n</div><!-- SC_ON -->",
  "score": 141,
  "permalink": "/r/stocks/comments/msqj5s/wall_street_week_ahead_for_the_trading_week/",
  "subreddit": "stocks",
  "id": "msqj5s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526130
}