{
  "author": "OvenInteresting1991",
  "original_created_utc": 1631876158,
  "title": "How can science be objective when humans are limited by their subjective senses? What evidence is there that scientific realism is true, that the laws of physics exist, that the laws of physics describe how the universe works, and that the laws of physics aren't man-made and socially constructed?",
  "created_utc": 1631922146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since humans are limited by their subjectivity and subjective senses, how can science be objective?</p>\n\n<p>Other species see a color, or wavelength differently. Why would the senses of humans perceive objective reality as it is, when other species perceive this reality differently?</p>\n\n<p>What evidence is there for the existence of objectivity and objective reality, a reality that is independent of human minds and senses?</p>\n\n<p>What evidence is there for the existence of oneself, and other objects, be they other humans, other species, tables, chairs, bicycles, baseball bats, roads, cars, trees, rocks, the Earth, the moon, the other planets, the stars, the universe, etc, etc?</p>\n\n<p>What about the laws of physics? What evidence is there that the laws of physics are objective, independent of the human minds and senses, and that the universe operates in certain ways and follows certain laws?</p>\n\n<p>How would scientific realism respond to these questions?</p>\n\n<p>Is it conceited and egotistical to believe human senses perceive reality as it is, or at least perceive a close approximation to the truth and objective reality?</p>\n\n<p>I wish to acknowledge instruments. We can’t see infra-red light or x-rays, or radio-waves, but we can detect them with instruments. Perception of reality is not only what we can sense, but what we can measure.</p>\n\n<p>But technical instruments might shift the problem without answering the question in principle.</p>\n\n<p>Even if we use elaborate instruments to perceive the whole light spectrum, it is our biased, subjective mind that makes sense of this information - disregarding some information, highlighting other information.</p>\n\n<p>This last step is unlikely to be objective and opens the discussion on whether or not we can perceive reality as it is.</p>\n\n<p>Having asked these questions on the science subreddits, the majority of so-called &quot;science enthusiasts&quot; seemed to be anti-realists, believing that it&#39;s conceited and egotistical to believe we know anything about how the universe works, and that there’s a 0% chance we are seeing things as they really are.</p>\n\n<p>There is an article claiming &quot;there are no laws of physics&quot; for instance. The title can make one think the laws of physics are subjective and man-made, that the universe does not follow certain laws: <a href=\"https://www.quantamagazine.org/there-are-no-laws-of-physics-theres-only-the-landscape-20180604/\">https://www.quantamagazine.org/there-are-no-laws-of-physics-theres-only-the-landscape-20180604/</a></p>\n\n<p>&quot;How conceited and egotistical can you be to believe you know the laws of the universe and how the universe works? There is no universe-police, planet-police. The universe is not a citizen following certain laws. It has no laws. The laws of physics are man-made. And science is subjective because humans are subjects and subjective. There is no objective reality for subjects. Objectivity is for objects, not subjects&quot;, the &quot;science enthusiasts&quot; of science subreddits would claim.</p>\n\n<p>What are the arguments against those claims?</p>\n\n<p>During another conversation I had with someone, who has an undergraduate degree in physics, they claimed the laws of physics do not describe how the universe works:</p>\n\n<blockquote>\n<p>People have assigned &quot;laws&quot; to the universe. They are incomplete and inconsistent with each other. How can you then say the universe is &quot;organized&quot;.  </p>\n\n<p>We have no idea if they are the &quot;laws of the universe&quot;. Physics is applied math. It is not proof that the universe works in some particular way.  </p>\n\n<p>The universe is stranger than the theories we have created to describe what we have observed.  </p>\n\n<p>The maths frequently break down and cannot describe things in all parts of the universe. Think of the singularities that pop up in the math when describing black holes.  </p>\n\n<p>Many theories are incompatible with each other, such as quantum mechanics and gravity (which isn&#39;t even a real force, but quantum gravity theories need a gravitation to to mediate the force of gravitational interaction).  </p>\n\n<p>What did I learn in my undergraduate degree? A lot of math. I learned many theories. Many of which are no longer valid for many situations, and most are only valid assuming a great number of simplifications. Most of it is fitting lines to blobs of dots on a graph, and at the end of the day it&#39;s a big house of cards. None of the theories will tell you the true nature of the universe---whatever that is. It&#39;s just how we think it may work.</p>\n</blockquote>\n\n<p>&quot;People assigned laws to the universe&quot; implies humans made up the laws of physics, that the universe either has no laws, or has different laws.</p>\n\n<p>The &quot;science enthusiasts&quot; of science subreddits too have claimed time and time again that &quot;the laws of physics are man-made. They don&#39;t exist&quot;.</p>\n\n<p>They have gone as far as to claim &quot;gravity doesn&#39;t exist&quot;, confusing me further.</p>\n\n<p>Does scientific realism have any arguments against the claims presented above?</p>\n\n<p>Do the laws of physics exist, and do they describe how the universe works? Why are they incomplete and why do they contradict each other if they exist?</p>\n\n<p>What evidence is there that the laws of physics exist, that the laws of physics describe how the universe works, and that the laws of physics aren&#39;t man-made and socially constructed?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/ppxwu0/how_can_science_be_objective_when_humans_are/",
  "subreddit": "askphilosophy",
  "id": "ppxwu0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Since humans are limited by their subjectivity and subjective senses, how can\nscience be objective?\n\nOther species see a color, or wavelength differently. Why would the senses of\nhumans perceive objective reality as it is, when other species perceive this\nreality differently?\n\nWhat evidence is there…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人間は主観と主観的な感覚によって制限されているので、科学はどうやって\n科学は客観的になりうるのか？\n\n他の種族では、色や波長の見え方が違います。なぜ、人間の感覚では\n人間の感覚は客観的な現実をありのままに認識しているのに、他の生物はこのように認識している。\nなぜ人間の感覚は客観的な現実をそのまま認識するのでしょうか？\n\nどんな根拠があるのか...。",
      "title": "人間が主観的な感覚に縛られているのに、科学が客観的であるはずがない。科学的実在論が真実であること、物理学の法則が存在すること、物理学の法則が宇宙の仕組みを説明していること、物理学の法則が人為的・社会的に構築されたものではないことを示す証拠は何かありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "既然人类受到其主观性和主观感官的限制，那么，科学如何能够\n科学是客观的？\n\n其他物种看到的颜色，或波长是不同的。为什么人类的感官会\n为什么人类的感官会感知到客观现实，而其他物种对这一现实的感知却不同？\n现实是不同的？\n\n有什么证据...",
      "title": "当人类受到主观感官的限制时，科学怎么可能是客观的？有什么证据表明科学现实主义是真实的，物理学定律是存在的，物理学定律描述了宇宙的运作方式，而且物理学定律不是人为和社会构建的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "既然人類受到其主觀性和主觀感官的限制，那麼，科學如何能夠\n科學是客觀的？\n\n其他物種看到的顏色，或波長是不同的。爲什麼人類的感官會\n爲什麼人類的感官會感知到客觀現實，而其他物種對這一現實的感知卻不同？\n現實是不同的？\n\n有什麼證據...",
      "title": "當人類受到主觀感官的限制時，科學怎麼可能是客觀的？有什麼證據表明科學現實主義是真實的，物理學定律是存在的，物理學定律描述了宇宙的運作方式，而且物理學定律不是人爲和社會構建的？"
    }
  ]
}