{
  "author": "jxcartier",
  "the_new_excerpt": "I read online somewhere about \"pasca\" being a caffeine-less \"pick-me-up\" drink\nthat the Romans drank for refreshment and got curious. I looked it up and found\nmany dozens of recipes online, and they all described a drink from water,\nvinegar, and various miscellaneous ingredients, usually including…",
  "original_created_utc": 1619137199,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマ人が飲んでいたカフェインの入っていない「元気が出る」飲み物「パスカ」の話をネットで読んで\nローマ人が気分転換に飲んでいたという話をネットで読んで気になったので 調べてみると\n調べてみると、何十ものレシピが載っていて、どれも水と酢と様々な雑多なものからなる飲み物だと書かれていました。\n酢、そして様々な雑多な材料からなる飲み物が書かれていましたが、たいていは...",
      "title": "飲み物「パスカ」は、本当にローマ人にとって「元気の出る飲み物」だったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在网上看到一些关于 \"pasca \"是一种不含咖啡因的 \"提神 \"饮料\n罗马人喝这种饮料是为了提神，我很好奇。我查了一下，发现\n他们都描述了一种由水、醋和各种杂物组成的饮料。\n他们都描述了一种由水、醋和各种杂项成分组成的饮料，通常包括...",
      "title": "饮料 \"pasca \"真的是罗马人的 \"提神剂 \"吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在網上看到一些關於 \"pasca \"是一種不含咖啡因的 \"提神 \"飲料\n羅馬人喝這種飲料是爲了提神，我很好奇。我查了一下，發現\n他們都描述了一種由水、醋和各種雜物組成的飲料。\n他們都描述了一種由水、醋和各種雜項成分組成的飲料，通常包括...",
      "title": "飲料 \"pasca \"真的是羅馬人的 \"提神劑 \"嗎？"
    }
  ],
  "title": "Was the beverage \"pasca\" really a \"pick-me-up\" for Romans?",
  "created_utc": 1619183692,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read online somewhere about &quot;pasca&quot; being a caffeine-less &quot;pick-me-up&quot; drink that the Romans drank for refreshment and got curious.  I looked it up and found many dozens of recipes online, and they all described a drink from water, vinegar, and various miscellaneous ingredients, usually including honey.</p>\n\n<p>The recipe I ended up using, which is based on one I found with my own touches, is this:</p>\n\n<p>*Pasca&quot;</p>\n\n<p>(1 serving - 2 min prep time or less)</p>\n\n<p>Ingredients:</p>\n\n<ul>\n<li>10 oz of room temperature water</li>\n<li>1/2 tbsp red wine vinegar</li>\n<li>1-1/2 tbsp honey</li>\n<li>2 dashes salt</li>\n<li>2 dashes pepper</li>\n<li>1 tsp of ground cloves or cinnamon</li>\n<li>Optional: small splash of lemon</li>\n</ul>\n\n<p>To prepare:</p>\n\n<ul>\n<li>Pour the honey onto the bottom of the glass or mug you will drink from.</li>\n<li>Microwave on high for 15 sec</li>\n<li>Pour water into glass, stir and dissolve the honey</li>\n<li>Add vinegar, stir again</li>\n<li>Add salt, pepper, spice; stir one last time</li>\n<li>Add lemon juice to top it off</li>\n</ul>\n\n<p>I&#39;ve had this a few times now, and here&#39;s my opinion:</p>\n\n<ul>\n<li>it&#39;s good</li>\n<li>it&#39;s thirst-quenching</li>\n<li>it really is a pick-me-up.</li>\n</ul>\n\n<p>I can definitely see how the vinegar would be useful to disinfect water, how honey would replenish energy, how salt would stabilize electrolytes, and the spices make it all really tasty and exotic. But to my question: did the Romans really drink this &quot;pasca&quot; habitually? If so, who and when?  Athletes? Soldiers? It seems like an ancient form of Gatorade, after a fashion.</p>\n\n<p>It also strikes me as totally healthy and refreshing, even with a modern palate, so it&#39;s surprising to me that the West would have forgotten about this drink.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/mwisvk/was_the_beverage_pasca_really_a_pickmeup_for/",
  "subreddit": "AskHistorians",
  "id": "mwisvk",
  "is_self": true,
  "media": null,
  "is_video": false
}