{
  "author": "gilgamesh_20",
  "original_created_utc": 1631262900,
  "title": "It's ridiculous how I am being judged for putting money in crypto by the people who waste the same amount of money in useless things.",
  "created_utc": 1631273447,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a small investor and got into crypto recently.  Crypto is the best thing that happened to me. I could finally put the money kept stagnant in my bank to good use.</p>\n\n<p>After getting into crypto, I started saving money like crazy. Instead of spending on expensive clothing, junk foods etc etc I started buying crypto.</p>\n\n<p>The guys who spend money on stupid things call me stupid for buying crypto lol. What is wrong with buying crypto for $50 instead of buying sneakers? What&#39;s wrong in buying something that could make me more money rather than buying stupid stuff which will probably lose value?</p>\n\n<p>Don&#39;t talk about crypto with anyone. I got all kinds of &quot;advice&quot; cause I accidentally opened the charts. Ah I&#39;m pissed.</p>\n</div><!-- SC_ON -->",
  "score": 379,
  "permalink": "/r/CryptoCurrency/comments/plh1n2/its_ridiculous_how_i_am_being_judged_for_putting/",
  "subreddit": "CryptoCurrency",
  "id": "plh1n2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a small investor and got into crypto recently. Crypto is the best thing that\nhappened to me. I could finally put the money kept stagnant in my bank to good\nuse.\n\nAfter getting into crypto, I started saving money like crazy. Instead of\nspending on expensive clothing, junk foods etc etc I started…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は小規模な投資家で、最近、暗号に手を出しました。暗号は私に起こった最高の出来事です。\n私にとって最高の出来事でした。銀行に滞留していたお金をようやく有効に使えるようになりました。\n使うことができました。\n\n暗号に参入した後、私は狂ったようにお金を貯め始めました。代わりに\n高価な服やジャンクフードなどに使う代わりに、私は...",
      "title": "同じ額のお金を無駄なものに浪費している人たちから、暗号にお金をつぎ込んだ私が批判されるのは馬鹿げています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个小投资者，最近进入了加密货币领域。加密货币是发生在我身上的最好的事情。\n发生在我身上。我终于可以把停滞在银行里的钱用在好的地方了。\n用。\n\n进入加密货币后，我开始疯狂地存钱。而不是\n花费在昂贵的衣服和垃圾食品上，等等，我开始...",
      "title": "我把钱放在加密货币上，却被那些把同样的钱浪费在无用的东西上的人评头论足，这真是可笑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個小投資者，最近進入了加密貨幣領域。加密貨幣是發生在我身上的最好的事情。\n發生在我身上。我終於可以把停滯在銀行裏的錢用在好的地方了。\n用。\n\n進入加密貨幣後，我開始瘋狂地存錢。而不是\n花費在昂貴的衣服和垃圾食品上，等等，我開始...",
      "title": "我把錢放在加密貨幣上，卻被那些把同樣的錢浪費在無用的東西上的人評頭論足，這真是可笑。"
    }
  ]
}