{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "This is because the post that recently was made about PLTR sbc was low quality. So here's a better more honest analysis of SBC and a look into the companies current prospects.\n\n\n\nFirstly regarding Palantir. Their leadership is incredible. 90% commercial growth YoY. 50% overall YoY growth and a guidance of 30% growth through 2025 that is totally sandbagged and going to get beaten easily next earnings. \n\nThey have 0$ in debt.  Zero fucking dollars in debt. \n\nRoughly 2.5 billion in cash including 50 million in gold because they're so diversified \n\nHundreds of millions in start up investments\n\n3.5 billion in remaining money coming in from contracts (meaning they could stop doing business and still pull in 3.5 billion first) \n\nStock based compensation has gone down significantly in last two quarters. \n\nStock based compensation is completely comparable to other companies in similar fields or in tech. \n\nIt's not just for their executives it's a fantastic way to incentivize all employees existing and future to stay with the company for the long run by granting shares. \n\nStock based compensation doesn't equal them selling shares. It means granting shares. You're equating it with mostly Alex Karp and a few other leaders doing PRE SCHEDULED tax sales of shares because he's as part of going public (he has almost 10% ownership) the government is taxing him as if going public means he owes taxes on billions of dollars that he ONLY has in shares. In order to cover this he and others sell shares on a pre determined schedule so they don't go to jail with the IRS.\n\n\nIt has nothing to do with their commitment to the company or their leadership or their faith in the future. If you had any idea what you were talking about you'd realize none of them have really changed their overall stake in the company which is basically what your post alleges is that they're just printing money and getting out dishonestly which couldn't be further from the truth. \n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4441572-palantir-the-truth-about-its-stock-based-comp\n\nHere's one HONEST analysis not hype bear fud. \n\n\nNothing is uniquely negative about PLTRs stock based compensation and it's a very good long term tool for growing a company that has only been public for about a year so what can you really expect at such a stage. It's total dilution amounted to about 10% . Retail traders own 75% of this stock and have sold off well over 10% many times over the FUD from this shitty narrative. \n\n\n-\n-\n-\nHere's some general insight into the company \n\n\nThe company is NOT a 20 year company that has never been profitable. What they were doing 20 years ago for the government is barely comparable to the company today. Foundry (their flagship product for both commercial and even government partners) has basically only existed for about 2 years and has even undergone significant improvements even in the last years that will guarantee great margins and efficient delivery. They continually built the company under a growth model taking in revenue, hiring the BEST engineers ask anyone who studied coding and software in any large schools around the country between 2005-now these guys have always had a legendary reputation with engineers students would wear palantir t shirts and shit constantly because they were the place that was actually doing cutting edge software work. They always reinvested over and over growing the government side while working on perfecting their current new products for over a decade making Foundry and the apollo AI framework that now allows them to actually deploy Foundry cheaply. \n\n\n\nLets even take a look at recent earnings. Quarter prior international growth was 17% So at most recent quarter 28% international growth they posted a pretty excellent QoQ increase. It suggests growth is picking up everywhere. Also I think the fact that they've done immense hiring in the short term plays into both why SBC is being kept high and why some margins were less than Q1. Most of the hiring they've done started in Q2 and only really picked up steam into the middle of the year. Let's also realize that the hiring has been almost entirely focused on distribution employees so they're very clearly moving into much greater expectations and focus of sales than they ever have in the history of their company. Peter Thiel actually has incredibly long explanations of how he thinks the optimal way to build a software companywide is to give as little focus on distribution as possible for as long as possible. This year's hiring is a dramatic indication that they're moving to a new stage as a company. \n\nAlso the fact that their product keeps improving even quarter to quarter. They're constantly saying that they themselves are continually finding new ways and more importantly new industries that Foundry and Appllo can enter and be extremely useful. The perfect example of this was the exciting and very recent development of their meta constellation satellite work that they're now doing. \n\nI think the reason the stock jumped 10% on earnings and now a lot more since was a direct reaction to the evidence that there is no industry they aren't relevant in for software and they're definitely only at the beginning of entering many industries. \n\nRecent announcements like Foundry for builders or startups more accurately is another reason for the stocks rise because it was argued for a very long time that they would never be viable at offering their product to anything other than extremely large companies. Most importantly was that at the end of Q1 they announced that they were going to be offering Foundry for free as a way to get it into the hands of more companies it seemed very clear as investors to expect this as a short term damper on margins. The idea is that it would get their product into so many more hands that it would be worth it in the long term with a very obvious temporary effect on margins. The fact that client growth both US AND internationally is accelerating not decelerating points to the idea that their distribution network is at its beginning but it is working and I assert extremely high odds that client growth continues to accelerate for consecutive quarters for a long time. \n\nThey will easily do more than 400 million revenue at next quarters report easily beat guidance and the one benefit to where SBC has been is that it is very likely it decreases potentially even dramatically decreases. Their trajectory is very predictable currently and they are a company that eventually will be a necessity to use if businesses don't want to get out competed. One of their main benefits to their customer companies is increasing margins of customers by finding many inefficiencies so they're one of the few products that can increase your bottom line without making you do anything as a company. This means that even during economic downturn they will be strongly potentially even more in demand because companies will need ways to look better and show cash flow even when consumption declines for periods of time.\n\n\n\nIf you want to understand the history of the company or what they do they're basically a SaaS company (yes SaaS their margins are good enough and they're only going to improve as they focus more and more outside of government Gotham products) \n\nTheir software allows you to run your company through their platform and it keeps your data completely private. Meaning palantir doesn't see your data and mine information and neither does anyone else. You get better illustrations and representations of your companies affairs and it makes significant insights and determines ways to create better efficiency, heads up preemptive solutions before problems occur, and in many cases can bring so many data sets into play that you can learn things you didnt even know were possible. \n\nIf you want resources for this there are a number of testimonials from customers describing what Foundry does for them on Palantirs youtube\n\nYou can go search Tom Nashs video on SkyWise (which is Foundry for airbus). He has a couple of them really incredible deep dive\n\nYou can watch their most recent video about meta satellite constellations\n\nThey have partners within every industry. Research, academics, science, cancer, genomics, aerospace, literally every military branch, health care both insurance providers and health care providers like the NHS, also NIH, big oil companies like BP, big manufacturers like 3m, faurecia, Rio Tinto mining, John deere, big retailers like bass pro and others even larger, news media companies, robotics, AI, autonomous driving like wejo partnered with gm on that, electronic vehicle startups and even electronic flying vehicle start ups, now satellite companies and US Government satellite ownership even. Do you see where this is going? There's nothing they can't break into and they are what is going to be necessary to have a competitive edge which is why everyone is going to have to use them. \n\n\nWhich brings me to another point. Palantir doesn't have direct competition. They've explained this many times and anyone who says they are a snowflake competitor doesn't understand them as a company at all. Their competition is potential clients who choose to attempt to make an in house software to glean insights into their own data and structure it uniquely for their own needs. This is Palantirs biggest \"competition\" and they will crush it. That kind of work often takes years and is extremely expensive. Just the time that Palantir can save companies and the headaches of making all the mistakes that come with originally building a software like that makes Palantir worth it. \n\nThey have incredible partnerships with Amazon and IBM for new and important distribution channels for getting their products out and quickly and have stated many times that they can deploy their software completely remotely cutting out the old concern that they will never scale because they need forward deployed engineers to set up software. They still use those but I think it's heavily around massive clients and particularly US gov gotham products not Foundry as we now know it. \n\nSick of this ridiculous SBC destroying value garbage narrative. We'll see how much value is destroyed in a year when their stock explodes and you'll be wishing you didn't listen to the geniuses who thought they caught Palantir swindling everyone. Also all the people who didn't get swindled by the bear narratives this year are fucking happy as hell because most of them have at least doubled their positions over the last 6 months as the stock constantly traded in a holding pattern. \n\nLast point is its holding key resistance right now could easily break out in the short term towards 30$ or beyond. Don't say I didn't warn you. If it holds this 26$ mark and doesn't break down below it this month you'll never see PLTR under 24 dollars again and after next earnings I guarantee you'll never see it under 30$ again.",
  "author_fullname": "t2_exycv",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Palantir stock based compensation rebuttal and general analysis",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickerdiscussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_piysfx",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.77,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 244,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Discussion",
  "can_mod_post": false,
  "score": 244,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1630932513,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is because the post that recently was made about PLTR sbc was low quality. So here&#39;s a better more honest analysis of SBC and a look into the companies current prospects.</p>\n\n<p>Firstly regarding Palantir. Their leadership is incredible. 90% commercial growth YoY. 50% overall YoY growth and a guidance of 30% growth through 2025 that is totally sandbagged and going to get beaten easily next earnings. </p>\n\n<p>They have 0$ in debt.  Zero fucking dollars in debt. </p>\n\n<p>Roughly 2.5 billion in cash including 50 million in gold because they&#39;re so diversified </p>\n\n<p>Hundreds of millions in start up investments</p>\n\n<p>3.5 billion in remaining money coming in from contracts (meaning they could stop doing business and still pull in 3.5 billion first) </p>\n\n<p>Stock based compensation has gone down significantly in last two quarters. </p>\n\n<p>Stock based compensation is completely comparable to other companies in similar fields or in tech. </p>\n\n<p>It&#39;s not just for their executives it&#39;s a fantastic way to incentivize all employees existing and future to stay with the company for the long run by granting shares. </p>\n\n<p>Stock based compensation doesn&#39;t equal them selling shares. It means granting shares. You&#39;re equating it with mostly Alex Karp and a few other leaders doing PRE SCHEDULED tax sales of shares because he&#39;s as part of going public (he has almost 10% ownership) the government is taxing him as if going public means he owes taxes on billions of dollars that he ONLY has in shares. In order to cover this he and others sell shares on a pre determined schedule so they don&#39;t go to jail with the IRS.</p>\n\n<p>It has nothing to do with their commitment to the company or their leadership or their faith in the future. If you had any idea what you were talking about you&#39;d realize none of them have really changed their overall stake in the company which is basically what your post alleges is that they&#39;re just printing money and getting out dishonestly which couldn&#39;t be further from the truth. </p>\n\n<p><a href=\"https://www.google.com/amp/s/seekingalpha.com/amp/article/4441572-palantir-the-truth-about-its-stock-based-comp\">https://www.google.com/amp/s/seekingalpha.com/amp/article/4441572-palantir-the-truth-about-its-stock-based-comp</a></p>\n\n<p>Here&#39;s one HONEST analysis not hype bear fud. </p>\n\n<p>Nothing is uniquely negative about PLTRs stock based compensation and it&#39;s a very good long term tool for growing a company that has only been public for about a year so what can you really expect at such a stage. It&#39;s total dilution amounted to about 10% . Retail traders own 75% of this stock and have sold off well over 10% many times over the FUD from this shitty narrative. </p>\n\n<h2></h2>\n\n<h2></h2>\n\n<h2></h2>\n\n<p>Here&#39;s some general insight into the company </p>\n\n<p>The company is NOT a 20 year company that has never been profitable. What they were doing 20 years ago for the government is barely comparable to the company today. Foundry (their flagship product for both commercial and even government partners) has basically only existed for about 2 years and has even undergone significant improvements even in the last years that will guarantee great margins and efficient delivery. They continually built the company under a growth model taking in revenue, hiring the BEST engineers ask anyone who studied coding and software in any large schools around the country between 2005-now these guys have always had a legendary reputation with engineers students would wear palantir t shirts and shit constantly because they were the place that was actually doing cutting edge software work. They always reinvested over and over growing the government side while working on perfecting their current new products for over a decade making Foundry and the apollo AI framework that now allows them to actually deploy Foundry cheaply. </p>\n\n<p>Lets even take a look at recent earnings. Quarter prior international growth was 17% So at most recent quarter 28% international growth they posted a pretty excellent QoQ increase. It suggests growth is picking up everywhere. Also I think the fact that they&#39;ve done immense hiring in the short term plays into both why SBC is being kept high and why some margins were less than Q1. Most of the hiring they&#39;ve done started in Q2 and only really picked up steam into the middle of the year. Let&#39;s also realize that the hiring has been almost entirely focused on distribution employees so they&#39;re very clearly moving into much greater expectations and focus of sales than they ever have in the history of their company. Peter Thiel actually has incredibly long explanations of how he thinks the optimal way to build a software companywide is to give as little focus on distribution as possible for as long as possible. This year&#39;s hiring is a dramatic indication that they&#39;re moving to a new stage as a company. </p>\n\n<p>Also the fact that their product keeps improving even quarter to quarter. They&#39;re constantly saying that they themselves are continually finding new ways and more importantly new industries that Foundry and Appllo can enter and be extremely useful. The perfect example of this was the exciting and very recent development of their meta constellation satellite work that they&#39;re now doing. </p>\n\n<p>I think the reason the stock jumped 10% on earnings and now a lot more since was a direct reaction to the evidence that there is no industry they aren&#39;t relevant in for software and they&#39;re definitely only at the beginning of entering many industries. </p>\n\n<p>Recent announcements like Foundry for builders or startups more accurately is another reason for the stocks rise because it was argued for a very long time that they would never be viable at offering their product to anything other than extremely large companies. Most importantly was that at the end of Q1 they announced that they were going to be offering Foundry for free as a way to get it into the hands of more companies it seemed very clear as investors to expect this as a short term damper on margins. The idea is that it would get their product into so many more hands that it would be worth it in the long term with a very obvious temporary effect on margins. The fact that client growth both US AND internationally is accelerating not decelerating points to the idea that their distribution network is at its beginning but it is working and I assert extremely high odds that client growth continues to accelerate for consecutive quarters for a long time. </p>\n\n<p>They will easily do more than 400 million revenue at next quarters report easily beat guidance and the one benefit to where SBC has been is that it is very likely it decreases potentially even dramatically decreases. Their trajectory is very predictable currently and they are a company that eventually will be a necessity to use if businesses don&#39;t want to get out competed. One of their main benefits to their customer companies is increasing margins of customers by finding many inefficiencies so they&#39;re one of the few products that can increase your bottom line without making you do anything as a company. This means that even during economic downturn they will be strongly potentially even more in demand because companies will need ways to look better and show cash flow even when consumption declines for periods of time.</p>\n\n<p>If you want to understand the history of the company or what they do they&#39;re basically a SaaS company (yes SaaS their margins are good enough and they&#39;re only going to improve as they focus more and more outside of government Gotham products) </p>\n\n<p>Their software allows you to run your company through their platform and it keeps your data completely private. Meaning palantir doesn&#39;t see your data and mine information and neither does anyone else. You get better illustrations and representations of your companies affairs and it makes significant insights and determines ways to create better efficiency, heads up preemptive solutions before problems occur, and in many cases can bring so many data sets into play that you can learn things you didnt even know were possible. </p>\n\n<p>If you want resources for this there are a number of testimonials from customers describing what Foundry does for them on Palantirs youtube</p>\n\n<p>You can go search Tom Nashs video on SkyWise (which is Foundry for airbus). He has a couple of them really incredible deep dive</p>\n\n<p>You can watch their most recent video about meta satellite constellations</p>\n\n<p>They have partners within every industry. Research, academics, science, cancer, genomics, aerospace, literally every military branch, health care both insurance providers and health care providers like the NHS, also NIH, big oil companies like BP, big manufacturers like 3m, faurecia, Rio Tinto mining, John deere, big retailers like bass pro and others even larger, news media companies, robotics, AI, autonomous driving like wejo partnered with gm on that, electronic vehicle startups and even electronic flying vehicle start ups, now satellite companies and US Government satellite ownership even. Do you see where this is going? There&#39;s nothing they can&#39;t break into and they are what is going to be necessary to have a competitive edge which is why everyone is going to have to use them. </p>\n\n<p>Which brings me to another point. Palantir doesn&#39;t have direct competition. They&#39;ve explained this many times and anyone who says they are a snowflake competitor doesn&#39;t understand them as a company at all. Their competition is potential clients who choose to attempt to make an in house software to glean insights into their own data and structure it uniquely for their own needs. This is Palantirs biggest &quot;competition&quot; and they will crush it. That kind of work often takes years and is extremely expensive. Just the time that Palantir can save companies and the headaches of making all the mistakes that come with originally building a software like that makes Palantir worth it. </p>\n\n<p>They have incredible partnerships with Amazon and IBM for new and important distribution channels for getting their products out and quickly and have stated many times that they can deploy their software completely remotely cutting out the old concern that they will never scale because they need forward deployed engineers to set up software. They still use those but I think it&#39;s heavily around massive clients and particularly US gov gotham products not Foundry as we now know it. </p>\n\n<p>Sick of this ridiculous SBC destroying value garbage narrative. We&#39;ll see how much value is destroyed in a year when their stock explodes and you&#39;ll be wishing you didn&#39;t listen to the geniuses who thought they caught Palantir swindling everyone. Also all the people who didn&#39;t get swindled by the bear narratives this year are fucking happy as hell because most of them have at least doubled their positions over the last 6 months as the stock constantly traded in a holding pattern. </p>\n\n<p>Last point is its holding key resistance right now could easily break out in the short term towards 30$ or beyond. Don&#39;t say I didn&#39;t warn you. If it holds this 26$ mark and doesn&#39;t break down below it this month you&#39;ll never see PLTR under 24 dollars again and after next earnings I guarantee you&#39;ll never see it under 30$ again.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7b84f",
  "id": "piysfx",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "sublette313",
  "discussion_type": null,
  "num_comments": 16,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/piysfx/palantir_stock_based_compensation_rebuttal_and/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/piysfx/palantir_stock_based_compensation_rebuttal_and/",
  "subreddit_subscribers": 3022728,
  "created_utc": 1630943058,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1630932513,
  "the_new_excerpt": "This is because the post that recently was made about PLTR sbc was low quality.\nSo here's a better more honest analysis of SBC and a look into the companies\ncurrent prospects.\n\nFirstly regarding Palantir. Their leadership is incredible. 90% commercial\ngrowth YoY. 50% overall YoY growth and a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは、最近行われたPLTR SBCに関する投稿が低品質だったためです。\nそこで、ここではSBCをより正直に分析し、会社の現在の展望を見てみたいと思います。\n現在の展望を紹介します。\n\nまず、Palantirについて。彼らのリーダーシップは素晴らしいものです。90%の商業的\n前年比90％の商業的成長。全体では前年比50％の成長、そして...",
      "title": "Palantir社の株式ベースの報酬に関する反論と一般的な分析"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是因为最近关于PLTR sbc的帖子是低质量的。\n因此，这里有一个更好的对SBC的更诚实的分析和对公司的考察\n目前的前景。\n\n首先关于Palantir。他们的领导力是令人难以置信的。90%的商业\n年增长。50%的整体同比增长和一个...",
      "title": "Palantir公司基于股票的补偿的反驳和一般分析"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是因爲最近關於PLTR sbc的帖子是低質量的。\n因此，這裏有一個更好的對SBC的更誠實的分析和對公司的考察\n目前的前景。\n\n首先關於Palantir。他們的領導力是令人難以置信的。90%的商業\n年增長。50%的整體同比增長和一個...",
      "title": "Palantir公司基於股票的補償的反駁和一般分析"
    }
  ],
  "source_updated_at": 1631266802144
}