{
  "author": "DukeThom",
  "original_created_utc": 1655857475,
  "title": "Where are all the women?",
  "created_utc": 1655886982,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Think of all the people you know in RL that are into Crypto, what % of them are women? It’s probably a very low percentage.. why is that? &lt;/p&gt;\n\n&lt;p&gt;We spend a lot of time talking about mass adoption, but idk if I’ve heard many people comment on this topic, which to me, is a super glaring one (women make up 50-52% of the world population). &lt;/p&gt;\n\n&lt;p&gt;I’m curious why there aren’t more women in the crypto space? &amp;amp; what can we do to help grow that % as a community?&lt;/p&gt;\n\n&lt;p&gt;As a side: I come from SaaS, so I understand this is similar to how the tech industry started / still is on a lot of ways.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 339,
  "permalink": "/r/CryptoCurrency/comments/vhrtlv/where_are_all_the_women/",
  "subreddit": "CryptoCurrency",
  "id": "vhrtlv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Think of all the people you know in RL that are into Crypto, what % of them are\nwomen? It’s probably a very low percentage.. why is that?\n\nWe spend a lot of time talking about mass adoption, but idk if I’ve heard many\npeople comment on this topic, which to me, is a super glaring one (women make…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "RLで知っている人の中でCryptoに夢中になっている人は何％いるか考えてみてください。\n女性でしょうか？おそらく非常に低い割合でしょう。なぜでしょう？\n\n私たちは大量導入について多くの時間を費やしていますが、多くの人がそのようなことを\nこのトピックについてコメントした人はあまりいないかもしれません。",
      "title": "女性はどこにいる？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "想一想你在RL中认识的所有对加密货币感兴趣的人，他们中有多少百分比是\n女性？这可能是一个非常低的百分比......这是为什么？\n\n我们花了很多时间讨论大规模采用的问题，但我不知道我是否听到过很多人评论这个话题。\n人评论这个话题，对我来说，这是一个超级突出的问题（女性使...",
      "title": "所有的女性都在哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "想一想你在RL中認識的所有對加密貨幣感興趣的人，他們中有多少百分比是\n女性？這可能是一個非常低的百分比......這是爲什麼？\n\n我們花了很多時間討論大規模採用的問題，但我不知道我是否聽到過很多人評論這個話題。\n人評論這個話題，對我來說，這是一個超級突出的問題（女性使...",
      "title": "所有的女性都在哪裏？"
    }
  ]
}