{
  "author": "president_solo",
  "original_created_utc": 1626203710,
  "title": "Parents' restaurant is being wrongfully review-attacked by a TikTok \"influencer\". Is there a way to have google temporarily pause reviews for this?",
  "created_utc": 1626235164,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I honestly don&#39;t know what to do with this situation. My parents immigrated from their country to escape extreme civil hardship in the land. They gave me a life in the US, and I&#39;d like to think I am making the most of the opportunities I have because of them. </p>\n\n<p>They made a successful restaurant. Pretty much perfect hundreds of 5-star reviews at both locations for over a decade now. </p>\n\n<p>Out of the blue, a few days ago, a tiktokker came in. She falsely made claims that my parents&#39; restaurant is racist <em>to its own native people</em> and that they only serve whites. She is literally trying to cancel the only restaurant in the city that represents her very own people.</p>\n\n<p>So, my parents&#39; place is being bombarded with 1-star reviews because of this one-sided story. It&#39;s tearing my mom&#39;s heart apart because this restaurant is all she ever wanted. Is there anything I can do to stop this? Any advice I can relay to them?</p>\n\n<p>They are so so so not racist, my parents are the kindest people I know and have literally built a school in their homeland and they can&#39;t wait to retire and move back. Yet, someone thinks they&#39;re racist against their own people.</p>\n\n<hr/>\n\n<p>Edit: Thanks everyone for the responses. Never been in a situation like this, I usually am able to research my way through things but I couldn&#39;t find a way to navigate this without a subreddit like this. I&#39;ve been spending time contacting support on Google/ Yelp. I won&#39;t be doing anything to her socials.</p>\n\n<p>I&#39;m thankful for the requests for me to share the restaurant so you can visit/review, but unfortunately revealing the name would make me identifiable (military so not ideal).</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/ojmok7/parents_restaurant_is_being_wrongfully/",
  "subreddit": "NoStupidQuestions",
  "id": "ojmok7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I honestly don't know what to do with this situation. My parents immigrated from\ntheir country to escape extreme civil hardship in the land. They gave me a life\nin the US, and I'd like to think I am making the most of the opportunities I\nhave because of them.\n\nThey made a successful restaurant.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直なところ、この状況をどうすればいいのかわかりません。私の両親は\n私の両親は、その国の極度の市民的苦難から逃れるために、その国から移住してきました。彼らは私にアメリカでの生活を与えてくれました。\nアメリカでの生活を与えてくれましたが、私はその機会を最大限に活用していると思いたいです。\n機会を最大限に活用していると思いたい。\n\n彼らはレストランを成功させました....",
      "title": "両親が経営するレストランがTikTokの「インフルエンサー」に不当にレビュー攻撃されています。このような場合、googleにレビューを一時的に停止させる方法はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "老实说，我不知道该如何处理这种情况。我的父母从他们的国家移民过来\n他们的国家，以逃避国内的极端困苦。他们给了我一个在美国的生活\n他们给了我在美国的生活，我想我正在充分利用我的机会。\n因为他们而拥有的机会。\n\n他们做了一个成功的餐厅....",
      "title": "父母的餐馆被一个TikTok的 \"影响者 \"错误地评论攻击了。有什么办法可以让谷歌暂时暂停对此的评论吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "老實說，我不知道該如何處理這種情況。我的父母從他們的國家移民過來\n他們的國家，以逃避國內的極端困苦。他們給了我一個在美國的生活\n他們給了我在美國的生活，我想我正在充分利用我的機會。\n因爲他們而擁有的機會。\n\n他們做了一個成功的餐廳....",
      "title": "父母的餐館被一個TikTok的 \"影響者 \"錯誤地評論攻擊了。有什麼辦法可以讓谷歌暫時暫停對此的評論嗎？"
    }
  ]
}