{
  "author": "robinhood1596",
  "the_new_excerpt": "I've been really been worried about all those shitcoins gaining traction and\nshit and suddenly Vitalik just pulls out his reverse uno card and straight up\nfucks those shitcoins. This shit is so satisfying and i wasn't there to\nmastrubate to it while it's happening. This is why Crypto is so…",
  "original_created_utc": 1620852084,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は本当に心配していたんだ、クソコインが普及することをね。\n突然Vitalikが逆Unoカードを出してきて\n糞コインを破壊したんだ このクソはとても満足のいくもので、私はそこにはいませんでした。\n私はその場にいなかったけどね これだから暗号は...",
      "title": "俺が3時間も留守にしていると、ヴィタリックは最大級の逆ウノカードを取り出してきた。クソみたいなコインだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的一直在担心所有这些狗屎币获得牵引力和狗屎。\n突然间，维塔利克拿出了他的反向UNO卡，并直接\n干掉了那些狗屎币。这狗屎是如此令人满意，而我没有在那里\n在它发生的时候，我不在那里。这就是为什么加密货币是如此...",
      "title": "我走了3个小时，维塔利克就掏出了最大的反向乌诺卡。去他妈的那些狗屎币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的一直在擔心所有這些狗屎幣獲得牽引力和狗屎。\n突然間，維塔利克拿出了他的反向UNO卡，並直接\n幹掉了那些狗屎幣。這狗屎是如此令人滿意，而我沒有在那裏\n在它發生的時候，我不在那裏。這就是爲什麼加密貨幣是如此...",
      "title": "我走了3個小時，維塔利克就掏出了最大的反向烏諾卡。去他媽的那些狗屎幣。"
    }
  ],
  "title": "I'm gone for 3 hours and Vitalik pulls just pulls out the biggest reverse Uno card. Fuck those shitcoins.",
  "created_utc": 1620869072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been really been worried about all those shitcoins gaining traction and shit and suddenly Vitalik just pulls out his reverse uno card and straight up fucks those shitcoins. This shit is so satisfying and i wasn&#39;t there to mastrubate to it while it&#39;s happening. This is why Crypto is so freaking entertaining. I only care a limited amount about the market, I just love the drama and the plottwists.</p>\n</div><!-- SC_ON -->",
  "score": 615,
  "permalink": "/r/CryptoCurrency/comments/nayuew/im_gone_for_3_hours_and_vitalik_pulls_just_pulls/",
  "subreddit": "CryptoCurrency",
  "id": "nayuew",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985993627
}