{
  "author": "Qoslca",
  "original_created_utc": 1653969654,
  "title": "How did Bogotá, Colombia become one of the most influential colonial cities in South America despite being nearly inaccessible from the outside world?",
  "created_utc": 1654006775,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m perplexed as to how this city was apparently such a prominent cultural and financial center (even being named a Spanish Viceroyalty) in the 18/19th century despite being seemingly so removed from other civilization. I was recently reading David McCullough’s ‘The Path Between the Seas’ and he mentions the arduous journey to get there involving a river journey and horseback trekking — and that was in the mid-1800s. How did this land-locked city remain in contact with Spain? How did Bogota post-Columbian independence survive as the nation’s capitol, and why wasn’t a coastal city chosen instead [like other major South American cities, such as Caracas, Lima, Buenos Aires, Rio de Janeiro (pre Brasília), etc.]?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/v1hmzb/how_did_bogotá_colombia_become_one_of_the_most/",
  "subreddit": "AskHistorians",
  "id": "v1hmzb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m perplexed as to how this city was apparently such a prominent cultural and\nfinancial center (even being named a Spanish Viceroyalty) in the 18/19th century\ndespite being seemingly so removed from other civilization. I was recently\nreading David McCullough’s ‘The Path Between the Seas’ and he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この都市が、なぜ、これほどまでに文化的な、また、社会的に著名な都市であったのか、私は当惑しています。\n18～19世紀にはスペイン総督府と呼ばれるほど、文化や金融の中心地であった。\nこの都市は、他の文明からそれほど離れているように見えるにもかかわらず、18世紀から19世紀にかけて、文化や金融の中心地であったようだ。最近、私は\nデイヴィッド・マッカロの「海峡の道」を読んでいて、彼は...",
      "title": "コロンビアのボゴタは、外界からのアクセスがほとんどないにもかかわらず、なぜ南米で最も影響力のある植民地都市のひとつになったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我感到困惑的是，在18/19世纪，这个城市显然是一个突出的文化和金融中心（甚至被命名为西班牙总督府）。\n在18/19世纪，这个城市显然是一个突出的文化和金融中心（甚至被命名为西班牙总督区）。\n尽管它似乎与其他文明相距甚远。我最近在\n读大卫-麦卡洛的《海间之路》，他...",
      "title": "哥伦比亚的波哥大是如何在外界几乎无法进入的情况下成为南美洲最有影响力的殖民城市之一的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我感到困惑的是，在18/19世紀，這個城市顯然是一個突出的文化和金融中心（甚至被命名爲西班牙總督府）。\n在18/19世紀，這個城市顯然是一個突出的文化和金融中心（甚至被命名爲西班牙總督區）。\n儘管它似乎與其他文明相距甚遠。我最近在\n讀大衛-麥卡洛的《海間之路》，他...",
      "title": "哥倫比亞的波哥大是如何在外界幾乎無法進入的情況下成爲南美洲最有影響力的殖民城市之一的？"
    }
  ]
}