{
  "author": "Ok_Try_9746",
  "original_created_utc": 1624320916,
  "title": "This sub is adorable.",
  "created_utc": 1624354872,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You digest every piece of news to fit exactly what you want to believe. </p>\n\n<p>The narrative right now is: lol, China bans for the 47th time, buy the dip. A couple weeks ago it was ‘China bans don’t matter’, and before that it was ‘eLoN iS mAnIpUlAtInG, iGnOrE hIm.’</p>\n\n<p>If Bitcoin was going up amid the China ban, your narrative would be that Bitcoin is so strong that China can’t even take it down. If it was going up while Elon was talking about it, you wouldn’t even notice his tweets. </p>\n\n<p>The news doesn’t matter, it just manipulates your interpretation. Bitcoin will continue to be volatile until it’s actually used for something. If more people buy than sell it will go up. If more people sell than buy it will go down. </p>\n\n<p>That’s it. Drop your junior analysis and realize that you’re investing in a highly speculative asset that can do anything at any time. If you’re investing more than you’re willing to lose, you’re fucking up.</p>\n</div><!-- SC_ON -->",
  "score": 559,
  "permalink": "/r/CryptoCurrency/comments/o59jid/this_sub_is_adorable/",
  "subreddit": "CryptoCurrency",
  "id": "o59jid",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You digest every piece of news to fit exactly what you want to believe.\n\nThe narrative right now is: lol, China bans for the 47th time, buy the dip. A\ncouple weeks ago it was ‘China bans don’t matter’, and before that it was ‘eLoN\niS mAnIpUlAtInG, iGnOrE hIm.’\n\nIf Bitcoin was going up amid the China…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたは、自分が信じたいことにぴったり合うように、すべてのニュースを消化します。\n\n今のシナリオは、「笑える、中国が47回目の禁止令を出した、ディップを買おう」です。A\n数週間前には「中国の禁止措置は問題ではない」、その前には「eLoN\niS mAnIpUlAtInG, iGnOrE hIm.』でした。\n\nもしビットコインが中国の中で上昇していたら...。",
      "title": "このサブは愛らしい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你消化了每一条新闻，以适应你想相信的东西。\n\n现在的说法是：笑，中国第47次禁售，买入跌停板。A\n几周前是 \"中国的禁令并不重要\"，之前是 \"eLoN\n在这之前，它是 \"eLoN，我在做梦，我也在做梦\"。\n\n如果比特币在中国的禁令中上涨，那么它的价格就会上涨。",
      "title": "这个潜艇很可爱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你消化了每一條新聞，以適應你想相信的東西。\n\n現在的說法是：笑，中國第47次禁售，買入跌停板。A\n幾周前是 \"中國的禁令並不重要\"，之前是 \"eLoN\n在這之前，它是 \"eLoN，我在做夢，我也在做夢\"。\n\n如果比特幣在中國的禁令中上漲，那麼它的價格就會上漲。",
      "title": "這個潛艇很可愛。"
    }
  ]
}