{
  "author": "Veraborn64",
  "the_new_excerpt": "I've always thought of the world as an unnecessarily loud place, animals at\ntheir most basic level, in general, are pretty hardwired to be afraid of loud\nnoises and that includes humans. I'm a quiet person in general and often don't\nget heard when speaking in a group and told to \"speak louder\", all…",
  "original_created_utc": 1618476903,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は常々、世界は不必要に騒がしい場所だと考えています。\n動物は基本的に、大きな音を恐れるようにできています。\nそれは人間も同じです。私は一般的に静かな人間で、グループで話していても聞き取れないことがよくあります。\n私は一般的に静かな人間なので、グループで話しているときに「もっと大きな声で」と言われても聞こえないことが多いのですが...。",
      "title": "なぜ、声の大きい人の好みに合わせてしまうのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直认为这个世界是一个不必要的吵闹的地方，动物们在\n他们最基本的水平，在一般情况下，是相当坚硬的，怕吵的\n噪音，包括人类。我一般是个安静的人，经常不\n在群里发言时被听到，被要求 \"大声点\"，所有... ...",
      "title": "为什么我们要面向大嗓门的人的偏爱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直認爲這個世界是一個不必要的吵鬧的地方，動物們在\n他們最基本的水平，在一般情況下，是相當堅硬的，怕吵的\n噪音，包括人類。我一般是個安靜的人，經常不\n在羣裏發言時被聽到，被要求 \"大聲點\"，所有... ...",
      "title": "爲什麼我們要面向大嗓門的人的偏愛？"
    }
  ],
  "title": "Why are we geared to the predilections of loud people?",
  "created_utc": 1618535585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve always thought of the world as an unnecessarily loud place, animals at their most basic level, in general, are pretty hardwired to be afraid of loud noises and that includes humans. I&#39;m a quiet person in general and often don&#39;t get heard when speaking in a group and told to &quot;speak louder&quot;, all our basic instincts tell me we should be telling the group to quieten down. Its the same with people being uncomfortable in silences etc. why have we gone in the complete opposite to one of nature&#39;s most basic instincts... to be quieter.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/mrat0y/why_are_we_geared_to_the_predilections_of_loud/",
  "subreddit": "TrueAskReddit",
  "id": "mrat0y",
  "is_self": true,
  "media": null,
  "is_video": false
}