{
  "author": "ravenboy74",
  "original_created_utc": 1627135403,
  "title": "Did peasants know who their rulers were in medieval Europe?",
  "created_utc": 1627158152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was watching Monty Python and the Holy Grail and the scene where the peasants say they didn&#39;t know who the King was got me thinking. Did peasants in medieval Europe know who their rulers were?</p>\n\n<p>In such large kingdoms and Empires, would peasants living outside of cities have any knowledge of the kingdoms politics and rulership?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/oqqn84/did_peasants_know_who_their_rulers_were_in/",
  "subreddit": "AskHistorians",
  "id": "oqqn84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was watching Monty Python and the Holy Grail and the scene where the peasants\nsay they didn't know who the King was got me thinking. Did peasants in medieval\nEurope know who their rulers were?\n\nIn such large kingdoms and Empires, would peasants living outside of cities have\nany knowledge of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モンティ・パイソンと聖杯」を見ていて、農民たちが「王様が誰なのか知らない」と言うシーンがあった。\n王様が誰なのか知らないと言うシーンで考えさせられました。中世ヨーロッパの農民たちは\n中世ヨーロッパの農民は、自分たちの支配者が誰なのか知っていたのでしょうか？\n\nあんなに大きな王国や帝国の中で、都市部以外に住んでいる農民は、自分たちの支配者が誰なのか知っていたのだろうか？\n把握していたのだろうか...",
      "title": "中世のヨーロッパでは、農民は自分たちの支配者が誰であるかを知っていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在看《巨蟒与圣杯》，其中农民说他们不知道国王是谁的那一幕让我想到了。\n农民说他们不知道谁是国王，这让我想到。在中世纪的欧洲，农民是否知道他们的统治者是谁？\n欧洲的农民知道他们的统治者是谁吗？\n\n在如此大的王国和帝国中，生活在城市之外的农民是否知道他们的统治者是谁？\n有任何知识......",
      "title": "在中世纪的欧洲，农民们知道他们的统治者是谁吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在看《巨蟒與聖盃》，其中農民說他們不知道國王是誰的那一幕讓我想到了。\n農民說他們不知道誰是國王，這讓我想到。在中世紀的歐洲，農民是否知道他們的統治者是誰？\n歐洲的農民知道他們的統治者是誰嗎？\n\n在如此大的王國和帝國中，生活在城市之外的農民是否知道他們的統治者是誰？\n有任何知識......",
      "title": "在中世紀的歐洲，農民們知道他們的統治者是誰嗎？"
    }
  ]
}