{
  "author": "Linus_Naumann",
  "original_created_utc": 1628683186,
  "title": "Unpopular opinion: Bitcoin did not get rid of the middle-man",
  "created_utc": 1628692286,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The general narrative about Bitcoin seems to be, that Bitcoin got rid of the middle-man, aka people that you have to pay money to process your transactions and that can, in theory, censor you. Even the 2008 Bitcoin white-paper is titled “Bitcoin: A <strong>Peer-to-Peer</strong> Electronic Cash System”, implying that any user can give their money directly to any other person.</p>\n\n<p>My hot-take: Bitcoin is NOT a peer-to-peer electronic cash system because users are not able to directly send tokens to any other person. There is still a middle-man in the system: The miners (in other projects: stakers).</p>\n\n<p><strong>Why miners are middle-men</strong></p>\n\n<p>In order to issue a transaction on the blockchain nodes (aka users) must ask the miners to include their transactions into the next block. In order for the miners to consider ones transaction, they have to be bribed by offering money (transaction fees). This already means that nodes CANNOT directly write their transaction into the blockchain - only miners can do that. That’s the perfect definition of a middle-man: Someone you HAVE TO pay in order for them to do something for you, because you cannot do it yourself.</p>\n\n<p><strong>Ok miners are middle-men, but they are decentralized, right?</strong></p>\n\n<p>Keep in mind: Miners are not crypto-enthusiasts, anarcho-capitalists or fighters for financial freedom. They are businesses. Professional mining today requires initial investments of hundreds of millions of Dollars to even start business. This money comes from rich investors that don’t necessarily have any interest in the “freedom crypto” narrative, but only in return of investment (ROI).</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0h2p0l9tmpg71.png?width=1889&amp;format=png&amp;auto=webp&amp;s=f6745a4cf7753200ed13c119c6e440b91990dfa0\">Fig.1: Recent news about Mara-pool investing $120 mil. into mining hardware. This pool was famous for following US money-laundering-laws by censoring blacklisted addresses. Source: https://bitcoinmagazine.com/business/marathon-120-million-30000-bitcoin-miners</a></p>\n\n<p>These businesses pay large teams of professionals to set up and maintain complex mining-rigs at several locations around the globe and negotiate prices and regulations with local or national power-suppliers. All these jobs are again not done by freedom-fighters or anything like that, but by regular professionals, as they work in every other company. Small-scale mining by private people plays virtually no role in todays crypto landscape and you can bet that the process of professionalization will only continue over time, as long as there is profit to be made.</p>\n\n<p>So we have here a completely normal, non-idealistic new market emerging. How do emerging markets ALWAYS behave? They consolidate to become more profitable. Big and profitable businesses buy smaller, less profitable businesses or fusion with large competitors. The market centralizes.</p>\n\n<p>Today there are already only 4 mining pools that together create about 51,5% of the total hash-power of the Bitcoin network. Two of these pools (antpool.com and f2pool.com) being managed by one umbrella entity, Bitmain.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/j3fjm71xopg71.png?width=1726&amp;format=png&amp;auto=webp&amp;s=f906772b4b80788a514837b2923e403722dc628a\">Four mining pools control 51&#37; of Bitcoins hashpower. Two of them are controlled by the same umbrella company (Bitmain). Source: https://miningpoolstats.stream/bitcoin</a></p>\n\n<p>Have you ever heard of the Nakamoto Coefficient? It is the minimal number of validators of a decentralized network that together could control the network (in Bitcoin: create 51% of the total hash-rate). This means, the Nakamoto Coefficient of Bitcoin is 3 Literally 3. Any entity that can control these 3 mining-companies either politically, financially via back-door deals or by any other means, can effectively control and censor the network. This number will presumably only go lower over time, as business consolidates.</p>\n\n<p><strong>Censorship on the Bitcoin blockchain – How mining companies can be politically controlled</strong></p>\n\n<p>Just google “Mara pool”. This US-based mining pool claimed to be fully compliant to US money laundering laws by censoring transactions that involve <strong>blacklisted</strong> addresses. This means that any transaction coming from or going towards such an address was not considered in blocks created by Mara pool, independent from how much transaction-fees they offered. If you thought Bitcoin is free from censorship, check again: censorship on the blockchain is already happening TODAY. Blacklisted addresses had no other way to go forward than to wait until another, not censoring, mining pool created a new block, that hopefully included their transaction.</p>\n\n<p>Mara pool recently stepped away from this policy and started processing all kinds of transaction again, but this example shows cleary: Miners are business and businesses underlie governmental control. If you want to buy energy on the scale of smaller countries, you will have to negotiate with government-controlled power-suppliers. As governments catch up on the topic, professional mining will eventually become a fully regulated business, just as any other – most likely including extensive money-laundering laws. First bills are already proposed in the US: <a href=\"https://www.cnbc.com/2021/08/06/white-house-backs-senators-pushing-for-stricter-crypto-reporting-rules.html\">https://www.cnbc.com/2021/08/06/white-house-backs-senators-pushing-for-stricter-crypto-reporting-rules.html</a></p>\n\n<p>While controlled mining-pools with less than 51% of hash-power are mostly just a nuisance, once they reach more than 51% (don’t forget the Nakamoto coefficient of 3…), Bitcoin will be completely censored.</p>\n\n<p><strong>The problem: Leader-based DLT</strong></p>\n\n<p>It doesn’t matter if your protocol runs with PoW or PoS: As long as the protocol is leader-based, true decentralization will never be possible. In fact, the exact method of finding a leader only determines WHO will be your middle-man: <strong>Corporations (miners) or rich people (stakers).</strong> The average user remains powerless in this system and can only hope, that the middle-man is decentralized enough to not bother him.</p>\n\n<p><strong>The only way to really get rid of the middle-man: Leaderless DLT</strong></p>\n\n<p>The problem is fundamental to leader-based DLT and can only be tackled by <strong>fundamentally</strong> questioning the setup of modern protocols. What we need is not authoritaritan (leader-based) consensus, but COOPERATIVE and DEMOCRATIC consensus (leaderless) instead!</p>\n\n<p>As of today, the only project that at least tries to tackle this problem is IOTA by inventing a leaderless consensus based on their research in parallel-reality based ledger states and on-tangle voting (aka “Multiverse consensus”). Although value transactions on the mainnet are still centralized, their research-oriented IOTA 2.0 DevNet is already fully decentralized and completely leaderless – every user, every node, can write his or her transactions directly into the shared database (some explanation here. Watch the DevNet running live here: <a href=\"https://v2.iota.org/visualizer\">https://v2.iota.org/visualizer</a>). Although it is not yet feature-complete, the IOTA foundation claims that all research hurdles have been overcome and that only implementation and testing is left before the mainnet can be fully decentralized too. If this is true, it would mean the dawn of the first, actually decentralized “peer-to-peer electronic money” that Satoshi envisioned.</p>\n\n<p>Medium: <a href=\"https://medium.com/@linus.naumann/unpopular-opinion-bitcoin-did-not-get-rid-of-the-middle-man-71aced8c5e3f\">https://medium.com/@linus.naumann/unpopular-opinion-bitcoin-did-not-get-rid-of-the-middle-man-71aced8c5e3f</a></p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/p2bmz6/unpopular_opinion_bitcoin_did_not_get_rid_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "p2bmz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The general narrative about Bitcoin seems to be, that Bitcoin got rid of the\nmiddle-man, aka people that you have to pay money to process your transactions\nand that can, in theory, censor you. Even the 2008 Bitcoin white-paper is titled\n“Bitcoin: A Peer-to-Peer Electronic Cash System”, implying that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインに関する一般的な物語は、「ビットコインは中間層を取り除いた」というものだと思われます。\nつまり、取引を処理するためにお金を払わなければならず、理論的にはあなたを検閲することができる人々です。\nつまり、取引を処理するためにお金を払わなければならず、理論的にはあなたを検閲できる人たちです。2008年に発行されたビットコインのホワイトペーパーのタイトルも\n\"Bitcoin: A Peer-to-Peer Electronic Cash System \"と題されていますが、これはつまり",
      "title": "不人気な意見。ビットコインは中間業者を排除できなかった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "关于比特币的一般说法似乎是，比特币摆脱了\n中间人，也就是那些你必须付钱给他们来处理你的交易的人\n理论上，他们可以审查你。甚至2008年的比特币白皮书的标题也是\n\"比特币：一个点对点的电子现金系统\"，暗示...",
      "title": "不受欢迎的意见。比特币没有摆脱中间人的束缚"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "關於比特幣的一般說法似乎是，比特幣擺脫了\n中間人，也就是那些你必須付錢給他們來處理你的交易的人\n理論上，他們可以審查你。甚至2008年的比特幣白皮書的標題也是\n\"比特幣：一個點對點的電子現金系統\"，暗示...",
      "title": "不受歡迎的意見。比特幣沒有擺脫中間人的束縛"
    }
  ]
}