{
  "author": "gnarley_quinn",
  "original_created_utc": 1640328030,
  "title": "Here it is. The subs most despised coins combined into a single awful folio. This is the folio of hate. How much do you want it to fail? Does it make you angry?",
  "created_utc": 1640335091,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Well after a long and exhaustive battle of coins being shilled in just a couple of hours, I have found the list of the subs most hated coins. There was definitely a lot of hate out there. I put $100 into each and stored it on a seperate group of wallets to my real bags. To make it easier to track, I create the folio of hate using coinmarketcap to track them more easily. I&amp;#39;ll post the updates every month and hope to see some big gains going against us all (even my most hated coin is in this group).&lt;/p&gt;\n\n&lt;p&gt;There was a lot of hate from users, towards some coins more so than others. The two most hated were the most hated by a very long way. Merry Christmas everyone!&lt;/p&gt;\n\n&lt;p&gt;The final list in order of most votes and comments is listed in the comment below because the filter won&amp;#39;t let me create a post with that many coin names in it. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/f8qk6b7urf781.png?width=873&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=2a0c982ec7c5e72119b0f61252fbb9b23b2823a9\"&gt;The Folio of Hate&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 340,
  "permalink": "/r/CryptoCurrency/comments/rng996/here_it_is_the_subs_most_despised_coins_combined/",
  "subreddit": "CryptoCurrency",
  "id": "rng996",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well after a long and exhaustive battle of coins being shilled in just a couple\nof hours, I have found the list of the subs most hated coins. There was\ndefinitely a lot of hate out there. I put $100 into each and stored it on a\nseperate group of wallets to my real bags. To make it easier to track,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、たった2、3日でコインをシバキ倒した長い長い戦いの末に\n時間後に、最も嫌われているコインのリストが見つかりました。そこには\n確かに嫌われ者ですね。私はそれぞれ100ドルずつ入れて、それぞれで保管しました。\nを、本物のバッグとは別のウォレット群に分けました。追跡しやすいように、...",
      "title": "ここにあります。最も軽蔑されているコインを 1冊のひどいフォリオにまとめました。これは憎しみのフォリオです どれだけ失敗して欲しいですか？腹が立ちますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "经过漫长而详尽的钱币争夺战，在短短的几个小时内，我找到了最受欢迎的子网站名单。\n小时后，我找到了最令人讨厌的硬币的名单。这里有\n肯定有很多人讨厌。我在每个币上投入了100美元，并将其存放在一个\n储存在与我真正的袋子分开的一组钱包里。为了便于追踪，...",
      "title": "在这里，它是。几种最被鄙视的硬币被组合成一个可怕的对开本。这就是仇恨的对开本。你有多希望它失败？它让你生气吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "經過漫長而詳盡的錢幣爭奪戰，在短短的幾個小時內，我找到了最受歡迎的子網站名單。\n小時後，我找到了最令人討厭的硬幣的名單。這裏有\n肯定有很多人討厭。我在每個幣上投入了100美元，並將其存放在一個\n儲存在與我真正的袋子分開的一組錢包裏。爲了便於追蹤，...",
      "title": "在這裏，它是。幾種最被鄙視的硬幣被組合成一個可怕的對開本。這就是仇恨的對開本。你有多希望它失敗？它讓你生氣嗎？"
    }
  ]
}