{
  "author": "Suzina",
  "original_created_utc": 1624536023,
  "title": "The first 10 years of crypto feel like the first 10 years of the internet",
  "created_utc": 1624548639,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For years after the TCP/IP protocalls were finalized in the early 80s, the internet was a wild place full of unrealized potential.  You basically had to be some kind of nerd to fire up your home computer and connect to an IP address.  It was very user unfriendly and confusing, but the potential for this internet thing to take off was always there and built up over the years.</p>\n\n<p>In the early 90&#39;s the world wide web was invented.  And web browsers.  America On Line.  Then it was a mega boom that kept on booming the rest of the decade.</p>\n\n<p>All crypto needs is an invention to make it more user friendly and main-stream.  Just as the web browser was a game changer in the early 90s, I feel the next great innovation could be built on the back of blockchain technology as we speak.</p>\n\n<p>It&#39;s just a matter of figuring out what is the &quot;world wide web browser&quot; of crypto to make this next decade as big a bull run as the last.</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/CryptoCurrency/comments/o6zfpy/the_first_10_years_of_crypto_feel_like_the_first/",
  "subreddit": "CryptoCurrency",
  "id": "o6zfpy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For years after the TCP/IP protocalls were finalized in the early 80s, the\ninternet was a wild place full of unrealized potential. You basically had to be\nsome kind of nerd to fire up your home computer and connect to an IP address. It\nwas very user unfriendly and confusing, but the potential for…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "80年代初頭にTCP/IPプロトコールが完成してから何年もの間、インターネットは\nインターネットは、まだ実現されていない可能性に満ちたワイルドな場所でした。基本的には\n自宅のコンピューターを起動してIPアドレスに接続するには、よほどのオタクでなければできませんでした。それは\n非常に使い勝手が悪く、混乱していましたが、潜在的な...",
      "title": "暗号の最初の10年は、インターネットの最初の10年のように感じられる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在80年代初TCP/IP协议定稿后的几年里，互联网是一个充满未实现潜力的狂野之地。\n互联网是一个充满了未实现的潜力的狂野之地。你基本上必须是\n某种书呆子才能启动你的家用电脑并连接到一个IP地址。它\n它对用户非常不友好，而且令人困惑，但它的潜力...。",
      "title": "加密货币的前10年感觉像互联网的前10年"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在80年代初TCP/IP協議定稿後的幾年裏，互聯網是一個充滿未實現潛力的狂野之地。\n互聯網是一個充滿了未實現的潛力的狂野之地。你基本上必須是\n某種書呆子才能啓動你的家用電腦並連接到一個IP地址。它\n它對用戶非常不友好，而且令人困惑，但它的潛力...。",
      "title": "加密貨幣的前10年感覺像互聯網的前10年"
    }
  ]
}