{
  "author": "Dick-Wraith",
  "the_new_excerpt": "I've been a \"buy and hold\" trader since I started in 2018, but looking back\nthere are times when I could have sold when the stock was doing well, and then\nre-invested on a dip.\n\nObviously hindsight is 20/20 and I didn't know at the time when the highs and\nwhen the lows were. But I just feel like I…",
  "original_created_utc": 1612921847,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从2018年开始，我一直是一个 \"买入并持有 \"的交易者，但回想起来\n有的时候，我可以卖出时，股票做得很好，然后\n再投资的一个跌幅。\n\n显然，事后诸葛亮是20/20，我当时并不知道当高点和。\n当低谷的时候。但我只是觉得自己...",
      "title": "你们怎么知道什么时候该锁定利润？即卖出，然后带着收益跑路？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從2018年開始，我一直是一個 \"買入並持有 \"的交易者，但回想起來\n有的時候，我可以賣出時，股票做得很好，然後\n再投資的一個跌幅。\n\n顯然，事後諸葛亮是20/20，我當時並不知道當高點和。\n當低谷的時候。但我只是覺得自己...",
      "title": "你們怎麼知道什麼時候該鎖定利潤？即賣出，然後帶着收益跑路？"
    }
  ],
  "title": "How do you guys know when to lock in your profits? I.e. sell and run with the gains?",
  "created_utc": 1612937778,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been a &quot;buy and hold&quot; trader since I started in 2018, but looking back there are times when I could have sold when the stock was doing well, and then re-invested on a dip. </p>\n\n<p>Obviously hindsight is 20/20 and I didn&#39;t know at the time when the highs and when the lows were. But I just feel like I need to be more active rather than buying a stock and then just looking at it every day. Do you guys set a gain percentage on what you expect to earn on your investments? i.e. I earn X% or I gain X$ per stock? </p>\n\n<p>How do you cope with selling early and then watching the stock keep rising? Or buying early and watching it keep plummeting?</p>\n</div><!-- SC_ON -->",
  "score": 72,
  "permalink": "/r/stocks/comments/lgj59f/how_do_you_guys_know_when_to_lock_in_your_profits/",
  "subreddit": "stocks",
  "id": "lgj59f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204955
}