{
  "author": "JuicySpark",
  "the_new_excerpt": "ROBINHOOD\n\nDon't buy Crypto on Robinhood . The company almost went under on a 3B margin\ncall over illegal GME paper trades. They restricted buying on doge, then\nBullshitted their way out of it when officials questioned them.\n\n\nCOINBASE\n\nHad to dish out $6.5 million in fines for using bots to…",
  "original_created_utc": 1622834436,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ロビンフッド\n\nロビンフッドで暗号を買わないでください。この会社は、違法なGMEペーパートレードに対する30億円のマージンコールで、ほとんど潰れてしまった。\n違法なGMEのペーパートレードで30億円のマージンコールを受けて破綻しそうになりました。彼らはdogeでの購入を制限し、その後\n役人に質問されたときに、嘘をついて逃げた。\n\n\nコインベース\n\nボットを使った取引で650万ドルの罰金を課せられた。",
      "title": "ロビンフッド、コインベース、マイクロソフト 中央集権的な企業が自暴自棄になったときに何をするか、決して忘れてはならない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "罗宾霍德（ROBINHOOD\n\n不要在Robinhood上购买加密货币。该公司因非法的GME纸质交易被追缴30亿保证金而几乎倒闭。\n该公司因非法的GME纸质交易被追缴保证金而差点破产。他们限制了在Doe上的购买，然后\n当官员们质疑他们时，他们胡扯了一通。\n\n\nCOINBASE\n\n因使用机器人交易而被处以650万美元的罚款。",
      "title": "Robinhood, Coinbase, Microsoft: 永远不要忘记中心化的公司在走投无路时的做法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "羅賓霍德（ROBINHOOD\n\n不要在Robinhood上購買加密貨幣。該公司因非法的GME紙質交易被追繳30億保證金而幾乎倒閉。\n該公司因非法的GME紙質交易被追繳保證金而差點破產。他們限制了在Doe上的購買，然後\n當官員們質疑他們時，他們胡扯了一通。\n\n\nCOINBASE\n\n因使用機器人交易而被處以650萬美元的罰款。",
      "title": "Robinhood, Coinbase, Microsoft: 永遠不要忘記中心化的公司在走投無路時的做法。"
    }
  ],
  "title": "Robinhood, Coinbase, Microsoft: Never Forget What Centralized Corporations Do When they get Desperate.",
  "created_utc": 1622858461,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h3>Robinhood</h3>\n\n<p>Don&#39;t buy Crypto on Robinhood . The company almost went under on a 3B margin call over illegal GME paper trades.   They restricted buying on doge, then Bullshitted their way out of it when officials questioned them.</p>\n\n<h3>Coinbase</h3>\n\n<p>Had to dish out $6.5 million in fines for using bots to manipulate prices. They have also been forced to report trades you do to the IRS taking away your own responsibility to do it yourself.    Yeah yeah. They have to comply.  Everyone wants to watch what you are doing.  The little guy while the same corporations get away with murder avoiding taxes by use of offshore banking methods.    Rules for thee but not for me.</p>\n\n<h3>Microsoft</h3>\n\n<p>The CIA in 2017 in wake of Trump getting elected turned every windows PC into spyware as if regular citizens were a threat.  Just a switch and bam, they have a backdoor into what you look at, who you voted for, your crypto or whatever they want to use for whatever purposes. I&#39;m sure some of it involves a little bit of taking your information and selling it to the highest bitter.</p>\n\n<p><a href=\"https://wikileaks.org/ciav7p1/\">https://wikileaks.org/ciav7p1/</a></p>\n\n<h3>Google</h3>\n\n<p>Actively suppresses innovation of competing app stores.   Take AppCoins $APPC.  By Aptoide.  A perfectly legal appstore out of Portugal that would offer you free apps that you would have to pay $1 for on Playstore.\n    They have incentives for users if they play or use certain apps the creator awards you more appcoins for your time so you can use that for in app purchases or purchase apps you couldn&#39;t previously afford. </p>\n\n<p>Aptoide took google to court several times for dirty practices and won a couple. </p>\n\n<p>They also have massive Influence like paying bloggers to tell everyone Aptoide is illegal.</p>\n\n<p><a href=\"https://joyofandroid.com/illegal-android-apps/#:%7E:text=Aptoide,you%20can%20download%20and%20install\">https://joyofandroid.com/illegal-android-apps/#:~:text=Aptoide,you%20can%20download%20and%20install</a>.</p>\n\n<p>Illegal because the play store doesn&#39;t allow competing appstore apps.    Yeah, that&#39;s not what defines illegal to have on your phone. It gets downloaded form their site direct. Not play store</p>\n\n<p>Yeah that doesn&#39;t make it illegal.  They went as far as deleting it entirely off your android whenever there was an update. </p>\n\n<p>Aptoide was suppressed so much, and in combination with the crypto market crash, it really hurt their adoption big time.</p>\n\n<p>Well, they were fishing traction fast in 2018. 300M users.  Free crypto.  Obviously you can&#39;t let your market share tumble while the little guy gets a little more out services.  You can lose a few billion if you let Aptoide run free. Especially during bullmarkets. </p>\n\n<p>So remember..</p>\n\n<p>Decentralization.  It starts by deleting your popular centralized apps like face book and start using decentralized platforms for social networking like Diaspora. </p>\n\n<p>This is where it starts.   People have the power all they have to do is act. </p>\n\n<p>These people aren&#39;t there for you. They are their for themselves.  They don&#39;t want the little guy to get ahead on their dime.  </p>\n\n<p>Crypto is our future. Hold BTC, ETH etc.</p>\n</div><!-- SC_ON -->",
  "score": 886,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/MPXrnegu7qQGH4-yuWH7AWH6FI_ZQUhoeHI2cvkVNYM.jpg?auto=webp&s=d5b9f3458ff1f787c8cbf33f450832ee62f9ed1d",
          "width": 400,
          "height": 400
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/MPXrnegu7qQGH4-yuWH7AWH6FI_ZQUhoeHI2cvkVNYM.jpg?width=108&crop=smart&auto=webp&s=c9f50d1dbee7e21ea298fca16a939df48247c3dc",
            "width": 108,
            "height": 108
          },
          {
            "url": "https://external-preview.redd.it/MPXrnegu7qQGH4-yuWH7AWH6FI_ZQUhoeHI2cvkVNYM.jpg?width=216&crop=smart&auto=webp&s=75c3162a5f89010e7e9f31d82e89c6615d1eb5aa",
            "width": 216,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/MPXrnegu7qQGH4-yuWH7AWH6FI_ZQUhoeHI2cvkVNYM.jpg?width=320&crop=smart&auto=webp&s=8532c2f68e582fd14b0f9a83269eeb8d51d2c16c",
            "width": 320,
            "height": 320
          }
        ],
        "variants": {},
        "id": "C_zbbFeDZCeazwF5WlwNhVYsOILTCmGOtZpUCQQlZ3c"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/nsd432/robinhood_coinbase_microsoft_never_forget_what/",
  "subreddit": "CryptoCurrency",
  "id": "nsd432",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881318
}