{
  "author": "no____thisispatrick",
  "original_created_utc": 1633829996,
  "title": "Burger king will be doing a crypto promotion this month",
  "created_utc": 1633855042,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I found out at work today that BK will soon be running a crypto themed promotion. </p>\n\n<p>It will be tied to using their mobile app and will, unfortunately, be partnered with robinhood. \nBut, exposure is exposure?</p>\n\n<p>The funniest part was in the memo that came out from our franchise&#39;s marketing department regarding the promotion. It stated, rather vaguely, that &quot;Royal Perks members who spend over $5 on the app will receive one free crypto coin.&quot;\nOne free coin?!? Which one?!?! Haha I couldn&#39;t find anymore info today, im assuming this was just poor translation of tech speak.</p>\n\n<p>Either way, it made me feel like we are still pretty early.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/q4ylwg/burger_king_will_be_doing_a_crypto_promotion_this/",
  "subreddit": "CryptoCurrency",
  "id": "q4ylwg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I found out at work today that BK will soon be running a crypto themed\npromotion.\n\nIt will be tied to using their mobile app and will, unfortunately, be partnered\nwith robinhood. But, exposure is exposure?\n\nThe funniest part was in the memo that came out from our franchise's marketing\ndepartment…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、職場で知ったのですが、BKでは近々、暗号をテーマにした\nプロモーションを行います。\n\nこれはモバイルアプリの使用に関連するもので、残念ながらrobinhoodと提携しています。\nロビンフッドと提携します。しかし、露出は露出です。\n\n一番面白かったのは、私たちのフランチャイズのマーケティング部門から出されたメモでした。\n笑えるのは、私たちのフランチャイズのマーケティング部門から出てきたメモで...。",
      "title": "バーガーキングは今月、暗号のプロモーションを行います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天在工作中发现，BK公司很快将开展一个以加密货币为主题的\n促销活动。\n\n它将与使用他们的移动应用程序挂钩，而且不幸的是，它将与\n与Robinhood合作。但是，曝光就是曝光？\n\n最有趣的部分是在我们特许经营的营销部门发出的备忘录中\n部门发出的备忘录......",
      "title": "汉堡王将在本月进行加密货币促销活动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天在工作中發現，BK公司很快將開展一個以加密貨幣爲主題的\n促銷活動。\n\n它將與使用他們的移動應用程序掛鉤，而且不幸的是，它將與\n與Robinhood合作。但是，曝光就是曝光？\n\n最有趣的部分是在我們特許經營的營銷部門發出的備忘錄中\n部門發出的備忘錄......",
      "title": "漢堡王將在本月進行加密貨幣促銷活動"
    }
  ]
}