{
  "author": "AndyKaufmanHere",
  "the_new_excerpt": "Hi everyone! We’re part of the GET Protocol team, here to answer any questions\nyou may have about our project, which currently consists of thirty people\n(mostly based in The Netherlands) working hard every day to 'disrupt' and\nimprove the ticketing industry. We’ve issued on-chain tickets for…",
  "original_created_utc": 1618410509,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。私たちは、GETプロトコルチームの一員です。\n私たちのプロジェクトは、現在30人のメンバーで構成されています。\nオランダを中心に30人のメンバーで構成されており、チケット業界を破壊し、改善するために日々努力しています。\nチケッティング業界を破壊し、改善するために日々努力しています。私たちは、オンチェーンでチケットを発行しています...",
      "title": "GET Protocol AMA - ブロックチェーン、NFT、その他のイノベーションを利用してチケット業界をどのように改善しているのか、何でも質問してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好! 我们是GET协议团队的一员，在这里回答任何问题。\n你可能对我们的项目，目前有三十个人组成\n(大部分在荷兰)每天都在努力 \"破坏 \"和\n完善票务行业。我们已经发行了链上票，为...",
      "title": "获取协议AMA - 进来问我们任何关于我们如何使用区块链、NFT和其他创新来改善票务行业的问题。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好! 我們是GET協議團隊的一員，在這裏回答任何問題。\n你可能對我們的項目，目前有三十個人組成\n(大部分在荷蘭)每天都在努力 \"破壞 \"和\n完善票務行業。我們已經發行了鏈上票，爲...",
      "title": "獲取協議AMA - 進來問我們任何關於我們如何使用區塊鏈、NFT和其他創新來改善票務行業的問題。"
    }
  ],
  "title": "GET Protocol AMA - Drop in and ask us anything about how we are improving the ticketing industry using blockchain, NFTs and other innovations",
  "created_utc": 1618425648,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone! We’re part of the GET Protocol team, here to answer any questions you may have about our project, which currently consists of thirty people (mostly based in The Netherlands) working hard every day to &#39;disrupt&#39; and improve the ticketing industry. We’ve issued on-chain tickets for thousands of events since 2016 and are currently in the midst of a big expansion, both in terms of our team and international business development. We utilise blockchain, NFTs and other tech to put the power back into the hands of artists &amp; event organisers, while drastically improving the fan experience in the mean time.</p>\n\n<p>My name is Olivier: <a href=\"/u/AndyKaufmanHere\">/u/AndyKaufmanHere</a> and today I’ll be joined by Colby: <a href=\"/u/GETProtocol_Colby\">/u/GETProtocol_Colby</a> and Kasper: <a href=\"/u/kasper-guts\">/u/kasper-guts</a>. We can’t wait to answer your questions but first here’s some information on our project and the current problems in the ticketing industry:</p>\n\n<h2>Why Ticketing?</h2>\n\n<p>The ticketing industry is rife with greed and corruption which is tailored to put event goers and fans at the bottom of the chain. Ticket touting has become a widespread plague which sees armies of resellers acquiring tickets to then sell them back on secondary ticket markets at staggering prices. Ultimately these costs are pushed onto unsuspecting fans who have no other choice if they want to go to their favourite events.</p>\n\n<p>You don’t have to look far to see the problems, ranging from<a href=\"https://www.nytimes.com/2018/06/21/world/asia/china-world-cup-ticket-scam-anzhi.html\"> fake world cup tickets</a>, Ed Sheeran’s own<a href=\"https://www.theguardian.com/music/2018/may/25/fans-left-with-invalid-tickets-in-ed-sheeran-anti-tout-scheme-viagogo\"> attempt at fighting scalpers</a>, and a huge amount of Beyoncé / Jay-Z fans<a href=\"https://people.com/music/beyonce-jay-z-otr-ii-tour-presale-sells-out-seconds/\"> who were beaten by bots</a> and forced to pay exorbitant prices for their tickets.</p>\n\n<p>On the other end of the scale, the largest ticketing companies look to squeeze every last drop of profit out of event goers. Whether it be the mysterious fees, ticket withholding, secondary market ownership or ticket insurances, more innovation seems to go into profit extracting than the fan-artist experience. Unfortunately, artists and event organisers are forced to watch as their fans get the raw end of the stick, whilst being powerless to do anything about it. This is in part due to the ‘black box’ effect that ticketing companies have over the event life cycle.</p>\n\n<h2>About GET Protocol</h2>\n\n<p>GET Protocol offers a solution to the problems that have been plaguing the ticketing industry for decades. Using our solution, artists, event organizers and ticketing companies can offer their ticket buyers and fans a fair, transparent and easy ticketing experience.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/b5293ti4e5t61.jpg?width=5120&amp;format=pjpg&amp;auto=webp&amp;s=53e3a08e716a0920a834ed2f451049a057e54e99\">https://preview.redd.it/b5293ti4e5t61.jpg?width=5120&amp;format=pjpg&amp;auto=webp&amp;s=53e3a08e716a0920a834ed2f451049a057e54e99</a></p>\n\n<p>We have built, battle-tested and fine-tuned our 100% digital ticketing system over the past several years at real events with real, non-digital savvy attendees. (We figure if elderly visitors of theater shows can use your system, anyone can.) From day one we have focussed on delivering a service that improves the general event experience, on top of providing a boat load of innovations under the hood.</p>\n\n<p>We utilise a blockchain agnostic approach along with NFTs and cryptocurrency to provide transparency and honesty to an industry that is in dire need of change. Thanks to the inherent public nature of blockchain it becomes possible to keep every actor in the ticketing chain accountable.</p>\n\n<p>Our approach is to use the blockchain as an engine, to perform a critical role but do so under the hood, so that everyone can benefit whilst not having to know or understand its role in the ticketing process. Event goers pay for their tickets in FIAT and in the background, GET is used to fuel their tickets and the blockchain is used to register their ticket’s ownership.</p>\n\n<p><strong>International adoption</strong></p>\n\n<p>Since 2016, GET Protocol has been used in live events around Europe, with 600,000 tickets sold and <a href=\"https://decrypt.co/4928/how-comedy-artist-jochem-myjer-beats-ticket-touts-with-guts-ticketing-blockchain\">not one ticket re-sold for profit.</a> After optimising our ticketing system for several years, we were ready to take it all over the world.</p>\n\n<p>Although 2020 saw a near-total downturn in live events, it was a blessing in disguise for us, as we were able to fine-tune our white-label approach, which allows any party worldwide to integrate the protocol and issue our smart tickets in their local markets under their own branding. There are currently white-label integrators in Italy, Germany, South Korea and The Netherlands, and we have dozens more in the pipeline. In fact, we’re expecting more white-labeler(s) just this month!</p>\n\n<p><a href=\"https://miro.medium.com/max/692/0*XZS6QsydyO2Hd4Jv\">Here’s an image</a> from <a href=\"https://medium.com/get-protocol/get-update-march-21-this-time-is-different-63d8f461f15\">our most recent update blog</a>, the countries in green contain parties that have reached out to us about integration:</p>\n\n<p><a href=\"https://preview.redd.it/ibrz19doe5t61.png?width=692&amp;format=png&amp;auto=webp&amp;s=539beb6b4e317b390e3f20c233e5456a027e8310\">https://preview.redd.it/ibrz19doe5t61.png?width=692&amp;format=png&amp;auto=webp&amp;s=539beb6b4e317b390e3f20c233e5456a027e8310</a></p>\n\n<p>GET Protocol can be implemented by any ticketing company and our goal is to one day allow any small business, individual or ticket company to set up their own ticketing through the protocol as easy as setting up a website with Wordpress.</p>\n\n<p>Our system does not just stop at ending ticket touting, we offer a range of additional features for what we call our ‘smart tickets’. These tickets can be easily resold straight back to the primary market for the price they were purchased for (effectively merging primary and secondary markets) to an anonymous buyer. Event organisers and artists can connect directly with fans through SMS messaging and get a clear picture of how tickets are distributed and used throughout the entire life-cycle. Each ticket also has a dynamically changing QR code which must match with the system at the time of scanning, making screenshotting a ticket ineffective. If you would like to see our system in action then <a href=\"https://guts.tickets/demo/\">visit this link.</a></p>\n\n<h2>How We Utilise NFTs</h2>\n\n<p>Whilst there are divided opinions over the popularity and actual merit of NFTs, their inherent properties and applications can benefit a lot of different industries. There are several use cases that we are actively exploring for our ticketing such as:</p>\n\n<p><strong>Perpetual Revenue</strong></p>\n\n<p>Since NFT tickets are programmable, we can introduce a built-in ‘royalty split’ which allows for a profit sharing system that can be tailored by the event organiser and deliver further value to artists, venues and legitimate actors in the ticketing chain whilst cutting out resale platforms and touts.</p>\n\n<p><strong>Tickets as collectibles</strong>Whilst this might seem gimmicky, the sentimental experience of fandom should not be overlooked. Think of a digitized version of sticking the ticket to an unforgettable night on your refrigerator, only with way more possibilities to maximize the memories and cultivate a longstanding connection with a fan.</p>\n\n<p>As NFTs, tickets can be turned into proof-of-attendance badges, (we are partnering with<a href=\"https://www.poap.xyz/\"> POAP</a> for this purpose) which can be shown off online and even traded. It can also allow you to find and reward your diehard fans who go to every show, for example by sending exclusive content to those fans in possession of a previously issued ticket. The possibilities and variations here are limitless.</p>\n\n<p><strong>Pre-financing of future events</strong>We are working on a DeFi approach that will allow event organizers to use their ticket inventory as collateral. This will enable organizers to offer up their (NFT) tickets for investment prior to making any organisational costs. This type of crowdfund investing can help organizers mitigate (part of) the risk of setting up a new event. Especially in a post-Covid world this can be a welcome change.<a href=\"https://medium.com/get-protocol/decentralizing-event-financing-liquidity-x-defi-x-nfts-975f028135f5\"> Read more about this functionality here.</a></p>\n\n<p>If you’d like to read more about why NFT tickets make perfect sense, then look no further than this <a href=\"https://medium.com/get-protocol/the-desert-of-the-real-introducing-getnft-tickets-99a14e0b6951\">blog post from our blockchain developer Kasper!</a></p>\n\n<h2>The GET Token</h2>\n\n<p>GET is an ERC-20 token on the Ethereum blockchain and it is the fuel for each ticket on the GET Protocol. When an action or state change occurs to a ticket, a fee is required which is calculated and paid in GET. Some examples of these state changes include a ticket being created, validated or shared. This process is similar to how gas fees work with Ethereum.</p>\n\n<p>After an event cycle is completed and all tickets are validated and processed, a portion of GET is acquired from the open market and burned by the protocol, this is a deflationary mechanism which we call the GET burnback, more information can be found on the <a href=\"https://get-protocol.io/buyback/\">buyback web page here.</a></p>\n\n<h2>The Current GET Supply Distribution:</h2>\n\n<p>Circulating Supply - <strong>15,909,015</strong></p>\n\n<p>GET Protocol DAO Treasury - <strong>2,600,000</strong></p>\n\n<p>User Growth Fund - <strong>4,859,796</strong></p>\n\n<p>As more tickets are sold on the GET Protocol, the buyback results in increased demand for the GET token on the open market. <a href=\"https://coinmarketcap.com/currencies/get-protocol/\">If you’d like to see more details about the GET token, visit our Coin Market Cap page.</a></p>\n\n<h2>Links</h2>\n\n<p>Our Blog - <a href=\"https://medium.com/get-protocol\">https://medium.com/get-protocol</a></p>\n\n<p>Our Website - <a href=\"https://get-protocol.io/\">https://get-protocol.io/</a></p>\n\n<p>Twitter - <a href=\"https://twitter.com/getprotocol\">https://twitter.com/getprotocol</a></p>\n\n<p>Telegram Community - <a href=\"https://t.me/getprotocol\">https://t.me/getprotocol</a></p>\n\n<h2>Your Questions</h2>\n\n<p>We’re now going to open it up to you guys, curious to hear your thoughts, questions and criticisms. We’ll begin answering your questions at 4PM UTC / 12PM EST!</p>\n\n<p>Maybe we&#39;ll drop a surprise in the answers somewhere, but that would definitely only happen by mistake.</p>\n\n<p>EDIT 1: Here we go!!! Let&#39;s have some fun.</p>\n\n<p>EDIT 2: Dang, we accidentally mentioned the surprise. Will share it here as well:  </p>\n\n<p>We are proud to present our latest white-label integrator: Flockey!</p>\n\n<p>Flockey is a newly formed company that combines innovative technology from EY, Forkbeard and GET Protocol to enable event organisers to set up events in a safe &amp; secure way for both attendees and crew.</p>\n\n<p>The first event that Flockey is lending its services to is the Eurovision Songfestival* in Rotterdam.</p>\n\n<p><a href=\"https://flockey.nl/\">https://flockey.nl/</a></p>\n\n<p>(*Please note: tickets for Eurovision ’21 have been issued prior to the pandemic and are not GET-fuelled. All events that use the Flockey ticketing + monitoring application from here on out will be done through GET Protocol.)</p>\n</div><!-- SC_ON -->",
  "score": 342,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/StkKC5QPIWm0X5lT0sULhh0iJp6uD2NRKcT7Wr2mmEE.jpg?auto=webp&s=dd29be5532b9dee5923537623486b5ebb052e453",
          "width": 1050,
          "height": 550
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/StkKC5QPIWm0X5lT0sULhh0iJp6uD2NRKcT7Wr2mmEE.jpg?width=108&crop=smart&auto=webp&s=107059064afd1b9f5e4cbbe6ac31abf41c4f030f",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/StkKC5QPIWm0X5lT0sULhh0iJp6uD2NRKcT7Wr2mmEE.jpg?width=216&crop=smart&auto=webp&s=46fc06b245f52af36b22727a3114aecbf968026b",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/StkKC5QPIWm0X5lT0sULhh0iJp6uD2NRKcT7Wr2mmEE.jpg?width=320&crop=smart&auto=webp&s=04fc900b529da7a3f133d0191d9684312bfda4e9",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/StkKC5QPIWm0X5lT0sULhh0iJp6uD2NRKcT7Wr2mmEE.jpg?width=640&crop=smart&auto=webp&s=de23c4aa986c07399f4396e69197dcef02348455",
            "width": 640,
            "height": 335
          },
          {
            "url": "https://external-preview.redd.it/StkKC5QPIWm0X5lT0sULhh0iJp6uD2NRKcT7Wr2mmEE.jpg?width=960&crop=smart&auto=webp&s=788da8965ed379e6c8f0c9903052c3df7de87ebe",
            "width": 960,
            "height": 502
          }
        ],
        "variants": {},
        "id": "kHo70fWPBK2YINGYvXrxIzXbbjZlyBa2i7NlyAjGST4"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/mqrqkj/get_protocol_ama_drop_in_and_ask_us_anything/",
  "subreddit": "CryptoCurrency",
  "id": "mqrqkj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566615685
}