{
  "author": "jmlinpt",
  "original_created_utc": 1631353621,
  "title": "Let me tell you about Portugal for crypto living",
  "created_utc": 1631364814,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In Portugal, as of now, there are no taxes over crypto assets or gains.</p>\n\n<p>Cost of living is cheap compared to average European.</p>\n\n<p>Infrastructure is good. Roads, water, sanitation, power, Internet. All is in place.</p>\n\n<p>Weather is good. Not much rain. No snow. Hot summer. Nice beaches.</p>\n\n<p>Food is great. Tasty and diverse. Meat, fish, vegetables, there are options to all tastes.</p>\n\n<p>My retirement plan is to open a crypto friendly hotel where not only crypto is accepted as payment but we&#39;ll have workshops, discussions and a real crypto community enjoyng. One day I&#39;ll get there and you&#39;ll be welcome.</p>\n\n<p>If you want a nice country to enjoy a good crypto life, that is Portugal.</p>\n</div><!-- SC_ON -->",
  "score": 855,
  "permalink": "/r/CryptoCurrency/comments/pm4j1n/let_me_tell_you_about_portugal_for_crypto_living/",
  "subreddit": "CryptoCurrency",
  "id": "pm4j1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In Portugal, as of now, there are no taxes over crypto assets or gains.\n\nCost of living is cheap compared to average European.\n\nInfrastructure is good. Roads, water, sanitation, power, Internet. All is in\nplace.\n\nWeather is good. Not much rain. No snow. Hot summer. Nice beaches.\n\nFood is great.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポルトガルでは、今のところ、暗号資産や利得に対する税金はありません。\n\n生活費は平均的なヨーロッパに比べて安い。\n\nインフラも整っています。道路、水、衛生設備、電力、インターネット。すべてが整っています。\n整備されています。\n\n天気も良い。雨はあまり降っていない。雪もない。暑い夏。いいビーチだ。\n\n食べ物もおいしい....",
      "title": "ポルトガルでの暗号生活についてお話しします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在葡萄牙，截至目前，对加密货币资产或收益没有任何税收。\n\n与欧洲平均水平相比，生活成本很低。\n\n基础设施很好。道路、水、卫生设施、电力、互联网。一切都在\n场所。\n\n天气很好。雨量不大。没有雪。夏天很热。海滩不错。\n\n食物是伟大的....",
      "title": "让我告诉你葡萄牙的加密货币生活的情况"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在葡萄牙，截至目前，對加密貨幣資產或收益沒有任何稅收。\n\n與歐洲平均水平相比，生活成本很低。\n\n基礎設施很好。道路、水、衛生設施、電力、互聯網。一切都在\n場所。\n\n天氣很好。雨量不大。沒有雪。夏天很熱。海灘不錯。\n\n食物是偉大的....",
      "title": "讓我告訴你葡萄牙的加密貨幣生活的情況"
    }
  ]
}