{
  "author": "sylar999",
  "original_created_utc": 1657319688,
  "title": "Why are political assassinations not more common?",
  "created_utc": 1657398098,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;DISCLAIMER: THIS IS NOT AN ENDORMESNT OR CONDONING ANY ASSASSINATION OF ANY KIND.&lt;/p&gt;\n\n&lt;p&gt;Given that there are many parties that have vested interest in political change, with ample resources it seems like they should be more common. The price of a single assassination is assumedly pretty inexpensive compared to the amount of political change that it can cause. 100000$ may could buy a number of votes on a key issue, or cut the issue of at the source.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/vumsd1/why_are_political_assassinations_not_more_common/",
  "subreddit": "TrueAskReddit",
  "id": "vumsd1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "DISCLAIMER: THIS IS NOT AN ENDORMESNT OR CONDONING ANY ASSASSINATION OF ANY\nKIND.\n\nGiven that there are many parties that have vested interest in political change,\nwith ample resources it seems like they should be more common. The price of a\nsingle assassination is assumedly pretty inexpensive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：これは、いかなる種類の暗殺を支持・容認するものではありません。\nを推奨するものではありません。\n\n政変に既得権益を持つ政党が多数存在することを考慮し\nそのような政党がたくさんあることを考えると、暗殺はもっと一般的であるべきだと思います。その対価は\n一回の暗殺の値段はかなり安いと思われるのですが・・・。",
      "title": "なぜ、政治家の暗殺が多発しないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：这不是一个结束语，也不是纵容任何形式的暗杀行为。\n种类。\n\n鉴于有许多方面对政治变革有既得利益。\n有了充足的资源，他们似乎应该更常见。一次暗杀的代价\n一次暗杀的价格应该是很便宜的......",
      "title": "为什么政治暗杀不那么普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：這不是一個結束語，也不是縱容任何形式的暗殺行爲。\n種類。\n\n鑑於有許多方面對政治變革有既得利益。\n有了充足的資源，他們似乎應該更常見。一次暗殺的代價\n一次暗殺的價格應該是很便宜的......",
      "title": "爲什麼政治暗殺不那麼普遍？"
    }
  ]
}