{
  "author": "AskScienceModerator",
  "original_created_utc": 1637236879,
  "title": "AskScience AMA Series: We're here to discuss medical and societal problems of the homeless mentally ill, AUA!",
  "created_utc": 1637260081,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In recognition of Hunger and Homelessness Awareness Week (#HHWeek), join a discussion about the societal and medical problems that are not only faced by individuals with homelessness and mental illness, but also the limitations faced by the providers and care agents. Ira Glick, MD is an academic psychiatrist, Professor Emeritus of Psychiatry and Behavioral Sciences, previously Director of Inpatient Hospitalization Services, and Chief of the Schizophrenia Clinic at Stanford University School in addition to having been professor at UCSF and Cornell. Jack Tsai, PhD serves as Campus Dean and Professor of Public Health at the University of Texas Health Science Center at Houston. He is a licensed clinical psychologist with additional training in psychopharmacology and conducts research on severe mental illness, homelessness, and trauma.</p>\n\n<p><a href=\"https://twitter.com/RedditAskSci/status/1461339306354741251\">Proof!</a></p>\n\n<p>Read two recent articles at The Journal of Clinical Psychiatry co-authored by our hosts:</p>\n\n<ul>\n<li><a href=\"https://www.psychiatrist.com/jcp/depression/delivery-of-care/psychopharmacologists-medical-legal-societal-problems-homeless-mentally-ill/\">Psychopharmacologists and the Medical, Legal, and Societal Problems of the Homeless Mentally Ill: An Opinion</a> with Ira Glick, MD for the ASCP</li>\n<li><a href=\"https://www.psychiatrist.com/jcp/mental/veteran/ect-emergency-department-use-homeless-veterans/\">Effects of Electroconvulsive Therapy on Suicidal Behavior and Emergency Department Use Among Homeless Veterans: A Propensity Score-Matched Study</a> with Jack Tsai, PhD</li>\n</ul>\n\n<p>We&#39;ll be on from 11a - 2p ET (16-19 UT), AUA!</p>\n\n<p>Username: <a href=\"/u/PsychiatristCNS\">/u/PsychiatristCNS</a></p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askscience/comments/qwo8od/askscience_ama_series_were_here_to_discuss/",
  "subreddit": "askscience",
  "id": "qwo8od",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In recognition of Hunger and Homelessness Awareness Week (#HHWeek), join a\ndiscussion about the societal and medical problems that are not only faced by\nindividuals with homelessness and mental illness, but also the limitations faced\nby the providers and care agents. Ira Glick, MD is an academic…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "飢餓とホームレス問題に関する啓発週間（#HHWeek）に合わせて\nホームレスや精神疾患を持つ人が直面する社会的・医学的問題だけでなく\nホームレスや精神疾患を持つ人が直面する社会的・医学的問題だけでなく、提供者やケア年齢が直面する限界についても議論します。\nホームレスや精神疾患を持つ人たちが直面する社会的・医学的な問題や、医療提供者やケアエージェントが直面する限界について議論します。アイラ・グリック医学博士は、アカデミック...",
      "title": "AskScience AMAシリーズ。ホームレス精神病者の医学的・社会的問題を議論するために来ました！ AUA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为纪念饥饿和无家可归意识周（#HHWeek），请加入一个关于社会和医疗问题的讨论。\n讨论社会和医疗问题，这些问题不仅是无家可归者和精神疾病患者所面临的，也是他们所面临的限制。\n无家可归者和精神疾病患者所面临的社会和医疗问题，同时也面临着供应商和护理人员的限制。\n护理人员所面临的限制。艾拉-格里克，医学博士，是一名学术...",
      "title": "AskScience AMA系列。我们在这里讨论无家可归的精神病人的医疗和社会问题，AUA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲紀念飢餓和無家可歸意識周（#HHWeek），請加入一個關於社會和醫療問題的討論。\n討論社會和醫療問題，這些問題不僅是無家可歸者和精神疾病患者所面臨的，也是他們所面臨的限制。\n無家可歸者和精神疾病患者所面臨的社會和醫療問題，同時也面臨着供應商和護理人員的限制。\n護理人員所面臨的限制。艾拉-格里克，醫學博士，是一名學術...",
      "title": "AskScience AMA系列。我們在這裏討論無家可歸的精神病人的醫療和社會問題，AUA!"
    }
  ]
}