{
  "author": "UrMomIsLesserThanMe",
  "original_created_utc": 1660296040,
  "title": "Men - do you openly check out other women in front of your girlfriend?",
  "created_utc": 1660308467,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve(24f) been dating this guy (25m) for 8 months. He’s currently on a guys trip and they’ve been spending a lot of time on the beach. Today my boyfriend told me that he’d gotten so horny at the beach because of seeing all these women in bikinis, that he needed to\ngo back to his hotel room to masturbate. I lost it at him, but he says he only told me because he feels comfortable enough to do so. I feel sick about it. Is this normal for boyfriends to think, and is it normal for them to tell their girlfriends about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/wmgsze/men_do_you_openly_check_out_other_women_in_front/",
  "subreddit": "TooAfraidToAsk",
  "id": "wmgsze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I’ve(24f) been dating this guy (25m) for 8 months. He’s currently on a guys trip\nand they’ve been spending a lot of time on the beach. Today my boyfriend told me\nthat he’d gotten so horny at the beach because of seeing all these women in\nbikinis, that he needed to go back to his hotel room to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(24f)はこの人(25m)と8ヶ月間付き合っています。彼は今、男同士で旅行に行っていて\nビーチで過ごすことが多いそうです。今日、彼氏から\n今日、私のボーイフレンドが、ビーチでビキニ姿の女性たちを見てムラムラしてきたと言いました。\n今日、彼氏が「ビーチでビキニ姿の女性を見てムラムラしちゃったから、ホテルの部屋に戻って...",
      "title": "男性-恋人の前で堂々と他の女性をチェックしていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（24岁）和这个人（25岁）交往了8个月。他目前正在进行一次男士旅行\n他们花了很多时间在海滩上。今天我的男朋友告诉我\n他在海滩上变得非常饥渴，因为看到所有这些穿着比基尼的女人。\n比基尼，他需要回到他的酒店房间，以...",
      "title": "男人--你会在你女朋友面前公开打量其他女人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（24歲）和這個人（25歲）交往了8個月。他目前正在進行一次男士旅行\n他們花了很多時間在海灘上。今天我的男朋友告訴我\n他在海灘上變得非常飢渴，因爲看到所有這些穿着比基尼的女人。\n比基尼，他需要回到他的酒店房間，以...",
      "title": "男人--你會在你女朋友面前公開打量其他女人嗎？"
    }
  ]
}