{
  "author": "Positive-Vase-Flower",
  "original_created_utc": 1627899016,
  "title": "Why is being stagnant in life so frowned upon by todays society?",
  "created_utc": 1627907523,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently decided to reduce my workload to 80% to have every Friday off and so knowingly killed my chance for a promotion.</p>\n\n<p>My family and most of my friends reacted confused or even laughed at me because &quot;I wont get far with this mindset&quot; and similar things. I may have to add that I was already very overqualified for the job I am doing and I already got a lot of shit for that. </p>\n\n<p>They mentioned &quot;being stagnant and lazy&quot;, &quot;you wont grow like that&quot; or &quot;with your potential you have to aim higher&quot; and more. </p>\n\n<p>Now I kind of agree with them (not 100%) but why is this a bad thing? I like who I am at the moment. I like helping my coworker who maybe didnt have the same education I did. Also I hated the stressful time during University.</p>\n\n<p>It even surprises me more that with the climate change and overpopulation becoming more and more serious people still dont understand that maybe just be content with what we have is also a good thing.</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/NoStupidQuestions/comments/owbk2t/why_is_being_stagnant_in_life_so_frowned_upon_by/",
  "subreddit": "NoStupidQuestions",
  "id": "owbk2t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently decided to reduce my workload to 80% to have every Friday off and so\nknowingly killed my chance for a promotion.\n\nMy family and most of my friends reacted confused or even laughed at me because\n\"I wont get far with this mindset\" and similar things. I may have to add that I\nwas already…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は最近、毎週金曜日に休みを取るために仕事量を80％に減らすことにしました。\n承知の上で、昇進のチャンスを失ってしまいました。\n\n私の家族や友人のほとんどは、困惑したり、笑ったりしていました。\n「このような考え方では、遠くに行くことはできないだろう」などと言って、私を笑っていました。付け加えれば、私はすでに\n私はすでに...",
      "title": "なぜ現代社会では停滞した生活が嫌われるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近决定将我的工作量减少到80%，以便每个星期五都能休息，所以\n明知故犯地扼杀了我晋升的机会。\n\n我的家人和大多数朋友对我的反应感到困惑，甚至嘲笑我，因为\n\"以这种心态，我不会走得太远\"，以及类似的话。我可能不得不补充说，我\n是已经...",
      "title": "为什么在生活中停滞不前会被当今社会所诟病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近決定將我的工作量減少到80%，以便每個星期五都能休息，所以\n明知故犯地扼殺了我晉升的機會。\n\n我的家人和大多數朋友對我的反應感到困惑，甚至嘲笑我，因爲\n\"以這種心態，我不會走得太遠\"，以及類似的話。我可能不得不補充說，我\n是已經...",
      "title": "爲什麼在生活中停滯不前會被當今社會所詬病？"
    }
  ]
}