{
  "author": "xpinkrainbowsx",
  "original_created_utc": 1648840495,
  "title": "how can small-boobed girls gain confidence?",
  "created_utc": 1648856710,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m insecure about my small boobs and always have been. I’m a B-cup and I’ve looked into implants and fat transfers for awhile. That being said, this insecurity makes me hesitant to take off my shirt when my bf and I have sex. I really try to avoid it as much as possible honestly. I told my bf about my insecurity and he just tells me it doesn’t really matter to him and he likes my body as is. But I always feel like a participation trophy in society. It’s like if there were 100 clones of me, majority of guys would pick the me with bigger boobs. And I don’t like feeling like a second choice or feel like i’m just being accepted because there’s no better options at the time.&lt;/p&gt;\n\n&lt;p&gt;Reality is, I’m an almost 20 year old college student so I (unfortunately) don’t really have the funds for breast enhancement procedures. So I’m going to have to accept it, at least for the next couple years. What are some tips or advice on how to feel beautiful as a small chested girl?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/ttyxzs/how_can_smallboobed_girls_gain_confidence/",
  "subreddit": "TooAfraidToAsk",
  "id": "ttyxzs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m insecure about my small boobs and always have been. I’m a B-cup and I’ve\nlooked into implants and fat transfers for awhile. That being said, this\ninsecurity makes me hesitant to take off my shirt when my bf and I have sex. I\nreally try to avoid it as much as possible honestly. I told my bf…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自分の小さいおっぱいに自信がなく、ずっとそうでした。私はBカップなのですが、今まで\nしばらくはインプラントや脂肪移植を検討していました。とはいえ、この\nという不安から、彼とセックスするときにシャツを脱ぐのをためらってしまうのです。I\n正直なところ、できるだけ避けたいと思っています。夫には...",
      "title": "小胸の子が自信を持つには？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对自己的小胸脯没有安全感，而且一直如此。我是一个B罩杯，我已经看了一段时间的植入物和脂肪移植。\n我已经研究了一段时间的植入物和脂肪移植。这就是说，这种\n这种不安全感使我在和我的男朋友做爱的时候犹豫不决，不敢脱掉我的衣服。I\n说实话，我真的尽量避免这样做。我告诉我的男朋友...",
      "title": "小胸女生如何获得自信？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對自己的小胸脯沒有安全感，而且一直如此。我是一個B罩杯，我已經看了一段時間的植入物和脂肪移植。\n我已經研究了一段時間的植入物和脂肪移植。這就是說，這種\n這種不安全感使我在和我的男朋友做愛的時候猶豫不決，不敢脫掉我的衣服。I\n說實話，我真的儘量避免這樣做。我告訴我的男朋友...",
      "title": "小胸女生如何獲得自信？"
    }
  ]
}