{
  "author": "adamantcondition",
  "original_created_utc": 1643997674,
  "title": "Why does everyone act like they wouldn’t be a Nazi/racist/bigot/etc if they lived in circumstances where that was common?",
  "created_utc": 1644008798,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Someone had commented that Oskar Schindler was still a bastard because he was part of the Nazi party and therefore Nazi=bad. There’s no disputing that anyone who chooses to identify as a Nazi or segregationist or whatever when society collectively condemns those ideologies in modern times is horrible and deliberately hateful. But it’s not like the people who lived one or two generations ago are inherently more evil or hateful than people born today.&lt;/p&gt;\n\n&lt;p&gt;It’s easy to say that if you were in the same circumstances, you would have denounced Nazism or fought apartheid. Statistically, nearly everybody would be wrong. &lt;/p&gt;\n\n&lt;p&gt;I’m not saying we should celebrate historical figures who upheld oppressive systems and crimes against humanity, but I don’t understand where people get this smug sense that since we are taught certain things are wrong, we can be dismissive and condescending toward people who were never told to believe something else.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/skjv7u/why_does_everyone_act_like_they_wouldnt_be_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "skjv7u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Someone had commented that Oskar Schindler was still a bastard because he was\npart of the Nazi party and therefore Nazi=bad. There’s no disputing that anyone\nwho chooses to identify as a Nazi or segregationist or whatever when society\ncollectively condemns those ideologies in modern times is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある人が、オスカー・シンドラーはやはりろくでなしだ、とコメントしていた。\nナチス党の一員であり、ナチス＝悪である。ということに異論はないでしょう。\nナチスや人種隔離主義者であることを選択した人は、社会的に\n現代において、これらのイデオロギーを集団で非難するのは...",
      "title": "なぜ皆、それが一般的な状況で生きていれば、ナチ/人種差別主義者/偏屈者/等にはならないかのように振る舞うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人评论说，奥斯卡-辛德勒仍然是一个混蛋，因为他是纳粹党的一部分，所以纳粹=坏。\n他是纳粹党的一部分，因此纳粹=坏。毋庸置疑，任何人\n选择认同为纳粹或种族隔离主义者或其他什么的人，当社会\n在现代社会集体谴责这些意识形态的人是......",
      "title": "为什么每个人都表现得好像他们不会成为纳粹/种族主义者/偏执狂/等等，如果他们生活在这样的环境中是常见的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人評論說，奧斯卡-辛德勒仍然是一個混蛋，因爲他是納粹黨的一部分，所以納粹=壞。\n他是納粹黨的一部分，因此納粹=壞。毋庸置疑，任何人\n選擇認同爲納粹或種族隔離主義者或其他什麼的人，當社會\n在現代社會集體譴責這些意識形態的人是......",
      "title": "爲什麼每個人都表現得好像他們不會成爲納粹/種族主義者/偏執狂/等等，如果他們生活在這樣的環境中是常見的？"
    }
  ]
}