{
  "author": "Adodie",
  "original_created_utc": 1647136491,
  "title": "Why doesn't the flu (unlike Covid) continually get more transmissible over time?",
  "created_utc": 1647205267,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throughout the Covid-19 pandemic, we have repeatedly seen more transmissible variants emerge. As I understand it, this is evolutionarily almost inevitable: if a strain has a mutation that makes it more transmissible, it should generally outcompete less transmissible variants until it becomes dominant (exceptions being 1) if it is substantially more lethal such that it kills people before they can spread it, but this hasn&amp;#39;t been a factor for Covid-19, and 2) if a variant is better able to overcome prior immunity, it may become dominant even if it doesn&amp;#39;t have an inherent transmissibility advantage). This happened with Alpha, then Delta, the Omicron, etc. &lt;/p&gt;\n\n&lt;p&gt;The implication seems to be that infectious diseases should have evolutionary pressures almost constantly pushing them towards greater infectiousness. &lt;/p&gt;\n\n&lt;p&gt;However (to my understanding), the flu hasn&amp;#39;t inevitably gotten more infectious over time. Instead, some seasons will have more infectious strains than others.&lt;/p&gt;\n\n&lt;p&gt;Why is this? &lt;/p&gt;\n\n&lt;p&gt;Thanks in advance, and my apologies if anything or any premise in this question is incorrect!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/askscience/comments/tcwdqs/why_doesnt_the_flu_unlike_covid_continually_get/",
  "subreddit": "askscience",
  "id": "tcwdqs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Throughout the Covid-19 pandemic, we have repeatedly seen more transmissible\nvariants emerge. As I understand it, this is evolutionarily almost inevitable:\nif a strain has a mutation that makes it more transmissible, it should generally\noutcompete less transmissible variants until it becomes…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Covid-19のパンデミックの間、私たちは繰り返し、より感染しやすいものを見てきました。\nの変種が出現した。私の理解では、これは進化的にほぼ必然です。\nある株がより伝染しやすい突然変異を起こせば、それは一般的に\n感染しにくい品種と競争して...",
      "title": "インフルエンザは（コビットと違って）なぜ時間が経っても継続的に感染力が強まらないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在整个Covid-19大流行期间，我们一再看到更多可传播的\n变种的出现。根据我的理解，这在进化上几乎是不可避免的。\n如果一个菌株有一个突变，使其更具传播性，它通常应该\n竞争传播性较低的变种，直到它成为......",
      "title": "为什么流感（不像科维德）不会随着时间的推移而不断地变得更有传播性？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在整個Covid-19大流行期間，我們一再看到更多可傳播的\n變種的出現。根據我的理解，這在進化上幾乎是不可避免的。\n如果一個菌株有一個突變，使其更具傳播性，它通常應該\n競爭傳播性較低的變種，直到它成爲......",
      "title": "爲什麼流感（不像科維德）不會隨着時間的推移而不斷地變得更有傳播性？"
    }
  ]
}