{
  "author": "samdane7777",
  "original_created_utc": 1628223225,
  "title": "Listen to Me Extremely Carefully on The Second Portman Bill Amendment Banning DeFi",
  "created_utc": 1628246600,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p>Some of you may be tempted to go along with this last minute backstab by Portman and Warner where they completely remove protection for anyone in the space who is not a PoW miner or provider of software and hardware to secure private keys. </p>\n\n<p>You need to understand that the future of this industry is DeFi layer 2, whether that is on Bitcoin or something else. It is going to be a combination of layer 2 defi and lightning technology. There is a very clear ethos of censorship resistance for the most disenfranchised built into smart contract based systems, just as with bitcoin.</p>\n\n<p>I struggle to make this argument to bitcoiners because of ignorance about how US law works. Ignorance specifically concerning the Patriot act, Facta, The banking secrecy act, Fatf,  SEC laws, and CFTC laws. Rest assured, they can and will carry these laws forward to use against any lightning application or DeFi product based on native bitcoin, any business operator or coder or facilitator of such technology, anywhere in the world, no matter citizenship can and will be federally prosecuted and extradited. If they find you they will extradite you. No one is safe.</p>\n\n<p>This is a direct ban on DeFi. On smart contracts in general on permissionless systems, to ensure that the only smart contracts offered are on permissioned systems they have backdoors to, full patent control over. I.,e banks controlling them as de facto censorable Centralized Exchanges.</p>\n\n<p>Do you want to live in a world with no DeFi? Do you only want centralized exchanges and the absolute guaranteed censorship on the global south that that entails? </p>\n\n<p>You cannot collect KYC on smart contract. They know this. They know it is impossible, and that it turns non compliant non us citizen into felony offenders. They will come for you. How do you think they intimidated Binance and Bitmex? How do you think they caught Mcafee? It is impossible for a normal smart contract to ban US citizens. Backends can&#39;t censor people.</p>\n\n<p>This means it is illegal by default. <em>No one in the world can safely operate DeFi without KYC if this bill passes.</em> </p>\n\n<p><em>No one in the world can safely operate DeFi without KYC if this bill passes.</em> </p>\n\n<p><em>No one in the world can safely operate DeFi without KYC if this bill passes.</em> </p>\n\n<p>Once that passes, then they will pass ESG laws to censor miners and run them out of the country. They&#39;re trying to pick us off one by one. </p>\n\n<p>C A LL your Senator. Tell everyone, explain to your friends, get the message out. This is them using a hydrogen bomb on us with no time, input, or constructive nuance. It is totalitarian, poorly worded, and incoherent and shows the Whitehouse clearly doesn&#39;t know wtf they&#39;re talking about and the Treasury doesn&#39;t care if they ban technology to the point of strangling it in the crib despite knowing it will lose more tax then it collects.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/Bitcoin/comments/oyzahi/listen_to_me_extremely_carefully_on_the_second/",
  "subreddit": "Bitcoin",
  "id": "oyzahi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some of you may be tempted to go along with this last minute backstab by Portman\nand Warner where they completely remove protection for anyone in the space who\nis not a PoW miner or provider of software and hardware to secure private keys.\n\nYou need to understand that the future of this industry is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんの中には、このPortmanとWarnerの土壇場の裏切りに付き合いたいと思っている人もいるでしょう。\nとワーナーは、この分野でPoWマイニングや安全なソフトウェアやハードウェアを提供していない人の保護を完全に排除しました。\nPoW採掘者や秘密鍵を保護するソフトウェアやハードウェアを提供していない人の保護を完全に取り払うというものです。\n\nしかし、この業界の未来は...と理解する必要があります。",
      "title": "第二次ポートマン法案の修正案でDeFiを禁止するために、私の話を非常に注意深く聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们中的一些人可能会受到诱惑，同意波特曼和华纳在最后一刻的反击。\n和Warner在最后一刻的反击，他们完全取消了对该领域中任何不是PoW矿工或保护私人KTV的软件和硬件供应商的保护。\n不是PoW矿工或保护私钥的软件和硬件供应商。\n\n你需要明白，这个行业的未来是...",
      "title": "仔细聆听我对禁止DeFi的第二个波特曼法案修正案的看法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們中的一些人可能會受到誘惑，同意波特曼和華納在最後一刻的反擊。\n和Warner在最後一刻的反擊，他們完全取消了對該領域中任何不是PoW礦工或保護私人KTV的軟件和硬件供應商的保護。\n不是PoW礦工或保護私鑰的軟件和硬件供應商。\n\n你需要明白，這個行業的未來是...",
      "title": "仔細聆聽我對禁止DeFi的第二個波特曼法案修正案的看法"
    }
  ]
}