{
  "author": "Notmiefault",
  "original_created_utc": 1636419245,
  "title": "In Midsummer Night's Dream, Theseus decides to watch the Rude Mechanicals' play specifically because he expects it will be entertainingly terrible. Nowadays many watch movies like \"The Room\" for the same reason. Just how old is the idea of \"so bad it's good\" entertainment?",
  "created_utc": 1636432802,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember also hearing similar stories of an opera singer around the end of the 19th century. Curious if this &quot;tradition&quot;, of engaging in entertainment specifically to laugh at its incompetence, has a longer history. Were there famously bad Roman gladiators? Terrible plays in Ancient Greece to give the audience a break from Oedipus Rex?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/qprv6a/in_midsummer_nights_dream_theseus_decides_to/",
  "subreddit": "AskHistorians",
  "id": "qprv6a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I remember also hearing similar stories of an opera singer around the end of the\n19th century. Curious if this \"tradition\", of engaging in entertainment\nspecifically to laugh at its incompetence, has a longer history. Were there\nfamously bad Roman gladiators? Terrible plays in Ancient Greece to give…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "19世紀末頃のオペラ歌手の話も聞いたことがあります。\n19世紀末のオペラ歌手の話も聞いたことがあります。娯楽を楽しむことで、その無能さを笑うというこの「伝統」は\nこのような「伝統」はもっと長い歴史があるのだろうか。ローマの剣闘士には\n有名なローマの剣闘士は悪かったのか？古代ギリシャでは、ひどい芝居で...",
      "title": "真夏の夜の夢』で、テセウスが無作法な機械人たちの劇を見ることにしたのは、それが楽しくてひどいものになると期待したからだ。現在では、多くの人が同じ理由で『The Room』のような映画を見ています。\"悪いから良い \"という考え方は何年前からあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得还听到过类似的故事，大约在19世纪末，一位歌剧演员\n19世纪末。好奇的是，这种 \"传统\"，即参与娱乐活动\n特别是嘲笑它的无能，是否有更长的历史。是否有\n著名的坏罗马角斗士？在古希腊有可怕的戏剧来给...",
      "title": "在《仲夏夜之梦》中，特修斯决定观看粗鲁的机械人的戏剧，特别是因为他期待它将是娱乐性的可怕。现在很多人看《房间》这样的电影也是出于同样的原因。只是，\"糟糕到极致 \"的娱乐理念到底有多老？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得還聽到過類似的故事，大約在19世紀末，一位歌劇演員\n19世紀末。好奇的是，這種 \"傳統\"，即參與娛樂活動\n特別是嘲笑它的無能，是否有更長的歷史。是否有\n著名的壞羅馬角鬥士？在古希臘有可怕的戲劇來給...",
      "title": "在《仲夏夜之夢》中，特修斯決定觀看粗魯的機械人的戲劇，特別是因爲他期待它將是娛樂性的可怕。現在很多人看《房間》這樣的電影也是出於同樣的原因。只是，\"糟糕到極致 \"的娛樂理念到底有多老？"
    }
  ]
}