{
  "author": "Tularemia",
  "original_created_utc": 1638670922,
  "title": "Why is the US extermination and removal of the Native Americans not considered a “genocide”? Is this not labeled as a genocide because of a true consensus of historians on the historical record, or is this purely ignored due to political reasons?",
  "created_utc": 1638689234,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The actions of the US Government against the indigenous Native American tribes seem pretty clearly consistent with the accepted definition genocide (there is a great description by &lt;a href=\"/u/dhowlett1692\"&gt;u/dhowlett1692&lt;/a&gt; &lt;a href=\"https://old.reddit.com/r/AskHistorians/comments/p5v7lp/native_american_genocides/h98ryuu/\"&gt;here&lt;/a&gt; ). Is there a true consensus on this topic among historians? I imagine political pressure is a major factor why this would be an &lt;em&gt;unpopular&lt;/em&gt; label to brand the US government with, but is it a label that is deserved?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/r958ta/why_is_the_us_extermination_and_removal_of_the/",
  "subreddit": "AskHistorians",
  "id": "r958ta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The actions of the US Government against the indigenous Native American tribes\nseem pretty clearly consistent with the accepted definition genocide (there is a\ngreat description by u/dhowlett1692 [/u/dhowlett1692]…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ政府が先住民であるネイティブアメリカンの部族に対して行った行為について\nジェノサイドの定義と明確に一致しているように思われます。\nu/dhowlett1692[/u/dhowlett1692]による素晴らしい記述...。",
      "title": "アメリカによるネイティブ・アメリカンの駆除・排除が「ジェノサイド」とされないのはなぜか？これがジェノサイドとレッテルを貼られないのは、史料に対する歴史家の真のコンセンサスがあるからなのか、それとも純粋に政治的な理由で無視されているのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "美国政府对美国原住民部落的行动\n似乎非常清楚地符合公认的种族灭绝的定义（有一个\nu/dhowlett1692 [/u/dhowlett1692]的精彩描述...",
      "title": "为什么美国对美国原住民的灭绝和迁移不被认为是 \"种族灭绝\"？这不是因为历史学家对历史记录的真正共识而被贴上种族灭绝的标签，还是纯粹因为政治原因而被忽略？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國政府對美國原住民部落的行動\n似乎非常清楚地符合公認的種族滅絕的定義（有一個\nu/dhowlett1692 [/u/dhowlett1692]的精彩描述...",
      "title": "爲什麼美國對美國原住民的滅絕和遷移不被認爲是 \"種族滅絕\"？這不是因爲歷史學家對歷史記錄的真正共識而被貼上種族滅絕的標籤，還是純粹因爲政治原因而被忽略？"
    }
  ]
}