{
  "author": "Original1Username",
  "original_created_utc": 1639683665,
  "title": "Did average Roman slaves really have more time off work than the average US worker?",
  "created_utc": 1639694205,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So... A friend of mine has a dual masters in history and US history. I&amp;#39;m something of a history enthusiast myself though I lack the degree. I just like the books and learning about all the crazy shit humans have been up to.&lt;/p&gt;\n\n&lt;p&gt;Him and I had an interesting conversation recently. He stated that most Roman slaves had a 4 day work week, with way more holidays due to the celebrations of various gods. &lt;/p&gt;\n\n&lt;p&gt;There were of course, exceptions. Some job details of Roman slavery were basically death sentences, such as mine work. &lt;/p&gt;\n\n&lt;p&gt;My own research into the subject seems to back him up. 4 day work week and the holidays of various gods being observed, as well as harvest celebrations and other city celebrations. It also doesn&amp;#39;t seem to make a difference when considering the time period of Roman history very much... the biggest split being pre and post Spartacus in terms of slave treatment. My own research seems to indicate that the average Roman slave, especially a skilled slave like a blacksmith is muuuuuch better treated and even paid better than the mechanic I am today.&lt;/p&gt;\n\n&lt;p&gt;Just curious what other historians thought about this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/rhydpm/did_average_roman_slaves_really_have_more_time/",
  "subreddit": "AskHistorians",
  "id": "rhydpm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So... A friend of mine has a dual masters in history and US history. I'm\nsomething of a history enthusiast myself though I lack the degree. I just like\nthe books and learning about all the crazy shit humans have been up to.\n\nHim and I had an interesting conversation recently. He stated that most…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の友人は歴史と米国史の二重の修士号を持っているんです。私は\n学位はありませんが、私も歴史が好きです。ただ、好きなのは\n本や、人類がやってきたとんでもないことを学ぶことができる。\n\n最近、彼と面白い話をした。彼が言うには、ほとんどの...",
      "title": "ローマの平均的な奴隷は、本当にアメリカの平均的な労働者よりも仕事が休める時間が長かったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以......我的一个朋友拥有历史和美国历史的双硕士学位。我是\n自己也是一个历史爱好者，虽然我没有这个学位。我只是喜欢\n书和了解人类所有的疯狂行为。\n\n他和我最近进行了一次有趣的谈话。他说，大多数...",
      "title": "罗马的普通奴隶真的比美国的普通工人有更多的休息时间吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以......我的一個朋友擁有歷史和美國曆史的雙碩士學位。我是\n自己也是一個歷史愛好者，雖然我沒有這個學位。我只是喜歡\n書和了解人類所有的瘋狂行爲。\n\n他和我最近進行了一次有趣的談話。他說，大多數...",
      "title": "羅馬的普通奴隸真的比美國的普通工人有更多的休息時間嗎？"
    }
  ]
}