{
  "author": "gkaykck",
  "original_created_utc": 1644666585,
  "title": "[OC] I've made an analysis tool for cryptocurrency source code. Here are the results for Bitcoin, Ethereum, Solana, EOS.",
  "created_utc": 1644676479,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey r /cc,&lt;/p&gt;\n\n&lt;p&gt;I’m working on a project that can bring more transparency to blockchain projects and their development. Blockchain development is usually done in an open-sourced way, where anyone can see what developers are working on. But this information is usually only accessible to people who are developers themselves. Browsing a git repository, trying to understand what a commit, branch, or tag does is not really understandable for most non-developers. With the tool I&amp;#39;m developing I&amp;#39;m planning to shed a bit of light on what teams are doing and how the projects are progressing.&lt;/p&gt;\n\n&lt;p&gt;In this post, I&amp;#39;d like to go over some of the metrics I&amp;#39;ve found interesting on different blockchains and how they can be used to understand the development of a project. All of the results I describe here are based on the tool I&amp;#39;ve written and my personal experience in software development. Someone else with a different background might interpret the results differently.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m filtering out changes with more than 1000 lines and less than 100 lines. In my opinion, outside of this range, there is too much noise to be useful. I&amp;#39;m also just inspecting the block producer code. In the next iterations, I&amp;#39;ll take a look into entire organizations with all repositories. Let&amp;#39;s start with bitcoin itself.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6pya36ib4eh81.png?width=2062&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c6141e3f03eeae7bcdd4c47d91d6fafb0932a3ee\"&gt;https://preview.redd.it/6pya36ib4eh81.png?width=2062&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=c6141e3f03eeae7bcdd4c47d91d6fafb0932a3ee&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;From the executive summary, I can see that ~9 % of the contributors who contribute to bitcoin are still onboard. But on the knowledge retention, we can see that some of the &amp;quot;heavy hitters&amp;quot; have left the project. Usually, this number starts at 100% for new projects and slowly decreases. Knowledge retention is a measure of how many lines of code which was edited by a certain contributor and if that contributor is still on-board. Remember that bitcoin had this block size war at some point, so it&amp;#39;s normal to see some of the developers who contributed to bitcoin leave the project. Having a refactoring rate of ~60 % means that more than half of its codebase is re-written. And it&amp;#39;s more or less in normal bounds.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/38njz74c4eh81.png?width=2062&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ad3d07018d264085068778f2022b4b97341c146f\"&gt;https://preview.redd.it/38njz74c4eh81.png?width=2062&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ad3d07018d264085068778f2022b4b97341c146f&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Looking at the versions chart, it shows a steady and continuous development. If we look at some of the latest large updates, we can see that they are mostly rewrites. Of course, it&amp;#39;s necessary to check more messages to get a better understanding but I want to leave it to users.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s move on to the Ethereum project.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/jsn1lk4f4eh81.png?width=2048&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7c882e71a3536ff20e0c00b13047aa06f2a08706\"&gt;https://preview.redd.it/jsn1lk4f4eh81.png?width=2048&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7c882e71a3536ff20e0c00b13047aa06f2a08706&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Ethereum shows worse results in the executive summary than bitcoin. This is quite surprising to me because Ethereum is a younger project than bitcoin. Yet the constant delays in their releases and always changing targets and deadlines, it seems like the metrics make sense. Only 7% of the contributors are still onboard, and the onboarded contributors only contributed 0.39% of the total changes. I would expect the new teams to re-do the same mistakes that previous teams did or re-write the same code again to understand it easier. I think a 60% refactoring rate is what we can assume to be generally good. But lower numbers would probably mean that projects are adding features faster than Ethereum and Bitcoin.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/bpco6j3g4eh81.png?width=2042&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b781d229af8621c5471440878ba73351fc7255c5\"&gt;https://preview.redd.it/bpco6j3g4eh81.png?width=2042&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b781d229af8621c5471440878ba73351fc7255c5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;On the versions chart, last month seems like getting a bit more silent in Ethereum miner development. But keep in mind, this data is only from go-ethereum project, maybe the team might have their focus on some other repository nowadays.&lt;/p&gt;\n\n&lt;p&gt;Now Solana.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/3vi6799h4eh81.png?width=2074&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7e20865a1b620ca2b690a7c30e056f24b5d56f11\"&gt;https://preview.redd.it/3vi6799h4eh81.png?width=2074&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=7e20865a1b620ca2b690a7c30e056f24b5d56f11&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Solana shows better results in the executive summary than Ethereum. But because Solana is a much younger project, higher team and knowledge retention is expected. This will result in faster deliveries and more features. But it&amp;#39;s important to check this measure from time to time to see if they start bleeding talent.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/mjrzaj6i4eh81.png?width=2040&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=70046d0077a79310d5af93032f20d65be504dcaf\"&gt;https://preview.redd.it/mjrzaj6i4eh81.png?width=2040&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=70046d0077a79310d5af93032f20d65be504dcaf&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Looking at the versions chart, we can see that there is constant development with more systematic changes which would be expected from an &amp;quot;industry like development&amp;quot; project with focused teams and serious project management. In a commit message from 2019, we can see that they were already trying to offload some work to GPU&amp;#39;s from start. Yet I&amp;#39;m curious what other changes are done in the subject, so I&amp;#39;m going to search for updates with GPU messages in them.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/tm9b8uij4eh81.png?width=2048&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d6a35ae9ed4410f0612f2405b4ef2c9c65e356b4\"&gt;https://preview.redd.it/tm9b8uij4eh81.png?width=2048&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d6a35ae9ed4410f0612f2405b4ef2c9c65e356b4&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Hmm, interestingly it seems like there is not much development being done with GPU term in the message.&lt;/p&gt;\n\n&lt;p&gt;Ok now let&amp;#39;s move on to EOS.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/06x71zdk4eh81.png?width=2040&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d1516662b8182f6eaddde966e2b628c344479e1e\"&gt;https://preview.redd.it/06x71zdk4eh81.png?width=2040&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d1516662b8182f6eaddde966e2b628c344479e1e&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m putting it here as it verifies the data I have. EOS is an old project which is riddled with issues. The executive summary shows that ~0% of the contributors are still onboard. This means no one is contributing to the project systematically anymore for 90 days. This is a very interesting metric to look at because it&amp;#39;s really hard to onboard people back onto a codebase as complicated as EOS.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/qhan02al4eh81.png?width=2042&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ef1af6b99d17370e3c76906b9fcd78f2774735a5\"&gt;https://preview.redd.it/qhan02al4eh81.png?width=2042&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=ef1af6b99d17370e3c76906b9fcd78f2774735a5&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;In the versions chart, we can see that there is a sudden drop in the development NOV 2020. Afterward, it seems like it&amp;#39;s completely stopped in MAY 2021(the chart of EOS ends here, not today). Of course, there might be some changes happening, but our filters are filtering them out, with these settings.&lt;/p&gt;\n\n&lt;p&gt;I think that&amp;#39;s enough for now, I&amp;#39;ll be updating the tool with the new data I find and I&amp;#39;ll be adding more metrics. In the next weeks, I&amp;#39;ll set up a notification system where users can get e-mails or push notifications when certain filter results bring new data. ex, you can subscribe to GPU updates on Solana and you&amp;#39;ll get an e-mail when there is a new update.&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;d like to access the tool while I&amp;#39;m developing it, you can subscribe to my Patreon(&lt;a href=\"https://www.patreon.com/gkaykck\"&gt;https://www.patreon.com/gkaykck&lt;/a&gt;) and get an access link to the tool. After you get the access link, you are free to share it with friends if you&amp;#39;d like, but I will update the key from time to time and post a new key on my Patreon page only to subscribers. So you can make your friends beg you for the new link :). But keep in mind that the application is really resource intensive and expensive to host as it&amp;#39;s scanning through many gigabytes of data on every filter change. So I would ask you to not publish the access link on any online forums, the application can become unusable until the next key change.&lt;/p&gt;\n\n&lt;p&gt;Currently, you can inspect the following blockchain miners with the application;&lt;/p&gt;\n\n&lt;p&gt;- Bitcoin&lt;/p&gt;\n\n&lt;p&gt;- Ethereum&lt;/p&gt;\n\n&lt;p&gt;- Stellar&lt;/p&gt;\n\n&lt;p&gt;- Avax&lt;/p&gt;\n\n&lt;p&gt;- Matic&lt;/p&gt;\n\n&lt;p&gt;- Cosmos&lt;/p&gt;\n\n&lt;p&gt;- Cardano&lt;/p&gt;\n\n&lt;p&gt;- Polkadot&lt;/p&gt;\n\n&lt;p&gt;- Algorand&lt;/p&gt;\n\n&lt;p&gt;- Solana&lt;/p&gt;\n\n&lt;p&gt;- Hedera&lt;/p&gt;\n\n&lt;p&gt;- Elrond&lt;/p&gt;\n\n&lt;p&gt;- Filecoin&lt;/p&gt;\n\n&lt;p&gt;- Theta&lt;/p&gt;\n\n&lt;p&gt;- Helium&lt;/p&gt;\n\n&lt;p&gt;- Monero&lt;/p&gt;\n\n&lt;p&gt;- IOTA&lt;/p&gt;\n\n&lt;p&gt;- Flow&lt;/p&gt;\n\n&lt;p&gt;- EOS&lt;/p&gt;\n\n&lt;p&gt;- The Graph&lt;/p&gt;\n\n&lt;p&gt;- Loopring&lt;/p&gt;\n\n&lt;p&gt;- Arweave&lt;/p&gt;\n\n&lt;p&gt;- Kadena&lt;/p&gt;\n\n&lt;p&gt;If you&amp;#39;d like to suggest a new blockchain repository or use the tool for inspecting a repository you have, please get in contact with me through Patreon!&lt;/p&gt;\n\n&lt;p&gt;Cheers!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 355,
  "permalink": "/r/CryptoCurrency/comments/sqpuhy/oc_ive_made_an_analysis_tool_for_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "sqpuhy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey r /cc,\n\nI’m working on a project that can bring more transparency to blockchain projects\nand their development. Blockchain development is usually done in an open-sourced\nway, where anyone can see what developers are working on. But this information\nis usually only accessible to people who are…"
}