{
  "author": "maxadorable",
  "the_new_excerpt": "After reading this:\nhttps://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs\n\n\n\nI came to realize how good apple management team is and how good Tim Cook is at\nnavigating the space in terms of politics. Apple has some of the highest…",
  "original_created_utc": 1613604900,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "看完这个。\nhttps://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs\n\n\n\n我开始意识到苹果管理团队有多好，蒂姆-库克有多好。\n在政治方面导航空间。苹果拥有一些最高的...",
      "title": "现在极度看好苹果"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看完這個。\nhttps://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs\n\n\n\n我開始意識到蘋果管理團隊有多好，蒂姆-庫克有多好。\n在政治方面導航空間。蘋果擁有一些最高的...",
      "title": "現在極度看好蘋果"
    }
  ],
  "title": "Extremely bullish on apple now",
  "created_utc": 1613615200,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After reading this: <a href=\"https://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs\">https://www.bloomberg.com/news/features/2021-02-09/this-is-how-tim-cook-transformed-apple-aapl-after-steve-jobs</a></p>\n\n<p>&#x200B;</p>\n\n<p>I came to realize how good apple management team is and how good Tim Cook is at navigating the space in terms of politics. Apple has some of the highest margins (seem to be only increasing), insane revenue (they are still growing), good moat (its a hardware company basically), immune to monopoly regulation (they only control like what? 6% of the entire smartphone market?), great marketing, and have a lot of vertical integration (iMessage, Apple m1, iCloud, Apple Card, Apple one, etc). They also have shit ton of cash (they can buy Netflix full on the spot basically), and assets (their headquarters is roughly worth around $5B for example). Lastly, they have a lot of room to grow because they are so far from a monopoly, and they going into other areas where they can dominate (Apple Car, Apple card, Apple TV+, Apple Arcade+). </p>\n\n<p>Here are the other areas they dominate: Apple iPad, and Apple Watch. Nothing comes close to competitors. </p>\n\n<p>The only area where I can see apple failing is if they just keep riding the wave, and get lazy with their product innovations (you can argue this is already happening). However, after the latest apple chip, and the amount of cash they have, they got to be failing a lot and for a long time for Apple to be in any bad spot. Hence, it&#39;s a safe bet in my eyes with a decent amount of upside. </p>\n\n<p>&#x200B;</p>\n\n<p>I like the stock. A lot.</p>\n</div><!-- SC_ON -->",
  "score": 309,
  "permalink": "/r/stocks/comments/lm7zp9/extremely_bullish_on_apple_now/",
  "subreddit": "stocks",
  "id": "lm7zp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728625116
}