{
  "author": "AskScienceModerator",
  "original_created_utc": 1636022233,
  "title": "AskScience AMA Series: I'm Iñigo San Millán, a researcher who trains world-class athletes, including the two-time Tour de France winner, with the goal of learning more about cancer, diabetes and other diseases. I've learned exercise is the most powerful medicine in the world. AMA!",
  "created_utc": 1636034344,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, Reddit! I&#39;m Iñigo San Millán. I am an assistant professor in the <a href=\"https://medschool.cuanschutz.edu/endocrinology\">Division of Endocrinology, Metabolism and Diabetes</a> and Medical Oncology at the <a href=\"https://medschool.cuanschutz.edu/\">University of Colorado School of Medicine</a> and associate research professor in the Department of Human Physiology and Nutrition at the University of Colorado, Colorado Springs.</p>\n\n<p>I&#39;ve also coached Slovenian cyclist Tadej Pogačar to two consecutive Tour de France victories and I try to provide the most precise, scientifically-based training for athletes at the top of their game. But that&#39;s only part of it. I also work with elite athletes to better understand the intersection of metabolism and disease, and I&#39;ve developed new insights into how regular exercise shapes our long-term health.</p>\n\n<p>I&#39;m here to talk about and take your questions on a variety of topics including:</p>\n\n<ul>\n<li>What is metabolic health?</li>\n<li>What&#39;s the relationship between exercise and cancer? Or Type II Diabetes and Alzheimer&#39;s?</li>\n<li>Why is exercise the most powerful medicine in the world? And how can different exercises affect how our mitochondrial functions?</li>\n<li>What kind of training do elite athletes do in order to perform their best?</li>\n<li>What is the nutrition of a Tour de France winner?</li>\n</ul>\n\n<p>My research is trying to help to identify the role that metabolism could play in the development of different diseases characterized by mitochondrial impairment or dysfunction.  I can elaborate on the connection between Type II Diabetes and Alzheimer&#39;s, as well as the role that lactate plays in cancer development. I can also explain the most effective form of exercise to maintain metabolic health and how fueling and exercise efficiency looks different for everyone. </p>\n\n<p>I&#39;ll sign on around 10AM MT (1 PM ET, 17 UT), AMA!</p>\n\n<p>More Info:</p>\n\n<ul>\n<li><a href=\"https://news.cuanschutz.edu/news-stories/the-science-of-super-athletes\">The Science of Super Athletes - Podcast</a></li>\n<li><a href=\"https://news.cuanschutz.edu/news-stories/defining-physiologys-upper-limits-and-again-winning-the-tour-de-france\">Defining Physiology&#39;s Upper Limits and - Again - Winning the Tour de France</a></li>\n<li><a href=\"https://www.researchgate.net/profile/Inigo-San-Millan\">ResearchGate Profile</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=DZfOvYiQtow\">Ted Talk: Winning the Battle Against Metabolic Disorders</a></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/askscience/comments/qmhrj3/askscience_ama_series_im_iñigo_san_millán_a/",
  "subreddit": "askscience",
  "id": "qmhrj3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi, Reddit! I'm Iñigo San Millán. I am an assistant professor in the Division of\nEndocrinology, Metabolism and Diabetes\n[https://medschool.cuanschutz.edu/endocrinology] and Medical Oncology at the\nUniversity of Colorado School of Medicine [https://medschool.cuanschutz.edu/]\nand associate research…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、Reddit! 私はイニーゴ・サン・ミランです。内分泌・代謝・糖尿病内科の助教授をしています。\n内分泌・代謝・糖尿病部門の助教授です。\n内分泌・代謝・糖尿病部門 [https://medschool.cuanschutz.edu/endocrinology] と医療腫瘍部門の助教授です。\nコロラド大学医学部の内分泌・代謝・糖尿病部門[https://medschool.cuanschutz.edu/]と医療腫瘍学部門の助教授[https://medschool.cuanschutz.edu/]です。\nまた、アソシエイト・リサーチ...",
      "title": "AskScience AMAシリーズ。私は、がんや糖尿病などの病気について知ることを目的に、ツール・ド・フランスを2度制覇した選手をはじめとする世界的なアスリートのトレーニングを行っている研究者のイニーゴ・サン・ミランです。私は、運動が世界で最も強力な薬であることを知りました。AMA!"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，Reddit! 我是伊尼戈-圣米伦。我是一名助理教授，在\n内分泌、代谢和糖尿病科的助理教授。\n[https://medschool.cuanschutz.edu/endocrinology]和科罗拉多大学医学院肿瘤医学科的助理教授。\n科罗拉多大学医学院[https://medschool.cuanschutz.edu/]的助理教授。\n并担任副研究...",
      "title": "AskScience AMA系列。我是伊尼戈-圣米兰，一位训练世界级运动员的研究人员，其中包括两届环法自行车赛的冠军，目的是了解更多关于癌症、糖尿病和其他疾病的信息。我已经了解到运动是世界上最强大的药物。AMA!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，Reddit! 我是伊尼戈-聖米倫。我是一名助理教授，在\n內分泌、代謝和糖尿病科的助理教授。\n[https://medschool.cuanschutz.edu/endocrinology]和科羅拉多大學醫學院腫瘤醫學科的助理教授。\n科羅拉多大學醫學院[https://medschool.cuanschutz.edu/]的助理教授。\n並擔任副研究...",
      "title": "AskScience AMA系列。我是伊尼戈-聖米蘭，一位訓練世界級運動員的研究人員，其中包括兩屆環法自行車賽的冠軍，目的是瞭解更多關於癌症、糖尿病和其他疾病的信息。我已經瞭解到運動是世界上最強大的藥物。AMA!"
    }
  ]
}