{
  "author": "Set1Less",
  "the_new_excerpt": "COTI constantly lie about \"decentralised network\" on their website, however just\nopening a wallet on this centralised network, you need to create an account with\nemail/pw and then complete KYC. Because AML. Lol. So decentralised.\n\n\n\nAre you corporate or not? What country you…",
  "original_created_utc": 1615287345,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "COTI在其网站上不断地谎称 \"去中心化网络\"，然而只是\n在这个集中式网络上开立一个钱包，你需要创建一个账户，并在这个账户上使用\nemail/pw，然后完成KYC。因为反洗钱。Lol。所以分散化。\n\n\n\n你到底是不是公司？你是哪个国家的...",
      "title": "COTI是集中式垃圾。即使打开COTI钱包也需要KYC。所有的验证器都是团队人工审批的。而且他们还谎称NANO需要收费"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "COTI在其網站上不斷地謊稱 \"去中心化網絡\"，然而只是\n在這個集中式網絡上開立一個錢包，你需要創建一個賬戶，並在這個賬戶上使用\nemail/pw，然後完成KYC。因爲反洗錢。Lol。所以分散化。\n\n\n\n你到底是不是公司？你是哪個國家的...",
      "title": "COTI是集中式垃圾。即使打開COTI錢包也需要KYC。所有的驗證器都是團隊人工審批的。而且他們還謊稱NANO需要收費"
    }
  ],
  "title": "COTI is centralised garbage. Even opening a COTI wallet requires KYC. All the validators are manually approved by the team. And they are lying about NANO requiring fees",
  "created_utc": 1615300556,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>COTI constantly lie about &quot;decentralised network&quot; on their website, however just opening a wallet on this centralised network, you need to create an account with email/pw and then complete KYC. Because AML. Lol. So decentralised. </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/lv34f9w7ezl61.jpg?width=1046&amp;format=pjpg&amp;auto=webp&amp;s=96e2f35827c43394ec8f55f11be40731c0a3d4d1\">Are you corporate or not? What country you from? </a></p>\n\n<p>This scam resembles a bank and has nothing whatsoever to do with decentralised cryptocurrencies. </p>\n\n<p>&#x200B;</p>\n\n<p>COTI supposedly has staking rewards for token holders. However, to stake on the network, you need to &quot;register&quot; with them via google forms. </p>\n\n<p><a href=\"https://preview.redd.it/ivzxvysvezl61.jpg?width=1300&amp;format=pjpg&amp;auto=webp&amp;s=e2582e00140b6b26fe463b845f71850b0ce62997\">Register to stake on the decentralised COTI network. </a></p>\n\n<p>On top of their centralised and scammy practice of peddling a centralised database as a decentralised blockchain network lies about NANO requiring fees. While everyone knows that NANO is feeless, COTI claims they are feeless while NANO requires fees. </p>\n\n<p>Technically comparing COTI with Nano, one will realize COTI is a ridiculously crappy technology. While NANO relies on PoW and onchain difficulty adjustments to prevent spam, COTI uses brazenly centralised concepts like &quot;trust score&quot; of a wallet, which means your wallet will be assigned a &quot;trust score&quot; and those wallets with high trust score can transact freely while those with low score can be censored if the centrally chosen validators agree upon. This is just like what a bank does - Small drug dealer - low trust score. Mexican cartel drug dealer having HSBC account - High Trust score. Etc. </p>\n\n<p>If people want to invest in banks, they are better off investing in stocks of legit regulated banks instead of something as shady as COTI, which is neither decentralised, nor permissionless, and runs a house of cards built on top of lies.</p>\n</div><!-- SC_ON -->",
  "score": 356,
  "permalink": "/r/CryptoCurrency/comments/m142mc/coti_is_centralised_garbage_even_opening_a_coti/",
  "subreddit": "CryptoCurrency",
  "id": "m142mc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573511
}