{
  "author": "WolfOfWallStreetBet5",
  "the_new_excerpt": "So many of us will say \"I will hold no matter what\". And you know what? That's\nawesome. I really do think we will be rich in a few years time. But that's the\nthing. It will take a few years. Are we really going to check the charts and the\ndaily thread 20 times a day? I mean what's the point, if we…",
  "original_created_utc": 1622362019,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、多くの人は「何があっても持ちます」と言うでしょう。そして、あなたは何を知っていますか？それは\n凄いですね。本当に数年後にはお金持ちになっていると思いますよ。でも、それは\n事だ。数年はかかるでしょうね。私たちは本当に、1日に20回もチャートや日刊スレッドをチェックするのでしょうか？\n一日に20回もチャートやデイリースレッドをチェックするでしょうか？つまり、何が言いたいのかというと、もし我々が...",
      "title": "草に触れたい人もいるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们中的许多人都会说 \"无论如何我都会坚持\"。而你知道吗？那是\n真棒。我真的认为我们在几年后会变得富有。但是，这就是\n事情。这将需要几年时间。我们真的要每天检查图表和\n每天检查20次？我的意思是有什么意义，如果我们...",
      "title": "我们中的一些人需要去摸摸草。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們中的許多人都會說 \"無論如何我都會堅持\"。而你知道嗎？那是\n真棒。我真的認爲我們在幾年後會變得富有。但是，這就是\n事情。這將需要幾年時間。我們真的要每天檢查圖表和\n每天檢查20次？我的意思是有什麼意義，如果我們...",
      "title": "我們中的一些人需要去摸摸草。"
    }
  ],
  "title": "Some of us need to go touch grass.",
  "created_utc": 1622387028,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So many of us will say &quot;I will hold no matter what&quot;. And you know what? That&#39;s awesome. I really do think we will be rich in a few years time. But that&#39;s the thing. It will take a few years. Are we really going to check the charts and the daily thread 20 times a day? I mean what&#39;s the point, if we aren&#39;t going to sell no matter what? </p>\n\n<p>Lately crypto has been a lot of what I think about, and I don&#39;t want that to be the case for years at a time. I&#39;m gonna go touch grass, live my life, mine some fiat, and just consistently keep buying. If crypto goes way up, I&#39;m sure I&#39;ll find out, and come right back here. If it plummets, same thing. But I&#39;m going to make a conscious effort to pay less attention to it and focus on the rest of my life, and I feel like maybe some of you could benefit from that as well. </p>\n\n<p>Anyways,</p>\n\n<p>See you in a few years, or in the daily thread tomorrow if I fail.</p>\n</div><!-- SC_ON -->",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/no6g6y/some_of_us_need_to_go_touch_grass/",
  "subreddit": "CryptoCurrency",
  "id": "no6g6y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804296497
}