{
  "author": "robinhood1596",
  "original_created_utc": 1624622397,
  "title": "My opinion on why the whole El Salvador thing is shady.",
  "created_utc": 1624663998,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, after the new El Salvador announcement to drop 30$ do every adult on their (governement sanctioned) wallet, I started to wonder what the ulterior motive is. Yeah some may say &quot;freedom from inflation, from USD, from the US manipulating the price&quot; yadda yadda. That might all be true. But there&#39;s another, rather concerning point I&#39;m seeing. </p>\n\n<p><strong>Removing privacy.</strong></p>\n\n<p>Bitcoin is transparent. That&#39;s one of the big selling points. And normally that&#39;s a good thing. But if your wallet is linked to your Identity, let&#39;s say by a airdrop you have to claim by IDing yourself to prevent ppl from using the aidrop multiple times, transparency becomes a concern.</p>\n\n<p>Every transaction you do is public. Bought a car at a car dealer? Public. Bought some gold from a bank? Public. Bought something from dildopolis around the corner? Public. Bought something at a local supermarket? Public. For ever. (Of course it&#39;s not visible what you bought exactly).</p>\n\n<p>Some might say: Whatever. But remember: Companys are paying for that kind of data. They pay facebook  or companies like visa for you collected data. Because this data is normally more or less private.</p>\n\n<p>With the whole linking your wallet to your ID-thing the following is possible once you buy at <strong>any</strong> company with your wallet. Also the governement knows exactly where you bought, where you live, where you traveled, because every wallet can be linked to a shop with a physical adress. Everything is public. </p>\n\n<p>I don&#39;t know about you guys, but this sounds like an authoritarian nightmare. And while we critizised China for their digital yuan, we praise El Salvador because they are using BTC?? This is bullshit. This is dangerous.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/o7m9fr/my_opinion_on_why_the_whole_el_salvador_thing_is/",
  "subreddit": "CryptoCurrency",
  "id": "o7m9fr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So, after the new El Salvador announcement to drop 30$ do every adult on their\n(governement sanctioned) wallet, I started to wonder what the ulterior motive\nis. Yeah some may say \"freedom from inflation, from USD, from the US\nmanipulating the price\" yadda yadda. That might all be true. But…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルでは、大人一人につき30ドルを財布に入れるという発表がありました。\n政府公認の）財布に30ドルを落とすと発表した後、私は何か下心があるのではないかと思い始めました。\nは何なのか？インフレからの解放、米ドルからの解放、アメリカによる価格操作からの解放」と言う人もいるでしょう。\nインフレからの解放、米ドルからの解放、米国による価格操作からの解放」などと言う人もいるでしょう。確かにそうかもしれません。でも...。",
      "title": "エルサルバドルの件がなぜ怪しいのか、私の意見です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，在萨尔瓦多宣布在每个成年人的钱包上投入30美元之后\n政府批准的）钱包后，我开始怀疑其别有用心的动机是什么。\n是什么。是的，有些人可能会说：\"摆脱通货膨胀，摆脱美元，摆脱美国的操纵。\n操纵价格 \"等等。这可能都是真的。但是...",
      "title": "我对为什么萨尔瓦多的事情是黑幕的看法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，在薩爾瓦多宣佈在每個成年人的錢包上投入30美元之後\n政府批准的）錢包後，我開始懷疑其別有用心的動機是什麼。\n是什麼。是的，有些人可能會說：\"擺脫通貨膨脹，擺脫美元，擺脫美國的操縱。\n操縱價格 \"等等。這可能都是真的。但是...",
      "title": "我對爲什麼薩爾瓦多的事情是黑幕的看法。"
    }
  ]
}