{
  "author": "Lemonmule69",
  "the_new_excerpt": "Basically the sec is now stalling. It’s becoming very apparent Jay Clayton went\nahead with this lawsuit prematurely and without concluding an investigation. The\nguy literally did it on his last day.\n\nThe court has ordered the SEC to hand over documents regarding Eth and BTC twice\nand they still…",
  "original_created_utc": 1622862755,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "基本的に秒単位で失速しています。ジェイ・クレイトンがこの訴訟を時期尚早に、しかも調査を終えずに進めたことが明らかになっています。\nジェイ・クレイトンは、調査を完了することなく、この訴訟を早まって進めたことが明らかになっています。彼は\n文字通り、彼は最後の日にそれをしたのです。\n\n裁判所はSECにEthとBTCに関する文書の提出を2度命じましたが\nそして彼らはまだ...",
      "title": "SECは裁判所から2度にわたり、ビットコインとethに関する文書の提出を命じられているが、リップルはいまだに1枚の文書も受け取っていない。リップルの公正な通知の抗弁は、米国のすべての暗号に影響します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "基本上，现在的秒速快三精准人工下注计划正在停滞。很明显，杰伊-克莱顿在没有完成调查的情况下过早地进行了这项诉讼。\n在没有完成调查的情况下，过早地进行了这项诉讼。这家伙\n这家伙简直是在他的最后一天做的。\n\n法院已经两次命令SEC交出有关Eth和BTC的文件\n而他们仍然...",
      "title": "法院已经两次命令SEC交出关于比特币和eth的文件，而瑞波币仍然没有收到任何文件。瑞波币的公平通知辩护影响了所有美国的加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "基本上，現在的秒速快三精準人工下注計劃正在停滯。很明顯，傑伊-克萊頓在沒有完成調查的情況下過早地進行了這項訴訟。\n在沒有完成調查的情況下，過早地進行了這項訴訟。這傢伙\n這傢伙簡直是在他的最後一天做的。\n\n法院已經兩次命令SEC交出有關Eth和BTC的文件\n而他們仍然...",
      "title": "法院已經兩次命令SEC交出關於比特幣和eth的文件，而瑞波幣仍然沒有收到任何文件。瑞波幣的公平通知辯護影響了所有美國的加密貨幣。"
    }
  ],
  "title": "The SEC has been ordered by the court twice to hand over documents regarding bitcoin and eth and ripple still have not received a single document. Ripples fair notice defence effects all US crypto.",
  "created_utc": 1622874626,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Basically the sec is now stalling. It’s becoming very apparent Jay Clayton went ahead with this lawsuit prematurely and without concluding an investigation. The guy literally did it on his last day.</p>\n\n<p>The court has ordered the SEC to hand over documents regarding Eth and BTC twice and they still haven’t done it. The sec is starting to look like a complete embarrassment. But ripples fair notice defence is where they can win at summary judgment. </p>\n\n<p>The sec had 8 years to bring the case forward. They had 8 years to help crypto but instead Jay Clayton filed the lawsuit on the last day. Ripple are now saying they did not have fair notice. The SEC sat on their hands and didn’t assist crypto in anyway. If ripple win the fair notice defence that means the SEC cannot go after the OG cryptos. They fucked up, by sitting aside and doing nothing they have essentially dug their own grave.</p>\n</div><!-- SC_ON -->",
  "score": 1338,
  "permalink": "/r/CryptoCurrency/comments/nsmcpw/the_sec_has_been_ordered_by_the_court_twice_to/",
  "subreddit": "CryptoCurrency",
  "id": "nsmcpw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881320
}