{
  "author": "GroundbreakingLack78",
  "the_new_excerpt": "I’m tired of seeing him as a face of crypto in news. He is not one of us. He\nisn’t your average Joe. He is multi billionaire, one of the richest guys in the\nworld. He doesn’t care about you, about me, about mine or your family. All he\ncares it’s his ego and his companies.\n\nLately, we’ve seen a lot…",
  "original_created_utc": 1618011055,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ニュースで暗号の顔として彼を見るのはもう飽きました。彼は私たちの仲間ではありません。彼は\n普通のジョーでもありません。彼はマルチビリオネアで、世界で最も裕福な男の一人です。\n世界有数の金持ちです。彼は、あなたや私、私の家族やあなたの家族のことは気にしません。彼が気にするのは\n気になるのは、自分のエゴと会社のことだ。\n\n最近、私たちは多くのことを見てきました...",
      "title": "イーロン・マスクは私たちの仲間ではありません。彼をお手本にするのはやめましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我厌倦了在新闻中把他看作是加密技术的代言人。他不是我们中的一员。他是\n不是一般的人 他是亿万富翁，是世界上最富有的人之一。\n他不关心你，不关心我，不关心我和你的家人 他不在乎你，不在乎我，不在乎我的，不在乎你的家人。他所关心的\n他在乎的是他的自我和他的公司。\n\n最近，我们看到很多... ...",
      "title": "埃隆-马斯克不是我们中的一员。别再拿他当榜样了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我厭倦了在新聞中把他看作是加密技術的代言人。他不是我們中的一員。他是\n不是一般的人 他是億萬富翁，是世界上最富有的人之一。\n他不關心你，不關心我，不關心我和你的家人 他不在乎你，不在乎我，不在乎我的，不在乎你的家人。他所關心的\n他在乎的是他的自我和他的公司。\n\n最近，我們看到很多... ...",
      "title": "埃隆-馬斯克不是我們中的一員。別再拿他當榜樣了。"
    }
  ],
  "title": "Elon Musk Is Not One Of Us. Stop Using Him As a Role Model.",
  "created_utc": 1618021083,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m tired of seeing him as a face of crypto in news. He is not one of us. He isn’t your average Joe. He is multi billionaire, one of the richest guys in the world. He doesn’t care about you, about me, about mine or your family. All he cares it’s his ego and his companies.</p>\n\n<p>Lately, we’ve seen a lot of hate towards Mark Zuckerberg from Facebook. Is sweet Elon Musk different? Maybe he isn’t lizardy as Marky is, because he is skrull from Mars. Is Elon any different compared to Mark? Both of them are shilling their own companies, Tesla isn’t different. Just because he offers you to buy Tesla with BTC, it doesn’t mean that he is on your side. He isn’t helping you, he is helping himself. </p>\n\n<p>While you’re laughing at him shilling DOGE, he is laughing at you how is he manipulating you. He is not helping crypto, he is hurting it. He isn’t same as you or me, he doesn’t have to save money for food, he doesn’t have the count if he has enough for dinner. </p>\n\n<p>He isn’t on your side, every one of the billionaires are trying to manipulate as much people as they can, to make them believe in theirs own visions and dreams. Just because he pumped your coin, it doesn’t mean that he is your lovely neighbour. </p>\n\n<p>Elon shouldn’t be used as a model for crypto. Just because he was on Joe Rogan podcast, it isn’t making him a proper role model. </p>\n\n<p>Stop giving him any reputation when it comes to crypto, this guy just shilled a shitcoin and thousands of people falls for it.</p>\n</div><!-- SC_ON -->",
  "score": 32250,
  "permalink": "/r/CryptoCurrency/comments/mntcz3/elon_musk_is_not_one_of_us_stop_using_him_as_a/",
  "subreddit": "CryptoCurrency",
  "id": "mntcz3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566614241
}