{
  "author": "Upper-Bee-8714",
  "the_new_excerpt": "In recent years there has been a push to label conditions such as ADHD or autism\nspectrum disorder as \"neurodiversity\" rather than a \"disorder\". Neurodiversity\nimplying these are just different ways the brain functions whereas disorder\nimplies that these are illnesses that are causing the brain to…",
  "original_created_utc": 1618762981,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近年、ADHDや自閉症スペクトラムなどの症状を、「障害」ではなく「神経多様性」と表示しようとする動きがあります。\nスペクトラム障害などを「障害」ではなく「神経多様性」と呼ぶようになりました。神経多様性\n脳の機能の違いを意味するのに対し、障害は\nは、脳の機能を低下させる病気であることを意味しています。",
      "title": "精神障害vs.神経多様性"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "近年来，有人推崇给多动症或自闭症等病症贴标签。\n谱系障碍是 \"神经多样性 \"而不是 \"障碍\"。神经多样性\n暗示这些只是大脑功能的不同方式，而失调\n暗示着这些疾病是导致大脑...",
      "title": "精神障碍与神经多样性"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "近年來，有人推崇給多動症或自閉症等病症貼標籤。\n譜系障礙是 \"神經多樣性 \"而不是 \"障礙\"。神經多樣性\n暗示這些只是大腦功能的不同方式，而失調\n暗示着這些疾病是導致大腦...",
      "title": "精神障礙與神經多樣性"
    }
  ],
  "title": "Mental disorder vs. Neurodiversity",
  "created_utc": 1618788880,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In recent years there has been a push to label conditions such as ADHD or autism spectrum disorder as &quot;neurodiversity&quot; rather than a &quot;disorder&quot;. Neurodiversity implying these are just different ways the brain functions whereas disorder implies that these are illnesses that are causing the brain to function incorrectly and they need to be cured or treated, but even if the majority of people have &quot;neurotypical&quot; brains, can we safely assume that is the way the human brain is supposed to function? Even with disorders that we see no benefit from at all, like retardation or downs syndrome, can we accurately describe these when all we can do is compare their behavior to neurotypical behavior and list the differences? Can we get a clear picture of what it is like to be them if we can only view it through a neurotypical lens? Is the only reason we consider these disorders to be the &quot;wrong&quot; way a brain should function is because they have little value in a society that was built by neurotypical people for neurotypical people?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/askphilosophy/comments/mtfzvt/mental_disorder_vs_neurodiversity/",
  "subreddit": "askphilosophy",
  "id": "mtfzvt",
  "is_self": true,
  "media": null,
  "is_video": false
}