{
  "author": "saMAN101",
  "the_new_excerpt": "EDIT: I added the MacroVoices podcast episode\n[https://www.youtube.com/watch?v=4jDIifbY71g] where Chris Cole goes over the\nDragon Portfolio. I would highly recommend listening to it as context for this\npost if you are not going to read the paper.\n\n----------------------------------------------------…",
  "original_created_utc": 1619230712,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: MacroVoicesポッドキャストのエピソードを追加しました。\n[https://www.youtube.com/watch?v=4jDIifbY71g]では、クリス・コールが\nドラゴン・ポートフォリオ 論文を読まないのであれば、この記事の文脈として聞くことをお勧めします。\n論文を読まないのであれば、この記事のコンテクストとして聞くことをお勧めします。\n\n----------------------------------------------------…",
      "title": "100年ポートフォリオ。個人投資家としての「ドラゴン・ポートフォリオ」の活用法を考える"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：我添加了MacroVoices播客的插曲\n[https://www.youtube.com/watch?v=4jDIifbY71g]，克里斯-科尔在其中介绍了\n龙形投资组合。如果你不打算读论文，我强烈建议你听一听，作为这篇文章的背景。\n如果你不打算读这篇论文，我强烈建议你听一下，作为这篇文章的背景。\n\n----------------------------------------------------…",
      "title": "100年的投资组合。作为散户投资者使用龙形投资组合的看法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：我添加了MacroVoices播客的插曲\n[https://www.youtube.com/watch?v=4jDIifbY71g]，克里斯-科爾在其中介紹了\n龍形投資組合。如果你不打算讀論文，我強烈建議你聽一聽，作爲這篇文章的背景。\n如果你不打算讀這篇論文，我強烈建議你聽一下，作爲這篇文章的背景。\n\n----------------------------------------------------…",
      "title": "100年的投資組合。作爲散戶投資者使用龍形投資組合的看法"
    }
  ],
  "title": "The 100 Year Portfolio: A Look at Using the Dragon Portfolio as a Retail Investor",
  "created_utc": 1619282874,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>EDIT: I added the <a href=\"https://www.youtube.com/watch?v=4jDIifbY71g\">MacroVoices podcast episode</a> where Chris Cole goes over the Dragon Portfolio. I would highly recommend listening to it as context for this post if you are not going to read the paper. </p>\n\n<hr/>\n\n<p>Chris Cole released a paper last year called &quot;The Allegory of the Hawk and the Serpent.&quot; The paper detailed how investors could protect and build their wealth over a 100 year period. If you haven&#39;t read the paper, I would highly recommend doing so <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;ved=2ahUKEwi95qub1ZXwAhVTHM0KHU7QDQMQFjAAegQIAxAD&amp;url=https%3A%2F%2Fwww.macrovoices.com%2Fguest-content%2Flist-guest-publications%2F3502-the-allegory-of-the-hawk-and-serpent%2Ffile&amp;usg=AOvVaw1RpaeVw0O4wF4dO4MIpgs5\">here</a>. In it, he details how our idea of ideal portfolio construction has been warped by the last 40 years, namely an environment where interest rates have been falling. This has lead most investment advisors to recommend a stock/bond portfolio. This is also known as the 60/40 portfolio. </p>\n\n<p>The idea behind the 60/40 portfolio is that stocks and bonds are  anti-correlated, meaning when stocks go up, bonds go down and visa versa. This allows the investor to grow their wealth over time without major drawdowns. Avoiding major drawdowns is key in any portfolio construction. The issues arise when you start looking at periods beyond the early 80s. This was the time interest rates peaked, and they have been falling ever since. One of the question Chris Cole asks is &quot;how would this portfolio perform over 100 years?&quot; The answer is poorly. For two separate decades (the 30s and the 70s), this portfolio would have had significant drawdowns. Why? Because during these periods, stocks and bonds were positively correlated. Stocks and bonds moved up and down together. </p>\n\n<p>What is Chris Cole&#39;s solution? He calls it the Dragon Portfolio. A portfolio that has elements beyond those of stocks and bonds. He recommends the following allocation:</p>\n\n<ul>\n<li>20% Gold</li>\n<li>20% Long Equity</li>\n<li>20% Low Risk Long Duration Bonds</li>\n<li>20% Commodity Trend</li>\n<li>20% Long Volatility</li>\n</ul>\n\n<p>Not only does this portfolio perform well during periods like the 30s or 70s, but it also outperforms the traditional advice during the good decades. the portfolio also outperforms during good periods. Over the last 40 years, the Dragon Portfolio has an annualized rate of return of 10.1% while the 60/40 portfolio only returns 3.9% during the same period.</p>\n\n<p>For the retail investor, the first three elements are easy enough for the average investor to achieve. Simply invest in GLD, TLT and the equity index of your choice. Commodity trend is doable as well. Use a simple trend following system allocated to a basket of commodities. You could do a 40-50 day cross over on a broad commodity etf like DJP or GNR. However, Long Volatility proves trickier. Most investors don&#39;t know how to go long volatility beyond buying the VXX etf. Unfortunately, the carry cost makes this untenable. Take a look at the VXX chart over a five year time horizon. This thing is consistently melting down. Here is where Chris Cole makes his pitch. He offers professionally managed Long Volatility funds that fit into the Dragon Portfolio. Only downside is you must be a &quot;Qualified Investor.&quot; Yes, qualified, not accredited. IE your net worth needs to be over 5 million dollars to even have a conversation about his products. </p>\n\n<p>Needless to say, the average retail investor does not have this net worth or else he&#39;d be lying on a beach after telling his boss to shove it. My goal is to test a simple long volatility strategy in combination with the other elements of the Dragon Portfolio to see if the average retail investor can invest using Chris Cole&#39;s methodology. To do this, I opened up a paper trading account with $100,000 and will be tracking this portfolio on a weekly basis. I broke down the allocations as follows:</p>\n\n<ul>\n<li>20% GLD - Gold ETF</li>\n<li>20% TLT - Long Duration US Government Bonds</li>\n<li>20% RSP - Equal weight S&amp;P 500. This tends to outperform the S&amp;P 500 over time by about 1-2% per year</li>\n<li>20% DJP - Long Bloomberg commodity index. Commodities are in an uptrend right now. I may change this to GNR.</li>\n<li>1% IWM 90 day Long Straddle (rolling every 30 days) - Long Volatility representing long/short 100 shares of the Russell 2000. </li>\n</ul>\n\n<p>You might be wondering why I am doing the Russell 2000 straddle. Two reasons. First, the straddle is the definition long volatility. You are long a call and a put while betting the value of either leg will go further than the implied price represents. Chris Cole mentions in an interview on MacroVoices this is the broad outline for the long volatility component he uses. Second, the IWM is a small enough ETF that a $100,000 account can have 20% represented by a single put and call contract. We aren&#39;t trying to leverage this portion to the hilt. We are trying to keep the theta burn small enough that when a big risk on or risk off event happens, the straddle spikes up. The goal is to have anti-correlated assets classes.</p>\n\n<p><a href=\"https://imgur.com/gallery/25913Hp\">Here</a> are my current allocations. I&#39;ll be posting updates every week and comparing the performance to a 60/40 portfolio as well as a long equity portfolio (100/0) to see how they perform. </p>\n\n<p>I would appreciate any feedback or advice on the strategy.</p>\n</div><!-- SC_ON -->",
  "score": 500,
  "permalink": "/r/investing/comments/mxaojd/the_100_year_portfolio_a_look_at_using_the_dragon/",
  "subreddit": "investing",
  "id": "mxaojd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214680
}