{
  "author": "jesschester",
  "original_created_utc": 1646500179,
  "title": "Crypto.com is not an Airport",
  "created_utc": 1646552178,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;You don’t have to announce your departure.&lt;/p&gt;\n\n&lt;p&gt;So your precious interest rates have been Nerfed by the Man? Aww, Welcome to capitalism. There’s supply and there’s demand, there’s inflation and evolving financial regulations. Manage your expectations. A word of advice: don’t bemoan your hardship to someone more familiar with traditional finance. You will get laughed at. You will be told to take a nap. &lt;/p&gt;\n\n&lt;p&gt;Crypto.com isn’t here to nurse your emotions. companies fail when they are unable to make hard decisions and evolve with the growing demands of the economy. Your disgruntled proclamations and threats of departure will not help anything. &lt;/p&gt;\n\n&lt;p&gt;More importantly, the clamoring malcontents have profoundly missed the actual value and opportunity that CDC provides. &lt;/p&gt;\n\n&lt;p&gt;Just weeks ago, the entire crypto community was wokecasting how important it is to move away from Centralized Exchanges because of sanctions and frozen assets, Canadian and Russian tyranny, blah blah… well here’s the opportunity, and it’s called Cronos.&lt;/p&gt;\n\n&lt;p&gt;VVS, MM Finance, Tectonic and beefy finance— these are noteworthy names in the DeFi LP/yield farming sector. Cronos dapps are gaining quick traction and the entire ecosystem is only 5 months old. Your precious 12% on stablecoins is laughable compared to the opportunities and financial freedom this environment offers and yet everyone is too busy Karening off at CDC to notice or care.&lt;/p&gt;\n\n&lt;p&gt;I’m not surprised at all that this news has become the latest claim to victimhood, that’s the only way people around here know how to get attention, thinking they’re all savvy and righteous.&lt;/p&gt;\n\n&lt;p&gt;Can we please for once take a moment to appreciate how Cronos is a hell of a lot easier and usually cheaper to use than your average DEX? It’s time to get the ball rolling people, put your money where your mouth is. I’m not going anywhere, my faith in the future of CRO and CDC is as strong as ever, and I strongly urge you all to re-examine your options. There’s a great case for optimism here, you only have to want to see it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/t7dxy8/cryptocom_is_not_an_airport/",
  "subreddit": "CryptoCurrency",
  "id": "t7dxy8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "You don’t have to announce your departure.\n\nSo your precious interest rates have been Nerfed by the Man? Aww, Welcome to\ncapitalism. There’s supply and there’s demand, there’s inflation and evolving\nfinancial regulations. Manage your expectations. A word of advice: don’t bemoan\nyour hardship to…"
}