{
  "author": "cwhitel",
  "the_new_excerpt": "From one amateur investor to hopefully at least one other! Helping ease the FOMO\nbug recently.\n\nBeen investing for 3 years now, every penny I can into funds for 10 years.\n\nSwayed from funds slightly around May and got super lucky with 50% of my\nportfolio on a certain stock before a split, which made…",
  "original_created_utc": 1611580620,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "从一个业余投资者到希望至少有一个其他投资者! 帮助缓解FOMO\n最近的bug。\n\n做投资3年了，10年每一分钱都投入基金。\n\n5月份左右从基金稍微动摇了一下，运气超好，我的50%。\n投资组合在某只股票拆分前，这使得...",
      "title": "对抗FOMO，看看最初的目标。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從一個業餘投資者到希望至少有一個其他投資者! 幫助緩解FOMO\n最近的bug。\n\n做投資3年了，10年每一分錢都投入基金。\n\n5月份左右從基金稍微動搖了一下，運氣超好，我的50%。\n投資組合在某隻股票拆分前，這使得...",
      "title": "對抗FOMO，看看最初的目標。"
    }
  ],
  "title": "Combat FOMO, look at original goals.",
  "created_utc": 1611599713,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From one amateur investor to hopefully at least one other! Helping ease the FOMO bug recently. </p>\n\n<p>Been investing for 3 years now, every penny I can into funds for 10 years. </p>\n\n<p>Swayed from funds slightly around May and got super lucky with 50% of my portfolio on a certain stock before a split, which made me think I was leonardo di caprio in that trading film I can’t mention  incase post gets flagged! Jumped on a meme stock, lost 40% of my overall profits in a day! I absolutely know I’m lucky I’m still in the green and thought I’d learned my lesson. </p>\n\n<p>That is until last week where you-know-what stock is blowing up... I don’t know about you but I’m getting massive FOMO and apparently I’m not content on 40% loss on profits...</p>\n\n<p>I’ve just this morning on a white board, written out the same projections I made 3 years ago, “if I save £x amount every month and use 7% as my average interest). And I was more than happy with the results over 10 years. I think I’ll create a more permanent board somewhere with my estimated numbers year on year compared to the actual numbers, to remind myself I’m on track. </p>\n\n<p>Sure more money would be good, but it’s not worth the FOMO. I will have as much as I need sticking to my funds and I can’t really ask for more than that!</p>\n\n<p>TL;DR\nCombat FOMO by reminding yourself why you got into investing, crunch the numbers and see you’ll more than likely still be on track regardless of others profits!</p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/stocks/comments/l4nntx/combat_fomo_look_at_original_goals/",
  "subreddit": "stocks",
  "id": "l4nntx",
  "is_self": true,
  "media": null,
  "is_video": false
}