{
  "author": "xavierwest888",
  "original_created_utc": 1636203374,
  "title": "If Dogelon Mars gets listed on Coinbase I WILL put a significant chunk of my portfolio into it while my faith in humanity dies",
  "created_utc": 1636216435,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I should start by saying that I am 100% not invested in any random shitcoins or memecoins ESPECIALLY Dogelon Mars! I guarantee that I don&#39;t have to read the whitepaper or DMyOR to know it&#39;s going to be a trash tier waste of time.</p>\n\n<p>And yet despite that SHIB, with the same ridiculous handicaps, still managed to surpass the market in the short term on pure greed and hype as well as people&#39;s ignorance of how high the coin can realistically go (their sub still thinks it can go another 10x or 100x in complete ignorance of how much money would need to be invested to reach those values).</p>\n\n<p>So I&#39;m making a prediction today that should Dogelon Mars actually do the, what should be, impossible and become listed on Coinbase I will immediately drop everything and move a large chunk of my portfolio onto it because it&#39;s the stupidest thing I&#39;ve ever heard of which means it is practically guaranteed to make money.</p>\n</div><!-- SC_ON -->",
  "score": 272,
  "permalink": "/r/CryptoCurrency/comments/qnznwy/if_dogelon_mars_gets_listed_on_coinbase_i_will/",
  "subreddit": "CryptoCurrency",
  "id": "qnznwy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I should start by saying that I am 100% not invested in any random shitcoins or\nmemecoins ESPECIALLY Dogelon Mars! I guarantee that I don't have to read the\nwhitepaper or DMyOR to know it's going to be a trash tier waste of time.\n\nAnd yet despite that SHIB, with the same ridiculous handicaps, still…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておきますが、私は100％ランダムなシットコインやメモコインには投資していません。\n特にDogelon Marsには投資していません。を読む必要がないことを保証するよ。\nホワイトペーパーやDMyORを読まなくても、それがゴミのように時間の無駄になることはわかっている。\n\nそれにもかかわらず、SHIBは同じような馬鹿げたハンディキャップを抱えながら、まだ...",
      "title": "もしDogelon MarsがCoinbaseに上場したら、人類への信頼が失われる間、私は自分のポートフォリオのかなりの部分をそれに投入するだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我应该先说，我100%没有投资于任何随机的狗屎币或memecoins，特别是Dogelon Mars!\nmemecoins，尤其是Dogelon Mars! 我保证我不需要阅读\n白皮书或DMyOR就知道这将是一个垃圾级的时间浪费。\n\n然而，尽管如此，SHIB，在同样可笑的障碍下，仍然...",
      "title": "如果Dogelon Mars在Coinbase上市，我将把我的投资组合的很大一部分投入它，同时我对人类的信心也会消失。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我應該先說，我100%沒有投資於任何隨機的狗屎幣或memecoins，特別是Dogelon Mars!\nmemecoins，尤其是Dogelon Mars! 我保證我不需要閱讀\n白皮書或DMyOR就知道這將是一個垃圾級的時間浪費。\n\n然而，儘管如此，SHIB，在同樣可笑的障礙下，仍然...",
      "title": "如果Dogelon Mars在Coinbase上市，我將把我的投資組合的很大一部分投入它，同時我對人類的信心也會消失。"
    }
  ]
}