{
  "author": "Odlavso",
  "original_created_utc": 1637090143,
  "title": "Popular opinion? - Bored apes is the stupidest thing since supreme",
  "created_utc": 1637102123,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>NFTS already dint make much sense to me, but these bored apes NFTS just seem like the ultimate popular because money thing.  </p>\n\n<p>The way I see it, with absolutely no research is that some rich people decided to make these, then paid other rich people to promote them which lead other rich people to want them so they can seem like they are still on the forefront of cool things.  </p>\n\n<p>Then after an the rich people are posting and talking about bored apes, regular celebrity worshippers also want ask these NFTS and merch.  </p>\n\n<p>Am I the only one that feels this way?  </p>\n\n<p>I&#39;m losing hope in humanity.</p>\n</div><!-- SC_ON -->",
  "score": 237,
  "permalink": "/r/CryptoCurrency/comments/qvfkjt/popular_opinion_bored_apes_is_the_stupidest_thing/",
  "subreddit": "CryptoCurrency",
  "id": "qvfkjt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "NFTS already dint make much sense to me, but these bored apes NFTS just seem\nlike the ultimate popular because money thing.\n\nThe way I see it, with absolutely no research is that some rich people decided\nto make these, then paid other rich people to promote them which lead other rich\npeople to want…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFTSはすでにあまり意味をなさないが、この退屈な猿のNFTSは、まるで\n究極の人気を誇るのは、お金のためだと思います。\n\n何の調査もしていない私の考えでは、何人かのお金持ちがこれらを作ることを決めて\n作ることを決めて、他の金持ちに金を払って宣伝してもらい、それが他の金持ちの\nその結果、他のお金持ちが欲しがるようになり...",
      "title": "人気のある意見？- Bored apesはsupreme以来の馬鹿げたものである。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "NFTS对我来说已经没有什么意义了，但这些无聊的猿人NFTS似乎只是\n像最终的流行，因为钱的事情。\n\n在我看来，完全没有研究的情况下，一些有钱人决定\n制作这些东西，然后付钱给其他富人来推广它们，导致其他富人\n导致其他富人想要...",
      "title": "大众意见？- 无聊的猿猴是自最高以来最愚蠢的事情"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NFTS對我來說已經沒有什麼意義了，但這些無聊的猿人NFTS似乎只是\n像最終的流行，因爲錢的事情。\n\n在我看來，完全沒有研究的情況下，一些有錢人決定\n製作這些東西，然後付錢給其他富人來推廣它們，導致其他富人\n導致其他富人想要...",
      "title": "大衆意見？- 無聊的猿猴是自最高以來最愚蠢的事情"
    }
  ]
}