{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1653929385,
  "title": "Many seem to think we are heading into a long term recession for stocks and crypto, because of macros. But if you look below the surface of macro-economics , emerging data is showing signs that it could be cut short, and potentially only be a correction.",
  "created_utc": 1653943438,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before cosplaying as Michael Bury, or going all in on shorts, check the latest economic data. It&amp;#39;s not the sure-fire doomsday scenario it was 2 months ago.&lt;/p&gt;\n\n&lt;h1&gt;The herd.&lt;/h1&gt;\n\n&lt;p&gt;When it comes to investing, be careful of following the herd.&lt;/p&gt;\n\n&lt;p&gt;Last year, the herd thought Bitcoin was heading to the moon and could hit $100K. And that&amp;#39;s when the herd was overbuying.&lt;/p&gt;\n\n&lt;p&gt;Things aren&amp;#39;t looking good. But is the data really showing only doomsday? I&amp;#39;ll explore that in details.&lt;/p&gt;\n\n&lt;p&gt;Not every correction is a recession. Not every bear market is long term (see the 2013 mini bear market of 5 months for Bitcoin).&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Inflation:&lt;/h1&gt;\n\n&lt;p&gt;This is the big one. Inflation is still high, but it&amp;#39;s showing signs of slowing down, and potentially having peaked already. If it starts going down, will it still be able to fuel further market fears?&lt;/p&gt;\n\n&lt;p&gt;Both CPI and PCE rates have slowed down.&lt;/p&gt;\n\n&lt;p&gt;-CPI slowed from 8.5% in March down to 8.2% in April.&lt;/p&gt;\n\n&lt;p&gt;-PCE has slowed from 6.6% in March down to 6.2% in April.&lt;/p&gt;\n\n&lt;p&gt;Obviously real inflation is higher, but these are important for later when we talk about Fed rates.&lt;/p&gt;\n\n&lt;p&gt;But what about food and gas still being so expensive? It still costs me so much, how can it have peaked? That brings up the next two points.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Supply chain:&lt;/h1&gt;\n\n&lt;p&gt;Probably one of the biggest wrench getting in the way of economic growth in the last 2 years.&lt;/p&gt;\n\n&lt;p&gt;Luckily, the supply chain is beginning to reopen, and the bottleneck is getting unclogged. But it has been an uneven recovery.&lt;/p&gt;\n\n&lt;p&gt;While you see a lot of items back on the shelves, and shipment taking less time, you have other items like baby formula vanishing from the shelves.&lt;/p&gt;\n\n&lt;p&gt;The big one everyone is waiting for is for China to join in that de-clogging. They&amp;#39;re still behind due to their more recent lockdowns.&lt;/p&gt;\n\n&lt;p&gt;In the US this year:&lt;/p&gt;\n\n&lt;p&gt;47% drop in ship congestion (those ships anchored waiting outside a port).&lt;/p&gt;\n\n&lt;p&gt;12% increase in containers in the main ports (LA, New Jersey, New York, Long beach).&lt;/p&gt;\n\n&lt;p&gt;In Europe, they experienced a setback with the war in Ukraine. With some ports getting increases in delays by several hours, sometimes up to two days.&lt;/p&gt;\n\n&lt;p&gt;In terms of sea shipping  worldwide, the bottleneck is still high thanks to China and Russia, but we are starting to also see signs that it has peaked:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/6t9zd84c4n291.png?width=990&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=54d4e555c3b0f72dcde6e85bafb82c87ccc0ee31\"&gt;https://preview.redd.it/6t9zd84c4n291.png?width=990&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=54d4e555c3b0f72dcde6e85bafb82c87ccc0ee31&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Things are still not looking great and are uneven, but it looks like in many countries we are starting to see things turn around.&lt;/p&gt;\n\n&lt;p&gt;Overall, the world waiting time for all cargo ships has dropped. Going from 17 million container waiting days down to 6 million.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Oil: the domino effect that could put the breaks on a recession.&lt;/h1&gt;\n\n&lt;p&gt;Oil prices has everyone worried.&lt;/p&gt;\n\n&lt;p&gt;It has also been a big contributors for rising CPI numbers, and the perceived inflation.&lt;/p&gt;\n\n&lt;p&gt;It has also been a problem for supply chains, along with businesses. And has put strain on many companies in the stock market.&lt;/p&gt;\n\n&lt;p&gt;So it&amp;#39;s been in the middle of almost all of our problems.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s some good news.&lt;/p&gt;\n\n&lt;p&gt;One of the main reason it&amp;#39;s so high, is because OPEC hasn&amp;#39;t increased the output to keep up with the big emerging demand from the post covid crisis, nor make up for the strain from the war in Ukraine.&lt;/p&gt;\n\n&lt;p&gt;The purposely held back output to let price rises, to makeup for all the money they lost when oil prices tanked in 2020. &lt;/p&gt;\n\n&lt;p&gt;OPEC is actually due to increase the output in July, per their internal agreement, by 400K barrels per day. So relief will begin this summer.&lt;/p&gt;\n\n&lt;p&gt;The G7 meeting has asked them to increase it by even more. So we&amp;#39;ll have to see how big the relief will be.&lt;/p&gt;\n\n&lt;p&gt;If oil price output increases significantly, it could bring the price down more significantly, helping everything from inflation to supply chains and businesses.&lt;/p&gt;\n\n&lt;p&gt;And it could create a domino effect that could help ignite a potential recovery.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Fed rates:&lt;/h1&gt;\n\n&lt;p&gt;Rates don&amp;#39;t have much uncertainty left. Feds have already laid out the roadmap. We know how high they want to go. And unless inflation starts to spiral out of control again, it looks like they are targeting 2-2.5% rates. So only going back to pre-covid rates.&lt;/p&gt;\n\n&lt;p&gt;These are still economic stimulation level of rates. They&amp;#39;re not high rates.&lt;/p&gt;\n\n&lt;p&gt;Now that we got a good idea on how fast they&amp;#39;ll go with the point basis, there&amp;#39;s not much left that hasn&amp;#39;t been priced in already.&lt;/p&gt;\n\n&lt;p&gt;The only question is the Fed balance sheet unloading. That&amp;#39;s a little harder to predict the effect. But there won&amp;#39;t be a selling off, they&amp;#39;ll just let bonds expire.&lt;/p&gt;\n\n&lt;p&gt;Also, keep in mind that legislation has changed a little, with the ability for banks to get their liquidity. So it won&amp;#39;t be quiet the same as it was in the past.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;War in Ukraine:&lt;/h1&gt;\n\n&lt;p&gt;I can&amp;#39;t really say too much about this. There&amp;#39;s no clear metrics to talk about here.&lt;/p&gt;\n\n&lt;p&gt;This could end next month, or it could end in 5 years.&lt;/p&gt;\n\n&lt;p&gt;One thing we do know, is Putin wasn&amp;#39;t able to roll over Ukraine, and move on to the next conquest.&lt;/p&gt;\n\n&lt;p&gt;In terms of market uncertainty, it has fizzled out a little bit, and is nowhere near at the level of fear as the early days of the war.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;US GDP:&lt;/h1&gt;\n\n&lt;p&gt;This is the one place where we can still see an alarming case for a recession.&lt;/p&gt;\n\n&lt;p&gt;The GDP has decreased by 1.5%.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s as bad as it can get.&lt;/p&gt;\n\n&lt;p&gt;But a big part of that decrease was actually caused by the trade deficit, rather than a decrease in spending. Consumer spending actually increased by 2.7%. Inflation adjusted, it still increased by 0.7%.&lt;/p&gt;\n\n&lt;p&gt;Also, supply chain issues, and slower inventory accumulation fueled that decrease. The effect of high inflation also didn&amp;#39;t help.&lt;/p&gt;\n\n&lt;p&gt;But if those problems have already reached their peak, ports are now getting unclogged, and with the trade deficit already going back down, we can have better expectations for much better GDP numbers next quarter.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;Can we still have a recession?&lt;/h1&gt;\n\n&lt;p&gt;Yes.&lt;/p&gt;\n\n&lt;p&gt;Both in crypto and other markets.&lt;/p&gt;\n\n&lt;p&gt;While things may look like they have reached their peak, and there are some improvements already, you never know when there could be set backs.&lt;/p&gt;\n\n&lt;p&gt;So I&amp;#39;m definitely not trying to be Nostradamus here. I&amp;#39;m just saying a recession is not 100% in the cards. In fact, it may be starting to diminish in probabilities.&lt;/p&gt;\n\n&lt;p&gt;This is definitely not your 2008 recession. We still have low unemployment, a strong housing market, trade deficit dropping 15.9%, growing consumer spending, and we don&amp;#39;t have foreclosures popping up everywhere.&lt;/p&gt;\n\n&lt;p&gt;Bankruptcies filling have also been dropping in the US:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/2ue7dlkj4n291.png?width=782&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=dcbc5af846604e4b395b270d7aacdf7f80cdba1b\"&gt;https://preview.redd.it/2ue7dlkj4n291.png?width=782&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=dcbc5af846604e4b395b270d7aacdf7f80cdba1b&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;What&amp;#39;s important is to understand the cause of all this, to understand if we are heading straight into a recession.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;h1&gt;The cause.&lt;/h1&gt;\n\n&lt;p&gt;Where did it all go wrong, and how did we get here in both crypto and other markets?&lt;/p&gt;\n\n&lt;p&gt;Long story short: liquidity supply crunch.&lt;/p&gt;\n\n&lt;p&gt;Both crypto and stocks have been getting extra fuel with the extra liquidity being printed into the market.&lt;/p&gt;\n\n&lt;p&gt;Both went a little too high too fast, and got a little overbought.&lt;/p&gt;\n\n&lt;p&gt;It was natural that we&amp;#39;d get a correction once the Fed turned off that printer.&lt;/p&gt;\n\n&lt;p&gt;So this isn&amp;#39;t exactly a crash where you have foreclosures popping up all over neighborhoods, bankruptcies, and financial institutions collapsing, like in 2008.&lt;/p&gt;\n\n&lt;p&gt;This is more the market correcting to adjust back to normal pre-covid liquidity.&lt;/p&gt;\n\n&lt;p&gt;In fact, for crypto, it may not even be like 2018, and be more like 2013.&lt;/p&gt;\n\n&lt;p&gt;Where we got a mini bear market for 5 months in the middle of a bull cycle:&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/flk4i3235n291.jpg?width=1262&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3d96d3ac5785cd6cd0b9443eb4d6abd73270e1a0\"&gt;https://preview.redd.it/flk4i3235n291.jpg?width=1262&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=3d96d3ac5785cd6cd0b9443eb4d6abd73270e1a0&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;tl;dr:&lt;/h1&gt;\n\n&lt;p&gt;All the same macos that were supporting the theory that we were heading into a long recession, are now showing signs of either peaking, slowing down, or even turning around.&lt;/p&gt;\n\n&lt;p&gt;And if a couple of key macros like GDP, supply chain, or oil have a significant turnaround, it could create a domino effect that could fuel a recovery. Or at the very least erase a lot of the fuel behind the recession.&lt;/p&gt;\n\n&lt;p&gt;And all 3 are showing data that they are likely to turn around in the coming months.&lt;/p&gt;\n\n&lt;p&gt;This doesn&amp;#39;t mean it will necessarily happen, or that we won&amp;#39;t have a long recession. There&amp;#39;s still a strong possibility. Just not as strong as many people think, and definitely not close to 100%. And the likelihood has begun to decrease.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 429,
  "permalink": "/r/CryptoCurrency/comments/v14f5k/many_seem_to_think_we_are_heading_into_a_long/",
  "subreddit": "CryptoCurrency",
  "id": "v14f5k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Before cosplaying as Michael Bury, or going all in on shorts, check the latest\neconomic data. It's not the sure-fire doomsday scenario it was 2 months ago.\n\n\nTHE HERD.\n\nWhen it comes to investing, be careful of following the herd.\n\nLast year, the herd thought Bitcoin was heading to the moon and…"
}