{
  "author": "santinoIII",
  "original_created_utc": 1650027689,
  "title": "In Catholic tradition Poncius Pilatus met Jesus at 5 a.m. to judge him of his accusations. Was this a regular hour for a Roman governor to be judging people? was he wakened up by the angry populace?",
  "created_utc": 1650043449,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the &amp;quot;clock&amp;quot; of death (I&amp;#39;m not sure if it&amp;#39;s called this way in English). Christ was judged by Pilatus 5 a.m. Was the governor likely awake already? The sun was barely risen. And even if he was likely awake, are there any sources about what hours should these administrative decisions happen?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/u47jxq/in_catholic_tradition_poncius_pilatus_met_jesus/",
  "subreddit": "AskHistorians",
  "id": "u47jxq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the \"clock\" of death (I'm not sure if it's called this way in English).\nChrist was judged by Pilatus 5 a.m. Was the governor likely awake already? The\nsun was barely risen. And even if he was likely awake, are there any sources\nabout what hours should these administrative decisions happen?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "死の「時計」（英語ではこう呼ぶのかどうかわからないが）の中で\nキリストがピラトゥスに裁かれたのは午前5時、総督はもう起きていた可能性が高いのでしょうか。その時\n太陽はほとんど昇っていない。また、仮に起きていたとしても、何か資料があるのでしょうか。\nこのような行政判断は何時ごろに行われるべきなのでしょうか。",
      "title": "カトリックの伝統では、ポンシウス・ピラトゥスはイエスの告発を裁くために、午前5時にイエスに会ったとされている。この時間はローマの総督が人を裁くのにふさわしい時間だったのでしょうか、それとも民衆の怒りで起こされたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在死亡的 \"时钟 \"中（我不确定英语中是否这样称呼）。\n基督被彼拉多审判的时间是凌晨5点，州长可能已经醒了吗？当时\n太阳才刚刚升起。即使他可能已经醒了，是否有任何资料显示\n关于这些行政决定应该在什么时间发生？",
      "title": "在天主教的传统中，本修-皮拉图在早上5点会见了耶稣，对他的指控进行审判。这是一个罗马总督审判人的正常时间吗？他是被愤怒的民众吵醒的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在死亡的 \"時鐘 \"中（我不確定英語中是否這樣稱呼）。\n基督被彼拉多審判的時間是凌晨5點，州長可能已經醒了嗎？當時\n太陽纔剛剛升起。即使他可能已經醒了，是否有任何資料顯示\n關於這些行政決定應該在什麼時間發生？",
      "title": "在天主教的傳統中，本修-皮拉圖在早上5點會見了耶穌，對他的指控進行審判。這是一個羅馬總督審判人的正常時間嗎？他是被憤怒的民衆吵醒的嗎？"
    }
  ]
}