{
  "author": "baturu",
  "the_new_excerpt": "Note that the below text is a re-post of a previous post for visibility. If\nyou've already read this would appreciate an upvote for visibility!\n\nTLDR: GameStop’s Congress hearing is on Feb 18th, they need to investigate the\nPrime Brokers and DTCC for their complicity in enabling naked shorting…",
  "original_created_utc": 1613610915,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "请注意，下面的文字是前一个帖子的转帖，以提高知名度。如果\n你已经读了这将感谢一个上票的知名度!\n\nTLDR：GameStop的国会听证会是在2月18日，他们需要调查一下\n首要经纪公司和戴德梁行共谋促成裸体做空...",
      "title": "非法策略和DTCC/一级经纪商在裸体做空和零售业关闭Gee Em Eee中的共谋（在2/18 GameStop国会听证会前阅读）*转帖以提高知名度*。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請注意，下面的文字是前一個帖子的轉帖，以提高知名度。如果\n你已經讀了這將感謝一個上票的知名度!\n\nTLDR：GameStop的國會聽證會是在2月18日，他們需要調查一下\n首要經紀公司和戴德梁行共謀促成裸體做空...",
      "title": "非法策略和DTCC/一級經紀商在裸體做空和零售業關閉Gee Em Eee中的共謀（在2/18 GameStop國會聽證會前閱讀）*轉帖以提高知名度*。"
    }
  ],
  "title": "Illegal Tactics and DTCC/Prime Broker Complicity In Naked Shorting & Retail Shutdown of Gee Em Eee (Read Ahead of 2/18 GameStop Congress Hearing) *Repost for Visibility*",
  "created_utc": 1613666045,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Note that the below text is a re-post of a previous post for visibility. If you&#39;ve already read this would appreciate an upvote for visibility!</em></p>\n\n<p><strong>TLDR: GameStop’s Congress hearing is on Feb 18th, they need to investigate the Prime Brokers and DTCC for their complicity in enabling naked shorting within GME and by extension, potential collusion to shut down trading on Jan 28th, the day the short squeeze was going to kick off.</strong> (stick to the end for an analysis of some illegal tactics short side hedge funds have been using)</p>\n\n<p>Thesis: On the day the retail market for GME shut down on 1/28 (the day the short squeeze would’ve happened had there been no market intervention), DTCC (clearing house monopoly) shut down retail buying in order to protect itself and Prime Brokers <strong>(which privately own the DTCC)</strong> from being exposed to the consequences of being party to illegal activity. I believe Prime Brokers and DTCC need to be called to the GameStop hearing on February 18th to be questioned for their complicity in enabling illegal naked shorting of the GME stock, as well as potential collusion to shut out retail buyers on 1/28.</p>\n\n<p>In my <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lglrg5/naked_shorting_in_gme_and_how_the_pieces_suddenly/\">previous post</a> (which I recommend reading for some context) I explored the subject of rampant illegal naked shorting in GME, and how Prime Brokers (consisting of banks like Goldman, Morgan, etc) and DTCC would be complicit in the naked shorting. This in turn raises the thought experiment that they would be incentivized to do anything possible to prevent the short squeeze from happening on 1/28 because had the short squeeze happened, the shorts would go bankrupt and their Prime Brokers who lent them their naked shorted shares would need to cover the shares. This would not only represent a humongous capital expense for Prime Brokers, the culpability of Prime Brokers (and that of the DTCC) in this situation would also have likely been exposed as well.</p>\n\n<p>A quick primer on what a Prime Broker is: Prime Brokers are essentially the service side of the short- selling business. They lend out securities and cash, you can think of them as the “house” in a casino: They provide a gambler with markers to play and to manage his winnings. According to Matt Taibi, “Under the original concept, if a hedge fund that wanted to short a stock they would first need to “locate” the stock with his Prime Broker but as time passed, Prime Brokers increasingly allowed their hedge-fund customers to use automated systems and “locate” the stock themselves, and what this does is enable short-sellers to sell stock without delivering and thereby perform naked shorts with counterfeit shares. (source: <a href=\"https://web.archive.org/web/20210213125246/https://www.rollingstone.com/feature/wall-streets-naked-swindle-194908/\">https://web.archive.org/web/20210213125246/https://www.rollingstone.com/feature/wall-streets-naked-swindle-194908/</a>). (I highly recommend you read<a href=\"https://web.archive.org/web/20210213125246/https://www.rollingstone.com/feature/wall-streets-naked-swindle-194908/\"> Matt Taibi’s article</a> on naked shorting and how it was used to take down Bear Stearns and Lehman Brothers. There are so many parallels with GME it’s hard to miss. It’s amazing to consider that 12 years after this article was published and brought to public awareness, the problem of naked shorting still exists as a systemic issue.)</p>\n\n<p>Prime Brokers have a long history of being associated with naked shorting. To highlight a few examples, Prime Brokers like Merill Lynch and Goldman have long been implicated for naked shorting Overstock.com (<a href=\"https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/\">https://www.rollingstone.com/politics/politics-news/accidentally-released-and-incredibly-embarrassing-documents-show-how-goldman-et-al-engaged-in-naked-short-selling-244035/</a>, <a href=\"https://www.forbes.com/2007/02/02/naked-short-suit-overstock-biz-cx_lm_0202naked.html?sh=271400d1763f\">https://www.forbes.com/2007/02/02/naked-short-suit-overstock-biz-cx_lm_0202naked.html?sh=271400d1763f</a>). Another example is when Goldman’s Prime Brokerage was implicated by the SEC in 2016 and got away with a small fine of 16 million (Source: <a href=\"https://www.sec.gov/news/pressrelease/2016-9.html\">https://www.sec.gov/news/pressrelease/2016-9.html</a>). An example that very recently came in the news is a story where CIBC, BOA, UBS and TD Bank Prime Brokerages are accused of facilitating naked short selling and using counterfeit stock to attack and bring the stock price of a company from $34.77 to $1.83 (Source: <a href=\"https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article_id=224548\">https://www.securitiesfinancetimes.com/securitieslendingnews/industryarticle.php?article_id=224548</a>).</p>\n\n<p>The DTCC also has a very long history of being associated with naked shorting. The Wall Street Journal noted that 1% of the DTCC’s volume end in failure to deliver which “<strong>have put DTCC in the middle of a long-running fight over whether unscrupulous investors are driving down hundreds of small companies&#39; share prices… DTCC has turned a blind eye to the naked-shorting problem.</strong> ” (Source: <a href=\"https://www.wsj.com/articles/SB118359867562957720\">https://www.wsj.com/articles/SB118359867562957720</a>). The DTCC has also had numerous complaints submitted to the SEC for enabling naked shorting (source: <a href=\"https://www.sec.gov/rules/proposed/s72303/decosta122203.htm\">https://www.sec.gov/rules/proposed/s72303/decosta122203.htm</a>) and have been sued tens or hundreds of times for assisting naked shorts (source: <a href=\"https://smithonstocks.com/part-3-in-series-on-illegal-naked-shortings-role-in-stock-manipulation-prime-brokers-and-the-dtcc-have-a-troubling-monopoly-on-clearing-and-settling-stock-trades/\">https://smithonstocks.com/part-3-in-series-on-illegal-naked-shortings-role-in-stock-manipulation-prime-brokers-and-the-dtcc-have-a-troubling-monopoly-on-clearing-and-settling-stock-trades/</a> and <a href=\"http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html\">http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html</a> and <a href=\"https://www.wsj.com/articles/SB118359867562957720\">https://www.wsj.com/articles/SB118359867562957720</a>)</p>\n\n<p>On 1/28 Robinhood received a letter from the DTCC at 4 am requiring them to halt trading or come up with <a href=\"https://fortune.com/2021/02/02/robinhood-gamestop-restricted-trading-meme-stocks-gme-amc-vlad-tenev-nscc/\">3 billion dollars</a>, which Robinhood did not have, and therefore with one swoop of the pen the DTCC shut down buy side momentum but strangely allowed selling. Retail investors were shut out of the market and as any student of microeconomics would know, by shutting buy but only allowing sell, the price is bound to fall. Meanwhile while hedge funds were able to keep trading not only in the market but also <a href=\"https://www.reddit.com/r/stocks/comments/lghhkv/gamestop_institutional_broker_trades_off_the/\">crosstrade in the dark pools</a> (“private” stock markets that retail is shut out of, more on this later), and use this crucial lifeline given to them by the DTCC to prevent the squeeze from happening that day.</p>\n\n<p>With retail abruptly being shut out from buy (even cash accounts were shut out, which didn’t make sense) and only allowed to sell, almost everyone could smell manipulation was afoot (which triggered the Congress hearing) and the most of the blame was pointed at Robinhood. Personally and in hindsight, I believe Robinhood was just a willing scapegoat. When we think about who had the most to lose if a short squeeze occurred, I’ll narrow it down to three entities, Shorts and their stakeholders (ie Citadel), Prime Brokers and the DTCC.</p>\n\n<p>It’s important to remember that the actual impetus that triggered the shutdown of the market for retail investors came from the DTCC. Working backwards, if you consider that GME was rampantly naked shorted and DTCC and Prime Brokers would have to be complicit in it, I believe the DTCC, Primer Brokers and possibly Citadel (who provides 40% of Robinhood’s revenue) brazenly manipulated the market on 1/28 by shutting down purchasing for retail buyers to prevent the squeeze from being squoze on that day as doing so would be catastrophic for all aforementioned parties involved. <strong>I believe that on the upcoming Gamestop Congress hearings the Financial Services Committee needs to call on decision makers of DTCC and Prime Brokers explore their role and complicity in the shut out of retail buyers that day as well as being enablers of naked shorting in GME.</strong></p>\n\n<p>An interesting thought experiment: On 1/28 when the price was 450+ and shorts were likely under 100, if we assume prime brokers allowed naked shorting in GME, then when the squeeze was about to happen (or happening), if Prime Brokers had margin had called the shorts, they would presumably also also gone down because shorts would not be able to pay in that event and the brokers would be holding the bag. By that logic, they have every incentive in this case to NOT to margin call and instead the most logical option would probably would have been to make a backroom deal, which is what I personally think most likely happened.</p>\n\n<p>If you’ve read up to this point, you might be thinking what can I do about this? I am aware that there a lot of cynicism that we can’t do anything, that there will be no justice for retail investors who were harmed this situation, and that institutions and people in power will prevent anything from being done. I feel this sometimes too, but remember:</p>\n\n<p><strong>A single voice can be drowned out, but if we all speak together then we will make our voice heard. Ape Strong Together.</strong></p>\n\n<p>With the hearing coming up on February 18th, I highly recommend you email and tweet the representatives involved in the hearing, as well as your own district representatives, and urge them to read into the factors presented in this post and <strong>call the DTCC and Prime Brokers to the hearing</strong>l. <strong>They need to be questioned on why GME has so many counterfeit shares, failed to deliver, their complicity in naked shorting, and investigated for their role in the retail shut down of 1/28.</strong> Below are 4 members of congress I recommend both tweeting and emailing</p>\n\n<p>House Financial Services Committee: <a href=\"https://twitter.com/FSCDems\">https://twitter.com/FSCDems</a> email: FSCDemsPress@<a href=\"http://mail.house.gov/\">http://mail.house.gov/</a></p>\n\n<p>Alexandria Ocasio-Cortez <a href=\"https://twitter.com/AOC\">https://twitter.com/AOC</a>, email: [<a href=\"mailto:us@ocasiocortez.com\">us@ocasiocortez.com</a>](mailto:<a href=\"mailto:us@ocasiocortez.com\">us@ocasiocortez.com</a>)</p>\n\n<p>Al Green <a href=\"https://twitter.com/repalgreen\">https://twitter.com/repalgreen</a>, email: [<a href=\"mailto:al.green@mail.house.gov\">al.green@mail.house.gov</a>](mailto:<a href=\"mailto:al.green@mail.house.gov\">al.green@mail.house.gov</a>)</p>\n\n<p>Maxine Waters <a href=\"https://twitter.com/maxinewaters\">https://twitter.com/maxinewaters</a>, email: <a href=\"https://waters.house.gov/contact/email\">https://waters.house.gov/contact/email</a></p>\n\n<p>Senator Toomy <a href=\"https://twitter.com/SenToomey\">https://twitter.com/SenToomey</a>, email: <a href=\"https://www.toomey.senate.gov/contact/email-senator-toomey\">https://www.toomey.senate.gov/contact/email-senator-toomey</a></p>\n\n<p>Nancy Pelosi Email: <a href=\"https://twitter.com/SpeakerPelosi\">https://twitter.com/SpeakerPelosi</a> email: [<a href=\"mailto:americanvoices@mail.house.gov\">americanvoices@mail.house.gov</a>](mailto:<a href=\"mailto:americanvoices@mail.house.gov\">americanvoices@mail.house.gov</a>)</p>\n\n<p>And you can find other members of Financial Services Committee here to reach out to: <a href=\"https://financialservices.house.gov/about/committee-membership.htm\">https://financialservices.house.gov/about/committee-membership.htm</a></p>\n\n<p><em>Edit (Adding based on a reader&#39;s comment): In your letter to your congressman, please ask to request the Congressional Research Service(CRS) to publish a report on the matter. CRS is Congress’s private think tank. If they publish a report, IT WILL be read throughout the Hill, and taken more seriously than anything we could ever do as constituents</em></p>\n\n<p>What follows should probably be a separate post, but I will take the opportunity to summarize some of the illegal tactics that shorts have been identified to be using in their war with retail investors. Note that this may not be an exhaustive list and there may be newer tactics deployed in the future. Retail investors might not have the same tricks, resources and willingness to break the law for profit as hedgies do, but my hope and belief is that if we pool our knowledge and analysis, we will figure out their game and effectively adapt.</p>\n\n<p>Feel free to forward the list below to any representatives and lawmakers if you concur that these tactics were used:</p>\n\n<p><strong>Rampant Naked Shorting -</strong> With the <a href=\"http://www.wherearetheshares.com/\">extremely high number of Fail to Delivers (FTID</a>) , <a href=\"https://imgur.com/fN4fVQl\">short interest being as high as 226% recently</a>, <a href=\"https://www.reddit.com/r/wallstreetbets/comments/le235t/gme_institutions_hold_177_of_float_why_the\">and institutions alone holding a staggering 177% of the total float</a> (likely due in large part to counterfeit shares), signs strongly point to GME being rampant with naked shorts and counterfeit shares. I believe the original goal of shorts was to drive GME to bankruptcy with these naked shorts, using <a href=\"https://www.reddit.com/r/wallstreetbets/comments/lf4vn3/yes_laddering_is_real_short_ladder_attack_is_just/\">the laddering of naked shorts</a> (aka short ladder attack), executed with the help of counterfeit stock which is a classic and reliable method of driving down the stock price. I believe the GME stock has seen relentlessly aggressive short attacks, especially on the week of Monday February 1st, which drove the stock price down and triggered panic selling.</p>\n\n<p><strong>Masking Shorts with by Shorting ETFs that hold GME</strong> (Can&#39;t link due to WSB, will put in comments)</p>\n\n<p><strong>Ladder Attacks with the help of Dark Pools</strong> - Another identified method of ladder attacks was identified to come from <a href=\"https://www.reddit.com/r/stocks/comments/lghhkv/gamestop_institutional_broker_trades_off_the/\">crosstrading with darkpools (the stock market has its own private stock exchange where institutions can trade…)</a>. Essentially darkpools are private stock markets retail investors do not have access to, where short side funds can purchase securities “off market” and then sell “on-market”, with the effect of creating a lot more downward pressure on the market without the upward pressure from buying.</p>\n\n<p><strong>Illegally masking shorts with synthetic longs</strong>. Another tactic shorts are suspected of using in GME is the use of illegally using options to evade short positions in violation of Reg SHO which SEC describes in <a href=\"https://www.sec.gov/news/press-release/2013-151\">this risk alert</a> and which I elaborate in this <a href=\"https://www.reddit.com/r/wallstreetbets/comments/leorks/evidence_points_to_gme_shorts_not_having_covered/\">post</a>. Essentially it’s the use of using options to create synthetic longs to illegally and artificially cover and prolong short positions and at same time obscuring the true short interest %. If you consider that it would be far more profitable for shorts to not cover at high prices but instead ladder attack the price and wait for retail investors to lose interest and close their shorts at as low of a price as possible, then you can see why this strategy would be very effective.</p>\n\n<p><strong>Using way out-of-money call options to obscure true short interest.</strong> You may have heard about the 43 million worth of 800 dollar calls purchased when the price was 100 and found it odd. Later it was identified as a tactic to cheaply purchase synthetic call options (since at 800 its way out of money) to obscure their short positions (with the added benefit of hedging at 800 if a squeeze does happen)</p>\n\n<p>One thing I want to note, particularly to legislators at the GameStop hearing: Retail investors were not incited to pump GME. <strong>Retail investors spotted a unique Short Squeeze opportunity created by the greed of short side hedge funds</strong>, whereby GameStop was being abusively naked shorted with the goal of bringing it to bankruptcy, and hedge funds were so greedy about it that they shorted the company with a short interest of 226% of float, meaning A LOT of counterfeit shares were being used to short the company. <strong>Retail investors saw this as an opportunity to short squeeze the hedge fund shorters, which is a legal and legitimate investment strategy</strong>. The short squeeze would have happened had everyone played fair, but instead, financial institutions who were culpable to the naked shorting intervened and shut down retail buying, hurting the retail investors and successfully manipulating the market. The investment itself was in my opinion a sound decision based on the short squeeze, but in hindsight retail investors did not seriously consider the risk of the market would be blatantly and publicly manipulated and that the market would be rigged against them.</p>\n\n<p>If this post was useful (and I hope it was! Gave up my Friday night to write this for you Apes), please upvote for visibility and share it far and wide. <strong>The GameStop hearings could be a first step and hope towards legislative change, and it’s extremely important that the right story is told at those hearings (and by the right story I mean the real truth of what happened</strong>.) I hope the truly culpable parties are investigated and brought to justice. Again, I know many of us feel cynical that anything meaning will be done towards finding justice against the lawbreakers in this case, but <strong>if you feel even an ounce of injustice or empathy at how retail investors were unfairly harmed in the course of investing in GME, I strongly urge you to contact a legislator associated with the GameStop hearings and bring this to their attention so they can review this case with more complete information. In addition I recommend you to contact the SEC and any journalist you know or via journalist tip lines. It’s not going to be easy but the more awareness we raise the higher the likelihood our voices will be heard and positive change will be made.</strong></p>\n\n<p>Ps. If you’ve read to the end, I’ll leave you with a few more thoughts and reminders:</p>\n\n<p>- If I were to distill life into one thing, it would be to never lose hope.</p>\n\n<p>- Remember that if you’ve lost money in any way shape or form, don’t be depressed, money can always be made back and the important thing is to maintain a good attitude.</p>\n\n<p>- Only invest what you can afford to lose.</p>\n\n<p>- Perhaps the most important factor in good investing is patience.</p>\n\n<p>If you’d like to read more about counterfeiting stocks this is a good place to start <a href=\"http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html\">http://counterfeitingstock.com/CS2.0/CounterfeitingStock.html</a></p>\n\n<p><em>Disclaimer: I am not an investment advisor, I just like the stock.</em></p>\n</div><!-- SC_ON -->",
  "score": 2117,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?auto=webp&s=3139271e52007aeb7764a8086424f3cc0b2fa7e3",
          "width": 600,
          "height": 315
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?width=108&crop=smart&auto=webp&s=f6d174d2ce2f178962391d2b81e2ba944c7ffdad",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?width=216&crop=smart&auto=webp&s=53abc53e498068e10e89c9158972a493cf06834e",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/L3atnlgwDRL_Yz1j63aT5AVHbCX0EbJX-Mg03umJ1DE.jpg?width=320&crop=smart&auto=webp&s=c61d79060e920ad8154ed7221090f06f0aa1dd0e",
            "width": 320,
            "height": 168
          }
        ],
        "variants": {},
        "id": "QsOfS2fwOuGkLPEc_IDsy7w1UFzHIlhOKonjFOnyrFo"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/wallstreetbets/comments/lma1ev/illegal_tactics_and_dtccprime_broker_complicity/",
  "subreddit": "wallstreetbets",
  "id": "lma1ev",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332887615
}