{
  "author": "damnsonwhyyoutrippin",
  "original_created_utc": 1637621273,
  "title": "People around me are talking about the Black Friday sale. I can’t wait to get my paycheck and spend it on cryptocurrency.",
  "created_utc": 1637633241,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My friends and coworkers are talking about buying stuff on Black Friday. To be honest… it’s mostly just wasting your money on things you don’t need. Most of the stuff have fake discounts anyway.</p>\n\n<p>I can’t wrap my around people that barely have savings on the bank and still are eager to buy useless crap. I rather invest my money for the future.</p>\n\n<p>Cryptocurrency really taught me how to save money. Never had a single school teacher teaching me anything about money or how to manage money wisely. Hell… even my parents didn’t. But I don’t blame them because they came from a poor place and barely could keep their head above water.</p>\n\n<p>Thank you for coming to my Ted Talk.</p>\n\n<p>EDIT: of course I won’t spend 100% of paycheck on cryptocurrency, since I only invest what I can afford to lose (and so should you). I just stick to my monthly DCA plan.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/qzy604/people_around_me_are_talking_about_the_black/",
  "subreddit": "CryptoCurrency",
  "id": "qzy604",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My friends and coworkers are talking about buying stuff on Black Friday. To be\nhonest… it’s mostly just wasting your money on things you don’t need. Most of\nthe stuff have fake discounts anyway.\n\nI can’t wrap my around people that barely have savings on the bank and still are\neager to buy useless…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人や同僚は、ブラックフライデーに物を買うと話しています。正直言って\n正直なところ、必要のないものにお金を使うのはもったいないですよね。ほとんどの\n殆どの商品は偽の割引をしています。\n\n貯金もほとんどないのに、無駄なものを買おうとしている人たちには頭が下がります。\n無駄なものを買おうとしている人には頭が下がります。",
      "title": "周りの人はブラックフライデーのセールの話をしています。早く給料をもらって、暗号通貨に使いたいですね。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友和同事们都在谈论在黑色星期五买东西的事。说实话\n说实话......这主要是在你不需要的东西上浪费你的钱。大多数的\n的东西都有虚假的折扣。\n\n我无法理解那些在银行里几乎没有存款的人，却仍然\n热衷于购买无用的...",
      "title": "我周围的人都在谈论黑色星期五的促销活动。我迫不及待地想拿到我的工资，把它花在加密货币上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友和同事們都在談論在黑色星期五買東西的事。說實話\n說實話......這主要是在你不需要的東西上浪費你的錢。大多數的\n的東西都有虛假的折扣。\n\n我無法理解那些在銀行裏幾乎沒有存款的人，卻仍然\n熱衷於購買無用的...",
      "title": "我周圍的人都在談論黑色星期五的促銷活動。我迫不及待地想拿到我的工資，把它花在加密貨幣上。"
    }
  ]
}