{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\n\nRussia's biggest search engine could collapse as financial fallout from the invasion of Ukraine spreads. Yandex (YNDX), which handles about 60% of internet search traffic in Russia and operates a big ride-hailing business, said Thursday that it may be unable to pay its debts as a consequence of the financial market meltdown triggered by the West's unprecedented sanctions. The company is based in the Netherlands, but its shares are listed on the Nasdaq and the Russian stock exchange. Dealing in the stock has been suspended this week as the value of Russian assets collapsed in Moscow and around the world in the wake of the invasion. The imposition of sanctions by the United States, European Union and other big Western economies last weekend piled on the pressure.\n\n\n\nYandex hasn't been sanctioned but it could still default. Investors who hold $1.25 billion in Yandex convertible notes have a right to demand repayment in full, plus interest, if trading in its shares are suspended on the Nasdaq for more than five days. The Moscow stock market will remain shut at least until Tuesday, Russian state news agencies reported on Friday. \"The Yandex group as a whole does not currently have sufficient resources to redeem the Notes in full,\" the company said in a statement. It may also struggle to move money out of its major operating businesses in Russia to bail out the Dutch parent company because of Western sanctions and capital controls introduced by Moscow this week aimed at preserving precious foreign currency reserves and preventing international companies ditching assets. Sberbank (SBRCY), Russia's biggest lender, was forced to close its European arm earlier this week after it was prevented by the Russian central bank from sending money to its Vienna-based subsidiary following a run on deposits.\n\n\n\n\"In the event that we were prevented from distributing additional funds from our Russian subsidiaries to our Dutch parent company, Yandex would not have sufficient resources to redeem a majority of the Notes,\" the tech company said. That could affect its ability to meet other financial obligations. \"We are currently conducting contingency planning to determine what steps we would take in this regard and what other sources of financing would be available to us, in the event that this redemption right is triggered,\" it added. The crisis in Ukraine poses another threat to its business. Western companies are halting supplies of technology and services to Russian customers. A prolonged suspension of hardware or software sales could hurt Yandex over time. \"We believe that our current data center capacity and other technology critical to operations will allow us to continue to operate in the ordinary course for at least the next 12 to 18 months,\" Yandex said. Yandex, which had a market value of about $17.4 billion at the beginning of February, reported revenues worth 356 billion rubles in 2021, now equivalent to little more than $3 billion after the collapse in the Russian currency. In 2018, it established a joint venture with Uber to combine their ride-sharing businesses in Russia and neighboring countries.",
  "author_fullname": "t2_4e0be210",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Russia's version of Google Yandex (YNDX) warns it could default",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickernews",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_t6u904",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.9,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company News",
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1646431605,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\"&gt;https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Russia&amp;#39;s biggest search engine could collapse as financial fallout from the invasion of Ukraine spreads. Yandex (YNDX), which handles about 60% of internet search traffic in Russia and operates a big ride-hailing business, said Thursday that it may be unable to pay its debts as a consequence of the financial market meltdown triggered by the West&amp;#39;s unprecedented sanctions. The company is based in the Netherlands, but its shares are listed on the Nasdaq and the Russian stock exchange. Dealing in the stock has been suspended this week as the value of Russian assets collapsed in Moscow and around the world in the wake of the invasion. The imposition of sanctions by the United States, European Union and other big Western economies last weekend piled on the pressure.&lt;/p&gt;\n\n&lt;p&gt;Yandex hasn&amp;#39;t been sanctioned but it could still default. Investors who hold $1.25 billion in Yandex convertible notes have a right to demand repayment in full, plus interest, if trading in its shares are suspended on the Nasdaq for more than five days. The Moscow stock market will remain shut at least until Tuesday, Russian state news agencies reported on Friday. &amp;quot;The Yandex group as a whole does not currently have sufficient resources to redeem the Notes in full,&amp;quot; the company said in a statement. It may also struggle to move money out of its major operating businesses in Russia to bail out the Dutch parent company because of Western sanctions and capital controls introduced by Moscow this week aimed at preserving precious foreign currency reserves and preventing international companies ditching assets. Sberbank (SBRCY), Russia&amp;#39;s biggest lender, was forced to close its European arm earlier this week after it was prevented by the Russian central bank from sending money to its Vienna-based subsidiary following a run on deposits.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;In the event that we were prevented from distributing additional funds from our Russian subsidiaries to our Dutch parent company, Yandex would not have sufficient resources to redeem a majority of the Notes,&amp;quot; the tech company said. That could affect its ability to meet other financial obligations. &amp;quot;We are currently conducting contingency planning to determine what steps we would take in this regard and what other sources of financing would be available to us, in the event that this redemption right is triggered,&amp;quot; it added. The crisis in Ukraine poses another threat to its business. Western companies are halting supplies of technology and services to Russian customers. A prolonged suspension of hardware or software sales could hurt Yandex over time. &amp;quot;We believe that our current data center capacity and other technology critical to operations will allow us to continue to operate in the ordinary course for at least the next 12 to 18 months,&amp;quot; Yandex said. Yandex, which had a market value of about $17.4 billion at the beginning of February, reported revenues worth 356 billion rubles in 2021, now equivalent to little more than $3 billion after the collapse in the Russian currency. In 2018, it established a joint venture with Uber to combine their ride-sharing businesses in Russia and neighboring countries.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5a4c814a-65e6-11e5-b65e-122ab0778f8b",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f9cc80",
  "id": "t6u904",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "WickedSensitiveCrew",
  "discussion_type": null,
  "num_comments": 24,
  "send_replies": false,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/t6u904/russias_version_of_google_yandex_yndx_warns_it/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/t6u904/russias_version_of_google_yandex_yndx_warns_it/",
  "subreddit_subscribers": 3711241,
  "created_utc": 1646482343,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1646431605,
  "the_new_excerpt": "https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\n\nRussia's biggest search engine could collapse as financial fallout from the\ninvasion of Ukraine spreads. Yandex (YNDX), which handles about 60% of internet\nsearch traffic in Russia and operates a big ride-hailing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\n\nロシア最大の検索エンジンは、金融危機の影響で崩壊する可能性がある。\nウクライナへの侵攻が広がっている。インターネットの約60％を扱うヤンデックス(YNDX)は\nロシアでの検索トラフィックと、大規模なライドヘイリングサービスを運営し...",
      "title": "ロシア版Google Yandex（YNDX）、デフォルトの可能性を警告"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\n\n俄罗斯最大的搜索引擎可能崩溃，因为入侵乌克兰造成的财政损失正在蔓延。\n入侵乌克兰的金融影响蔓延。Yandex(YNDX)处理着俄罗斯约60%的互联网搜索流量，并经营着一个大型的叫车服务。\n该公司处理着俄罗斯约60%的互联网搜索流量，并经营着一个大型的叫车服务。",
      "title": "俄罗斯版谷歌Yandex（YNDX）警告说它可能会违约"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://www.cnn.com/2022/03/04/tech/yandex-russia-internet-warning/index.html\n\n俄羅斯最大的搜索引擎可能崩潰，因爲入侵烏克蘭造成的財政損失正在蔓延。\n入侵烏克蘭的金融影響蔓延。Yandex(YNDX)處理着俄羅斯約60%的互聯網搜索流量，並經營着一個大型的叫車服務。\n該公司處理着俄羅斯約60%的互聯網搜索流量，並經營着一個大型的叫車服務。",
      "title": "俄羅斯版谷歌Yandex（YNDX）警告說它可能會違約"
    }
  ]
}