{
  "author": "crua9",
  "original_created_utc": 1646331312,
  "title": "If Russia switches to a crypto standard due to this, world gov can easily start tracking how the gov spends their money through the ledger",
  "created_utc": 1646398267,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So something interesting about what is going on is since Russian banks pretty much aren&amp;#39;t working. This is forcing average everyday people to use crypto to buy food or whatever. Some are worried this leaves the door open for the gov, but the fact is their budget isn&amp;#39;t in the hundreds, thousands, or even low millions. Their budget is so high in theory it wouldn&amp;#39;t be that hard to figure out what wallets they are using through the ledger.&lt;/p&gt;\n\n&lt;p&gt;And since most crypto you can track every transaction through the ledger. In theory, what this means is if the companies/gov that map out the blockchain to figure out who is who. They can figure out who is the Russian gov sending money to, when, and all the other things around that. And from that look into the why and maybe start targeting groups Russia does business with.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;For example, there is obviously direct connection between the Russian gov and the Russian Mafia. When you map the wallets out, you can see Russia gov paying the Russian Mafia and blast that info out to the wider world showing this corruption. And it would just take a small bit of investigation to find out why and exacts.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;So in theory, this might be worth while for this to be a new norm to help track corruption or other problems.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/t5xw5u/if_russia_switches_to_a_crypto_standard_due_to/",
  "subreddit": "CryptoCurrency",
  "id": "t5xw5u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So something interesting about what is going on is since Russian banks pretty\nmuch aren't working. This is forcing average everyday people to use crypto to\nbuy food or whatever. Some are worried this leaves the door open for the gov,\nbut the fact is their budget isn't in the hundreds, thousands, or…"
}