{
  "author": "velocipedic",
  "original_created_utc": 1627140019,
  "title": "Change My Mind: Crypto is the most accessible avenue for Millenials (and younger) to build generational wealth.",
  "created_utc": 1627155237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Real Estate:</strong> The real-estate market is ludicrously high. Boomers and corporations own a large portion of the properties. High cost for entry into this market.</p>\n\n<p><strong>Stocks:</strong> Stocks are corrupted by hedge funds and manipulation (see AMC/GME for proof). In order to make money, you need to start with at least a little bit. Even $1000 is low and will take some serious time to see growth unless you get reaaalllly lucky.</p>\n\n<p><strong>DotCom Boom:</strong> As a millenial, I was obviously too young to get into the dotcom boom. </p>\n\n<p><strong>Crypto:</strong> Low cost of entry. Multiple use cases. Risky (according to traditional standards), but we&#39;re younger and can absorb some of that. </p>\n\n<p>&nbsp;</p>\n\n<p>There are others that I haven&#39;t covered, but the way I see it, crypto is the only thing accessible for the generation that feels like every other opportunity for wealth-growth is out of reach.</p>\n\n<p><strong>TLDR;</strong> I&#39;m in crypto because I don&#39;t want to wait 30 years for the next <strong><em>big thing</em></strong> to come around. I&#39;ll nearly be 60 by then. Screw those people that want to stand in our way and make it difficult for us to get a piece of the pie.</p>\n\n<hr/>\n\n<p><strong>Edit:</strong> A lot of comments accuse me of saying &quot;stocks are bad.&quot; <strong><em>I never said that,</em></strong> but it is clear that the fix is in and the system is designed for hedgies to win and for you to lose. Exponential growth is also severely limited. Potential for growth with stocks/indices is long and slow, especially if you don&#39;t have training/education/money to start with.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/oqs1ud/change_my_mind_crypto_is_the_most_accessible/",
  "subreddit": "CryptoCurrency",
  "id": "oqs1ud",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Real Estate: The real-estate market is ludicrously high. Boomers and\ncorporations own a large portion of the properties. High cost for entry into\nthis market.\n\nStocks: Stocks are corrupted by hedge funds and manipulation (see AMC/GME for\nproof). In order to make money, you need to start with at…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "不動産のこと 不動産市場はおかしなほど高い。団塊の世代と\n団塊の世代や企業が大部分の不動産を所有している。この市場に参入するためのコストが高い\nこの市場への参入コストが高い。\n\n株式。株式はヘッジファンドと操作によって腐敗している（AMC/GMEで証明されている）。\nる）。) 儲けるためには、最低でも...",
      "title": "チェンジ・マイ・マインド 暗号は、ミレニアム世代（およびそれ以下の世代）が世代を超えた富を築くための、最も身近な手段です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "房地产。房地产市场高得离谱。婴儿潮一代和\n公司拥有很大一部分的房产。进入这个市场的成本很高。\n这个市场。\n\n股票。股票被对冲基金和操纵所腐蚀（见AMC/GME的证据）。\n证据）。) 为了赚钱，你需要从...",
      "title": "改变我的想法。加密货币是千禧一代（和更年轻的人）建立一代人财富的最便捷途径。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "房地產。房地產市場高得離譜。嬰兒潮一代和\n公司擁有很大一部分的房產。進入這個市場的成本很高。\n這個市場。\n\n股票。股票被對沖基金和操縱所腐蝕（見AMC/GME的證據）。\n證據）。) 爲了賺錢，你需要從...",
      "title": "改變我的想法。加密貨幣是千禧一代（和更年輕的人）建立一代人財富的最便捷途徑。"
    }
  ]
}