{
  "author": "EccoEco",
  "original_created_utc": 1629559392,
  "title": "Does organic matter decompose in highly irradiated zones?",
  "created_utc": 1629570712,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I have read in the past that the most irradiated areas of Chernobyl are at high risk of wild Fire due to the abundance of deadwood that accumulates because bacteria aren&#39;t able to successfully colonize the area enough to initiate decomposition due to the radiation.\nSo this question came to my mind, it might sound a bit obvious or silly but does this mean that all organic matter is unable to be decomposed or does wood resist the hindered bacteria because it&#39;s more resistant to decomposition than flesh?\nIs the radiation in the high-risk zones high enough to kill all bacteria or enough that it renders all processes of organic decomposition impossible or not?\nIf, for the sake of experimentation, I were to put a chunk of meat in a highly irradiated zone and leave it there for decomposition to take its course would I find it still unaltered as if I had sterilized it using irradiation?</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/askscience/comments/p8tciv/does_organic_matter_decompose_in_highly/",
  "subreddit": "askscience",
  "id": "p8tciv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I have read in the past that the most irradiated areas of Chernobyl are at\nhigh risk of wild Fire due to the abundance of deadwood that accumulates because\nbacteria aren't able to successfully colonize the area enough to initiate\ndecomposition due to the radiation. So this question came to my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "チェルノブイリで最も放射線を浴びた地域は山火事のリスクが高いという記事を過去に読んだことがあります。\nチェルノブイリの最も放射線の強い地域では、枯れ木が大量に蓄積されているため、山火事のリスクが高い。\n放射能の影響でバクテリアが十分に繁殖できず、分解が進まないからです。\nこれは、放射線の影響でバクテリアが十分に繁殖できず、分解が進まないためです。そこで、こんな疑問が浮かびました。",
      "title": "高線量被曝地域では有機物が分解されるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我在过去读到，切尔诺贝利受辐射最严重的地区处于\n由于大量的枯木堆积，野生火灾的风险很高，因为\n细菌不能够成功地在该地区定居，不足以启动\n辐射导致的分解。因此，我想到了这个问题...",
      "title": "有机物在高辐照区是否会分解？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我在過去讀到，切爾諾貝利受輻射最嚴重的地區處於\n由於大量的枯木堆積，野生火災的風險很高，因爲\n細菌不能夠成功地在該地區定居，不足以啓動\n輻射導致的分解。因此，我想到了這個問題...",
      "title": "有機物在高輻照區是否會分解？"
    }
  ]
}