{
  "author": "roberthonker",
  "original_created_utc": 1624845535,
  "title": "Always Remember: RobinHood prevented stocks and crypto from being bought and sold. DON'T \"buy\" crypto on RobinHood.",
  "created_utc": 1624851862,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everyone should remember what RobinHood has done. They have restricted trading many times before, and it will happen again. Do not put your money into a scam ecosystem which doesn&#39;t allow you to sell when it benefits them financially. </p>\n\n<p><strong>Be in control of your own crypto. Coinbase, Kraken and Binance are all better places to buy crypto. Buy a hardware wallet for extra security if you wish.</strong></p>\n</div><!-- SC_ON -->",
  "score": 360,
  "permalink": "/r/CryptoCurrency/comments/o9alwx/always_remember_robinhood_prevented_stocks_and/",
  "subreddit": "CryptoCurrency",
  "id": "o9alwx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everyone should remember what RobinHood has done. They have restricted trading\nmany times before, and it will happen again. Do not put your money into a scam\necosystem which doesn't allow you to sell when it benefits them financially.\n\nBe in control of your own crypto. Coinbase, Kraken and Binance…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんな、RobinHoodがやってきたことを忘れないでほしい。彼らはこれまで何度も取引を制限してきました。\n今までも何度も制限してきましたが、今回もそうなるでしょう。詐欺まがいのエコシステムにお金をつぎ込まないでください。\n詐欺まがいのエコシステムに資金を投入しないでください。\n\n自分の暗号を自分で管理しましょう。Coinbase、Kraken、Binance...。",
      "title": "Always Remember: RobinHoodでは、株や暗号の売買ができないようになっています。RobinHoodでcryptoを \"買わない \"でください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每个人都应该记住RobinHood所做的事情。他们已经限制了交易\n以前多次，而且会再次发生。不要把你的钱投入一个骗局\n生态系统，当他们在经济上受益时，不允许你出售。\n\n要控制你自己的加密货币。Coinbase、Kraken和Binance...",
      "title": "永远记住。RobinHood阻止了股票和加密货币的买卖。不要在RobinHood上 \"购买 \"加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每個人都應該記住RobinHood所做的事情。他們已經限制了交易\n以前多次，而且會再次發生。不要把你的錢投入一個騙局\n生態系統，當他們在經濟上受益時，不允許你出售。\n\n要控制你自己的加密貨幣。Coinbase、Kraken和Binance...",
      "title": "永遠記住。RobinHood阻止了股票和加密貨幣的買賣。不要在RobinHood上 \"購買 \"加密貨幣。"
    }
  ]
}