{
  "author": "jberm123",
  "the_new_excerpt": "Currently the 2nd highest post on r / personalfinance (can't link to it because\nit'll get removed):\n\n> On March 3rd, 2021, my husband was out and tried to buy a cheeseburger, when\n> his card declined. He called me to let me know his card was not working and\n> asked if i could get to the bottom of…",
  "original_created_utc": 1615190862,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "目前在r/personalfinance上的第2高帖（无法链接到它，因为。\n会被删除）。)\n\n> 2021年3月3日，我的丈夫在外面想买一个奶酪汉堡，当... ...\n> 他的卡被拒绝了。他打电话给我，让我知道他的卡不能用了，而且。\n> 问我是否可以得到的底部... ...",
      "title": "Suntrust银行在没有任何警告的情况下关闭了某人的账户。让他们没有能力支付账单，养家糊口，或者支付汽油费。比特币解决了这个问题."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前在r/personalfinance上的第2高帖（無法鏈接到它，因爲。\n會被刪除）。)\n\n> 2021年3月3日，我的丈夫在外面想買一個奶酪漢堡，當... ...\n> 他的卡被拒絕了。他打電話給我，讓我知道他的卡不能用了，而且。\n> 問我是否可以得到的底部... ...",
      "title": "Suntrust銀行在沒有任何警告的情況下關閉了某人的賬戶。讓他們沒有能力支付賬單，養家餬口，或者支付汽油費。比特幣解決了這個問題."
    }
  ],
  "title": "Suntrust Bank closed someone's account with no warning. Left them with no ability to pay bills, feed their family, or pay for gas. Bitcoin fixes this.",
  "created_utc": 1615217939,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Currently the 2nd highest post on r / personalfinance (can&#39;t link to it because it&#39;ll get removed):</p>\n\n<blockquote>\n<p>On March 3rd, 2021, my husband was out and tried to buy a cheeseburger, when his card declined. He called me to let me know his card was not working and asked if i could get to the bottom of it. I had noticed the previous day, that the app on my phone for our bank, SUNTRUST, was not letting me login as i was trying to check our funds for budgeting, and i assumed the app was being updated so i didn&#39;t bother with it. all in all, i ended up calling the customer service phone number on the back of my debit card, which connected me with a representative to whom i explained the current situtation. The representative began to stutter and could barely get a sentence out without placing an &quot;umm&quot; between every word, which instantly gave me anxiety. As she procceeded to answer my question as to why my card was not working, she stated &quot;The account has been closed, Suntrust decided they will no longer continue banking with you as per a &#39;routine review&#39; of their accounts&quot;. As you could imagine, i was instantly irate, Due to the fact that all of my husband and I&#39;s funds were in this one sole account, and i had not recieved ANY notification of closure or review. I instantly hung up the phone, and decided i would go down to my local branch, because surely this was some mistake.</p>\n\n<p>As i arrived at the branch, i sat down with a banker in a very humid glass office, and kindly explained what the representative had told me on the phone, but that i had no knowledge of why this would have happened. The banker seemed confused as if this had never occured before, and procceeded to pull up my account. As he read over the notes, he remained quiet which i found odd. He turned to me and very plainly stated &quot;there are no notes in regards to the situtation, im not sure why, there is just a phone number provided for you to contact for more information, im sorry.&quot; and handed me a paper with the said phone number on it.</p>\n\n<p>I walked out of the building, and called the number in my car from the parking lot. It brought up the automated system for the suntrust fraud department, which then led to me to a representative with an international accent, most likely indian, which led me to assume this was an offshore phone number. I again had to explain my situation and yet AGAIN no explanation could be provided.</p>\n\n<p>At this point, i was now past anger, and my emotions grew into fear, where is my money!?</p>\n\n<p>I walked back into the branch, unsatisfied with the service being provided from this institution, and requested to speak with the manager. He politely led me into his office, as i again explained the situation. as the banker before had, the manager pulled my account up and read through what seemed like an endless amounts of notes, yet could not provide an explantion. He stated he had to call the &#39;back office&#39; who are responsible for account closures, placed the call on speaker but as soon as someone picked up, placed it on a personal call so i could not hear the responses. The manager explained what was going on, and asked &quot;is there any information that i CAN provide to the client?&quot; which flew a huge red flag for me.. what do you mean what you can tell me? its my money for god sake, don&#39;t hide information.. but anyways, he continued on and could only state that the fraud department was reviewing my account and they decided to close the account. he could not provide any timeframe for when i would recieve my money, but that it would come through a check in the mail. I cried right there unapologetically, this bank took all our money, won&#39;t give us access to it online to even verify the amount in the account, and won&#39;t provide any further information.</p>\n\n<p>I have no money to pay the bills, feed my family, put gas in the car. I don&#39;t know how this is even legal, as i have seen many other people&#39;s testimonies reporting the same, with no luck for a resolution. We had thousands of dollars in this account, and they took it all without remorse or explanation.</p>\n\n<p>What do we do now? Get a lawyer? How do we pay?</p>\n\n<p>If this has happened to you, i am so sorry, but this just can&#39;t be legal.</p>\n\n<p>what now.</p>\n</blockquote>\n\n<p>This story is frightening. Bitcoin helps me sleep well at night. Be your own bank.</p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/Bitcoin/comments/m0b0sj/suntrust_bank_closed_someones_account_with_no/",
  "subreddit": "Bitcoin",
  "id": "m0b0sj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542569382
}