{
  "author": "AvidasOfficial",
  "the_new_excerpt": "Pretty sure I'm going to get downvoted for this especially with how people\nliterally worship Elon. But fuck him and his manipulation.\n\nHe has brought a level of toxicity to the crypto space that should be shunned\nrather than welcomed. Whether it is shilling noobs into a massively over\ninflated meme…",
  "original_created_utc": 1616068314,
  "localize": [
    {
      "locale": "zh",
      "title": "去他妈的埃隆-马斯克和他的市场操纵/NFT废话",
      "the_new_excerpt": "我很确定我会因此而被降权，尤其是在人们的眼中\n字面上崇拜埃隆。但是去他的，去他的操纵。\n\n他给加密领域带来了一定程度的毒性，应该被回避。\n而不是欢迎。不管是将noobs推到一个大规模的过。\n夸大其词"
    },
    {
      "locale": "zh-Hant",
      "title": "去他媽的埃隆-馬斯克和他的市場操縱/NFT廢話",
      "the_new_excerpt": "我很確定我會因此而被降權，尤其是在人們的眼中\n字面上崇拜埃隆。但是去他的，去他的操縱。\n\n他給加密領域帶來了一定程度的毒性，應該被迴避。\n而不是歡迎。不管是將noobs推到一個大規模的過。\n誇大其詞"
    }
  ],
  "title": "Fuck Elon Musk & his market manipulation/NFT bullshit",
  "created_utc": 1616078306,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Pretty sure I&#39;m going to get downvoted for this especially with how people literally worship Elon. But fuck him and his manipulation. </p>\n\n<p>He has brought a level of toxicity to the crypto space that should be shunned rather than welcomed. Whether it is shilling noobs into a massively over inflated meme coin that has no long term prospects due to an infinite marker cap or announcing that his company has bought thousands of bitcoins AFTER buying them to pump the price further for his own gain. His actions are both irresponsible and dare I say it outright illegal.</p>\n\n<p>On top of this he is now taking advantage of NFTs with some idiot offering $1mill+ for a tweet.</p>\n\n<p>If Elon wants to invest in bitcoin thats great but the way he acts and manipulates the market is no better than those shitty pump and dump telegram channels.</p>\n\n<p>Edit - the downvoters are easily startled, but they will soon be back. And in greater numbers </p>\n\n<p>I did not expect this much controversy on a post!</p>\n\n<p>Edit 2 - corrected some miss information (my bad)</p>\n</div><!-- SC_ON -->",
  "score": 3263,
  "permalink": "/r/CryptoCurrency/comments/m7p3ov/fuck_elon_musk_his_market_manipulationnft_bullshit/",
  "subreddit": "CryptoCurrency",
  "id": "m7p3ov",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815278
}