{
  "author": "YouAreAPyrate",
  "the_new_excerpt": "Buried in the 10-K that Gamestop released today, under ITEM 9B Other Information\n[https://news.gamestop.com/node/18661/html#i3ad65c8584a445ee94e4314f67ce616c_109]\nare additional upcoming changes to who will stand for reelection to the board in\nJune:\n\n> Reference is made to the Current Report on Form…",
  "original_created_utc": 1616539418,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "埋在Gamestop今天发布的10-K中的第9B项其他信息下。\n[https://news.gamestop.com/node/18661/html#i3ad65c8584a445ee94e4314f67ce616c_109]\n哪些人将参加董事会的连任，即将有更多的变化。\n6月。\n\n> 参考本报告中的表格... ...",
      "title": "GME：4名额外的董事会成员预计将于6月离开。可能会有更多的高级管理人员变动。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "埋在Gamestop今天發佈的10-K中的第9B項其他信息下。\n[https://news.gamestop.com/node/18661/html#i3ad65c8584a445ee94e4314f67ce616c_109]\n哪些人將參加董事會的連任，即將有更多的變化。\n6月。\n\n> 參考本報告中的表格... ...",
      "title": "GME：4名額外的董事會成員預計將於6月離開。可能會有更多的高級管理人員變動。"
    }
  ],
  "title": "GME: 4 Additional Board Members Expected to leave in June. Possible additional changes to senior executives.",
  "created_utc": 1616556568,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://news.gamestop.com/node/18661/html#i3ad65c8584a445ee94e4314f67ce616c_109\">Buried in the 10-K that Gamestop released today, under ITEM 9B Other Information</a> are additional upcoming changes to who will stand for reelection to the board in June:</p>\n\n<blockquote>\n<p>Reference is made to the Current Report on Form 8-K that we filed with the SEC on January 11, 2021 that disclosed that on January 10, 2021, we entered into an agreement (the “Agreement”) with RC Ventures LLC and Ryan Cohen. This Form 8-K also disclosed that, pursuant to the Agreement, we agreed that effective at our 2021 annual meeting of stockholders (the “2021 Annual Meeting”), the size of the Board would be reduced from the current 13 directors to nine directors and that the Board would nominate for election the individuals identified in the Form 8-K for election as directors at the 2021 Annual Meeting. <strong>As of the date of this Form 10-K, the Board has not determined the definitive slate of nominees but currently expects that the following incumbent directors will retire from the Board at the 2021 Annual Meeting: Lizabeth Dunn, Paul Evans, Raul J. Fernandez, Reginald Fils-Aimé, William Simon, James K. Symancyk, Carrie W. Teffner and Kathy P. Vrabeck.</strong> The contemplated retirements are not because of a disagreement with us on any matter relating to our operations, policies or practices.</p>\n</blockquote>\n\n<p><strong>This change would leave only George Sherman and Kurt Wolf remaining from who was on the board prior to the deal with RC Ventures.</strong></p>\n\n<p><em>This indicates four more board members than previously announced are planning on leaving. Additionally, a little further down there is a caveat under the description of the formation of the Strategic Committee that indicates additional senior executive changes may be in the cards:</em></p>\n\n<blockquote>\n<p>Our Board of Directors has formed a committee of directors called the “Strategic Planning and Capital Allocation Committee” (the Strategic Committee). The Committee is responsible for assisting the Board in its oversight of our operational objectives and corporate strategy, capital allocation priorities and other opportunities for maximizing stockholder value. Our Board, through the Strategic Committee, is currently evaluating our executive leadership team skill sets related to meeting changing business requirements and has engaged a third party firm to assist it in its evaluation and exploration. <strong>This evaluation and exploration could result in a change in one or more of our senior executives.</strong></p>\n</blockquote>\n\n<hr/>\n\n<p><code>Updated since some incorrectly believe this is old news</code></p>\n\n<p>Here is the <a href=\"https://news.gamestop.com/node/18396/html\">original section of the 8K filed for the agreement with RC Ventures Jan 11</a> that shows the four additional names listed as leaving today were at that time expected to stand for re-election:</p>\n\n<blockquote>\n<p>Pursuant to the Agreement, the Company has agreed to increase the size of its board of directors (the “Board”) by three directors to a total of 13 directors and appoint Alain (Alan) Attal, Ryan Cohen and James (Jim) Grube (the “New Directors”) as members of the Board, each with a term expiring at the Company’s 2021 annual meeting of stockholders (the “2021 Annual Meeting”). The Company has further agreed that, effective at the 2021 Annual Meeting, the size of the Board will be reduced by four directors to a total of nine directors. The Board will nominate each of the New Directors (or their replacements appointed in accordance with the terms of the Agreement) and <strong>current directors Paul Evans, Reginald Fils-Aimé, George Sherman, William Simon, Carrie Teffner and Kurt Wolf for election as directors at the 2021 Annual Meeting.</strong></p>\n</blockquote>\n\n<hr/>\n\n<p>Edit 2:\nJust spotted another minor change from the same section of the 10-K:</p>\n\n<p>The previous CFO is out as of tomorrow, not the 26th, with the previously mentioned interim CFO picking up his duties until a replacement is announced. Not really new info, just moved the timeframe up 2 days. I wonder if this means there will be a new CFO announcement sooner because his end date moved up, or if it means they are still searching and the interim will be in place for a while.</p>\n\n<blockquote>\n<p>Mr. Bell’s cessation as our Chief Financial Officer and Ms. Saadeh-Jajeh’s assumption of the role of interim Chief Financial Officer will occur on March 24, 2021</p>\n</blockquote>\n</div><!-- SC_ON -->",
  "score": 3999,
  "permalink": "/r/wallstreetbets/comments/mbqxm9/gme_4_additional_board_members_expected_to_leave/",
  "subreddit": "wallstreetbets",
  "id": "mbqxm9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752832262
}