{
  "author": "99Thebigdady",
  "the_new_excerpt": "I strongly believe that most who were in the crypto space in 2017 don't feel\nlike we are in the same boat right now as we were in late 2017.\n\nI see many newcomers who haven't had the opportunity to see what the last bull\nrun felt like on forums. Do you guys want to know? Simply head straight…",
  "original_created_utc": 1613146969,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我坚信，2017年在加密领域的大多数人都没有感觉到\n就像我们现在和2017年底一样。\n\n我看到很多新人还没来得及看上一波牛市的机会\n跑感觉像在论坛上。你们想知道吗？干脆直接头...",
      "title": "对任何认为我们达到了顶峰的人来说，这并不像是2017年12月，但"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我堅信，2017年在加密領域的大多數人都沒有感覺到\n就像我們現在和2017年底一樣。\n\n我看到很多新人還沒來得及看上一波牛市的機會\n跑感覺像在論壇上。你們想知道嗎？乾脆直接頭...",
      "title": "對任何認爲我們達到了頂峯的人來說，這並不像是2017年12月，但"
    }
  ],
  "title": "To anyone who thinks we reached the top, it doesn't feel like december 2017, yet",
  "created_utc": 1613169628,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I strongly believe that most who were in the crypto space in 2017 don&#39;t feel like we are in the same boat <strong><em>right now</em></strong> as we were in late 2017.</p>\n\n<p>I see many newcomers who haven&#39;t had the opportunity to see what the last bull run felt like on forums. Do you guys want to know? Simply head straight to <a href=\"/r/dogecoin\">r/dogecoin</a> .</p>\n\n<p>This is what mania looks/feel like. When 90% of the top 100 coins are surrounded by hype just like DOGE is, this is when you should see big red flags.</p>\n\n<p>People are blinded by gains. All you see are price prediction posts. A bunch get scared when their coin goes sideways for 1-2 days, or when it has a 5% dip. People claim their altcoins is better than an other one simply because it had better returns. Nobody is actually doing research, all you can see is  hype, emotions and dollar signs. </p>\n\n<p>Get ready because once &quot;dogecoins investors&quot; will get bored, they will flock to other altcoins. The bull run as just started, don&#39;t fall into the hype/fomo trains. Do your own research, invest in coins you actually believe in and don&#39;t be scared to DCA out if you are in profit!!</p>\n\n<p>Once this subreddit reaches <a href=\"/r/dogecoin\">r/dogecoin</a> trashlevel of posting, bet I will be cashing out my altcoins.</p>\n</div><!-- SC_ON -->",
  "score": 284,
  "permalink": "/r/CryptoCurrency/comments/lieg19/to_anyone_who_thinks_we_reached_the_top_it_doesnt/",
  "subreddit": "CryptoCurrency",
  "id": "lieg19",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728615778
}