{
  "author": "roberthonker",
  "the_new_excerpt": "It is amazing to me that a country can pull the same stunt three times, and have\nit work every single time. China has \"banned\" crypto in different ways three\nseparate times. In 2013, 2017 and now in 2021. They are doing this in order to\nmanipulate prices downwards, for better buy in prices for…",
  "original_created_utc": 1621651995,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "驚くべきことに、ある国は同じことを3回繰り返し、その度に成功している。\n毎回うまくいくなんて。中国は、3回にわたってさまざまな方法で暗号を「禁止」しています。\nしています。2013年、2017年、そして今回の2021年です。これは次のような目的で行われています。\n価格を下方に操作して、より良い買い付け価格を...",
      "title": "中国が暗号を \"取り締まる \"のはこれで3回目です。中国が実際に行っているのは、市場を操作して低価格で購入することです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我感到惊讶的是，一个国家可以三次使用同样的噱头，而且每次都能成功。\n它每次都能成功。中国已经三次以不同方式 \"禁止 \"加密货币。\n不同的时间。在2013年、2017年和现在的2021年。他们这样做的目的是为了\n操纵价格向下，以获得更好的买入价格，为...",
      "title": "这是中国第三次 \"打压 \"加密货币。他们真正在做的是操纵市场，以较低的价格购买。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我感到驚訝的是，一個國家可以三次使用同樣的噱頭，而且每次都能成功。\n它每次都能成功。中國已經三次以不同方式 \"禁止 \"加密貨幣。\n不同的時間。在2013年、2017年和現在的2021年。他們這樣做的目的是爲了\n操縱價格向下，以獲得更好的買入價格，爲...",
      "title": "這是中國第三次 \"打壓 \"加密貨幣。他們真正在做的是操縱市場，以較低的價格購買。"
    }
  ],
  "title": "This is the THIRD time that china has \"cracked down\" on crypto. What they are really doing is manipulating the market to buy at lower prices.",
  "created_utc": 1621665273,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It is amazing to me that a country can pull the same stunt three times, and have it work every single time. China has &quot;banned&quot; crypto in different ways three separate times. In 2013, 2017 and now in 2021. They are doing this in order to manipulate prices downwards, for better buy in prices for themselves. </p>\n\n<p><strong>If china really wanted to ban crypto they would have done so already. They have a massive vested interest due to their bitcoin miners, all they are doing right now is manipulating the price for a better entry point.</strong></p>\n</div><!-- SC_ON -->",
  "score": 2551,
  "permalink": "/r/CryptoCurrency/comments/ni95h0/this_is_the_third_time_that_china_has_cracked/",
  "subreddit": "CryptoCurrency",
  "id": "ni95h0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197383349
}