{
  "author": "TryingToMakeAMil",
  "the_new_excerpt": "First one you enter too late. You probably heard about people making crazy\nreturns on the news or from some of your friends.\n\nSecond one you’re still greedy and inexperienced. Probably take profits too\nearly or wait till it’s too late, don’t know how to recognise a top.\n\nThird one you already enter…",
  "original_created_utc": 1624208428,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1枚目のエントリーが遅すぎる あなたは、ニュースや友人の話を聞いたことがあるでしょう。\nニュースや友人から聞いたことがあると思います。\n\n2つ目は、まだ欲張りで経験が浅いことです。おそらく、利益を得るのが早すぎたり\n手遅れになるまで待っていたり、トップを見極める方法を知らなかったりします。\n\n3つ目は、すでにエントリーしている場合です...。",
      "title": "金持ちになるには最低3回の強気相場が必要"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "第一个你进入得太晚了。你可能在新闻中或从你的朋友那里听说过一些人赚取疯狂的\n你可能在新闻中或从你的一些朋友那里听说了人们疯狂的回报。\n\n第二种，你仍然贪婪，没有经验。可能会过早获利\n或等到太晚，不知道如何识别顶部。\n\n第三种，你已经进入...",
      "title": "你至少需要3个牛市才能致富"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第一個你進入得太晚了。你可能在新聞中或從你的朋友那裏聽說過一些人賺取瘋狂的\n你可能在新聞中或從你的一些朋友那裏聽說了人們瘋狂的回報。\n\n第二種，你仍然貪婪，沒有經驗。可能會過早獲利\n或等到太晚，不知道如何識別頂部。\n\n第三種，你已經進入...",
      "title": "你至少需要3個牛市才能致富"
    }
  ],
  "title": "You need at least 3 bull markets to get rich",
  "created_utc": 1624217789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First one you enter too late. You probably heard about people making crazy returns on the news or from some of your friends. </p>\n\n<p>Second one you’re still greedy and inexperienced. Probably take profits too early or wait till it’s too late, don’t know how to recognise a top. </p>\n\n<p>Third one you already enter with loaded bags and take healthy profits along the way. You realise when the market is cooling off and exit accordingly.</p>\n\n<p>Experience matters guys.</p>\n</div><!-- SC_ON -->",
  "score": 435,
  "permalink": "/r/CryptoCurrency/comments/o4a0am/you_need_at_least_3_bull_markets_to_get_rich/",
  "subreddit": "CryptoCurrency",
  "id": "o4a0am",
  "is_self": true,
  "media": null,
  "is_video": false
}