{
  "author": "mauro_telles",
  "original_created_utc": 1628354715,
  "title": "As an Argentinian fighting crippling inflation everyday... Thank you, for everything.",
  "created_utc": 1628375442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As you probably already know, my country has a never-ending problem with inflation, I know it is not the worst out there, yet it is pretty frustrating. </p>\n\n<p>Never can I purchase anything I want without consulting prices everyday (since they fluctuate immensely), never can I save money in my fiat currency, and never can I just relax when it comes to the overall economy and ever increasing regulations to prevent us from (at least) conserving our purchasing power.</p>\n\n<p>Crypto has been an escape, of course I love the tech behind it all, but never should I negate that it brought an overall sense of tranquillity. I trust crypto even more than I trust the Argentinian peso. </p>\n\n<p>I am 21 years old, and ever since I got into crypto I have been reading this sub, and let me tell you that all the information that you shared has been a stepping stone for my investing decisions. </p>\n\n<p>Of course I do my DD, yet it would not be the same without your useful posts and bits of knowledge.</p>\n\n<p>I know this is not a technical post, I admit I do not know a whole lot like many of you posters of the subreddit, yet at least I wanted to ensure my respects and gratitude do not go unnoticed.</p>\n\n<p>From South America, I salute you all users who are reading this, and thank you for being here for all the people. Thank you for the daily contributions, for everything.</p>\n</div><!-- SC_ON -->",
  "score": 177,
  "permalink": "/r/CryptoCurrency/comments/ozwpno/as_an_argentinian_fighting_crippling_inflation/",
  "subreddit": "CryptoCurrency",
  "id": "ozwpno",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As you probably already know, my country has a never-ending problem with\ninflation, I know it is not the worst out there, yet it is pretty frustrating.\n\nNever can I purchase anything I want without consulting prices everyday (since\nthey fluctuate immensely), never can I save money in my fiat…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんもご存知のように、私の国には終わりのないインフレの問題があります。\nインフレの問題を抱えています。最悪の状況ではないことはわかっていますが、かなり苛立たしいです。\n\n欲しいものがあっても、毎日価格を調べないと買えないし（変動が激しいので\n欲しいものがあっても、毎日価格を調べないと買えないし（変動が激しいので）、フィアットでお金を貯めることもできません...",
      "title": "アルゼンチン人として、日々、深刻なインフレと戦いながら...。ありがとう、すべてに。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你可能已经知道，我国有一个无休止的问题，那就是通货膨胀。\n通货膨胀，我知道这并不是最糟糕的，但这是很令人沮丧的。\n\n我从来没有想过要购买任何我想要的东西而不需要每天咨询价格（因为价格波动很大）。\n因为它们波动很大），我永远不能在我的法币中存钱。",
      "title": "作为一个阿根廷人，每天都在与残缺的通货膨胀作斗争...... 谢谢你，谢谢你所做的一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能已經知道，我國有一個無休止的問題，那就是通貨膨脹。\n通貨膨脹，我知道這並不是最糟糕的，但這是很令人沮喪的。\n\n我從來沒有想過要購買任何我想要的東西而不需要每天諮詢價格（因爲價格波動很大）。\n因爲它們波動很大），我永遠不能在我的法幣中存錢。",
      "title": "作爲一個阿根廷人，每天都在與殘缺的通貨膨脹作鬥爭...... 謝謝你，謝謝你所做的一切。"
    }
  ]
}