{
  "author": "MasterBigBean",
  "original_created_utc": 1628898602,
  "title": "Is it unnatural or weird that I (25 M) have to have genuine feeings for a woman in order to be interested in having intercourse?",
  "created_utc": 1628950743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last night this girl I’ve been on a few dates with brought me into her apartment and I got the sense that she wanted to have sex. I started making out with her because I felt like I owed her at least that, but I didn’t feel like taking it any further. I just told her that I don’t want to move too fast, but really I just had no desire to have sex because I didn’t feel like we had a strong enough connection. </p>\n\n<p>Looking back I’ve realized that most times I’ve had sex have been because i was either in a relationship/had known the girl for a long time, or because she came on to me. Once I get into the act I usually become interested, but that would require some serious advances on the lady’s part to get to that point (which I’m sure you understand is a rarity). I feel like all of the men I’ve ever met just like having sex for the fun of it, so it worries me that I might just be a very abnormal individual.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/p3x5u8/is_it_unnatural_or_weird_that_i_25_m_have_to_have/",
  "subreddit": "TooAfraidToAsk",
  "id": "p3x5u8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Last night this girl I’ve been on a few dates with brought me into her apartment\nand I got the sense that she wanted to have sex. I started making out with her\nbecause I felt like I owed her at least that, but I didn’t feel like taking it\nany further. I just told her that I don’t want to move too…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨晩、何度かデートしたことのある女の子が、自分のアパートに連れてきてくれました。\n彼女はセックスをしたがっているように感じました。僕は彼女とイチャイチャし始めた。\nせめてそれだけでもと思い、彼女とイチャイチャし始めましたが、それ以上の気持ちには\nそれ以上はしたくなかった。ただ、彼女には「あまり動きたくない」と言ってしまいました...。",
      "title": "私（25歳M）が女性に純粋な感情を抱かなければ、性交に興味を持てないというのは不自然で奇妙なことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨晚，这个和我约会过几次的女孩把我带到了她的公寓里\n我感觉到她想做爱。我开始和她亲热\n因为我觉得我至少欠她一个人情，但我并不觉得有什么不妥。\n任何进一步的发展。我只是告诉她，我不想搬到太...",
      "title": "我（25岁）必须对一个女人产生真正的感情，才有兴趣进行性交，这是不是很不自然或奇怪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨晚，這個和我約會過幾次的女孩把我帶到了她的公寓裏\n我感覺到她想做愛。我開始和她親熱\n因爲我覺得我至少欠她一個人情，但我並不覺得有什麼不妥。\n任何進一步的發展。我只是告訴她，我不想搬到太...",
      "title": "我（25歲）必須對一個女人產生真正的感情，纔有興趣進行性交，這是不是很不自然或奇怪？"
    }
  ]
}