{
  "author": "LWOS101",
  "original_created_utc": 1633055780,
  "title": "Where did all the Solana supporters go?",
  "created_utc": 1633088026,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Feel as though the support fell off a cliff went from about a hundred to zero. Funny how quickly people lose interest. Also how fast this subreddits sentiment changes one moment you are getting downvoted about trying to point out the problems with Solana then the next you are being upvoted. Just goes to show most people have no idea what they are doing and will just bandwagon with the current popular sentiment. </p>\n\n<p>Also how far people on this subreddit will go to protect their precious coins that can never be criticised. I had multiple Solana lovers follow my comments downvoting them or replying to the comments with me stating the fact that Solana has gone down in the past before and it’s only a matter of time again. Even after the recent outage it had they would follow me saying I was spreading misinformation about it going down in the past even though I was citing sources from Solana themselves. But at that point the subreddit sentiment had begun to change and they were being downvoted now and their precious egos couldn’t handle it and they deleted all their comments. </p>\n\n<p>A lot of people on this subreddit treat their investments like sports teams and they cannot handle any criticisms to their coins. Hence why you shouldn’t listen to what is trending here, any criticism will be downvoted and only the positives will be upvoted. Always do your own research.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/pyyr1m/where_did_all_the_solana_supporters_go/",
  "subreddit": "CryptoCurrency",
  "id": "pyyr1m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Feel as though the support fell off a cliff went from about a hundred to zero.\nFunny how quickly people lose interest. Also how fast this subreddits sentiment\nchanges one moment you are getting downvoted about trying to point out the\nproblems with Solana then the next you are being upvoted. Just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "支持率が100％から0％になってしまったような気がします。\n人の興味がなくなるのは早いものです。また、このサブレディットのセンチメントの速さは\nまた、このサブレディットの感情の変化の速さにも驚かされます。\n次の瞬間、あなたはupvotedされます。ただ...",
      "title": "ソラナ支持者はどこへ行った？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "感觉好像支持率从悬崖上掉了下来，从大约一百人变成了零。\n有趣的是，人们失去兴趣的速度有多快。还有，这个分论坛的情绪变化有多快？\n变化之快，前一刻你还在为试图指出索拉纳的问题而被降权。\n索拉纳的问题，然后下一秒你就得到了高票。只是...",
      "title": "索拉纳的支持者们都去哪儿了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "感覺好像支持率從懸崖上掉了下來，從大約一百人變成了零。\n有趣的是，人們失去興趣的速度有多快。還有，這個分論壇的情緒變化有多快？\n變化之快，前一刻你還在爲試圖指出索拉納的問題而被降權。\n索拉納的問題，然後下一秒你就得到了高票。只是...",
      "title": "索拉納的支持者們都去哪兒了？"
    }
  ]
}