{
  "author": "pedophiliaisbad",
  "original_created_utc": 1656250130,
  "title": "Am I a pedophile?",
  "created_utc": 1656260261,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;OK, I know it sounds bad but please hear me out first.&lt;/p&gt;\n\n&lt;p&gt;I, 17F, have never searched for cp, nor will I ever. I cannot recall a single instance in which I&amp;#39;ve looked at a child in my life in a sexual light, and the idea of real children being abused and used sexually makes me sick to my stomach. Even if I turn out to be a pedophile, I would rather cut off my own limbs than act on any urges.&lt;/p&gt;\n\n&lt;p&gt;It started 2 or so years ago, when I started reading fanfic recreationally, and got into that whole scene. I primarily use ao3, and for the most part, I stuck to extremely PG rated fics. But obv, it didn&amp;#39;t stay that way for long, and eventually i started dipping my feet in the more graphic fics and it turned out that I didn&amp;#39;t hate them. That wasn&amp;#39;t the issue. Then, somehow, things got worse and worse and I started being alright with even the most depraved fics. Things spiraled, and kept going on until I stumbled onto one depicting csa. I was obviously disgusted, but curiosity killed the cat and all, so I read it.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t remember what fic it was, but it depicted a child being raped, cause I&amp;#39;m not going to sugarcoat it and say they had sex. The child was &lt;em&gt;very&lt;/em&gt; underage, and was being molested by an adult in its life, and it was being abused and degraded.&lt;/p&gt;\n\n&lt;p&gt;By the end of it, I was more turned on than I&amp;#39;ve ever been in my life. Underwear soaked through and all. Even through my arousal, I was massively disgusted with myself. I was feeling post-nut clarity before I even came. I&amp;#39;d been turned on before, but nothing of this magnitude. I clicked away, repulsed by myself and the fic, and resolved never to fall into such a black hole again. And I kept my promise for a very long time. But the horny monster reared its head one day when i couldn&amp;#39;t find anything interesting enough to get off to, and I didn&amp;#39;t have the willpower to stop myself from searching up similar fics. The massive imbalance of power, the adults taking advantage of vulnerable and young children, bondage and slavery, these all seemed to rev up my cylinders in a way nothing else did.&lt;/p&gt;\n\n&lt;p&gt;I can usually get off to normal stuff, but every couple of weeks or so, and my horniness overpowers my willpower and I do it again. I&amp;#39;m always hit by a strong sense of self-hatred afterwards, and the knowledge that I might be a pedophile has been haunting me for a terrifyingly long time. It rattles around my head at night when I can&amp;#39;t sleep and I genuinely have no idea where to go or who to ask for help. I would never act on any urges if I have them, but the thing is.........I&amp;#39;ve always wanted kids of my own. Like a big family, 3 or 4 kids, white picket fence, the whole schtick. I&amp;#39;m starting to have doubts about whether it&amp;#39;s a good idea or not, now that I&amp;#39;m almost an adult and I still haven&amp;#39;t outgrown these urges and feelings.&lt;/p&gt;\n\n&lt;p&gt;The thing that bothers me the most is, I&amp;#39;m still not fully sure if I&amp;#39;m a pedophile. Cause I&amp;#39;ve thought of many many instances in my childhood and growing up, and recently too, when i was in contact with children younger than me, and I&amp;#39;ve never felt anything remotely sexual towards them. Mostly its just a sense of.....meh. The youngest person I had a crush on was when I was in the 9th grade and I liked a kid in the 8th grade. Other than that, nada. Nothing.&lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;m asking for help, cause I don&amp;#39;t really know where else to go. I am, frankly, terrified. Of myself, of what I might do if push came to shove, of others and how they would react if they ever found out. I just don&amp;#39;t understand what&amp;#39;s wrong with me, and how to fix myself. If there is anyone out there with resources or a some qualifications in dealing with these sort of situations, I implore you to help me figure out what I can do and how I can fix this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/TooAfraidToAsk/comments/vl4r4w/am_i_a_pedophile/",
  "subreddit": "TooAfraidToAsk",
  "id": "vl4r4w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "OK, I know it sounds bad but please hear me out first.\n\nI, 17F, have never searched for cp, nor will I ever. I cannot recall a single\ninstance in which I've looked at a child in my life in a sexual light, and the\nidea of real children being abused and used sexually makes me sick to my\nstomach. Even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OK、悪いようですが、まずは私の話を聞いてください。\n\n私、17Fはcpを検索したことがありませんし、これからも検索することはありません。また、これからもそうでしょう。\n自分の人生の中で、子供を性的な目で見たことは一度もありません。\n現実の子供が虐待され、性的に利用されていると思うと、胸が悪くなります。\n胃が痛くなる たとえ...",
      "title": "私は小児性愛者なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我知道这听起来很糟糕，但请先听我说完。\n\n我，17岁，从来没有搜索过cp，以后也不会。我想不起有哪一次\n我想不起来有哪一次我以性的眼光看待我生活中的孩子，而且一想到真实的孩子被虐待和性利用，我就觉得很不舒服。\n想到真正的儿童被虐待和性利用，我就感到恶心。\n胃。甚至...",
      "title": "我是个恋童癖吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我知道這聽起來很糟糕，但請先聽我說完。\n\n我，17歲，從來沒有搜索過cp，以後也不會。我想不起有哪一次\n我想不起來有哪一次我以性的眼光看待我生活中的孩子，而且一想到真實的孩子被虐待和性利用，我就覺得很不舒服。\n想到真正的兒童被虐待和性利用，我就感到噁心。\n胃。甚至...",
      "title": "我是個戀童癖嗎？"
    }
  ]
}