{
  "author": "OwenZHunt",
  "the_new_excerpt": "I’ve seen many posts (especially on wsb) over the past few days suggesting that\nshorts need ALL of our retail shares to cover their positions (as interest\nis/was over 100%) and so we just have to be patient, wait and hold. With the\nrecent influx of new investors, I just wanted to share why this is…",
  "original_created_utc": 1612649100,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这几天我看到很多帖子（尤其是在wsb上）都在说\n空头需要我们所有的散户股来补仓（因为利息的问题）。\n是/是超过100%的），所以我们只能耐心等待和持有。随着\n最近新的投资者大量涌入，我只是想分享一下为什么这... ...",
      "title": "鉴于GME的诡计，空头兴趣浓厚"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這幾天我看到很多帖子（尤其是在wsb上）都在說\n空頭需要我們所有的散戶股來補倉（因爲利息的問題）。\n是/是超過100%的），所以我們只能耐心等待和持有。隨着\n最近新的投資者大量湧入，我只是想分享一下爲什麼這... ...",
      "title": "鑑於GME的詭計，空頭興趣濃厚"
    }
  ],
  "title": "Short interest in light of GME shenanigans",
  "created_utc": 1612681486,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve seen many posts (especially on wsb) over the past few days suggesting that shorts need ALL of our retail shares to cover their positions (as interest is/was over 100%) and so we just have to be patient, wait and hold. With the recent influx of new investors, I just wanted to share why this is not necessarily true. Many of us jumped into this believing the word of others who themselves did not <em>really</em> understand shorting, and whilst the &#39;hold to moon&#39; sentiment is encouraging confirmation bias, it may be misleading.  That being said, there&#39;s always a chance of a short squeeze when interest is so high.</p>\n\n<p>Firstly, I fully support the GME movement and shedding light on corrupt hedge fund practices, but if you buy GME/AMC or anything similar in the future, do it with the intention of supporting a movement, not as an investment.</p>\n\n<p>Now, the nitty gritty:</p>\n\n<p>We know that &lt;100% of shares were able to yield ~150% shorts in the first place. This means that <strong>&lt;100% of the shares are required to reduce the shorts from 150% back to 0%.</strong> i.e. the hedge funds don&#39;t necessarily need your 1.5 shares.</p>\n\n<p>How does this work?</p>\n\n<p>Oversimplified example:</p>\n\n<p>A lends 1 share to B -&gt; B sells to C -&gt; C lends to D -&gt; D sells to E</p>\n\n<p>Only 1 share exists in this scenario but it has been shorted 2 times, thus on paper, there would seem to be 200% short interest. However, only 1 single share is needed to be returned back through the line to satisfy all positions.</p>\n\n<p>Possible explanation two:</p>\n\n<p>A lends 10 shares to C -&gt; C sells 1 share each to 10 different monkeys.</p>\n\n<p>C now needs to buy back the shares. 9 monkeys hold but 1 monkey sells the share back at a small profit.</p>\n\n<p>C returns 1 share back to L -&gt; L sells that 1 share to C -&gt; C returns that 1 share back to L again x9. C has &#39;returned&#39; a total of 10 shares, even though only 1 share was used.</p>\n\n<p>Of course, I doubt its quite as simple in the real world but the basic sentiment still holds true; &lt;100% total shares are needed to close out 150%+ short positions. Combine this with some market manipulation and hedge funds are easily able to cover without all our diamond handed shares. The unfortunate truth is that once shady things start happening at the top, we&#39;ve probably lost.</p>\n\n<p>Disclaimer: I&#39;m no financial advisor, so take this with a grain of salt. Heck, the only letters of the alphabet I could read until this week were G, M, and E.</p>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/le81em/short_interest_in_light_of_gme_shenanigans/",
  "subreddit": "stocks",
  "id": "le81em",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203579
}