{
  "author": "Lou_4_you",
  "original_created_utc": 1659818993,
  "title": "Where do you find sex partners...?",
  "created_utc": 1659876957,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I, 19 F, am genuinely wondering where everyone finds people to have sex with, both in the sense of relationships as well as one night stands. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not the most attractive girl out there at all, but I don&amp;#39;t think I&amp;#39;m ugly either. I&amp;#39;ve never been in a situation where sex was even near to be considered, and it&amp;#39;s not that I can&amp;#39;t read the room, I just seemingly never end up in that kind of situations. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m a virgin, never had any relationship either, and honestly very ready to have sex, but like, where do people find others to have sex with?&lt;/p&gt;\n\n&lt;p&gt;Do you go to parties and take people home? What do you do? Am I just having too high of a standard? Am I just greatly unattractive without knowing? &lt;/p&gt;\n\n&lt;p&gt;Help a girl out, I guess I just don&amp;#39;t know shit about the world :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/whxwlu/where_do_you_find_sex_partners/",
  "subreddit": "TooAfraidToAsk",
  "id": "whxwlu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I, 19 F, am genuinely wondering where everyone finds people to have sex with,\nboth in the sense of relationships as well as one night stands.\n\nI'm not the most attractive girl out there at all, but I don't think I'm ugly\neither. I've never been in a situation where sex was even near to be…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（19歳・女性）は純粋に、みんなどこでセックスする相手を見つけているんだろうと思っています。\nを見つけることができるのでしょうか？\n\n私はそこに最も魅力的な女の子ではありませんが、私は醜いとは思いません。\nでも、醜いとも思わない。私はセックスがあっても近くにあったという状況にあったことがない...",
      "title": "セックスフレンドはどこで見つけるの...？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我，19岁的F，真的很想知道每个人在哪里找到可以做爱的人。\n既有关系，也有一夜情。\n\n我不是最吸引人的女孩，但我不认为我是丑陋的。\n也不丑。我从来没有在一个情况下，性生活甚至接近是......",
      "title": "你在哪里找到性伙伴......？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我，19歲的F，真的很想知道每個人在哪裏找到可以做愛的人。\n既有關係，也有一夜情。\n\n我不是最吸引人的女孩，但我不認爲我是醜陋的。\n也不醜。我從來沒有在一個情況下，性生活甚至接近是......",
      "title": "你在哪裏找到性夥伴......？"
    }
  ]
}