{
  "author": "kautzmanskate",
  "original_created_utc": 1655486326,
  "title": "Call me crazy but I think this is the most exciting time In crypto",
  "created_utc": 1655521350,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It’s been turning more and more heads, banks have been catching on, etfs are a thing here in Canada, there’s only going to be more of them. &lt;/p&gt;\n\n&lt;p&gt;Companies and countries adding bitcoin to their balance sheets. We may be entering a recession, but for every recession is a boom. &lt;/p&gt;\n\n&lt;p&gt;There’s a bitcoin halving early 2024 and that will be here quicker than you think. Everything’s discounted, and there’s a chance these next 6 months could be the lowest prices we see again. &lt;/p&gt;\n\n&lt;p&gt;Take advantage. Bull markets make you money but bear markets make you rich &lt;/p&gt;\n\n&lt;p&gt;Sorry for formatting, I’m on mobile and don’t really know how this works&lt;/p&gt;\n\n&lt;p&gt;Edit:i apparently have to specify im no pro , speaking from the lens of my 2 years experience in the space and the history I can look back at&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 364,
  "permalink": "/r/CryptoCurrency/comments/vel3wv/call_me_crazy_but_i_think_this_is_the_most/",
  "subreddit": "CryptoCurrency",
  "id": "vel3wv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It’s been turning more and more heads, banks have been catching on, etfs are a\nthing here in Canada, there’s only going to be more of them.\n\nCompanies and countries adding bitcoin to their balance sheets. We may be\nentering a recession, but for every recession is a boom.\n\nThere’s a bitcoin halving…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ますます頭角を現し、銀行もそれに乗り出し、ETFは\nカナダでは、ETFが普及しており、今後さらに増えていくでしょう。\n\n企業や国は、バランスシートにビットコインを追加しています。我々は不況に入るかもしれません。\n不景気かもしれませんが、不景気にはブームがつきものです。\n\nビットコインの半減期がある...",
      "title": "クレイジーと言われようが、暗号の世界では今が一番エキサイティングな時期だと思う。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "越来越多的人开始关注这个问题，银行也开始关注这个问题，ETF在加拿大已经成为一种趋势。\n在加拿大，etfs是一种东西，它们只会越来越多。\n\n公司和国家将比特币加入他们的资产负债表。我们可能会\n我们可能会进入经济衰退期，但是每一个衰退期都是一个繁荣期。\n\n有一个比特币减半的...",
      "title": "你可以说我疯了，但我认为这是加密货币中最令人兴奋的时刻。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "越來越多的人開始關注這個問題，銀行也開始關注這個問題，ETF在加拿大已經成爲一種趨勢。\n在加拿大，etfs是一種東西，它們只會越來越多。\n\n公司和國家將比特幣加入他們的資產負債表。我們可能會\n我們可能會進入經濟衰退期，但是每一個衰退期都是一個繁榮期。\n\n有一個比特幣減半的...",
      "title": "你可以說我瘋了，但我認爲這是加密貨幣中最令人興奮的時刻。"
    }
  ]
}