{
  "author": "Environmental_Point3",
  "original_created_utc": 1640782509,
  "title": "Leverage Trading Isn't That Bad If You Understand And Use It Correctly",
  "created_utc": 1640832713,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is a big misunderstanding that leverage trading is either a &amp;#39;I&amp;#39;m homeless now&amp;#39; or &amp;#39;I&amp;#39;m a billionaire now&amp;#39; tool, as opposed to being there to simply minimize risk with your trades. There is nothing wrong with using leverage, the issue we&amp;#39;ve seen is that your average Joe does not understand how to properly use it.&lt;/p&gt;\n\n&lt;p&gt;Rather than using it to lower exposure, people are using it maximize their capital. A dangerous game to play in crypto where we know prices can disappear in an instant. A good way to think of it is: &lt;em&gt;&amp;quot;If I have 10,000 USDT in my trading account, and I use 10x leverage, I can make a 10,000 dollar trade using only 1,000 dollars, keeping 90% completely safe and available should I wish to make more trades, or buy the beloved dip.&amp;quot;&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;The incorrect way to think of leverage trading is: &amp;quot;I have 10,000 dollars, if I use 10x leverage I can make it 100,000 dollars! Rinse and repeat, easy money!&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;&amp;quot;One does not simply YOLO their entire balance at 10x leverage.&amp;quot;&lt;/em&gt; - Gandalf, circa 1975.&lt;/p&gt;\n\n&lt;p&gt;At the end of the day, do what you want with your money - but please don&amp;#39;t ever over-invest. Always have money to pay the rent and have leftover for ramen. Merry Christmas and Happy New Year - here&amp;#39;s to a huge 2022 ahead.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/rr7kj2/leverage_trading_isnt_that_bad_if_you_understand/",
  "subreddit": "CryptoCurrency",
  "id": "rr7kj2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There is a big misunderstanding that leverage trading is either a 'I'm homeless\nnow' or 'I'm a billionaire now' tool, as opposed to being there to simply\nminimize risk with your trades. There is nothing wrong with using leverage, the\nissue we've seen is that your average Joe does not understand how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "レバレッジ取引は、「私はホームレスだ」という大きな誤解があります。\n今すぐ億万長者になる」ためのツールであって、「今すぐ億万長者になる」ためのものではありません。\nトレードのリスクを最小限に抑えることができます。レバレッジを使うことは悪いことではありません。\n私たちが見てきた問題は、平均的なジョーはどのように理解していない...",
      "title": "レバレッジ取引は、正しく理解し利用すれば、それほど悪いものではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一个很大的误解，认为杠杆交易要么是'我无家可归\n现在'或'我现在是亿万富翁'的工具，而不是简单地将你的交易风险降到最低。\n将你的交易风险降到最低。使用杠杆并无不妥，我们看到的问题是，你的交易风险是由你自己决定的。\n我们看到的问题是，你的普通人并不了解如何...",
      "title": "如果你理解并正确使用，杠杆交易并没有那么糟糕"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一個很大的誤解，認爲槓桿交易要麼是'我無家可歸\n現在'或'我現在是億萬富翁'的工具，而不是簡單地將你的交易風險降到最低。\n將你的交易風險降到最低。使用槓桿並無不妥，我們看到的問題是，你的交易風險是由你自己決定的。\n我們看到的問題是，你的普通人並不瞭解如何...",
      "title": "如果你理解並正確使用，槓桿交易並沒有那麼糟糕"
    }
  ]
}