{
  "author": "DoombotGW",
  "the_new_excerpt": "I don't have a lot of money hidden away. But until now, it's all been placed on\na savings account with no interest whatsoever. Not understanding how to even buy\nstocks or knowing how the market works made me too afraid to do anything about\nit. Until now!\n\nThese last couple of days got me really…",
  "original_created_utc": 1612034281,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我并没有藏多少钱。但到现在为止，都是放在...\n一个没有任何利息的储蓄账户。甚至不明白如何购买\n股票或知道市场是如何运作的，使我太害怕做任何事情的\n它。直到现在！\n\n这几天我真的...",
      "title": "GME让我对股市产生了兴趣。昨天，我第一次投资了我的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我並沒有藏多少錢。但到現在爲止，都是放在...\n一個沒有任何利息的儲蓄賬戶。甚至不明白如何購買\n股票或知道市場是如何運作的，使我太害怕做任何事情的\n它。直到現在！\n\n這幾天我真的...",
      "title": "GME讓我對股市產生了興趣。昨天，我第一次投資了我的錢。"
    }
  ],
  "title": "GME got me interested in the stock market. Yesterday I invested my money for the first time.",
  "created_utc": 1612047217,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t have a lot of money hidden away. But until now, it&#39;s all been placed on a savings account with no interest whatsoever. Not understanding how to even buy stocks or knowing how the market works made me too afraid to do anything about it. Until now!</p>\n\n<p>These last couple of days got me really interested in the stock market, so I decided to educate myself. I&#39;ve been reading and learning a lot and, even though I still know very little, I finally took the first baby steps towards investing my savings for the first time yesterday (a very small portion of it).</p>\n\n<p>I invested in two green funds and for fun I also bought one GME share. I understand I&#39;m likely to lose a bit of money off GME, but I&#39;m alright with that. It will have symbolic value as it was the stock that got me started. </p>\n\n<p>Anyway. I&#39;m glad I took this step. Next thing to do is to set up a monthly saving. I&#39;m a student, so it won&#39;t be much, but it will be better than nothing!</p>\n\n<p>Just wanted to share my happiness with you. :)</p>\n\n<p>(Any newbie-tips will be appreciated).</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/stocks/comments/l8t8oo/gme_got_me_interested_in_the_stock_market/",
  "subreddit": "stocks",
  "id": "l8t8oo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537980
}