{
  "author": "alphadroneimaging",
  "the_new_excerpt": "(I am not a financial adviser. This is not direct financial advice...but still\nadvice for dealing with investing.)\n\nI am completely floored by the amount of people who have NO BUSINESS\nindependently jumping into the stock market, diving into the deep end and not\nknowing how to swim.\n\n 1.  Never…",
  "original_created_utc": 1612342515,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "(我不是财务顾问。这不是直接的理财建议......但仍然是。\n应对投资的建议）。)\n\n我完全被那些没有BUSINESS的人的数量所震惊。\n独立跳入股市，跳入深渊，不\n懂得游泳。\n\n 1.  千万不要...",
      "title": "令人惊讶的是，有多少人一头扎进了没有业务的投资中。对于那些新手来说，一些基本的技巧。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "(我不是財務顧問。這不是直接的理財建議......但仍然是。\n應對投資的建議）。)\n\n我完全被那些沒有BUSINESS的人的數量所震驚。\n獨立跳入股市，跳入深淵，不\n懂得游泳。\n\n 1.  千萬不要...",
      "title": "令人驚訝的是，有多少人一頭扎進了沒有業務的投資中。對於那些新手來說，一些基本的技巧。"
    }
  ],
  "title": "It's amazing how many people jumped in headfirst that have no business investing. Some basic tips for those new to this world.",
  "created_utc": 1612361640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>(I am not a financial adviser.  This is not direct financial advice...but still advice for dealing with investing.)</p>\n\n<p>I am completely floored by the amount of people who have NO BUSINESS independently jumping into the stock market, diving into the deep end and not knowing how to swim.</p>\n\n<ol>\n<li><p>Never invest what you&#39;re not willing to lose.  Do not pump every dime to your name into an investment.  This is almost a surefire path to failure.  If you invest in a stock, or a fund, only do so if the money you&#39;re investing will not be detrimental or catastrophic to your existence if lost.</p></li>\n<li><p>If you&#39;re new to investing, get a broker while you also do your DD (due diligence) researching companies you&#39;re considering investing in.</p></li>\n<li><p>Learn market terms such as &quot;long&quot;, &quot;short&quot;, &quot;bullish&quot;, &quot;bearish&quot;, &quot;futures&quot;, etc.  And then learn the different ways to incorporate and utilize these terms.  That way you&#39;re not just limited to &quot;buying/selling&quot;.</p></li>\n<li><p>If you insist on doing it yourself, do not purchase stock in a company without researching the company.  Their executives, business model, earnings, stock trend for at least 2 years (if available), etc.</p></li>\n<li><p>Learn about moderate to high yield ETFs (Exchange-Traded Funds) and Index Funds.  Typically between 3-8% dividend yield is a great middle ground depending on the overall performance of the fund.</p></li>\n<li><p>This is one of the most important quotes, in my opinion, when it comes to investing:  &quot;If you&#39;re not willing to own a stock for at least 10 years, don&#39;t even think about owning it for 10 minutes.&quot; -Warren Buffett </p></li>\n<li><p>Learn the 4% rule!  Learn the 4% rule!!  Learn the 4% rule!!!</p></li>\n<li><p>Understand the formula for figuring out how much money you would need invested into annual return yield to account for your current annual income.  If you learn this, it will give you greater insight, a more clear, concise target, and a simpler goal.</p></li>\n<li><p>Find a mentor.  Trust me, you very likely know at least one person who is good with investing, and these people generally enjoy passing this knowledge on to others.  If you don&#39;t...FIND A BROKER!</p></li>\n<li><p>Do NOT jump on trends, fads, or bandwagons...you&#39;ll typically be left holding the bag because you didn&#39;t know any better, and you will simply watch those that did know make money and then bail.</p></li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 355,
  "permalink": "/r/stocks/comments/lbjgjw/its_amazing_how_many_people_jumped_in_headfirst/",
  "subreddit": "stocks",
  "id": "lbjgjw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541067
}