{
  "author": "GargantuanFacewedge",
  "original_created_utc": 1636295924,
  "title": "Just converted all my ADA to LRC - AMA",
  "created_utc": 1636342684,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I read two comments from people on here about how LRC is good and then I heard someone say ADA is a stable coin that will never deliver. Then I used the white bar at the top of my screen to search LRC and I found two articles on websites I’ve never heard of with a bunch of typos and grammatical errors saying LRC good. I didn’t check anything else and I basically do not understand what a blockchain is. I also have no understanding of NFT’s and I’m so bad at basic math that I literally couldn’t pass Algebra 1 and never graduated college. My Mom asked me what crypto was so I took a huge bong hit and said “it’s decentralized peer to peer blockchain currency that uses smart contracts and nodes to secure transactions and verify user protocols by way of employing proof of stake and proof of consensus zero-knowledge proofs.” Will I be a millionaire? But really I did convert all my ADA to LRC.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qoptlg/just_converted_all_my_ada_to_lrc_ama/",
  "subreddit": "CryptoCurrency",
  "id": "qoptlg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I read two comments from people on here about how LRC is good and then I heard\nsomeone say ADA is a stable coin that will never deliver. Then I used the white\nbar at the top of my screen to search LRC and I found two articles on websites\nI’ve never heard of with a bunch of typos and grammatical…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "LRCが良いという人のコメントを2つ読みました。\nADAは安定したコインであり、決して実現しないと言っている人がいました。それから、画面上部の白いバーを使ってLRCを検索してみました。\n画面上部の白いバーでLRCを検索すると、聞いたこともないウェブサイトの記事が2つ出てきました。\n私は聞いたことがないウェブサイトの2つの記事を見つけましたが、そこにはたくさんのタイプミスや文法上の問題がありました...。",
      "title": "すべてのADAをLRCに変更しました - AMA"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里读到两个人的评论，说LRC是好的，然后我听到\n有人说ADA是一个稳定的硬币，永远不会兑现。然后我用屏幕上方的白色\n栏来搜索LRC，我发现了两篇网站上的文章。\n我从来没有听说过，有一堆的错别字和语法...",
      "title": "刚把我所有的ADA转换为LRC - AMA"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏讀到兩個人的評論，說LRC是好的，然後我聽到\n有人說ADA是一個穩定的硬幣，永遠不會兌現。然後我用屏幕上方的白色\n欄來搜索LRC，我發現了兩篇網站上的文章。\n我從來沒有聽說過，有一堆的錯別字和語法...",
      "title": "剛把我所有的ADA轉換爲LRC - AMA"
    }
  ]
}