{
  "author": "EmbarrassingAlttt",
  "original_created_utc": 1643639145,
  "title": "How do I bring up a client's weight? Am I even allowed to do so?",
  "created_utc": 1643644377,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I own a hair salon, and over COVID, I noticed that many of our pump chairs struggle with the weights of some clients. The chairs do have an upper limit, and I&amp;#39;ve googled what that weight looks like on an average height woman. My guess is we have about 6-12 clients who are likely past the limit.&lt;/p&gt;\n\n&lt;p&gt;With our shampoo chairs, this is a safety issue, because if the chair was ever to break, it would snap with the person&amp;#39;s neck in the shampoo bowl, which could cause massive injury.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve looked into upgrading our equipment, but salon chairs for 500-600lbs can cost $5k apiece and take up more room than what we have available. COVID ate up my emergency fund just to keep this place afloat. There&amp;#39;s no way I can shell out enough to buy new equipment.&lt;/p&gt;\n\n&lt;p&gt;I saw a news story where a spa owner put a weight limit on his pedicure chair because it was broken twice by overweight clients. The backlash was brutal. How can I tell these clients that my equipment literally cannot support them without being called fatphobic or creating a backlash? And if I told people that I couldn&amp;#39;t accommodate them, could this spiral into something larger, like a discrimination issue? I would love to upgrade the chairs, but at the moment, it&amp;#39;s just not an option.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 207,
  "permalink": "/r/NoStupidQuestions/comments/sh2fx1/how_do_i_bring_up_a_clients_weight_am_i_even/",
  "subreddit": "NoStupidQuestions",
  "id": "sh2fx1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I own a hair salon, and over COVID, I noticed that many of our pump chairs\nstruggle with the weights of some clients. The chairs do have an upper limit,\nand I've googled what that weight looks like on an average height woman. My\nguess is we have about 6-12 clients who are likely past the…"
}