{
  "author": "EmbarrassingAlttt",
  "original_created_utc": 1643639145,
  "title": "How do I bring up a client's weight? Am I even allowed to do so?",
  "created_utc": 1643644377,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I own a hair salon, and over COVID, I noticed that many of our pump chairs struggle with the weights of some clients. The chairs do have an upper limit, and I&amp;#39;ve googled what that weight looks like on an average height woman. My guess is we have about 6-12 clients who are likely past the limit.&lt;/p&gt;\n\n&lt;p&gt;With our shampoo chairs, this is a safety issue, because if the chair was ever to break, it would snap with the person&amp;#39;s neck in the shampoo bowl, which could cause massive injury.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve looked into upgrading our equipment, but salon chairs for 500-600lbs can cost $5k apiece and take up more room than what we have available. COVID ate up my emergency fund just to keep this place afloat. There&amp;#39;s no way I can shell out enough to buy new equipment.&lt;/p&gt;\n\n&lt;p&gt;I saw a news story where a spa owner put a weight limit on his pedicure chair because it was broken twice by overweight clients. The backlash was brutal. How can I tell these clients that my equipment literally cannot support them without being called fatphobic or creating a backlash? And if I told people that I couldn&amp;#39;t accommodate them, could this spiral into something larger, like a discrimination issue? I would love to upgrade the chairs, but at the moment, it&amp;#39;s just not an option.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 207,
  "permalink": "/r/NoStupidQuestions/comments/sh2fx1/how_do_i_bring_up_a_clients_weight_am_i_even/",
  "subreddit": "NoStupidQuestions",
  "id": "sh2fx1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I own a hair salon, and over COVID, I noticed that many of our pump chairs\nstruggle with the weights of some clients. The chairs do have an upper limit,\nand I've googled what that weight looks like on an average height woman. My\nguess is we have about 6-12 clients who are likely past the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はヘアサロンを経営していますが、COVIDをめぐって、多くのポンプチェアがあることに気づきました。\nお客様の体重に対応するために 椅子には上限があります。\n平均的な身長の女性でその体重がどの程度なのか、ググってみました。私の\nおそらく、6～12名のお客様が、この制限を越えていると思います。",
      "title": "クライアントの体重を上げるにはどうしたらよいですか？また、そのようなことをしてもよいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我拥有一家美发店，在COVID期间，我注意到我们的许多泵椅\n在应付一些客户的重量时很吃力。这些椅子确实有一个上限。\n我上网查了一下这个重量在一个平均身高的女性身上是什么样子。我的\n我的猜测是，我们有大约6-12个客户可能已经超过了这个上限。",
      "title": "我怎样才能提起客户的体重？我是否被允许这样做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我擁有一家美髮店，在COVID期間，我注意到我們的許多泵椅\n在應付一些客戶的重量時很喫力。這些椅子確實有一個上限。\n我上網查了一下這個重量在一個平均身高的女性身上是什麼樣子。我的\n我的猜測是，我們有大約6-12個客戶可能已經超過了這個上限。",
      "title": "我怎樣才能提起客戶的體重？我是否被允許這樣做？"
    }
  ]
}