{
  "author": "JohnnyJoyerSmiler",
  "original_created_utc": 1632133399,
  "title": "Controversial warning: Chinese Lehman Brothers moment unfolding right now could significantly affect the prices of crypto, among other markets",
  "created_utc": 1632152619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This will probably be downvoted to infinity, because &quot;he&#39;s spreading FUD&quot;, and everyone wants crypto to &quot;moon&quot; (as do I), but I think this is a major development in the world economy where it would be naive to think it won&#39;t affect us crypto investors. So, bracing for downvotes, here goes:</p>\n\n<p><strong>There are crucial events unfolding in China right now, with one of the largest real estate developers in the world (Evergrande) being unable to meet its debt obligations partly due today, partly due on thursday. All in all, it&#39;s created a debt monster of 300 BILLION that it is unable to pay off. The stock was trading at $30 four years ago, $20 a year ago, and today it&#39;s trading at $2.</strong></p>\n\n<p>I guess crypto isn&#39;t the only place for 93% drops, huh?</p>\n\n<p>Because of this, there&#39;s significant uncertainty in the markets, and this could well affect crypto. This might&#39;ve even been the cause of the recent dip we just had.</p>\n\n<p><strong>So, how can the bankrupcy of a Chinese real estate developer affect crypto?</strong></p>\n\n<ul>\n<li>Since Evergrande won&#39;t be able to make its debt payments, the holders of this debt (banks) lose a lot of money, and they&#39;ll likely cover by selling other assets, which will drop in the price as a result. This could mean a whole variety of assets - bonds, stocks, etc. Who will be hurt? Institutions. The very same institutions that are heavily invested in crypto right now. It could be that institutions are dumping crypto right now in preparation to deal with the fallout that&#39;ll come from Evergrande. If they&#39;re not dumping right now, they may start when the fallout hits.</li>\n<li>Re-enter Tether FUD - we all know they&#39;re not mostly backed by US dollars, but to a very large extent (around 50%) by unspecified commercial paper - the very same paper that&#39;ll likely be hit significantly by the fallout from Evergrande. This could drop the value of Tether, and we all know how massively the whole crypto market relies on Tether.</li>\n</ul>\n\n<p>So will a massive crash happen? I don&#39;t know. My crystal ball is as good as yours. But I think it&#39;s worth being careful and rational. I would advise you to keep an eye on how the Evergrande situation develops.</p>\n\n<p>What do you think? Did I miss something?</p>\n\n<p>EDITS:</p>\n\n<ol>\n<li>$300 billion may not seem like a lot, but to put this in perspective, Lehman Brothers which triggered the 2008 crisis was 620 billion in debt, and 640 billion in assets. The question is how much of a cascade effect this loss of $300 billion will create in the markets through leveraged traders getting liquidated, as well as the whole derivatives market being affected by it. I don&#39;t think it&#39;ll be a repeat of 2008, and someone rightly said 600 billion was a lot 13 years ago, but it&#39;s naive to think 300 billion at this day and age is nothing. Big stock indexes are dropping. Look at SPX for example. Why is SPX getting affected by it, if &quot;300 billion is a drop in the bucket&quot;? No, this will probably be not a repeat of 2008, but it will most likely significantly affect the markets (it already HAS), as well as crypto.</li>\n<li>Thank you for the awards. It makes me happy that others see value in my writing.</li>\n<li>Holy shit. That&#39;s a lot of awards :O</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 341,
  "permalink": "/r/CryptoCurrency/comments/prrzc8/controversial_warning_chinese_lehman_brothers/",
  "subreddit": "CryptoCurrency",
  "id": "prrzc8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This will probably be downvoted to infinity, because \"he's spreading FUD\", and\neveryone wants crypto to \"moon\" (as do I), but I think this is a major\ndevelopment in the world economy where it would be naive to think it won't\naffect us crypto investors. So, bracing for downvotes, here goes:\n\nThere…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはおそらく、「彼はFUDを広めている」という理由で、無限にダウンバージョンされるでしょう。\nるでしょうが、私はこれは世界の主要な発展につながるものだと思います。\nしかし、これは世界経済の大きな進展であり、私たち暗号投資家に影響がないと考えるのは甘いでしょう。\n私たち暗号投資家に影響を与えないと考えるのは甘いでしょう。批判に備えて、ここに書いておきます。\n\nそれは...",
      "title": "物議を醸す警告。今繰り広げられている中国のリーマン・ブラザーズの瞬間は、他の市場の中でも、暗号の価格に大きな影響を与える可能性がある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这可能会被降权到无限大，因为 \"他在散布谣言\"，而且\n每个人都希望加密货币能够 \"登月\"（我也是），但我认为这是世界经济的一个重大发展。\n但我认为这是世界经济的一个重大发展，如果认为它不会影响我们这些加密货币投资者，那就太天真了。\n影响到我们加密货币投资者。所以，为了避免被降权，我在这里说。\n\n有...",
      "title": "有争议的警告。中国的雷曼兄弟时刻正在展开，可能会大大影响加密货币和其他市场的价格"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這可能會被降權到無限大，因爲 \"他在散佈謠言\"，而且\n每個人都希望加密貨幣能夠 \"登月\"（我也是），但我認爲這是世界經濟的一個重大發展。\n但我認爲這是世界經濟的一個重大發展，如果認爲它不會影響我們這些加密貨幣投資者，那就太天真了。\n影響到我們加密貨幣投資者。所以，爲了避免被降權，我在這裏說。\n\n有...",
      "title": "有爭議的警告。中國的雷曼兄弟時刻正在展開，可能會大大影響加密貨幣和其他市場的價格"
    }
  ]
}