{
  "author": "UnexperiencedIT",
  "original_created_utc": 1635155088,
  "title": "Every month when I receive my salary I take 10% of it, put it in a stable coin and wait for the dip. Then DCA a bit by bit.",
  "created_utc": 1635165363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So this is my strategy, you probably have yours but I do what I can afford.  </p>\n\n<p>Of course I would like to invest more money and it is certain that this investment will not enrich me given that the standard of living in the country where I live is not very good, but I honestly believe that in time I can take some nice earnings with this way of investing. </p>\n\n<p>So every month I try to take 10% of my salary and I put it into a stable coin. Then I wait for the drop and DCA a bit by bit. Sometimes it is less then 10%, sometimes it is more if I can afford it and if I really believe in that coin. </p>\n\n<p>I don&#39;t rush because I am here to stay in a long run, so a small amount of money can become large over time if I invest wisely.</p>\n</div><!-- SC_ON -->",
  "score": 225,
  "permalink": "/r/CryptoCurrency/comments/qfd4dj/every_month_when_i_receive_my_salary_i_take_10_of/",
  "subreddit": "CryptoCurrency",
  "id": "qfd4dj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So this is my strategy, you probably have yours but I do what I can afford.\n\nOf course I would like to invest more money and it is certain that this\ninvestment will not enrich me given that the standard of living in the country\nwhere I live is not very good, but I honestly believe that in time I can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これが私の戦略です。あなたもそうかもしれませんが、私は自分にできることをしています。\n\nもちろん、私はもっと多くの資金を投資したいと思っていますし、この投資は確実に\n私が住んでいる国の生活水準があまり良くないことを考えると、この投資が私を豊かにしないことは確かです。\n私が住んでいる国の生活水準があまり良くないことを考えると、この投資が私を豊かにしないことは確かですが、私は正直なところ、時間が経てば......。",
      "title": "毎月、給料を受け取ったら、そのうちの10％を取って、安定したコインに入れて、ディップするのを待ちます。そして、少しずつDCAを回していきます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以这是我的策略，你可能有你的策略，但我做我能负担得起的事情。\n\n当然，我想投资更多的钱，但可以肯定的是，鉴于该国的生活水平，这种投资不会使我致富。\n鉴于我所在国家的生活水平并不高，这种投资肯定不会让我致富。\n但我真诚地相信，随着时间的推移，我可以......",
      "title": "每个月当我收到工资时，我都会拿出10%的钱，放在一个稳定的硬币里，等待下跌。然后一点一点的DCA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以這是我的策略，你可能有你的策略，但我做我能負擔得起的事情。\n\n當然，我想投資更多的錢，但可以肯定的是，鑑於該國的生活水平，這種投資不會使我致富。\n鑑於我所在國家的生活水平並不高，這種投資肯定不會讓我致富。\n但我真誠地相信，隨着時間的推移，我可以......",
      "title": "每個月當我收到工資時，我都會拿出10%的錢，放在一個穩定的硬幣裏，等待下跌。然後一點一點的DCA。"
    }
  ]
}