{
  "author": "FlickObserver",
  "original_created_utc": 1639921441,
  "title": "Am I morally responsible if someone commits suicide because of my action or inaction?",
  "created_utc": 1639973266,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If someone tells me they&amp;#39;re gonna commit suicide if I do something that&amp;#39;s inconsequential to their decision and I still do it, does that make me morally responsible for their death? I didn&amp;#39;t have a hand in their decision but they did warn me that there will be a consequence to my action.&lt;/p&gt;\n\n&lt;p&gt;This is all hypothetical.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/rjx19n/am_i_morally_responsible_if_someone_commits/",
  "subreddit": "askphilosophy",
  "id": "rjx19n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If someone tells me they're gonna commit suicide if I do something that's\ninconsequential to their decision and I still do it, does that make me morally\nresponsible for their death? I didn't have a hand in their decision but they did\nwarn me that there will be a consequence to my action.\n\nThis is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし誰かが、私が何かしたら自殺すると言ったとしたら、そのことは\nその決断に取るに足らないことなのに、それでもやってしまうのは、私に道徳的な責任があるのでしょうか。\nその人の死に対して責任があるのか？私は彼らの決断に関与していませんが、彼らはそうしました。\n私の行動には結果が伴うと警告している。\n\nこれは...",
      "title": "私の行動や不作為によって誰かが自殺した場合、私は道徳的な責任を負うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人告诉我，如果我做了一些对他们的决定无关紧要的事情，他们就会自杀，而我还是做了。\n如果有人告诉我，如果我做了一些对他们的决定无关紧要的事情，而我还是做了，这是否使我在道德上对他们的死亡负责？\n对他们的死亡负责吗？我没有参与他们的决定，但他们确实\n警告我，我的行为会有一个后果。\n\n这就是...",
      "title": "如果有人因为我的行动或不行动而自杀，我是否有道德责任？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人告訴我，如果我做了一些對他們的決定無關緊要的事情，他們就會自殺，而我還是做了。\n如果有人告訴我，如果我做了一些對他們的決定無關緊要的事情，而我還是做了，這是否使我在道德上對他們的死亡負責？\n對他們的死亡負責嗎？我沒有參與他們的決定，但他們確實\n警告我，我的行爲會有一個後果。\n\n這就是...",
      "title": "如果有人因爲我的行動或不行動而自殺，我是否有道德責任？"
    }
  ]
}