{
  "author": "JeeEyeElElEeTeeTeeEe",
  "original_created_utc": 1643589440,
  "title": "Would the Nazis have killed disabled veterans?",
  "created_utc": 1643621467,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Disabled people were one of the minorities targeted by the Nazis for “extermination,” whether through murder or forced sterilization. &lt;/p&gt;\n\n&lt;p&gt;Of course many German soldiers would have come home disabled, losing limbs, confined to a wheelchair, etc. &lt;/p&gt;\n\n&lt;p&gt;Would the Nazis have targeted them in a pogrom? Would they have been spared because their “defects” were not due to genetics? Would they have been celebrated for being veterans, or shuffled away in favor of veterans not permanently injured?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sgnjyp/would_the_nazis_have_killed_disabled_veterans/",
  "subreddit": "AskHistorians",
  "id": "sgnjyp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Disabled people were one of the minorities targeted by the Nazis for\n“extermination,” whether through murder or forced sterilization.\n\nOf course many German soldiers would have come home disabled, losing limbs,\nconfined to a wheelchair, etc.\n\nWould the Nazis have targeted them in a pogrom? Would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "障害者は、ナチスが標的とした少数民族の一つである。\n殺人や強制不妊手術などの \"絶滅 \"である。\n\nもちろん、多くのドイツ兵は手足を失い、障害を持って帰ってきただろう。\n車いす生活になるなど\n\nナチスは彼らをポグロムのターゲットにしただろうか？それとも...",
      "title": "ナチスは障害者の退役軍人を殺しただろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "残疾人是被纳粹盯上的少数群体之一。\n无论是通过谋杀还是强制绝育，都是 \"灭绝 \"的对象。\n\n当然，许多德国士兵回国后都会成为残疾人，失去四肢。\n被限制在轮椅上，等等。\n\n纳粹会在大屠杀中针对他们吗？会不会...",
      "title": "纳粹会不会杀害残疾老兵？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "殘疾人是被納粹盯上的少數羣體之一。\n無論是通過謀殺還是強制絕育，都是 \"滅絕 \"的對象。\n\n當然，許多德國士兵回國後都會成爲殘疾人，失去四肢。\n被限制在輪椅上，等等。\n\n納粹會在大屠殺中針對他們嗎？會不會...",
      "title": "納粹會不會殺害殘疾老兵？"
    }
  ]
}