{
  "author": "Successful_Craft3076",
  "original_created_utc": 1648897221,
  "title": "ETH hit 3500$ as market remains bullish despite EU ban on private wallets",
  "created_utc": 1648906410,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If this doesn&amp;#39;t make you bullish nothing will! Market experienced a brief dive before recovering to an even higher cap amid EU aggressive new regulations on private wallets.\nThis shows how bullish the market is as it grows more and more even tho so many bad news (federal interest rate hike and upcoming US crypto regulations) recently hit the market.&lt;/p&gt;\n\n&lt;p&gt;ETH briefly reached 3500$ today before retreating to 3480$. Almost every major coin is gaining.\nNear gained more than 20%, Graph 14%, Flow and Aave both more than 13% and Terra and Tezos and Arweave and SOL more than 10%!!!\nA fantastic day for cryptomarket indeed!&lt;/p&gt;\n\n&lt;p&gt;Fantom also recovered more than 10% and now is at 1.67$. and people were saying it is dead. A truly remarkable recovery from previous dive to 1$.&lt;/p&gt;\n\n&lt;p&gt;Enjoy everyone . You deserve it and more.&lt;/p&gt;\n\n&lt;p&gt;Edit: apparently ban is a rather strong and inaccurate definition and I apologize for using it. First of all it is not yet in full effect and needs confirmation from other bodies of European union. And it is more like mandatory KYC for using private wallets.\nI thank those who pointed it out.\nCheerz&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/tuga30/eth_hit_3500_as_market_remains_bullish_despite_eu/",
  "subreddit": "CryptoCurrency",
  "id": "tuga30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If this doesn't make you bullish nothing will! Market experienced a brief dive\nbefore recovering to an even higher cap amid EU aggressive new regulations on\nprivate wallets. This shows how bullish the market is as it grows more and more\neven tho so many bad news (federal interest rate hike and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これで強気になれなければ、何もできない! 市場は一時的に急落しました。\nEUの積極的な新規制を受け、上限を上回る水準まで回復した。\nプライベートウォレット これは、市場がますます強気になっていることを表しています。\n多くの悪いニュース（連邦政府の利上げと...",
      "title": "EUがプライベートウォレットを禁止しても市場は強気を維持し、ETHは3500ドルを記録"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这还不能让你看涨，那就没有什么能让你看涨了! 市场经历了一次短暂的跳水\n然后恢复到更高的上限，因为欧盟对私人钱包制定了积极的新规定。\n私人钱包。这表明市场是多么的看涨，因为它越来越多的增长\n尽管有这么多坏消息（联邦加息和...",
      "title": "ETH达到3500美元，尽管欧盟禁止私人钱包，但市场仍然看涨"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這還不能讓你看漲，那就沒有什麼能讓你看漲了! 市場經歷了一次短暫的跳水\n然後恢復到更高的上限，因爲歐盟對私人錢包制定了積極的新規定。\n私人錢包。這表明市場是多麼的看漲，因爲它越來越多的增長\n儘管有這麼多壞消息（聯邦加息和...",
      "title": "ETH達到3500美元，儘管歐盟禁止私人錢包，但市場仍然看漲"
    }
  ]
}