{
  "author": "Successful_Craft3076",
  "original_created_utc": 1648897221,
  "title": "ETH hit 3500$ as market remains bullish despite EU ban on private wallets",
  "created_utc": 1648906410,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If this doesn&amp;#39;t make you bullish nothing will! Market experienced a brief dive before recovering to an even higher cap amid EU aggressive new regulations on private wallets.\nThis shows how bullish the market is as it grows more and more even tho so many bad news (federal interest rate hike and upcoming US crypto regulations) recently hit the market.&lt;/p&gt;\n\n&lt;p&gt;ETH briefly reached 3500$ today before retreating to 3480$. Almost every major coin is gaining.\nNear gained more than 20%, Graph 14%, Flow and Aave both more than 13% and Terra and Tezos and Arweave and SOL more than 10%!!!\nA fantastic day for cryptomarket indeed!&lt;/p&gt;\n\n&lt;p&gt;Fantom also recovered more than 10% and now is at 1.67$. and people were saying it is dead. A truly remarkable recovery from previous dive to 1$.&lt;/p&gt;\n\n&lt;p&gt;Enjoy everyone . You deserve it and more.&lt;/p&gt;\n\n&lt;p&gt;Edit: apparently ban is a rather strong and inaccurate definition and I apologize for using it. First of all it is not yet in full effect and needs confirmation from other bodies of European union. And it is more like mandatory KYC for using private wallets.\nI thank those who pointed it out.\nCheerz&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/tuga30/eth_hit_3500_as_market_remains_bullish_despite_eu/",
  "subreddit": "CryptoCurrency",
  "id": "tuga30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If this doesn't make you bullish nothing will! Market experienced a brief dive\nbefore recovering to an even higher cap amid EU aggressive new regulations on\nprivate wallets. This shows how bullish the market is as it grows more and more\neven tho so many bad news (federal interest rate hike and…"
}