{
  "author": "MBlaizze",
  "the_new_excerpt": "In other words, a very long time. It seems that the stock market has truly\nbecome a store of wealth, and nothing can bring it down, as long as it doesn’t\ngo much higher. Every dip on negative news seems to be countered with an equal\namount of cash that buys that dip. Then there is the fact that we…",
  "original_created_utc": 1623971767,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "言い換えれば、とても長い時間です。株式市場はまさに富の貯蔵庫となったようです。\n株式市場はまさに富の貯蔵庫となっていて、これ以上高くならない限り、何があっても下げられない。\n高くならない限り、何も下がらない。ネガティブなニュースで下落するたびに、その下落を買った同量の現金で対抗しているようです。\nネガティブなニュースで株価が下がると、それと同じ量の現金がその株を買います。そして、私たちは...",
      "title": "私は、ファンダメンタルズが追いつくまで、この株式市場は横ばいになるのではないかと思い始めています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "换句话说，是非常长的时间。看来，股票市场已经真正\n变成了财富的仓库，只要它不涨得太高，就没有什么能把它打倒。\n涨得更高。负面消息带来的每一次下跌，似乎都会有同等数量的现金买入该次下跌。\n跌，都有同等数量的现金买入。然后，还有一个事实是，我们...",
      "title": "我开始相信这个股票市场可能会走偏，直到基本面赶上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "換句話說，是非常長的時間。看來，股票市場已經真正\n變成了財富的倉庫，只要它不漲得太高，就沒有什麼能把它打倒。\n漲得更高。負面消息帶來的每一次下跌，似乎都會有同等數量的現金買入該次下跌。\n跌，都有同等數量的現金買入。然後，還有一個事實是，我們...",
      "title": "我開始相信這個股票市場可能會走偏，直到基本面趕上。"
    }
  ],
  "title": "I am starting to believe that this stock market may go sideways until fundamentals catch up.",
  "created_utc": 1623992378,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In other words, a very long time. It seems that the stock market has truly become a store of wealth, and nothing can bring it down, as long as it doesn’t go much higher. Every dip on negative news seems to be countered with an equal amount of cash that buys that dip. Then there is the fact that we are on the cusp of a new paradigm of ai and genetics based tech advances that nobody wants to miss out on.</p>\n</div><!-- SC_ON -->",
  "score": 52,
  "permalink": "/r/investing/comments/o2aq5q/i_am_starting_to_believe_that_this_stock_market/",
  "subreddit": "investing",
  "id": "o2aq5q",
  "is_self": true,
  "media": null,
  "is_video": false
}