{
  "author": "partymsl",
  "original_created_utc": 1645641239,
  "title": "People claiming that holding is the easiest thing. But panic after just a few red months. Holding is not easy, so congrats if you do it.",
  "created_utc": 1645665772,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The one thing that is said the most in crypto is HODL. Many talk about how this strategy is the easiest thing and by holding rly long-term they will easily make a ton of profit. But those are also just the people that get shacked out by some short-term movement in crypto. &lt;/p&gt;\n\n&lt;p&gt;Especially during such few months people forget their strategy and just panic. Knowing what you are doing is the most powerful thing ever. And you don&amp;#39;t rly do that if you through your whole strategy apart at the first sign of danger. &lt;/p&gt;\n\n&lt;p&gt;So even if you may think that holding is easy and too default. It&amp;#39;s not like that. If it woukd have been that easy then the thousands of people that bought crypto during the very beginning would be billionaires by now. Being able to hold on to your crypto and prevent sell pressure is indeed a major achievement.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 360,
  "permalink": "/r/CryptoCurrency/comments/szoeqp/people_claiming_that_holding_is_the_easiest_thing/",
  "subreddit": "CryptoCurrency",
  "id": "szoeqp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The one thing that is said the most in crypto is HODL. Many talk about how this\nstrategy is the easiest thing and by holding rly long-term they will easily make\na ton of profit. But those are also just the people that get shacked out by some\nshort-term movement in crypto.\n\nEspecially during such…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号で一番言われているのがHODLです。多くの人が、いかにこの\nこの戦略は最も簡単なものであり、超長期保有することで簡単に儲けることができます。\n莫大な利益を得ることができます。しかし、それはまた、何かのきっかけで淘汰される人々である。\n暗号の短期的な動き。\n\n特にそのような時に...",
      "title": "持ち運びが一番楽だと主張する人たち。しかし、ほんの数回の赤月でパニックになる。ホールドは簡単ではないので、できたらめでたい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在加密货币中说得最多的一件事是HODL。许多人都在谈论这个策略如何\n战略是最简单的事情，通过长期持有，他们将很容易赚取\n一吨的利润。但这些人也只是被加密货币的一些短期波动所吓倒的人。\n短期的加密货币运动。\n\n特别是在这种情况下。",
      "title": "人们声称持有是最容易的事情。但仅仅在几个红色的月后就恐慌了。持有是不容易的，如果你做到了，那就恭喜你。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在加密貨幣中說得最多的一件事是HODL。許多人都在談論這個策略如何\n戰略是最簡單的事情，通過長期持有，他們將很容易賺取\n一噸的利潤。但這些人也只是被加密貨幣的一些短期波動所嚇倒的人。\n短期的加密貨幣運動。\n\n特別是在這種情況下。",
      "title": "人們聲稱持有是最容易的事情。但僅僅在幾個紅色的月後就恐慌了。持有是不容易的，如果你做到了，那就恭喜你。"
    }
  ]
}