{
  "author": "tussNpuss",
  "original_created_utc": 1631797722,
  "title": "No, the guy who begged people to just buy 1$ worth of Bitcoin IS NOT giving any bitcoin away for his birthday",
  "created_utc": 1631818000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://np.reddit.com/r/CryptoCurrency/comments/poqtho/the_guy_who_begged_people_to_just_buy_1_worth_of/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">This post has gained a lot of popularity and upvotes in here</a> and I want to correct a few things in here.</p>\n\n<p>The guy <em>Davinci Jeremie</em> who begged everyone to buy a dollar worth of bitcoin 8 years ago is now claiming he will give away 1BTC for his birthday.</p>\n\n<p>To be a part of the giveaway you have to subscribe to him on YouTube and watch his birthday video and follow the instructions.</p>\n\n<p>This is a good marketing technique for his YouTube channel and his Telegram group where he <em>&quot;teaches day-trading&quot;</em> , to be a part of his Telegram group you have to buy his own ERC-20 token which acts as a subscription of the group.</p>\n\n<p>He also shills various of shitcoins in his videos which are clearly paid sponsorships to rob people out of their money who think Davinci will predict another coin&#39;s rise again.</p>\n\n<p>One look at this guy&#39;s twitter and you can see he clearly doesnt know anything about bitcoin and only follows on what other people are doing in, he has probably got back in on again the past years but in no way he has held for 8 years. Not a single person who has been a part of the crypto-community for that long would know so little about it as this guy does.</p>\n\n<p>There is not a single bit of proof that this guy is a Bitcoin millionaire like he claims he is and to me he doesn&#39;t look like one either, he is a fraud and possibly sold his Bitcoins as soon as bitcoins price took off like anyone would had done in that time.</p>\n\n<p><strong>He is not giving away any Bitcoin and only wants to promote his channel, token and his Telegram group. Once again this whole sub is blindly following fake news/announcement without a single proof.</strong></p>\n\n<p>TLDR: Once again don&#39;t believe everything you see without proof, this guy is not giving away any bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/ppczck/no_the_guy_who_begged_people_to_just_buy_1_worth/",
  "subreddit": "CryptoCurrency",
  "id": "ppczck",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This post has gained a lot of popularity and upvotes in here\n[https://np.reddit.com/r/CryptoCurrency/comments/poqtho/the_guy_who_begged_people_to_just_buy_1_worth_of/?utm_source=share&utm_medium=web2x&context=3]\nand I want to correct a few things in here.\n\nThe guy Davinci Jeremie who begged everyone…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿は、ここで多くの人気とupvoteを獲得しています。\n[https://np.reddit.com/r/CryptoCurrency/comments/poqtho/the_guy_who_begged_people_to_just_buy_1_worth_of/?utm_source=share&utm_medium=web2x&context=3]\nで、いくつかの点を訂正したいと思います。\n\nみんなに懇願していたダヴィンチ・ジェレミーという人...",
      "title": "1ドル分のビットコインを買ってください」と人々に懇願した人が、誕生日にビットコインをプレゼントすることはありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个帖子在这里获得了大量的人气和赞誉\n[https://np.reddit.com/r/CryptoCurrency/comments/poqtho/the_guy_who_begged_people_to_just_buy_1_worth_of/?utm_source=share&utm_medium=web2x&context=3]\n我想在这里纠正一些事情。\n\n达文西-杰里米这家伙求大家...",
      "title": "不，那个乞求人们购买价值1美元的比特币的人并没有在他的生日时送出任何比特币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個帖子在這裏獲得了大量的人氣和讚譽\n[https://np.reddit.com/r/CryptoCurrency/comments/poqtho/the_guy_who_begged_people_to_just_buy_1_worth_of/?utm_source=share&utm_medium=web2x&context=3]\n我想在這裏糾正一些事情。\n\n達文西-傑里米這傢伙求大家...",
      "title": "不，那個乞求人們購買價值1美元的比特幣的人並沒有在他的生日時送出任何比特幣。"
    }
  ]
}