{
  "author": "ButterscotchOk8112",
  "original_created_utc": 1638914136,
  "title": "How did people come to a consensus about what crystals “do”?(I’m asking about the history of people believing in this, not about the crystals themselves)",
  "created_utc": 1638930156,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m not trying to stir things up about crystals and peoples’s faith, I’m just wondering how people in the west came to an agreement about these things.  I could understand if it was something like  “Traditional Han culture associated xxxxx with xxxx”&lt;/p&gt;\n\n&lt;p&gt;Or “in Ancient Rome, xxxx was believed to xxxx” &lt;/p&gt;\n\n&lt;p&gt;But there seems to be a pretty strong consensus that certain crystals do certain things.  That rose quarts is “unconditional love”, for example.  &lt;/p&gt;\n\n&lt;p&gt;Did one person decide that? Does it stem from one particular faith?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/AskHistorians/comments/rbal2y/how_did_people_come_to_a_consensus_about_what/",
  "subreddit": "AskHistorians",
  "id": "rbal2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m not trying to stir things up about crystals and peoples’s faith, I’m just\nwondering how people in the west came to an agreement about these things. I\ncould understand if it was something like “Traditional Han culture associated\nxxxxx with xxxx”\n\nOr “in Ancient Rome, xxxx was believed to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "水晶や人々の信仰について煽るつもりはありません。\n西洋では、このようなことに関して、どのように合意形成がなされたのでしょうか。I\n漢民族の伝統的な文化から連想されるもの」なら理解できるのですが\nxxxxxとxxxx\"\n\nあるいは、「古代ローマでは、xxxxは...」と信じられていた。",
      "title": "クリスタルの「機能」について、人々はどのようにしてコンセンサスを得たのでしょうか（クリスタルそのものではなく、人々がそれを信じてきた歴史について聞いています）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是想挑起关于水晶和人们的信仰的事情，我只是\n我只是想知道西方的人们是如何对这些事情达成一致的。I\n如果是 \"汉族传统文化将XXXX与XXXX联系在一起 \"这样的话，我可以理解。\nxxxxx与xxxx\"\n\n或者 \"在古罗马，xxxx被认为是......",
      "title": "人们是如何对水晶的 \"作用 \"达成共识的？（我问的是人们相信这个的历史，而不是水晶本身）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是想挑起關於水晶和人們的信仰的事情，我只是\n我只是想知道西方的人們是如何對這些事情達成一致的。I\n如果是 \"漢族傳統文化將XXXX與XXXX聯繫在一起 \"這樣的話，我可以理解。\nxxxxx與xxxx\"\n\n或者 \"在古羅馬，xxxx被認爲是......",
      "title": "人們是如何對水晶的 \"作用 \"達成共識的？（我問的是人們相信這個的歷史，而不是水晶本身）。"
    }
  ]
}