{
  "author": "skeetskeetgobgob6969",
  "original_created_utc": 1644544798,
  "title": "Does anyone feel sad and hopelessness when they see someone attractive?",
  "created_utc": 1644555713,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;And I don&amp;#39;t mean like attractive people in general, but like someone who is exactly your type that has like the perfect facial features and/or body that you just find irresistible.&lt;/p&gt;\n\n&lt;p&gt;Then you come back to reality and realize that they&amp;#39;d never go for someone like you.  Man, that shit hurts.  I can&amp;#39;t really describe how it feels in words but knowing I can&amp;#39;t be with someone like that makes me feel empty.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/NoStupidQuestions/comments/spn6l3/does_anyone_feel_sad_and_hopelessness_when_they/",
  "subreddit": "NoStupidQuestions",
  "id": "spn6l3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "And I don't mean like attractive people in general, but like someone who is\nexactly your type that has like the perfect facial features and/or body that you\njust find irresistible.\n\nThen you come back to reality and realize that they'd never go for someone like\nyou. Man, that shit hurts. I can't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "魅力的な人という意味ではなく、「この人なら」と思える人。\nまさに自分のタイプで、完璧な顔立ちや体つきをしているような人。\nを、魅力的に感じるのです。\n\nそして現実に戻り、相手がこんな人を好きになるわけがないことに気づくのです。\nを、あなたに。痛いな 無理だ...",
      "title": "魅力的な人を見て、悲しい気持ちや絶望的な気持ちになる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思不是指一般的有吸引力的人，而是指那些正好是你喜欢的类型，有完美的面部特征和/或身体的人。\n正是你的类型，有完美的面部特征和/或身体，你\n你只是觉得无法抗拒。\n\n然后你回到现实，意识到他们永远不会去找像你这样的人。\n你这样的人。伙计，这真让人伤心。我不能...",
      "title": "是否有人在看到有吸引力的人时感到悲伤和无望？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思不是指一般的有吸引力的人，而是指那些正好是你喜歡的類型，有完美的面部特徵和/或身體的人。\n正是你的類型，有完美的面部特徵和/或身體，你\n你只是覺得無法抗拒。\n\n然後你回到現實，意識到他們永遠不會去找像你這樣的人。\n你這樣的人。夥計，這真讓人傷心。我不能...",
      "title": "是否有人在看到有吸引力的人時感到悲傷和無望？"
    }
  ]
}