{
  "author": "smokingandcrying",
  "original_created_utc": 1640445267,
  "title": "If you got a new phone for Christmas, use your old one as a wallet.",
  "created_utc": 1640460712,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Using an old phone is perfect for storing crypto if you don&amp;#39;t have a hardware wallet(you should consider getting one).  &lt;/p&gt;\n\n&lt;p&gt;When you get your new phone. Factory reset the old one, install whichever crypto wallets you need for the coins you have.&lt;br/&gt;\nKeep the phone offline when it&amp;#39;s not in use. You can even use this phone as a 2FA for exchanges.  &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t use this phone for anything else except wallets. Backup your seeds to paper and keep innansafe place, do not put them on a cloud account or store on your phone.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/robgr3/if_you_got_a_new_phone_for_christmas_use_your_old/",
  "subreddit": "CryptoCurrency",
  "id": "robgr3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Using an old phone is perfect for storing crypto if you don't have a hardware\nwallet(you should consider getting one).\n\nWhen you get your new phone. Factory reset the old one, install whichever crypto\nwallets you need for the coins you have.\nKeep the phone offline when it's not in use. You can even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハードウェアがない場合、古い携帯電話を使うことは暗号を保存するのに最適な方法です。\nウォレットを購入することを検討してください。\n\n新しい携帯電話を手に入れたら 古い携帯電話を工場出荷時にリセットし、どの暗号もインストールします。\n必要なコインのウォレットを用意します。\n使わない時はオフラインにしておく。あなたも...",
      "title": "クリスマスに新しい携帯電話をもらった人は、古い携帯電話をお財布代わりにしてみましょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你没有硬件钱包，使用旧手机是存储加密货币的最佳选择。\n钱包（你应该考虑买一个）。\n\n当你得到你的新手机时。重置旧手机，安装你需要的任何加密货币\n钱包，以满足你所拥有的硬币的需要。\n在不使用手机的时候，让它保持离线状态。你甚至可以...",
      "title": "如果你在圣诞节得到一部新手机，把你的旧手机当作钱包。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你沒有硬件錢包，使用舊手機是存儲加密貨幣的最佳選擇。\n錢包（你應該考慮買一個）。\n\n當你得到你的新手機時。重置舊手機，安裝你需要的任何加密貨幣\n錢包，以滿足你所擁有的硬幣的需要。\n在不使用手機的時候，讓它保持離線狀態。你甚至可以...",
      "title": "如果你在聖誕節得到一部新手機，把你的舊手機當作錢包。"
    }
  ]
}