{
  "author": "Jaker_20",
  "the_new_excerpt": "Because this subreddit has turned into teaching Finance while babysitting, I'd\nlike to make sure you guys understand something. There's no such thing as paper\nhands vs diamond hands.\n\nThis isn't some kind of socialism or collective we vs them thing. \"paper hands\"\nare the people who sell for a profit…",
  "original_created_utc": 1613062023,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "因为这个分论坛已经变成了一边教金融，一边照看孩子，我想\n想让你们明白一些事情。有没有这样的事情，如纸\n手与钻石手。\n\n这不是什么社会主义或集体的我们与他们的事情。\"纸手\"\n是那些为了赚钱而卖的人... ...",
      "title": "股市101：你是你自己的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲這個分論壇已經變成了一邊教金融，一邊照看孩子，我想\n想讓你們明白一些事情。有沒有這樣的事情，如紙\n手與鑽石手。\n\n這不是什麼社會主義或集體的我們與他們的事情。\"紙手\"\n是那些爲了賺錢而賣的人... ...",
      "title": "股市101：你是你自己的"
    }
  ],
  "title": "Stock Market 101: You're on your own",
  "created_utc": 1613098822,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because this subreddit has turned into teaching Finance while babysitting, I&#39;d like to make sure you guys understand something. There&#39;s no such thing as paper hands vs diamond hands. </p>\n\n<p>This isn&#39;t some kind of socialism or collective we vs them thing. &quot;paper hands&quot; are the people who sell for a profit and leave people bags. Now depending on the situation, they might not leave bags, and people with diamond hands make more money. Sometimes, paper hands are right. </p>\n\n<p>That is because... drum roll... it&#39;s all about supply and demand. This is especially true in options, because they are zero-sum. That means someone will come out a loser. This idea that if we all hOLd tHE LiNE then the stock will keep going up is simply untrue. This isn&#39;t your modern dodge-ball where everyone comes out with participation trophies. Someone will be left with the bag, and that will be you if you don&#39;t start being skeptical and selling the top.</p>\n\n<p>There are people that FOMO&#39;d into weed yesterday. This is the result of people thinking stonks only go up. </p>\n\n<p>Last note: Lots of you. I mean, lots of you entered into the stock market for the FIRST time due to GME. Your first impression is that all hyped stocks will go from $4 to $450. Not at all true. What happened with GME is a once in a decade play. Whether you argue it&#39;s alive or dead isn&#39;t the point. Stop speculating that every stock will be like GME and lock your damn profits!</p>\n</div><!-- SC_ON -->",
  "score": 2642,
  "permalink": "/r/wallstreetbets/comments/lhor4r/stock_market_101_youre_on_your_own/",
  "subreddit": "wallstreetbets",
  "id": "lhor4r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728627472
}