{
  "author": "Benderineurope",
  "original_created_utc": 1632857158,
  "title": "If our favorite coin hits $100k this year, I’ll eat Surströmming and film it",
  "created_utc": 1632883194,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Some are still super bullish on Bitcoin. I’m all about hopium and even though there’s volatility in the market, other indicators suggest $100k is still possible, or even far behind $100k.</p>\n\n<p>So, if Bitcoin hits $100k this year, I will eat Surströmming and will film it for your amusement.</p>\n\n<p>Surströmming is canned fermented fish from Scandinavia. It is one of the most god-awful smells on the planet. I do not want to eat this horrific monstrosity, but we all have our crypto rituals. Anyone want to join me for the Surströmming Bitcoin challenge?</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/pxdsbb/if_our_favorite_coin_hits_100k_this_year_ill_eat/",
  "subreddit": "CryptoCurrency",
  "id": "pxdsbb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Some are still super bullish on Bitcoin. I’m all about hopium and even though\nthere’s volatility in the market, other indicators suggest $100k is still\npossible, or even far behind $100k.\n\nSo, if Bitcoin hits $100k this year, I will eat Surströmming and will film it\nfor your amusement.\n\nSurströmming…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まだビットコインに超強気な人もいる。私は希望に満ちているし、たとえ市場にボラティリティがあっても\n市場にボラティリティがあっても、他の指標を見れば、10万ドルはまだ可能だし、10万ドルのはるか先の話だ。\n可能性がありますし、10万ドルのはるか先の話でもあります。\n\nもしビットコインが今年中に100kドルに達したら、私はシュールストレミングを食べて、その様子を撮影します。\n皆さんの楽しみのために\n\nシュールストレミング...",
      "title": "もし今年、私たちのお気に入りのコインが100kドルになったら、シュールストレミングを食べて撮影します"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有些人仍然超级看好比特币。我是一个充满希望的人，即使市场有波动。\n即使市场有波动，其他指标表明10万美元仍然是\n有可能，甚至远远落后于10万美元。\n\n所以，如果比特币今年达到10万美元，我将吃下Surströmming，并将其拍摄下来\n供大家娱乐。\n\nSurströmming...",
      "title": "如果我们最喜欢的硬币今年达到10万美元，我将吃下Surströmming并拍下它"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有些人仍然超級看好比特幣。我是一個充滿希望的人，即使市場有波動。\n即使市場有波動，其他指標表明10萬美元仍然是\n有可能，甚至遠遠落後於10萬美元。\n\n所以，如果比特幣今年達到10萬美元，我將喫下Surströmming，並將其拍攝下來\n供大家娛樂。\n\nSurströmming...",
      "title": "如果我們最喜歡的硬幣今年達到10萬美元，我將喫下Surströmming並拍下它"
    }
  ]
}