{
  "author": "bawse1",
  "the_new_excerpt": "THERES 2 MILLION OF YOU. THAT IS SO CRAZY YET AMAZING WHEN YOU THINK ABOUT IT.\n\n\nIF YOU HAVEN'T NOTICED, ALL EYES ARE ON /R/WALLSTREETBETS RIGHT NOW AND A\nCERTAIN NARRATIVE IS BEING PUSHED AROUND TO MAKE IT SEEM AS IF THIS COMMUNITY IS\nDISORDERLY AND RECKLESS. WHAT I THINK IS HAPPENING IS THAT YOU…",
  "original_created_utc": 1611493272,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有200万的你。仔细想想，这真是太疯狂了，但也太不可思议了。\n\n\n如果你没有注意到，现在所有的目光都集中在/R/WALLSTREETBETS上\n某些说法被推崇，让人觉得似乎这个社区是：\n紊乱而不顾一切。我认为发生的事情是你... ...",
      "title": "你们是怎么做到大获全胜的，让这些老家伙泪流满面？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有200萬的你。仔細想想，這真是太瘋狂了，但也太不可思議了。\n\n\n如果你沒有注意到，現在所有的目光都集中在/R/WALLSTREETBETS上\n某些說法被推崇，讓人覺得似乎這個社區是：\n紊亂而不顧一切。我認爲發生的事情是你... ...",
      "title": "你們是怎麼做到大獲全勝的，讓這些老傢伙淚流滿面？"
    }
  ],
  "title": "How'd you guys manage to win so big it made these old guys drown in their tears?",
  "created_utc": 1611508806,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Theres 2 million of you. that is so crazy yet amazing when you think about it.</h1>\n\n<h2>If you haven&#39;t noticed,  all eyes are on <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> right now and a certain narrative is being pushed around to make it seem as if this community is disorderly and reckless. What I think is happening is that you guys are making such an impact that these fat cats are worried that they have to get up and put in work to earn a living.</h2>\n\n<h2>Some of these guys traditionally used the media as a tool for them to manipulate the market have failed to further line their pockets and now want to accuse you guys as being manipulators. This is complete nonsense because <strong>ALL</strong> content in <a href=\"/r/wallstreetbets\">/r/wallstreetbets</a> is organic, created only by its users. You guys choose what you like and do what you want to do as individuals.</h2>\n\n<h2>There is <strong>NO</strong> organized effort by those us who moderate this community to <em>promote, advise or recommend any stock</em>.  It is against our policy to do so and we feel it is crucial to allow members to be able to share their ideas amongst each other with autonomy.</h2>\n\n<h2>The only time we intervene is when we notice any unscrupulous characters appear thinking they can take advantage of our members.  We do our best to identify them quickly and remove them from our community.</h2>\n\n<h2>There have been accusations of some inappropriate conduct coming from this community. These are baseless accusations as I have not seen any evidence of this taking place here. You guys know better but I&#39;m going to say it anyway for those who have only recently joined this community that we don&#39;t do that stuff here.</h2>\n\n<h2>People like to talk shit about you when you&#39;re a winner, it just comes with the territory.  The way a winner responds is by keeping your head up high and enjoy living rent-free inside the minds of those who doubted you. They&#39;ll stare you down as you walk by them with a smile as wide as the sky. You don&#39;t even notice them because you&#39;re too busy basking in all the glorious tendies you&#39;ve made.  They hate that you played by the rules and still won.</h2>\n\n<h2>That fuzzy sensation you are feeling is called RESPECT and it is well earned.  Wall Street no longer dismisses your presence anymore. The smart ones know that you guys do things differently and will adapt in ways to accommodate you and how you as the next generation want things done.  You should all be proud of yourselves.</h2>\n\n<h1>Your time is now.</h1>\n\n<h2>On behalf of the Mod team,</h2>\n\n<h1>Make that money and be the change you want to see.</h1>\n</div><!-- SC_ON -->",
  "score": 28477,
  "permalink": "/r/wallstreetbets/comments/l3z0n8/howd_you_guys_manage_to_win_so_big_it_made_these/",
  "subreddit": "wallstreetbets",
  "id": "l3z0n8",
  "is_self": true,
  "media": null,
  "is_video": false
}