{
  "author": "GreySoulx",
  "original_created_utc": 1656900883,
  "title": "Do you NOT know how old you are?",
  "created_utc": 1656969509,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always taken it for granted that I know how old I am (43) but recently I&amp;#39;ve found that 2 of the 6 people I work with don&amp;#39;t really know how old they are - at least not without checking their ID and/or doing the math. These guys are both in their mid 30s.&lt;/p&gt;\n\n&lt;p&gt;They both know their month and day of birth, one of them wasn&amp;#39;t sure of the year without looking, and one knew the year but didn&amp;#39;t really know exactly how old he was without doing the math - on his phone in front of me.&lt;/p&gt;\n\n&lt;p&gt;Is this odd? I kind of get not really caring much once you get past any age that matters, generally 21 in the US unless you&amp;#39;re really into tracking your insurance rates. But I don&amp;#39;t know... I just found it interesting that 2 of the people I see so often and work with were caught off guard by the question.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/vqwuuu/do_you_not_know_how_old_you_are/",
  "subreddit": "NoStupidQuestions",
  "id": "vqwuuu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've always taken it for granted that I know how old I am (43) but recently I've\nfound that 2 of the 6 people I work with don't really know how old they are - at\nleast not without checking their ID and/or doing the math. These guys are both\nin their mid 30s.\n\nThey both know their month and day of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今まで自分の年齢（43歳）を知っていることが当たり前だと思っていましたが、最近になって\nを把握しているのが当たり前だと思っていましたが、最近、一緒に働いている6人のうち2人は自分の年齢を本当に知らないことがわかりました。\nということがわかりました。この2人はともに\n30代半ば。\n\n二人とも自分の月と日は知っているのだが...。",
      "title": "自分が何歳か知らないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直认为我知道自己的年龄（43岁）是理所当然的，但最近我\n但最近我发现，和我一起工作的6个人中，有2个人并不真正知道自己的年龄--至少在不检查自己的年龄的情况下不知道。\n至少不需要检查他们的身份证和/或进行计算。这些人都是\n在30多岁的时候。\n\n他们都知道自己的月份和日期...",
      "title": "你不知道你有多大年纪吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直認爲我知道自己的年齡（43歲）是理所當然的，但最近我\n但最近我發現，和我一起工作的6個人中，有2個人並不真正知道自己的年齡--至少在不檢查自己的年齡的情況下不知道。\n至少不需要檢查他們的身份證和/或進行計算。這些人都是\n在30多歲的時候。\n\n他們都知道自己的月份和日期...",
      "title": "你不知道你有多大年紀嗎？"
    }
  ]
}