{
  "author": "dkeate",
  "the_new_excerpt": "https://clinicaltrials.gov/ct2/show/NCT04784767\n\nI'm having difficulty researching the tech used in this vaccine.\n\nIs this different from the mRNA vaccines? Does this type of vaccine have a\nresearch history similar to mRNA vaccines? Is it a brand new tech or over 20\nyears of research like the mRNA…",
  "original_created_utc": 1618059085,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "https://clinicaltrials.gov/ct2/show/NCT04784767\n\nこのワクチンに使われている技術を調べるのに苦労しています。\n\nこれはmRNAワクチンとは違うのでしょうか？この種のワクチンには、mRNAワクチンと同様の\nこのタイプのワクチンには、mRNAワクチンと同様の研究歴がありますか？全く新しい技術なのか、それともmRNAワクチンのように20年以上の研究実績があるのか\nmRNAワクチンのように20年以上の研究が行われているのでしょうか？",
      "title": "米軍がスパイクフェリチンナノ粒子COVIDワクチンの人体実験を開始しました。これは他のタイプのワクチンとどう違うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "https://clinicaltrials.gov/ct2/show/NCT04784767\n\n我很难研究这种疫苗所使用的技术。\n\n这和mRNA疫苗有什么不同吗？这种疫苗是否有\n研究历史与mRNA疫苗类似？是一项全新的技术还是超过20\n年的研究，如mRNA...",
      "title": "美国军方已经开始对一种穗铁蛋白纳米颗粒COVID疫苗进行人体试验。这与其他类型的疫苗有何不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "https://clinicaltrials.gov/ct2/show/NCT04784767\n\n我很難研究這種疫苗所使用的技術。\n\n這和mRNA疫苗有什麼不同嗎？這種疫苗是否有\n研究歷史與mRNA疫苗類似？是一項全新的技術還是超過20\n年的研究，如mRNA...",
      "title": "美國軍方已經開始對一種穗鐵蛋白納米顆粒COVID疫苗進行人體試驗。這與其他類型的疫苗有何不同？"
    }
  ],
  "title": "The US Military has started human trials of a Spike Ferritin Nanoparticle COVID vaccine. How is this different from other types of vaccines?",
  "created_utc": 1618082999,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://clinicaltrials.gov/ct2/show/NCT04784767\">https://clinicaltrials.gov/ct2/show/NCT04784767</a></p>\n\n<p>I&#39;m having difficulty researching the tech used in this vaccine.</p>\n\n<p>Is this different from the mRNA vaccines? Does this type of vaccine have a research history similar to mRNA vaccines? Is it a brand new tech or over 20 years of research like the mRNA viruses have?</p>\n\n<p>Walter Reed Hospital believes this will have a wide application against many variants and different types of spikes used by coronaviruses. How wide are we talking? If I could never get another cold for the rest of my life, that would be great.</p>\n\n<p>I read this community frequently. Thanks for all that you guys do!</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/askscience/comments/mo4432/the_us_military_has_started_human_trials_of_a/",
  "subreddit": "askscience",
  "id": "mo4432",
  "is_self": true,
  "media": null,
  "is_video": false
}