{
  "author": "TrueSpins",
  "the_new_excerpt": "I've been in crypto since around 2013 and as you can guess am a big fan. But I\nsee a lot of posts, particularly at the moment, where people that are clearly\nunhappy with their lives are pinning their escape entirely on crypto.\n\nThere's nothing wrong with dreaming of a better life and financial…",
  "original_created_utc": 1612335481,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我从2013年左右就开始从事加密技术，你可以猜到我是个大粉丝。但我\n看到很多帖子，特别是在目前，其中的人，显然是一个很好的选择。\n对自己的生活不满意的人把他们的逃亡完全寄托在加密技术上。\n\n梦想更好的生活和财务没有错... ...",
      "title": "记住，把你所有的希望和梦想都寄托在加密技术上是不健康的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2013年左右就開始從事加密技術，你可以猜到我是個大粉絲。但我\n看到很多帖子，特別是在目前，其中的人，顯然是一個很好的選擇。\n對自己的生活不滿意的人把他們的逃亡完全寄託在加密技術上。\n\n夢想更好的生活和財務沒有錯... ...",
      "title": "記住，把你所有的希望和夢想都寄託在加密技術上是不健康的。"
    }
  ],
  "title": "Remember, it's not healthy to pin ALL your hopes and dreams on crypto.",
  "created_utc": 1612362856,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in crypto since around 2013 and as you can guess am a big fan. But I see a lot of posts, particularly at the moment, where people that are clearly unhappy with their lives are pinning their escape entirely on crypto.</p>\n\n<p>There&#39;s nothing wrong with dreaming of a better life and financial independence, but equally it&#39;s important not to put all your eggs in one basket. Don&#39;t fall into the trap of viewing crypto as a sure thing and stop developing other aspects of your life, whether that&#39;s looking for a better job, training or education.</p>\n\n<p>Bull markets don&#39;t last forever, and even if crypto does truly take you to the moon, it&#39;s likely to hit a few asteroids along the way. It will be much easier to emotionally deal with the ups and downs if you have your fingers in various pots, and other options to achieve financial success.</p>\n\n<p>So when you think about diversifying your investments, that doesn&#39;t simply mean buying some shitcoins to go with your BTC and ETH, or FOMOing into GME or the latest hot stock - it&#39;s about investing in yourself too. </p>\n\n<p>Take care out there everyone!</p>\n</div><!-- SC_ON -->",
  "score": 353,
  "permalink": "/r/CryptoCurrency/comments/lbhvpx/remember_its_not_healthy_to_pin_all_your_hopes/",
  "subreddit": "CryptoCurrency",
  "id": "lbhvpx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518532599
}