{
  "author": "Pos_Mon",
  "original_created_utc": 1632470016,
  "title": "Banks don't worry about you losing your money to gambling but are worried about you buying Cryptocurrency. A skeleton is sure in the closet.",
  "created_utc": 1632488379,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey mates, think with me!!!\nWhy is it that banks don&#39;t worry about you losing your money to gambling but are worried about you buying Cryptocurrency? Are they protecting you? Or are the protecting their businesses? Are the trying to help you put food on your table or increase their own income? There are lots and lots of unanswered questions begging for answers. And I assure you, a skeleton is sure, in the closet here.\nBanks let you buy lottery tickets. They let you gamble with your money day in day out. With just a few clicks, you can play around with your money on all of these. And yes, you should be allowed unconditional access to your money, because it is your money - YOUR MONEY.\nBut when it comes to you buying Cryptocurrency, the bank&#39;s &quot;policy&quot; changes. I once got a message from my bank saying that, &quot;for the safety of my money, payment to Crypto platforms had been restricted&quot;. This was the funniest day of my life. I wondered why they didn&#39;t restrict payment to gambling and lottery sites? Oh yeah, I get it. They just never really cared about the &quot;safety&quot; of my money after all. They are only against Crypto because they know what it will do to their businesses. What they haven&#39;t realised is how unavoidable Crypto effects on banks and exchanges actually are.\nListen to Cryptocurrency critics talk and all they say are; Cryptocurrency breeds fraud, it helps to expand money laundering, it increases criminality, it helps bad people finance terrorism, blah blah blah blah.\nI beg your pardon, before Satoshi Nakamoto invented bitcoin and subsequently introduced all of us to this beautiful world of awesomeness called Cryptocurrency, terrorism, fraud, money laundering, drugs and indeed all the bad things they accuse Cryptocurrency of had been in, not just existence, but on rampant occurrence.\nYou make your money, take it to the bank so they can help you keep it and release it back to you whenever you want to use it. Buy hell no, banks don&#39;t want to simply let you use your money whenever you need it. They want to be the ones to determine when and how you use your own money - YOUR OWN MONEY!!!\nUnfortunately, this will not soften anytime soon. Banks will continue to fight. They will continue to restrict payments and stop us from expanding cryptocurrency and blockchain technology. And for this, you should not give up. Don&#39;t let anyone determine how, where and when you use your money.\nFam, I urge you to invest in Cryptocurrency. Don&#39;t pull all of your money into it. Why? Because I believe there are other needs and bills to take of. Rents, cars, insurance, name them.\nBut Cryptocurrency is sure, the future. And you are supper early in it. Only about 5% of the world&#39;s 7 billion people own Crypto and that tells you how much you will make when adoption explodes.\nBuy and HODL. Yes, HODL!!!\nYou will be fine, I can assure you.\nHave a great day wherever you are.\nLove you all!!!\nCheers...</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/Bitcoin/comments/puf2pu/banks_dont_worry_about_you_losing_your_money_to/",
  "subreddit": "Bitcoin",
  "id": "puf2pu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hey mates, think with me!!! Why is it that banks don't worry about you losing\nyour money to gambling but are worried about you buying Cryptocurrency? Are they\nprotecting you? Or are the protecting their businesses? Are the trying to help\nyou put food on your table or increase their own income? There…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "仲間たちよ、一緒に考えよう!!! なぜ銀行は、あなたがギャンブルでお金を失うことを心配しないで、あなたが暗号通貨を買うことを心配するのでしょうか？\nギャンブルでお金を失うことは心配しないのに、暗号通貨を買うことは心配するのはなぜ？彼らは\nあなたを守っているのでしょうか? それとも、自分たちのビジネスを守っているのでしょうか? あなたが食卓を立てるのを助けようとしているのでしょうか？\nあなたが食卓を立てるのを助けようとしているのか、それとも自分の収入を増やそうとしているのか。そこには...。",
      "title": "銀行は、あなたがギャンブルでお金を失うことは心配しませんが、暗号通貨を買うことは心配しています。クローゼットの中には必ず骸骨がある。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们，和我一起思考吧！! 为什么银行不担心你失去\n但却担心你购买加密货币？他们是在\n保护你吗？还是在保护他们的业务？他们是想帮助\n你把食物放在你的桌子上还是增加他们自己的收入？有...",
      "title": "银行不担心你把钱输给赌博，但担心你购买加密货币。柜子里肯定有一具骷髅。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們，和我一起思考吧！! 爲什麼銀行不擔心你失去\n但卻擔心你購買加密貨幣？他們是在\n保護你嗎？還是在保護他們的業務？他們是想幫助\n你把食物放在你的桌子上還是增加他們自己的收入？有...",
      "title": "銀行不擔心你把錢輸給賭博，但擔心你購買加密貨幣。櫃子裏肯定有一具骷髏。"
    }
  ]
}