{
  "author": "Huner12",
  "original_created_utc": 1656826861,
  "title": "I built a job offer comparison tool/visualizer",
  "created_utc": 1656847274,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m a new grad and recently was recently comparing job offers out of college. I had offers from different companies in different locations and wanted an easy, visual way of comparing offers adjusted by taxes and cost of living. So, I made &lt;a href=\"https://budget-estimator.vercel.app/\"&gt;https://budget-estimator.vercel.app/&lt;/a&gt; to do just that.&lt;/p&gt;\n\n&lt;p&gt;Just fill the form with company name (which just acts as the label), location, and income (split into salary, bonus, stocks). Click &amp;quot;add estimation&amp;quot; and the offer/budget estimate will be added to the comparison.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/94e952wsga991.png?width=1835&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=15d89388713b6c4a77d1168d28b6d7133c1bb594\"&gt;Two offers compared with budget estimator. Expenses (taxes and rent) are to the left and net income is to the right, to make it really easy to compare.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Attached is an example with identical offers (100k salary, 10k bonus) in Seattle and San Francisco being compared. You can hover over each category to see what it is (type of expense/net income and amount). Currently, the estimate only factors in taxes (which can differ based on income type, like how bonuses are taxed differently than salary, and how stocks are counted as salary) and rent based on &lt;a href=\"https://www.huduser.gov/portal/datasets/fmr.html\"&gt;https://www.huduser.gov/portal/datasets/fmr.html&lt;/a&gt;. I&amp;#39;m hoping to add optional estimates like average cost of utilities, groceries, and gas to make the comparison even more detailed. And beyond comparing offers, I hope it can become a budgeting visualizer or just a way for people to see how much moving could benefit them, if applicable.&lt;/p&gt;\n\n&lt;p&gt;Tech stack is NextJS with D3 for visualization (my first D3 project, so it&amp;#39;s not too elegant - I&amp;#39;m hoping to add a sankey visualization form in the future). Open to any suggestions, and hope to make it open source once I clean things up and appreciate any help/feedback!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/vqai5p/i_built_a_job_offer_comparison_toolvisualizer/",
  "subreddit": "SideProject",
  "id": "vqai5p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm a new grad and recently was recently comparing job offers out of college. I\nhad offers from different companies in different locations and wanted an easy,\nvisual way of comparing offers adjusted by taxes and cost of living. So, I made\nhttps://budget-estimator.vercel.app/ to do just that.\n\nJust…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は新卒で、最近、大学を出てから就職先を比較していました。I\nの内定を比較しました。\n税金と生活費で調整されたオファーを比較する簡単で視覚的な方法を探していました。そこで、私は\nhttps://budget-estimator.vercel.app/ を作りました。\n\nただ...",
      "title": "ジョブオファー比較ツール/ビジュアライザーを作ってみた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一名刚毕业的大学生，最近正在比较大学毕业后的工作机会。I\n我有来自不同地点的不同公司的工作机会，并希望有一个简单的。\n视觉的方式来比较根据税收和生活费用调整的工作机会。因此，我制作了\nhttps://budget-estimator.vercel.app/ 来做这件事。\n\n只是...",
      "title": "我建立了一个工作机会的比较工具/视觉器"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一名剛畢業的大學生，最近正在比較大學畢業後的工作機會。I\n我有來自不同地點的不同公司的工作機會，並希望有一個簡單的。\n視覺的方式來比較根據稅收和生活費用調整的工作機會。因此，我製作了\nhttps://budget-estimator.vercel.app/ 來做這件事。\n\n只是...",
      "title": "我建立了一個工作機會的比較工具/視覺器"
    }
  ]
}