{
  "author": "lsmod1",
  "the_new_excerpt": "If you are wondering if you should buy now and put a big part of your money in\nto get rich JUST DON'T.\n\nInstead put little every month regardless of the price. Like you would for your\nchildren / grandchildren.\n\nThat's DCA that's how you will be able to not get reck when China ban bitcoin\nagain.\n\nIt…",
  "original_created_utc": 1623096433,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もしあなたが、今すぐ購入してお金の大部分をつぎ込むべきかどうか迷っているなら\n金持ちになるためには、絶対にやめてください。\n\nその代わり、価格に関係なく毎月少しずつ入れていきましょう。自分の子供や孫のためにするように\n子供や孫のためにするように。\n\nそれがDCAであり、中国がビットコインを再び禁止したときにも、リックされない方法なのです。\nまた。\n\nそれは...",
      "title": "ビットコインは宝くじではなく貯金箱"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你想知道你是否应该现在购买，并把你的大部分资金投入到\n来致富，就不要了。\n\n相反，不管价格如何，每个月都要投入一点。就像你为你的\n子女/孙子。\n\n这就是DCA，当中国禁止比特币的时候，你就可以不被收割。\n再一次。\n\n它...",
      "title": "比特币是一个储蓄账户而不是彩票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你想知道你是否應該現在購買，並把你的大部分資金投入到\n來致富，就不要了。\n\n相反，不管價格如何，每個月都要投入一點。就像你爲你的\n子女/孫子。\n\n這就是DCA，當中國禁止比特幣的時候，你就可以不被收割。\n再一次。\n\n它...",
      "title": "比特幣是一個儲蓄賬戶而不是彩票"
    }
  ],
  "title": "Bitcoin is a savings account not a lottery ticket",
  "created_utc": 1623121746,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you are wondering if you should buy now and put a big part of your money in to get rich JUST DON&#39;T.</p>\n\n<p>Instead put little every month regardless of the price. Like you would for your children / grandchildren.</p>\n\n<p>That&#39;s DCA that&#39;s how you will be able to not get reck when China ban bitcoin again.</p>\n\n<p>It will pay in many years or not. but you won&#39;t stress loose your house or go back to live to your parent</p>\n</div><!-- SC_ON -->",
  "score": 321,
  "permalink": "/r/Bitcoin/comments/num68x/bitcoin_is_a_savings_account_not_a_lottery_ticket/",
  "subreddit": "Bitcoin",
  "id": "num68x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404878617
}