{
  "author": "consciousnes5",
  "the_new_excerpt": "BlackBerry stock: It’s still a sexy play in my books\n\nBlackBerrry’s collaboration with Amazon.com Web Services (AWS) is truly\nsomething to get really excited about, global agreement to develop and\nmarket BlackBerry's Intelligent Vehicle Data Platform, IVY. BlackBerry IVY is a\nscalable, cloud…",
  "original_created_utc": 1619435775,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ブラックベリー株。私の中ではまだセクシーなプレイです\n\nブラックベリーとアマゾン・ドットコム・ウェブ・サービス（AWS）とのコラボレーションは、本当にエキサイティングです。\nブラックベリーのIntelligent Vehicle Data Platform (IVY)の開発と販売でグローバルに合意したことは、本当に喜ばしいことです。\nブラックベリーのIVY（Intelligent Vehicle Data Platform）の開発・販売に関するグローバルな合意です。ブラックベリーIVYは\nスケーラブルな、クラウド...",
      "title": "ブラックベリー株はターンアラウンド・プレイの最有力候補"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "黑莓股票。在我的书中，它仍然是一个性感的游戏\n\n黑莓与亚马逊网络服务（AWS）的合作是真正的\n黑莓与亚马逊网络服务（AWS）的合作是真正值得兴奋的事情，全球协议开发和\n黑莓的智能车辆数据平台IVY。黑莓IVY是一个\n可扩展的云计算平台。",
      "title": "黑莓股票是一个顶级的转机游戏"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "黑莓股票。在我的書中，它仍然是一個性感的遊戲\n\n黑莓與亞馬遜網絡服務（AWS）的合作是真正的\n黑莓與亞馬遜網絡服務（AWS）的合作是真正值得興奮的事情，全球協議開發和\n黑莓的智能車輛數據平臺IVY。黑莓IVY是一個\n可擴展的雲計算平臺。",
      "title": "黑莓股票是一個頂級的轉機遊戲"
    }
  ],
  "title": "BlackBerry Stock Is a Top Turnaround Play",
  "created_utc": 1619469512,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>BlackBerry stock: It’s still a sexy play in my books</p>\n\n<p>BlackBerrry’s collaboration with Amazon.com Web Services (AWS) is truly something to get really excited about, global agreement to develop and market BlackBerry&#39;s Intelligent Vehicle Data Platform, IVY. BlackBerry IVY is a scalable, cloud-connected software platform that will allow automakers to provide a consistent and secure way to read vehicle sensor data, normalize it, and create actionable insights from that data both locally in the vehicle and in the cloud.  Automakers can use this information to create responsive in-vehicle services that enhance driver and passenger experiences.</p>\n\n<p>BlackBerry IVY addresses a critical data access, collection, and management problem in the automotive industry.  Modern cars and trucks are built with thousands of parts from many different suppliers, with each vehicle model comprising a unique set of proprietary hardware and software components. These components, which include an increasing variety of vehicle sensors, produce data in unique and specialized formats. The highly specific skills required to interact with this data, as well as the challenges of accessing it from within contained vehicle subsystems, limit developers’ abilities to innovate quickly and bring new solutions to market. BlackBerry IVY will solve for these challenges by applying machine learning to that data to generate predictive insights and inferences, making it possible for automakers to offer in-vehicle experiences that are highly personalized and able to take action based on those insights.</p>\n\n<p>BlackBerry IVY will support multiple vehicle operating systems and multi-cloud deployments in order to ensure compatibility across vehicle models and brands. It will build upon BlackBerry QNX’s capabilities for surfacing and normalizing data from automobiles and AWS’s broad portfolio of services, including capabilities for IoT and machine learning. BlackBerry IVY will run inside a vehicle’s embedded systems, but will be managed and configured remotely from the cloud. As a result, automakers will gain greater visibility into vehicle data, control over who can access it, and edge computing capabilities to optimize how quickly and efficiently the data is processed. With BlackBerry IVY’s integrated capabilities, automakers will be able to deliver new features, functionality, and performance to customers over the lifetime of their cloud-connected vehicles, as well as unlock new revenue streams and business models built on vehicle data.</p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/k8jnz4dg4iv61.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=332562ea2e475ec71455d52feb6aee9b907d454f\">https://preview.redd.it/k8jnz4dg4iv61.jpg?width=900&amp;format=pjpg&amp;auto=webp&amp;s=332562ea2e475ec71455d52feb6aee9b907d454f</a></p>\n\n<p>For instance, BlackBerry IVY could leverage vehicle data to recognize driver behavior and hazardous conditions such as icy roads or heavy traffic and then recommend that a driver enable relevant vehicle safety features such as traction control, lane-keeping assist, or adaptive cruise control. IVY could then provide automakers with feedback on how and when those safety features are used, allowing them to make targeted investments to improve vehicle performance. Additionally, drivers of electric vehicles could choose to share their car’s battery information with third-party charging networks to proactively reserve a charging connector and tailor charging time according to the driver’s current location and travel plans. BlackBerry IVY could also provide insights to parents of teenage drivers who may choose to receive customized notifications based on insights from vehicle sensors when the number of passengers in the vehicle changes, when the driver appears to be texting, distracted, or not observing speed limits, or when the vehicle occupancy level rises above the parents’ desired safety threshold. Similarly, parents of infants could receive a reminder to engage the child safety lock when the vehicle detects a child in the rear seat.</p>\n\n<p>BlackBerry IVY will enable automakers to compress the timeline to build, deploy, and monetize new in-vehicle applications and connected services across multiple vehicle brands and models. Instead of investing in one-off solutions that conform to the unique engineering of different vehicle models (as they do today), automakers using BlackBerry IVY will be able to leverage different types of data as common building blocks for new services that could work across a range of models. Automakers will be able to use the platform’s application programming interfaces (APIs) to share data and outputs with their software development teams, giving them the ability to innovate, while also protecting customer privacy and security by controlling whom can access vehicle and app data and at what level of detail.</p>\n\n<p>In addition, BlackBerry IVY will make it easier for automakers to collaborate with a wider pool of developers to accelerate creation of new offerings that deliver improved vehicle performance, reduced costs for maintenance and repairs, and added convenience. For instance, by analyzing real-time performance data, automakers could recognize the first signs of potentially faulty parts, deploy code to identify affected vehicles, notify impacted drivers, and perform targeted recalls. Automakers will be able to remotely deploy and update the software from the platform’s Cloud Console (a web interface for managing BlackBerry IVY) to continuously improve the functionality of the system.   </p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8mk13aoe4iv61.png?width=1200&amp;format=png&amp;auto=webp&amp;s=f1737028e26591e0c69a579ad9a47a78d3e30fdf\">https://preview.redd.it/8mk13aoe4iv61.png?width=1200&amp;format=png&amp;auto=webp&amp;s=f1737028e26591e0c69a579ad9a47a78d3e30fdf</a></p>\n\n<p>“Data and connectivity are opening new avenues for innovation in the automotive industry, and BlackBerry and AWS share a common vision to provide automakers and developers with better insights so that they can deliver new services to consumers,” said John Chen, Executive Chairman and CEO, BlackBerry. “This software platform promises to bring an era of invention to the in-vehicle experience and help create new applications, services, and opportunities without compromising safety, security, or customer privacy.  We are pleased to expand our relationship with AWS to execute this vision and deliver BlackBerry IVY.”</p>\n\n<p>“AWS and BlackBerry are making it possible for any automaker to continuously reinvent the customer experience and transform vehicles from fixed pieces of technology into systems that can grow and adapt with a user’s needs and preferences,” said Andy Jassy, CEO of Amazon Web Services, Inc. “Through this joint effort with BlackBerry, we will provide automakers with the insights, capabilities, agility, and speed they need to thrive in an increasingly connected world. As automakers seek to race ahead in their digital transformations, BlackBerry IVY empowers them to build their brands and set the standard for connected vehicle services across the automotive industry.”</p>\n\n<p>The future looks bright for BlackBerry</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rbpvhoue4iv61.png?width=986&amp;format=png&amp;auto=webp&amp;s=bedc33b6ebb3cdc8c9905e99e2aea9f50f8a3fb4\">https://preview.redd.it/rbpvhoue4iv61.png?width=986&amp;format=png&amp;auto=webp&amp;s=bedc33b6ebb3cdc8c9905e99e2aea9f50f8a3fb4</a></p>\n\n<p>&#x200B;</p>\n\n<p>I believe the collaboration on project IVY with Amazon Web Services (AWS) could evolve to become a major needle-mover for BlackBerry stock, as it continues to push toward meaningful organic growth to finally prove itself to the skeptical analysts that maintain their hold ratings and single-digit price targets.</p>\n\n<p>BlackBerry stock has collapsed, yet IVY is still happening, and contrarians should be as excited as ever as the company looks to spread its wings in the auto market, which may be on the cusp of exploding higher on the back of EVs (electric vehicles) and autonomous driving technology.</p>\n\n<p>Although the QNX business hasn’t recovered as quickly as most investors would have hoped, I still think BlackBerry stock is a great value bet for those willing to put up with turbulence for the next three to five years. Looking ahead to the post-pandemic environment and things are likely looking up for QNX and many other segments that have fallen under pressure due to COVID-19.</p>\n\n<p>Add IVY into the equation and I think BlackBerry may be shaping up to be one of the greatest Canadian turnaround stories of all time.</p>\n\n<p>TLDR</p>\n\n<p>Stay the course and put your trust in the hands of CEO John Chen, and I do think you’ll be happy with the rewards to be had over the next decade. The stock is likely to yield meaningful fruit over time.</p>\n\n<p>&#x200B;</p>\n\n<p>Not a financial Advisor etc..</p>\n</div><!-- SC_ON -->",
  "score": 1732,
  "permalink": "/r/wallstreetbets/comments/myvben/blackberry_stock_is_a_top_turnaround_play/",
  "subreddit": "wallstreetbets",
  "id": "myvben",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776220625
}