{
  "author": "HuskerNatChamps2020",
  "original_created_utc": 1646836409,
  "title": "A degen's summary of Biden's crypto executive order",
  "created_utc": 1646883040,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Today Joe Biden signed into effect an executive order directing federal agencies to coordinate their efforts at drafting crypto regulations. This is a first of its kinds executive order, and its going to take a while for these separate government agencies to draft their regulations.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re probably already sick of reading by now so lets get into the meat of the EO (executive order).&lt;/p&gt;\n\n&lt;p&gt;Preface:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;this EO will not outline specific positions that Biden wants, such as directing the SEC to take harsher penalties on rugging. He doesn&amp;#39;t want to seem pro or against crypto even though this EO is pretty pro crypto.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;One part of this EO is that it will direct the US Treasury department to create a report on the &amp;quot;future of money&amp;quot; including how the current financial system may not be right for some current consumer needs.&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;THE EXECUTIVE ORDER FOCUSES ON GROWING THE DIGIAL ASSET SECTOR SAFELY FOR CONSUMERS&lt;/strong&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;This executive order doesn&amp;#39;t create any laws or regulations. It simply forces government agencies who has been ignoring crypto to stop ignoring crypto.&lt;/strong&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;strong&gt;The EO is regarded as a &amp;quot;whole government&amp;quot; effort to regulate crypto and it focuses on 6 main goals:&lt;/strong&gt;&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;strong&gt;Consumer protection&lt;/strong&gt;: This is the chief goal of the EO and part will go to understanding the technology as well as the volatile micro and macro-economics of the crypto industry. A better understanding on the governments end will help the government better understand where the current popular financial system is failing some consumers. My opinion on this is that the government will plan on helping government agencies aid businesses in crypto adoption as an effort to lessen the massive volatility in crypto that has rekt so many people.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;financial stability&lt;/strong&gt;: this plays into the consumer protection part of the Executive Order. The president wants the financial sector to be less volatile. quoting the price pre-covid (10,300), November 2021 (70,000) and currently (38,000). Using this as a benchmark he wants government agencies to educate more people including themselves on why this volatility happens and how to help prevent this kind of instability through encouraged adoption.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;illicit uses&lt;/strong&gt;: I mean its a bunch of boomers. Did you expect them not to be scared of criminals using crypto LMAO. I&amp;#39;m sure they&amp;#39;re going to enact some laws that crack down on criminals using crypto which will then never be used, because they inherently cant. The EO also states that the DOJ and FBI each have their own crypto investigation units that need more funding. &amp;quot;The insufficiency of international implementation of anti-money laundering networks and frameworks with digital assets is the greatest vulnerability of these ecosystems the criminals are currently exploiting.&amp;quot; I mean c&amp;#39;mon this senior advisor to the president is basically saying that crypto&amp;#39;s worst problem is money laundering? that&amp;#39;s bullish AF.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;promoting responsible innovation&lt;/strong&gt;: senior advisors have said that crypto is creating thousands of jobs in a brand new industry. Innovation is a pivotal role in the American economy and the government does not want to be left behind when it comes to innovation.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;financial inclusion&lt;/strong&gt;: This exact thing has not really been defined but I can define it, because I want to. I&amp;#39;m assuming this aspect is related to the &amp;quot;future of money&amp;quot; publication by the Treasury as well as the future plans to evaluate the necessity of a &amp;quot;digital dollar&amp;quot; issued by the central banks. This will undoubtedly increase financial inclusion and level the playing field because some consumers are either scared or confused by crypto and less likely to adopt.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;U.S. Leadership&lt;/strong&gt;: This is more of an all encompassing part of the EO that is basically saying &amp;quot;we need all government agencies leadership to get on the bandwagon or we as a country will fail at the innovation we have whored ourselves out for since the reconstruction era.&amp;quot; The senior advisor was quoted saying, &amp;quot;We remain committed to working with allies in the broader digital asset community to shape the future of digital assets systems in a manner thats&amp;#39; inclusive, consistent with our Democratic values, and safeguard the integrity of the global financial system.&amp;quot;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;TL;DR: Biden signed a bullish ass executive order that begs every government agencies to stop ignoring crypto and create legislation/regulations that will protect the consumer, level the volatility, and create a level playing field for the average consumer. Citing the need for innovation as well as adoption. Digital dollar issuance is mentioned as well as a &amp;quot;future of Money&amp;quot; report by the US Treasury that will surely outline how other government agencies should look at crypto regulation standards.&lt;/p&gt;\n\n&lt;p&gt;edit: thanks to &lt;a href=\"/u/ZER0SE7ENONETH\"&gt;u/ZER0SE7ENONETH&lt;/a&gt; if anyone wants to read the full version &lt;a href=\"https://www.whitehouse.gov/briefing-room/presidential-actions/2022/03/09/executive-order-on-ensuring-responsible-development-of-digital-assets/\"&gt;here&lt;/a&gt; is a link he provided in the comments&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 320,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?auto=webp&amp;s=32ba56f14cb1b5e65116a9a1fb40c8ce37c585ae",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=1e6a1a09058a728467c838a3da551928e0cfd6dc",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=765a08f5be62e8a63d120257dd3a2f33015602fa",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=4271ab6efa59896070b846e6abc0513295f3c9ec",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=eacedf1618ef395a983aee164caf950ed6dd3917",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=4b9969e27c99dfe7c479764ed6241559826c76c6",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/spaDswURq9g_RyRhvXvYjrjKl3CSZoz5wiuHccbfWNk.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=17f04a6d14491d0f7e072ae8473730300f76eb2c",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "ZNmtnK_lKgHB3spQIpgDtNznEADE6oLEzeeSxD2gjRA"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ta93g8/a_degens_summary_of_bidens_crypto_executive_order/",
  "subreddit": "CryptoCurrency",
  "id": "ta93g8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Today Joe Biden signed into effect an executive order directing federal agencies\nto coordinate their efforts at drafting crypto regulations. This is a first of\nits kinds executive order, and its going to take a while for these separate\ngovernment agencies to draft their regulations.\n\nYou're…"
}