{
  "author": "TripleBrain",
  "the_new_excerpt": "Current Conditions of the Market:\n\nLet me be clear: this is not the typical conditions of the market where stocks\nfluctuate double and triple digit percentages per day. There’s a place for that\n- the casino. In recent weeks, herds of new traders are pouring into the trading\nscene hoping to get a…",
  "original_created_utc": 1612203353,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "市场的现状。\n\n让我说明一下：这不是典型的市场状况，在这里，股票\n每天波动两位数和三位数的百分比。有一席之地\n- 赌场。近几周来，成群结队的新交易者涌入交易\n现场希望得到一个...",
      "title": "对于刚接触投资的人来说。交易和管理策略的全面分解!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場的現狀。\n\n讓我說明一下：這不是典型的市場狀況，在這裏，股票\n每天波動兩位數和三位數的百分比。有一席之地\n- 賭場。近幾周來，成羣結隊的新交易者湧入交易\n現場希望得到一個...",
      "title": "對於剛接觸投資的人來說。交易和管理策略的全面分解!"
    }
  ],
  "title": "FOR EVERYONE NEW TO INVESTING: A COMPREHENSIVE BREAKDOWN OF TRADING AND MANIPULATION STRATEGIES!",
  "created_utc": 1612211693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Current Conditions of the Market:</strong></p>\n\n<p>Let me be clear: this is not the typical conditions of the market where stocks fluctuate double and triple digit percentages per day. There’s a place for that - the casino. In recent weeks, herds of new traders are pouring into the trading scene hoping to get a piece of the volatile market that has turned the rags to riches, or the other way around. The stock market as a whole, under normal conditions, moves gradually in both directions, guided by trends, innovation, speculation, earnings report, and financial changes. What we are in right now is a hysteria-filled environment that is risky for both veteran traders and novices. Any uninformed, reckless decision can produce different results - by chance. Be wise and do not let chance underlie your success or bankruptcy stories. Please do your research first before investing into anything and whatever you do, do not make the mistake of over-extending yourself with margin (brokerage-provided capital) that you cannot repay should things go south. People have and continue to make this fundamental mistake that will ruin them financially for years. Stock investments should be about long-term growth, stability, and supplemental to your income. Investments should give you access to the opportunity of financial freedom, but should not be your primary source for income. Do not listen to stock gurus and paid-only discord groups - they don’t make money from stocks, they make money from you. Lastly, this atypical market condition is the perfect storm for spontaneous “pump and dumps” where stocks become inflated, and based on fool’s theory or musical chairs (whichever you prefer), the last one that gets out gets burned. Be smart, be patient, do the research. </p>\n\n<p><strong>Basic Stock Jargons &amp; Short/Long Positions:</strong></p>\n\n<p><em>Long</em> - you’re buying and holding a stock with the intention for it to increase in value.</p>\n\n<p><em>Short</em> - you’re borrowing shares from a lender (brokerage, investment firm, individual investors), selling it to someone, and hoping to buy it back at a lower price. Your profit is the difference in the sell and buy back price. I’ll provide a real world example because this concept it a bit more complex:</p>\n\n<ul>\n<li>Person A is a share lender. They want to lend the share and get paid a small interest rate as compensation.</li>\n<li>Person B asks Person A to lend him that share temporarily. Person B does not pay anything upfront, but he promises to pay Person A in the form of interest over time.</li>\n<li>Person B finds a buyer Person C. Person C wants to buy a stock so it can go up. Person C is “long” on this stock. Person B, however, is short on this stock because he wants the value of the stock to go down.</li>\n<li>Person C pays Person B $10 for the stock. Now, Person C has spent $10, and Person B has gained $10. </li>\n<li>Two hypothetical situation happens now:\n\n<ul>\n<li>Scenario 1: Stock value increases to $15. Person C is now up $5 and he sells because he’s making nice gains. Person B needs to buy back that share at $15, but he only gained $10 profit initially. Now he needs to fork up $5 to buy back the share, and then return the share back to the lender + any interest accrued. In this scenario, the “short” lost money, the “long” gained money, and the “lender” made interest money. </li>\n<li>Scenario 2: Stock value decreases to $5. Person C is now down $5 and he sells to cut losses. Person B needs to buy back that share at $5, but he already has $10 in profit initially. Now he pays $5 for the share, leaving him still with $5 profit, and returns the share back to the lender + any interested accrued. In this scenario, the “short” made money, the “long” gained money, and the “lender” made interest money. </li>\n</ul></li>\n<li>The above scenarios help to show why “shorts” (typically hedge funds or experienced traders) might want to manipulate the stock price to go down. Hedge funds have an incredible amount of power in the market, which I will explain in a bit, and can often create serious price movements to invoke price action that benefits themselves. Shorts, therefore, have the opposite intention of longs. They want share prices to go down, and in the process, can bankrupt certain companies that rely on the stock market liquidity to stay afloat. In other words, when investors leave a stock because it is dropping in value, the company loses that money that they could have used to pay off debt, grow the business, develop new products, pay for expenses, etc. </li>\n</ul>\n\n<p><strong>Market Manipulation:</strong></p>\n\n<p>Market manipulation is not new to the scene. Investors have long known of the existence of stock market manipulation tactics, and every day, we may observe some levels of manipulation in specific stocks, specific categories or industries of stocks, or the entire market. Market manipulation is defined as any actions performed with the intention of moving a certain stock price in favor of the manipulator. In this case, these are the wealthy “whales” or hedge funds, both of which have enormous capital capable of shifting stock prices at alarming speeds. Keep in mind, not all hedge funds do this and not all hedge funds are “shorts”. Some are “neutral” and act as lenders to make money, some are “growth-based” and invest just like everyday traders with the intention of raising share prices, and others are “short” which are probably perceived to be the sadistic groups of the bunch. Below, I will be discussing how manipulation occurs and on different scales.</p>\n\n<p><strong>Manipulation Tactics on a Spectrum:</strong></p>\n\n<p>Market manipulation can happen in certain stock, sectors, or the entire market. There are probably far more types of manipulative tactics than we know, but I will describe the most basic types and the strategies behind it.</p>\n\n<p><em>Scenario 1:</em></p>\n\n<p>Let’s say a hedge fund just opened a short position on stock X. Stock X is rising in value because general investors see it as a potential growth stock. Hedge funds are not too excited about this increased share value, so they can “hedge” or protect themselves, by selling put options. When they sell puts, they are anticipating that the stock will continue to surge, which causes the puts to become worthless at expiration, but on the contrary, they will be collecting the “premium” or money paid upfront by traders that bought the put. At the same time, this hedge fund will slowly “cover”, or buy shares of Stock X, so that the increased value of the shares will offset the short position which is losing money. The manipulation here is by using the sheer amount of capital in hand to bolster the stock, both creating favorable conditions for the puts that they sold and the share that they purchased as cover. If they want to add another level of manipulation to this, they can also purchase call options, which will result in profit if the stock price goes up. In this scenario, hedge funds make money at the expense of put option buyers and other shorts that do not have manipulative power or capital to recreate this same strategy.</p>\n\n<p><em>Scenario 2:</em></p>\n\n<p>Let’s say a hedge fund just opened a short position on Stock X. Stock X is rising in value because general investors see it as a potential growth stock. This hedge fund does not want to risk extra capital to cover their short position (by buying shares, selling put options, or buying call options), so they try a different route. Keep in mind that hedge funds are typically heavily invested in many stocks and assets, meaning they have a lot of power in deciding the direction of many stocks that have potential to instill widespread fear across the entire market if it drops. Take for example, if Apple and Google began to hurl downwards, this can create panic in the market where everyday traders might sell their shares at a loss. This in turn might ripple through the market as other investors in other stocks are predicting a downward trajectory across the market since these big name stocks are losing value so rapidly. Conveniently enough, hedge funds own a lot of these big name “FANG” stocks.</p>\n\n<p> If I am a moderately sadistic hedge fund, I can sell off a large holding of shares (in the scale of multi millions or billions) that are in the same sector as Stock X, which would incite fear across the sector, creating panic sell offs. The price will drop sharply across the board, including Stock X, and the short position will produce big profits. Because this hedge fund sold off a large chunk of their shares at a good price, they can now cover their short position (essentially getting rid of it), and then buy up these same stocks that were let go earlier, only this time at a much cheaper price. The hedge fund has now made money not only on the short position, but now they got into the stock at a cheap price in which they can explore other manipulative tactics to bolster the price again. This can be done by encouraging analyst upgrades, publicizing “newly” purchased positions without disclosing the fact that they previously owned it, etc. </p>\n\n<p><em>Scenario 3:</em></p>\n\n<p>This one involves technology: algorithm trading (commonly referred to as algo trading). This one is a really intricately designed manipulative tactic that investors really have no way of getting around. Algorithm trading is the process of using high-speed super-computers and a team of traders to constantly monitor market activity and trade when opportunities arise. In this case, the hedge funds do not have to do any direct manipulation of the market, which makes this 100% legal. How this works is by taking advantage of how trading works and the time it takes for a trade to be made. For you general investors, we have mobile apps and web-based trading platforms to trade. When we like a stock, we have to go through the motion of inputting the stock ticker symbol, the amount of shares, the price we are willing to pay, hit submit, and confirm the trade. For hedge funds using algorithm trading, all this is done autonomously, which makes submission of an order several magnitudes quicker. When an order is submitted, it goes through a brokerage (Fidelity, Webull, ETrade, TDA, RH, etc.) and the data is rerouted to a clearing house (intermediate party that verifies and processes the trade). Clearing houses are responsible for making sure your orders are filled, but they take it on a first come first serve basis. So if a stock is moving quickly, hedge funds have a serious edge in getting in cheaper and faster as well as getting out higher and faster. </p>\n\n<p>Algorithm trading is integratable as part of the buying and selling strategies mentioned in the two previous scenarios, which is why they can almost guarantee profit. Algorithm trading also uses a lot of data in their backbone to determine the trades that have a high chance of profitability, and it acts on various factors such as volatility, volume, interest activity, news, etc. In some cases, these algorithms can be set to do some extremely sadistic things. I’ll start by talking about “market orders” vs “limit orders”. Before you make a trade on your brokerage, you will notice an option that says “market order” or “limit order”. Market orders are an agreement that you will purchase the stock or option contract at the best price in the market in the momentary space in time. There is of course a huge risk to that because in that short moment in time, there may not be anyone selling at a good price, and instead, some people might set sell limits at ridiculous prices. For example, some people set a sell limit at $1000 for GME. If you did a market order, and you get really unlucky, you might end up snagging a share for $1000 each, when the actual share value might be $300. However, when you set a “limit order”, you are agreeing to buy a share at a maximum price that you designated. </p>\n\n<p>In the event that a hedge fund siphons a ton of shares of a company, the algorithm can be set to sell these shares at a ridiculous sell limit. Remember, when they buy or sell, it’s processed significantly faster at the clearing houses, so if you’re that one unlucky trader that went for a market order on a stock, you might end up purchasing it at a huge premium set by the hedge funds themselves. Moral of the story: DO NOT PURCHASE AS MARKET ORDER - ALWAYS PURCHASE AT LIMIT ORDER. </p>\n</div><!-- SC_ON -->",
  "score": 1547,
  "permalink": "/r/stocks/comments/la9w0j/for_everyone_new_to_investing_a_comprehensive/",
  "subreddit": "stocks",
  "id": "la9w0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518539385
}