{
  "author": "The_Safe_For_Work",
  "original_created_utc": 1653999498,
  "title": "How do people in \"walkable cities\" who have to rely on public transportation go grocery shopping? Do people regularly lug several bags of groceries down the street or on the subway? Do you just buy one meal at a time?",
  "created_utc": 1654029642,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see people often lamenting the lack of &amp;quot;walkable cities&amp;quot;.  I honestly would like to know how people in such a place handle grocery shopping.  Most people out in my area, suburban, buy several days or weeks worth of groceries and other heavy items, laundry soap, cat litter, etc.  How is this handled without a car?  Do you just buy a couple items a day that are easy to lug around?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/v1oyn1/how_do_people_in_walkable_cities_who_have_to_rely/",
  "subreddit": "NoStupidQuestions",
  "id": "v1oyn1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see people often lamenting the lack of \"walkable cities\". I honestly would\nlike to know how people in such a place handle grocery shopping. Most people out\nin my area, suburban, buy several days or weeks worth of groceries and other\nheavy items, laundry soap, cat litter, etc. How is this handled…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "よく「歩ける街」がないと嘆いている人を見かけます。正直なところ\nそんな街の人たちは、どうやって買い物をするのでしょうか。ほとんどの人は\n私の住む郊外では、食料品や洗濯石鹸、猫砂など重いものを数日分、数週間分購入します。\n洗濯石鹸や猫砂など、重いものを買います。これはどのように処理されているのでしょうか...",
      "title": "公共交通機関に頼らざるを得ない「歩きやすい街」の人々は、どのように食料品を買いに行くのでしょうか。人々は定期的に食料品の入った袋を何個も抱えて通りや地下鉄を走っているのでしょうか？一度に一食分を買うだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到人们经常感叹缺乏 \"可步行的城市\"。说实话，我很想知道在这样的地方，人们是如何处理买菜的问题的。\n想知道在这样的地方人们是如何处理买菜的。在我所在的郊区，大多数人\n在我所在的地区，即郊区，都会买几天或几周的杂货和其他物品。\n重的物品，洗衣粉，猫砂等。这方面是如何处理的...",
      "title": "在 \"可步行的城市 \"中，必须依靠公共交通的人们是如何买菜的？人们是否经常拖着几袋杂货在街上或地铁上行走？你每次只买一餐吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到人們經常感嘆缺乏 \"可步行的城市\"。說實話，我很想知道在這樣的地方，人們是如何處理買菜的問題的。\n想知道在這樣的地方人們是如何處理買菜的。在我所在的郊區，大多數人\n在我所在的地區，即郊區，都會買幾天或幾周的雜貨和其他物品。\n重的物品，洗衣粉，貓砂等。這方面是如何處理的...",
      "title": "在 \"可步行的城市 \"中，必須依靠公共交通的人們是如何買菜的？人們是否經常拖着幾袋雜貨在街上或地鐵上行走？你每次只買一餐嗎？"
    }
  ]
}