{
  "author": "JJVMT",
  "original_created_utc": 1643228269,
  "title": "When and how did \"rocket science\" become the discipline we invoke to dismiss, by comparison, the complexity or difficulty of a discipline or task at hand in the English-speaking world? Perhaps more interestingly, what discipline served that purpose before rockets, as we know them, were a thing?",
  "created_utc": 1643266667,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Indeed, I could easily imagine a frustrated master, circa 1700, scolding his apprentice with something like: &amp;quot;&amp;#39;Tis not alchemy, egad! Just put the spoke in the accursed wheel!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sdfb5s/when_and_how_did_rocket_science_become_the/",
  "subreddit": "AskHistorians",
  "id": "sdfb5s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Indeed, I could easily imagine a frustrated master, circa 1700, scolding his\napprentice with something like: \"'Tis not alchemy, egad! Just put the spoke in\nthe accursed wheel!\"",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに、1700年頃、イライラした親方が、親方を叱りつける姿が容易に想像できます。\nというようなことを弟子に言う。「錬金術じゃないんだからさ。\n呪われた車輪だ！\"",
      "title": "英語圏で、ある学問や仕事の複雑さや難しさを比較するために、「ロケット科学」を持ち出すようになったのはいつからか、またどのようにしてか。さらに興味深いことに、私たちが知っているようなロケットが存在する以前には、どのような学問がそのような目的を持っていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "事实上，我可以很容易地想象，在1700年左右，一个沮丧的师傅在责骂他的\n他的学徒这样说。\"这不是炼金术，天哪！只要把辐条放进去就可以了。\n把轮子放进去！\"",
      "title": "在英语世界中，\"火箭科学 \"何时以及如何成为我们援引的学科，以通过比较来否定一门学科或手头任务的复杂性或难度？也许更有趣的是，在我们所知的火箭出现之前，是什么学科起到了这种作用？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "事實上，我可以很容易地想象，在1700年左右，一個沮喪的師傅在責罵他的\n他的學徒這樣說。\"這不是鍊金術，天哪！只要把輻條放進去就可以了。\n把輪子放進去！\"",
      "title": "在英語世界中，\"火箭科學 \"何時以及如何成爲我們援引的學科，以通過比較來否定一門學科或手頭任務的複雜性或難度？也許更有趣的是，在我們所知的火箭出現之前，是什麼學科起到了這種作用？"
    }
  ]
}