{
  "author": "Environmental_Point3",
  "original_created_utc": 1635730748,
  "title": "You guys predicted the red September as well as Pumptober... so what's in store for November?",
  "created_utc": 1635770228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m a new investor and only recently I&#39;ve been learning about market cycles and trends, there&#39;s so much to learn! One things that has become apparent is there are models and patterns that savvy investors have seen over the years; and although the crypto universe is the wild wild west and anything can happen - some of you seem to get it right, time and time again!</p>\n\n<p>The last few months of crypto have been crazy and that&#39;s an understatement. I only started my crypto journey in May and it began with me watching a complete sea of red for my first few months investing.  The helpful people of this sub taught me not to panic and helped me forge my diamond hands. Reddit has been my home through this journey and I&#39;ve learned so much about investing, and I&#39;m oh so thankful for it.</p>\n\n<p>- You told me to DCA in and hold my bags for incoming pumps mid-year... which came and turned my sadly all-red folio into a nice green.<br/>\n- You told me to be wary of September as its traditionally a bad month for crypto...which was correct. I took my profits early and held....waiting for October.<br/>\n- You told me that October would bring pumps like we&#39;d never seen... and many ATH were broken. Pumptober was beautiful, and a nice insight into what a &quot;bull market&quot; is like.<br/>\n- Only thing that has been <em>wrong</em> so far is that you told me to be wary of SHIBA and I missed out on 10x&#39;ing my money.</p>\n\n<p>So I ask, oh wise members of the cryptocurrency sub.... what should I come to expect from November?</p>\n\n<p>A giant sell-off after Pumptober? MORE pumps? A new dog-themed coin in the top 10? I&#39;d like to acknowledge that it is fair to say we don&#39;t know shit about fuck, but I&#39;m very interested in what you guys have to think!</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/qk3l6p/you_guys_predicted_the_red_september_as_well_as/",
  "subreddit": "CryptoCurrency",
  "id": "qk3l6p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm a new investor and only recently I've been learning about market cycles and\ntrends, there's so much to learn! One things that has become apparent is there\nare models and patterns that savvy investors have seen over the years; and\nalthough the crypto universe is the wild wild west and anything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は投資家としては新参者で、最近になって市場のサイクルやトレンドについて学んでいます。\nトレンドについて学んでいますが、学ぶことはたくさんあります。学ぶことがたくさんあります！明らかになってきたことのひとつは\n熟練した投資家が長年にわたって見てきたモデルやパターンがあるということです。\n暗号の世界はワイルド・ワイルド・ウェストであり、何でもありますが...。",
      "title": "あなた方は9月の赤、そしてパンプトーバーを予想していましたが、では11月は何があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个新的投资者，最近才开始了解市场周期和趋势。\n趋势，有很多东西需要学习! 有一件事变得很明显，那就是有\n精明的投资者多年来已经看到了一些模型和模式；以及\n尽管加密货币世界是狂野的西部，任何事情都...",
      "title": "你们预测了红色的9月以及Pumptober......那么11月会有什么变化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個新的投資者，最近纔開始瞭解市場週期和趨勢。\n趨勢，有很多東西需要學習! 有一件事變得很明顯，那就是有\n精明的投資者多年來已經看到了一些模型和模式；以及\n儘管加密貨幣世界是狂野的西部，任何事情都...",
      "title": "你們預測了紅色的9月以及Pumptober......那麼11月會有什麼變化？"
    }
  ]
}