{
  "author": "velocipedic",
  "original_created_utc": 1638232337,
  "title": "Don’t just invest in crypto. You should also invest in yourself.",
  "created_utc": 1638243051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve recently seen a few posts where people are saying that crypto is the “only way” out of their “dead end” or “low paying” job. What they’re describing is a lottery ticket. Crypto has the potential to change lives, but it’s still ultimately a gamble. A “bet” on yourself will almost always pay off, by comparison, and the easiest way to do that is to “DCA into yourself.”</p>\n\n<p>Spend some money (or your crypto gains) on finishing that degree or try some trade school classes. If you don’t have money, spend some time today reading about something new or trying a new hobby/skill. If you learn a few new skills, and then keep at it, then before you know it they’ve piled up and you can leave that dead-end job or you can request higher pay. </p>\n\n<p>Even if you spend a couple thousand dollars on a new skill, it’ll pay back tens of thousands of dollars as you get better at it… if not hundreds of thousands. The ROI on that is insane!</p>\n\n<p><strong>YOU</strong> should be the investment in your life with the best returns, <strong>NOT CRYPTO</strong>. Keep your head up and don’t stop DCA’ing into yourself.</p>\n\n<p>Edit to add: “invest in yourself even if you’re a shitcoin. Sometimes a shitcoin can pay out.”</p>\n</div><!-- SC_ON -->",
  "score": 337,
  "permalink": "/r/CryptoCurrency/comments/r5a1wl/dont_just_invest_in_crypto_you_should_also_invest/",
  "subreddit": "CryptoCurrency",
  "id": "r5a1wl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve recently seen a few posts where people are saying that crypto is the “only\nway” out of their “dead end” or “low paying” job. What they’re describing is a\nlottery ticket. Crypto has the potential to change lives, but it’s still\nultimately a gamble. A “bet” on yourself will almost always pay off,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、「行き詰まり」や「低賃金」の仕事から抜け出すには、暗号が「唯一の方法」だと言っている人の投稿をいくつか見ました。\n低賃金の仕事から抜け出すための「唯一の方法」だと言っている人がいます。彼らが言っているのは、宝くじのようなものです。\n宝くじのようなものです。暗号は人生を変える可能性がありますが、最終的にはギャンブルです。\n最終的にはギャンブルです。自分への「賭け」は、ほとんどの場合、成果を上げることができ...",
      "title": "暗号への投資だけではありません。自分自身にも投資すべきです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近看到一些帖子，人们说加密货币是摆脱 \"死胡同 \"或 \"低薪 \"工作的 \"唯一途径\"。\n摆脱 \"死胡同 \"或 \"低薪 \"工作的 \"唯一途径\"。他们所描述的是一种\n彩票。加密货币有可能改变生活，但它仍然是\n最终是一场赌博。对自己的 \"赌注 \"几乎总是会得到回报，...",
      "title": "不要只投资于加密货币。你也应该投资于你自己。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近看到一些帖子，人們說加密貨幣是擺脫 \"死衚衕 \"或 \"低薪 \"工作的 \"唯一途徑\"。\n擺脫 \"死衚衕 \"或 \"低薪 \"工作的 \"唯一途徑\"。他們所描述的是一種\n彩票。加密貨幣有可能改變生活，但它仍然是\n最終是一場賭博。對自己的 \"賭注 \"幾乎總是會得到回報，...",
      "title": "不要只投資於加密貨幣。你也應該投資於你自己。"
    }
  ]
}