{
  "author": "Wiardv",
  "original_created_utc": 1635582107,
  "title": "Dogelon mars is in the top 100 now? I'm out",
  "created_utc": 1635590312,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Another dog coin in the top 100? Wtf. And it also has the most ridiculous name ever. It&#39;s the kind of name you would pick if you wanted to make a piece of shitcoin that no one would buy. Dogelon Mars, what is next? CumElonSafeRocket?</p>\n\n<p><strong>And no, I won&#39;t give in and put all my money in memecoins and no, I don&#39;t feel like I am missing out.</strong> But is this what the space has turned into? People are just throwing their money at the most ridiculous coins now.</p>\n\n<p>This is one of the reasons why I am looking forward to the bear market. That usually gets rid of all these shitcoins. </p>\n\n<p>Of course, you can buy whatever you want. I am not here to judge you. But just pump Chainlink instead please. That can also be a lot of fun. Or we can change the name to ChainDog if you like that more</p>\n</div><!-- SC_ON -->",
  "score": 449,
  "permalink": "/r/CryptoCurrency/comments/qix2vc/dogelon_mars_is_in_the_top_100_now_im_out/",
  "subreddit": "CryptoCurrency",
  "id": "qix2vc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Another dog coin in the top 100? Wtf. And it also has the most ridiculous name\never. It's the kind of name you would pick if you wanted to make a piece of\nshitcoin that no one would buy. Dogelon Mars, what is next? CumElonSafeRocket?\n\nAnd no, I won't give in and put all my money in memecoins and no,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "100位以内にまた犬のコインが？驚いたな。そして、これまでで最も馬鹿げた名前を持っています。\n今までにない。誰も買わないようなクソコインを作りたいときに選ぶような名前だ。\n誰も買わないようなクソコインを作るときに選ぶような名前だ。Dogelon Mars、次は何だ？CumElonSafeRocket？\n\n屈して全財産をmemecoinに入れたりはしないし...",
      "title": "ドゲロン・マーズが今、トップ100に入っている？抜けた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前100名中的另一枚狗币？Wtf。而且它还有一个最可笑的名字\n的名字。如果你想做一个没人愿意买的垃圾币，你就会取这样的名字。\n如果你想做一个没人愿意买的狗屎币，你就会选这种名字。Dogelon Mars，接下来是什么？CumElonSafeRocket？\n\n不，我不会屈服，把我所有的钱都放在memecoins上，不，...",
      "title": "多吉隆火星现在进入了前100名？我不在"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前100名中的另一枚狗幣？Wtf。而且它還有一個最可笑的名字\n的名字。如果你想做一個沒人願意買的垃圾幣，你就會取這樣的名字。\n如果你想做一個沒人願意買的狗屎幣，你就會選這種名字。Dogelon Mars，接下來是什麼？CumElonSafeRocket？\n\n不，我不會屈服，把我所有的錢都放在memecoins上，不，...",
      "title": "多吉隆火星現在進入了前100名？我不在"
    }
  ]
}