{
  "author": "GodlordHerus",
  "original_created_utc": 1637038894,
  "title": "We can go down another -20% and be in a bullish trend",
  "created_utc": 1637066163,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There must be a lot of new people on the sub due to all the panic posts</p>\n\n<p>This isn&#39;t a crash. It isn&#39;t even a full  correction yet. </p>\n\n<p>Take out your weekly BTC and ETH chart all the way back to 2017. The average BTC correction is -20% to -30%. A crash is -40% to -60% </p>\n\n<p>Currently we just went below the daily 20 EMA about -14% from the ATH and are at prices from the start of the month. I&#39;m still up 38% from Nov 1st  in my portfolio and most should be too. Unless you have been playing with leverage and Meme-coins </p>\n\n<p>Personally want another -10% to -15% to load up some LPT below $50. </p>\n\n<p>Not saying this can&#39;t become a crash; but I would only call it that after we drop below $52,000.00 and a bear below $45,000.00</p>\n\n<p>Imagine a $45,000.00 BTC a bear</p>\n\n<p>Edit: </p>\n\n<p>You dirty bastards you drop everything but the coin I want. Just opened up my Acc and see everything is in buy zones but LPT. Down -4%. I want it at least -15%</p>\n</div><!-- SC_ON -->",
  "score": 219,
  "permalink": "/r/CryptoCurrency/comments/qv00o2/we_can_go_down_another_20_and_be_in_a_bullish/",
  "subreddit": "CryptoCurrency",
  "id": "qv00o2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There must be a lot of new people on the sub due to all the panic posts\n\nThis isn't a crash. It isn't even a full correction yet.\n\nTake out your weekly BTC and ETH chart all the way back to 2017. The average BTC\ncorrection is -20% to -30%. A crash is -40% to -60%\n\nCurrently we just went below the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パニック的な書き込みが多いため、サブの新規参入者が多いのでは？\n\nこれはクラッシュではありません。まだ完全な調整でもない。\n\n2017年までさかのぼって、BTCとETHの週足チャートを取り出してみましょう。BTCの平均的な\n修正は-20%から-30%。暴落は-40％～-60％です。\n\n現在、私たちはちょうどその下に行きました...",
      "title": "あと-20％下がると強気のトレンドになることもある"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "由于所有的恐慌性帖子，子上一定有很多新的人。\n\n这不是一个崩溃。它甚至还不是一个全面的修正。\n\n拿出你的BTC和ETH周线图，一直追溯到2017年。BTC的平均\n修正是-20%到-30%。崩溃是-40%到-60%。\n\n目前我们刚刚跌破了...",
      "title": "我们可以再下跌-20%，并处于一个看涨的趋势中"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "由於所有的恐慌性帖子，子上一定有很多新的人。\n\n這不是一個崩潰。它甚至還不是一個全面的修正。\n\n拿出你的BTC和ETH周線圖，一直追溯到2017年。BTC的平均\n修正是-20%到-30%。崩潰是-40%到-60%。\n\n目前我們剛剛跌破了...",
      "title": "我們可以再下跌-20%，並處於一個看漲的趨勢中"
    }
  ]
}