{
  "author": "vgambhir",
  "the_new_excerpt": "Recent interview of Cathie Wood on CNBC (search YouTube for \"I love this setup,\nrotation is good news\" to find video) got my head scratching around the math she\njust did in her statements. Back in February she said she expects 15% YoY\ncompounded returns in next 5 years when ARK funds (say ARKK) was…",
  "original_created_utc": 1620431992,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CNBCでのキャシー・ウッドの最近のインタビュー（YouTubeで \"I love this setup,\n回転は良いニュースだ」で検索）は、彼女の発言の中で行われた計算に頭を悩ませました。\n頭を悩ませました。2月に彼女は、今後5年間で前年比15％の複利リターンを期待すると言った。\n今後5年間で前年比15％の複利効果を期待すると言っていましたが、アークファンド（仮にARKKとします）は...",
      "title": "キャシー・ウッドの予測リターンの計算を理解するのに役立ちます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近Cathie Wood在CNBC的采访（在YouTube上搜索 \"我喜欢这种设置。\n搜索YouTube上的 \"我喜欢这种设置，旋转是个好消息 \"找到视频）让我对她在声明中的数学问题感到困惑。\n在她的声明中做了一些计算。早在2月份，她说她预计未来5年的年均复合收益率为15%。\n未来5年的复利回报，当时ARK基金（比如说ARKK）是...",
      "title": "帮助我理解凯西-伍德对她的预测收益的计算方法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近Cathie Wood在CNBC的採訪（在YouTube上搜索 \"我喜歡這種設置。\n搜索YouTube上的 \"我喜歡這種設置，旋轉是個好消息 \"找到視頻）讓我對她在聲明中的數學問題感到困惑。\n在她的聲明中做了一些計算。早在2月份，她說她預計未來5年的年均複合收益率爲15%。\n未來5年的複利回報，當時ARK基金（比如說ARKK）是...",
      "title": "幫助我理解凱西-伍德對她的預測收益的計算方法"
    }
  ],
  "title": "Help me understand Cathie Wood's math on her projected returns",
  "created_utc": 1620443007,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recent interview of Cathie Wood on CNBC (search YouTube for &quot;I love this setup, rotation is good news&quot; to find video) got my head scratching around the math she just did in her statements. Back in February she said she expects 15% YoY compounded returns in next 5 years when ARK funds (say ARKK) was around 140 (down from 160 high) which now slid to 110 this week in May.</p>\n\n<p>She said in that CNBC interview &quot;Nothing has changed but the price&quot; and now expects 25-30% YoY compounded returns in next 5 years.</p>\n\n<p>So by simple math </p>\n\n<p>140*(1.15<sup>5)</sup> = 281 back then</p>\n\n<p>Now she&#39;s promising : between</p>\n\n<p>110*(1.25<sup>5)</sup> = 335</p>\n\n<p>and 110*(1.3<sup>5)</sup> = 408</p>\n\n<p>That&#39;s almost 20-50% higher but if nothing has changed then how does the number grow so much more in end result ? I don&#39;t follow the math or logic here.</p>\n\n<p>Also, let&#39;s say give here benefit of doubt and say back in February she meant ARK price numbers that were in Jan 21 for YoY growth of 15% but then price was even lower between 120-140. So I don&#39;t know if she&#39;s bluffing (I&#39;m gonna guess saving her skin and fund outflows) and taking us for a ride or is she really onto something that we don&#39;t know ?</p>\n\n<p>If nothing has changed but the price then how does your model give these numbers ? Am I to assume these companies are growing faster than ever that their prices will skyrocket even faster ? Is there any proof ?</p>\n</div><!-- SC_ON -->",
  "score": 216,
  "permalink": "/r/investing/comments/n7cmlw/help_me_understand_cathie_woods_math_on_her/",
  "subreddit": "investing",
  "id": "n7cmlw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994596
}