{
  "author": "2443222",
  "the_new_excerpt": "Palantir Demo Day was recently steamed yesterday.\n\nHere is what I got out of it.\n\nTheir Foundry software can literally be used in any case depending on the data\nyou provide it. No code interface provide easily customizable dashboard to any\nsituation that the company's faces. It translate any…",
  "original_created_utc": 1611743889,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近昨天蒸了Palantir Demo Day。\n\n以下是我的收获。\n\n他们的Foundry软件在任何情况下都可以根据数据的不同而使用。\n你提供它。无代码接口提供易于定制的仪表盘给任何\n公司所面临的形势。它翻译任何...",
      "title": "我从Palantir演示日得到了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近昨天蒸了Palantir Demo Day。\n\n以下是我的收穫。\n\n他們的Foundry軟件在任何情況下都可以根據數據的不同而使用。\n你提供它。無代碼接口提供易於定製的儀表盤給任何\n公司所面臨的形勢。它翻譯任何...",
      "title": "我從Palantir演示日得到了什麼？"
    }
  ],
  "title": "What I got out of Palantir Demo Day",
  "created_utc": 1611763955,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Palantir Demo Day was recently steamed yesterday.</p>\n\n<p>Here is what I got out of it.</p>\n\n<p>Their Foundry software can literally be used in any case depending on the data you provide it. No code interface provide easily customizable dashboard to any situation that the company&#39;s faces. It translate any data/model into knowledge that can be used to make decisions. Their ontology and simulation frame can be used with real-time data coming from different users from different departments to make real-time decision.</p>\n\n<p>Think of Foundry as an Adobe photoshop or Unity game engine but instead of editing photo and making games it provide you with a overview of how your organization is running in real-time. The level of details and what you want to do is used on how you customize the software to your specific need. So basically is an editing tools used abstract away the hard stuff of data/model/simulation by providing an easy to use interface just like how Photoshop and Unity make it easier to edit your photo and make games.</p>\n\n<p>The possibility of foundry is endless it all depends on how you apply and customize the software to your need, which is done by the end-user/client.</p>\n\n<p>Gotham looks straight out of a sci-fi FPS video game with AI/ML capabilities. Enough Said.</p>\n\n<p>Apollo is what will allow Palantir to massively scale their business. It is about to provide feature delivery, security updates, and system configurations, no matter where in the world they are and in no matter what devices, such as drones, submarines, tanks, etc. Apollo basically turned Palantir into a SaaS company that provide efficiently+security+reliable+scalability. Also Apollo support multi-cloud capabilities where you can move data from public cloud, such as google cloud, AWS, AZure to-and-from private cloud to-and-from hybrid cloud to-and-from classified environments seamlessly. Apollo also allow Palantir to go where no Saas had gone before, because it is still able to provide a SaaS like feature through challenging physical conditions or low-bandwidth environment like inside of submarines and humvee.</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/investing/comments/l61uln/what_i_got_out_of_palantir_demo_day/",
  "subreddit": "investing",
  "id": "l61uln",
  "is_self": true,
  "media": null,
  "is_video": false
}