{
  "author": "JustDownInTheMines",
  "original_created_utc": 1629997352,
  "title": "How Truly Bad Is DOGE's Infinite Inflation And Tokenomics? Let's Look",
  "created_utc": 1630038991,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know we love to bash Doge here, and I&#39;m with that. I&#39;m <em>not</em> a fan of the coin and don&#39;t recommend it to people. HOWEVER, it is important to get every side of an argument, so I hope to take the infinite inflation argument and put it to the test.</p>\n\n<p>Really how bad is Doge&#39;s infinite inflation?</p>\n\n<p>Dogecoin is mined at a rate of <strong>10,000 DOGE per minute</strong>, which results in <strong>14,400,000 DOGE</strong> created <strong>per day</strong>. <strong>Yearly, 5,256,000,000</strong> Coins are added to the supply. Though this looks like a massive number, how does it compare to Doge&#39;s current Circulating Supply?</p>\n\n<p>Doge right now rounded up has a circulating supply of <strong>131 Billion DOGE</strong>. If we were to add these newly minted coins (making the <strong>circulating supply 136,256,000,000</strong>), <strong>3.85% DOGE</strong> is added to the supply in a years time. Because there will always be <strong>10,000 DOGE</strong> added per minute, the % rate of new Doge created will continuously go down. So how about the years that follow?</p>\n\n<ul>\n<li><strong>2021-2022 - 3.85%</strong></li>\n<li><strong>2022-2023 - 3.71%</strong></li>\n<li><strong>2023-2024 - 3.58%</strong></li>\n<li><strong>2024-2025 - 3.45%</strong></li>\n<li><strong>2025-2026 - 3.34%</strong></li>\n<li><strong>2026-2027 - 3.23%</strong></li>\n<li><strong>2027-2028 - 3.13%</strong></li>\n<li><strong>2028-2029 - 3.03%</strong></li>\n</ul>\n\n<p>In 8 years, we will see Doge very slowly drop to around 3% inflation, and will continue to lower as long as it uses this system.</p>\n\n<p>DOGE&#39;s only use-case argument is as a store of value to be used for transactions. In other words, it wants to compete with fiat currencies to be used in stores (not as an investment). Do you believe with its current inflation rate that this is possible?</p>\n\n<p>Personally, I&#39;m not into Doge and do not believe it to be a strong investment. But maybe we over-hype the infinite inflation argument if its use-case argument is as a transactional crypto. What do you guys think?</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/pc3q30/how_truly_bad_is_doges_infinite_inflation_and/",
  "subreddit": "CryptoCurrency",
  "id": "pc3q30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know we love to bash Doge here, and I'm with that. I'm not a fan of the coin\nand don't recommend it to people. HOWEVER, it is important to get every side of\nan argument, so I hope to take the infinite inflation argument and put it to the\ntest.\n\nReally how bad is Doge's infinite…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここではDogeを叩くのが好きなのは知っていますし、私もそれに賛成です。私はこのコインのファンではありません\n人に勧めたりはしません。しかし、議論のあらゆる側面を把握することは重要です。\nなので、私は無限インフレーションの議論を試してみたいと思います。\n試してみたいと思います。\n\n果たしてDogeの無限はどれほど悪いのか...。",
      "title": "DOGEの無限インフレーションとトケノミクスはどれだけ本当に悪いのか？見てみよう"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我们喜欢在这里抨击Doge，我也是这么认为的。我并不喜欢这枚硬币\n也不向人们推荐它。但是，重要的是，要了解到硬币的每一面。\n因此，我希望把无限膨胀的论点，并把它放在\n测试。\n\n真的，Doge的无限膨胀有多糟糕...",
      "title": "DOGE的无限通货膨胀和代币经济学到底有多糟？让我们看看"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我們喜歡在這裏抨擊Doge，我也是這麼認爲的。我並不喜歡這枚硬幣\n也不向人們推薦它。但是，重要的是，要了解到硬幣的每一面。\n因此，我希望把無限膨脹的論點，並把它放在\n測試。\n\n真的，Doge的無限膨脹有多糟糕...",
      "title": "DOGE的無限通貨膨脹和代幣經濟學到底有多糟？讓我們看看"
    }
  ]
}