{
  "author": "theimmortalpotato",
  "original_created_utc": 1637685549,
  "title": "India to ban most of the major cryptocurrencies.",
  "created_utc": 1637714811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So there&#39;s rumor going on right now that India is going to introduce a bill to ban most of the crypto currencies in its winter parliament session. It is also listed in the list of discussions officially released so there&#39;s a high chance of being true.</p>\n\n<p>So now i turn to you guys for some advice.</p>\n\n<p>I have most of my crypto on binance,being staked. Including ETH. Some more on trust wallet on various defi protocols, again earning yields and stuff.</p>\n\n<p>In case this actually goes through what should be the steps i should take. I don&#39;t wanna cash out, not in the next 10 years. Should I transfer all of my portfolio to a hard wallet? They can&#39;t really do anything about that right? Or Binance will still continue to work in such cases? Anything...</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/CryptoCurrency/comments/r0h96j/india_to_ban_most_of_the_major_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "r0h96j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So there's rumor going on right now that India is going to introduce a bill to\nban most of the crypto currencies in its winter parliament session. It is also\nlisted in the list of discussions officially released so there's a high chance\nof being true.\n\nSo now i turn to you guys for some advice.\n\nI…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、噂になっているのは、インドが冬の議会で、ほとんどの暗号通貨を禁止する法案を提出するということです。\n噂によると、インドは冬の議会でほとんどの暗号通貨を禁止する法案を提出するそうです。それは、公式に発表された\n公式に発表された議論のリストにも掲載されているので、高確率で\n事実である可能性は高いでしょう。\n\nそこで、皆さんにアドバイスをお願いしたいと思います。\n\nI...",
      "title": "インド、主要な暗号通貨のほとんどを禁止へ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，现在有传言说，印度将提出一项法案，以禁止大部分的毒品。\n在其冬季议会会议上禁止大多数加密货币。这也是\n被列入正式发布的讨论名单，所以有很大的机会\n是真的。\n\n所以现在我转向你们寻求一些建议。\n\nI...",
      "title": "印度将禁止大多数主要的加密货币。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，現在有傳言說，印度將提出一項法案，以禁止大部分的毒品。\n在其冬季議會會議上禁止大多數加密貨幣。這也是\n被列入正式發佈的討論名單，所以有很大的機會\n是真的。\n\n所以現在我轉向你們尋求一些建議。\n\nI...",
      "title": "印度將禁止大多數主要的加密貨幣。"
    }
  ]
}