{
  "author": "catdollars",
  "the_new_excerpt": "I’ll admit it. I fell for the hype and at one point I was up 20%, but this stock\nhas been in continuous decline for the past 3 months, dropping a jawdropping 60%\nand after doing a little more research, I’ve found that this company is pretty\ngodawful.\n\nTheir revenue last quarter was... how do I put…",
  "original_created_utc": 1618498918,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "認めますよ。誇大広告に騙されて、一時は20％も上昇しましたが、この株は\nしかし、この株は過去3ヶ月間、継続的に下落しており、60％という驚異的な下落を記録している。\nもう少し調べてみると、この会社はかなりひどいことになっていることがわかりました。\nもっと調べてみると、この会社はかなりひどいことになっていました。\n\n彼らの前四半期の収益は...何と言うか...。",
      "title": "PLUGは持ち続ける価値がありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我承认 我上当受骗了，一度涨了20%，但这只股\n在过去的3个月里一直在持续下跌，跌幅达到令人瞠目结舌的60%。\n而在做了更多的研究后，我发现这家公司是相当的\n糟糕透顶。\n\n他们上个季度的收入是... 怎么说呢...",
      "title": "PLUG是否值得坚持？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我承認 我上當受騙了，一度漲了20%，但這隻股\n在過去的3個月裏一直在持續下跌，跌幅達到令人瞠目結舌的60%。\n而在做了更多的研究後，我發現這家公司是相當的\n糟糕透頂。\n\n他們上個季度的收入是... 怎麼說呢...",
      "title": "PLUG是否值得堅持？"
    }
  ],
  "title": "Is PLUG even worth holding onto?",
  "created_utc": 1618558946,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ll admit it. I fell for the hype and at one point I was up 20%, but this stock has been in continuous decline for the past 3 months, dropping a jawdropping 60% and after doing a little more research, I’ve found that this company is pretty godawful.</p>\n\n<p>Their revenue last quarter was...  how do I put it..? Absolutely abysmal. There’s also a class action lawsuit going on against them on behalf of shareholders and the CEO recently dumped his shares. To say that there’s shady shit behind this company is an understatement.</p>\n\n<p>The market has been absolutely terrible these last two months but I can’t help but feel the clean energy bubble has burst. PLUG RUN CELL BLINK SPWR are all performing terribly despite high hopes for renewable energy. I fear PLUG is only gonna keep tanking down to $3 and i’m thinking of just cutting my losses at 60% and dumping this piece of trash.</p>\n</div><!-- SC_ON -->",
  "score": 40,
  "permalink": "/r/stocks/comments/mrgi2y/is_plug_even_worth_holding_onto/",
  "subreddit": "stocks",
  "id": "mrgi2y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526123
}