{
  "author": "discovid19",
  "original_created_utc": 1654023051,
  "title": "Is cheating really that common?",
  "created_utc": 1654062038,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been thinking about this a lot lately and it&amp;#39;s been bothering me. It seems like every other day you find out that people who seemed in happy relationships had their partner cheat on them or actually did so themselves. Often i see posts on social media where people talk about their relationship ending because their partner of many years threw the relationship away for someone they barely knew. And the comments are often full of people being able to relate with the op and it seems that no matter how long and stable your relationship might be or if you&amp;#39;re married and expecting children, it happens. One of my friends who i honestly thought would be the loyal type cheated on her boyfriend on a whim. I personally wouldn&amp;#39;t cheat on someone and I&amp;#39;m aware that there are other people who think like that too but i increasingly feel like the majority of people would give in to the temptation when confronted to it and it just depresses me. Ive had two exes cheat on me but I considered that as trivial as we weren&amp;#39;t that serious. I&amp;#39;m just really scared to spend years with someone and trusting them just to go through the heartache caused by that issue so i would like to see things from another point of view.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/v1xa6z/is_cheating_really_that_common/",
  "subreddit": "TooAfraidToAsk",
  "id": "v1xa6z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been thinking about this a lot lately and it's been bothering me. It seems\nlike every other day you find out that people who seemed in happy relationships\nhad their partner cheat on them or actually did so themselves. Often i see posts\non social media where people talk about their relationship…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近よく思うのですが、気になることがあるんです。それは\n幸せそうに暮らしていた人たちが、実は浮気をしていたとか。\nパートナーが浮気をしたり、自分も浮気をしたり。よくSNSで\nソーシャルメディアでは、自分たちの関係について語る投稿をよく見かけます...",
      "title": "浮気は本当によくあることなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近经常思考这个问题，它一直困扰着我。似乎\n好像每隔一天你就会发现，那些看起来关系很好的人\n他们的伴侣背叛了他们，或者实际上他们自己也背叛了。我经常看到一些帖子\n在社交媒体上，人们谈论他们的关系...",
      "title": "作弊真的那么普遍吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近經常思考這個問題，它一直困擾着我。似乎\n好像每隔一天你就會發現，那些看起來關係很好的人\n他們的伴侶背叛了他們，或者實際上他們自己也背叛了。我經常看到一些帖子\n在社交媒體上，人們談論他們的關係...",
      "title": "作弊真的那麼普遍嗎？"
    }
  ]
}