{
  "author": "discovid19",
  "original_created_utc": 1654023051,
  "title": "Is cheating really that common?",
  "created_utc": 1654062038,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been thinking about this a lot lately and it&amp;#39;s been bothering me. It seems like every other day you find out that people who seemed in happy relationships had their partner cheat on them or actually did so themselves. Often i see posts on social media where people talk about their relationship ending because their partner of many years threw the relationship away for someone they barely knew. And the comments are often full of people being able to relate with the op and it seems that no matter how long and stable your relationship might be or if you&amp;#39;re married and expecting children, it happens. One of my friends who i honestly thought would be the loyal type cheated on her boyfriend on a whim. I personally wouldn&amp;#39;t cheat on someone and I&amp;#39;m aware that there are other people who think like that too but i increasingly feel like the majority of people would give in to the temptation when confronted to it and it just depresses me. Ive had two exes cheat on me but I considered that as trivial as we weren&amp;#39;t that serious. I&amp;#39;m just really scared to spend years with someone and trusting them just to go through the heartache caused by that issue so i would like to see things from another point of view.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/v1xa6z/is_cheating_really_that_common/",
  "subreddit": "TooAfraidToAsk",
  "id": "v1xa6z",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been thinking about this a lot lately and it's been bothering me. It seems\nlike every other day you find out that people who seemed in happy relationships\nhad their partner cheat on them or actually did so themselves. Often i see posts\non social media where people talk about their relationship…"
}