{
  "author": "roberthonker",
  "the_new_excerpt": "It's no secret that this sub has been crazy popular lately, it's gone from 2\nMillion to 3 Million members in a couple of months. I know that the majority of\nthis new interest is mostly due to people looking to make a quick buck.\n\nCrypto is definitely a good way to make money. However, you might end…",
  "original_created_utc": 1622082261,
  "localize": [
    {
      "locale": "ja",
      "title": "お金のために来たのか それはいいのですが、技術の研究には時間をかけてください。",
      "the_new_excerpt": "最近このサブがめちゃくちゃ人気なのは周知の通り、2インチから\n数ヶ月で会員数が100万人から300万人になりました。の大半を占めていることは知っています。\nこの新しい関心は、手っ取り早くお金を稼ごうとする人たちによるものがほとんどです。\n\n暗号は間違いなくお金を稼ぐのに良い方法です。しかし、あなたは終わるかもしれません..."
    },
    {
      "locale": "zh",
      "title": "你是为了钱来的。这没关系，但要花些时间研究技术。",
      "the_new_excerpt": "这个子项目最近疯狂流行已经不是什么秘密了，它在几个月内从2\n在几个月内从200万到300万会员。我知道，大部分的\n这一新的兴趣主要是由于人们想赚快钱。\n\n加密货币绝对是一个赚钱的好方法。然而，你可能最终..."
    },
    {
      "locale": "zh-Hant",
      "title": "你是爲了錢來的。這沒關係，但要花些時間研究技術。",
      "the_new_excerpt": "這個子項目最近瘋狂流行已經不是什麼祕密了，它在幾個月內從2\n在幾個月內從200萬到300萬會員。我知道，大部分的\n這一新的興趣主要是由於人們想賺快錢。\n\n加密貨幣絕對是一個賺錢的好方法。然而，你可能最終..."
    }
  ],
  "title": "You're here for the money. That's okay, but take some time to research the tech.",
  "created_utc": 1622112665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s no secret that this sub has been crazy popular lately, it&#39;s gone from 2 Million to 3 Million members in a couple of months. I know that the majority of this new interest is mostly due to people looking to make a quick buck.</p>\n\n<p>Crypto is definitely a good way to make money. However, you might end up finding the tech interesting. I know that I sure did, and having a sound understanding of your investment will make a big difference in your ability to hodl. It doesn&#39;t have to be much, just a few YouTube videos. </p>\n\n<p><strong>Please don&#39;t invest blindly.</strong></p>\n</div><!-- SC_ON -->",
  "score": 878,
  "permalink": "/r/CryptoCurrency/comments/nlxhli/youre_here_for_the_money_thats_okay_but_take_some/",
  "subreddit": "CryptoCurrency",
  "id": "nlxhli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387100
}