{
  "author": "MarinetteXLila",
  "original_created_utc": 1648846111,
  "title": "I'm Homeless. If Bitcoin hits 500K I am Retiring.",
  "created_utc": 1648865777,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I am homeless and I live in my car. I have had a kind of rough life. &lt;/p&gt;\n\n&lt;p&gt;When I was young my father left and my whole family became homeless. For the past 5 years I have lived in my car and worked at the lowest paying dead end jobs.&lt;/p&gt;\n\n&lt;p&gt;Right now I don&amp;#39;t have a job. You may ask why and the reason is when you are working a dead end job that won&amp;#39;t give you a raise you make more money quitting and taking a few weeks to find a job paying $1 more per hour.&lt;/p&gt;\n\n&lt;p&gt;I can make enough to afford an apartment but because the rent price means they require 3X rent as your income... I don&amp;#39;t make enough for that.... So I can&amp;#39;t get an apartment.&lt;/p&gt;\n\n&lt;p&gt;I have worked and quit and worked and quit and repeat.&lt;/p&gt;\n\n&lt;p&gt;Right now My goal is to save up $30,000 and invest it in Bitcoin. That means if Bitcoin becomes 500K then I&amp;#39;ll have $300,000... And I can retire with that in the Philippines.&lt;/p&gt;\n\n&lt;p&gt;I can theoretically save $15000 in a year working while living in my car so I plan on investing ALL of it in Bitcoin.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 327,
  "permalink": "/r/Bitcoin/comments/tu146n/im_homeless_if_bitcoin_hits_500k_i_am_retiring/",
  "subreddit": "Bitcoin",
  "id": "tu146n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I am homeless and I live in my car. I have had a kind of rough life.\n\nWhen I was young my father left and my whole family became homeless. For the\npast 5 years I have lived in my car and worked at the lowest paying dead end\njobs.\n\nRight now I don't have a job. You may ask why and the reason is when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はホームレスで、車の中で生活しています。私はある意味、荒んだ人生を送ってきました。\n\n幼い頃、父が家を出て行き、家族全員がホームレスになりました。この間\nこの5年間は車の中で生活し、最低の給料の行き止まりで仕事をしてきました。\nの仕事です。\n\n今、私は仕事を持っていません。なぜかと聞かれれば、その理由は...。",
      "title": "私はホームレスです。もしビットコインが50万ドルになったら 私は引退します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无家可归，住在我的车里。我的生活有点坎坷。\n\n在我小的时候，我的父亲离开了，我的整个家庭变得无家可归。在过去的\n在过去的5年里，我一直住在我的车里，在工资最低的死胡同里工作。\n工作。\n\n现在，我没有工作。你可能会问为什么，原因是当...",
      "title": "我是无家可归者。如果比特币达到50万，我就退休了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無家可歸，住在我的車裏。我的生活有點坎坷。\n\n在我小的時候，我的父親離開了，我的整個家庭變得無家可歸。在過去的\n在過去的5年裏，我一直住在我的車裏，在工資最低的死衚衕裏工作。\n工作。\n\n現在，我沒有工作。你可能會問爲什麼，原因是當...",
      "title": "我是無家可歸者。如果比特幣達到50萬，我就退休了。"
    }
  ]
}