{
  "author": "Snoo65810",
  "the_new_excerpt": "I am sure yall are forgetting the fact that Bitcoin is the world’s only\nDECENTRALISED method of payment. This means that NOBODY has a say in how it is\noperated or mined.\n\nWe DON’T need a mining or whatever council. This is just yet another attempt by\nyet another rich person trying to hold influence…",
  "original_created_utc": 1623580926,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さんは、ビットコインが世界で唯一の決済手段であるという事実を忘れているのではないでしょうか。\n決済手段であることを忘れていませんか？つまり、ビットコインがどのように運営され、どのように採掘されるかについて、誰も発言できないということです。\n運営方法や採掘方法に誰も口出しできないということです。\n\nマイニングやその他の協議会は必要ありません。これは、またしても\nお金持ちが影響力を持とうとしているだけです...。",
      "title": "\"ビットコインマイニング協議会 \"には絶対に賛同しませんし、サポートもしません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你们都忘记了一个事实，即比特币是世界上唯一的\n去中心化的支付方式。这意味着任何人都不能对它的运作或挖矿方式有发言权。\n操作或挖矿。\n\n我们不需要一个采矿或什么委员会。这只是另一个企图，由\n又一个富人试图控制影响力......",
      "title": "我永远不会同意也不会支持 \"比特币采矿委员会\""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你們都忘記了一個事實，即比特幣是世界上唯一的\n去中心化的支付方式。這意味着任何人都不能對它的運作或挖礦方式有發言權。\n操作或挖礦。\n\n我們不需要一個採礦或什麼委員會。這只是另一個企圖，由\n又一個富人試圖控制影響力......",
      "title": "我永遠不會同意也不會支持 \"比特幣採礦委員會\""
    }
  ],
  "title": "I will never agree nor support a “Bitcoin Mining Council”",
  "created_utc": 1623594630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am sure yall are forgetting the fact that Bitcoin is the world’s only DECENTRALISED method of payment.\nThis means that NOBODY has a say in how it is operated or mined.  </p>\n\n<p>We DON’T need a mining or whatever council. This is just yet another attempt by yet another rich person trying to hold influence over Bitcoin. We know the energy use of Bitcoin and it needs no explanation. Either you take it or leave it. The world is messed up because of power plants, cutting of forests, millions of factories and petrol/diesel cars etc not Bitcoin. How about they address that? </p>\n\n<p>Also, If they don’t like the energy of use Bitcoin, why don’t they choose one the thousands of other Crypto? I personally think that there is a much bigger worry for them other than energy use…</p>\n</div><!-- SC_ON -->",
  "score": 844,
  "permalink": "/r/Bitcoin/comments/nyto5d/i_will_never_agree_nor_support_a_bitcoin_mining/",
  "subreddit": "Bitcoin",
  "id": "nyto5d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009734580
}