{
  "author": "PhattCakes",
  "original_created_utc": 1644557324,
  "title": "Is it homophobic of me to not care about genders and pronouns?",
  "created_utc": 1644571580,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Please be blunt I feel like a horrible human being and I’m willing to take criticism. I will assume you are either a he or a she, but I WILL correct my vocabulary if you tell me “I prefer they/them” I respect that, but I don’t care to learn about the new pronouns and sexualities.&lt;/p&gt;\n\n&lt;p&gt;I know there’s stuff like xem/xe which I honestly think is dumb and would prefer they/them instead of “I’m going to give xem food”. Is that homophobic to say? I will learn about it if a friend of mine comes out as a certain pronoun barer, sexuality, or gender but other than that I really don’t care to go out of my way to learn the new sexuality/gender/pronouns that’ve been made.&lt;/p&gt;\n\n&lt;p&gt;So am I homophobic? I have limits on what I will say to make someone comfortable (like me preferring they/them over xe/xem). Please let me know so I can correct my ways.&lt;/p&gt;\n\n&lt;p&gt;EDIT: my limits on sexuality’s are only the ones that find objects and animals sexually attractive. I will never be ok with bestiality it shouldn’t have been a thing or made up. Please seek help if you are attracted to animals.&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: For clarification I will respect someone’s sexuality/pronouns/gender if they correct me or tell me upon meeting them. I do prefer saying they/them over a neopronoun because I dont fully understand anything past they/them non-binary, pansexual, and asexual. Maybe I am closed minded like some are saying. I will try to be more open minded and makes sure I’m being respectful if I ever come across someone with a more uncommon sexuality/pronoun/gender.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/sprh2v/is_it_homophobic_of_me_to_not_care_about_genders/",
  "subreddit": "TooAfraidToAsk",
  "id": "sprh2v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Please be blunt I feel like a horrible human being and I’m willing to take\ncriticism. I will assume you are either a he or a she, but I WILL correct my\nvocabulary if you tell me “I prefer they/them” I respect that, but I don’t care\nto learn about the new pronouns and sexualities.\n\nI know there’s…"
}