{
  "author": "chrisdizon03",
  "original_created_utc": 1645303241,
  "title": "Do you believe that BTC can reach 1 million in 10 years time?",
  "created_utc": 1645342565,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know no one knows shit about fuck. But do you believe that bitcoin will reach 1 million in 10 years time given all the slow adoption of BTC in every company. Fidelity, Cathy woods and prominent billionaires like Michael saylors thinks and believe that BTC will reach around that price target. Fidelity, BlackRock, and greayscale our some of the big institutions accumulating BTC on the sideline and giving way to major adoptions to conservative investors and curious investors who wants to dip in digital assets.  Given that big institutions are entering the market are you seeing the bright future of BTC along the way.&lt;/p&gt;\n\n&lt;p&gt;So do you buy whatever the price it? Do you accumulate continuously no matter what the price action it? Do you HODL and do you believe that we will reach this kind of market outlooks.&lt;/p&gt;\n\n&lt;p&gt;I want to hear your opinions about this one.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 311,
  "permalink": "/r/CryptoCurrency/comments/swjdap/do_you_believe_that_btc_can_reach_1_million_in_10/",
  "subreddit": "CryptoCurrency",
  "id": "swjdap",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know no one knows shit about fuck. But do you believe that bitcoin will reach\n1 million in 10 years time given all the slow adoption of BTC in every company.\nFidelity, Cathy woods and prominent billionaires like Michael saylors thinks and\nbelieve that BTC will reach around that price target.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もファックのことを知らないのは知っている。しかし、ビットコインが次のようになると思いますか？\n10年後に100万ドルを達成するためには、あらゆる企業でBTCの導入が遅れていることを考慮する必要があります。\nFidelity、Cathy woods、Michael saylorsのような著名な億万長者もそう考えています。\nBTCはその辺りの価格になると思っているのですが...。",
      "title": "BTCは10年後に100万円に到達できると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道没有人知道什么是他妈的。但是你相信比特币会在10年内达到\n100万，因为BTC在每个公司的应用都很缓慢。\nFidelity, Cathy woods和像Michael saylors这样的著名亿万富翁都认为\n相信BTC将达到这个价格目标....",
      "title": "你相信BTC在10年后能达到100万吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道沒有人知道什麼是他媽的。但是你相信比特幣會在10年內達到\n100萬，因爲BTC在每個公司的應用都很緩慢。\nFidelity, Cathy woods和像Michael saylors這樣的著名億萬富翁都認爲\n相信BTC將達到這個價格目標....",
      "title": "你相信BTC在10年後能達到100萬嗎？"
    }
  ]
}