{
  "author": "LostFarAway",
  "original_created_utc": 1637632855,
  "title": "What separates crypto from the dot-com tech bubble in the late 90s?",
  "created_utc": 1637671018,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If this post gets downvoted to hell or removed, it&#39;s time to cash out.</p>\n\n<p>It&#39;s no crazy new insight that trading is driven by emotion. Professionals and amateurs are both, to a varied extent, victims of their emotion-driven and not always logical decisions.</p>\n\n<p>Has the bull run gone too far? Are investors in over their heads? Maybe. Markets are large and complex, with millions of intricate nodes influencing each other in an interconnected web of emotion and money. Even skilled investors with highly-specialized training and years of experience cannot really figure out what&#39;s going on in most cases.</p>\n\n<p>I&#39;ve seen comments here saying BTC will reach 1 billion dollars in the future, with 7 upvotes. I haven&#39;t seen anyone here stop and ask, &quot;is BTC worth a billion dollars?&quot;</p>\n\n<p>I leave trading to the people who know how to trade. Are you guys even remotely concerned that you may be in a bubble? Have you ever stopped to think, &quot;why am I putting money into this tech? am I just afraid of missing out?&quot;</p>\n\n<p>Traders sinking billions of dollars into the dot-com bubble did not. Especially if you&#39;re an amateur, check your emotions and don&#39;t fucking act like you can predict the future.</p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/r022gx/what_separates_crypto_from_the_dotcom_tech_bubble/",
  "subreddit": "CryptoCurrency",
  "id": "r022gx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If this post gets downvoted to hell or removed, it's time to cash out.\n\nIt's no crazy new insight that trading is driven by emotion. Professionals and\namateurs are both, to a varied extent, victims of their emotion-driven and not\nalways logical decisions.\n\nHas the bull run gone too far? Are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿が地獄のようにダウンブレートされたり、削除されたりしたら、そろそろキャッシュアウトしましょう。\n\nトレーディングが感情に左右されるというのは、決して目新しいことではありません。プロもアマチュアも\nプロもアマチュアも、様々な程度で、感情に左右された、必ずしも論理的ではない判断の犠牲になっています。\n感情に左右され、必ずしも論理的ではない判断の犠牲になっているのはプロもアマチュアも同じです。\n\nブルランは行き過ぎたのか？それとも...",
      "title": "90年代後半のドットコム技術バブルと、暗号の違いは何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果这个帖子被降权到地狱或被删除，那就是兑现的时候了。\n\n交易是由情感驱动的，这不是什么疯狂的新见解。专业人士和\n专业人士和业余人士都在不同程度上是他们情感驱动的受害者，而且并非总是符合逻辑的决定。\n始终符合逻辑的决定。\n\n牛市运行得太远了吗？是否...",
      "title": "是什么将加密货币与90年代末的网络科技泡沫区分开来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果這個帖子被降權到地獄或被刪除，那就是兌現的時候了。\n\n交易是由情感驅動的，這不是什麼瘋狂的新見解。專業人士和\n專業人士和業餘人士都在不同程度上是他們情感驅動的受害者，而且並非總是符合邏輯的決定。\n始終符合邏輯的決定。\n\n牛市運行得太遠了嗎？是否...",
      "title": "是什麼將加密貨幣與90年代末的網絡科技泡沫區分開來？"
    }
  ]
}