{
  "author": "Many_Scratch2269",
  "original_created_utc": 1638740658,
  "title": "IMF, Governor of the British Central Bank \"Not happy\" because El Salvador adopted Crypto | Bukele responded to the governor of the British central bank by stating, “I’m really concerned about Bank of England printing money out of thin air.” Nayib Bukele is a chad.",
  "created_utc": 1638755949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Andrew Bailey, governor of the bank of England was &amp;quot;concerned&amp;quot; about Bitcoin being used as legal tender in El Salvador.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;&lt;em&gt;It concerns me that a country would choose it as its national currency … What would worry me most of all is, do the citizens of El Salvador understand the nature and volatility of the currency they have.&lt;/em&gt;&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Thankfully Nayib Bukele is a chad and he responded by tweeting&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;I’m really concerned about Bank of England printing money out of thin air. Bank of England is ‘worried’ about El Salvador’s adoption of bitcoin? Really? I guess Bank of England’s interest in the well-being of our people is genuine. Right? I mean, they have always cared about our people. Always. Gotta love Bank of England.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;This man also bought the dip yesteday with 150 Bitcoin and and tweeted&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;strong&gt;Missed the f***ing bottom by 7 minutes&lt;/strong&gt; &lt;strong&gt;📷&lt;/strong&gt; &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;TLDR: Nayib Bukele is a chad and knows how to put greedy bankers back in their own place.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/r9q9ic/imf_governor_of_the_british_central_bank_not/",
  "subreddit": "CryptoCurrency",
  "id": "r9q9ic",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Andrew Bailey, governor of the bank of England was \"concerned\" about Bitcoin\nbeing used as legal tender in El Salvador.\n\n\n\n> It concerns me that a country would choose it as its national currency … What\n> would worry me most of all is, do the citizens of El Salvador understand the\n> nature and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イングランド銀行のアンドリュー・ベイリー総裁は、ビットコインについて「懸念」していた。\nエルサルバドルで法定通貨として使用されていること。\n\n\n\n> ある国がこれを自国通貨として選択することは、私にとって懸念材料です。\n> エルサルバドルの市民は、このことを理解しているのだろうか。\n> 本質と...",
      "title": "エルサルバドルが暗号を採用したため、IMF、英中央銀行総裁が「嬉しくない」｜ブケレは英中央銀行総裁に対して、\"Bank of Englandが何もないところからお金を印刷することをとても心配している \"と述べた。ネイブ・ブケレはチャドです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "英国银行行长安德鲁-贝利 \"关注 \"比特币\n在萨尔瓦多被用作法定货币。\n\n\n\n> 一个国家选择比特币作为其国家货币，这让我很担心......最让我担心的是，萨尔瓦多的公民是否了解比特币的价值？\n> 我最担心的是，萨尔瓦多的公民是否了解\n>性质和...",
      "title": "IMF、英国央行行长因萨尔瓦多采用加密货币而 \"不高兴\" | 布克尔回应英国央行行长说：\"我真的很担心英格兰银行凭空印钱。\" 纳伊布-布克尔是一名查德。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "英國銀行行長安德魯-貝利 \"關注 \"比特幣\n在薩爾瓦多被用作法定貨幣。\n\n\n\n> 一個國家選擇比特幣作爲其國家貨幣，這讓我很擔心......最讓我擔心的是，薩爾瓦多的公民是否瞭解比特幣的價值？\n> 我最擔心的是，薩爾瓦多的公民是否瞭解\n>性質和...",
      "title": "IMF、英國央行行長因薩爾瓦多采用加密貨幣而 \"不高興\" | 布克爾迴應英國央行行長說：\"我真的很擔心英格蘭銀行憑空印錢。\" 納伊布-布克爾是一名查德。"
    }
  ]
}