{
  "author": "AbsolutBadLad",
  "original_created_utc": 1639307645,
  "title": "But Do You ACTUALLY Know What Ethereum Is?",
  "created_utc": 1639319523,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know what Ethereum is or so I thought until an old friend of mine asked me why is it so much better than other Cryptos.&lt;/p&gt;\n\n&lt;p&gt;This person is good with computers and technologies so he kept asking me more questions about it and my incompetency to formulate good answers made me realise how less I know in proportion to how much time I spend reading posts here and other linked articles.&lt;/p&gt;\n\n&lt;p&gt;So my question is how many of you are in the same spot?&lt;/p&gt;\n\n&lt;p&gt;And if possible, I&amp;#39;d like to know what is the best way to explain what Ethereum is to a typical Indian guy.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/remzo4/but_do_you_actually_know_what_ethereum_is/",
  "subreddit": "CryptoCurrency",
  "id": "remzo4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know what Ethereum is or so I thought until an old friend of mine asked me why\nis it so much better than other Cryptos.\n\nThis person is good with computers and technologies so he kept asking me more\nquestions about it and my incompetency to formulate good answers made me realise\nhow less I know…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "イーサリアムのことは知っている、そう思っていたのですが、旧友が「なぜ？\n他の暗号と比較して、とても優れています。\n\nこの人はコンピューターや技術に長けているので、私にもっと質問してきました。\nという質問をされ、うまく答えられない自分に気づかされました。\nいかに自分が知らないか...。",
      "title": "しかし、実際にイーサリアムとは何かを知っていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道以太坊是什么，或者说我是这么认为的，直到我的一个老朋友问我，为什么以太坊会比其他货币好？\n它比其他加密货币好得多。\n\n这个人对计算机和技术很在行，所以他一直在问我更多的问题。\n关于它的问题，而我无能的回答让我意识到\n我知道的有多少...",
      "title": "但你真的知道以太坊是什么吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道以太坊是什麼，或者說我是這麼認爲的，直到我的一個老朋友問我，爲什麼以太坊會比其他貨幣好？\n它比其他加密貨幣好得多。\n\n這個人對計算機和技術很在行，所以他一直在問我更多的問題。\n關於它的問題，而我無能的回答讓我意識到\n我知道的有多少...",
      "title": "但你真的知道以太坊是什麼嗎？"
    }
  ]
}