{
  "author": "AvailableAd8676",
  "original_created_utc": 1629075491,
  "title": "I’m terrified to get the vaccine. Can people who got it please comment?",
  "created_utc": 1629123340,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throwaway account. Please be nice. Rude comments will not be tolerated. I’m just a person trying to get some answers. </p>\n\n<p>My family has been scaring the absolute daylights out of me with their vaccine conspiracies. Meanwhile, I’m also scared of the rising Covid numbers again. </p>\n\n<p>I’ve been thinking about getting the vaccine without telling anyone, but I am also a tad skeptical about the side effects, and it being an MRNA vaccine. </p>\n\n<p>I’ll probably get the shot this week, but I need to ease my mind. Can anyone help?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/p55py2/im_terrified_to_get_the_vaccine_can_people_who/",
  "subreddit": "TooAfraidToAsk",
  "id": "p55py2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Throwaway account. Please be nice. Rude comments will not be tolerated. I’m just\na person trying to get some answers.\n\nMy family has been scaring the absolute daylights out of me with their vaccine\nconspiracies. Meanwhile, I’m also scared of the rising Covid numbers again.\n\nI’ve been thinking about…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "捨てアカウント。宜しくお願いします。失礼なコメントは許されません。私はただ\n答えを得ようとしている一人の人間です。\n\n私の家族は彼らのワクチンで私を絶対的に怖がらせています。\n陰謀を企てています。その一方で、私はまたCovidの数値が上昇していることに怯えています。\n\n私が考えているのは...",
      "title": "ワクチンを打つのが怖いです。受けた人はコメントしてくれませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "扔掉的账户。请善待自己。粗鲁的评论将不会被容忍。我只是\n一个想得到一些答案的人。\n\n我的家人一直在用他们的疫苗把我吓得半死。\n阴谋论。同时，我也被不断上升的Covid数字吓到了。\n\n我一直在考虑...",
      "title": "我很害怕打这个疫苗。能否请接种过的人发表一下意见？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "扔掉的賬戶。請善待自己。粗魯的評論將不會被容忍。我只是\n一個想得到一些答案的人。\n\n我的家人一直在用他們的疫苗把我嚇得半死。\n陰謀論。同時，我也被不斷上升的Covid數字嚇到了。\n\n我一直在考慮...",
      "title": "我很害怕打這個疫苗。能否請接種過的人發表一下意見？"
    }
  ]
}