{
  "author": "Mr_Wolf9",
  "the_new_excerpt": "For the time first time ever I used a crypto ATM here in Geneva - although\nhidden in the manor store, four coins were available for purchase with a 1000\nchf limit per person per day. Cash only, you are given a qr code with a public\nkey to send and receive the amount your purchased. The machine was…",
  "original_created_utc": 1623758443,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここジュネーブで初めて暗号化されたATMを使いました。\n荘園の店舗に隠されていましたが、4枚のコインが購入可能で、1日1人あたり1000\n1日1人あたり1000スイスフランまで購入可能でした。現金のみで、購入した金額を送受信するための公開鍵付きのQRコードが渡されます。\n購入した金額を送受信するための公開鍵付きのQRコードが渡されます。その機械は...",
      "title": "私は生まれて初めて、ここジュネーブ（スイス）の暗号ATMでビットコイン、イーサリアム、ライトコイン、モネロを購入することができました。大量導入が本当に始まったのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在日内瓦，我第一次使用加密货币自动取款机--虽然隐藏在庄园商店里。\n虽然藏在庄园商店里，但有四个硬币可供购买，每人每天有1000\n每人每天限购1000瑞士法郎。只收现金，你会得到一个带有公钥的qr码。\n钥匙来发送和接收你购买的金额。这台机器是...",
      "title": "我有生以来第一次可以在日内瓦（瑞士）这里的加密货币ATM机上购买比特币、以太坊、莱特币和莫奈罗。大规模采用真的开始了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在日內瓦，我第一次使用加密貨幣自動取款機--雖然隱藏在莊園商店裏。\n雖然藏在莊園商店裏，但有四個硬幣可供購買，每人每天有1000\n每人每天限購1000瑞士法郎。只收現金，你會得到一個帶有公鑰的qr碼。\n鑰匙來發送和接收你購買的金額。這臺機器是...",
      "title": "我有生以來第一次可以在日內瓦（瑞士）這裏的加密貨幣ATM機上購買比特幣、以太坊、萊特幣和莫奈羅。大規模採用真的開始了!"
    }
  ],
  "title": "For the first time in my life I could purchase Bitcoin, Ethereum, Litecoin and Monero from a crypto ATM here in Geneva (Switzerland). Mass adoption is really starting!",
  "created_utc": 1623767454,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For the time first time ever I used a crypto ATM here in Geneva - although hidden in the manor store, four coins were available for purchase with a 1000 chf limit per person per day. Cash only, you are given a qr code with a public key to send and receive the amount your purchased. The machine was operated by Bity, and for any purchase of Bitcoin I was asked a fee of 4 chf.</p>\n\n<p>This is truly astonishing considering that 10 years ago buying Bitcoin was almost like using limewire. Gradually, I hope to see more ATMs pop up and enable people to invest without having to disclose all your personal information on sites like coinbase or binance.</p>\n\n<p>Mass adoption is really around the corner, and with more and more people jumping on board, I do believe crypto ATM will be a bridge of accessibility. When crypto will become a useable currency in major stores these will become essential!</p>\n</div><!-- SC_ON -->",
  "score": 2941,
  "permalink": "/r/CryptoCurrency/comments/o0cp3h/for_the_first_time_in_my_life_i_could_purchase/",
  "subreddit": "CryptoCurrency",
  "id": "o0cp3h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009739992
}