{
  "author": "whywedoittoourselves",
  "original_created_utc": 1641752764,
  "title": "Selling property, offered a bitcoin when asking $49k down. What would you take?",
  "created_utc": 1641771640,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have no idea about crypto, was offered a bitcoin or 40k of the 49k I&amp;#39;m asking. I have been researching bitcoin a bit and must say this is above my pay grade. It looks like a roller coaster ride, though profitable in the long term. Would any of you wonderful geniuses out there offer a suggestion? And how does accessing the funds internationally work?&lt;/p&gt;\n\n&lt;p&gt;Edit: Thank you all so much. Totally blown away by how helpful y&amp;#39;all are. Should have mentioned, this is an owner carry sale, so the total sale price stays the same, the lost down payment is made up in higher monthly payments.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/Bitcoin/comments/rzxx16/selling_property_offered_a_bitcoin_when_asking/",
  "subreddit": "Bitcoin",
  "id": "rzxx16",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have no idea about crypto, was offered a bitcoin or 40k of the 49k I'm asking.\nI have been researching bitcoin a bit and must say this is above my pay grade.\nIt looks like a roller coaster ride, though profitable in the long term. Would\nany of you wonderful geniuses out there offer a suggestion?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号について全く知りません。ビットコインか、私が要求している49kのうち40kを提示されました。\n私は少しビットコインを研究してきたが、これは私の給与等級を超えていると言わざるを得ない。\nそれは、長期的には利益を得るが、ジェットコースターの乗車のように見えます。このような\nどなたか素晴らしい天才の方、ご提案いただけないでしょうか...。",
      "title": "不動産売却、49kドルのダウンを要求したらビットコインを提供。あなたならどうする？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对加密货币一无所知，有人给我提供了一个比特币或我要的4万块钱。\n我一直在研究比特币，必须说这高于我的工资水平。\n它看起来像一个过山车，虽然从长期来看是有利可图的。你们中的任何一位天才\n你们中的任何一个优秀的天才都能提供一个建议吗？",
      "title": "出售房产，在要价4.9万首付时提供了一个比特币。你会接受什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對加密貨幣一無所知，有人給我提供了一個比特幣或我要的4萬塊錢。\n我一直在研究比特幣，必須說這高於我的工資水平。\n它看起來像一個過山車，雖然從長期來看是有利可圖的。你們中的任何一位天才\n你們中的任何一個優秀的天才都能提供一個建議嗎？",
      "title": "出售房產，在要價4.9萬首付時提供了一個比特幣。你會接受什麼？"
    }
  ]
}