{
  "author": "bayykon",
  "the_new_excerpt": "I don’t usually post things, but when I do, I don’t get that lucky with upvotes\nand awards.\n\nNonetheless, I feel I need to say this to everyone that will pass through this:\n\nLook at the progress WE have achieved, and make sure you take advantage of the\nDISCOUNTS.\n\nThis is just another bump in our…",
  "original_created_utc": 1619142922,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は普段あまり投稿をしないのですが、投稿してもアップボーテやアワードに恵まれず\nや賞に恵まれません。\n\nしかし、このサイトをご覧になっている皆さんには、ぜひともお伝えしたいことがあります。\n\n私たちが達成した進歩を見て、あなたもぜひディスカウントを利用してください。\nディスカウントをご利用ください。\n\nこれは、私たちにとってはただの出来事です。",
      "title": "No Fear, The Dip is NOT here"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我通常不发东西，但当我发的时候，我没有那么幸运，没有得到加注\n和奖项。\n\n尽管如此，我觉得我有必要对每一个将通过这个的人说这些。\n\n看看我们所取得的进展，并确保你能享受到\n折扣。\n\n这只是我们的另一个突破。",
      "title": "别怕，\"浸礼 \"不在这里"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我通常不發東西，但當我發的時候，我沒有那麼幸運，沒有得到加註\n和獎項。\n\n儘管如此，我覺得我有必要對每一個將通過這個的人說這些。\n\n看看我們所取得的進展，並確保你能享受到\n折扣。\n\n這只是我們的另一個突破。",
      "title": "別怕，\"浸禮 \"不在這裏"
    }
  ],
  "title": "No Fear, The Dip is NOT here",
  "created_utc": 1619188773,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t usually post things, but when I do, I don’t get that lucky with upvotes and awards.</p>\n\n<p>Nonetheless, I feel I need to say this to everyone that will pass through this:</p>\n\n<p>Look at the progress WE have achieved, and make sure you take advantage of the DISCOUNTS. </p>\n\n<p>This is just another bump in our fight to Blockchain Adoption (Hence crypto adoption) and we will overcome it, whether it’s in a Day, a week, a month, a year, or a decade.</p>\n\n<p>HODL my fellow brothers and sisters and don’t let the corporate class easily scare you into dropping your bags, for we are drawing the path to a more decentralized financial future.</p>\n\n<p>I Love you.</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/mwkk23/no_fear_the_dip_is_not_here/",
  "subreddit": "CryptoCurrency",
  "id": "mwkk23",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207028
}