{
  "author": "tomackze",
  "the_new_excerpt": "You wouldn't be able to tell because the stock price has been dropping today for\nCorsair Gaming (CRSR) but apparently they acquired Visuals by Impulse today, a\npremium design platform for creators. This is potentially huge news for CRSR\ngoing forward because the problem with CRSR for the longest…",
  "original_created_utc": 1613496744,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你看不出来，因为今天股价已经跌了好几年了。\nCorsair Gaming(CRSR)，但显然他们今天收购了Visuals by Impulse，是一个。\n为创作者提供优质的设计平台。这对CRSR来说是一个潜在的重大消息。\n因为长期以来，CRSRR的问题是...",
      "title": "Corsair游戏公司收购Impulse视觉公司"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你看不出來，因爲今天股價已經跌了好幾年了。\nCorsair Gaming(CRSR)，但顯然他們今天收購了Visuals by Impulse，是一個。\n爲創作者提供優質的設計平臺。這對CRSR來說是一個潛在的重大消息。\n因爲長期以來，CRSRR的問題是...",
      "title": "Corsair遊戲公司收購Impulse視覺公司"
    }
  ],
  "title": "Corsair Gaming Acquires Visuals by Impulse",
  "created_utc": 1613507811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You wouldn&#39;t be able to tell because the stock price has been dropping today for Corsair Gaming (CRSR) but apparently they acquired Visuals by Impulse today, a premium design platform for creators. This is potentially huge news for CRSR going forward because the problem with CRSR for the longest time was they were EXCELLENT in what they do and that was creating hardware for gaming PC. But what would they do outside of that? Was there any expansion plans outside of hardware and how much can the hardware business actually catapult them? This news is interesting because in acquiring Visuals, it seems they are trying to expand into streaming and can be the beginning of them getting into the gaming sphere outside of just providing the technology for it.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/great-content-design-corsair-acquires-140000904.html\">https://finance.yahoo.com/news/great-content-design-corsair-acquires-140000904.html</a></p>\n</div><!-- SC_ON -->",
  "score": 169,
  "permalink": "/r/stocks/comments/ll8xr0/corsair_gaming_acquires_visuals_by_impulse/",
  "subreddit": "stocks",
  "id": "ll8xr0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728624095
}