{
  "author": "yeet_it_up",
  "the_new_excerpt": "How much philosophy should I myself know? I feel a slight obligation to know a\nlittle bit about everything but since that is not entirely possible, and would\njust result in a large amount of very surface knowledge, maybe I should instead\nfocus on better understanding the fundamentals of philosophy…",
  "original_created_utc": 1618842694,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私自身がどれだけの哲学を知っていればいいのか。少しでも知っていなければならないという義務感はありますが\nしかし、それは完全には不可能であり、非常に表面的な知識を大量に得ることになるでしょう。\n表面的な知識が多くなってしまうので、それよりも基本的なことをよく理解することに\n哲学の基礎を理解することに集中したほうがいいのかな...。",
      "title": "私の大学には現在Philosophy Clubがないので、自分で立ち上げようと思っています。どのような前提条件や課題がありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我自己应该懂得多少哲学？我觉得自己有一点义务了解一个\n但由于这并不完全可能，而且会使\n只是导致大量的非常表面化的知识，也许我应该改成\n注重更好地理解哲学的基本原理...",
      "title": "我的大学目前没有哲学社，所以我考虑自己成立一个哲学社。可能存在哪些先决条件或挑战？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我自己應該懂得多少哲學？我覺得自己有一點義務瞭解一個\n但由於這並不完全可能，而且會使\n只是導致大量的非常表面化的知識，也許我應該改成\n注重更好地理解哲學的基本原理...",
      "title": "我的大學目前沒有哲學社，所以我考慮自己成立一個哲學社。可能存在哪些先決條件或挑戰？"
    }
  ],
  "title": "My University does not currently have a Philosophy Club so I am considering starting one myself. What prerequisites or challenges might exist?",
  "created_utc": 1618875583,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>How much philosophy should I myself know? I feel a slight obligation to know a little bit about everything but since that is not entirely possible, and would just result in a large amount of very surface knowledge, maybe I should instead focus on better understanding the fundamentals of philosophy so that discussion and comprehension of ideas and concepts will be quicker. Thoughts?</p>\n\n<p>Below is listed the philosophies/philosophical ideas I&#39;ve read/studied and the extent of my knowledge of each.\n- Fundamentals of Philosophy (epistemology, ontology etc.) - middling (but then again I don&#39;t know what I don&#39;t know)\n- Platonism - limited\n- Stoicism - moderate-to-extensive\n- Skepticism - middling (mainly Descartes related)\n- Reason and Logic - middling</p>\n\n<p>Potentially useful authors I&#39;ve read: Dante, Dostoyevsky, Jung.</p>\n\n<p>If I were to start a club, it would be sometime around the start of Semester 2 (a few months away). Before that point, I hope to have read Kierkegaard, a handful of books from the Bible and maybe some Nietzsche.</p>\n\n<p>My main question is this: should I postpone the creation of a philosophy club until I have accumulated more philosophical knowledge?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/mu1vbc/my_university_does_not_currently_have_a/",
  "subreddit": "askphilosophy",
  "id": "mu1vbc",
  "is_self": true,
  "media": null,
  "is_video": false
}