{
  "author": "Accomplished-Design7",
  "original_created_utc": 1625278469,
  "title": "My boss thanked me because of crypto and may give me a raise",
  "created_utc": 1625308990,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So yesterday my boss came to me and thank me for my hard work. How I have been a ideal employee as I have been staying in late at work and doing such a fantastic job with the work handed to me. He even suggested that he will bump up my salary if I continue. </p>\n\n<p><strong><em>This is all thanks to crypto!</em></strong> Why you may ask? Well, this is how my work goes. I go in and finish everything as soon as I can and then start looking at those charts. I look at them and I pray to them, ask the crypto gods not to make my portfolio bleed like there is no tomorrow. Count the gains I would have made if I sold some during the ATHs. Go to the washroom and cry my eyes out. Then back I go and stare at the charts. I lose track of time every day and end up leaving a lot later than the others. </p>\n\n<p>I get in some ways the crypto gods have listened to me, they did nothing to my cryptos but helped me with my fiat. </p>\n\n<p>I have to go now, it&#39;s time I use the washroom stall and cry my eyes out.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/ocoxlg/my_boss_thanked_me_because_of_crypto_and_may_give/",
  "subreddit": "CryptoCurrency",
  "id": "ocoxlg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So yesterday my boss came to me and thank me for my hard work. How I have been a\nideal employee as I have been staying in late at work and doing such a fantastic\njob with the work handed to me. He even suggested that he will bump up my salary\nif I continue.\n\nThis is all thanks to crypto! Why you may…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、上司が私のところに来て、私の苦労をねぎらってくれました。いかに私が\n遅くまで仕事をしていたり、与えられた仕事を素晴らしくこなしていたりと、いかに理想的な社員であったか。\n私は理想的な社員であり、遅くまで仕事をして、与えられた仕事で素晴らしい仕事をしてきた。このまま続けていれば、給料もアップすると言ってくれました。\n続けるなら給料を上げると言ってくれました。\n\nこれもすべてcryptoのおかげです。なぜあなたは...",
      "title": "暗号のおかげで上司に感謝され、昇給するかもしれない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以昨天我的老板来找我，感谢我的努力工作。我是如何成为一名\n我是一个理想的员工，因为我一直在工作中待到很晚，并做了如此出色的工作。\n的工作。他甚至建议他提高我的工资。\n如果我继续下去。\n\n这一切都要归功于加密货币! 为什么你会...",
      "title": "我的老板因为加密货币而感谢我，并可能给我加薪"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以昨天我的老闆來找我，感謝我的努力工作。我是如何成爲一名\n我是一個理想的員工，因爲我一直在工作中待到很晚，並做了如此出色的工作。\n的工作。他甚至建議他提高我的工資。\n如果我繼續下去。\n\n這一切都要歸功於加密貨幣! 爲什麼你會...",
      "title": "我的老闆因爲加密貨幣而感謝我，並可能給我加薪"
    }
  ]
}