{
  "author": "sawatdee_Krap",
  "the_new_excerpt": "Applied Genetic Technologies Corporation, a clinical-stage biotechnology\ncompany, develops transformational genetic therapies for patients suffering from\nrare and debilitating diseases. The company's advanced product candidates\nconsist of three ophthalmology development programs across two…",
  "original_created_utc": 1612333415,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "应用基因技术公司，是一家临床阶段的生物技术公司。\n公司，为患有以下疾病的患者开发变革性的基因疗法。\n罕见和衰弱性疾病。该公司的先进产品候选人\n由三个眼科发展项目组成，横跨两个...",
      "title": "$AGTC是买入。新目标价17-24美元，DD内参"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "應用基因技術公司，是一家臨牀階段的生物技術公司。\n公司，爲患有以下疾病的患者開發變革性的基因療法。\n罕見和衰弱性疾病。該公司的先進產品候選人\n由三個眼科發展項目組成，橫跨兩個...",
      "title": "$AGTC是買入。新目標價17-24美元，DD內參"
    }
  ],
  "title": "$AGTC is a buy. New target price $17-$24. DD Inside",
  "created_utc": 1612355743,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Applied Genetic Technologies Corporation, a clinical-stage biotechnology company, develops transformational genetic therapies for patients suffering from rare and debilitating diseases. The company&#39;s advanced product candidates consist of three ophthalmology development programs across two targets, including X-linked retinitis pigmentosa, which has completed Phase I/II clinical trials; and achromatopsia that is in Phase I/II clinical trials.</p>\n\n<p><strong>What does that mean:</strong> AGTC is a biotech company currently has two trials in the mid to late stages of trails for gene therapy of rare/debilitating dieses.</p>\n\n<p><strong>Why do I care:</strong> Gene therapy is are all the buzz in the stock world this year. It is part of the next &quot;new tech&quot; right along side clean energy. Wall St. loves this type of thing because its potentially WORLD changing. It&#39;s easy to build hype on things that are on the forefront of a new scientific world. This company has two patents that are already well into development. That means they are already working with FDA approval. We&#39;ve seen a ton of stocks here climb just at the idea of getting it. They are ahead of the game as far as the stock market world is concerned.</p>\n\n<p><strong>Wait a min...it was worth 17? WTF Happened:</strong> Exactly what I was just talking about. Shortly after receiving public interest for the IDEAS they proposed the stock was at an all time high, obviously wall street made money, lost interest and sold. It jumped again when the stock received FDA approval. Same thing, Wall st got bored sold and moved on. Wall street is not interested in funding the development, just in making money off of it.</p>\n\n<p><strong>So why do we care now:</strong> Because it is 5 years later the drugs are in the trial period and Wall St is paying attention again. Like them or not, when Wall St pays attention stocks go up. They have Wall St interest again.</p>\n\n<p><strong>Im not reading that just tell me the good stuff:</strong></p>\n\n<p>Fine. Today HC Wainwright increased their target price to <strong>$24.</strong></p>\n\n<p>Want to be investing with the big boys? How about Roth Capital setting a target price of $<strong>30-$35</strong></p>\n\n<p><strong>Guess whos buying with you:</strong> New York Mellon Corp, Bank of America Corp, Charles Schwab Investment Management Inc and many more. Those are just the movers that made buys in the last quarter. They didn&#39;t invest HUGE amounts of capital, but a couple hundred thousand each, which to me says they want to see how high this thing can go.</p>\n\n<p>This is a consensus <strong>BUY</strong> stock ( <a href=\"https://www.marketbeat.com/stocks/NASDAQ/AGTC/#:%7E:text=Applied%20Genetic%20Technologies%20has%20received,ratings%2C%20and%20no%20sell%20ratings.\">AGTC Stock Forecast, Price &amp; News (Applied Genetic Technologies) (marketbeat.com)</a> ) You arent going to get to $24 this month. But as far as a safe bet on a decent return this is one.</p>\n\n<p>Take a break from the LETS SQUEEZE THE DIAMOND HANDS and go with a stock that clearly is in its pattern to give you very solid returns</p>\n\n<p>&#x200B;</p>\n\n<p>Oh and its earning report comes out <strong>TODAY</strong>!  Wednesday, February 3rd 2021.  I forgot to mention that. If it is anything near or above projected this could take the hell off!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/stocks/comments/lbhebl/agtc_is_a_buy_new_target_price_1724_dd_inside/",
  "subreddit": "stocks",
  "id": "lbhebl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518541064
}