{
  "author": "sorrowrequiem",
  "original_created_utc": 1653730442,
  "title": "Do specific nerves have a set purpose, or do all nerves simply act as a means of sending signals?",
  "created_utc": 1653757811,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What I mean is: In nerve grafting, they typically harvest a nerve (let&amp;#39;s say the sural nerve) in order to reconstruct another nerve. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Do nerves have actual specific purposes (on their own) or is it the location of the nerve itself that is responsible for it&amp;#39;s job? (i.e. a sural nerve is the same as a sympathetic nerve so long as it is transplanted in the sympathetic chain.)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I hope I worded that correctly&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/askscience/comments/uzjv10/do_specific_nerves_have_a_set_purpose_or_do_all/",
  "subreddit": "askscience",
  "id": "uzjv10",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "What I mean is: In nerve grafting, they typically harvest a nerve (let's say the\nsural nerve) in order to reconstruct another nerve.\n\n\n\nDo nerves have actual specific purposes (on their own) or is it the location of\nthe nerve itself that is responsible for it's job? (i.e. a sural nerve is the\nsame…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "神経移植術では、通常、別の神経を再建するために神経（例えば腓骨神経）を採取します。\nを採取して、別の神経を再建します。\n\n\n\n神経には特定の目的があるのでしょうか？\n神経には特定の目的があるのでしょうか？(腓骨神経は同じです。\n同じ...",
      "title": "特定の神経に目的があるのか、それともすべての神経が単に信号を送るための手段として働いているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是：在神经移植术中，他们通常会采集一条神经（比方说，硬脊膜神经）以重建另一条神经。\n神经），以便重建另一条神经。\n\n\n\n神经是否有实际的特定用途（本身），或者说神经本身的位置决定了它的工作。\n还是神经本身的位置决定了它的工作？(例如，硬脊膜神经是\n同...",
      "title": "特定的神经是否有固定的用途，还是所有的神经都只是作为一种发送信号的手段？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是：在神經移植術中，他們通常會採集一條神經（比方說，硬脊膜神經）以重建另一條神經。\n神經），以便重建另一條神經。\n\n\n\n神經是否有實際的特定用途（本身），或者說神經本身的位置決定了它的工作。\n還是神經本身的位置決定了它的工作？(例如，硬脊膜神經是\n同...",
      "title": "特定的神經是否有固定的用途，還是所有的神經都只是作爲一種發送信號的手段？"
    }
  ]
}