{
  "author": "kuurthgreymon",
  "original_created_utc": 1652462202,
  "title": "How can I ask my wife if she is still in love with me?",
  "created_utc": 1652501009,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’ve been with my wife for 10 years, 5 of which married. We have 3 kids together. &lt;/p&gt;\n\n&lt;p&gt;I am still madly in love with with, I still love her deeply. But as of recently she has had a new obsession that seems to have replaced her love and affection, and mental energy towards our relationship her words exactly being “I don’t have the mental energy to put towards US, because I spread it towards the boys and myself” and to note she doesn’t work so there isn’t mental energy going that way. But me, I give my all to work, our boys, hers and my parents (as we live with hers), and her. But not getting that level of appreciation has really taken a toll mentally and emotionally on me.&lt;/p&gt;\n\n&lt;p&gt;Now I’ve expressed this MANY times, expressed how I felt and been met with “what am I supposed to do about that?” Which I thought was pretty self explanatory tbh&lt;/p&gt;\n\n&lt;p&gt;But frankly Idk what or how to ask “are you still IN love with me?” Because I know she loves me, but I don’t feel IN love with. And tbh I’d feel better knowing it, aside from being dragged thru the ringer like I am.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/TooAfraidToAsk/comments/uowlby/how_can_i_ask_my_wife_if_she_is_still_in_love/",
  "subreddit": "TooAfraidToAsk",
  "id": "uowlby",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’ve been with my wife for 10 years, 5 of which married. We have 3 kids\ntogether.\n\nI am still madly in love with with, I still love her deeply. But as of recently\nshe has had a new obsession that seems to have replaced her love and affection,\nand mental energy towards our relationship her words…",
  "localize": [
    {
      "locale": "ja",
      "title": "妻がまだ私のことを好きかどうか、どうすれば聞くことができますか？",
      "the_new_excerpt": "妻とは10年、うち5年は結婚しています。私たちには3人の子供がいます。\nがいます。\n\n私はまだwithに夢中です、私はまだ彼女を深く愛しています。しかし、最近になって\nしかし、最近になって、妻は新たな妄想に取り付かれ、その妄想が妻の愛情に取って代わったようです。\n私たちの関係に対する愛情や精神的なエネルギーに代わって......彼女の言葉が......。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和我的妻子在一起10年了，其中5年是结婚。我们有3个孩子\n在一起。\n\n我仍然疯狂地爱着她，我仍然深爱着她。但从最近开始\n她有一个新的痴迷，似乎已经取代了她的爱和感情。\n和对我们关系的精神能量 她的话...",
      "title": "我怎样才能问我的妻子是否还爱着我？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和我的妻子在一起10年了，其中5年是結婚。我們有3個孩子\n在一起。\n\n我仍然瘋狂地愛着她，我仍然深愛着她。但從最近開始\n她有一個新的癡迷，似乎已經取代了她的愛和感情。\n和對我們關係的精神能量 她的話...",
      "title": "我怎樣才能問我的妻子是否還愛着我？"
    }
  ]
}