{
  "author": "Lichen000",
  "original_created_utc": 1645444259,
  "title": "How/Why/When Did Distaste for Cousin-Marriage Arise in Britain (and Europe)?",
  "created_utc": 1645477378,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In England today, most people find the idea of marrying one&amp;#39;s cousin abhorrent, whether they be 1st or 2nd cousins. In fact, many people I&amp;#39;ve spoken to believe that marrying one&amp;#39;s cousin is &lt;em&gt;illegal&lt;/em&gt;, though there are currently no laws in England and Wales forbidding this. Royal families traditionally had no qualms with marrying cousins to one another (and, indeed, many good reasons for doing so); and in many cultures cousin marriage of one kind or another (limiting it to cross-cousins, for instance) is allowed and even encouraged.&lt;/p&gt;\n\n&lt;p&gt;My question then is, at what point in time in Britain and/or Europe did the distaste for cousin marriage arise as a majority or default point of view? Or was this sentiment always extant, with royals being a particular exception? Was there a division between the urban and rural mindsets? Or perhaps a religious split/innovation?&lt;/p&gt;\n\n&lt;p&gt;I look forward to reading what might be known about this.&lt;/p&gt;\n\n&lt;p&gt;P.S.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;My reference to &amp;quot;laws in England and Wales&amp;quot; is because they have the same legal system; and I do not know off hand whether cousin marriage is legal in Scotland and Northern Ireland (though I assume it is not illegal).&lt;/li&gt;\n&lt;li&gt;A &amp;#39;cross-cousin&amp;#39; is either the child of your father&amp;#39;s sister or of your mother&amp;#39;s brother; while a &amp;#39;parallel-cousin&amp;#39; is the child of your father&amp;#39;s brother or of your mother&amp;#39;s sister.&lt;/li&gt;\n&lt;li&gt;I&amp;#39;m not sure this directly relates to &amp;#39;protest&amp;#39; but I can&amp;#39;t get rid of the flair!&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/sxrpg7/howwhywhen_did_distaste_for_cousinmarriage_arise/",
  "subreddit": "AskHistorians",
  "id": "sxrpg7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In England today, most people find the idea of marrying one's cousin abhorrent,\nwhether they be 1st or 2nd cousins. In fact, many people I've spoken to believe\nthat marrying one's cousin is illegal, though there are currently no laws in\nEngland and Wales forbidding this. Royal families…"
}