{
  "author": "dickalopejr",
  "original_created_utc": 1643337946,
  "title": "I mean no disrespect, but I have never received a good explanation as to why Jews, in virtually every era and in almost every society, have been reviled, persecuted, scapegoated and considered second class citizens. But why?",
  "created_utc": 1643348013,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From 63 BC when the Romans conquered the Holy Land to the present, every society I can think of has been virulently antisemitic. The explanation for some of it makes sense, like the middle ages when Christians were prohibited from lending money, but that does not explain the majority of civilized society being so passionately antisemitic. Why though? What about this group of people is unique in eliciting hatred?&lt;/p&gt;\n\n&lt;p&gt;Edit: while I&amp;#39;m at it, my understanding of preWW2 Germany that they blamed Jews for Germany&amp;#39;s loss of WW1. Why? Why did they believe the Jews were responsible for their humiliation at the hands of the West?&lt;/p&gt;\n\n&lt;p&gt;Edit 2: It appears to go beyond merely considering them &amp;quot;other.&amp;quot; They have &lt;em&gt;regularly&lt;/em&gt; and by multiple societies been targeted for elimination. They even have a word for it, &amp;quot;pogrom.&amp;quot; I simply cannot understand the level of hatred that leads society after society to systematically try and murder this group of people. It is, so far, beyond my comprehension and unique to this specific group of people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/seg4os/i_mean_no_disrespect_but_i_have_never_received_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "seg4os",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From 63 BC when the Romans conquered the Holy Land to the present, every society\nI can think of has been virulently antisemitic. The explanation for some of it\nmakes sense, like the middle ages when Christians were prohibited from lending\nmoney, but that does not explain the majority of civilized…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ローマ帝国が聖地を征服した紀元前63年から現在に至るまで、あらゆる社会で\n私が思いつく限りでは、悪質な反ユダヤ主義者だった。そのうちのいくつかは\n中世のキリスト教徒への貸与が禁止された時代など、理にかなっている。\nしかし、それでは文明社会の大半は説明できない。",
      "title": "失礼なことを言うつもりはないが、私はこれまで、ほぼすべての時代、ほぼすべての社会で、なぜユダヤ人が蔑まれ、迫害され、スケープゴートにされ、二流市民とみなされてきたのか、きちんと説明されたことはない。しかし、なぜでしょう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从公元前63年罗马人征服圣地至今，每个社会\n都有强烈的反犹太主义倾向。对其中一些现象的解释\n的解释是有道理的，比如中世纪时，基督教徒被禁止借钱给\n但这并不能解释大多数的文明社会。",
      "title": "我没有任何不敬的意思，但我从来没有得到一个很好的解释，为什么犹太人在几乎每个时代和几乎每个社会中都被谩骂、迫害、当替罪羊，被视为二等公民。但为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從公元前63年羅馬人征服聖地至今，每個社會\n都有強烈的反猶太主義傾向。對其中一些現象的解釋\n的解釋是有道理的，比如中世紀時，基督教徒被禁止借錢給\n但這並不能解釋大多數的文明社會。",
      "title": "我沒有任何不敬的意思，但我從來沒有得到一個很好的解釋，爲什麼猶太人在幾乎每個時代和幾乎每個社會中都被謾罵、迫害、當替罪羊，被視爲二等公民。但爲什麼呢？"
    }
  ]
}