{
  "author": "dickalopejr",
  "original_created_utc": 1643337946,
  "title": "I mean no disrespect, but I have never received a good explanation as to why Jews, in virtually every era and in almost every society, have been reviled, persecuted, scapegoated and considered second class citizens. But why?",
  "created_utc": 1643348013,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From 63 BC when the Romans conquered the Holy Land to the present, every society I can think of has been virulently antisemitic. The explanation for some of it makes sense, like the middle ages when Christians were prohibited from lending money, but that does not explain the majority of civilized society being so passionately antisemitic. Why though? What about this group of people is unique in eliciting hatred?&lt;/p&gt;\n\n&lt;p&gt;Edit: while I&amp;#39;m at it, my understanding of preWW2 Germany that they blamed Jews for Germany&amp;#39;s loss of WW1. Why? Why did they believe the Jews were responsible for their humiliation at the hands of the West?&lt;/p&gt;\n\n&lt;p&gt;Edit 2: It appears to go beyond merely considering them &amp;quot;other.&amp;quot; They have &lt;em&gt;regularly&lt;/em&gt; and by multiple societies been targeted for elimination. They even have a word for it, &amp;quot;pogrom.&amp;quot; I simply cannot understand the level of hatred that leads society after society to systematically try and murder this group of people. It is, so far, beyond my comprehension and unique to this specific group of people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/seg4os/i_mean_no_disrespect_but_i_have_never_received_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "seg4os",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From 63 BC when the Romans conquered the Holy Land to the present, every society\nI can think of has been virulently antisemitic. The explanation for some of it\nmakes sense, like the middle ages when Christians were prohibited from lending\nmoney, but that does not explain the majority of civilized…"
}