{
  "author": "HisDickBurns",
  "the_new_excerpt": "I tried to post in one subreddit only to be told my account needs to be 60 days\nold and I need to have 500 comment karma to make post submissions.\n\nI found this to be a little bit on the ridiculous side. How are new users\nsupposed to get anywhere when there are only like 6 subreddits that don’t…",
  "original_created_utc": 1622738537,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あるsubredditに投稿しようとしたところ、アカウントが60日以上経っていないと投稿できないと言われました。\nまた、投稿するには500のコメントカルマが必要だと言われました。\n\nこれはちょっと馬鹿げていると思いました。新規ユーザーはどうやって\n6つのサブレディットしかないのに、新規ユーザーはどうやって活動するのでしょうか？",
      "title": "このサイトで、実際に新規ユーザーを許可しているサブレディットはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我试图在一个分论坛上发帖，但却被告知我的账户需要60天的时间\n而且我需要有500个评论业力才能发帖。\n\n我发现这有点荒唐。新用户如何\n新用户应该如何得到任何东西，因为只有像6个子红点不...",
      "title": "这个网站上是否有真正允许新用户的子版块？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試圖在一個分論壇上發帖，但卻被告知我的賬戶需要60天的時間\n而且我需要有500個評論業力才能發帖。\n\n我發現這有點荒唐。新用戶如何\n新用戶應該如何得到任何東西，因爲只有像6個子紅點不...",
      "title": "這個網站上是否有真正允許新用戶的子版塊？"
    }
  ],
  "title": "Are there any subreddits on this site that actually allow new users?",
  "created_utc": 1622750788,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I tried to post in one subreddit only to be told my account needs to be 60 days old and I need to have 500 comment karma to make post submissions.</p>\n\n<p>I found this to be a little bit on the ridiculous side. How are new users supposed to get anywhere when there are only like 6 subreddits that don’t have CCP levels of control and require you to make a blood sacrifice to post.</p>\n\n<p>Just making an edit! This is a pretty wholesome welcome to Reddit, thank you!</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/nrhvg1/are_there_any_subreddits_on_this_site_that/",
  "subreddit": "NoStupidQuestions",
  "id": "nrhvg1",
  "is_self": true,
  "media": null,
  "is_video": false
}