{
  "author": "thesnowfallsup",
  "original_created_utc": 1635696321,
  "title": "How will I be able to forgive my fiancé for the role he played in my miscarriage?",
  "created_utc": 1635709423,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (25F) was 19 weeks pregnant when I went to a routine ultrasound and was told my cervix had dilated 2cm. They kept me overnight to put in a cerclage and unfortunately my water broke hours before the scheduled surgery. All tests came back negative so doctors have no official answer for me as to what happened, just possibilities; I have an insufficient cervix or there’s some kind of bacterial infection that harmed the baby. </p>\n\n<p>(TMI but apart of the story) 2/3 weeks before this happened, my mom made a joke about how I don’t shave my bushes (I have an afro (the bush she was referring to) also I let my body hair (the underline of the joke) grow in most times and I’m not as self conscious about it as most women/people can be) and my partner has never made me feel uncomfortable about it or seemed to care. One day my partner was shaving my legs with an electric razor he uses for face and hairline and decided to shave my pubic hair to (my moms home must have gotten to him idk) and I told him not to but he insisted he was almost done anyway so I just let him. This is where it gets gross, so apparently this is the same razor everyone uses in the house (we live with our parents because we are currently working on becoming debt free to buy our first home). I asked him did he wipe it down with alcohol and he said yes. </p>\n\n<p>A day later I have Bacterial Vaginosis, but I don’t know it I just think it’s a yeast infection which I don’t usually get but I’m pregnant so I figure it’s normal right? Wrong, always consult in your doctor before self diagnosing and googling symptoms. Days go by and on like day 3 it’s hurts so bad to pee that my vision is blurry while peeing. Like i start crying when I realize I have to pee! My fiancé takes off work that morning and takes me to get seen at a patient first. I ask him is he sure he wiped the electric shaver down with alcohol and he reveals he only wiped the razor and not the whole handheld device. Vaginas are tough but they’re still really delicate… Got tested at Patient First and what do you know, bacterial vaginosis AND A UTI FROM HOLDING THE PEE. </p>\n\n<p>No one warned me that even after treatment my baby would likely still die. It’s been 3 weeks since she died in my womb and I’m not the same. I’m heartbroken and I have postpartum depression that feels so dumb without the baby at least being here.</p>\n\n<p>I’m angry at everyone, my mom for the dumb ass shady joke, my partner for being… for lack of a better word… reckless, my doctors for their horrible communication with me throughout my pregnancy until the loss of it…, myself for not being firm with my partner about removing my body hair. It’s just that It wasn’t a big deal until it was…</p>\n\n<p>How will I forgive? I love my partner and I love myself but I’m disappointed in us. I respect him and adore him but sometimes I look at him and feel resentment and I don’t like it.</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/TooAfraidToAsk/comments/qjsm1n/how_will_i_be_able_to_forgive_my_fiancé_for_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "qjsm1n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (25F) was 19 weeks pregnant when I went to a routine ultrasound and was told\nmy cervix had dilated 2cm. They kept me overnight to put in a cerclage and\nunfortunately my water broke hours before the scheduled surgery. All tests came\nback negative so doctors have no official answer for me as to what…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(25F)は妊娠19週目に定期的な超音波検査を受け、次のように言われました。\n子宮頸管が2cm拡張していると言われました。子宮頸管を締めるために一晩拘束されましたが\n残念ながら、手術予定日の数時間前に破水してしまいました。すべての検査結果は\n全ての検査が陰性だったので、医師からは正式な回答は得られませんでしたが...",
      "title": "流産の原因となった婚約者をどうやって許せばいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（25岁）怀孕19周时去做常规超声波检查，被告知\n我的子宫颈已经扩张了2厘米。他们让我过夜，给我装上宫颈环。\n不幸的是，在预定的手术前几个小时我的羊水破了。所有的检查结果都是\n所以医生没有给我正式的答案，也不知道是什么原因。",
      "title": "我如何能够原谅我的未婚夫在我流产中扮演的角色？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（25歲）懷孕19周時去做常規超聲波檢查，被告知\n我的子宮頸已經擴張了2釐米。他們讓我過夜，給我裝上宮頸環。\n不幸的是，在預定的手術前幾個小時我的羊水破了。所有的檢查結果都是\n所以醫生沒有給我正式的答案，也不知道是什麼原因。",
      "title": "我如何能夠原諒我的未婚夫在我流產中扮演的角色？"
    }
  ]
}