{
  "author": "Slainte042",
  "original_created_utc": 1638136857,
  "title": "We are not late. We are not early. Living in the present is living in peace.",
  "created_utc": 1638148124,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I often read posts about we being early into Crypto or the opposite, that we&#39;ve already miss the train. In my opinion it&#39;s neither, because we simply don&#39;t know what&#39;s next. We don&#39;t know what the future will bring. We might be very late and to be very close to ATH market cap or the opposite, the whole Crypto market may jump x100 in the next 10 years for example.</p>\n\n<p>In this line of thoughts we should stop worry about being late and stop rejoicing too much being very early. We should accept the reality as it is, following your investment strategy, being happy for the current implementation of blockchain technology in our everyday lives. We should live in the present, because living in the present is living in peace with yourself.</p>\n</div><!-- SC_ON -->",
  "score": 215,
  "permalink": "/r/CryptoCurrency/comments/r4flqt/we_are_not_late_we_are_not_early_living_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "r4flqt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I often read posts about we being early into Crypto or the opposite, that we've\nalready miss the train. In my opinion it's neither, because we simply don't know\nwhat's next. We don't know what the future will bring. We might be very late and\nto be very close to ATH market cap or the opposite, the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はよく、暗号化に早くから取り組んでいるという記事や、反対に、暗号化に早くから取り組んでいるという記事を読みます。\n私はどちらでもないと思います。私の意見では、どちらでもないと思います。\n次のことがわからないからです。未来がどうなるのかわからないのです。私たちはとても遅れているかもしれないし\nATHの時価総額に非常に近づいているかもしれませんし、逆に...",
      "title": "遅れていません。私たちは早くはありません。現在に生きることは、平和に生きること。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经常读到关于我们早期进入加密货币的帖子，或者相反，说我们已经\n已经错过了这趟列车。在我看来，这两者都不是，因为我们根本不知道\n下一步是什么。我们不知道未来会带来什么。我们可能会很晚，但\n变得非常接近ATH的市值，或者是相反的情况，那就是......。",
      "title": "我们没有迟到。我们并不早。活在当下就是活在和平中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常讀到關於我們早期進入加密貨幣的帖子，或者相反，說我們已經\n已經錯過了這趟列車。在我看來，這兩者都不是，因爲我們根本不知道\n下一步是什麼。我們不知道未來會帶來什麼。我們可能會很晚，但\n變得非常接近ATH的市值，或者是相反的情況，那就是......。",
      "title": "我們沒有遲到。我們並不早。活在當下就是活在和平中。"
    }
  ]
}