{
  "author": "Zemmy8",
  "original_created_utc": 1658350762,
  "title": "I feel bad for inanimate objects. Does anyone know why?",
  "created_utc": 1658373535,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For instance, i feel bad for my ac being kept on for hours. And then after some time, i would want to turn it off so that it can take a break or sleep as if it has feelings or something.&lt;/p&gt;\n\n&lt;p&gt;Another instance is when i see water bottles being crushed or seeing boxes being destroyed, i just instantly feel bad for it. I think to myself that the objects are being tortured and are internally shouting in pain. I would then picture the objects crying about how they are treated the way they are. &lt;/p&gt;\n\n&lt;p&gt;there are many more examples i can go on about, but i feel like you understand my point by now.&lt;/p&gt;\n\n&lt;p&gt;Sorry if this sounds super dumb... I just wanted to know if there was some sort of scientific explanation to it or if there is anyone else that could relate to me somehow that might have an explanation.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 798,
  "permalink": "/r/TooAfraidToAsk/comments/w3xcg7/i_feel_bad_for_inanimate_objects_does_anyone_know/",
  "subreddit": "TooAfraidToAsk",
  "id": "w3xcg7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For instance, i feel bad for my ac being kept on for hours. And then after some\ntime, i would want to turn it off so that it can take a break or sleep as if it\nhas feelings or something.\n\nAnother instance is when i see water bottles being crushed or seeing boxes being\ndestroyed, i just instantly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、何時間もエアコンをつけっぱなしにしておくのはかわいそうだ。そして、しばらくすると\nを切って、休ませたり、寝かせたりしたい。\nと思ってしまいます。\n\nまた、水筒がつぶされたり、箱が壊されたりするのを見ると、瞬時に......。\nもうひとつは、水のボトルが潰されたり、箱が破壊されたりすると、瞬時に......。",
      "title": "無機物には申し訳ないと思っています。なぜかわかる人いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例如，我为我的空调被开了几个小时而感到难过。然后经过一段时间\n我就想把它关掉，这样它就可以休息一下或睡觉，就好像它\n有感情或什么的。\n\n另一个例子是当我看到水瓶被压碎或看到箱子被\n破坏，我就会立刻...",
      "title": "我为无生命的物体感到难过。有人知道为什么吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例如，我爲我的空調被開了幾個小時而感到難過。然後經過一段時間\n我就想把它關掉，這樣它就可以休息一下或睡覺，就好像它\n有感情或什麼的。\n\n另一個例子是當我看到水瓶被壓碎或看到箱子被\n破壞，我就會立刻...",
      "title": "我爲無生命的物體感到難過。有人知道爲什麼嗎？"
    }
  ]
}