{
  "author": "wolfmangpuck",
  "the_new_excerpt": "If you are buying on Robin Hood you do not control your coins and you cannot\ntransfer them to a wallet or to any other exchange.\n\nIn addition to this, trading is frequently halted due to volatility as we saw\nwith Dogecoin yesterday which in some cases means you won’t be able to sell on a\nmassive…",
  "original_created_utc": 1611938245,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果您在Robin Hood上购买，您不能控制您的硬币，您不能\n将它们转移到钱包或任何其他交易所。\n\n除此之外，交易经常因为波动而停止，正如我们所看到的\n与Dogecoin的昨天，在某些情况下，这意味着你将无法出售在\n巨大的...",
      "title": "致所有进入加密领域的新人们。不要，我重复一遍，不要在罗宾汉上买入。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果您在Robin Hood上購買，您不能控制您的硬幣，您不能\n將它們轉移到錢包或任何其他交易所。\n\n除此之外，交易經常因爲波動而停止，正如我們所看到的\n與Dogecoin的昨天，在某些情況下，這意味着你將無法出售在\n巨大的...",
      "title": "致所有進入加密領域的新人們。不要，我重複一遍，不要在羅賓漢上買入。"
    }
  ],
  "title": "To all the new folks getting into crypto: Do not, I repeat, do not buy on Robin Hood.",
  "created_utc": 1611949516,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you are buying on Robin Hood you do not control your coins and you cannot transfer them to a wallet or to any other exchange. </p>\n\n<p>In addition to this, trading is frequently halted due to volatility as we saw with Dogecoin yesterday which in some cases means you won’t be able to sell on a massive drop, even with a stop loss order in place. </p>\n\n<p>There is also often a large gap between the current sell price and buy price which should not be happening for coins with decent volume. </p>\n\n<p>Buying on Robin Hood defeats the whole decentralized point of cryptocurrency which allows you to be in control of your coins. And if if you are coming here from WSB, fuck Robin Hood anyway. Don’t support these slimy market manipulators. </p>\n\n<p>That being said, market manipulation also exists on any crypto exchange so be aware of pump and dumps, especially when coins instantly shoot up in price with no real rhyme or reason. Be safe out there.</p>\n</div><!-- SC_ON -->",
  "score": 12975,
  "permalink": "/r/CryptoCurrency/comments/l7x3bi/to_all_the_new_folks_getting_into_crypto_do_not_i/",
  "subreddit": "CryptoCurrency",
  "id": "l7x3bi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527087
}