{
  "author": "Willing_Baseball4893",
  "original_created_utc": 1648994703,
  "title": "Is it true that in some Western countries like the USA, UK and Denmark, toilets have no water supply at all, other than to flush, and they just use toilet paper? How is it possible?",
  "created_utc": 1649009721,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;#&lt;strong&gt;I don&amp;#39;t mean flushing, but about cleaning your bottom after the business is done.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No judgement here as I believe in you do you, but my friend who has lived in all three places told me so. I am just wondering if it is true or is he just pulling my leg?&lt;/p&gt;\n\n&lt;p&gt;Here in Sri Lanka, we use a hand bidet, so you wash, then use liquid soap, then wash again to rinse off the soap and then properly wash your hands. You do not need to use toilet paper to dry as it is hot enough that the water evaporates in a few seconds.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in Japan for uni, and there we use a seating bidet, then liquid soap, then rinse again and then use toilet paper to dry.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never been to any Western country so I have some questions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Is it true that only toilet paper is used and no water is used?&lt;/li&gt;\n&lt;li&gt;If it is true, do you wipe first, then put soap. After that what do you do, how do you remove soap, isn&amp;#39;t it difficult to wipe off soap?&lt;/li&gt;\n&lt;li&gt;What about if it is you have stuff like diarrhea or other issues, is wiping enough?&lt;/li&gt;\n&lt;li&gt;What about if there are wounds/ scars over there, wouldn&amp;#39;t wiping make it worse?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Sorry if this is offensive, but I was just wondering how is something like this even possible, I can&amp;#39;t even wrap my head around only using toilet paper and no water. if it works, then I guess it isn&amp;#39;t that bad, so no judgement here, I just can&amp;#39;t even imagine it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/tva0zh/is_it_true_that_in_some_western_countries_like/",
  "subreddit": "NoStupidQuestions",
  "id": "tva0zh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "#I don't mean flushing, but about cleaning your bottom after the business is\ndone.\n\nNo judgement here as I believe in you do you, but my friend who has lived in all\nthree places told me so. I am just wondering if it is true or is he just pulling\nmy leg?\n\nHere in Sri Lanka, we use a hand bidet, so…"
}