{
  "author": "Willing_Baseball4893",
  "original_created_utc": 1648994703,
  "title": "Is it true that in some Western countries like the USA, UK and Denmark, toilets have no water supply at all, other than to flush, and they just use toilet paper? How is it possible?",
  "created_utc": 1649009721,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;#&lt;strong&gt;I don&amp;#39;t mean flushing, but about cleaning your bottom after the business is done.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;No judgement here as I believe in you do you, but my friend who has lived in all three places told me so. I am just wondering if it is true or is he just pulling my leg?&lt;/p&gt;\n\n&lt;p&gt;Here in Sri Lanka, we use a hand bidet, so you wash, then use liquid soap, then wash again to rinse off the soap and then properly wash your hands. You do not need to use toilet paper to dry as it is hot enough that the water evaporates in a few seconds.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been in Japan for uni, and there we use a seating bidet, then liquid soap, then rinse again and then use toilet paper to dry.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve never been to any Western country so I have some questions:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Is it true that only toilet paper is used and no water is used?&lt;/li&gt;\n&lt;li&gt;If it is true, do you wipe first, then put soap. After that what do you do, how do you remove soap, isn&amp;#39;t it difficult to wipe off soap?&lt;/li&gt;\n&lt;li&gt;What about if it is you have stuff like diarrhea or other issues, is wiping enough?&lt;/li&gt;\n&lt;li&gt;What about if there are wounds/ scars over there, wouldn&amp;#39;t wiping make it worse?&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Sorry if this is offensive, but I was just wondering how is something like this even possible, I can&amp;#39;t even wrap my head around only using toilet paper and no water. if it works, then I guess it isn&amp;#39;t that bad, so no judgement here, I just can&amp;#39;t even imagine it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/tva0zh/is_it_true_that_in_some_western_countries_like/",
  "subreddit": "NoStupidQuestions",
  "id": "tva0zh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "#I don't mean flushing, but about cleaning your bottom after the business is\ndone.\n\nNo judgement here as I believe in you do you, but my friend who has lived in all\nthree places told me so. I am just wondering if it is true or is he just pulling\nmy leg?\n\nHere in Sri Lanka, we use a hand bidet, so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "#水洗式ではなく、ビジネスの後にお尻をきれいにすることについてです。\nということです。\n\n私はYou do youを信じるので批判はしませんが、すべての国に住んだことのある友人から\n3つの場所でそう言われました。ただ、それが本当なのか、それとも彼が引っ張っているだけなのか、気になるところです。\n私の足は？\n\nここスリランカでは、手でビデを使うので...",
      "title": "アメリカ、イギリス、デンマークなど欧米の一部の国では、トイレには水を流す以外の水道がまったくなく、トイレットペーパーを使うだけというのは本当でしょうか？どうしてそんなことが可能なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "#我不是指冲水，而是指在业务完成后清洁你的屁股。\n做完。\n\n在此不做评价，因为我相信你就是你，但我的朋友在这三个地方都住过，他这样告诉我。\n这三个地方的朋友这样告诉我。我只是想知道这是否是真的，还是他只是在拉我的腿？\n我的腿？\n\n在斯里兰卡，我们使用手摇式坐便器，所以...",
      "title": "在美国、英国和丹麦等一些西方国家，厕所除了冲水之外，根本没有供水，他们只是使用卫生纸，这是真的吗？这怎么可能呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "#我不是指沖水，而是指在業務完成後清潔你的屁股。\n做完。\n\n在此不做評價，因爲我相信你就是你，但我的朋友在這三個地方都住過，他這樣告訴我。\n這三個地方的朋友這樣告訴我。我只是想知道這是否是真的，還是他只是在拉我的腿？\n我的腿？\n\n在斯里蘭卡，我們使用手搖式坐便器，所以...",
      "title": "在美國、英國和丹麥等一些西方國家，廁所除了沖水之外，根本沒有供水，他們只是使用衛生紙，這是真的嗎？這怎麼可能呢？"
    }
  ]
}