{
  "author": "Pietro405",
  "the_new_excerpt": "I have never contemplated investing in steel but after a lot of DD I started a\nsmall position today.\n\nI believe with it acquisition of Arcelor Mittal , CLF is not just a raw steel\nsupplier but a processor ( added value; higher margin in teh supply chain).\nThere us a lot of skepticism by ANAL_ysts (…",
  "original_created_utc": 1619135926,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スチールへの投資を考えたことはありませんでしたが、多くのDDを経て、今日、小さなポジションを始めました。\n今日は小さなポジションを持ちました。\n\nアルセロール・ミッタルを買収したことで、CLFは単なる鉄鋼原料の供給者ではなく、加工業者になったと思います。\n加工業者（サプライチェーンにおける付加価値や高い利益率）になると思います。\nアナリストの間では懐疑的な意見が多いですが（...",
      "title": "CLF Cleveland Cliffs; 私の祖父の株ですが、ファンダメンタルとチャートも好きです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来没有考虑过投资钢铁，但经过大量的DD，我今天开始了一个\n今天开始小规模持仓。\n\n我相信通过收购Arcelor Mittal，CLF不仅仅是一个原料钢供应商，而是一个加工厂。\n而是一个加工商（附加值；供应链中的高利润）。\n我们有很多分析家对其持怀疑态度（...",
      "title": "CLF Cleveland Cliffs；我祖父的股票，但我也喜欢基本面和图表。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來沒有考慮過投資鋼鐵，但經過大量的DD，我今天開始了一個\n今天開始小規模持倉。\n\n我相信通過收購Arcelor Mittal，CLF不僅僅是一個原料鋼供應商，而是一個加工廠。\n而是一個加工商（附加值；供應鏈中的高利潤）。\n我們有很多分析家對其持懷疑態度（...",
      "title": "CLF Cleveland Cliffs；我祖父的股票，但我也喜歡基本面和圖表。"
    }
  ],
  "title": "CLF Cleveland Cliffs; my grandfathers stock but I like fundamental and the chart too",
  "created_utc": 1619174581,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have never contemplated investing in steel but after a lot of DD I started a small position today.</p>\n\n<p>I believe with it acquisition of Arcelor Mittal , CLF is not just a raw steel supplier but a processor ( added value; higher margin in teh supply chain). There us a lot of skepticism by ANAL_ysts ( trend followers) because they fail to capture the transformation taking place IMHO.</p>\n\n<p>Cramer:  <strong>Cleveland-Cliffs Inc</strong> (NYSE: CLF) is a very undervalued stock and a great cyclical stock, said Cramer. It&#39;s a winner for him.</p>\n\n<p>Research Alert: CFRA Maintains Strong Buy Opinion On Shares Of Cleveland-cliffs Inc.</p>\n\n<p>BY MT Newswires— 04/22/2021</p>\n\n<p>Commodity stocks are on fire and if indeed Biden and the blues pass a Infra bill then iron and steel are one of the building blocks. Would welcome (constructive ) criticism from any one.</p>\n</div><!-- SC_ON -->",
  "score": 94,
  "permalink": "/r/stocks/comments/mwiecs/clf_cleveland_cliffs_my_grandfathers_stock_but_i/",
  "subreddit": "stocks",
  "id": "mwiecs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776214687
}