{
  "author": "puddlesofmustard",
  "original_created_utc": 1652402136,
  "title": "What do you think Do Kwon is doing right now?",
  "created_utc": 1652419936,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Do you think he&amp;#39;s just absolutely losing his mind right now? He&amp;#39;s still watching everything burn to the ground and has gone silent since tweeting yesterday about how he was in the process of fixing this whole mess. Circulating supply of luna has sky rocketed today going from 345 million to 210 billion as of writing this and it doesn&amp;#39;t seem to be slowing down at all. He talked a lot smack going into all of this so I truly wonder where his head is at right  now. &lt;/p&gt;\n\n&lt;p&gt;I also wonder if we will ever hear from him again. I personally hope that he pops up 3 months from now, pretends this never happened, then offers us a limited series NFT. I would also like to see him introduce a new stable coin called &amp;quot;SafeLuna&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know. I couldn&amp;#39;t possibly imagine where his head is at right now. What do you guy&amp;#39;s think?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/uofhvf/what_do_you_think_do_kwon_is_doing_right_now/",
  "subreddit": "CryptoCurrency",
  "id": "uofhvf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Do you think he's just absolutely losing his mind right now? He's still watching\neverything burn to the ground and has gone silent since tweeting yesterday about\nhow he was in the process of fixing this whole mess. Circulating supply of luna\nhas sky rocketed today going from 345 million to 210…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は今、絶対に気が狂っていると思いますか？彼はまだ見ている\n昨日のツイート以来、沈黙を守っています。\n昨日ツイートして以来沈黙している ルナの流通量\n3億4500万から2億1000万に急増した...",
      "title": "ドグォンさんは今、何をしていると思いますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你认为他现在完全失去了理智吗？他还在看着\n一切都被烧成了灰烬，而且自从昨天在推特上说他正在解决这整个混乱局面后，就一直保持沉默。\n自从昨天在推特上说他正在解决这整个混乱的问题后，他就一直沉默不语。月球的循环供应\n从3.45亿飙升至2.1亿......。",
      "title": "你认为杜权现在在做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你認爲他現在完全失去了理智嗎？他還在看着\n一切都被燒成了灰燼，而且自從昨天在推特上說他正在解決這整個混亂局面後，就一直保持沉默。\n自從昨天在推特上說他正在解決這整個混亂的問題後，他就一直沉默不語。月球的循環供應\n從3.45億飆升至2.1億......。",
      "title": "你認爲杜權現在在做什麼？"
    }
  ]
}