{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Hi, all.\n\nFor those who have been following my warnings in my [first](https://www.reddit.com/r/stocks/comments/u521ic/beware_the_powcycle/?context=3) and [second](https://www.reddit.com/r/stocks/comments/u9mj9o/powcycle_the_next_turn/) POWcycle post, going back three weeks, I explained that \"the POWcycle is a threat to your wealth.\"\n\nUnfortunately, the POWcycle that just ended was the severest yet. I'm not going to offer any further analysis here, only advice:  \n\n\n* **Don't sell for a loss!** The institutional algos are working nonstop to trick us. Don't sell or you'll permanently delete capital at a loss. I know how hard it is, emotionally, but you've got to hang on. Don't let them steal your money!\n* **For positions in the green, avoid holding long shares or bullish options positions (especially shorted puts) on growth stocks through earnings.** We've seen some devastating collapses on the slightest misses at earnings calls, such as DOCN and NET. It's not worth taking the risk to hold through earnings. Overall, the odds are against us. (Some stocks have dropped even after beating EPS and revenue expectations as the result of guidance concerns and severely negative sentiment.)\n* **Don't make any bullish bets on growth stocks yet.** It's better to be late and safe rather than early and sorry. Anecdotal observations by Americans in China suggest that the virus is spreading far more than the Chinese government is letting on. This is impacting both factory production and shipping. No one knows how bad it will get, or how soon, but just in case, it's better to be patient and cautious over the coming months. Additionally, the unpredictable war against Ukraine, wild volatility, and economic data that shows that the inflationary situation is far worse than The JPow is telling us should make us very cautious. \n* **Be careful about chasing oil and other commodities in the green.** Share prices have run up drastically, and retail traders usually wind up chasing and buying them at the top. Oil and natural gas prices are very volatile, and any diplomatic breakthrough in the war against Ukraine would cause oil prices to immediately fall off of a cliff. \n* **Avoid shorting puts.** Some institutional algos are cleverly programmed to create volatility to exploit retail trading data that the institutions pay a lot of money for and trigger margin calls in the options market. No matter how green the market might be on any particular day, remember that the economic picture is deteriorating as we head for a recession.\n* **Don't try to hedge, because it's too late at this point.** Buying puts or shorting shares is dangerous because of the possibility of a relief rally, the timing of which is unpredictable and could do even more damage to your portfolio. In these conditions, the best thing that retail investors and traders can do is nothing at all.\n* **Don't blindly trust The JPow.** Many of us watched him at his press conference yesterday, Wed 4 May, after the FOMC meeting concluded. He made it sound as if the economy was in pretty good shape and that the labor market was still strong. When he calmly and reassuringly announced that the Fed isn't considering hiking rates by +0.75%, retail traders went crazy with buying what they thought was the dip, but the institutional algos knew better and only too happily sold into strength.   Then, today, share prices collapsed and the market bled like Gettysburg. Instead of trusting The JPow's statements, study the data and make up your own mind. One good website for this is [Trading Economics](https://tradingeconomics.com/indicators). \n* **Don't be fooled by relief rallies.** Institutional algos know that retail investors focus on daily price action and lack the context that institutions have, thanks to their sophisticated econometric   \nmodels. While retail traders buy on what they think is a sustainable rally, the algos sell into temporary strength. When retail traders get scared and panic-sell, algos buy for a steep discount.\n* **Save money from other sources and wait for the right opportunity.** Market conditions are creating generational buying opportunities on growth stocks. Despite inflation, a large cash position will become extremely valuable later this year. \n* **If you don't have a job right now and are looking for one, try hard to speed the process along.** I believe that the coming recession will make finding a job much more difficult, and it will also lead to job losses as consumers stop spending money, corporate revenue drops, and capital spending drops. The JPow said that the availability of jobs is very high relative to demand. But he didn't say that most of those jobs aren't jobs that anyone would actually want. \n* **Please ask for help if you need it.** During previous market crashes, [the suicide rate increased](https://www.open.ac.uk/research/news/stock-market-crashes-linked-higher-rates-suicide) and lasted for a year afterward. This is a horrible tragedy, but for every one of these suicides, there are countless people who become depressed and spiral downward. Whatever you do, don't isolate from other people. Get support. Nothing is as bad as it seems, and in the stock and options markets, nothing is permanent—even the worst news.\n\nRight now, our goal needs to be to preserve as much capital as possible. The probability of making money in these conditions is low. If you can hold on, the best of the growth stocks that you own that have dropped 50% to 90% will reverse powerfully. Even if it takes years of waiting, it will be worth it. \n\nPlease remember that the POWcycles haven't stopped. I urge anyone who hasn't read my previous messages to do so, and make decisions based on hard economic and stock-specific financial data. \n\nHang in there, guys. I know how hard this is. It affects all of us. \n\nWe're going to eventually climb out of it together!\n\nArtem, MBA",
  "author_fullname": "t2_4c1jbiau",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "POWcycle: The Next Day",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_uja7np",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.88,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 43,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 43,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1651793295,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi, all.&lt;/p&gt;\n\n&lt;p&gt;For those who have been following my warnings in my &lt;a href=\"https://www.reddit.com/r/stocks/comments/u521ic/beware_the_powcycle/?context=3\"&gt;first&lt;/a&gt; and &lt;a href=\"https://www.reddit.com/r/stocks/comments/u9mj9o/powcycle_the_next_turn/\"&gt;second&lt;/a&gt; POWcycle post, going back three weeks, I explained that &amp;quot;the POWcycle is a threat to your wealth.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Unfortunately, the POWcycle that just ended was the severest yet. I&amp;#39;m not going to offer any further analysis here, only advice:  &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t sell for a loss!&lt;/strong&gt; The institutional algos are working nonstop to trick us. Don&amp;#39;t sell or you&amp;#39;ll permanently delete capital at a loss. I know how hard it is, emotionally, but you&amp;#39;ve got to hang on. Don&amp;#39;t let them steal your money!&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;For positions in the green, avoid holding long shares or bullish options positions (especially shorted puts) on growth stocks through earnings.&lt;/strong&gt; We&amp;#39;ve seen some devastating collapses on the slightest misses at earnings calls, such as DOCN and NET. It&amp;#39;s not worth taking the risk to hold through earnings. Overall, the odds are against us. (Some stocks have dropped even after beating EPS and revenue expectations as the result of guidance concerns and severely negative sentiment.)&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t make any bullish bets on growth stocks yet.&lt;/strong&gt; It&amp;#39;s better to be late and safe rather than early and sorry. Anecdotal observations by Americans in China suggest that the virus is spreading far more than the Chinese government is letting on. This is impacting both factory production and shipping. No one knows how bad it will get, or how soon, but just in case, it&amp;#39;s better to be patient and cautious over the coming months. Additionally, the unpredictable war against Ukraine, wild volatility, and economic data that shows that the inflationary situation is far worse than The JPow is telling us should make us very cautious. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Be careful about chasing oil and other commodities in the green.&lt;/strong&gt; Share prices have run up drastically, and retail traders usually wind up chasing and buying them at the top. Oil and natural gas prices are very volatile, and any diplomatic breakthrough in the war against Ukraine would cause oil prices to immediately fall off of a cliff. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Avoid shorting puts.&lt;/strong&gt; Some institutional algos are cleverly programmed to create volatility to exploit retail trading data that the institutions pay a lot of money for and trigger margin calls in the options market. No matter how green the market might be on any particular day, remember that the economic picture is deteriorating as we head for a recession.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t try to hedge, because it&amp;#39;s too late at this point.&lt;/strong&gt; Buying puts or shorting shares is dangerous because of the possibility of a relief rally, the timing of which is unpredictable and could do even more damage to your portfolio. In these conditions, the best thing that retail investors and traders can do is nothing at all.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t blindly trust The JPow.&lt;/strong&gt; Many of us watched him at his press conference yesterday, Wed 4 May, after the FOMC meeting concluded. He made it sound as if the economy was in pretty good shape and that the labor market was still strong. When he calmly and reassuringly announced that the Fed isn&amp;#39;t considering hiking rates by +0.75%, retail traders went crazy with buying what they thought was the dip, but the institutional algos knew better and only too happily sold into strength.   Then, today, share prices collapsed and the market bled like Gettysburg. Instead of trusting The JPow&amp;#39;s statements, study the data and make up your own mind. One good website for this is &lt;a href=\"https://tradingeconomics.com/indicators\"&gt;Trading Economics&lt;/a&gt;. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Don&amp;#39;t be fooled by relief rallies.&lt;/strong&gt; Institutional algos know that retail investors focus on daily price action and lack the context that institutions have, thanks to their sophisticated econometric&lt;br/&gt;\nmodels. While retail traders buy on what they think is a sustainable rally, the algos sell into temporary strength. When retail traders get scared and panic-sell, algos buy for a steep discount.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Save money from other sources and wait for the right opportunity.&lt;/strong&gt; Market conditions are creating generational buying opportunities on growth stocks. Despite inflation, a large cash position will become extremely valuable later this year. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;If you don&amp;#39;t have a job right now and are looking for one, try hard to speed the process along.&lt;/strong&gt; I believe that the coming recession will make finding a job much more difficult, and it will also lead to job losses as consumers stop spending money, corporate revenue drops, and capital spending drops. The JPow said that the availability of jobs is very high relative to demand. But he didn&amp;#39;t say that most of those jobs aren&amp;#39;t jobs that anyone would actually want. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Please ask for help if you need it.&lt;/strong&gt; During previous market crashes, &lt;a href=\"https://www.open.ac.uk/research/news/stock-market-crashes-linked-higher-rates-suicide\"&gt;the suicide rate increased&lt;/a&gt; and lasted for a year afterward. This is a horrible tragedy, but for every one of these suicides, there are countless people who become depressed and spiral downward. Whatever you do, don&amp;#39;t isolate from other people. Get support. Nothing is as bad as it seems, and in the stock and options markets, nothing is permanent—even the worst news.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Right now, our goal needs to be to preserve as much capital as possible. The probability of making money in these conditions is low. If you can hold on, the best of the growth stocks that you own that have dropped 50% to 90% will reverse powerfully. Even if it takes years of waiting, it will be worth it. &lt;/p&gt;\n\n&lt;p&gt;Please remember that the POWcycles haven&amp;#39;t stopped. I urge anyone who hasn&amp;#39;t read my previous messages to do so, and make decisions based on hard economic and stock-specific financial data. &lt;/p&gt;\n\n&lt;p&gt;Hang in there, guys. I know how hard this is. It affects all of us. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re going to eventually climb out of it together!&lt;/p&gt;\n\n&lt;p&gt;Artem, MBA&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "uja7np",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "4rt3m0rl0v",
  "discussion_type": null,
  "num_comments": 24,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/uja7np/powcycle_the_next_day/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/uja7np/powcycle_the_next_day/",
  "subreddit_subscribers": 3992979,
  "created_utc": 1651812997,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1651793295,
  "the_new_excerpt": "Hi, all.\n\nFor those who have been following my warnings in my first\n[https://www.reddit.com/r/stocks/comments/u521ic/beware_the_powcycle/?context=3]\nand second\n[https://www.reddit.com/r/stocks/comments/u9mj9o/powcycle_the_next_turn/]\nPOWcycle post, going back three weeks, I explained that \"the…"
}