{
  "author": "heyheoy",
  "original_created_utc": 1635078999,
  "title": "2008 financial crisis post is misleading, 47 bankers have been jailed, half of them just on Iceland.",
  "created_utc": 1635115177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Forty-seven bankers were sentenced to jail time for their role in the financial crisis, Financial Times research has found, dispelling the myth that no one was held personally accountable for the financial sector’s catastrophic failures.</p>\n\n<p>The FT searched records and news reports from across Europe and the US to uncover how many bank employees and directors recieved jail sentences for issues directly linked to the crisis or the collapse of their institutions.</p>\n\n<p>The data does not include traders and other bank staff jailed for their role in interest rate rigging, like the two <a href=\"https://www.ft.com/content/c970a0c0-8b53-11e8-b18d-0181731a0340\">Deutsche Bank traders jailed</a> for interest rate rigging earlier this year, or for rogue trading not directly linked to the crisis or a bank collapse, like UBS’s Kweku Adoboli, who is now <a href=\"https://www.ft.com/content/3c77180c-a1a6-11e8-85da-eeb7a9ce36e4\">facing deportation</a>.</p>\n\n<p>Iceland had far and away the highest incidence of jailing, accounting for 25 of cases. The country seized control of its banks in October 2008 and imposed capital controls which ran for eight years to stave off chaos.</p>\n\n<p>Chief executives, account managers, traders and chairmen from four banks were sentenced to term of between six months and five and a half years for everything from market manipulation to ‘gross breach of fiduciary duty’.</p>\n\n<p>Luckily for them, Iceland has some of the <a href=\"https://grapevine.is/mag/articles/2011/09/27/doingtimeiniceland/\">plushest jails</a> in the world, with an ethos framed around rehabilitation rather than punishment. Prisoners are allowed flat screens TVs up to 26 inches, personal computers and games, and can apply to leave as often as once a month after they have served a third of their sentence.</p>\n\n<p>Eleven Spanish bankers were sentenced to jail time for issues relating to Spain’s 2012 banking collapse, <a href=\"https://www.ft.com/content/7f93082e-f9ed-11e6-bd4e-68d53499ed71\">most notably Rodrigo Rato</a>, the former head of the International Monetary Fund who chaired Bankia in the run up to its collapse.</p>\n\n<p>Ireland, where the €67bn bank bailout bill forced the country into a sovereign bailout, jailed seven, but convictions of two bankers — Bernard Daly and Tiarnan O’Mahoney — were later quashed.</p>\n\n<p>The most controversial was the case of Aoife Maguire, a former assistant manager at Anglo Irish Bank who was convicted of ordering the deletion of records relating to the accounts of former chief executive Sean FitzPatrick. Ireland’s Court of Appeal ultimately found her eighteen month sentence was “unnecessarily severe”, and shortened it to nine months, four of which were suspended.</p>\n\n<p>The US, ground zero for the financial crisis, has jailed just one banker for issues relating to the crisis. Former Credit Suisse trader Kareem Serageldin was sentenced to thirty months in prison for artificially inflating the price of subprime mortgages, a financial product at the very heart of Wall Street’s unravelling.</p>\n\n<p>sauce with nice time graphics: <a href=\"https://ig.ft.com/jailed-bankers/\">https://ig.ft.com/jailed-bankers/</a></p>\n\n<p>&#x200B;</p>\n\n<p>US had 1 guy jailed, and people think that they didnt because they should be 100 or even more for sure, but the world isnt just US, some other places like Iceland did things right.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/j-JWh-4LaUSpujCr6e8495I9dUn1kM68oMZgxLrVCho.jpg?auto=webp&s=f7e62365edd0ae546448c7047141ae585598fc8f",
          "width": 900,
          "height": 506
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/j-JWh-4LaUSpujCr6e8495I9dUn1kM68oMZgxLrVCho.jpg?width=108&crop=smart&auto=webp&s=cde4bcc904317a6ad75c9fa5304024ee2005e611",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/j-JWh-4LaUSpujCr6e8495I9dUn1kM68oMZgxLrVCho.jpg?width=216&crop=smart&auto=webp&s=b1338b0326acd757df63ea8255518489ea26558d",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/j-JWh-4LaUSpujCr6e8495I9dUn1kM68oMZgxLrVCho.jpg?width=320&crop=smart&auto=webp&s=4cf4490f67876386beb0455e9e9221a27ab64d24",
            "width": 320,
            "height": 179
          },
          {
            "url": "https://external-preview.redd.it/j-JWh-4LaUSpujCr6e8495I9dUn1kM68oMZgxLrVCho.jpg?width=640&crop=smart&auto=webp&s=52481f0cf4a1f35683ea71480aa9db4862e92847",
            "width": 640,
            "height": 359
          }
        ],
        "variants": {},
        "id": "NnaHS48H1pokBub23QEMvhuwG1ajYmkpR-fnDP-gyLI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/qerbtm/2008_financial_crisis_post_is_misleading_47/",
  "subreddit": "CryptoCurrency",
  "id": "qerbtm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Forty-seven bankers were sentenced to jail time for their role in the financial\ncrisis, Financial Times research has found, dispelling the myth that no one was\nheld personally accountable for the financial sector’s catastrophic failures.\n\nThe FT searched records and news reports from across Europe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "金融危機に関与した47人の銀行家が実刑判決を受けました。\nフィナンシャル・タイムズ紙の調査によると、金融危機で個人的な責任を問われた銀行員はいなかったという神話を覆す結果となりました。\nこれは、金融セクターの壊滅的な失敗に対して誰も個人的な責任を問われなかったという神話を払拭するものです。\n\nフィナンシャル・タイムズ紙は、ヨーロッパ中の記録やニュースレポートを検索して...",
      "title": "2008年の金融危機の記事は誤解を招く恐れがありますが、47人の銀行員が投獄され、そのうちの半分はアイスランドで投獄されました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "47名银行家因其在金融危机中的作用而被判处监禁。\n金融时报》的研究发现，消除了没有人对金融业的灾难负责的神话。\n金融时报》的研究发现，有47名银行家因其在金融危机中的作用而被判刑，这打破了没有人因金融业的灾难性失败而被追究个人责任的神话。\n\n金融时报》搜索了欧洲各地的记录和新闻报道...",
      "title": "2008年金融危机的帖子是误导性的，47名银行家已经入狱，其中一半只是在冰岛。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "47名銀行家因其在金融危機中的作用而被判處監禁。\n金融時報》的研究發現，消除了沒有人對金融業的災難負責的神話。\n金融時報》的研究發現，有47名銀行家因其在金融危機中的作用而被判刑，這打破了沒有人因金融業的災難性失敗而被追究個人責任的神話。\n\n金融時報》搜索了歐洲各地的記錄和新聞報道...",
      "title": "2008年金融危機的帖子是誤導性的，47名銀行家已經入獄，其中一半隻是在冰島。"
    }
  ]
}