{
  "author": "Appropriate_Win_7829",
  "original_created_utc": 1655726131,
  "title": "Realistically, how long a winter do you reckon we are in for?",
  "created_utc": 1655790202,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know crypto is unpredictable, and nobody has any idea what tomorrow will be like, never mind years from now. But based on the current climate, and your gut, how long a bear market do you we reckon we are in for? &lt;/p&gt;\n\n&lt;p&gt;Personally I think it’s going to be a long one, as in 2024/25 before we see any real upturn. Admittedly the next halving may speed things up a bit but I’ll be very impressed if we’re not looking at a minimum of 2-3 years of bear. &lt;/p&gt;\n\n&lt;p&gt;On the plus side, it’s 2-3 years to fill those bags :)&lt;/p&gt;\n\n&lt;p&gt;Anyway, that’s my 2 cents. Is anybody thinking longer or shorter?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/vgjqxs/realistically_how_long_a_winter_do_you_reckon_we/",
  "subreddit": "CryptoCurrency",
  "id": "vgjqxs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know crypto is unpredictable, and nobody has any idea what tomorrow will be\nlike, never mind years from now. But based on the current climate, and your gut,\nhow long a bear market do you we reckon we are in for?\n\nPersonally I think it’s going to be a long one, as in 2024/25 before we see any\nreal…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号は予測不可能であり、誰も明日がどうなるかを知らないことは知っている。\n何年後か分からないが しかし、現在の情勢とあなたの直感に基づけば、\n弱気相場はどのくらい続くと思われますか？\n\n個人的には、2024年から25年という長い期間になると思います。\n本当の...",
      "title": "現実的に、冬はどのくらい続くとお考えでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道加密货币是不可预测的，没有人知道明天会是什么样子。\n样子，更不用说几年后了。但根据目前的气候，以及你的直觉。\n你认为我们的熊市会有多长？\n\n我个人认为，这将是一个漫长的过程，在2024/25年之前，我们会看到任何\n真正意义上的熊市。",
      "title": "现实地说，你认为我们的冬天会有多长？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道加密貨幣是不可預測的，沒有人知道明天會是什麼樣子。\n樣子，更不用說幾年後了。但根據目前的氣候，以及你的直覺。\n你認爲我們的熊市會有多長？\n\n我個人認爲，這將是一個漫長的過程，在2024/25年之前，我們會看到任何\n真正意義上的熊市。",
      "title": "現實地說，你認爲我們的冬天會有多長？"
    }
  ]
}