{
  "author": "daymonhandz",
  "the_new_excerpt": "I don't think many of the users in here nowadays realize that bitcoin is just a\nsoftware protocol, so I'm going to tell a story about the bitcoin protocol and a\ngreat cypherpunk including Satoshi, Hal, and Len. Bitcoin is a software protocol\n(like TCP/IP) that allows online payments to be sent…",
  "original_created_utc": 1616695116,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我想现在在座的很多用户都没有意识到，比特币只是一个\n软件协议，所以我要讲一个关于比特币协议的故事和一个\n伟大的赛弗朋克，包括Satoshi，Hal和Len。比特币是一种软件协议\n(像TCP/IP)，允许发送在线支付... ...",
      "title": "比特币是一个软件协议。Satoshi, Hal, 和Len是Cypherpunks."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想現在在座的很多用戶都沒有意識到，比特幣只是一個\n軟件協議，所以我要講一個關於比特幣協議的故事和一個\n偉大的賽弗朋克，包括Satoshi，Hal和Len。比特幣是一種軟件協議\n(像TCP/IP)，允許發送在線支付... ...",
      "title": "比特幣是一個軟件協議。Satoshi, Hal, 和Len是Cypherpunks."
    }
  ],
  "title": "Bitcoin is a software protocol. Satoshi, Hal, and Len were cypherpunks.",
  "created_utc": 1616708521,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t think many of the users in here nowadays realize that bitcoin is just a software protocol, so I&#39;m going to tell a story about the bitcoin protocol and a great cypherpunk including Satoshi, Hal, and Len. Bitcoin is a software protocol (like TCP/IP) that allows online payments to be sent directly from one party to another without the trust or permission of anyone else. Bitcoin is currently at the second stage of the evolution of money which is a store of value. Once bitcoin&#39;s gets closer to it&#39;s true value, it could possibly move to the next stage of the evolution of money of money, which is a popular medium of exchange. <a href=\"https://www.reddit.com/r/Bitcoin/comments/ma1y9b/40_yr_old_new_to_crypto/grra6s5/\">Click here</a> to see all four stages of the evolution of money. Bitcoin will remain volatile until it finds it&#39;s true value, which I expect is somewhere at 7 digits of US dollars. I&#39;m not expecting this to happen soon but I do expect it to happen before 2033, considering over 99% of bitcoin will be mined before summer 2032.</p>\n\n<p>The most likely known candidate for Satoshi was actually a well known cypherpunk named <a href=\"https://en.wikipedia.org/wiki/Len_Sassaman\">Len Sassaman</a> that helped create TCP/IP, worked on PGP with the cypherpunk <a href=\"https://en.wikipedia.org/wiki/Phil_Zimmermann\">Phil Zimmermann</a>, and was roommates with a cypherpunk named <a href=\"https://en.wikipedia.org/wiki/Bram_Cohen\">Bram Cohen</a> who invented the bittorrent protocol just 4 years before Satoshi first uploaded the bitcoin whiperpaper as the ecash whitepaper, which was less 6 months before Satoshi released bitcoin to the world and the genesis block was mined. Len also worked with another cypherpunk named <a href=\"https://en.wikipedia.org/wiki/Hal_Finney_(computer_scientist\">Hal Finney</a>.  Unfortunately Hal died from ALS in 2014. Hal also worked with Satoshi since the beginning of bitcoin and Hal was mining bitcoin from day 3 of the release. Hal even received the first bitcoin transaction which was 10 BTC sent from Satoshi himself. Hal and Len also lived close to each other and were both members of the same mailing list where Satoshi first publicly discussed bitcoin and where cypherpunk topics like anonymity, privacy, decentralization, reputation, and digital cash were the topics of discussion. This is also where Satoshi made the bitcoin launch announcements and the release announcement because it&#39;s the only possible place where anyone would possibly listen to him and care to run the bitcoin client to try mining and help the bitcoin network get started. </p>\n\n<p>In December 2010, Satoshi was upset about <a href=\"https://www.pcworld.com/article/213230/could_wikileaks_scandal_lead_to_new_virtual_currency.html\">wikileaks accepting bitcoin</a> when bitcoin was still small enough to be destroyed, and he publicly asked wikileaks not to accept bitcoin. Satoshi made one more post and then he stopped posting. Len proposed to a fellow cypherpunk software developer only 2 months later, and he got married. Mike Hearn emailed Satoshi and asked what he was doing with the project and Satoshi said he moved on to other things, and that left bitcoin in good hands with Gavin and the other developers. Shortly after that after that, Gavin told us that he accepted an offer to go teach the CIA about bitcoin for $3k. I suspect that Gavin informed Satoshi about his plans of going to visit the CIA and/or the CIA also contacted Satoshi, and I&#39;m guessing that&#39;s why Satoshi suddenly left the bitcoin project. Bitcoin really needs to have no central leader to be successful anyways, because a leader is just a point of centralization. Less than 2 months after that is when Len passed away. <a href=\"https://pastebin.com/raw/BUB3dygQ\">Click here to see Len&#39;s obituary, including two ASCII portraits, that is encoded into block 138725 of the bitcoin blockchain.</a> Nobody will ever know if Len is Satoshi but even if he isn&#39;t, he was still a talented man who did great things.</p>\n\n<p>I find it amusing when I see shitcoiners saying bitcoin is like myspace, netscape, or yahoo. Bitcoin isn&#39;t a social media platform, a web browser, or a search engine lol bitcoin is a protocol like TCP/IP and bittorrent. Imagine someone claiming that they&#39;re going to replace TCP/IP and trying to sell you tokens that are supposed to go up in value because of it lol that&#39;s what shitcoiners are doing to newbies saying they will replace the bitcoin protocol. Think about this, it&#39;s 17 years after bittorent was released now, and it&#39;s still impossible for anyone to stop file sharing even though they have tried. This is because people are still using the bittorrent protocol made by Len&#39;s roommate to share files in an unstoppable and decentralized way. Shitcoiners are just clueless and they&#39;re being scammed by con artists and fellow shitcoin-cult members and I genuinely feel bad for them. Compare shitcoins and their founders to bitcoin and Satoshi which had no premine, no developer fund, no developer tax, never sold, no profit, no fame for his real identity, removed himself from the project, no leader, and he gave a two month heads up about before he launched bitcoin. Every shitcoiner has Satoshi to thank for all of the cryptocurrencies that even exist because Satoshi paved the way and it&#39;s impossible for anyone to ever replicate the exact way that he launched bitcoin because the genie is out of the bottle and cryptocurrency now exists so it&#39;s 100% impossible to ever have a cryptocurrency where the coins are circulating in the wild freely for 18 months before having any value like bitcoins were.</p>\n\n<p>People like the rocket scientist Michael Saylor see the potential for the bitcoin protocol to be the backbone of the financial system like TCP/IP, HTTP, and TLS are to the internet. Immense wealth can be safely stored on the blockchain and large settlements can take place on-chain. This is why bitcoin will never make any sacrifices when it comes to the security and integrity of the blockchain. Shitcoiners don&#39;t understand this and want low miner fees. They don&#39;t understand that everything else can happen off-chain using second layer solutions and sidechains. The lightning network is one of bitcoin&#39;s layer 2 solutions that allow an unlimited amount of users to send and receive bitcoin instantly for nearly no fees. Various sidechains are in development like another layer 2 solution called the liquid network. We&#39;re also getting schnorr signatures and taproot later this year. Bitcoin is a new technology that&#39;s constantly being developed and the latest version is still only 0.21.0</p>\n\n<p>In case you didn&#39;t know, Michael Saylor isn&#39;t trying to pump bitcoin and build his wealth for him or his children. He has no heirs to pass his wealth down to. He offers free college courses through his <a href=\"https://learn.saylor.org/\">Saylor Academy</a> and he&#39;s building his wealth to do great philanthropic things like provide free college. He&#39;s just a genius billionaire entrepreneur philanthropist with no children that wants to do great things to help people. He also predicted the mobile wave, much like he&#39;s predicting future of bitcoin as the backbone of the financial system.</p>\n\n<p><a href=\"https://nakamotoinstitute.org/static/docs/cypherpunk-manifesto.txt\">Click here to read a cypherpunk&#39;s manifesto written by Eric Hughes in March 1993.</a> It describes the future we are currently living in. It also describes bitcoin and explains the importance of privacy and decentralized cash like bitcoin. These cypherpunks like Satoshi, Hal, Len, Phil, and others are the only reason that we have bitcoin, consumer cryptography, and any digital privacy today.</p>\n\n<p><strong>TL;DR</strong> - Bitcoin is just a software protocol much like TCP/IP and bittorrent are just software protocols. Satoshi was a cypherpunk and his real identity is probably Len, the same cypherpunk who helped create TCP/IP. Len also worked on PGP with the cypherpunk Phil, and was roommates with a cypherpunk named Bram who invented the bittorrent protocol just 4 years before Satoshi first uploaded the bitcoin whiperpaper as the ecash whitepaper, which was less 6 months before Satoshi released bitcoin to the world and the genesis block was mined. Len also worked with another cypherpunk named Hal, who I&#39;m sure most of you already know of. Len and Hal lived close to each other. Hal was the first person to mine bitcoin after Satoshi and Satoshi sent the first bitcoin transaction to Hal. They both passed away. Rest in peace. Cypherpunks like these are the only reason that we have bitcoin, consumer cryptography, and any digital privacy today.</p>\n</div><!-- SC_ON -->",
  "score": 999,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/VhsvqprW9qyFoQ2ftPvUHVSLc-3Suo_GZ3EQf3aOcGM.jpg?auto=webp&s=89f3be6948f6d70d7bde09c6198374dbaefd88f1",
          "width": 220,
          "height": 330
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/VhsvqprW9qyFoQ2ftPvUHVSLc-3Suo_GZ3EQf3aOcGM.jpg?width=108&crop=smart&auto=webp&s=ecd994f9f2094b79c5ee6753339807a2ee43af8c",
            "width": 108,
            "height": 162
          },
          {
            "url": "https://external-preview.redd.it/VhsvqprW9qyFoQ2ftPvUHVSLc-3Suo_GZ3EQf3aOcGM.jpg?width=216&crop=smart&auto=webp&s=b0c1b306e37ee6459ff4b7ea605000bb3f6c713a",
            "width": 216,
            "height": 324
          }
        ],
        "variants": {},
        "id": "xMcqadqJwIHCjw84AwZkPxlTqWuZ3IjAI7sJpLGIU9s"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/md49ju/bitcoin_is_a_software_protocol_satoshi_hal_and/",
  "subreddit": "Bitcoin",
  "id": "md49ju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357132822
}