{
  "author": "MentalValueFund",
  "the_new_excerpt": "FYI This is going to cover some very fundamental stuff that I'm sure a lot of\nyou already know, however since there's plenty of casuals and new joiners, I\nfigured it might be worthwhile to give a primer on.\n\nHere's a simple question: What is a stock worth right now and why?\n\nThere's lots of ways to…",
  "original_created_utc": 1614997308,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "顺便说一下，这将涵盖一些非常基本的东西，我相信很多的\n你已经知道了，但是因为有很多散客和新加入的人，我。\n想到这可能是值得给一个初步的。\n\n这里有一个简单的问题。一支股票现在值多少钱，为什么？\n\n有很多方法... ...",
      "title": "PSA：为什么国债利率对你的基本股票估值很重要？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "順便說一下，這將涵蓋一些非常基本的東西，我相信很多的\n你已經知道了，但是因爲有很多散客和新加入的人，我。\n想到這可能是值得給一個初步的。\n\n這裏有一個簡單的問題。一支股票現在值多少錢，爲什麼？\n\n有很多方法... ...",
      "title": "PSA：爲什麼國債利率對你的基本股票估值很重要？"
    }
  ],
  "title": "PSA: Why Treasury Rates matter for your Fundamental Equity Valuations",
  "created_utc": 1615005000,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>FYI This is going to cover some very fundamental stuff that I&#39;m sure a lot of you already know, however since there&#39;s plenty of casuals and new joiners, I figured it might be worthwhile to give a primer on.</em></p>\n\n<p>Here&#39;s a simple question: <strong>What is a stock worth right now and why?</strong></p>\n\n<p>There&#39;s lots of ways to answer this question, many (revenue multiples, earnings multiples, etc) are short hand or simplified ways of describing the same thing.</p>\n\n<p>The foundation of modern finance answers this with: <strong>The Present Value of all Future Cash Flows</strong></p>\n\n<p>Regardless of whether you&#39;re talking about equity in a growth tech company, a value oriented utilities operator, or even a distressed oil company, the answer can be broken down further into two components or sets of assumptions:</p>\n\n<ol>\n<li>What are those future cash flows this company will produce for this equity share I&#39;m buying?</li>\n<li>What discount do I give them to calculate their value today?</li>\n</ol>\n\n<h1>Future Cash Flows:</h1>\n\n<p>The first component I imagine everyone is conceptually super familiar with. Everyone see&#39;s headlines about revenue growth or earnings growth and some kind of % figure that gets them excited. So when it comes to the value of equity, which do we care about?</p>\n\n<p>The answer here is less commonly thrown around. The cash flows we calculate into for an equity valuation are the <strong>Free Cash Flow to Equity</strong>, or <strong>FCFE.</strong></p>\n\n<p>In short, <strong>FCFE</strong> is how much cash is available to all shareholders <strong>AFTER</strong> all expenses, reinvestment, and debts have been paid. A comparison for personal income would be, this is like calculating how much you have left each month from your paycheck after you take out taxes, pay for groceries, pay that student loan bill, pay rent, and pay for that oil change on your car.</p>\n\n<p>So how do you calculate a company&#39;s <strong>FCFE</strong>? Thankfully lots of companies do this already in their non-GAAP calculations, but if they don&#39;t it&#39;s relatively simple on your own.</p>\n\n<p><code>FCFE = CFO - Capital Expenditures + Net Debt</code></p>\n\n<p>Thankfully CFO is a standard GAAP accounting figure you&#39;ll always have. Capital expenditures are generally straight forward but can be disguised. And net debt is the net change in debt balances, if you issue more debt, more cash is coming in the door, that&#39;s considered that higher cash flow to the shareholders.</p>\n\n<p>So this gives you an idea of excess cash that theoretically is coming back into your pocket as an owner of the equity. But you can&#39;t do this for infinite years right? At some point you have to just create a final value at some point in the future. This is called our &quot;Terminal Value&quot; and it represents some generic assumptions about growth and costs of capital to give you an idea of what all the years beyond that are worth. The formula is pretty straight forward. If I want build a 5 year model, I will include my terminal value in year 5. The formula for figuring this out is as follows:</p>\n\n<p><code>Terminal CF = yr 5 FCFE * (1+g) / (WACC - g)</code></p>\n\n<p>Now there&#39;s a couple ways to think about this, but the easiest way is to simply view it as the value of all cash flows AFTER year 5 at an <strong>assumed growth rate (g)</strong> and assumed <strong>cost of capital (WACC)</strong>. This value is calculated as if you existed in year 5 already and assumed long run growth rate is also the same as the long run rate of growth in the economy. If you subscribe to Damodan&#39;s school of valuation (widely viewed as the authority on equity valuation modeling), there is an argument for g being the nominal gdp growth rate.</p>\n\n<p>Now that we&#39;ve put together the string of cash flows, what is the actual value of what you&#39;re receiving?</p>\n\n<h1>Discount Rates:</h1>\n\n<p>This is the second component of the answer fewer people on here seem to incorporate when thinking about stocks. The idea here is that there is some inherent discount you need to apply to something you&#39;re going to receive in the future. It&#39;s a little bit longer but stick with me.</p>\n\n<p>Let&#39;s take a step back and think about what that means. If I say I&#39;m going to give you $100 tomorrow, generally you&#39;re pretty safe in assuming that&#39;s the same as having $100 today right? Cool that&#39;s fairly easy. Now what if I tell you I&#39;ll give you $50 in 10 years and $50 in 20 years. Are you going to value that the same as scenario 1? No right? Because if you get $100 tomorrow there&#39;s still 10+ years of time to do more productive things with that money than you would have in scenario 2 (i.e. invest it etc).</p>\n\n<p>So how does this apply to valuations? Think of all those cash flows we talked about before. The value of &quot;buying the thing that gives you those cash flows&quot; is basically all of them summed up right? <strong>Wrong</strong>. Remember those cash flows are in the future... And things in the future are intrinsically worth less than they are today.</p>\n\n<p>So how do we figure out what they worth today? Well that brings us to one of the most fundamental formulas in all of finance:</p>\n\n<p><code>FV = PV (1+r)^t</code></p>\n\n<p>That is, for a <strong>given rate of growth (r)</strong> and a <strong>given amount of time (t)</strong>, we can figure out what the future value of any amount will be.  If we know our future values, but not our present, then we can just flip this around and solve it the other way:</p>\n\n<p><code>PV = FV / (1+r)^t</code></p>\n\n<p>We already know FV is just the cash flows we talked about above already. So what is the 1/(1+r)^t? That&#39;s what we call our discount factor and this is where we are finally getting to the topic of this post&#39;s title. t is super easy, years are years unless you&#39;re some sort of time traveler. The real question here is <strong>&quot;HOW DO WE KNOW WHAT RATE TO USE?&quot;</strong>. The answer in finance to discount your cash flows by the company&#39;s <strong>Weighted Average Cost of Capital</strong> or <strong>WACC</strong>. The concept here is that cost of capital comes in two broad components, cost of debt, and cost of equity. Cost of debt is sort of self explanatory. You have some debt, you owe interest on it each year, there&#39;s some marginal tax benefit by interest payments lowering your tax obligations, etc. But let&#39;s ignore this for a second and pretend we&#39;re looking at a company with zero debt.</p>\n\n<p>What the fuck is &quot;<strong>cost of equity</strong>&quot; and what does it mean? It&#39;s far less tangible of a concept because there are no explicit interest payments that you can point to as &quot;costs&quot; like there are for debt. Instead some nobel prize winning financial economists (Jack Treynor [mentor of Fischer Black], William Sharpe [known for the Sharpe Ratio], and Merton Miller [known for Modigliani-Miller Theory]) captured essence of determining an equity share&#39;s &quot;cost&quot; through a theory called the <strong>Capital Asset Pricing Model</strong> or <strong>CAPM</strong> for short. This was a formula designed to determine what &quot;cost&quot; should be assigned to an asset based on a risk free rate of return, a market rate of return, and the inherent correlation of your asset with that market. You can see where I&#39;m going with this. The formula is as follows:</p>\n\n<p><code>R(E) = Rrfr + B*(ERP)</code></p>\n\n<p>R(E) here represents the expected return of an asset. This can also be called your expected return on an equity or to the company issuing this equity it is the &quot;cost&quot; to them that&#39;s expected in return for the investor buying their equity.</p>\n\n<p>Rrfr is just shorthand for the expected return on a risk free asset. You wouldn&#39;t ever buy into an equity share with the expectation that it gives you less than what the most risk free asset is right? Cool. So in the broad scheme of things there&#39;s a couple of things you could use for this, but one of the most common is the 10 year US Treasury yield (or some other duration US Treasury note/bill/bond). The US Government is widely believed to be the most risk free counterparty in the world. It&#39;s the nature of being a reserve currency.</p>\n\n<p>B is your assets beta to the market. There&#39;s a lot we can unpack with this but for an oversimplification, let&#39;s think of it as for every 1% the broad market changes, how much does your equity change by?</p>\n\n<p>And finally, ERP. This is the Equity Risk Premium. There&#39;s several ways to approach this but the simplest is to think of it as the general expectation of investors as to how much the broad market should outperform risk free assets. People purchase equity shares with the expectation of higher returns than safer assets? Seems reasonable.</p>\n\n<p>Let&#39;s try this out with the broad market. Let&#39;s assume beta (B) is 1.0, the risk free rate is 1.0% and the ERP (expected spread between risk free and market) is 8%.</p>\n\n<p><code>R(E) = 1.5% + 1.0*(8%) = 9.5%</code></p>\n\n<p>That&#39;s a fairly reasonable rate. The sanity check here is comparing it to cost of debt. Because equities are lower in the capital structure, their cost should explicitly always be higher than the cost of debt. In the broad market companies are borrowing at less than 9.5% so that rough eyeball test checks out. If you invest in the broad equity market, your expectation is for companies to deliver 9.5% in value to you each year.</p>\n\n<p>This finally brings us back to the topic of this post. You can see, wayyyy down in the granular details of a valuation, the equity markets fundamental valuation are inherently baselined on risk free rates. Now let&#39;s combine this with what we talked about above and see why such small changes in that tiny rate can have such large outcomes in valuations.</p>\n\n<h1>Case Study: QuantumScape Corporation (NYSE: $QS)</h1>\n\n<p>I&#39;ll be honest, the reason I chose this is largely because it&#39;s one of the extreme examples that demonstrates how such small changes can make disproportionate impact. Also it seems to be a fan favorite whenever I see it mentioned.</p>\n\n<p>For a case study I want to do a super rudimentary valuation. For disclosure, this is not a robust valuation or financial advice. I&#39;m going to eliminate as many factors as possible and try to keep it just to what we talked about and help illustrate things. I&#39;m not putting this here as DD or an opinion on this stock.</p>\n\n<p>First things first, lets get some cash flows. For this we&#39;re not going to do anything fancy. When they were acquired by the [insert s word thing that shall not be named] they gave management forecasts and we&#39;re just going to take them at face value and extrapolate. Their projected first revenues will come in 2024 but it&#39;s nothing really material (14m FY24, 39m FY25, 260m FY26) until we get to FY27 (3.2bn). But remember, we don&#39;t care about revenues because as equity holders that&#39;s not what we receive. Looking at management&#39;s forecast, their Free Cash Flow doesn&#39;t turn positive until FY28 when it makes up ~8.5% of revenues. So lets use this and use some really wild assumptions. I&#39;m going to say revenues go up by 75% each year after that and FCF margins stay the same at 10% (pretty insane growth assumptions given such a capital intensive manufacturing company).</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\"></th>\n<th align=\"left\">2028</th>\n<th align=\"left\">2029</th>\n<th align=\"left\">2030</th>\n<th align=\"left\">2031</th>\n<th align=\"left\">2032</th>\n<th align=\"left\">2033</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Revenues ($m)</td>\n<td align=\"left\">6500</td>\n<td align=\"left\">11,375</td>\n<td align=\"left\">19,906</td>\n<td align=\"left\">34,836</td>\n<td align=\"left\">60,963</td>\n<td align=\"left\">106,685</td>\n</tr>\n<tr>\n<td align=\"left\">Free Cash Flow ($m)</td>\n<td align=\"left\">565</td>\n<td align=\"left\">1,138</td>\n<td align=\"left\">1,991</td>\n<td align=\"left\">3,484</td>\n<td align=\"left\">6,096</td>\n<td align=\"left\">10,669</td>\n</tr>\n</tbody></table>\n\n<p>Now we need to find our terminal value as if it is at the end of 2033 looking forward. Let&#39;s assume a relatively high steady state growth of 5% (3% real growth and 2% inflation). So our figure in year 5 is 106*(1.05)/(.19-.05) = $133.3 billion</p>\n\n<p>At first glance impressions are easy to be &quot;holy fuck, they&#39;re going to have $100 billion in revenue? they&#39;re generating cash flows of $150 billion?!? they&#39;re only at $15 billion market cap?? sign me the fuck up! buy buy buy!&quot;. But let&#39;s take this all the way with step 2 of answering our &quot;What is this worth today?&quot; question.</p>\n\n<p>So for this part we need to make a lot of assumptions. And this is important because equity analysts express their views often the most through not assumptions on how a company&#39;s cash flows look, but how to think about those cash flow value in present dollars.</p>\n\n<p>Continuing our simplification, let&#39;s keep assuming no debt involvement here (mainly bc this post is fucking long) and let&#39;s jump back to using CAPM. Let&#39;s use the below values:</p>\n\n<p>Rrfr: 1.0%</p>\n\n<p>Beta: 2.0</p>\n\n<p>ERP: 10%</p>\n\n<p>Using these we can see this stock&#39;s cost of equity is ~21.0%. It seems high, but this is expected from something with such fantastic growth being priced in to have such a high beta. TSLA for example has a beta of 2.0 and realistically a stock growing at 75% yoy in an economy growing at 3% nominally would likely have a beta much higher than that.</p>\n\n<p>So using our formula&#39;s above we can now now solve for our discount factors (the 1/(1+r)^t numbers to multiply our cash flows by).</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Year</th>\n<th align=\"left\">FY2028</th>\n<th align=\"left\">FY2029</th>\n<th align=\"left\">FY2030</th>\n<th align=\"left\">FY2031</th>\n<th align=\"left\">FY2032</th>\n<th align=\"left\">FY2033</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">t</td>\n<td align=\"left\">8</td>\n<td align=\"left\">9</td>\n<td align=\"left\">10</td>\n<td align=\"left\">11</td>\n<td align=\"left\">12</td>\n<td align=\"left\">13</td>\n</tr>\n<tr>\n<td align=\"left\">WACC</td>\n<td align=\"left\">21.0%</td>\n<td align=\"left\">21.0%</td>\n<td align=\"left\">21.0%</td>\n<td align=\"left\">21.0%</td>\n<td align=\"left\">21.0%</td>\n<td align=\"left\">21.0%</td>\n</tr>\n<tr>\n<td align=\"left\">Discount Factor</td>\n<td align=\"left\">= 1 / (1.21)<sup>8</sup></td>\n<td align=\"left\">= 1 / (1.21)<sup>9</sup></td>\n<td align=\"left\">= 1 / (1.21)<sup>10</sup></td>\n<td align=\"left\">= 1 / (1.21)<sup>11</sup></td>\n<td align=\"left\">= 1 / (1.21)<sup>12</sup></td>\n<td align=\"left\">= 1 / (1.21)<sup>13</sup></td>\n</tr>\n<tr>\n<td align=\"left\">(DF)</td>\n<td align=\"left\">0.22</td>\n<td align=\"left\">0.18</td>\n<td align=\"left\">0.15</td>\n<td align=\"left\">0.12</td>\n<td align=\"left\">0.10</td>\n<td align=\"left\">0.08</td>\n</tr>\n<tr>\n<td align=\"left\">PV CF ($m)</td>\n<td align=\"left\">141</td>\n<td align=\"left\">205</td>\n<td align=\"left\">296</td>\n<td align=\"left\">428</td>\n<td align=\"left\">619</td>\n<td align=\"left\">10,686</td>\n</tr>\n</tbody></table>\n\n<p>The sum of all the PV CF should give us what we think this stock is worth today (since no debt, this would be same as market cap, ignoring any cash balances they currently have). So we get $12.4bn. Compared to a current $15 billion market cap that&#39;s another 20% drop WITH some pretty damn rosy assumptions (and low yields). Fuck.</p>\n\n<p>But that&#39;s not all.</p>\n\n<p>Now let&#39;s dial in new more realistic assumptions. Let&#39;s think of pre-covid life and what the norms back then were. 10 year interest rates were between 2-3% in 2018/2019 and inflation was tipping on the hot side of 2% going into end of year 2019, so a 10 year treasury at 2.5% seems a realistic norm and with a higher vol/growth stock like this we can be more realistically at a beta of 2.25. And finally let&#39;s keep our ERP and g (macro assumptions) the same.</p>\n\n<p>Our cost of equity is now 25% which makes our discount table look like this:</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Year</th>\n<th align=\"left\">FY2028</th>\n<th align=\"left\">FY2029</th>\n<th align=\"left\">FY2030</th>\n<th align=\"left\">FY2031</th>\n<th align=\"left\">FY2032</th>\n<th align=\"left\">FY2033</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">t</td>\n<td align=\"left\">8</td>\n<td align=\"left\">9</td>\n<td align=\"left\">10</td>\n<td align=\"left\">11</td>\n<td align=\"left\">12</td>\n<td align=\"left\">13</td>\n</tr>\n<tr>\n<td align=\"left\">WACC</td>\n<td align=\"left\">25.0%</td>\n<td align=\"left\">25.0%</td>\n<td align=\"left\">25.0%</td>\n<td align=\"left\">25.0%</td>\n<td align=\"left\">25.0%</td>\n<td align=\"left\">25.0%</td>\n</tr>\n<tr>\n<td align=\"left\">Discount Factor</td>\n<td align=\"left\">= 1 / (1.25)<sup>8</sup></td>\n<td align=\"left\">= 1 / (1.25)<sup>9</sup></td>\n<td align=\"left\">= 1 / (1.25)<sup>10</sup></td>\n<td align=\"left\">= 1 / (1.25)<sup>11</sup></td>\n<td align=\"left\">= 1 / (1.25)<sup>12</sup></td>\n<td align=\"left\">= 1 / (1.25)<sup>13</sup></td>\n</tr>\n<tr>\n<td align=\"left\">(DF)</td>\n<td align=\"left\">0.17</td>\n<td align=\"left\">0.13</td>\n<td align=\"left\">0.11</td>\n<td align=\"left\">0.09</td>\n<td align=\"left\">0.07</td>\n<td align=\"left\">0.05</td>\n</tr>\n<tr>\n<td align=\"left\">PV CF ($m)</td>\n<td align=\"left\">109</td>\n<td align=\"left\">153</td>\n<td align=\"left\">214</td>\n<td align=\"left\">299</td>\n<td align=\"left\">419</td>\n<td align=\"left\">5,718</td>\n</tr>\n</tbody></table>\n\n<p>With just a slight change in treasury yields and a slightly more realistic shift in beta, we&#39;re now talking about a market cap of $6.9bn or a 55% FURTHER DROP from current prices. Start shifting those 75%/yoy growth assumptions towards something that decelerates (a more complicated n-stage DCF that&#39;s too much to get into here) and you drop even further. A 10% deceleration yoy would bring this present value more in the $4 billion range.</p>\n\n<p>I&#39;m sorry for being so long winded here, but I felt it was important to explain. In a nutshell that folks, is the power of compounding and why small shifts in a seemingly benign rate can shift massive changes in values for these growth stocks that are primarily basing their value on cash flows happening 10-15 years from now.</p>\n</div><!-- SC_ON -->",
  "score": 496,
  "permalink": "/r/stocks/comments/lyrwmq/psa_why_treasury_rates_matter_for_your/",
  "subreddit": "stocks",
  "id": "lyrwmq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576955
}