{
  "author": "ask-rack",
  "original_created_utc": 1655961579,
  "title": "Title is very sensitive. Read at your own risk?",
  "created_utc": 1655998151,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My friend is contemplating suicide, and I am not old enough to know what to do. What should i do?&lt;/p&gt;\n\n&lt;p&gt;My friend has sent me and my friend group potential suicide notes recently, such as saying &amp;quot;it was nice to know you.&amp;quot; His parents argue a lot and i heard that his dad strangled his mom during an argument, and the day after that he was told that he&amp;#39;s going to get a new brother soon. His therapist declared him suicidal. Hes an athiest, and from what i can tell doesnt have much to live for. Hes constantly bullied both online and physically. He also moves a lot.&lt;/p&gt;\n\n&lt;p&gt;I am 13. He is 14. He sent suicidal messages and stuff of the sort to a 12 year old. We don&amp;#39;t know what to do and how to help him. I am scared to see what has become of my friends life, and hiw he&amp;#39;s barely hanging on by a strand. It makes a sharp pain in my head knowing that i have some of the biggest privelage i can have in life; a great family, a goal in life, a beautiful town, access to any knowledge i need, yet my friend has almlst the complete opposite of what i am gifted. I hope he will be okay. Please help.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/vip7vr/title_is_very_sensitive_read_at_your_own_risk/",
  "subreddit": "TooAfraidToAsk",
  "id": "vip7vr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "My friend is contemplating suicide, and I am not old enough to know what to do.\nWhat should i do?\n\nMy friend has sent me and my friend group potential suicide notes recently, such\nas saying \"it was nice to know you.\" His parents argue a lot and i heard that\nhis dad strangled his mom during an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "友人が自殺を考えています。私はまだ年端もいかず、どうしたらいいかわかりません。\n私はどうしたらいいのでしょうか？\n\n友人は最近、私や私の友人グループに遺書らしきものを送ってきました。\nを送ったりしています。彼の両親はよく言い争うそうです。\n父親が母親の首を絞めて...",
      "title": "タイトルは非常に微妙です。自己責任でお読みください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的朋友正在考虑自杀，而我还没有老到知道该怎么做。\n我应该怎么做？\n\n我的朋友最近给我和我的朋友圈发了潜在的遗书，例如\n如说 \"很高兴认识你\"。他的父母经常争吵，我听说\n他的爸爸在一次聚会中掐死了他的妈妈。",
      "title": "标题非常敏感。阅读时风险自负？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的朋友正在考慮自殺，而我還沒有老到知道該怎麼做。\n我應該怎麼做？\n\n我的朋友最近給我和我的朋友圈發了潛在的遺書，例如\n如說 \"很高興認識你\"。他的父母經常爭吵，我聽說\n他的爸爸在一次聚會中掐死了他的媽媽。",
      "title": "標題非常敏感。閱讀時風險自負？"
    }
  ]
}