{
  "author": "JoyChen9898",
  "original_created_utc": 1652783673,
  "title": "Is there any significant risk of using a remote access tool in work?",
  "created_utc": 1652819659,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Remote desktop/remote access software has been around long before COVID, and there are much more than what the name implied. Remote desktop software would not only allow you access a device remotely, you could also transfer files, stream contents, even play video games. It also allows you to access device on different operating system even from smart phone to computer.&lt;/p&gt;\n\n&lt;p&gt;But how was user data privacy protected during remote accessing sessions?&lt;/p&gt;\n\n&lt;p&gt;In the case of DeskIn, there are several significant measures were implemented in order to ensure your data safety:&lt;/p&gt;\n\n&lt;p&gt;l Each remote connecting session is end-to-end encrypted. In another word, every time you initiate remote connection with DeskIn, all data transmitting between you (controller) and the end user (targeted device) are encrypted both way. &lt;/p&gt;\n\n&lt;p&gt;l Our team has work relentlessly for months to beef up hacker-proof protection, which has proven to be effective against various attacking methods. &lt;/p&gt;\n\n&lt;p&gt;l DeskIn complies with laws and regulations from different authorities including CPRA, GDPR, and others. &lt;/p&gt;\n\n&lt;p&gt;Join our beta test and get exclusive offer plus extensive free trial of DeskIn at: &lt;a href=\"https://deskin.io/register\"&gt;https://deskin.io/register&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/3ri1dtivk0091.png?width=1267&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=245c8c73b19f114ef0253cd6e6bb81050213d1b4\"&gt;https://preview.redd.it/3ri1dtivk0091.png?width=1267&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=245c8c73b19f114ef0253cd6e6bb81050213d1b4&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/urjhhs/is_there_any_significant_risk_of_using_a_remote/",
  "subreddit": "SideProject",
  "id": "urjhhs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Remote desktop/remote access software has been around long before COVID, and\nthere are much more than what the name implied. Remote desktop software would\nnot only allow you access a device remotely, you could also transfer files,\nstream contents, even play video games. It also allows you to access…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "リモートデスクトップ／リモートアクセスソフトウェアはCOVIDよりずっと以前から存在しており\nその名前から想像するよりもはるかに多くのものがあります。リモートデスクトップソフトウェアは\nリモートデスクトップソフトウェアは、単にデバイスにアクセスするだけでなく、ファイル転送やコンテンツ配信、ゲームプレイも可能です。\nまた、ゲームもできます。また、リモートデスクトップソフトウェアを使用することで、...",
      "title": "リモートアクセスツールを業務で使用することに、大きなリスクはないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在COVID之前，远程桌面/远程访问软件已经存在很久了。\n有比这个名字所暗示的多得多的东西。远程桌面软件将\n不仅允许你远程访问一个设备，你还可以传输文件。\n流内容，甚至玩视频游戏。它还允许你访问...",
      "title": "在工作中使用远程访问工具是否有任何重大风险？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在COVID之前，遠程桌面/遠程訪問軟件已經存在很久了。\n有比這個名字所暗示的多得多的東西。遠程桌面軟件將\n不僅允許你遠程訪問一個設備，你還可以傳輸文件。\n流內容，甚至玩視頻遊戲。它還允許你訪問...",
      "title": "在工作中使用遠程訪問工具是否有任何重大風險？"
    }
  ]
}