{
  "author": "Slickshots617",
  "original_created_utc": 1643468921,
  "title": "Escorts are one of the main reasons why cryptocurrency blew up",
  "created_utc": 1643477947,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In 2015, credit card companies stopped processing transactions for escort listing websites with backpage being the main one. I owned &amp;amp; operated an escort agency at the time and I did most of the marketing myself. At first the websites were letting us post for free but after a while they started charging again. BTC was the only form of payment these websites could accept. This was the first major boom in functional transactions. Suddenly, thousands of people are buying hundreds of thousands worth of BTC on a daily basis to post these ads with. Check the ledgers and you’ll see all of the action. This was the first time that the concept was proved on a major scale. BTC, and crypto in general, would not be as big of a thing without all of the escorts who pushed it along through facilitating millions of dollars in transactions.&lt;/p&gt;\n\n&lt;p&gt;Just a little inside history for anybody who didn’t know these things. I feel as if most people don’t&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 511,
  "permalink": "/r/CryptoCurrency/comments/sfjzfj/escorts_are_one_of_the_main_reasons_why/",
  "subreddit": "CryptoCurrency",
  "id": "sfjzfj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "In 2015, credit card companies stopped processing transactions for escort\nlisting websites with backpage being the main one. I owned & operated an escort\nagency at the time and I did most of the marketing myself. At first the websites\nwere letting us post for free but after a while they started…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2015年、クレジットカード会社はエスコート向けの取引処理を停止しました。\nバックページを中心としたリスティングサイト。私が経営するエスコート\n当時は代理店をやっていて、マーケティングのほとんどを自分でやっていました。当初、ウェブサイトは\n無料で掲載させてもらっていたのですが、しばらくすると......。",
      "title": "エスコートは暗号通貨が爆発した主な理由の1つです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2015年，信用卡公司停止了对伴游网站的交易处理。\n列表网站的交易，backpage是其中主要的一个。我拥有并经营一家伴游\n当时我拥有并经营一家陪护机构，我自己做了大部分的营销工作。起初，这些网站\n让我们免费发布，但过了一段时间，他们开始...",
      "title": "护卫队是加密货币爆炸的主要原因之一"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2015年，信用卡公司停止了對伴遊網站的交易處理。\n列表網站的交易，backpage是其中主要的一個。我擁有並經營一家伴遊\n當時我擁有並經營一家陪護機構，我自己做了大部分的營銷工作。起初，這些網站\n讓我們免費發佈，但過了一段時間，他們開始...",
      "title": "護衛隊是加密貨幣爆炸的主要原因之一"
    }
  ]
}