{
  "author": "Dinosaur_from_1998",
  "the_new_excerpt": "It's my cake day today. I know it means I've been here for two years now (it's\nmy second one), but I don't know if I have to do something in particular. I've\nseen people taking it seriously, but idk if it's just cause it shows they've\nbeen on Reddit for at least a year, or if there's something else…",
  "original_created_utc": 1623824312,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日は私のケーキの日です。2年目に突入したということはわかっているのですが（2回目です\n2回目）ということは知っていますが、特に何かをしなければならないということはありません。笑\n真面目にやっている人を見たことがありますが、それはRedditに最低でも2年はいることを示しているからなのかはわかりません。\nそれとも他に何かあるのでしょうか...。",
      "title": "誰かケーキの日に何をすればいいのか教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天是我的蛋糕日。我知道这意味着我已经在这里呆了两年了（这是\n我的第二年），但我不知道我是否必须要做一些特别的事情。我已经\n我看到人们认真对待它，但不知道这是否只是因为它显示他们已经\n在Reddit上至少呆了一年，还是有其他原因......",
      "title": "谁能告诉我，我的蛋糕日该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天是我的蛋糕日。我知道這意味着我已經在這裏呆了兩年了（這是\n我的第二年），但我不知道我是否必須要做一些特別的事情。我已經\n我看到人們認真對待它，但不知道這是否只是因爲它顯示他們已經\n在Reddit上至少呆了一年，還是有其他原因......",
      "title": "誰能告訴我，我的蛋糕日該怎麼做？"
    }
  ],
  "title": "Can anyone tell me what I'm supposed to do with my cake day ?",
  "created_utc": 1623844279,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s my cake day today. I know it means I&#39;ve been here for two years now (it&#39;s my second one), but I don&#39;t know if I have to do something in particular. I&#39;ve seen people taking it seriously, but idk if it&#39;s just cause it shows they&#39;ve been on Reddit for at least a year, or if there&#39;s something else going along with it. And considering how important it seems to be, I feel a little embarrassed to admit I don&#39;t fully know what this day is about</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/TooAfraidToAsk/comments/o0ya4i/can_anyone_tell_me_what_im_supposed_to_do_with_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "o0ya4i",
  "is_self": true,
  "media": null,
  "is_video": false
}