{
  "author": "100problemss",
  "original_created_utc": 1629652883,
  "title": "Crypto Could be the Last Hope for Middle and Lower Class to Become Rich",
  "created_utc": 1629689575,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Every year the wealth gap between lower, middle, and upper classes keeps rising. </p>\n\n<p>Due to the tax law, and the increasing affordability of homes, it’s getting harder and harder for lower and middle class people to become rich. </p>\n\n<p>The Fed is printing money, thus devaluing the USD. This hurts the poor and middle class the most. </p>\n\n<p>But now we have crypto. Coins like Doge, ADA and others have all grown very fast in short periods of time. Potentially turning hundreds of dollars into millions of dollars. </p>\n\n<p>But how can crypto change this? Well first, <strong>you will not get rich by day trading crypto.</strong> Holding is the only way to become truly rich. Crypto gives us this chance. </p>\n\n<p>In less than a year, Doge went from $0.002808 to $0.70! If you had put $100 in doge that would have netted you $25k! </p>\n\n<p>ADA went as low as $0.08 this year. It’s now at $2.59! $100 in ADA would net you $3,250</p>\n\n<p>We are still early in crypto, and therefore, there are still a lot of money to be made. Crypto can help redistribute wealth but you need to not play with the system. </p>\n\n<p>The best strategy is to DCA, buy when prices are low, and hold until the money will change your life. It’s a long term investment, so treat it that way. </p>\n\n<p>TLDR; you won’t become rich by day trading. Holding is the only real way to get life changing money from crypto.</p>\n\n<p>EDIT: A market cap today of 1 trillion for an alt coin may sound crazy high. But in 5 years it could sound crazy low.</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/p9glvb/crypto_could_be_the_last_hope_for_middle_and/",
  "subreddit": "CryptoCurrency",
  "id": "p9glvb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Every year the wealth gap between lower, middle, and upper classes keeps rising.\n\nDue to the tax law, and the increasing affordability of homes, it’s getting\nharder and harder for lower and middle class people to become rich.\n\nThe Fed is printing money, thus devaluing the USD. This hurts the poor…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "年々、下流階級、中流階級、上流階級の貧富の差が拡大しています。\n\n税法の改正や住宅価格の上昇により、中流階級の人たちが家を買うのは難しくなっています。\n低・中流階級の人々が豊かになるのは難しくなっています。\n\nFRBはお金を印刷しており、米ドルの価値を下げています。これは貧乏人には辛いことですが...。",
      "title": "暗号は中流・下流階級が金持ちになるための最後の希望になるかもしれない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每年，下层、中层和上层阶级之间的财富差距不断扩大。\n\n由于税法，以及房屋的可负担性越来越高，它正变得越来越\n中下阶层的人越来越难成为富人。\n\n美联储正在印钞票，从而使美元贬值。这伤害了穷人...",
      "title": "加密货币可能是中下层民众致富的最后希望"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每年，下層、中層和上層階級之間的財富差距不斷擴大。\n\n由於稅法，以及房屋的可負擔性越來越高，它正變得越來越\n中下階層的人越來越難成爲富人。\n\n美聯儲正在印鈔票，從而使美元貶值。這傷害了窮人...",
      "title": "加密貨幣可能是中下層民衆致富的最後希望"
    }
  ]
}