{
  "author": "Street_Remote6105",
  "original_created_utc": 1640702974,
  "title": "Why is the Chinese government kind of getting a free pass on how they handled the initial stages of the pandemic?",
  "created_utc": 1640719833,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So from what I can gather, they railroaded WHO from investigating. They also censored information about the coronavirus, they appear to be censoring data/presenting wonky timelines*, and of course, they let it spread over the globe. These are facts.&lt;/p&gt;\n\n&lt;p&gt;But there seems to be no major open criticism of them or global investigation. If anything, there seems to be a brand of Covid Pundits online who point to China as having an exemplary response... odd considering their response allowed it to spread all over the world.&lt;/p&gt;\n\n&lt;p&gt;*Now I know there are a lot of conspiracy theories here, and it could be WHAT China is actually covering up is completely benign. Honestly, most likely it is. I kind of doubt that Covid19 is some &amp;quot;bioweapon&amp;quot; or &amp;quot;engineered in a lab&amp;quot;. But the fact is, they are covering something up and it&amp;#39;s not a good look when you are responsible for the deaths of millions of people.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/rqhhze/why_is_the_chinese_government_kind_of_getting_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "rqhhze",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So from what I can gather, they railroaded WHO from investigating. They also\ncensored information about the coronavirus, they appear to be censoring\ndata/presenting wonky timelines*, and of course, they let it spread over the\nglobe. These are facts.\n\nBut there seems to be no major open criticism of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、私が調べたところでは、WHOに調査のレールを敷いたということです。彼らはまた\nコロナウイルスに関する情報を検閲しているようです。\nそしてもちろん、それが世界中に広がるのを許したのです。\n世界 これらは事実です。\n\nしかし、大きな公然の批判はないようだ...",
      "title": "なぜ、中国政府はパンデミックの初期段階での対応について、フリーパスをもらっているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，从我所了解的情况来看，他们把世卫组织从调查中拉出来。他们还\n审查有关冠状病毒的信息，他们似乎正在审查\n他们似乎在审查数据/提出古怪的时间表*，当然，他们还让它在全球蔓延。\n全球。这些都是事实。\n\n但是，似乎没有重大的公开批评...",
      "title": "为什么中国政府在处理大流行病最初阶段的方式上获得了自由通行证？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，從我所瞭解的情況來看，他們把世衛組織從調查中拉出來。他們還\n審查有關冠狀病毒的信息，他們似乎正在審查\n他們似乎在審查數據/提出古怪的時間表*，當然，他們還讓它在全球蔓延。\n全球。這些都是事實。\n\n但是，似乎沒有重大的公開批評...",
      "title": "爲什麼中國政府在處理大流行病最初階段的方式上獲得了自由通行證？"
    }
  ]
}