{
  "author": "RosaliaEstelle",
  "original_created_utc": 1645560584,
  "title": "Are there any other black people annoyed by wokeism?",
  "created_utc": 1645585264,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a woman of color, I am SO SICK OF &amp;quot;wokeism.&amp;quot; I have been black ALL MY LIFE and I know what discrimination. I have been called a monkey and the n-word during my formative years. There is something about &amp;quot;wokeism&amp;quot; that irritates me honestly.  Nothing annoys me more than my white liberal friends educating ME on oppression against black people. IRRITATING AS HELL. &lt;/p&gt;\n\n&lt;p&gt;I know what colorism, texturism. etc but having other people TRY TO EXPLAIN IT TO ME is SO IRRITATING. &lt;/p&gt;\n\n&lt;p&gt;I used to pride myself on being a liberal. Oddly enough I come from a devout Catholic liberal Democratic household. &lt;/p&gt;\n\n&lt;p&gt;I never thought I&amp;#39;d even say after these things or I would lean more conservative.&lt;/p&gt;\n\n&lt;p&gt;I am sick of the demonization of relatively fair conservatives. Jordan Peterson and Ben Shapiro are not transphobes, sexists. etc.  Jordan Peterson and Ben Shapiro seem pretty harmless to me. Jordan Peterson seems pretty sensitive. Have they used any slurs in their discussions?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/syx0s8/are_there_any_other_black_people_annoyed_by/",
  "subreddit": "TooAfraidToAsk",
  "id": "syx0s8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a woman of color, I am SO SICK OF \"wokeism.\" I have been black ALL MY LIFE\nand I know what discrimination. I have been called a monkey and the n-word\nduring my formative years. There is something about \"wokeism\" that irritates me\nhonestly. Nothing annoys me more than my white liberal friends…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "有色人種の女性として、私は \"wokeism \"にうんざりしています。私は生まれてからずっと黒人でした\n差別の意味を知っている。私は猿と呼ばれ Nワードと呼ばれたことがあります\n私の成熟した時代には 覚醒主義」には 私を苛立たせる何かがあります\n正直なところ 白人のリベラルな友人ほど腹立たしいものはない...。",
      "title": "覚醒主義に迷惑している黒人は他にもいるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个有色人种的女人，我对 \"清醒主义 \"感到非常厌恶。我的一生都是黑人\n而且我知道什么是歧视。在我成长的岁月里，我曾被称为猴子和N字头\n在我成长的岁月里，我被称为猴子和N字。有一些关于 \"清醒主义 \"的东西让我感到恼火。\n老实说。没有什么比我的白人自由派朋友更让我恼火的了......",
      "title": "还有其他被 \"清醒主义 \"烦扰的黑人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個有色人種的女人，我對 \"清醒主義 \"感到非常厭惡。我的一生都是黑人\n而且我知道什麼是歧視。在我成長的歲月裏，我曾被稱爲猴子和N字頭\n在我成長的歲月裏，我被稱爲猴子和N字。有一些關於 \"清醒主義 \"的東西讓我感到惱火。\n老實說。沒有什麼比我的白人自由派朋友更讓我惱火的了......",
      "title": "還有其他被 \"清醒主義 \"煩擾的黑人嗎？"
    }
  ]
}