{
  "author": "DeMiko",
  "the_new_excerpt": "I get on ok with a neighbor and we talk investing and retirement at times. He’s\na good decade older. He is a good neighbor but definitely has a chip on his\nshoulder that I can afford to live next to him at my age with where home prices\nhave gotten here.\n\nI don’t know who he’s getting his info from…",
  "original_created_utc": 1618778941,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近所の人とは仲良くしていて、投資や老後の話をすることもあります。彼は\n彼は10歳以上年上です。彼は良い隣人ですが、住宅価格が高騰している中、私の年齢で隣に住む余裕があることに\n彼は良い隣人ですが、住宅価格が高騰している中、私がこの年齢で彼の隣に住む余裕があることに肩入れしています。\nと肩を落としています。\n\n彼が誰から情報を得ているのかは知りませんが...。",
      "title": "反コイン派の隣人が、「昨夜の暴落で生活費を失った」と嬉しそうに聞いてきましたが、どうしたらいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我和一个邻居相处得很好，我们有时会谈论投资和退休。他是\n大了十岁。他是一个好邻居，但绝对有一个筹码在他的\n我这把年纪还能和他住在一起，以现在的房价来说\n已经到了这里。\n\n我不知道他从谁那里得到的信息... ...",
      "title": "反币的邻居兴高采烈地问我，现在我 \"在昨晚的车祸中失去了一生的积蓄\"，我打算怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我和一個鄰居相處得很好，我們有時會談論投資和退休。他是\n大了十歲。他是一個好鄰居，但絕對有一個籌碼在他的\n我這把年紀還能和他住在一起，以現在的房價來說\n已經到了這裏。\n\n我不知道他從誰那裏得到的信息... ...",
      "title": "反幣的鄰居興高采烈地問我，現在我 \"在昨晚的車禍中失去了一生的積蓄\"，我打算怎麼辦？"
    }
  ],
  "title": "Anti-coin neighbor gleefully asked me what I was going to do now that I “lost my life savings in last nights crash”",
  "created_utc": 1618793587,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I get on ok with a neighbor and we talk investing and retirement at times. He’s a good decade older. He is a good neighbor but definitely has a chip on his shoulder that I can afford to live next to him at my age with where home prices have gotten here. </p>\n\n<p>I don’t know who he’s getting his info from but he is rabidly anti-crypto. Thinks it’s all some Ponzi scheme. We’ve politely (usually) argued about crypto versus stocks. </p>\n\n<p>He tells me all the time that I’m risking my house and kids future with coins. </p>\n\n<p>Mowing the lawn this morning I bump into him and before the mowers are even off he’s gleefully asking how much financial trouble I’m in now that “crypto is crashed” after last night. </p>\n\n<p>I normally think comparing wallets is crass, but just the attitude on him. I couldn’t help it. So I pulled out the phone and opened my crypto portfolio tracking ap. </p>\n\n<p>I started by showing him the 24 hour view. He laughed. </p>\n\n<p>So then I showed him the view for the last month and then the last year. </p>\n\n<p>He was not happy. Insisted “that should just show you that you could lose everything any moment!”</p>\n\n<p>Ah well, at this rate I won’t be living next to him for much longer.</p>\n</div><!-- SC_ON -->",
  "score": 3059,
  "permalink": "/r/CryptoCurrency/comments/mtl5qk/anticoin_neighbor_gleefully_asked_me_what_i_was/",
  "subreddit": "CryptoCurrency",
  "id": "mtl5qk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521465
}