{
  "author": "kacperp",
  "the_new_excerpt": "I think that people think everyone is an idiot. There's nothing wrong with\ntrying to tell your friends about investing in crypto. You just need to act like\nan adult about it and explain them everything. I told my friends to invest in\nsome coins, i tell them that there is a risk and always explain…",
  "original_created_utc": 1619772057,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "みんなバカだと思ってるんだと思います。別に悪いことではないんです。\n暗号への投資について、友人に伝えようとしている。あなたはただ、次のように行動する必要があります。\n大人の対応で、きちんと説明する。私は友人たちに、投資するように言いました。\n私は、いくつかのコインについて、リスクがあることを伝え、常に説明しています...",
      "title": "友人や家族に暗号に投資するように言うのは悪いことではありません。ただ、大人の対応をしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为，人们认为每个人都是白痴。这并没有什么错，因为\n试图告诉你的朋友投资加密货币没有错。你只需要表现得像\n你只需要表现得像个成年人，向他们解释一切。我告诉我的朋友投资于\n一些硬币，我告诉他们有风险，并总是解释...",
      "title": "告诉你的朋友和家人投资加密货币并没有错。只是在这样做的时候要表现得像个成年人"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲，人們認爲每個人都是白癡。這並沒有什麼錯，因爲\n試圖告訴你的朋友投資加密貨幣沒有錯。你只需要表現得像\n你只需要表現得像個成年人，向他們解釋一切。我告訴我的朋友投資於\n一些硬幣，我告訴他們有風險，並總是解釋...",
      "title": "告訴你的朋友和家人投資加密貨幣並沒有錯。只是在這樣做的時候要表現得像個成年人"
    }
  ],
  "title": "There's nothing wrong about telling your friends and family to invest in crypto. Just act like an adult while doing so",
  "created_utc": 1619836176,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think that people think everyone is an idiot. There&#39;s nothing wrong with trying to tell your friends about investing in crypto. You just need to act like an adult about it and explain them everything. I told my friends to invest in some coins, i tell them that there is a risk and always explain that you should invest in what you think is good. Never just listen to my advice. </p>\n\n<p>I think that everyone assumes everyone is an idiot. Those are grown up people, you can tell them that crypto is an interesting way of investing, it has future, but talk to them like to the adults - &quot;You need to do your own DD&quot;. </p>\n\n<p>Obviously some people will act like morons, but if you want someone to get rich with you and act smart about it, there&#39;s nothing wrong about it. Just explain them everything, tell them that it&#39;s not a magical money printer. Don&#39;t just tell them to FOMO into the thing. Try to teach them what you know, try to make them interested in what they might get from it.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/n1pnml/theres_nothing_wrong_about_telling_your_friends/",
  "subreddit": "CryptoCurrency",
  "id": "n1pnml",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380961457
}