{
  "author": "Hysterical-leftists",
  "original_created_utc": 1628469462,
  "title": "MOONS are the antithesis of cryptocurrency.",
  "created_utc": 1628487049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know that i&#39;m talking to a brick wall here so i&#39;ll keep it short and sweet.    </p>\n\n<p>reddit is something like the 7th most popular website in the world and is an extremely politically-charged, curated and censored <del>publisher</del> platform. The simple fact that if your account is banned for any number of &quot;wrong-think&quot; issues, You will not be able to claim the tokens that reddit says it has awarded to you should be all the reason needed to not support this kind of centralized garbage. </p>\n\n<p>Do whatever you like, But don&#39;t for one second think that supporting this token is any different than supporting something like a Facebook Coin, or a Google Coin, Amazon Coin ect. You&#39;re supporting a mega-corp mentality that promotes centralized control, censorship and curated &quot;content&quot; to push various agendas. Basically EVERYTHING that flies in the face of what crypto is supposed to represent. </p>\n\n<p>And just so we&#39;re clear, I have no vault and no desire to get any of these garbage tokens.</p>\n</div><!-- SC_ON -->",
  "score": 186,
  "permalink": "/r/CryptoCurrency/comments/p0qmpf/moons_are_the_antithesis_of_cryptocurrency/",
  "subreddit": "CryptoCurrency",
  "id": "p0qmpf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know that i'm talking to a brick wall here so i'll keep it short and sweet.\n\nreddit is something like the 7th most popular website in the world and is an\nextremely politically-charged, curated and censored publisher platform. The\nsimple fact that if your account is banned for any number of \"wrong…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここではレンガの壁に向かって話しているようなものなので、簡潔に説明します。\n\nredditは、世界で7番目に人気のあるウェブサイトで、非常に政治的に厳しく、選別され、検閲されたパブリッシャーのプラットフォームです。\n世界で7番目に人気のあるウェブサイトで、非常に政治的に厳しく、選別され、検閲されたパブリッシャーのプラットフォームです。そのため\nもしあなたのアカウントがいくつかの「間違った」理由で禁止されているという単純な事実があります...",
      "title": "MOONSは、暗号通貨のアンチテーゼです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道我是在对着一堵砖墙说话，所以我将保持简短和甜蜜。\n\nreddit是世界上第七大最受欢迎的网站，是一个\n是一个极具政治色彩的、经过策划和审查的出版商平台。一个简单的事实是\n一个简单的事实是，如果你的账户因为任何数量的 \"错误 \"而被禁止。",
      "title": "月球是加密货币的对立面。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道我是在對着一堵磚牆說話，所以我將保持簡短和甜蜜。\n\nreddit是世界上第七大最受歡迎的網站，是一個\n是一個極具政治色彩的、經過策劃和審查的出版商平臺。一個簡單的事實是\n一個簡單的事實是，如果你的賬戶因爲任何數量的 \"錯誤 \"而被禁止。",
      "title": "月球是加密貨幣的對立面。"
    }
  ]
}