{
  "author": "anotherjohnishere",
  "the_new_excerpt": "Hello everyone!\n\nYou may remember me as the guy who was trying to become a crypto millionaire by\nthe end of the year.\n\nI imagine you were expecting two kinds of updates: either this dude got wrecked,\nor I made some money. The real answer is actually a little bit in the middle.\n\nMy account has grown…",
  "original_created_utc": 1613898034,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好!\n\n你可能还记得我是那个试图通过以下方式成为加密百万富翁的人\n年底的时候。\n\n我猜想你是在期待两种更新：要么这哥们儿被撞死了。\n或者说我赚了一些钱。真正的答案其实是在中间的一点。\n\n我的账户增长了...",
      "title": "Crypto Millionaire：意外的更新"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好!\n\n你可能還記得我是那個試圖通過以下方式成爲加密百萬富翁的人\n年底的時候。\n\n我猜想你是在期待兩種更新：要麼這哥們兒被撞死了。\n或者說我賺了一些錢。真正的答案其實是在中間的一點。\n\n我的賬戶增長了...",
      "title": "Crypto Millionaire：意外的更新"
    }
  ],
  "title": "Crypto Millionaire: a unexpected update",
  "created_utc": 1613955449,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone! </p>\n\n<p>You may remember me as the guy who was trying to become a crypto millionaire by the end of the year. </p>\n\n<p>I imagine you were expecting two kinds of updates: either this dude got wrecked, or I made some money. The real answer is actually a little bit in the middle. </p>\n\n<p>My account has grown a little bit (no, nothing crazy lol) and I&#39;ve asked my girlfriend to marry me and she said yes! With that said I&#39;ve decided to use a portion of my holdings to put a deposit down on a place for us to live on our own as we had been living with family. </p>\n\n<p>It was a long shot, but we got approved and we&#39;re signing the lease tomorrow! </p>\n\n<p>A massive thanks to this community for all of the DD the memes and the knowledge that I wouldn&#39;t have had when I bought my first shitcoin in 2017; y&#39;all are kings. </p>\n\n<p>This obviously put a hold on my plans as I have a wedding and a home to pay for, but it&#39;s all for the best. Big shout-out to ADA for paying my deposit and the first month of my lease, I grew up poor so this is all kind of surreal. </p>\n\n<p>Y&#39;all are the fucking best. HODL.</p>\n</div><!-- SC_ON -->",
  "score": 271,
  "permalink": "/r/CryptoCurrency/comments/lot5dl/crypto_millionaire_a_unexpected_update/",
  "subreddit": "CryptoCurrency",
  "id": "lot5dl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332879164
}