{
  "author": "loulan",
  "original_created_utc": 1630581859,
  "title": "As someone who's been in crypto for many years, this is my advice for newcomers.",
  "created_utc": 1630589437,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Don&#39;t listen to people who act like because they&#39;ve been in crypto for many years they know anything about anything. They don&#39;t know sh*t about f*ck.</p>\n\n<p>Like seriously, when I see posts like this one, I just can&#39;t believe it: <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/pc4dg9/advice_for_people_who_got_in_crypto_this_year/\">https://www.reddit.com/r/CryptoCurrency/comments/pc4dg9/advice_for_people_who_got_in_crypto_this_year/</a></p>\n\n<blockquote>\n<p>I’ve been in crypto for many years. When I mean many years I mean I saw bitcoin at 300usd and eth at under 10usd. I’ve been through a bull and bear market.</p>\n</blockquote>\n\n<p>Lol seriously? These are your qualifications? I bought bitcoin way below $300 and I wouldn&#39;t claim I know sh*t about f*ck. Because I don&#39;t know sh*t about f*ck. <a href=\"/r/bitcoin\">/r/bitcoin</a> was just as dumb as it is now in 2014-2015, people already had no clue what they were doing but were confident about it. It was already a sh*tton of hopium, FOMO, and the usual cr*p.</p>\n\n<p>Think of it that way. Suppose you go to the casino, and you meet some creepy guy at the door being like &quot;dude, I&#39;ve had a gambling addiction for five years, I can give you good advice about how to make money&quot;. Would you trust him? Of course you wouldn&#39;t. Because it&#39;s obvious he doesn&#39;t know sh*t about f*ck.</p>\n\n<p>Well it&#39;s the same here. Old-timers, newcomers. Nobody knows sh*t about f*ck.</p>\n\n<p>EDIT: formatting</p>\n</div><!-- SC_ON -->",
  "score": 226,
  "permalink": "/r/CryptoCurrency/comments/pgfwhk/as_someone_whos_been_in_crypto_for_many_years/",
  "subreddit": "CryptoCurrency",
  "id": "pgfwhk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Don't listen to people who act like because they've been in crypto for many\nyears they know anything about anything. They don't know sh*t about f*ck.\n\nLike seriously, when I see posts like this one, I just can't believe…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年も暗号に携わっているからといって、何でも知っているかのように振る舞う人の話には耳を貸さないでください。\n何でも知っているかのように振る舞う人の話は聞かないでください。彼らは何もわかっていません。\n\nこのような投稿を見ると、マジで信じられない...。",
      "title": "長年、クリプトに携わってきた者として、新規参入者へのアドバイスです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不要听那些表现得好像他们已经在加密货币领域工作了很多年的人的话\n他们对任何事情都很了解。他们根本就不知道什么叫 \"屁事\"。\n\n说真的，当我看到像这样的帖子时，我简直不敢相信...",
      "title": "作为一个从事加密货币多年的人，这是我对新人的建议。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不要聽那些表現得好像他們已經在加密貨幣領域工作了很多年的人的話\n他們對任何事情都很瞭解。他們根本就不知道什麼叫 \"屁事\"。\n\n說真的，當我看到像這樣的帖子時，我簡直不敢相信...",
      "title": "作爲一個從事加密貨幣多年的人，這是我對新人的建議。"
    }
  ]
}