{
  "author": "h4d9kf",
  "the_new_excerpt": "If a person is dying of thirst on a raft adrift in the sea, they'll likely be\ntempted to drink seawater even though they know it won't help.\n\nWhat will happen to the person once they consume some seawater?\n\nI know they will eventually die, but I'm curious as to how. Specifically, what\nhappens…",
  "original_created_utc": 1623845761,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "海を漂うイカダの上で喉が渇いて死にそうになっている人がいたら、助けにならないとわかっていても海水を飲みたくなるだろう。\n役に立たないとわかっていても、ついつい海水を飲んでしまいますよね。\n\n海水を飲んだら、その人はどうなるのでしょうか？\n\nいずれ死ぬことはわかっていますが、どのようにして死ぬのかが気になります。具体的には以下のようになります。\n起こるのか...。",
      "title": "喉が渇いて死ぬ人が海水を飲むとどうなるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果一个人在海上漂流的木筏上渴得要死，他们很可能会\n他们可能会想喝海水，尽管他们知道这不会有什么帮助。\n\n一旦他们喝了一些海水，这个人将会发生什么？\n\n我知道他们最终会死，但我很好奇是怎么死的。具体来说，什么\n会发生什么...",
      "title": "渴死的人如果喝了海水会怎样？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果一個人在海上漂流的木筏上渴得要死，他們很可能會\n他們可能會想喝海水，儘管他們知道這不會有什麼幫助。\n\n一旦他們喝了一些海水，這個人將會發生什麼？\n\n我知道他們最終會死，但我很好奇是怎麼死的。具體來說，什麼\n會發生什麼...",
      "title": "渴死的人如果喝了海水會怎樣？"
    }
  ],
  "title": "What happens to a person dying of thirst if they drink seawater?",
  "created_utc": 1623898363,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If a person is dying of thirst on a raft adrift in the sea, they&#39;ll likely be tempted to drink seawater even though they know it won&#39;t help.</p>\n\n<p>What will happen to the person once they consume some seawater?</p>\n\n<p>I know they will eventually die, but I&#39;m curious as to how. Specifically, what happens biologically and psychologically?</p>\n\n<p>Biologically: What happens to the body.</p>\n\n<p>Psychologically: Do they still feel thirsty? Do they feel any pain?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/askscience/comments/o13haj/what_happens_to_a_person_dying_of_thirst_if_they/",
  "subreddit": "askscience",
  "id": "o13haj",
  "is_self": true,
  "media": null,
  "is_video": false
}