{
  "author": "jam-hay",
  "the_new_excerpt": "If you think you've \"missed out\" on Bitcoin or are too late to the party you\nhaven't/ aren't.\n\nOver the years the perception from no-coiners has always been.. how lucky those\nin crypto have been and that they've some how missed the boat.\n\nThe crazy thing is that many of those people could have got…",
  "original_created_utc": 1618830380,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインに「乗り遅れた」とか「パーティーに遅すぎた」と思っている人は\nそうではありません。\n\n何年もの間、非コイン派の人々の認識は常に...暗号化された人々がいかに幸運だったか、自分たちはどうやって船に乗り遅れたかということでした。\nいかに暗号化された人々が幸運であったか、そして彼らはどのようにして船に乗り遅れたかということです。\n\nおかしいのは、そのような人たちの多くが手に入れられたかもしれない...",
      "title": "人々はBitcoinの船に乗り遅れたと思い続けています...だから、うっかりすると船に乗り遅れてしまうのです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你认为你已经 \"错过 \"了比特币，或者说你已经太晚了，你可以\n没有/不是。\n\n多年来，无币者的看法一直是......这些人是多么幸运。\n他们已经错过了这个机会。\n\n疯狂的是，这些人中的许多人可能已经得到了... ...",
      "title": "人们一直以为自己错过了比特币的船......所以在不经意间他们一直错过了船!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你認爲你已經 \"錯過 \"了比特幣，或者說你已經太晚了，你可以\n沒有/不是。\n\n多年來，無幣者的看法一直是......這些人是多麼幸運。\n他們已經錯過了這個機會。\n\n瘋狂的是，這些人中的許多人可能已經得到了... ...",
      "title": "人們一直以爲自己錯過了比特幣的船......所以在不經意間他們一直錯過了船!"
    }
  ],
  "title": "People keep assuming they've missed the Bitcoin boat.. so inadvertently they keep missing the boat!",
  "created_utc": 1618868781,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you think you&#39;ve &quot;missed out&quot; on Bitcoin or are too late to the party you haven&#39;t/ aren&#39;t.</p>\n\n<p>Over the years the perception from no-coiners has always been.. how lucky those in crypto have been and that they&#39;ve some how missed the boat.</p>\n\n<p>The crazy thing is that many of those people could have got in at as low as around $5k just over a year ago.</p>\n\n<p>I&#39;ve been a firm believer that one day in our lifetimes 1 BTC = $1 million </p>\n\n<p>Today&#39;s price of $56k is therefore cheap! </p>\n\n<p>The boat is still very much still in the docks taking on passengers :D</p>\n\n<p>These are some of the metrics I always keep in mind...</p>\n\n<p>Bitcoin is only 12 years old, there&#39;s still almost 120 years to go until the last Bitcoin is mined.</p>\n\n<p>A UN population division projected the worlds Global population to have nearly doubled to 11 billion in 2100, from 6 billion in 2000.</p>\n\n<p>By 2140, only 21m will have been mined of which many will have been lost.</p>\n\n<p>In 2019, there were an estimated 46.8 million people who&#39;s assets exceeded $1m and the total net worth of all millionaires stood at $158,261 trillion.</p>\n\n<p>The cumulative inflation from 1921 to 2021 is 1379.8% therefore a bitcoin purchased for $56k in 1921 would cost $828,665 today.</p>\n\n<p>Bitcoins market cap is just over $1 trillion, in the last year alone the Fed/ECB combined have printed $3 trillion. </p>\n\n<p>The other common misconception is that those that have invested are all &quot;lucky&quot;.</p>\n\n<p>Bitcoin is high risk... analysing the maths, researching technology/ history, early investing over the longframe and dollar cost averaging only what you can afford to lose.. is a skill.</p>\n\n<p>Bitcoin investing isn&#39;t a get rich quick scheme for the lucky.. it&#39;s an ideological way of life, for the patient, methodical and early adopting believers out there.</p>\n\n<p>Hodl On and Prosper :)</p>\n</div><!-- SC_ON -->",
  "score": 196,
  "permalink": "/r/Bitcoin/comments/mty8i0/people_keep_assuming_theyve_missed_the_bitcoin/",
  "subreddit": "Bitcoin",
  "id": "mty8i0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171516352
}