{
  "author": "Oozing_Sex",
  "original_created_utc": 1626444265,
  "title": "In Desmond Seward's \"The Hundred Years War\", the author refers to a royal bride as \"sluttish\". This struck me as a very harsh word to use in a history book, but I had also never heard it before. Why use this particular word over something like \"promiscuous\"?",
  "created_utc": 1626467491,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Does this word carry the same historical connotation as &quot;slutty&quot; or &quot;Was a slut&quot;?</p>\n\n<p>I&#39;ve also looked up the word and apparently there is an archaic definition meaning having low standards of cleanliness, e.g. &quot;dust left on the floor by a sluttish servant&quot;.</p>\n\n<p>Which meaning was the author likely going for? How common is this word in a historical/academic context?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/olhhzh/in_desmond_sewards_the_hundred_years_war_the/",
  "subreddit": "AskHistorians",
  "id": "olhhzh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Does this word carry the same historical connotation as \"slutty\" or \"Was a\nslut\"?\n\nI've also looked up the word and apparently there is an archaic definition\nmeaning having low standards of cleanliness, e.g. \"dust left on the floor by a\nsluttish servant\".\n\nWhich meaning was the author likely going…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この言葉には、\"slutty \"や \"Was a slut \"と同じ歴史的な意味合いがあるのでしょうか？\nこの言葉には、歴史的な意味合いがあるのでしょうか？\n\n私もこの言葉を調べてみましたが、どうやら古風な定義があるようです。\n淫乱な使用人が床に残したほこり」など、清潔さの基準が低いという意味の古風な定義があるようです。\n淫乱な召使いが床に残した埃」など。\n\n作者はどちらの意味を込めたのでしょうか。",
      "title": "デスモンド・スワードの『百年戦争』の中で、著者は王室の花嫁を「sluttish」と呼んでいる。これは歴史書に使うにはとても厳しい言葉だと思いましたが、私も初めて聞きました。なぜ \"promiscuous \"ではなく \"sluttish \"なのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个词的历史内涵是否与 \"放荡 \"或 \"是个荡妇 \"相同？\n荡妇 \"一样的历史内涵吗？\n\n我也查了一下这个词，显然有一个古老的定义\n意思是清洁标准低，例如，\"一个放荡的仆人在地板上留下的灰尘\"。\n淫荡的仆人\"。\n\n作者可能是想表达哪种意思......",
      "title": "在德斯蒙德-苏厄德（Desmond Seward）的《百年战争》中，作者将一位皇家新娘称为 \"放荡\"。这让我觉得在历史书中使用这个词非常刺耳，但我以前也从未听说过这个词。为什么使用这个特殊的词而不是像 \"淫乱 \"这样的词？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個詞的歷史內涵是否與 \"放蕩 \"或 \"是個蕩婦 \"相同？\n蕩婦 \"一樣的歷史內涵嗎？\n\n我也查了一下這個詞，顯然有一個古老的定義\n意思是清潔標準低，例如，\"一個放蕩的僕人在地板上留下的灰塵\"。\n淫蕩的僕人\"。\n\n作者可能是想表達哪種意思......",
      "title": "在德斯蒙德-蘇厄德（Desmond Seward）的《百年戰爭》中，作者將一位皇家新娘稱爲 \"放蕩\"。這讓我覺得在歷史書中使用這個詞非常刺耳，但我以前也從未聽說過這個詞。爲什麼使用這個特殊的詞而不是像 \"淫亂 \"這樣的詞？"
    }
  ]
}