{
  "author": "EclipZz187",
  "original_created_utc": 1649245387,
  "title": "Is the US medical system really as broken as the clichès make it seem?",
  "created_utc": 1649254885,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Do you really have to pay for an Ambulance ride?\nHow much does &amp;#39;regular medicine&amp;#39; cost, like a pack of Ibuprofen (or any other brand of painkillers)?\nAnd the most fucked up of all. How can it be, that in the 21st century in a first world country a phrase like &amp;#39;medical expense bankruptcy&amp;#39; can even exist?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve often joked about rather having cancer in Europe than a bruise in America, but like.. it seems the US medical system really IS that bad. Please tell me like half of it is clichès and you have a normal functioning system underneath all the weirdness.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 909,
  "permalink": "/r/TooAfraidToAsk/comments/txk7xb/is_the_us_medical_system_really_as_broken_as_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "txk7xb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Do you really have to pay for an Ambulance ride? How much does 'regular\nmedicine' cost, like a pack of Ibuprofen (or any other brand of painkillers)?\nAnd the most fucked up of all. How can it be, that in the 21st century in a\nfirst world country a phrase like 'medical expense bankruptcy' can even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "救急車に乗るのに、本当にお金がかかるの？普通の\nイブプロフェン（または他の鎮痛剤のブランド）のパックなど、「薬」の値段はいくらですか？\nそして、最も忌まわしいのは、「薬代」だ。21世紀にもなって、この国で\n第一世界の国々では、「医療費破産」などという言葉さえ...",
      "title": "米国の医療制度は、本当に決まり文句のように破綻しているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你真的要为乘坐救护车付费吗？普通药品的价格是多少？\n药品 \"的费用，如一包布洛芬（或任何其他品牌的止痛药）？\n而最操蛋的是。在21世纪的第一世界国家里，怎么会有 \"普通药品 \"这样的说法呢？\n在第一世界国家，\"医疗费用破产 \"这样的短语甚至可以...",
      "title": "美国的医疗系统真的像那些陈词滥调所描述的那样崩溃吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你真的要爲乘坐救護車付費嗎？普通藥品的價格是多少？\n藥品 \"的費用，如一包布洛芬（或任何其他品牌的止痛藥）？\n而最操蛋的是。在21世紀的第一世界國家裏，怎麼會有 \"普通藥品 \"這樣的說法呢？\n在第一世界國家，\"醫療費用破產 \"這樣的短語甚至可以...",
      "title": "美國的醫療系統真的像那些陳詞濫調所描述的那樣崩潰嗎？"
    }
  ]
}