{
  "author": "Morpherman",
  "the_new_excerpt": "Hey kids, today we are going to talk about Greater Fool Theory\n\nInvestopedia defines Greater Fool Theory as follows:\n\nThe greater fool theory states that it is possible to make money by buying\nsecurities, whether or not they are overvalued, by selling them for a profit at\na later date. This is…",
  "original_created_utc": 1616769144,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "小伙伴们，今天我们要讲的是 \"大愚论\n\nInvestopedia对大傻瓜理论的定义如下。\n\n\"大傻瓜理论 \"指出，通过买入 \"大傻瓜 \"的股票可以赚钱\n证券，无论其价值是否被高估，都可以通过出售这些证券以获得利润。\n晚些时候。这是...",
      "title": "大傻瓜理论及其对GME的影响。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "小夥伴們，今天我們要講的是 \"大愚論\n\nInvestopedia對大傻瓜理論的定義如下。\n\n\"大傻瓜理論 \"指出，通過買入 \"大傻瓜 \"的股票可以賺錢\n證券，無論其價值是否被高估，都可以通過出售這些證券以獲得利潤。\n晚些時候。這是...",
      "title": "大傻瓜理論及其對GME的影響。"
    }
  ],
  "title": "Greater Fool Theory and it's Implications To GME",
  "created_utc": 1616826564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey kids, today we are going to talk about <em>Greater Fool Theory</em></p>\n\n<p>Investopedia defines Greater Fool Theory as follows:</p>\n\n<p><em>The greater fool theory states that it is possible to make money by buying securities, whether or not they are overvalued, by selling them for a profit at a later date. This is because there will always be someone (i.e. a bigger or greater fool) who is willing to pay a higher price.</em></p>\n\n<p>Now you may be thinking, <strong>are we the greater fools?</strong> I bought at 250 like a good little ape, and my answer is <em>no</em>.</p>\n\n<p>First, let&#39;s acknowledge that GME is not worth $200, or $300, or $420.69, or $8008.101 . We aren&#39;t betting on the actual value, we&#39;re betting on the greater fools. We&#39;re betting on the short squeeze, and <em>its day will come</em>.</p>\n\n<p>The shorts will have to buy, no matter the price, so in this scenario <em>they are the greatest fools of all</em>.</p>\n\n<p>Melvin, Shitron, and other HF&#39;s will devolve below the monke and turn into single celled organisms only capable of breeding and shitting.</p>\n\n<p>How can I confirm this? Lets do some retard math.</p>\n\n<p>The average IQ defined in the Wechsler Intelligence Scale is 90-109, and since we&#39;re smooth brained, and in the &quot;Extremely low&quot; category, we&#39;re defined as 69 and below. So let&#39;s say we&#39;re all 69(nice). There are 9,665,680 <a href=\"/r/WSB\">r/WSB</a> members at the time of writing. Multiply total users by 69 and we get <strong>666,931,920</strong>. With our combined monke IQ&#39;s we have decided we like the stock. Melvin has 33 employees, who we&#39;ll say are in the &quot;Superior&quot; IQ classification of 130 and above. Using maths, we can conclude their combined IQ is 4,290. So who is the greater fool, Melvin, who doesn&#39;t like the stock with an IQ of 4,290, or <a href=\"/r/WSB\">r/WSB</a>, with a combined retard strength of 666,931,920 who like stonk.</p>\n\n<p>So get your chickens ready, the deep fryer is heating up and tendies will be ready soon.</p>\n\n<p>This is not financial advice.</p>\n</div><!-- SC_ON -->",
  "score": 1289,
  "permalink": "/r/wallstreetbets/comments/mdpy7o/greater_fool_theory_and_its_implications_to_gme/",
  "subreddit": "wallstreetbets",
  "id": "mdpy7o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357147046
}