{
  "author": "CONSOLE_LOAD_LETTER",
  "original_created_utc": 1627566803,
  "title": "Want Moons to be a qualitycoin instead of a shitcoin? Make an effort to upvote and post quality instead of shit.",
  "created_utc": 1627577741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Note: I originally posted this <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/orztx6/\">a few days ago</a> but it was removed because Moon price was spiking and the mods said I should try posting again once things settled down a bit and there are less than two Moon posts in the top 50 (which is the case right now at the time I am posting this).</p>\n\n<hr/>\n\n<p>Folks, we as a community are the guinea pigs of Reddit&#39;s beta community points system.  As things stand currently, many of us are quite happy to simply fulfill our roll as guinea pigs and push the post or comment or upvote button to receive another pellet of Moon to much on.  It floods our mammalian brains with certain neurotransmitters that makes us feel happy.  Reddit corporate accumulates this data, feeds it to their stockholders, and says... see!  The specimens are acting accordingly and the data shows we are going to increase our corporate revenues this quarter, so let&#39;s roll out community points across all popular subs!</p>\n\n<p>Now, there&#39;s two ways we can go with this.  We can fulfill our low-level instant gratification desires and keep thinking of Moons the same way people think of other shitcoins currently, or we can decide as a community to actually try to make Moons mean something more significant than just a virtual speculative asset with no other function.  But how can we make Moons into something more than just a speculative asset filled with shitposts, upon which at some point the bubble will burst and the shit will rain down upon all greedily staring up at said shit-filled bubble?</p>\n\n<p>The answer lies in building a community that supports actual value in the karma it gives, and not just chasing short-term gratification.  A community that thinks carefully about the upvotes and downvotes it gives and in the posts we choose to reach the top and personify the subreddit.  A community that takes governance polls and user-based roles in this semi-democratically run community seriously, continually suggesting ways to improve the health of the community for the good of all, and does its best to help educate and encourage others to avoid just picking all the low-hanging shitposting fruit and instead put more value in the difficult to reach but more valuable fruit up top.  If we do these things, we as a community help shape the inherent value of a Moon beyond just another shit-filled speculative asset, and into something whose value is foundationally built on a strong community belief in quality, comraderie, and effort.</p>\n\n<p>Aiming to maximize Moon gains with the least amount of effort possible and not actually caring what direction the community heads is one way to go, but it is very short sighted and will the value of a Moon in the long run.  Don&#39;t let short term gratification allow Moons to turn into just another shitcoin pump and dump.  Let&#39;s do it the right way, and build a community and coin with strong foundational elements that can actually put meaning and value behind it.  If we carry on with the commonly expressed mentality that &quot;More shitpost = more Moon&quot;, the equation will come to fruition and it will turn into &quot;Moon = shit&quot;.  Let&#39;s stop that from happening, and instead put the work in to get the community to adopt the attitude of &quot;More quality post = more Moon&quot;, so we can then shape the future to be &quot;Moon = quality&quot;.</p>\n</div><!-- SC_ON -->",
  "score": 252,
  "permalink": "/r/CryptoCurrency/comments/otxww1/want_moons_to_be_a_qualitycoin_instead_of_a/",
  "subreddit": "CryptoCurrency",
  "id": "otxww1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Note: I originally posted this a few days ago\n[https://www.reddit.com/r/CryptoCurrency/comments/orztx6/] but it was removed\nbecause Moon price was spiking and the mods said I should try posting again once\nthings settled down a bit and there are less than two Moon posts in the top 50\n(which is the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "注：元々は数日前に投稿したものです。\n[https://www.reddit.com/r/CryptoCurrency/comments/orztx6/] しかし、それは削除されました。\n月の価格が急上昇していたので削除されましたが、モデレーターは、少し落ち着いたらまた投稿してみてはどうかと言っていました。\n月の投稿はトップ50に2件以下しかありませんでした。\n(これは...",
      "title": "Moonsをshitcoinではなくqualitycoinにしたいですか？糞ではなく、品質の高いものをupvoteして投稿する努力をしてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "注：我最初在几天前发布了这个消息\n[https://www.reddit.com/r/CryptoCurrency/comments/orztx6/]但它被删除了\n因为月球的价格正在飙升，而版主说我应该在事情稳定下来后再尝试发帖。\n事情稳定下来，而且前50名中只有不到两个月球的帖子\n(这就是...",
      "title": "想让月球成为优质币而不是垃圾币吗？请努力提高投票率，发表高质量的文章，而不是狗屎。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "注：我最初在幾天前發佈了這個消息\n[https://www.reddit.com/r/CryptoCurrency/comments/orztx6/]但它被刪除了\n因爲月球的價格正在飆升，而版主說我應該在事情穩定下來後再嘗試發帖。\n事情穩定下來，而且前50名中只有不到兩個月球的帖子\n(這就是...",
      "title": "想讓月球成爲優質幣而不是垃圾幣嗎？請努力提高投票率，發表高質量的文章，而不是狗屎。"
    }
  ]
}