{
  "author": "vvillehelm",
  "original_created_utc": 1629333633,
  "title": "Breaking news: Market goes down after it went up for awhile. Analysts suggest more downside ahead unless it goes up. More at 6.",
  "created_utc": 1629355489,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a surprising turn of events, the price of Bitcoin has fallen 2.3% after a previous situation where it instead went up 2.3%.</p>\n\n<p>An analyst famed for his prediction that Bitcoin would go up at some point, is now suggesting that if the price of Bitcoin does not recover from its downward trajectory, there could be more downside ahead.</p>\n\n<p>Scott Minerd is reportedly still waiting for Bitcoin to hit $15k. A charity has been set up to send him supplies.</p>\n\n<p>This news is brought to you by News Organisation (TM). More at 6 o’clock at your relevant time zone.</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/Bitcoin/comments/p745g1/breaking_news_market_goes_down_after_it_went_up/",
  "subreddit": "Bitcoin",
  "id": "p745g1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a surprising turn of events, the price of Bitcoin has fallen 2.3% after a\nprevious situation where it instead went up 2.3%.\n\nAn analyst famed for his prediction that Bitcoin would go up at some point, is\nnow suggesting that if the price of Bitcoin does not recover from its downward\ntrajectory,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "驚くべきことに、ビットコインの価格は2.3％下落しました。\n驚くべきことに、ビットコインの価格は2.3％下落しました。\n\nビットコインはいつかは上がるだろうと予測していたことで有名なアナリストが\nこのままビットコインの価格が下降線から回復しなければ\nその結果、ビットコインの価格が下降線から回復しない場合、...",
      "title": "速報です。しばらく上がっていた市場が下がる。アナリストによると、上昇しない限り、さらに下降するとのこと。詳しくは6ページをご覧ください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一个令人惊讶的转折中，比特币的价格已经下降了2.3%，而在之前，它反而上升了2.3%。\n之前的情况是，它反而上涨了2.3%。\n\n一位因预测比特币将在某一时刻上涨而闻名的分析师，现在提出\n现在他建议，如果比特币的价格不能从其下降的轨迹中恢复过来\n轨迹，...",
      "title": "爆炸性新闻。市场在上涨了一段时间后出现了下跌。分析师认为，除非市场上涨，否则未来会有更多的下行趋势。更多信息请见6.C"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一個令人驚訝的轉折中，比特幣的價格已經下降了2.3%，而在之前，它反而上升了2.3%。\n之前的情況是，它反而上漲了2.3%。\n\n一位因預測比特幣將在某一時刻上漲而聞名的分析師，現在提出\n現在他建議，如果比特幣的價格不能從其下降的軌跡中恢復過來\n軌跡，...",
      "title": "爆炸性新聞。市場在上漲了一段時間後出現了下跌。分析師認爲，除非市場上漲，否則未來會有更多的下行趨勢。更多信息請見6.C"
    }
  ]
}