{
  "author": "excalilbug",
  "original_created_utc": 1634214629,
  "title": "You all cry about Doge and Shiba while BNB quietly crawls back into top 3. This is much worse for crypto",
  "created_utc": 1634221917,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Binance is the biggest exchange and it holds most of the crypto in the world - that&#39;s bad, mmmkay?</p>\n\n<p>But not only theyre biggest exchange but they also launched their own blockchain - and that blockchain is <strong>SUPER CENTRALIZED</strong></p>\n\n<p>There are only 21 nodes on Binance smart chain! Bitcoin has 14 thousand nodes! Ethereum has 3 thousand nodes!</p>\n\n<p>And if that isnt enough - Binance can choose all those nodes xD</p>\n\n<p>But wait! Theres more! -&gt; Binance chain is full of <strong>SCAM PROJECTS,</strong> almost every day a project on binance SCAM chain is rug pulled</p>\n\n<p>&#x200B;</p>\n\n<p><strong>BNB being one of the top coins is WORSE than Doge and Shiba being top coins</strong></p>\n\n<p><strong>Change my mind</strong></p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/q7yph2/you_all_cry_about_doge_and_shiba_while_bnb/",
  "subreddit": "CryptoCurrency",
  "id": "q7yph2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Binance is the biggest exchange and it holds most of the crypto in the world -\nthat's bad, mmmkay?\n\nBut not only theyre biggest exchange but they also launched their own blockchain\n- and that blockchain is SUPER CENTRALIZED\n\nThere are only 21 nodes on Binance smart chain! Bitcoin has 14 thousand…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Binanceは最大の取引所であり、世界のほとんどの暗号を保有しています。\nそれは悪いことですよね？\n\nしかし、最大の取引所であるだけでなく、独自のブロックチェーンを立ち上げました。\n- そしてそのブロックチェーンは超集中型です。\n\nBinanceのスマートチェーンには21のノードしかありません。ビットコインは14,000...",
      "title": "皆さんはDogeやShibaのことで泣いていますが、BNBは静かにトップ3に這い戻ってきています。これはcryptoにとってずっと悪いことだ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Binance是最大的交易所，它持有世界上大部分的加密货币--这很糟糕。\n这很糟糕，嗯？\n\n但他们不仅是最大的交易所，而且还推出了自己的区块链\n- 而且这个区块链是超级中心化的\n\nBinance智能链上只有21个节点! 比特币有14000个节点。",
      "title": "你们都在为Doge和Shiba哭泣，而BNB却悄悄地爬回了前三名。这对加密货币来说要糟糕得多"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Binance是最大的交易所，它持有世界上大部分的加密貨幣--這很糟糕。\n這很糟糕，嗯？\n\n但他們不僅是最大的交易所，而且還推出了自己的區塊鏈\n- 而且這個區塊鏈是超級中心化的\n\nBinance智能鏈上只有21個節點! 比特幣有14000個節點。",
      "title": "你們都在爲Doge和Shiba哭泣，而BNB卻悄悄地爬回了前三名。這對加密貨幣來說要糟糕得多"
    }
  ]
}