{
  "author": "mistymountaintrail",
  "original_created_utc": 1631034945,
  "title": "My boyfriend wants to break up because I am not interesting enough?",
  "created_utc": 1631078832,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Because I haven’t completed college ( I have an associates degree) , a real passion, I only have traveled and worked as a waitress and some other jobs at 24 years old…. He says I don’t know much about things just have hobbies. Like I rode horses as a kid and grew up with them but now it’s just something I did and something I still know about, that I played the violin but don’t still. I want to be a teacher and don’t have much work now but he doesn’t feel I realllyy want to be a teacher. That I’m not fighting hard for anything. I didn’t work for a year because I moved to his country to be with him and I got super depressed during quarantine. We’ve been together 2 years.\nBasically I feel like he thinks I have no depth. Which SUCKS because I have always been insecure about these kinds of things.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/pjrg5j/my_boyfriend_wants_to_break_up_because_i_am_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "pjrg5j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Because I haven’t completed college ( I have an associates degree) , a real\npassion, I only have traveled and worked as a waitress and some other jobs at 24\nyears old…. He says I don’t know much about things just have hobbies. Like I\nrode horses as a kid and grew up with them but now it’s just…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は大学を卒業していないので（準学士号は持っています）、本物の情熱を持っていません。\n情熱を持って、旅をしたり、ウェイトレスやその他の仕事をしたのは24歳のとき。\n歳.... 彼は、私が趣味を持っているだけで、物事についてあまり知らないと言います。例えば、私は\n子供の頃は馬に乗って育ったけど、今はただ...。",
      "title": "彼氏が別れたがっているのは、私が面白くないから？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为我还没有完成大学学业（我有一个副学士学位），没有真正的激情。\n激情，我只是在24岁时旅行并做过服务员和其他一些工作。\n岁.... 他说我对事物了解不多只是有爱好。比如我\n小时候骑马，和它们一起长大，但现在只是......",
      "title": "我的男朋友想分手，因为我不够有趣？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲我還沒有完成大學學業（我有一個副學士學位），沒有真正的激情。\n激情，我只是在24歲時旅行並做過服務員和其他一些工作。\n歲.... 他說我對事物瞭解不多隻是有愛好。比如我\n小時候騎馬，和它們一起長大，但現在只是......",
      "title": "我的男朋友想分手，因爲我不夠有趣？"
    }
  ]
}