{
  "author": "defactow",
  "original_created_utc": 1632927659,
  "title": "The average person will lose interest in crypto as soon as the price dips, don't let them discourage you",
  "created_utc": 1632958282,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;ve all seen it before, we enter a bull run and your entire city says they want to buy in and every executive that can get in front of a webcam has something to say. Then once we hit a little dip it&#39;s like their interest evaporates and they say crypto was a scam all along.</p>\n\n<p>These people don&#39;t care about the tech at all and you shouldn&#39;t take any of their opinions seriously. You should ignore them just like they ignore crypto the majority of the time. I&#39;m not telling you to blindly buy crypto because of course you need to do your own due diligence. But listening to people that have no knowledge on this space and just react to mainstream headlines is a bad idea.</p>\n\n<p>Keep this in mind throughout price fluctuations, just do your own due diligence and don&#39;t be dragged down by the naysayers. I hate to say this as fact but personally I know the price will continue to go up, we will continue to grow and crypto will rise in value.</p>\n\n<p>Edit: people have pointed out that the karma/moons rotio will increase during the winter, so that should keep a lot from leaving</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/pxx6rl/the_average_person_will_lose_interest_in_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pxx6rl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We've all seen it before, we enter a bull run and your entire city says they\nwant to buy in and every executive that can get in front of a webcam has\nsomething to say. Then once we hit a little dip it's like their interest\nevaporates and they say crypto was a scam all along.\n\nThese people don't care…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは皆、以前に見たことがあります。強気の相場に入り、あなたの街全体が買いたいと言い、すべての役員が買いたいと言う。\n買いたいと言い出し、ウェブカメラに映るすべての幹部が何かを言い出す。\n何かを言いたげです。そして、ちょっとした凹みがあると、彼らの関心は消えてしまい\n暗号は最初から詐欺だったと言われてしまいます。\n\nこのような人たちは気にしません...。",
      "title": "一般の人は価格が下がるとすぐに暗号への興味を失ってしまうが、彼らに落胆させられてはいけない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们以前都见过这种情况，我们进入了一个牛市，你的整个城市都说他们想买进，每个能在网络摄像头前的高管都说他们想买进。\n想买入，每个能在网络摄像头前出现的高管都有话要说。\n有话要说。然后，一旦我们遇到一个小挫折，他们的兴趣就会消失。\n他们就会说加密货币一直都是个骗局。\n\n这些人并不关心...",
      "title": "一般人只要价格一下跌就会对加密货币失去兴趣，不要让他们灰心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們以前都見過這種情況，我們進入了一個牛市，你的整個城市都說他們想買進，每個能在網絡攝像頭前的高管都說他們想買進。\n想買入，每個能在網絡攝像頭前出現的高管都有話要說。\n有話要說。然後，一旦我們遇到一個小挫折，他們的興趣就會消失。\n他們就會說加密貨幣一直都是個騙局。\n\n這些人並不關心...",
      "title": "一般人只要價格一下跌就會對加密貨幣失去興趣，不要讓他們灰心。"
    }
  ]
}