{
  "author": "herzyyy",
  "original_created_utc": 1654257112,
  "title": "How to tell my girl she looks worse with makeup?",
  "created_utc": 1654264973,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all. I hate the Barbie doll completely fake look, and I’m just not attracted to the heavy makeup. If we’re going to a play, or concert or important event I get it, but she does it EVERY occasion. She’s beautiful without the makeup and ive told her that but she still insists. I’m not being cheesy either, she genuinely looks better without the makeup. It causes her face to lose contrast, and look plastic. I don’t know how to say these things to her without her taking it as me calling her ugly, which is not my intention at all.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 132,
  "permalink": "/r/TooAfraidToAsk/comments/v3xnx5/how_to_tell_my_girl_she_looks_worse_with_makeup/",
  "subreddit": "TooAfraidToAsk",
  "id": "v3xnx5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all. I hate the Barbie doll completely fake look, and I’m just not\nattracted to the heavy makeup. If we’re going to a play, or concert or important\nevent I get it, but she does it EVERY occasion. She’s beautiful without the\nmakeup and ive told her that but she still insists. I’m not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っています。私はバービー人形のような完全なフェイクが嫌いで、濃い化粧に魅力を感じない。\n濃い化粧に惹かれる。演劇とかコンサートとか大事なイベントならわかるけど\nでも、彼女はいつもそうなんです。彼女は美しいです。\nを弖紗することができます。私は...",
      "title": "化粧をすると顔色が悪くなると、どう言えばいい？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切。我讨厌芭比娃娃完全虚假的外观，我只是不喜欢浓妆艳抹。\n浓妆吸引。如果我们要去看一场戏，或音乐会或重要的\n我明白，但她在每个场合都这样做。她不化妆也很美\n我已经告诉过她，但她仍然坚持。我不...",
      "title": "如何告诉我的女孩她化妆后看起来更糟？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切。我討厭芭比娃娃完全虛假的外觀，我只是不喜歡濃妝豔抹。\n濃妝吸引。如果我們要去看一場戲，或音樂會或重要的\n我明白，但她在每個場合都這樣做。她不化妝也很美\n我已經告訴過她，但她仍然堅持。我不...",
      "title": "如何告訴我的女孩她化妝後看起來更糟？"
    }
  ]
}