{
  "author": "resident-anarchist",
  "original_created_utc": 1656456707,
  "title": "Why are men so obsessed with women's body hair?",
  "created_utc": 1656471871,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve tried shaving every inch of my body before and it&amp;#39;s hell; it takes forever, the razor dulls, there&amp;#39;s the risk of cutting yourself, and it&amp;#39;s itchy afterward. I can understand having certain preferences in a partner but why should someone need to be hairless anywhere? If a woman shaves because she wants to and it makes her feel better, awesome. But why does anyone care if she&amp;#39;s got hair in her armpits or around her privates, as long as it&amp;#39;s not interfering with whatever activities may take place?&lt;br/&gt;\nI know &amp;quot;not all men&amp;quot; and all that, but I&amp;#39;m clueless as to why anyone cares. I&amp;#39;m familiar with the history behind women shaving, but I&amp;#39;m asking why people care NOW.  &lt;/p&gt;\n\n&lt;p&gt;EDIT: For clarity, I&amp;#39;m not asking why people prefer well-groomed genitals. I get that. I&amp;#39;m asking about armpit hair, arm hair, stomach hair, and hair around the boobs or on the back, and I&amp;#39;m asking why some men feel the need to police their partner&amp;#39;s shaving habits. If it&amp;#39;s not comfortable for her and it&amp;#39;s not interfering with anything, who cares? &amp;quot;It turns me off&amp;quot; technically answers the question, but I&amp;#39;m asking if there&amp;#39;s a reason.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 279,
  "permalink": "/r/TooAfraidToAsk/comments/vn08q9/why_are_men_so_obsessed_with_womens_body_hair/",
  "subreddit": "TooAfraidToAsk",
  "id": "vn08q9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've tried shaving every inch of my body before and it's hell; it takes forever,\nthe razor dulls, there's the risk of cutting yourself, and it's itchy afterward.\nI can understand having certain preferences in a partner but why should someone\nneed to be hairless anywhere? If a woman shaves because…"
}