{
  "author": "joshuamarkrsantos",
  "original_created_utc": 1658425496,
  "title": "When people dance in shows or movies set during the Regency Period, it seems like everyone on the dance floor follows exactly the same steps as everyone else. Is this historically accurate or is it just for the sake of presentation on screen?",
  "created_utc": 1658480575,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious about this. In media adaptations of the Regency Period, it seems like everyone knows how to dance the exact same steps whenever there&amp;#39;s a dance sequence. This happens all the time. From Bridgerton to Jane Austen adaptations such as Pride and Prejudice, it seems as if everyone on the dance floor follows the exact same routine. &lt;/p&gt;\n\n&lt;p&gt;As someone who took Ballroom Dancing classes before, this is incredibly difficult to do. It&amp;#39;s not even a matter of knowing the steps or not. You can memorize the steps of an entire routine by heart and still butcher a performance if you&amp;#39;re dancing with someone you&amp;#39;ve never danced with. The differences in skill, timing, and coordination all come into play when dancing with someone. &lt;/p&gt;\n\n&lt;p&gt;To pull off a near flawless dance routine, you need to have a really good understanding of your dance partner. During these Regency Era media adaptations, Gentlemen ask ladies who they&amp;#39;ve never danced with to dance and they seem to dance through an entire song without making any mistakes. Furthermore, they seem to be dancing in sync with everyone else on the dance floor. &lt;/p&gt;\n\n&lt;p&gt;How is this possible? Was there a &amp;quot;universal&amp;quot; routine for different dances such as the Waltz or Quadrille that everyone knew? Were the people during the regency era really this good in dancing? Or was everyone just dancing to their own beat and not following a set routine along with everyone else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/w4mur6/when_people_dance_in_shows_or_movies_set_during/",
  "subreddit": "AskHistorians",
  "id": "w4mur6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm curious about this. In media adaptations of the Regency Period, it seems\nlike everyone knows how to dance the exact same steps whenever there's a dance\nsequence. This happens all the time. From Bridgerton to Jane Austen adaptations\nsuch as Pride and Prejudice, it seems as if everyone on the…"
}