{
  "author": "joshuamarkrsantos",
  "original_created_utc": 1658425496,
  "title": "When people dance in shows or movies set during the Regency Period, it seems like everyone on the dance floor follows exactly the same steps as everyone else. Is this historically accurate or is it just for the sake of presentation on screen?",
  "created_utc": 1658480575,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious about this. In media adaptations of the Regency Period, it seems like everyone knows how to dance the exact same steps whenever there&amp;#39;s a dance sequence. This happens all the time. From Bridgerton to Jane Austen adaptations such as Pride and Prejudice, it seems as if everyone on the dance floor follows the exact same routine. &lt;/p&gt;\n\n&lt;p&gt;As someone who took Ballroom Dancing classes before, this is incredibly difficult to do. It&amp;#39;s not even a matter of knowing the steps or not. You can memorize the steps of an entire routine by heart and still butcher a performance if you&amp;#39;re dancing with someone you&amp;#39;ve never danced with. The differences in skill, timing, and coordination all come into play when dancing with someone. &lt;/p&gt;\n\n&lt;p&gt;To pull off a near flawless dance routine, you need to have a really good understanding of your dance partner. During these Regency Era media adaptations, Gentlemen ask ladies who they&amp;#39;ve never danced with to dance and they seem to dance through an entire song without making any mistakes. Furthermore, they seem to be dancing in sync with everyone else on the dance floor. &lt;/p&gt;\n\n&lt;p&gt;How is this possible? Was there a &amp;quot;universal&amp;quot; routine for different dances such as the Waltz or Quadrille that everyone knew? Were the people during the regency era really this good in dancing? Or was everyone just dancing to their own beat and not following a set routine along with everyone else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/w4mur6/when_people_dance_in_shows_or_movies_set_during/",
  "subreddit": "AskHistorians",
  "id": "w4mur6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm curious about this. In media adaptations of the Regency Period, it seems\nlike everyone knows how to dance the exact same steps whenever there's a dance\nsequence. This happens all the time. From Bridgerton to Jane Austen adaptations\nsuch as Pride and Prejudice, it seems as if everyone on the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "気になるのは 摂政時代のメディアでは、ダンスがあると、みんな全く同じステップで踊っているように見えます。\nを踊っているような気がする。\nを踊っているように見えます。これはよくあることです。Bridgerton』から『高慢と偏見』のようなジェーン・オースティン作品まで\nBridgerton』から『高慢と偏見』などのジェーン・オースティン作品まで、まるで全員が同じステップを踏んでいるように見える。",
      "title": "摂政時代を舞台にしたショーや映画で人々が踊るとき、ダンスフロアにいる全員が他の人とまったく同じステップを踏んでいるように見えます。これは歴史的に正確なのでしょうか、それとも画面上の演出のためなのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个问题很好奇。在媒体对摄政时期的改编中，似乎\n好像每个人都知道如何跳完全相同的舞步，只要有一个舞蹈序列\n序。这种情况一直在发生。从《布里奇顿》到简-奥斯汀的改编作品\n诸如《傲慢与偏见》，似乎每个人都会跳同样的舞步。",
      "title": "当人们在以摄政时期为背景的节目或电影中跳舞时，似乎舞池中的每个人都遵循与其他人完全相同的步骤。这是否符合历史，还是只是为了在屏幕上呈现？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個問題很好奇。在媒體對攝政時期的改編中，似乎\n好像每個人都知道如何跳完全相同的舞步，只要有一個舞蹈序列\n序。這種情況一直在發生。從《布里奇頓》到簡-奧斯汀的改編作品\n諸如《傲慢與偏見》，似乎每個人都會跳同樣的舞步。",
      "title": "當人們在以攝政時期爲背景的節目或電影中跳舞時，似乎舞池中的每個人都遵循與其他人完全相同的步驟。這是否符合歷史，還是隻是爲了在屏幕上呈現？"
    }
  ]
}