{
  "author": "cornmuse",
  "original_created_utc": 1627487153,
  "title": "What happens at a chemical level when a bottle of liquor is allowed to \"rest\"?",
  "created_utc": 1627494417,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m curious about this and don&#39;t really see it addressed elsewhere.  It&#39;s become common to allow a bottle of liquor (whisky, cognac, etc) to &quot;rest&quot; after opening.  In fact, I just read this in a vodka review: &quot;It is Beluga’s philosophy to have this vodka rest after each step of the production,&quot; explains Borisov. After a five-time filtration process to achieve maximum smoothness, the vodka&#39;s final resting period is 90 days. &quot;This allows it to reach perfect balance and harmony,&quot;</p>\n\n<p>Since I always like to ask myself &quot;why is that&quot; and &quot;what mechanism is at work here&quot;, I&#39;m asking precisely that.  Is there some chemical change happening to drive a flavor shift or is this &quot;resting&quot; of a seemingly stable substance mostly psychological in nature.  If a sealed or capped bottled is allowed to &quot;rest&quot; sans additional oxygen or heat, how is it changing?</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/askscience/comments/otckcz/what_happens_at_a_chemical_level_when_a_bottle_of/",
  "subreddit": "askscience",
  "id": "otckcz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm curious about this and don't really see it addressed elsewhere. It's become\ncommon to allow a bottle of liquor (whisky, cognac, etc) to \"rest\" after\nopening. In fact, I just read this in a vodka review: \"It is Beluga’s philosophy\nto have this vodka rest after each step of the production,\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "気になっているのですが、他ではあまり取り上げられていないようですね。最近では\nお酒（ウイスキーやコニャックなど）のボトルを開けた後、「休ませる」のが一般的になっています。\n一般的になっています。実際、あるウォッカのレビューでこんなことが書かれていました。「ベルーガの哲学は\nこのウォッカは製造の各工程の後に休ませるのがベルーガの哲学である」と...。",
      "title": "お酒のボトルを \"休ませる \"と、化学レベルではどうなるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对这个问题很好奇，并没有在其他地方看到这个问题的解决。这已经成为\n让一瓶酒（威士忌、白兰地等）在喝完后 \"休息 \"一下，已经成为一种普遍现象。\n开瓶后 \"休息\"。事实上，我刚刚在一篇伏特加酒的评论中看到了这一点。\"这是Beluga的理念\n让这种伏特加酒在每个生产步骤之后都进行休息，\"...",
      "title": "当一瓶白酒被允许 \"休息 \"时，在化学层面上会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對這個問題很好奇，並沒有在其他地方看到這個問題的解決。這已經成爲\n讓一瓶酒（威士忌、白蘭地等）在喝完後 \"休息 \"一下，已經成爲一種普遍現象。\n開瓶後 \"休息\"。事實上，我剛剛在一篇伏特加酒的評論中看到了這一點。\"這是Beluga的理念\n讓這種伏特加酒在每個生產步驟之後都進行休息，\"...",
      "title": "當一瓶白酒被允許 \"休息 \"時，在化學層面上會發生什麼？"
    }
  ]
}