{
  "author": "lukeprofits",
  "original_created_utc": 1646533392,
  "title": "How did people survive hyperinflation in Weimar Germany?",
  "created_utc": 1646581160,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen a lot of talk about how hyperinflation was bad in Weimar Germany, and prices were doubling every day. Most places just talk about what caused it (printing money), but not how average people survived. &lt;/p&gt;\n\n&lt;p&gt;My question is, how did people survive this?&lt;/p&gt;\n\n&lt;p&gt;In a scenario like this, I&amp;#39;d assume that everyone would quit their jobs (because the money wouldn&amp;#39;t buy anything), people would steal stuff (since they couldn&amp;#39;t afford it), and since people are stealing and nobody is working, shops would shut down.&lt;/p&gt;\n\n&lt;p&gt;What actually happened? &lt;/p&gt;\n\n&lt;p&gt;If you were a citizen in Weimar Germany, how would you survive? What&amp;#39;s the game plan? (obviously having massive stockpiles of food and stuff would be sweet, but most people don&amp;#39;t do that. They just have a few months of food at most.) How did average people survive?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/t7ou18/how_did_people_survive_hyperinflation_in_weimar/",
  "subreddit": "AskHistorians",
  "id": "t7ou18",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've seen a lot of talk about how hyperinflation was bad in Weimar Germany, and\nprices were doubling every day. Most places just talk about what caused it\n(printing money), but not how average people survived.\n\nMy question is, how did people survive this?\n\nIn a scenario like this, I'd assume that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ワイマール・ドイツではハイパーインフレが酷かったという話をよく見かけますし\n毎日、物価が2倍になっていたんです。ほとんどの場所で、その原因について語られるだけで\n(お金を刷ること）、しかし一般人がどのように生き延びたかについては触れていません。\n\n私の疑問は、人々はどうやって生き延びたのか、ということです。\n\nこのようなシナリオの場合、私は...",
      "title": "ワイマール期のドイツで、人々はどのようにハイパーインフレを乗り切ったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我见过很多关于恶性通货膨胀在魏玛德国是如何糟糕的谈话，而且\n价格每天都在翻倍。大多数地方只谈了造成这种情况的原因\n(印钞票），但没有谈到普通人是如何生存下来的。\n\n我的问题是，人们是如何生存下来的？\n\n在这样的情况下，我认为...",
      "title": "在魏玛德国，人们是如何度过恶性通货膨胀的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我見過很多關於惡性通貨膨脹在魏瑪德國是如何糟糕的談話，而且\n價格每天都在翻倍。大多數地方只談了造成這種情況的原因\n(印鈔票），但沒有談到普通人是如何生存下來的。\n\n我的問題是，人們是如何生存下來的？\n\n在這樣的情況下，我認爲...",
      "title": "在魏瑪德國，人們是如何度過惡性通貨膨脹的？"
    }
  ]
}