{
  "author": "esotericunicornz",
  "original_created_utc": 1649368876,
  "title": "Jack Mallers Just Obliterated Altcoin's Medium Of Exchange Claims",
  "created_utc": 1649421035,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Since I assume most people here don&amp;#39;t watch Bitcoin Conference live streams, I&amp;#39;ll cut to the chase: Jack Mallers just announced that a shit ton of retailers (including McDonals, Walmart, Whole Foods, Starbucks, etc) will now be able to accept Bitcoin, dollars, yen, or any other dirty fiats, instantly and nearly free, using new a new payment network integration with Shopify, enabled by Bitcoin&amp;#39;s lightning network.&lt;/p&gt;\n\n&lt;p&gt;They don&amp;#39;t need to accept Bitcoin or crypto, they can accept dollars and thus don&amp;#39;t need to worry about implications of holding crypto.&lt;/p&gt;\n\n&lt;p&gt;Bye bye 3% fees, charge backs, minimum charges, 2-15 day settlement, etc.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s over. The battle for Medium of Exchange for the 21st century has been fought, and it has been won. GG.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/tyo12p/jack_mallers_just_obliterated_altcoins_medium_of/",
  "subreddit": "CryptoCurrency",
  "id": "tyo12p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Since I assume most people here don't watch Bitcoin Conference live streams,\nI'll cut to the chase: Jack Mallers just announced that a shit ton of retailers\n(including McDonals, Walmart, Whole Foods, Starbucks, etc) will now be able to\naccept Bitcoin, dollars, yen, or any other dirty fiats,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここにいるほとんどの人は、Bitcoin Conferenceのライブストリームを見ないと思うので。\n本題に入ります。ジャック・モーラーが発表したところによると、多くの小売業者が\n(マクドナルド、ウォルマート、ホールフーズ、スターバックスなど）。\nビットコイン、ドル、円、その他の汚い通貨を受け入れる...",
      "title": "ジャック・マラーズがアルトコインの交換媒体の主張を打ち消す"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因为我假设这里的大多数人都不看比特币大会的直播。\n我就开门见山了。杰克-马勒斯刚刚宣布，一大批零售商\n(包括麦当劳、沃尔玛、全食超市、星巴克等）现在将能够\n接受比特币，美元，日元，或任何其他肮脏的货币，...",
      "title": "杰克-马勒斯刚刚粉碎了阿尔特币的交易媒介主张"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因爲我假設這裏的大多數人都不看比特幣大會的直播。\n我就開門見山了。傑克-馬勒斯剛剛宣佈，一大批零售商\n(包括麥當勞、沃爾瑪、全食超市、星巴克等）現在將能夠\n接受比特幣，美元，日元，或任何其他骯髒的貨幣，...",
      "title": "傑克-馬勒斯剛剛粉碎了阿爾特幣的交易媒介主張"
    }
  ]
}