{
  "author": "StardustNyako",
  "the_new_excerpt": "There's so much denial, anti masking, etc, look , I just want this to end but it\nseems that most people, to some degree or another want to spin excuses for why\nthey are good people who just ABSOLUTELY need to see their friends every week.\nThey swear they're all being safe and shit. Guess what? We…",
  "original_created_utc": 1614127104,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有这么多的否认，反掩饰，等等，看 ，我只是想结束这一切，但它。\n看来，大多数人，在某种程度上或另一种程度上想旋转的借口，为什么？\n他们是好人谁只是绝对需要 看到他们的朋友每星期。\n他们发誓，他们是所有被安全和狗屎。你猜怎么着？ - 我们... 我们...",
      "title": "难道只有我一个人想求大家不要每周都去看望他们的朋友吗？ 或者就一个月不要去看望他们的朋友，这样我们就能控制住这一切？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有這麼多的否認，反掩飾，等等，看 ，我只是想結束這一切，但它。\n看來，大多數人，在某種程度上或另一種程度上想旋轉的藉口，爲什麼？\n他們是好人誰只是絕對需要 看到他們的朋友每星期。\n他們發誓，他們是所有被安全和狗屎。你猜怎麼着？ - 我們... 我們...",
      "title": "難道只有我一個人想求大家不要每週都去看望他們的朋友嗎？ 或者就一個月不要去看望他們的朋友，這樣我們就能控制住這一切？"
    }
  ],
  "title": "Am I the only one who wants to beg everyone to not visit their friends every week or refrain from doing so for just a month so we can get this shit under control?",
  "created_utc": 1614140717,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s so much denial, anti masking, etc, look , I just want this to end but it seems that most people, to some degree or another want to spin excuses for why they are good people who just  ABSOLUTELY need to see their friends every week. They swear they&#39;re all being safe and shit. Guess what? We still have incredibly horrible rate of transmission because yall just want to hang out with your friends like nothing is going on. Like would it be soo hard to hold off on that for a month or two, so that we can stop loosing so many people?? We won&#39;t  reach 0 for a good while, but if you could chill the fuck out with your get togethers, we can get to a place where you can have your get togethers without having to come up ith a self-righteous excuse for it. That&#39;s all I&#39;m saying.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: Obviously work is a total exception to this question. You need the income.</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT2: Also since it&#39;s come up, I should have said, because mental health is important, if you are in real straits of mental health issues, go see said friend, but also a therapist. Just, try= to just go to their house or yours , and obviously family would be OK to visit / be with.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/lqydxy/am_i_the_only_one_who_wants_to_beg_everyone_to/",
  "subreddit": "TooAfraidToAsk",
  "id": "lqydxy",
  "is_self": true,
  "media": null,
  "is_video": false
}