{
  "author": "jaydecayx",
  "original_created_utc": 1643292552,
  "title": "How to get stay at home wife to clean house?",
  "created_utc": 1643302176,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My wife is a stay at home mom. She is an awesome mom. However, our house gets really dirty from the kids and she doesnt maintain it. She doesnt clean well or much at all. Kids are at school all day and I work a full time job and 3 part time jobs to pay the bills. She does do errands each day but then also naps for several hrs each day too.&lt;/p&gt;\n\n&lt;p&gt;How do I approach this? I would love to hire a cleaner but that would require her going back to work to pay for it which is a whole other issue. Other option is for me to do it but I literally do not have the time. When I bring this stuff up she gets really mad at me. Otherwise we are very happy together. Its just these few issues we cant work out.&lt;/p&gt;\n\n&lt;p&gt;She says my stance on her cleaning is from the 1940s. But she is home all day while kids at school. I am working like 70 hrs a week to pay for everything. Suggestions?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 136,
  "permalink": "/r/TooAfraidToAsk/comments/sdz8a8/how_to_get_stay_at_home_wife_to_clean_house/",
  "subreddit": "TooAfraidToAsk",
  "id": "sdz8a8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My wife is a stay at home mom. She is an awesome mom. However, our house gets\nreally dirty from the kids and she doesnt maintain it. She doesnt clean well or\nmuch at all. Kids are at school all day and I work a full time job and 3 part\ntime jobs to pay the bills. She does do errands each day but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の妻は専業主婦です。彼女は素晴らしい母親です。しかし、私たちの家は\n子供たちのせいで本当に汚れているのに、彼女はそれを維持しない。掃除もろくにしないし\nというようなことはありません。子供たちは一日中学校にいるし、私はフルタイムの仕事と3つのパート\nを支払うための時間的な仕事です。彼女は毎日用事を済ませますが、...",
      "title": "家にいる妻に掃除をさせる方法とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的妻子是一个在家的母亲。她是一个了不起的母亲。然而，我们的房子\n孩子们把我们的房子弄得很脏，而她却不去维护它。她不善于打扫，或者\n完全没有。孩子们整天都在学校，而我要做一份全职工作和三份兼职工作来支付账单。\n我有一份全职工作和三份兼职工作来支付账单。她每天都会做家务，但...",
      "title": "如何让在家的妻子打扫房间？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的妻子是一個在家的母親。她是一個了不起的母親。然而，我們的房子\n孩子們把我們的房子弄得很髒，而她卻不去維護它。她不善於打掃，或者\n完全沒有。孩子們整天都在學校，而我要做一份全職工作和三份兼職工作來支付賬單。\n我有一份全職工作和三份兼職工作來支付賬單。她每天都會做家務，但...",
      "title": "如何讓在家的妻子打掃房間？"
    }
  ]
}