{
  "author": "SunnyPhillyAlways",
  "original_created_utc": 1643741773,
  "title": "How can dads abandon their kids when they find out the kid isn’t theirs?",
  "created_utc": 1643790914,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have seen many posts about husbands finding out their wives cheated on them and a child they have raised is not their blood. So the husband packs up and leaves. Now I understand, kind of, if the child is young. But how can you do that if the child is a little older? You’ve spent your life and all of their life with them. You are the only thing they know. It’s not their fault they didn’t know. Now they feel abandoned by the many they called dada as their first or second word. I understand. It’s a losing situation for everyone involved. But how can you abandon a child that loves you and you raised? I understand leaving your wife but the child too? That hurts them the most. I don’t understand how someone can just leave their kid. How can you just forget about the child?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/si2i4k/how_can_dads_abandon_their_kids_when_they_find/",
  "subreddit": "TooAfraidToAsk",
  "id": "si2i4k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have seen many posts about husbands finding out their wives cheated on them\nand a child they have raised is not their blood. So the husband packs up and\nleaves. Now I understand, kind of, if the child is young. But how can you do\nthat if the child is a little older? You’ve spent your life and all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "妻の浮気が発覚した夫の書き込みを多く見かけますが\nとか、育てた子供が自分の血でないとか。だから、夫は荷物をまとめて\n出て行く。子供が小さいうちは、なんとなくわかりますが。でも、どうして\n子供がもう少し大きくなったら？あなたは自分の人生とすべてを費やしてきた...",
      "title": "子供が自分の子供じゃないとわかったら、父親が子供を見捨てるわけがない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到很多关于丈夫发现他们的妻子出轨的帖子\n而他们所抚养的孩子不是他们的血脉。于是丈夫收拾东西离开了\n离开。现在我理解了，如果孩子还小，我可以理解。但是你怎么能做到\n但如果孩子稍大一点，你怎么能这样做？你已经花了你的生命和所有...",
      "title": "当爸爸们发现孩子不是他们的时候，他们怎么能抛弃孩子呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到很多關於丈夫發現他們的妻子出軌的帖子\n而他們所撫養的孩子不是他們的血脈。於是丈夫收拾東西離開了\n離開。現在我理解了，如果孩子還小，我可以理解。但是你怎麼能做到\n但如果孩子稍大一點，你怎麼能這樣做？你已經花了你的生命和所有...",
      "title": "當爸爸們發現孩子不是他們的時候，他們怎麼能拋棄孩子呢？"
    }
  ]
}