{
  "author": "surrender_the_juice",
  "original_created_utc": 1648156012,
  "title": "Too many people don’t have a plan.",
  "created_utc": 1648204360,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The number of people that I see on here without a plan baffles me.  Many of the questions posted here could be answered if you set up strict goals and following through with cashing out when you meet those goals.&lt;/p&gt;\n\n&lt;p&gt;Is your goal to 3x all your investments?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Good, once you achieve that take your profits and reassess.  Don’t get greedy and go for more.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Is your goal to hold certain coins for 3 years and then cash in?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Good, stick to it and follow through.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Is your goal to hold BTC and ETH forever and never sell?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Excellent, don’t get tempted to sell if it isn’t part of your pre planned goals.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Is your goals to YOLO all into ShitCoinInu and lose it all in record time?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Not the best strategy, but at least you stuck to it.&lt;/strong&gt; /s&lt;/p&gt;\n\n&lt;p&gt;The point is…&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;1) Make a plan.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;2) Follow through when the goal is met.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;3) Make a new plan and don’t have any regrets about the previous goals.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Also, don’t set any of these goals while your drunk…&lt;/p&gt;\n\n&lt;p&gt;-Juice&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 306,
  "permalink": "/r/CryptoCurrency/comments/tn4sfn/too_many_people_dont_have_a_plan/",
  "subreddit": "CryptoCurrency",
  "id": "tn4sfn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The number of people that I see on here without a plan baffles me. Many of the\nquestions posted here could be answered if you set up strict goals and following\nthrough with cashing out when you meet those goals.\n\nIs your goal to 3x all your investments?\n\nGood, once you achieve that take your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで見かける、計画性のない人の多さには困惑させられる。多くの\nここに投稿された質問は、厳しい目標を設定し、それに沿って行動すれば、答えられるはずです。\nその目標を達成したら、キャッシュアウトすること。\n\nあなたの目標は、すべての投資額を3倍にすることですか？\n\n良いですね、それを達成したら、あなたの...",
      "title": "計画性のない人が多すぎる。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到的没有计划的人的数量让我感到困惑。许多\n如果你制定了严格的目标，并在达到这些目标时进行兑现，那么这里的许多问题都可以得到解答。\n如果你设定了严格的目标，并在达到这些目标时进行兑现，那么这里的许多问题都可以得到解答。\n\n你的目标是所有投资的3倍吗？\n\n很好，一旦你实现了这个目标，就把你的...",
      "title": "太多的人没有一个计划。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到的沒有計劃的人的數量讓我感到困惑。許多\n如果你制定了嚴格的目標，並在達到這些目標時進行兌現，那麼這裏的許多問題都可以得到解答。\n如果你設定了嚴格的目標，並在達到這些目標時進行兌現，那麼這裏的許多問題都可以得到解答。\n\n你的目標是所有投資的3倍嗎？\n\n很好，一旦你實現了這個目標，就把你的...",
      "title": "太多的人沒有一個計劃。"
    }
  ]
}