{
  "author": "SailsAk",
  "the_new_excerpt": "Just got done reading a post in the daily and the person was wishing it would\ndip more so their buy order would get triggered. I’m not sure about you but I’m\ndown 15-30% across all my portfolios from ATH. The past week has been an\nabsolute bloodbath. If someone really wants to buy a coin then just…",
  "original_created_utc": 1619418222,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日刊紙の記事を読んだところ、その人はもっとディップしてくれれば買い注文が発動するのに、と思っていました。\n買い注文を出すために、もっと下げてほしいと思っていました。あなたはどうかわかりませんが、私はATHからすべてのポートフォリオで15～30％下げました。\nATHから私のポートフォリオ全体で15～30％下落しています。先週は絶対的な大混乱でした。\n血の海のようでした。もし誰かが本当にコインを買いたいのであれば、ただ...",
      "title": "人気のある意見、人気のない意見。もっと沈んで欲しかった」と言う人は迷惑。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "刚刚看完了日报上的一个帖子，那个人希望它能\n跌得更多，这样他们的买单就会被触发。我不知道你怎么想的，但我的所有投资组合从ATH开始下跌了15-30%。\n我的所有投资组合都从ATH下跌了15-30%。过去的一周是一场\n绝对的血腥。如果有人真的想买一个币，那么就...",
      "title": "流行或不流行的意见。那些说希望它能下降更多的人是令人讨厌的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "剛剛看完了日報上的一個帖子，那個人希望它能\n跌得更多，這樣他們的買單就會被觸發。我不知道你怎麼想的，但我的所有投資組合從ATH開始下跌了15-30%。\n我的所有投資組合都從ATH下跌了15-30%。過去的一週是一場\n絕對的血腥。如果有人真的想買一個幣，那麼就...",
      "title": "流行或不流行的意見。那些說希望它能下降更多的人是令人討厭的。"
    }
  ],
  "title": "Popular or unpopular opinion: People who say they wish that it would’ve dipped more are annoying.",
  "created_utc": 1619437299,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just got done reading a post in the daily and the person was wishing it would dip more so their buy order would get triggered. I’m not sure about you but I’m down 15-30% across all my portfolios from ATH. The past week has been an absolute bloodbath. If someone really wants to buy a coin then just do it. Most coins are still down at least 15% from ATH. So don’t complain or worse yet wish that it would dip more. We get it, you’re a crypto savant and only buy when the green line crosses the red line on the 236 hour MA or whatever other tea leave reading TA you do. Thank you in advance for not doing this anymore and do us all a favor and just buy now.</p>\n</div><!-- SC_ON -->",
  "score": 410,
  "permalink": "/r/CryptoCurrency/comments/myr7vt/popular_or_unpopular_opinion_people_who_say_they/",
  "subreddit": "CryptoCurrency",
  "id": "myr7vt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210466
}