{
  "author": "AntiObamacore",
  "original_created_utc": 1640719091,
  "title": "Would people find this suspicious or sweet?",
  "created_utc": 1640741791,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Im 14 and I make stuffed animals. During Christmas, I gave a stuffed animal to a mall Santa to thank him for making children happy during the holidays and he seemed very thankful. If i were to go to the mall and give out handmade stuffed animals to random people (probably children since they’d appreciate it most), would this be seen as suspicious or just nice? I like to make people happy and my creations are taking up a lot of space so it would work out really well as long as it’s not seen as weird or suspicious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/rqnbgh/would_people_find_this_suspicious_or_sweet/",
  "subreddit": "NoStupidQuestions",
  "id": "rqnbgh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im 14 and I make stuffed animals. During Christmas, I gave a stuffed animal to a\nmall Santa to thank him for making children happy during the holidays and he\nseemed very thankful. If i were to go to the mall and give out handmade stuffed\nanimals to random people (probably children since they’d…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は14歳で、ぬいぐるみを作っています。クリスマスにぬいぐるみをプレゼントしました。\nサンタは、子供たちを幸せにしてくれたことに感謝しています。\nとても感謝しているようでした。もし、私がショッピングモールに行って、手作りのぬいぐるみを配るとしたら\nこのような場合、「痒いところに手が届く」という言葉がぴったりです。",
      "title": "人はこれを怪しいと思うだろうか、それとも甘いと思うだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我14岁，我做毛绒玩具。在圣诞节期间，我把一个毛绒动物送给了一个\n商场的圣诞老人，以感谢他在节日期间为孩子们带来快乐，他似乎非常感激。\n他似乎非常感激。如果我去商场，把手工制作的毛绒玩具给\n如果我去商场给随机的人（可能是儿童，因为他们会...",
      "title": "人们会觉得这很可疑还是很甜蜜？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我14歲，我做毛絨玩具。在聖誕節期間，我把一個毛絨動物送給了一個\n商場的聖誕老人，以感謝他在節日期間爲孩子們帶來快樂，他似乎非常感激。\n他似乎非常感激。如果我去商場，把手工製作的毛絨玩具給\n如果我去商場給隨機的人（可能是兒童，因爲他們會...",
      "title": "人們會覺得這很可疑還是很甜蜜？"
    }
  ]
}