{
  "author": "Selim1512",
  "original_created_utc": 1647828009,
  "title": "What caused Hinduism to survive contact with Christianity and Islam where most other pagan and shamanistic religions went into decline not long after contact?",
  "created_utc": 1647866858,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The pagan religions in Europe, Latin America, and ongoing in Africa, went into long-term decline as contact with Christianity and Islam increased. Hinduism, on the other hand, has survived. &lt;/p&gt;\n\n&lt;p&gt;Why did centuries of Muslim rule, followed by about a century of British rule, not result in either the Islamization or Christianization of most of India?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/tj0sx9/what_caused_hinduism_to_survive_contact_with/",
  "subreddit": "AskHistorians",
  "id": "tj0sx9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The pagan religions in Europe, Latin America, and ongoing in Africa, went into\nlong-term decline as contact with Christianity and Islam increased. Hinduism, on\nthe other hand, has survived.\n\nWhy did centuries of Muslim rule, followed by about a century of British rule,\nnot result in either the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヨーロッパ、ラテンアメリカ、そしてアフリカで進行中の異教徒宗教は、次のような状態に陥った。\nキリスト教やイスラム教との接触が増え、長期的に衰退していった。一方、ヒンドゥー教は\n一方、生き残ってきたのは\n\n何世紀にもわたるイスラム教の支配と、それに続く約1世紀のイギリスによる支配はなぜ起こったのか。\nのどちらにもならない。",
      "title": "他の多くの異教徒やシャーマニズム的な宗教が、キリスト教やイスラム教との接触後まもなく衰退していく中で、ヒンドゥー教はなぜ生き延びることができたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着与基督教和伊斯兰教接触的增加，欧洲、拉丁美洲和非洲的异教进入了长期衰退期。\n随着与基督教和伊斯兰教接触的增加，欧洲、拉丁美洲和非洲的异教进入了长期衰退期。而印度教则\n另一方面，印度教一直生存着。\n\n为什么几个世纪的穆斯林统治，再加上大约一个世纪的英国统治。\n为什么没有导致",
      "title": "是什么导致印度教在与基督教和伊斯兰教的接触中幸存下来，而其他大多数异教和萨满教在接触后不久就走向衰落？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着與基督教和伊斯蘭教接觸的增加，歐洲、拉丁美洲和非洲的異教進入了長期衰退期。\n隨着與基督教和伊斯蘭教接觸的增加，歐洲、拉丁美洲和非洲的異教進入了長期衰退期。而印度教則\n另一方面，印度教一直生存着。\n\n爲什麼幾個世紀的穆斯林統治，再加上大約一個世紀的英國統治。\n爲什麼沒有導致",
      "title": "是什麼導致印度教在與基督教和伊斯蘭教的接觸中倖存下來，而其他大多數異教和薩滿教在接觸後不久就走向衰落？"
    }
  ]
}