{
  "author": "TheOneNeo99",
  "original_created_utc": 1645398233,
  "title": "Bitcoin Saved My Life",
  "created_utc": 1645435889,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This happened about a week ago. &lt;/p&gt;\n\n&lt;p&gt;Was heading home from a little road trip and had to stop around about 2 hours away from home for gas. Had the wife and kids with me. Went to fill up and my cards keep getting declined. Try to call the bank and they had froze my accounts due to &amp;quot;suspected fraudulent activity&amp;quot; and said there was nothing they could do for 24 hours. &lt;/p&gt;\n\n&lt;p&gt;No way to access any of my money and didn&amp;#39;t have enough gas to make it home. Was starting to get a little nervous. Then I remembered I had some money in bitcoin. I was able to find a crypto atm (didn&amp;#39;t even know those existed) within a quarter mile that I walked to. At this atm, I was able to sell some of my bitcoin and withdraw cash from the atm, which I was then able to use to buy gas to get home. &lt;/p&gt;\n\n&lt;p&gt;Insanely lucky I had funds that were practical/useful when my bank was not accessible. And thus I realized the true benefit of Bitcoin. &lt;/p&gt;\n\n&lt;p&gt;Just wanted to share, as I&amp;#39;ve never seen, firsthand, the practical use of crypto currency before. Here was a situation where I was unable to access a resource through a &amp;quot;respected&amp;quot; financial institution, but i was able to access and utilize crypto currency. &lt;/p&gt;\n\n&lt;p&gt;TLDR: Stuck out of town and needed gas. Bank accounts frozen but was able to use BTC to pay and get home.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 329,
  "permalink": "/r/Bitcoin/comments/sxe145/bitcoin_saved_my_life/",
  "subreddit": "Bitcoin",
  "id": "sxe145",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This happened about a week ago.\n\nWas heading home from a little road trip and had to stop around about 2 hours\naway from home for gas. Had the wife and kids with me. Went to fill up and my\ncards keep getting declined. Try to call the bank and they had froze my accounts\ndue to \"suspected fraudulent…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1週間ほど前の出来事です。\n\nちょっとしたドライブ旅行の帰りに、2時間くらい停車することになりました。\nガソリンを入れるため、自宅から離れた場所にいる。妻と子供も一緒でした。ガソリンを入れに行ったのですが、私の\nカードが拒否され続けています。銀行に電話すると、私の口座は凍結されていました。\n詐欺の疑いがある」ということで、...",
      "title": "ビットコインに救われた人生"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这发生在大约一个星期前。\n\n我从一个小的公路旅行中回家，不得不在离家2小时左右的地方停下来加油。\n左右的地方加油。我带着妻子和孩子。去加油的时候，我的\n卡一直被拒绝。试着给银行打电话，他们已经冻结了我的账户\n因为 \"涉嫌欺诈\"。",
      "title": "比特币拯救了我的生活"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這發生在大約一個星期前。\n\n我從一個小的公路旅行中回家，不得不在離家2小時左右的地方停下來加油。\n左右的地方加油。我帶着妻子和孩子。去加油的時候，我的\n卡一直被拒絕。試着給銀行打電話，他們已經凍結了我的賬戶\n因爲 \"涉嫌欺詐\"。",
      "title": "比特幣拯救了我的生活"
    }
  ]
}