{
  "author": "toefirefire2",
  "original_created_utc": 1629982342,
  "title": "What documents do historians have now that Gibbon did not when he wrote The History of the Decline and Fall of the Roman Empire",
  "created_utc": 1630003944,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s my understanding that Gibbon&#39;s work was the de facto book on the subject for quite a long time but that now understandably after hundreds of years and additional research it seems a little outdated. </p>\n\n<p>Obviously he would not have had access to technology like carbon dating, underwater shipwreck finding and all the archaeology that has happened since. I&#39;m sure there are a dozen other technological innovations that I&#39;ve missed. But besides these things how much of the resources he used would be the same as a modern Roman historian would use? Would he have most of the same written accounts we have now?</p>\n\n<p>I don&#39;t know if this is an impossible question, but if resources could be quantified, what percent of a modern historians resources on the subject did Gibbon have access to?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/pbyvol/what_documents_do_historians_have_now_that_gibbon/",
  "subreddit": "AskHistorians",
  "id": "pbyvol",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It's my understanding that Gibbon's work was the de facto book on the subject\nfor quite a long time but that now understandably after hundreds of years and\nadditional research it seems a little outdated.\n\nObviously he would not have had access to technology like carbon dating,\nunderwater shipwreck…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、ギボンの著作はかなり長い間、この問題に関する事実上の本だった。\nしかし、何百年もの時を経て、今では理解できるようになりました。\nしかし、数百年の時を経て、さらに研究を重ねると、当然のことながら、少し時代遅れになっているようです。\n\nもちろん、彼には炭素年代測定法のような技術はなかっただろう。\n水中の難破船...",
      "title": "ギボンが『ローマ帝国衰亡史』を書いた時にはなかった、現在の歴史家が持っている資料とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的理解是，吉本的作品在相当长的时间内是关于这个问题的事实上的书。\n在相当长的一段时间内，但现在可以理解的是，经过几百年的时间和额外的研究，它似乎有点过时了。\n额外的研究，它似乎有点过时了。\n\n显然，他没有机会获得像碳测定这样的技术。\n水下沉船...",
      "title": "历史学家现在拥有哪些文件是吉本在写《罗马帝国衰亡史》时没有的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的理解是，吉本的作品在相當長的時間內是關於這個問題的事實上的書。\n在相當長的一段時間內，但現在可以理解的是，經過幾百年的時間和額外的研究，它似乎有點過時了。\n額外的研究，它似乎有點過時了。\n\n顯然，他沒有機會獲得像碳測定這樣的技術。\n水下沉船...",
      "title": "歷史學家現在擁有哪些文件是吉本在寫《羅馬帝國衰亡史》時沒有的？"
    }
  ]
}