{
  "author": "Fluffinowitsch",
  "the_new_excerpt": "A cursory read about the Seven Years' war drew my attention to high ranking\nmilitary personnel, such as James Keith or George Browne, who served \"foreign\"\nLords. While I see that Keith's circumstances were a bit special, that still\nbegets the questions:\n\nHow fluid was cultural identity - in the…",
  "original_created_utc": 1612954059,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "粗略地阅读了关于七年战争的资料，引起了我对高层的注意。\n戎人\n诸位大人。虽然我看基思的情况有点特殊，但这还是。\n产生的问题。\n\n文化身份是如何流动的----在... ...",
      "title": "在现代民族国家出现之前，文化认同的流动性如何？尤其是在17、18世纪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "粗略地閱讀了關於七年戰爭的資料，引起了我對高層的注意。\n戎人\n諸位大人。雖然我看基思的情況有點特殊，但這還是。\n產生的問題。\n\n文化身份是如何流動的----在... ...",
      "title": "在現代民族國家出現之前，文化認同的流動性如何？尤其是在17、18世紀？"
    }
  ],
  "title": "How fluid was cultural identity before the advent of modern nation states? Especially in the 17th and 18th century?",
  "created_utc": 1612969006,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A cursory read about the Seven Years&#39; war drew my attention to  high ranking military personnel, such as James Keith or George Browne, who served &quot;foreign&quot; Lords. While I see that Keith&#39;s circumstances were a bit special, that still begets the questions:</p>\n\n<p>How fluid was cultural identity - in the sense of e.g. being Prussian, or Irish, or Russian - before the advent of modern nation states? Would someone like Keith or Browne readily adopt the culture of their &quot;host&quot;, or stay somewhat firmly rooted in the culture of their upbringing? Was cultural identity something that bothered them - or their Lords - at all? Or was it reserved for creating a concept of &quot;otherness&quot; when fighting a &quot;foreign&quot; foe and did not matter to people of status (or commoners, for that matter)?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/lgr5wv/how_fluid_was_cultural_identity_before_the_advent/",
  "subreddit": "AskHistorians",
  "id": "lgr5wv",
  "is_self": true,
  "media": null,
  "is_video": false
}