{
  "author": "BradPit_B4_GrabClit",
  "the_new_excerpt": "So Iv came across something interesting whilst reading about BlackBerry’s\ncurrent CEO John S Chen.\n\nFrom his wiki\n\n“Chen became CEO of Sybase in 1998.[12] As Sybase had been a strong competitor\nof Oracle, but had become a \"dead company\" after failing to enter the market for\nenterprise applications,…",
  "original_created_utc": 1613176237,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，我在阅读黑莓的时候发现了一些有趣的事情。\n现任CEO陈俊生。\n\n来自他的wiki\n\n\"1998年，陈建国成为Sybase的CEO。\"[12]由于Sybase曾是一个强大的竞争对手。\n的甲骨文公司，但在进入市场失败后，已经成为一家 \"死公司\"，为。\n企业应用，...",
      "title": "读懂黑莓(BB)的CEO"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，我在閱讀黑莓的時候發現了一些有趣的事情。\n現任CEO陳俊生。\n\n來自他的wiki\n\n\"1998年，陳建國成爲Sybase的CEO。\"[12]由於Sybase曾是一個強大的競爭對手。\n的甲骨文公司，但在進入市場失敗後，已經成爲一家 \"死公司\"，爲。\n企業應用，...",
      "title": "讀懂黑莓(BB)的CEO"
    }
  ],
  "title": "Reading into Blackberry’s (BB) CEO",
  "created_utc": 1613194422,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So Iv came across something interesting whilst reading about BlackBerry’s current CEO John S Chen.</p>\n\n<p>From his wiki</p>\n\n<p>“Chen became CEO of Sybase in 1998.[12] As Sybase had been a strong competitor of Oracle, but had become a &quot;dead company&quot; after failing to enter the market for enterprise applications, as Oracle had. \nChen and his team proceeded to reinvent Sybase as an &quot;enabler of the &#39;unwired enterprise&#39;&quot;.[12] In so doing, Chen and his team led a re-invention strategy that that led to the turnaround of the company into a profitable mobile device producer,[13] valued at $6 billion in 2010.[12]\nSybase achieved strong financial performance and shareholder returns under Chen&#39;s leadership”</p>\n\n<p>Synapse’s story sounds familiar to blackberry’s. </p>\n\n<p>Chen’s done this before successfully and blackberry’s direction since losing the smartphone market has been successful and undervalued imo </p>\n\n<p>Now they’ve shook hands with Facebook and settled their dispute. Shook hands with Amazon to develop and market software for cloud-connected vehicles, obviously the future for the automotive industry. Their security is industry leading at the moment, it’s not just automotive ...etc etc etc there’s lots of DD been posted explaining in detail </p>\n\n<p>I just thought it’s not bad having a CEO that’s successfully transitioned a ‘has been’ brand before (and raised its stock)  on top of the  currently undervalued services they provide </p>\n\n<p>I’m hoping bb’s price settles back down to around $6 again and I’ll buy more and go long </p>\n\n<p>bb ☾</p>\n</div><!-- SC_ON -->",
  "score": 139,
  "permalink": "/r/investing/comments/lioyoz/reading_into_blackberrys_bb_ceo/",
  "subreddit": "investing",
  "id": "lioyoz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621132
}