{
  "author": "TrueSpins",
  "original_created_utc": 1644040009,
  "title": "Am I the only one that still has no idea what the Metaverse is actually meant to be?",
  "created_utc": 1644115769,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So what on earth is it?&lt;/p&gt;\n\n&lt;p&gt;Is it just the idea that we&amp;#39;ll all be playing MMORPGs all day with VR? Rather then chatting with someone on zoom I&amp;#39;ll spend half an hour wiring up my VR kit so I can chat to their avatar in a pretend conference room? And then we&amp;#39;ll go to a pretend coffee bar where we&amp;#39;ll pretend to drink coffee that we&amp;#39;ll buy with crypto?&lt;/p&gt;\n\n&lt;p&gt;Is it just the idea of a persistent online virtual world? But which world? Presumably anyone can make their own metaverse? Does Eve Online count as the metaverse? Habbo Hotel? Or does it have to have VR?&lt;/p&gt;\n\n&lt;p&gt;Isn&amp;#39;t the internet just the metaverse? Or does it always require some sort of game like VR interface to count?&lt;/p&gt;\n\n&lt;p&gt;And what role does Blockchain play in the metaverse? Is it intended to support the persistence and the idea of one true metaverse? But whose Blockchain? Surely anyone can create their own Blockchain for their own metaverse? &lt;/p&gt;\n\n&lt;p&gt;Why are people buying virtual land in the metaverse? What utility does it have? And given it&amp;#39;s just a simulation, the land itself is presumably infinite? So why pay for it?&lt;/p&gt;\n\n&lt;p&gt;Am I just an old grumpy man?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/skzhyx/am_i_the_only_one_that_still_has_no_idea_what_the/",
  "subreddit": "CryptoCurrency",
  "id": "skzhyx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So what on earth is it?\n\nIs it just the idea that we'll all be playing MMORPGs all day with VR? Rather\nthen chatting with someone on zoom I'll spend half an hour wiring up my VR kit\nso I can chat to their avatar in a pretend conference room? And then we'll go to\na pretend coffee bar where we'll…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "では、いったい何なのでしょうか？\n\nVRで一日中MMORPGをやっているようなイメージなんでしょうか？それよりも\nズームで誰かとチャットしている間に、30分かけてVRキットを配線する。\n会議室のような場所で、相手のアバターとチャットできるのでしょうか？そして、その後に行くのは\nコーヒーバーで...",
      "title": "メタバースの実際の意味がまだわからないのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "那么这究竟是什么呢？\n\n难道仅仅是我们都会用VR整天玩MMORPG的想法？与其说\n我将花半个小时的时间把我的VR设备连接起来，这样我就可以在一个假装的会议室里和他们的头像聊天了。\n这样我就可以在一个假装的会议室里和他们的头像聊天了？然后我们会去到\n一个假装的咖啡吧，在那里我们将...",
      "title": "难道只有我一个人还不知道Metaverse到底是什么意思？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "那麼這究竟是什麼呢？\n\n難道僅僅是我們都會用VR整天玩MMORPG的想法？與其說\n我將花半個小時的時間把我的VR設備連接起來，這樣我就可以在一個假裝的會議室裏和他們的頭像聊天了。\n這樣我就可以在一個假裝的會議室裏和他們的頭像聊天了？然後我們會去到\n一個假裝的咖啡吧，在那裏我們將...",
      "title": "難道只有我一個人還不知道Metaverse到底是什麼意思？"
    }
  ]
}