{
  "author": "Jeremykla",
  "the_new_excerpt": "Tax liability is a major source of concern for anyone invested in Bitcoin and\nother digital assets.\n\nBut while some countries are putting pressure on investors and levying taxes on\nincome and capital gains from Bitcoin transactions, many are taking a different\napproach—often with the aim of…",
  "original_created_utc": 1620749598,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインをはじめとするデジタル資産に投資している人にとって、税金の問題は大きな関心事です。\n税務上の問題は、ビットコインやその他のデジタル資産に投資している人にとって大きな問題です。\n\nしかし、一部の国では、投資家に圧力をかけ、ビットコイン取引による所得やキャピタルゲインに課税しているところもあります。\nしかし、一部の国は投資家に圧力をかけ、ビットコイン取引による所得やキャピタルゲインに課税していますが、多くの国は異なるアプローチをとっています。\n多くの国は異なるアプローチをとっており、その目的はしばしば...",
      "title": "国ごとの暗号利益に対する税金（リスト更新中"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于任何投资于比特币和其他数字资产的人来说，税务责任是一个主要的关注点。\n和其他数字资产的人的主要担忧。\n\n但是，尽管一些国家正在对投资者施加压力，对比特币交易的收入和资本收益征税\n税，但许多国家却采取了不同的方法。\n办法--通常的目的是...",
      "title": "每个国家对加密货币利润的征税情况（更新列表）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於任何投資於比特幣和其他數字資產的人來說，稅務責任是一個主要的關注點。\n和其他數字資產的人的主要擔憂。\n\n但是，儘管一些國家正在對投資者施加壓力，對比特幣交易的收入和資本收益徵稅\n稅，但許多國家卻採取了不同的方法。\n辦法--通常的目的是...",
      "title": "每個國家對加密貨幣利潤的徵稅情況（更新列表）。"
    }
  ],
  "title": "Taxes on crypto profits per country (updating list)",
  "created_utc": 1620812443,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Tax liability is a major source of concern for anyone invested in Bitcoin and other digital assets.</p>\n\n<p>But while some countries are putting pressure on investors and levying taxes on income and capital gains from Bitcoin transactions, many are taking a different approach—often with the aim of promoting better adoption and innovation within the crypto industry. They’ve implemented friendlier legislation, and allow investors to buy, sell, or hold digital assets with no tax liability.</p>\n\n<p>I&#39;ve looked up the different laws in country&#39;s about taxable events related to cryptocurrencies and listed them down below. If you&#39;re missing your country, please comment and i&#39;ll look into it. This list is a work in progress, so maybe things will change in the long run and i&#39;ll update it.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Argentina:</strong> Income tax based system. Any profit (from holding, trading, mining) is taxable for 15%.</li>\n<li><strong>Austria:</strong>  Cryptocurrency assets are deemed an interest-bearing investment. The gained interest, as well as realised changes in value are in this case subject to the special tax rate of 27.5% in accordance with <a href=\"http://publications.ruchelaw.com/news/2017-12/guidance-taxation-bitcoin-cryptocurrency.pdf\">§ 27a(1)</a>of the Austrian Income Tax Act.</li>\n<li><strong>Australia:</strong>  In short, cryptocurrencies are subject to <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gain tax</a>  and ordinary income tax in Australia, depending on the circumstances of the transaction. CGT is the tax you pay on the difference between the Australian Dollar (AUD) value of the disposed asset at the time of the disposition minus the AUD value of the disposed asset at the time it was acquired.If the assets have been held by an individual for more than 12 before selling, you can apply a CGT discount:</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>50% for resident individuals (including partners in partnerships)  </p>\n\n<p>33.33% for complying super funds and eligible life insurance companies  </p>\n\n<p>50% discount is removed or reduced on capital gains made after 8 May 2012 for foreign resident individuals</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Belarus</strong>: There&#39;s a <a href=\"https://www2.deloitte.com/content/dam/Deloitte/ru/Documents/tax/lt-in-focus/english/2017/27-12-en.pdf\">Decree</a> signed by the president of Belarus <a href=\"https://en.wikipedia.org/wiki/Alexander_Lukashenko\">Alexander Lukashenko</a> to exclude digital tokens from the same regulations as applied to traditional markets in the nation. This law is in use until Jan 1, 2023.</li>\n<li><strong>Belgium:</strong>  Anyone who makes gains out of speculating on the cryptocurrency market must pay 33% and list these gains under &quot;miscellaneous income&quot; on their tax returns.</li>\n<li><strong><em>Brazil:</em></strong> if you have more then R$5000 (around U$ 950) in any crypto, you need to declare it as an asset in the end of financial year. You pay taxes (15%) once you sell for more then R$35.000 (around $6.700). Failing to report cryptocurrencies will result in a fine ranging from R$500 to R$1500 (around $120 to $360).</li>\n<li><strong>The British Virgin Islands:</strong>  BVI does not impose any <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains taxes</a>, income tax, or corporate taxes for companies and individuals who reside there. </li>\n<li><strong>Canada:</strong>  Cryptocurrency is taxed in Canada as either <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains</a> or as income tax, depending on whether your activity with cryptocurrency is considered to be as a business or not. 100% of business income is taxable, whereas only 50% of capital gains are taxable.</li>\n<li><strong>Cayman Islands:</strong>  The Cayman Islands are another popular tax haven for individuals and companies. There are no taxes for all types of crypto activity in the Cayman Islands. </li>\n<li><strong>Croatia:</strong> Capital gains tax at an 12% rate for individuals and an 18% rate for company&#39;s.</li>\n<li><strong>Czech Republic:</strong>  cryptocurrencies  are differently taxed depending on their use. Overall, individuals that trade cryptocurrencies are taxed at a rate of 15%, while businesses are taxed at a rate of 19%. This is calculated on <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains</a> from the price of buying and selling on a later date.</li>\n<li><strong>Denmark:</strong> generally treats cryptocurrencies as <a href=\"https://www.investopedia.com/terms/c/capitalasset.asp\">capital propert</a> (55%) for tax purposes, taxing gains and allowing for deductions on losses.  If you have both made a profit and a loss on your transactions, you should normally enter your profit in box 20 of your tax assessment notice and your loss in box 58 of your tax assessment notice, respectively. You should not offset a loss against any profit.</li>\n<li><strong>Finland:</strong>  Finland taxes cryptocurrencies both at the acquisition stage and at the realization stage. So <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains</a> from the moment you buy and sell your tokens. Finish law also depicts three other kinds of Cryptocurrencies gains:</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Hard forks: cryptocurrencies created through hard forks are taxed at the time of transfer, using an acquisition cost of zero. A forked cryptocurrency is therefore not taxed at the time of acquisition but rather at the moment of selling.  </p>\n\n<p>Airdrops:  Treatment of airdrops for taxation purposes will depend on whether they are treated as mined cryptocurrencies, staked cryptocurrencies, forked cryptocurrencies, or as a gift.  An airdrop offered only to current holders of a currency might be considered a gain on previously held property and treated as staked currency taxable as a capital gain.   </p>\n\n<p>Gifts:  Finland does not tax gifts or lottery winnings (provided the winnings come from a Finnish or European Economic Area lottery and do not require any work from the winner)  For purposes of transfers of cryptoassets within a year of receipt as a gift, the value of the cryptoasset at the time of receipt as a gift will be determined by the value at the time when the giver acquired the asset.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>France:</strong>  Profits from cryptocurrency speculation and mining are treated as industrial and commercial profits subject to the progressive income tax schedule (45% of marginal plus social contributions). For companies, profits from cryptocurrencies are liable to tax under the general corporation tax regime for profits and losses. Currently, corporate income tax is levied at the rate of 33.33% . <em>The standard rate is to be gradually reduced to 25% in 2022.</em></li>\n<li><strong>Germany</strong>:  For German residents, any cryptocurrency held for over a year is <a href=\"https://www.investopedia.com/terms/t/tax_exempt.asp\">tax-exempt</a>, regardless of the amount. If the assets are held for less than a year, capital gains tax doesn’t accrue on a sale, as long as the amount does not exceed 600 euros ($692).</li>\n<li><strong>Greece:</strong>  cryptocurrencies can be taxed two ways, as capital gains and income. In case of companies, any business activity or capital gains derived from mining or trading virtual currencies triggers a 29% flat rate tax. In case of individuals, there is a split: capital gains are taxed at 15%, while personal income attracts rates from 22% to 45%.</li>\n<li><strong>Hungary: C</strong>ryptocurrencies are subject to <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gain tax</a>  of 30.5%. <em>There are plans to</em> cut the tax rate to 15% <em>in the near future, because of the covid-pandemic.</em></li>\n<li><strong>Hong Kong:</strong>  Essentially, whether cryptocurrencies are taxed or not depends on their use, according to <a href=\"https://www.linkedin.com/today/author/henriarslanian\">Henri Arslanian,</a> a global crypto leader at <a href=\"https://www.pwchk.com/\">PwC.</a>  “If digital assets are bought for long-term investment purposes, any profits from disposal would not be chargeable to profits tax,” he wrote in March when the directive was introduced.</li>\n<li><strong>Israel:</strong> Capital gains tax based at 30% for both individuals as company&#39;s.</li>\n<li><strong>Italy:</strong> If you&#39;re earnings are more then €51.645,69 for seven consecutive days you have to pay a tax rate of 26%. You&#39;ve can&#39;t trade cryptocurrencies.</li>\n<li><strong>India:</strong> <em>There aren&#39;t any taxation laws at the moment, but in recent news there&#39;s some laws in the making. They are looking into the following:</em></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Bitcoin mining  </p>\n\n<p>Bitcoin held as an investment being transferred in exchange of real currency  </p>\n\n<p>Bitcoin held as stock-in-trade being transferred in exchange for real currency  </p>\n\n<p>Bitcoins being received as consideration on sale of goods and service</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Japan:</strong> Income based tax rate of 5% to 45%. The law is kinda fishy about this. <em>it also seems some laws are in the making to make he rate 20%.</em></li>\n<li><strong>South-Korea:</strong> Capital gains tax based divided on sales (11% rate) and gains (22%).</li>\n<li><strong>Malaysia:</strong>   In Malaysia, cryptocurrency transactions are currently tax-free, and cryptocurrencies don’t qualify for <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains tax</a>, because digital currencies are not considered assets or legal tender by the authorities. </li>\n<li><strong>Malta:</strong>  Malta doesn’t apply <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains tax</a> to long-held digital currencies like Bitcoin, but crypto trades are considered similar to day trading in stocks or shares, and attract business income tax at the rate of 35%. However, this can be mitigated to between five percent and zero, through “structuring options” available under the Maltese system. </li>\n<li><strong>Netherlands:</strong> The value of your crypto investment is counted on the first day of January. It&#39;s taxed in <a href=\"https://www.homefinance.nl/belastingen/inkomstenbelasting-box-3.asp\">box 3</a>.</li>\n<li><strong>Norway:</strong> The Norwegian Tax Authority has issued a statement on the following two points:</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Income derived from the sale of cryptocurrencies such as bitcoins will be treated as capital property, at least for tax purposes (22%).  Capital property legislation allows deductions for losses and taxes gains. Although travel currencies are exempted from the capital gains tax, cryptocurrencies such as bitcoins are not, because cryptocurrencies are not recognized as travel currencies.Income from actively mining cryptocurrencies by the owner him or herself is likely to be considered other income. The mining of cryptocurrencies on a larger scale, on the other hand, may be considered business income</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Peurto Rico:</strong>  Puerto Rico comes under U.S. Territory, but it is considered a foreign country for U.S. federal income taxes. Puerto Rico is well known for <a href=\"http://puertoricotaxincentives.com/\">Act 22</a> that maintains zero capital gains tax and only a 4% income tax rate. </li>\n<li><strong>Philippines:</strong> Not taxable as of yet.</li>\n<li><strong>Poland:</strong>  You only pay taxes on your income. I f you had sold no cryptocurrencies in a given year (nor had you used them to pay for, e.g., an excavator or a service), no revenue will be shown. And no income will be shown, either.  The tax rate is 19% on income (i.e. the difference between gross revenue and deductible expenses).</li>\n<li><strong>Portugal:</strong>   Proceeds from the sale of cryptocurrencies by individuals have been <a href=\"https://www.investopedia.com/terms/t/tax_exempt.asp\">tax-exempt</a> since 2018, and cryptocurrency trading is not considered investment income.</li>\n<li><strong>Singapore:</strong>   If digital currencies are being traded, the profit is taxed, but if the profits are long-term investments, they are not subject to taxes. Traded as an investment, profits and losses in cryptocurrency are considered capital gains; but as a non-property type of capital gain, they are tax exempt.</li>\n<li><strong>Slovakia:</strong>  As for other income, the <strong>tax</strong> rates applying are either 19% or 25%. Whereas the first applies for a total income lower than 35.022,31€, the latter if the total income is above this.</li>\n<li><strong>Slovenia:</strong>  No capital gains tax is levied on individuals when they sell Bitcoin, and gains are not considered income. However, companies that receive payment in cryptocurrencies, or through mining, are required to pay tax at the corporate rate.</li>\n<li><strong>Spain:</strong>  you must inform about any cryptocurrency acquisition, transmission, exchange, transfer, collection, or payment made. Basically on the profits you generate when you bought any coin at a price X, but sold it at a higher price, Y. That is, you must pay taxes on the gain generated (the difference between the selling and the buying price, Y – X). It works under the following brackets:</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>From 0 to €6.000, you must pay a 19%  </p>\n\n<p>From €6.001 to €50.000, 21%  </p>\n\n<p>From €50.001 onwards, 23%</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Switzerland:</strong> For the purpose of tax assessment, cryptocurrencies must be voncerted into Swiss Francs. <a href=\"https://www.estv.admin.ch/estv/en/home.html\">The Federal Tax Administration (FTA)</a> provides year-end conversion rates for certain cryptocurrencies such as Bitcoin, Ethereum, Ripple, Bitcoin Cash and Litecoin. The cryptocurrencies are considered to be assets, comparable with bank deposits , and Are therefore subject to wealth taxes. In general <a href=\"https://www.investopedia.com/terms/c/capital_gains_tax.asp\">capital gains</a> on assets of individuals such as cryptocurrencies are exempt from income tax.</li>\n<li><strong>The United Kingdom:</strong>  Anyone buying and selling Bitcoin in an individual capacity is most likely to be subject to UK Capital Gains Tax (CGT) on any gains made.  For those who are considered as trading in cryptocurrencies (i.e. buying and selling with a high frequency), Income Tax may be due on the profits as trading income. <a href=\"https://www.gov.uk/government/organisations/hm-revenue-customs\">HMRC’s</a> view is that only in exceptional circumstances would it expect individuals to buy and sell cryptoassets with such frequency, level of organisation and sophistication that the activity amounts to a financial trade.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>You don&#39;t pay taxes on the first  £12,300 of capital gains.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>The United States of America:</strong>  Buying and selling crypto is taxable because the IRS identifies crypto as property, not currency. As a result, tax rules that apply to property (but not real estate tax rules) transactions, like selling collectible coins or vintage cars that can appreciate in value, also apply to <a href=\"https://www.coinbase.com/price/bitcoin\">bitcoin</a>,<a href=\"https://www.coinbase.com/price/ethereum\"> ethereum</a>, and <a href=\"https://www.coinbase.com/price\">other cryptocurrencies</a>. It also depends on how long you&#39;re holding your tokens &lt;1 year 10% to 37% and &gt;1 0%, 15% or 20% taxable.</li>\n<li><strong>New Zealand:</strong> Cryptographers are treated as a form of property for tax purposes. There are three kinds of tax brackets:</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Income tax for individuals: acquiring cryptoassets for the purpose of disposal (for example to sell or exchange), trading in cryptoassets, using cryptoassets for a profit-making scheme.  </p>\n\n<p>Income tax for businesses and organisations: Your business needs to pay tax on cryptoassets it receives as payment, or that it sells or exchanges. How tax applies will depend on the type of business you have.  </p>\n\n<p>Taxing cryptoasset income: Before you can put your cryptoasset net income (or loss) in your tax return you need to:  </p>\n\n<p>calculate the New Zealand dollar value of your cryptoasset transactions  </p>\n\n<p>work out your cryptoasset income and expenses.  </p>\n\n<p>If you held cryptoassets that were stolen, you may be able to claim a deduction for the loss.</p>\n</blockquote>\n\n<p>&#x200B;</p>\n\n<p>So it seems we are using some profits to buy some tickets to far away dream islands and invest more to get even bigger bags!</p>\n\n<p><strong><em>Keep stacking and learn to take profits!</em></strong></p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/na0nbf/taxes_on_crypto_profits_per_country_updating_list/",
  "subreddit": "CryptoCurrency",
  "id": "na0nbf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992428
}