{
  "author": "SnooObjections2665",
  "the_new_excerpt": "The Fourth Industrial Revolution is characterised by the fusion of the digital,\nbiological, and physical worlds, as well as the growing utilisation of new\ntechnologies. It is the trend towards automation and data exchange in\nmanufacturing technologies and processes which include:\n\n * Cyber-physical…",
  "original_created_utc": 1616572099,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "第四次工业革命的特点是数字的融合。\n以及越来越多地利用新的生物、物理和物理世界，以及越来越多地利用新的技术。\n技术。是自动化和数据交换的趋势，在。\n制造技术和工艺，包括： * 网络物理..:\n\n * 网络物理...",
      "title": "第四次工业革命的最佳股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "第四次工業革命的特點是數字的融合。\n以及越來越多地利用新的生物、物理和物理世界，以及越來越多地利用新的技術。\n技術。是自動化和數據交換的趨勢，在。\n製造技術和工藝，包括： * 網絡物理..:\n\n * 網絡物理...",
      "title": "第四次工業革命的最佳股票"
    }
  ],
  "title": "Best stocks for the fourth industrial revolution",
  "created_utc": 1616612318,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Fourth Industrial Revolution is characterised by the fusion of the digital, biological, and physical worlds, as well as the growing utilisation of new technologies. It is the trend towards automation and data exchange in manufacturing technologies and processes which include:</p>\n\n<ul>\n<li>Cyber-physical systems (CPS) / Cyber security</li>\n<li>Cloud Computing</li>\n<li>Ai</li>\n<li>Advanced Robotics / automation</li>\n<li>Big-data</li>\n<li>3D printing</li>\n<li>Quantum computing (hypothetically)</li>\n<li>Robotic process automation (RPA)</li>\n<li>Semi-conductors</li>\n<li>Biotechnology / Healthcare</li>\n<li>IoT manufacturing</li>\n<li>Renewable energy</li>\n<li>Crypto (I have no experience in this besides some small positions in BTC and ETH, feel free to drop any DD and knowledge)</li>\n</ul>\n\n<p>Of course there&#39;s discussions which one are part of the industry 4.0 so I might be missing a few.</p>\n\n<p>since I believe that we are still at the start of this revolution, I want to invest in promising companies related to those industries. Some companies already have proven themselves, others are still in the &#39;startup&#39; fase.</p>\n\n<p><strong>Hereby a list of the companies from which I think are the best or will be the best in the corresponding sector. What sectors and which must-have companies am I missing?</strong></p>\n\n<p><strong>Note:</strong> some sectors are very broad so they might overlap.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Cyber-physical systems (CPS) / Cyber security</strong>\n\n<ul>\n<li><strong>CrowdStrike - $CRWD</strong>\n\n<ul>\n<li>Offers a broad spectrum of solutions with the main goal of cyber-security. Some well-known clients where they have solved hacks are Sony Pictures and the DNC (Democratic National Committee). The company is the market leader in the cloud-based endpoint security segment and is also expanding into 5G network security.</li>\n</ul></li>\n<li><strong>Cloudflare - $NET</strong>\n\n<ul>\n<li>Offers a wide range of network services to companies around the world. Cloudflare&#39;s intelligent global network spans more than 200 cities in more than 100 countries. It provides network security and improved network performance and reliability to an increasing proportion of the total Internet used. More than 15% of the internet is used via Cloudflare</li>\n</ul></li>\n<li><strong>BlackBerry - $BB</strong>\n\n<ul>\n<li>They are working on AI powered cybersecurity</li>\n<li>They also work on QNX. QNX is a real-time embedded OS that controls software systems in (modern, especially EV) cars and forms the basis of solutions such as BlackBerry Radar, an IoT based asset tracking system for the transport sector.</li>\n<li>Spark Suites: Spark provides visibility and protection for all endpoints, including personal laptops and smartphones used for work. It uses AI, machine learning, and automation to provide better cyberattack prevention.</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Cloud Computing</strong>\n\n<ul>\n<li>I&#39;ll include Amazon and Microsoft since they deserve a spot in this list. But Amazon and Microsoft are already some of the biggest in the world and make all sorts of stuff. It&#39;s entirely possible their innovations will be integral to aspects of the 4th Industrial Revolution, but it may also only be a relative drop or glass in the larger bucket that they currently represent.</li>\n<li><strong>Amazon - $AMZN</strong></li>\n<li><strong>Microsoft - $MSFT</strong></li>\n<li><strong>Cloudflare - $NET - See DD in previous category</strong></li>\n<li><strong>Fastly - $FSLY - Need DD</strong></li>\n<li><strong>Digital Ocean - $DOCN - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Ai</strong>\n\n<ul>\n<li><strong>C3Ai - $AI - Need DD</strong></li>\n<li><strong>Nvidia - NVDA - Need DD</strong></li>\n<li><strong>Intel - INTC - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Advanced Robotics / automation</strong>\n\n<ul>\n<li><strong>Teradyne - $TER</strong>\n\n<ul>\n<li>Focusses on industrial automation, semiconductor testing, wireless testing and storage testing. Customers are Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM. <strong>Some of their business units are:</strong></li>\n<li>The System Test Group: they build test machines for printed circuit boards and hard drives</li>\n<li>LifePoint: test machines for manufacturers of wireless modules and consumer electronics.</li>\n<li>Universal robots: provides collaborative robots (cobots) that work side by side with production workers. UR-cobots automate tasks such as machine loading, packaging, gluing, painting, polishing and assembling parts</li>\n<li>Mobile Industrial Robots: offers autonomous mobile robots for the management of internal logistics (for loads under 1,500 kg). These robots are currently used in the transportation, healthcare, pharmaceutical, metal and plastics, fashion, technology and food industries.</li>\n<li>AutoGuide Mobile Robots manufactures modular industrial mobile robots (for loads up to 45,000 kg). These high payload robots are used for assembly, material handling, storage and distribution across multiple industries.</li>\n</ul></li>\n<li><strong>Cyberdyne - $CYBQY - Need DD</strong></li>\n<li><strong>ABB - $ABB - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Big-data</strong>\n\n<ul>\n<li><strong>Palantir - $PLTR</strong>\n\n<ul>\n<li>This is the way</li>\n</ul></li>\n<li><strong>SalesForce - $CRM</strong>\n\n<ul>\n<li>Big data CRM (big data customer relationship management) refers to the practice of integrating big data into a company&#39;s CRM processes with the goals of improving customer service, calculating return on investment on various initiatives and predicting clientele behavior.</li>\n<li>Salesforce is the leader in the CRM sector. Recently, Salesforce has acquired the big data firm “Tableau” for $15.3 billion and Slack for $27.7 billion, adding muscle in its fight with some major leaders. Moreover, the integration of Salesforce CRM and Big Data will enable businesses in analyzing customer patterns and preferences.</li>\n</ul></li>\n<li><strong>SnowFlake -$SNOW - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>3D Printing</strong>\n\n<ul>\n<li><strong>Desktop Metal - $DM</strong>\n\n<ul>\n<li>Co-founders are MIT alumnus Ric Fulop and 4 other MIT professors.</li>\n<li>They have a new patent called &quot;single pass jetting&quot;. It takes most 3D printing machines several times to print one layer, Desktop Metal can do it in one go. This makes them by far the fastest in the entire industry (up to 4x faster) - Speed ​​means lower costs, what DM printers can do in 1 day, takes other printers 3-4x that time.</li>\n<li>They have secured a global distribution network of more than 80 partners in 60 countries offering their Live Parts software as SaaS. Live Parts is an AI software that allows users to automatically generate printable object designs. The program allows users to enter specifications for an object and then create a computer model that can be printed. As a result, they are assured of huge income in addition to their hardware</li>\n<li>Today, Desktop Metal announced that it launched Desktop Health, a line specifically devoted to healthcare-adjacent products. The line encompasses a number of different technologies, including binder jetting, bioprinting and various materials.</li>\n</ul></li>\n<li><strong>Nano Dimension - DD is from their website</strong>\n\n<ul>\n<li>Nano Dimension’s DragonFly System is a one-stop solution for agile hardware development and innovative circuit design across a wide array of industries. It empowers companies to securely control entire development cycles through in-house additive manufacturing of PCBs and non-planar electronics with speed and precision, while reducing R&amp;D costs. With it’s Lights-Out Digital Manufacturing (LDM) printing technology, this is the industry’s only comprehensive manufacturing printing platform for round-the-clock 3D printing of electronic circuitry.</li>\n</ul></li>\n<li><strong>Markforged - $AONE - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Quantum Computing</strong>\n\n<ul>\n<li><strong>IonQ - $DMYI</strong>\n\n<ul>\n<li>A quick introduction to QC: a normal computer exists of bytes, so 0 OR 1, a QC has qubits, so possibly 0 AND 1 at the same time. In theory this will improve the computational power of computers in a massive way and therefore QC wil be able to solve different classes of problems</li>\n<li>The qubits that make up QCs are prone to error given the fragile nature of the quantum states. There are 2 quantum states: ion trap (IonQ, Honeywell) and superconducting qubits (IBM, Google). These have about a 0.5% chance of an error during a so-called 2-qubit gate operation (<a href=\"https://en.wikipedia.org/wiki/Quantum_logic_gate\">https://en.wikipedia.org/wiki/Quantum_logic_gate</a>), thus limiting the complexity of the computation you will be able to do.</li>\n<li>So a lot of research is being done to improve these physical error rates, but an improvement of more than 0.01% seems to be difficult.  This is where error correction becomes important. People have come up with error correction codes that can tolerate error rates and create a much lower error rate by creating what&#39;s called a logical qubit. (<a href=\"https://en.wikipedia.org/wiki/Physical_and_logical_qubits\">https://en.wikipedia.org/wiki/Physical_and_logical_qubits</a>).</li>\n<li>It takes a lot of physical qubits to make 1 single logical qubit.  Most researchers believe that with a few hundred to a few thousand very good logic qubits you can solve very impactful problems in the world and thus create significant value.  IonQ expects to achieve this in 7 years (<a href=\"https://ionq.com/posts/december-09-2020-scaling-quantum-computer-roadmap\">https://ionq.com/posts/december-09-2020-scaling-quantum-computer-roadmap</a>)</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Robotic process automation</strong>\n\n<ul>\n<li><strong>Blue Prism - $PRSM - Need DD</strong></li>\n<li><strong>UiPath - $UIPTH (IPO later this year)</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Semi-Conductors:</strong>\n\n<ul>\n<li><strong>ASML Holding - $ASML</strong> - ASML makes the machines to produce semi-conductors. It&#39;s the absolute leader in this sector. It&#39;s currently the largest supplier of photolithography systems for the semiconductor industry.</li>\n<li><strong>Intel - $INTC - Need DD</strong></li>\n<li><strong>Advanced Micro Devices - $AMD - Need DD</strong></li>\n<li><strong>Nvidia - $NVDA - Need DD</strong></li>\n<li><strong>Taiwan Semiconductor Mfg - $TSM - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Biotech / Healthcare</strong>\n\n<ul>\n<li><strong>Crispr Therapeutics - $CRSP - Need DD</strong></li>\n<li><strong>Beam Therapeutics - $BEAM - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Internet of Things manufacturing</strong>\n\n<ul>\n<li><strong>PTC - $PTC - Need DD</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Renewable Energy</strong></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Crypto</strong>\n\n<ul>\n<li><strong>Bitcoin</strong></li>\n</ul></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p><strong>EDIT 1: &#39;m not from the states so I can&#39;t buy any of Cathie&#39;s ARK ETF&#39;s</strong></p>\n</div><!-- SC_ON -->",
  "score": 442,
  "permalink": "/r/investing/comments/mc095v/best_stocks_for_the_fourth_industrial_revolution/",
  "subreddit": "investing",
  "id": "mc095v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819541
}