{
  "author": "Cintre",
  "the_new_excerpt": "So I’ve introduced crypto to my mom by helping her making a Coinbase account and\nget the free rewards.\n\nA few weeks later, she decided to invest in it but she only buy the coins with\nlogos that she likes. I tried to explain to her that’s not really how it works\nbut you know, moms can be pretty…",
  "original_created_utc": 1620119725,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "母がCoinbaseのアカウントを作るのを手伝って、暗号を紹介しました。\n無料の報酬を得ることができました。\n\n数週間後、母は投資をすることにしましたが、自分が好きなロゴの入ったコインだけを購入していました。\n気に入ったロゴのコインしか買わないんです。私はそれが本当の仕組みではないことを説明しようとしましたが\nでも、お母さんって、結構いい加減なところがあるんですよね...。",
      "title": "最高のDD-私の母はロゴで暗号のトップ10を評価する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我向我妈妈介绍了加密货币，帮她开了一个Coinbase账户，并获得了免费奖励。\n获得免费奖励。\n\n几周后，她决定投资，但她只买有她喜欢的标志的硬币。\n她喜欢的标志。我试图向她解释，这并不是真正的工作方式\n但你知道，妈妈们可能是很...",
      "title": "有史以来最好的DD--我妈妈根据他们的标志对前10名加密货币进行评级"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我向我媽媽介紹了加密貨幣，幫她開了一個Coinbase賬戶，並獲得了免費獎勵。\n獲得免費獎勵。\n\n幾周後，她決定投資，但她只買有她喜歡的標誌的硬幣。\n她喜歡的標誌。我試圖向她解釋，這並不是真正的工作方式\n但你知道，媽媽們可能是很...",
      "title": "有史以來最好的DD--我媽媽根據他們的標誌對前10名加密貨幣進行評級"
    }
  ],
  "title": "Best DD ever- my mom rates the top 10 crypto by their logos",
  "created_utc": 1620146374,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve introduced crypto to my mom by helping her making a Coinbase account and get the free rewards. </p>\n\n<p>A few weeks later, she decided to invest in it but she only buy the coins with logos that she likes. I tried to explain to her that’s not <em>really</em> how it works but you know, moms can be pretty stubborn so I let her do her thing. </p>\n\n<p>Here’s her rating of the top 10 coins based on their logo</p>\n\n<p><strong>1 - BTC</strong></p>\n\n<p>Pretty basic, she likes the orange color but it could be done by a 12yo on paint with windows 98. </p>\n\n<p>5/10</p>\n\n<p><strong>2 - ETH</strong></p>\n\n<p>She really likes this one, pretty, original design and makes her think of diamonds. </p>\n\n<p>9/10</p>\n\n<p><strong>3 - BNB</strong></p>\n\n<p>Looks like they tried to do a “futuristic” design but failed to do so, the yellowish brownish color used is not very pretty. It’s fine, but not great</p>\n\n<p>6/10</p>\n\n<p><strong>4 - XRP</strong></p>\n\n<p>Pretty one, basic but efficient, curved lines of the “X” makes it elegant </p>\n\n<p>8/10</p>\n\n<p><strong>5 - DOGE</strong></p>\n\n<p>Meh. Not pretty, same as bitcoin, looks like it was made by a kid on paint. The color looks like diarrhea </p>\n\n<p>4/10</p>\n\n<p><strong>6 - USDT</strong></p>\n\n<p>The green color is pretty, the T seems like it’s doing hula hoops with the circle around it, very healthy! </p>\n\n<p>7/10</p>\n\n<p><strong>7 - ADA</strong></p>\n\n<p>Original, looks like a star, she likes the design of it as it is a little bit different than every others </p>\n\n<p>8/10</p>\n\n<p><strong>8 - DOT</strong></p>\n\n<p>Nothing original about it, basic P with a dot but it makes sense because of the name of it, it’s fine</p>\n\n<p>5/10</p>\n\n<p><strong>9 - UNI</strong></p>\n\n<p>Pretty but a little bit childish in her opinion, too much details for a logo. A 10yo would buy it right away</p>\n\n<p>6/10</p>\n\n<p><strong>10 - LTC</strong></p>\n\n<p>Again, basic paint logo made with windows 98, nothing original but the color used bumps up the rate a little bit</p>\n\n<p>5/10</p>\n\n<p>To resume her amazing DD, ETH is first, followed closely by ADA &amp; XRP.  Let me know if you want more of these amazing mom’s DD</p>\n</div><!-- SC_ON -->",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/n4jysg/best_dd_ever_my_mom_rates_the_top_10_crypto_by/",
  "subreddit": "CryptoCurrency",
  "id": "n4jysg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964321
}