{
  "author": "LucidInsight",
  "the_new_excerpt": "The reason $BANG failed (BB) (AMC) (NOK) (GMC) and other is because stock\nbrokerages halted the trading of those stocks when it was at it's peak causing a\nmyriad of issues and the prices dipping shortly after. People bought into the\ncraze of the stocks emotionally because of the whole David vs…",
  "original_created_utc": 1612528985,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "$BANG失败(BB)(AMC)(NOK)(GMC)等原因是由于股票\n经纪商停止交易这些股票时，它是在它的高峰期造成了一个\n无数的问题，价格不久后就会下挫。人们买进了\n疯狂的股票情绪，因为整个大卫与... ...",
      "title": "我相信这波股市的兴趣，从长远来看，可能会有很大的好处"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "$BANG失敗(BB)(AMC)(NOK)(GMC)等原因是由於股票\n經紀商停止交易這些股票時，它是在它的高峯期造成了一個\n無數的問題，價格不久後就會下挫。人們買進了\n瘋狂的股票情緒，因爲整個大衛與... ...",
      "title": "我相信這波股市的興趣，從長遠來看，可能會有很大的好處"
    }
  ],
  "title": "I believe this wave of stock market interest could be great in the long term",
  "created_utc": 1612539693,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The reason $BANG failed (BB) (AMC) (NOK) (GMC) and other is because stock brokerages halted the trading of those stocks when it was at it&#39;s peak causing a myriad of issues and the prices dipping shortly after. People bought into the craze of the stocks emotionally because of the whole David vs Goliath comparison and sticking it up to the Billionaires which I think is great but frankly they have much more experience and information than us when it comes to the Stock Market. They pay thousands of dollars to a service that now gathers data on which stocks get mentioned the most on <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>. <a href=\"https://edition.cnn.com/2021/02/03/investing/wall-street-reddit-hedge-funds/index.html\">See Here</a> And that&#39;s just one of the things they are willing to do now that they know what a collective can do. We can move markets.   </p>\n\n<blockquote>\n<p>Pick the brokerage with the strongest balance sheet. What ruined it on RH is that they didnt have enough cash to deal with the growth in accounts, margin loans and volatility. The EXACT SAME THING will happen at the next broker if you dont make sure they have a MULTI-TRILLION dollar balance sheet to be able to handle these kind of circumstances<br/>\n- Mark Cuban</p>\n</blockquote>\n\n<p>As Mark Cuban says the problem with stock brokerages is that they didn&#39;t have a strong enough balance sheet to handle all that stock craze. </p>\n\n<p>(<a href=\"https://www.reddit.com/r/stocks/comments/lbzkbi/reminder_whether_you_own_gme_or_not_change_your/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Which is why you should check in this post which one you&#39;re using and transfer to the good ones</a>)</p>\n\n<p>(<a href=\"https://www.reddit.com/r/stocks/comments/l7tc1x/would_like_to_take_my_business_elsewhere_since_rh/gl95htk\">See here how to transfer to Fidelity</a>)</p>\n\n<p>People right now are learning the ropes and mistakes made in what has happened which I believe now makes us stronger. We know better on how to stock market works and learned from our mistakes and lots of people due to this situation know better than before. So if something like this were to happen again it could significantly go better. This wave of newbies that can search and read up on resources about the stock market could be better in the long term. They can do their own Due Diligence and not trust random posts anymore. They are now more financially literate and can research on which companies to invest in and which not to and not put emotion when trading. They have learned lessons from this experience.</p>\n\n<p><a href=\"https://www.reuters.com/article/us-retail-trading/regulators-to-meet-as-brokers-call-time-on-reddit-trader-rollercoaster-idUSKBN2A30Q4\">US Treasury Yellen is to meet up with financial regulators</a> over what has happened and it is fairly certain that some changes could be happening. RH CEO to testify before the US House Committee and they even call for DFV to do so. What happens next and the resolution of those happening could be uncertain. It could make everything fair for the stock market or it could favor WallStreet even more than regular investors. We don&#39;t know. Right now all we can do is hope for the best outcome coming out after all of this blows over. As for people holding stock. Do whatever you want with it. Hold, Buy, Sell, whatever. I just want everyone to learn from what has happened so if you play with the stock market you can get out better.</p>\n</div><!-- SC_ON -->",
  "score": 588,
  "permalink": "/r/stocks/comments/ld6d73/i_believe_this_wave_of_stock_market_interest/",
  "subreddit": "stocks",
  "id": "ld6d73",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123201967
}