{
  "author": "salsawood",
  "the_new_excerpt": "Posting again because last one got removed for some bullshit about a ticker name\nI wasn’t even referring to.\n\nListen up retards: it is mathematically impossible for shorts to be covered by\nnow. If it was possible to cover like that do you think short squeezes would\nEVER happen?\n\nIt’s simple. Let’s…",
  "original_created_utc": 1612514233,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "再次发帖，因为上一次因为一些关于股票名称的废话而被删除了。\n我根本不是指。\n\n听好了弱智：从数学上讲，短裤是不可能由\n现在。如果可以这样覆盖你觉得短线压制会不会\n发生过吗？\n\n这很简单。让我们...",
      "title": "从数学上讲，GME短线被套是不可能的：简单赌徒的一些简单数学。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "再次發帖，因爲上一次因爲一些關於股票名稱的廢話而被刪除了。\n我根本不是指。\n\n聽好了弱智：從數學上講，短褲是不可能由\n現在。如果可以這樣覆蓋你覺得短線壓制會不會\n發生過嗎？\n\n這很簡單。讓我們...",
      "title": "從數學上講，GME短線被套是不可能的：簡單賭徒的一些簡單數學。"
    }
  ],
  "title": "It is mathematically impossible that GME shorts were covered: some simple math for simple gamblers",
  "created_utc": 1612535311,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Posting again because last one got removed for some bullshit about a ticker name I wasn’t even referring to. </p>\n\n<p>Listen up retards: it is mathematically impossible for shorts to be covered by now. If it was possible to cover like that do you think short squeezes would EVER happen? </p>\n\n<p>It’s simple. Let’s use the worst possible numbers here. </p>\n\n<p>Jan 15 226% of the 51 million floating shares were shorted. 51 million x 2.26 = 115.26 million shares. Let’s say they shorted the shares at $5. They borrowed at least 576 million dollars worth of stock to do that. Over half a billion just to set up this short. </p>\n\n<p>Now people are saying they covered by shorting at 300, 400, 500. Ok, let’s say they covered at 300. You’re telling me Melvin was able to come up with 300 x 115.26 = 34.5 billion dollars loan to cover their massive fuck up? Even if they covered HALF the shorts at 100 per share we’re still talking about 5.75 BILLION US DOLLARS JUST TO COVER THEIR ORIGINAL FUCK UP and they would’ve had to fabricate THREE TIMES as many FAKE shares as they did in the first place. Remember 226% short over float? It would have to be 452% now to cover. </p>\n\n<p>Hold your fucking shares.</p>\n\n<p>Edit: I am not a financial advisor and this post does not constitute financial advice. I used my cell phone calculator to do this math.</p>\n\n<p>Edit 2: I know I shouldn’t be surprised you retards don’t understand simple math but let me try to explain this to you: if I short a stock at $5 and it goes to $100, I owe $95 to the lender. If I short again at $100 and it drops to $5, I made $95. My net gain is a big fat fucking <strong>ZERO</strong>. If I short again at $100 and it goes to $50 my net is 50-95= <em>-$45</em> Not to mention the interest rate on that short position, which if I’m getting for less than inflation means the lender is paying me to borrow money. </p>\n\n<p>Please get your head out of your ass. <strong>if it were possible to cover a short squeeze then a short squeeze would never ever happen. The reason short squeezes happen is BECAUSE THEY CANT COVER.</strong></p>\n</div><!-- SC_ON -->",
  "score": 15129,
  "permalink": "/r/wallstreetbets/comments/ld2zlq/it_is_mathematically_impossible_that_gme_shorts/",
  "subreddit": "wallstreetbets",
  "id": "ld2zlq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123211353
}