{
  "author": "partymsl",
  "original_created_utc": 1646582321,
  "title": "Such bear markets as now are usually a lot of pain but the transition to bull market afterwards makes it all worth it. So stick in there.",
  "created_utc": 1646642287,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Crypto has been in the red for like five months now. That&amp;#39;s a lot of time we suffered here, a lot more than during the May crash. As this was a slow burn bear market steadily dropping like 10% each. That&amp;#39;s usually more pain than a 30% drop at once. &lt;/p&gt;\n\n&lt;p&gt;But we gotta stick in there get through all those loops to see the amazing view afterwards and just be able to say &amp;quot;yeah I was there one day&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t know about you guys but I personally did not check my portfolio since November. Also my chart watching has drastically reduced. But now slowly getting back. The pain is there when crypto drops like 10%, then jumps 5% to put in hope but then drops 10% again.&lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t be afraid of that. Think of the day you will be there in the major bull market and tell all those newbies that you went through all that stuff.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/t81p9a/such_bear_markets_as_now_are_usually_a_lot_of/",
  "subreddit": "CryptoCurrency",
  "id": "t81p9a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Crypto has been in the red for like five months now. That's a lot of time we\nsuffered here, a lot more than during the May crash. As this was a slow burn\nbear market steadily dropping like 10% each. That's usually more pain than a 30%\ndrop at once.\n\nBut we gotta stick in there get through all those…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cryptoはもう5ヶ月くらい赤字が続いています。これは私たちが\n5月の暴落の時よりもずっと苦しんでいます。これはスローバーンであったため\n10％ずつ着実に下がっていくベアマーケット。それは通常、30％の下落よりも苦痛です。\n一挙に下がった。\n\nしかし、我々はそこに固執し、すべてのものを介して取得する必要があります...",
      "title": "今のような弱気相場は、通常、多くの痛みを伴いますが、その後の強気相場への移行が、そのすべてを価値あるものにしてくれます。だから、頑張れ。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "隐性货币已经连续五个月处于亏损状态了。这是一个很长的时间，我们\n我们在这里遭受了很多，比5月的崩溃期间要多得多。因为这是一个缓慢燃烧的\n熊市稳步下跌，每个人都有10%的跌幅。这通常比一次性下跌30%更痛苦\n一次性下跌。\n\n但我们必须坚持下去，通过所有这些...",
      "title": "像现在这样的熊市通常会有很多痛苦，但之后向牛市的过渡使这一切都值得。所以要坚持下去。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隱性貨幣已經連續五個月處於虧損狀態了。這是一個很長的時間，我們\n我們在這裏遭受了很多，比5月的崩潰期間要多得多。因爲這是一個緩慢燃燒的\n熊市穩步下跌，每個人都有10%的跌幅。這通常比一次性下跌30%更痛苦\n一次性下跌。\n\n但我們必須堅持下去，通過所有這些...",
      "title": "像現在這樣的熊市通常會有很多痛苦，但之後向牛市的過渡使這一切都值得。所以要堅持下去。"
    }
  ]
}