{
  "author": "puddlesofmustard",
  "original_created_utc": 1636831245,
  "title": "I own every coin on coinbase and keep them within 10% of each other.",
  "created_utc": 1636839051,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been doing this for about 9 weeks and I am pleased with the results. </p>\n\n<p>I am not telling anyone else they should do this, I would just like to discuss my experience doing so. </p>\n\n<p>Basically what I did was convert all of my funds to equal amounts of every coin available on coinbase. At that time it equated to $300 per coin plus a little extra in DAI and algorand. In that time coinbase decided to really rile things up and add 8 coins last week. I&#39;m not going to lie, that messed up my ecosystem I spent 2 months building. It was the last 4 coins in a single day that really messed with my mojo. </p>\n\n<p>But..... I&#39;m still way up. I have all 8 new coins from last week and I think 2 others in the last 2 months and all coins are above $400.  </p>\n\n<p>I started this Sept 10th as the entire market was crashing, but I noticed very quickly that even though all my coins were down, they were down a significant percentage less than the actual coin in that time. So even though I was down because the entire market was down, I was down a lot less than if I just held everything. </p>\n\n<p>I&#39;ve watched the volatility of some of these coins for some time, and theorized that you can make money by capitalizing on how much and how fast they move. I started by testing the waters and only converting $10 of each coin, and after a few weeks decided to go all in after seeing the results. </p>\n\n<p>There is a lot that goes into my logic on this strategy but the basics are, once the coin at the top is over 10% of the coin on the bottom, I convert 3% and feed the bottom coin up. Coinbase charges a 1% conversion fee, which I am fine with since I am trading at plus 10%. </p>\n\n<p>Some coins go absolutely crazy out of nowhere. If that happens, if I end up using the same coin more than twice, I&#39;ll begin taking that 3% and converting it to DAI, a stable coin worth a dollar that earns 2% interest. And a lot of times when a coin shoots up like that it comes crashing back down, do I&#39;ll use that DAI to scoop that coin back up at a lot cheaper than I sold it. If it doesnt come crashing back down then I&#39;ll feed a few more bottom coins with that money</p>\n\n<p>I&#39;ve posted what I&#39;ve been doing a few places and for some reason what I am doing seems to genuinely anger people, and I&#39;m not sure why. I&#39;m not telling anyone to do this, I just want to discuss how this is going for me. I also understand how taxes work and am ok with that. </p>\n\n<p>Like I said, my approach is a little complicated so if anyone has any questions I&#39;ll stick around for a few hours.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/CryptoCurrency/comments/qt84nn/i_own_every_coin_on_coinbase_and_keep_them_within/",
  "subreddit": "CryptoCurrency",
  "id": "qt84nn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been doing this for about 9 weeks and I am pleased with the results.\n\nI am not telling anyone else they should do this, I would just like to discuss\nmy experience doing so.\n\nBasically what I did was convert all of my funds to equal amounts of every coin\navailable on coinbase. At that time it…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は約9週間これを続けており、その結果に満足しています。\n\n私は誰かにこれをすべきだと言っているわけではありません。\n私の経験をお話したいと思います。\n\n基本的に私がしたことは、すべての資金をcoinbaseで購入できるすべてのコインに等しく変換することでした。\nコインベースで購入できるすべてのコインを同額にしました。その時は...",
      "title": "私はcoinbase上のすべてのコインを所有しており、それらを互いに10％以内に保っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我已经这样做了大约9周，我对结果感到满意。\n\n我不是在告诉其他人应该这样做，我只是想讨论一下我这样做的经验。\n我这样做的经验。\n\n基本上，我所做的是将我所有的资金转换成等量的每一种硬币\n币基上可用的每一种硬币。当时，它...",
      "title": "我拥有coinbase上的每一个硬币，并将它们保持在10%以内。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經這樣做了大約9周，我對結果感到滿意。\n\n我不是在告訴其他人應該這樣做，我只是想討論一下我這樣做的經驗。\n我這樣做的經驗。\n\n基本上，我所做的是將我所有的資金轉換成等量的每一種硬幣\n幣基上可用的每一種硬幣。當時，它...",
      "title": "我擁有coinbase上的每一個硬幣，並將它們保持在10%以內。"
    }
  ]
}