{
  "author": "NullDonut",
  "the_new_excerpt": "I'm happy to say that I've finally managed to turn a profit on every single\ninvestment I made back during the last run, when I FOMO'd in at the height of\neverything right before the big crash in early January the following year.\n\nAt the time I was new to crypto, but not new to investing in general,…",
  "original_created_utc": 1618656823,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "嬉しいことに、前作での投資はすべて利益を出すことができました。\n翌年1月初旬の大暴落の前に、絶好調の時にFOMOで参加した時に行った投資が、ついに全て利益になりました。\n翌年1月初旬の大暴落の直前にFOMOで参加したときのものです。\n\n当時、私は暗号化については初心者でしたが、投資全般については初心者ではありませんでした。",
      "title": "2017年に行ったすべての投資で、公式に緑を取り戻した。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很高兴地告诉大家，我终于成功地在每一个项目上实现了盈利。\n我的投资，早在上一次运行， 当我FOMO'd在高度的\n在次年1月初的大崩盘之前，一切都很正常。\n\n当时我对加密技术很陌生，但对一般的投资并不陌生，...",
      "title": "2017年，我的每一笔投资都正式回到了绿色的轨道上。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很高興地告訴大家，我終於成功地在每一個項目上實現了盈利。\n我的投資，早在上一次運行， 當我FOMO'd在高度的\n在次年1月初的大崩盤之前，一切都很正常。\n\n當時我對加密技術很陌生，但對一般的投資並不陌生，...",
      "title": "2017年，我的每一筆投資都正式回到了綠色的軌道上。"
    }
  ],
  "title": "Officially back in the green on every investment I made in 2017",
  "created_utc": 1618706936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m happy to say that I&#39;ve finally managed to turn a profit on every single investment I made back during the last run, when I FOMO&#39;d in at the height of everything right before the big crash in early January the following year. </p>\n\n<p>At the time I was new to crypto, but not new to investing in general, so fortunately I knew not to sell those XRP and IOTA bags (still holding one of them, guess which one). With the recent runups on both coins I&#39;ve made a healthy profit, cashed out one of them and switched over to something I actually believe in long term. </p>\n\n<p>I don&#39;t mean to sound like I&#39;m gloating or anything, just thought you guys would appreciate it. And for me this reaffirms that hodling is the way. We all know the bear is coming eventually, but if you don&#39;t sell, you don&#39;t lose.</p>\n\n<p>(unless it&#39;s like bitconnect or something)</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/msom10/officially_back_in_the_green_on_every_investment/",
  "subreddit": "CryptoCurrency",
  "id": "msom10",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171519541
}