{
  "author": "tfproblem",
  "original_created_utc": 1626752616,
  "title": "After I posted about 8 Out of 10 Cryptos promoted on r/CryptoMoonShots Crashed by more than 80%, I got a PM asking me to delete the Post and one from a 80% Crashed Crypto Developer",
  "created_utc": 1626763727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday I posted about how 8 out of 10 cryptos promoted on <a href=\"/r/CryptoMoonShots\">r/CryptoMoonShots</a> in the past 20 or more days crashed by more than 80%. After I posted this a dev of a mentioned token sent me a PM asking me to edit my post and point out that their 90% crashed token would actually not be a scam, they at least admitted that they did some &quot;mistakes&quot;.</p>\n\n<p>Another PM just said &quot;delete the post&quot; and thats it.</p>\n\n<p>The <a href=\"/r/CryptoMoonShots\">r/CryptoMoonShots</a> Subreddit is only moderated by one kinda inactive person. Every post there gets upvote botted and awards bought by the people behind the crypto. Avoid the Subreddit, it is just shady scams.</p>\n</div><!-- SC_ON -->",
  "score": 221,
  "permalink": "/r/CryptoCurrency/comments/onu6vu/after_i_posted_about_8_out_of_10_cryptos_promoted/",
  "subreddit": "CryptoCurrency",
  "id": "onu6vu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday I posted about how 8 out of 10 cryptos promoted on r/CryptoMoonShots\n[/r/CryptoMoonShots] in the past 20 or more days crashed by more than 80%. After\nI posted this a dev of a mentioned token sent me a PM asking me to edit my post\nand point out that their 90% crashed token would actually…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、私はr/CryptoMoonShotsで宣伝されている10個の暗号のうち、8個が\n[で宣伝された暗号の10個のうち8個が80％以上も暴落したことを紹介しました。その後\n私がこの記事を投稿した後、あるトークンの開発者が私にPMを送り、私の投稿を編集して、彼らの90％がクラッシュしたことを指摘するように頼んできた。\nそして、その90％クラッシュしたトークンが実際には...",
      "title": "r/CryptoMoonShotsで宣伝されている暗号のうち8つが80%以上クラッシュしていることを投稿した後、投稿を削除するよう求めるPMと80%クラッシュした暗号開発者からのPMを受け取りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天我发布了关于在r/CryptoMoonShots上推广的10个加密货币中的8个\n[/r/CryptoMoonShots]在过去20天或更长时间内崩溃了80%以上。在\n我发了这个帖子后，一个被提及的代币的开发者给我发了一个PM，要求我编辑我的帖子\n并指出他们90%崩溃的代币实际上会...",
      "title": "在我发布了关于在r/CryptoMoonShots上推广的10个加密货币中有8个崩溃了80%以上的帖子后，我收到了一个要求我删除帖子的PM，还有一个来自80%崩溃的加密货币开发者的PM。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天我發佈了關於在r/CryptoMoonShots上推廣的10個加密貨幣中的8個\n[/r/CryptoMoonShots]在過去20天或更長時間內崩潰了80%以上。在\n我發了這個帖子後，一個被提及的代幣的開發者給我發了一個PM，要求我編輯我的帖子\n並指出他們90%崩潰的代幣實際上會...",
      "title": "在我發佈了關於在r/CryptoMoonShots上推廣的10個加密貨幣中有8個崩潰了80%以上的帖子後，我收到了一個要求我刪除帖子的PM，還有一個來自80%崩潰的加密貨幣開發者的PM。"
    }
  ]
}