{
  "author": "vilnitskiy",
  "the_new_excerpt": "To begin with, let me tell you a few words about myself: I’ve been working in\nthe field of web scraping and data delivery over the past 5 years. Lately, I've\nbeen exploring new niches and businesses that can be sped up and boosted up with\nweb scraping and data processing, and I came across a huge…",
  "original_created_utc": 1612646479,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，让我来介绍一下我自己。我一直从事的是\n在过去的5年里，在网络搜刮和数据传输领域。最近，我已经\n一直在探索新的利基市场和业务，可以加快和促进与。\n网络搜刮和数据处理，我遇到了一个巨大的... ...",
      "title": "我花了100多个小时沉浸在另类数据市场中。以下是关于对冲基金如何利用另类数据赚钱的一个小结。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，讓我來介紹一下我自己。我一直從事的是\n在過去的5年裏，在網絡搜刮和數據傳輸領域。最近，我已經\n一直在探索新的利基市場和業務，可以加快和促進與。\n網絡搜刮和數據處理，我遇到了一個巨大的... ...",
      "title": "我花了100多個小時沉浸在另類數據市場中。以下是關於對沖基金如何利用另類數據賺錢的一個小結。"
    }
  ],
  "title": "I spent more than 100 hours immersing myself in the alternative data market. Here's a short summary of how hedge funds make money using alternative data.",
  "created_utc": 1612650950,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>To begin with, let me tell you a few words about myself: I’ve been working in the field of web scraping and data delivery over the past 5 years. Lately, I&#39;ve been exploring new niches and businesses that can be sped up and boosted up with web scraping and data processing, and I came across a huge market of alternative data. I&#39;ve spent many hours researching it and here I&#39;d like to share with you a short summary on the current status of this market, also we will try to answer the question of whether the alternative data can increase the return on investments. I published this post earlier on another subreddit and now I want to share it here.</p>\n\n<p>Let&#39;s first understand the terms. The <em>traditional data</em> that traders use is the company&#39;s financial statements, various financial historical data, etc. <em>Alternative data</em> is everything that&#39;s indirectly related to a company but is not a direct indicator of its financial values and performance. This concept includes the widest range of metrics - for example, the number of company employees, the number of followers on social networks, website traffic, number of discount products, geolocation data, supply chain data, etc.</p>\n\n<p>All these indicators don’t directly correlate with the company&#39;s value on the stock exchange. However, these are all useful signals (some of the earliest of the entire spectrum of information about the company), which can be used to determine the company&#39;s dynamics in plus or minus.</p>\n\n<p><strong>There’s a wide range of alternative data sources:</strong></p>\n\n<ol>\n<li>What is collected using web scraping tools - website traffic, subscribers in social networks, the number of discount products, data on the location of stores - all the company&#39;s activity on the Internet;</li>\n<li>What is generated with the help of sensors - images of warehouses from satellites, weather data for logistics, geolocation data;</li>\n<li>What the business generates by itself - bank records, tax data, corporate documentation.</li>\n</ol>\n\n<p><strong>Top hedge funds have spent about $1.7 billion buying alternative data in 2020.</strong></p>\n\n<p>For comparison, $0.25 billion was spent on alternative data in 2016.</p>\n\n<p>According to alternativedata.org, this market is growing +50% every year, and COVID-19 has only increased its growth.</p>\n\n<p><strong>The average price for a dataset with alternative data is in the range from $10K to $20K, which makes the entry threshold incredibly high for average traders.</strong></p>\n\n<p>Now alternative data is the prerogative of top funds, which can afford to spend several million a year experimenting with data.</p>\n\n<p>However, the situation has already begun to change: less expensive tools are emerging (such as thinknum) that allow access to data at a significantly lower price, but these tools are still more funds-oriented than for single traders.</p>\n\n<p>Now we can state unequivocally that there is a tendency towards the democratization of alternative data and a reduction in its cost.</p>\n\n<p><strong>A few examples of how the investors use alternative data</strong></p>\n\n<p>One of the funds began tracking corporate jets of portfolio companies to predict M&amp;A deals. For example, Cisco executives have flown several times to Carlsbad, California, where Luxora is headquartered. A few months later, Cisco acquired Luxora. The jettrack.io service also works based on this.</p>\n\n<p>The second example is more urgent. We all know how COVID-19 has impacted financial markets. Hedge funds have adapted to the situation and started tracking metrics related to the pandemic to understand the recovery level in the markets. Metrics such as morbidity and mortality in many countries help to predict the possibility of a lockdown and the further consequences for local markets.</p>\n\n<p>The above examples are massive datasets that require many human and technical resources for analysis, that&#39;s why they are in demand by whales and practically out of use by average traders.</p>\n\n<p>However, let me reaffirm, <strong>it seems to me that there are tendencies towards the democratization of alternative data</strong>. There are a number of simple signals that will help you understand the dynamics of a company before official announcements and financial statements. Some examples of such signals: <em>“website&#39;s traffic has dropped 28% over the past month”</em>, <em>“DoorDash added 640 new restaurants to its chain within the last week”</em> etc. These are all simple examples that show how alternative data can be useful to everyone, not just the huge players of the financial markets.</p>\n\n<p>I&#39;d be grateful for your feedback and opinion on alternative data. Do you see the potential in using them, or do you consider it a waste of time?</p>\n\n<p>[Some useful links]:</p>\n\n<ul>\n<li><a href=\"https://www.ft.com/content/8d194207-f6bf-4dde-b0fe-93cb85dfb8a0\">https://www.ft.com/content/8d194207-f6bf-4dde-b0fe-93cb85dfb8a0</a> - general article on how hedge funds use alternative data with interesting discussion in the comments;</li>\n<li><a href=\"https://www.bloomberg.com/news/articles/2020-11-12/how-hedge-funds-seek-covid-clues-in-alternative-data-quicktake\">https://www.bloomberg.com/news/articles/2020-11-12/how-hedge-funds-seek-covid-clues-in-alternative-data-quicktake</a> - article on how the demand for alternative data has increased during COVID-19;</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 567,
  "permalink": "/r/investing/comments/le75ba/i_spent_more_than_100_hours_immersing_myself_in/",
  "subreddit": "investing",
  "id": "le75ba",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199858
}