{
  "author": "CarbonatedInsidious",
  "the_new_excerpt": "You might’ve seen several posts explaining why keeping your coins in a wallet is\nthe best way to hodl. This is true, if you have a significant amounts of a\nparticular coin because then you will be able to cover the expenses of transfer\nfees which vary from coin to coin.\n\nBut with the rise of…",
  "original_created_utc": 1614832265,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "你可能已经看到了几篇文章，解释了为什么把硬币放在钱包中是\n最好的方式霍德尔。这是真的，如果你有大量的a\n币，因为这样您就可以支付转让的费用。\n费，而这些费用因币而异。\n\n但随着兴...",
      "title": "对于所有的小荷包们来说，把钱币放在交易所可能是最好的选择了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你可能已經看到了幾篇文章，解釋了爲什麼把硬幣放在錢包中是\n最好的方式霍德爾。這是真的，如果你有大量的a\n幣，因爲這樣您就可以支付轉讓的費用。\n費，而這些費用因幣而異。\n\n但隨着興...",
      "title": "對於所有的小荷包們來說，把錢幣放在交易所可能是最好的選擇了"
    }
  ],
  "title": "To all the small hodlers, keeping your coins at an exchange might be the best thing for you",
  "created_utc": 1614839427,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You might’ve seen several posts explaining why keeping your coins in a wallet is the best way to hodl. This is true, if you have a significant amounts of a particular coin because then you will be able to cover the expenses of transfer fees which vary from coin to coin.</p>\n\n<p>But with the rise of newcomers, not everyone can afford to buy large numbers of coins. And while you might be tempted to take your coins off an exchange, think about the amount you will spend for fees. For example the average fees for moving out ETH is 0.02 ETH (~$35) sometimes this is the amount most people have. Similar example can be applied to other coins as well. </p>\n\n<p>Another point is that exchanges are not un-secure anymore. They will store coins with high security measures. And you should enable things like 2FA to keep your account even more secure. So don’t worry about your coins being in danger.</p>\n\n<p>If someone has any other suggestions please let us know.</p>\n</div><!-- SC_ON -->",
  "score": 5440,
  "permalink": "/r/CryptoCurrency/comments/lxcmup/to_all_the_small_hodlers_keeping_your_coins_at_an/",
  "subreddit": "CryptoCurrency",
  "id": "lxcmup",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739403
}