{
  "author": "Tajo990",
  "original_created_utc": 1638105240,
  "title": "\"I bought the dip\" is the new I'm vegan / a DJ / I do crossfit",
  "created_utc": 1638124738,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We all know the age old joke, how do you know that someone is vegan? - They will tell you about it. How do you know that someone bought the dip? They will make a reddit post about it.</p>\n\n<p>Playing on the &quot;If a tree falls in a forest and no one is around to hear it, does it make a sound?&quot; saying, we can also ask ourselves &quot;If you buy the dip, but don&#39;t tell anyone about it, did you really buy the dip?&quot;</p>\n\n<p>If you really have to say that you bought the dip, whether for confirmation bias purposes or whatever, I may suggest a couple better options depending on your personality:</p>\n\n<p>- those that want to become acolytes of the cult of the Blood God - I just drank some blood of the recently deflowered virgin investors</p>\n\n<p>- those that want to sound economically knowledgeable - I have just helped to reverse the bearish pattern</p>\n\n<p>- those with alcohol problems - I just took some Bloody Mary shots</p>\n\n<p>- literary fucks - I have attained the life of glamour by pure serendipity. </p>\n\n<p>- gym rats - I just did 40 dips, now it&#39;s time for some pull ups. </p>\n\n<p>- CS GO enthusiasts - Rush D suka blyat</p>\n\n<p>I&#39;m sure some of you will make some better suggestion.</p>\n\n<p>Conclusion: If you have to say that you bought the dip, at least be creative</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/r4421w/i_bought_the_dip_is_the_new_im_vegan_a_dj_i_do/",
  "subreddit": "CryptoCurrency",
  "id": "r4421w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We all know the age old joke, how do you know that someone is vegan? - They will\ntell you about it. How do you know that someone bought the dip? They will make a\nreddit post about it.\n\nPlaying on the \"If a tree falls in a forest and no one is around to hear it,\ndoes it make a sound?\" saying, we can…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昔からあるジョークですが、ある人がビーガンだとどうやってわかるのでしょうか？- 彼らはあなたに\n語ってくれます。誰かがディップを買ったことをどうやって知ることができますか？その人はredditに\nredditに投稿します。\n\n森の中で木が倒れても、周りにそれを聞く人がいなければ、それは音を立てますか？\ndo it make a sound? \"を使って、次のようなことができます。",
      "title": "\"I bought the dip\" is the new I'm vegan / a DJ / I do crossfit"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都知道一个古老的笑话，你怎么知道一个人是素食主义者？- 他们会\n告诉你的。你怎么知道有人买了蘸酱？他们会发一个\n他们会在reddit上发表关于它的帖子。\n\n在 \"如果一棵树在森林中倒下，而周围没有人听到它。\n它是否会发出声音？\"的说法，我们可以...",
      "title": "\"我买了蘸酱 \"是新的我是素食者/DJ/我做交叉运动"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都知道一個古老的笑話，你怎麼知道一個人是素食主義者？- 他們會\n告訴你的。你怎麼知道有人買了蘸醬？他們會發一個\n他們會在reddit上發表關於它的帖子。\n\n在 \"如果一棵樹在森林中倒下，而周圍沒有人聽到它。\n它是否會發出聲音？\"的說法，我們可以...",
      "title": "\"我買了蘸醬 \"是新的我是素食者/DJ/我做交叉運動"
    }
  ]
}