{
  "author": "BradlyL",
  "the_new_excerpt": "According to Ben Mezrich’s biographical novel “Bitcoin Millionaires”, which\nchronicles the Winklevoss twins story...\n\nThe twins split their private key into 3 shards - referred to as “alpha”,\n“beta”, and “Charlie”. Which were then stored in fireproof / waterproof\nenvelopes, and stashed in unassuming…",
  "original_created_utc": 1615673480,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "根据本-梅兹里奇的传记小说《比特币百万富翁》，其中的\n记载了温克艾沃斯双胞胎的故事... ...\n\n双胞胎把他们的私钥分成了3个碎片--被称为 \"阿尔法\"。\n\"贝塔 \"和 \"查理\"。然后被存放在防火/防水的\n信封，并藏在不起眼的... ...",
      "title": "TIL--Winklevoss的私钥存储在3个 \"碎片 \"上，这些碎片分布在12个保险箱中，分布在美国4个时区的银行机构中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據本-梅茲裏奇的傳記小說《比特幣百萬富翁》，其中的\n記載了溫克艾沃斯雙胞胎的故事... ...\n\n雙胞胎把他們的私鑰分成了3個碎片--被稱爲 \"阿爾法\"。\n\"貝塔 \"和 \"查理\"。然後被存放在防火/防水的\n信封，並藏在不起眼的... ...",
      "title": "TIL--Winklevoss的私鑰存儲在3個 \"碎片 \"上，這些碎片分佈在12個保險箱中，分佈在美國4個時區的銀行機構中。"
    }
  ],
  "title": "TIL- The Winklevoss private keys are stored on 3 “shards”, which are spread across 12 safety deposits boxes, located in banking institutions that span 4 time zones in the US...",
  "created_utc": 1615696915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>According to Ben Mezrich’s biographical novel “Bitcoin Millionaires”, which chronicles the Winklevoss twins story...</p>\n\n<p>The twins split their private key into 3 shards - referred to as “alpha”, “beta”, and “Charlie”. Which were then stored in fireproof / waterproof envelopes, and stashed in unassuming banks. </p>\n\n<p>To ensure that a natural disaster does not wipe-out one/more of the ‘shards’, they duplicated the process 4 times, in 4 separate time zones for redundancy.</p>\n\n<p>To all you hodl’ers, take lesson from 2 of the richest BTC investors in the world. <em>PROTECT YOUR KEYS!</em></p>\n</div><!-- SC_ON -->",
  "score": 493,
  "permalink": "/r/CryptoCurrency/comments/m4gruo/til_the_winklevoss_private_keys_are_stored_on_3/",
  "subreddit": "CryptoCurrency",
  "id": "m4gruo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147377073
}