{
  "author": "N1gHtMaRe99",
  "original_created_utc": 1654855457,
  "title": "is it true that other inmates kill pedophiles if they are found out?",
  "created_utc": 1654867446,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve seen some stories on here that say pedos are killed in prison and even the security doesn&amp;#39;t interfere, is it true?&lt;/p&gt;\n\n&lt;p&gt;If it is then yeah we should send all of them to prison and just let people who have nothing to lose do the work. Cuz they the government doesn&amp;#39;t give death sentences to them and they might do this stuff again after they serve their time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/v94dfs/is_it_true_that_other_inmates_kill_pedophiles_if/",
  "subreddit": "TooAfraidToAsk",
  "id": "v94dfs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "I've seen some stories on here that say pedos are killed in prison and even the\nsecurity doesn't interfere, is it true?\n\nIf it is then yeah we should send all of them to prison and just let people who\nhave nothing to lose do the work. Cuz they the government doesn't give death\nsentences to them and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ペドは刑務所で殺され、警備員さえも邪魔をしないと言う話をここで見たことがありますが、本当ですか？\nセキュリティも介入しないという話を聞いたことがありますが、本当ですか？\n\nもしそうなら、彼らを全員刑務所に送って、何も失わない人たちに仕事をさせるべきですね。\nにやらせればいい。政府は死刑を宣告しないんだから。\n死刑を宣告しないし...",
      "title": "小児性愛者が見つかると、他の受刑者が殺してしまうというのは本当なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这里看到一些故事，说恋童癖者在监狱里被杀，甚至保安也不干涉。\n保安也不干涉，这是真的吗？\n\n如果是这样的话，我们应该把他们都送进监狱，让那些没有什么损失的人去做。\n没有什么损失的人去做这个工作。因为他们政府不会给他们死刑\n判决给他们，而且...",
      "title": "如果其他囚犯被发现，他们会杀死恋童癖者，这是真的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這裏看到一些故事，說戀童癖者在監獄裏被殺，甚至保安也不干涉。\n保安也不干涉，這是真的嗎？\n\n如果是這樣的話，我們應該把他們都送進監獄，讓那些沒有什麼損失的人去做。\n沒有什麼損失的人去做這個工作。因爲他們政府不會給他們死刑\n判決給他們，而且...",
      "title": "如果其他囚犯被發現，他們會殺死戀童癖者，這是真的嗎？"
    }
  ]
}