{
  "author": "aegeaorgnqergerh",
  "the_new_excerpt": "I mean, obviously aside from the fact \"they're stupid af\" but logically, if\nneo-Nazis love the Nazis so much, why would they go to so much effort to try and\n\"prove\" the Holocaust never happened? Surely if they love and worship what the\nNazis did, they should be supporting their \"achievement\" and if…",
  "original_created_utc": 1623848995,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、明らかに「彼らはバカだ」という事実はさておき、論理的には、もしネオナチがナチスをそれほど愛しているならば\nネオナチはナチスを愛しているのに、なぜそこまでして\n\"ホロコーストが起こらなかったことを「証明」しようとするのか？確かに、ナチスを愛し、崇拝しているのであれば\n彼らがナチスを愛し、崇拝しているのであれば、その「功績」を支持すべきであり、もし...",
      "title": "なぜネオナチはホロコーストを否定することが多いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的意思是，很明显，除了 \"他们很愚蠢 \"这一事实之外，从逻辑上讲，如果新纳粹分子如此热爱纳粹，他们为什么要花这么大的力气去尝试。\n如果新纳粹分子如此热爱纳粹，他们为什么要花这么大力气去尝试和\n\"证明 \"大屠杀从未发生过？当然，如果他们热爱并崇拜纳粹的所作所为，他们应该支持纳粹。\n他们就应该支持他们的 \"成就\"，如果...",
      "title": "为什么新纳粹分子经常否认大屠杀？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的意思是，很明顯，除了 \"他們很愚蠢 \"這一事實之外，從邏輯上講，如果新納粹分子如此熱愛納粹，他們爲什麼要花這麼大的力氣去嘗試。\n如果新納粹分子如此熱愛納粹，他們爲什麼要花這麼大力氣去嘗試和\n\"證明 \"大屠殺從未發生過？當然，如果他們熱愛並崇拜納粹的所作所爲，他們應該支持納粹。\n他們就應該支持他們的 \"成就\"，如果...",
      "title": "爲什麼新納粹分子經常否認大屠殺？"
    }
  ],
  "title": "Why do neo-Nazis so often deny the Holocaust?",
  "created_utc": 1623858071,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I mean, obviously aside from the fact &quot;they&#39;re stupid af&quot; but logically, if neo-Nazis love the Nazis so much, why would they go to so much effort to try and &quot;prove&quot; the Holocaust never happened? Surely if they love and worship what the Nazis did, they should be supporting their &quot;achievement&quot; and if anything exaggerating the official figure, rather than arguing it isn&#39;t real?</p>\n\n<p>They basically saying &quot;these people we follow and look up to couldn&#39;t manage to do what everyone thinks they did. They were generally incompetent and we&#39;re going to let everyone know they actually just made it up to look more powerful&quot;. Isn&#39;t that counter-intuitive to their whole ideal?</p>\n</div><!-- SC_ON -->",
  "score": 472,
  "permalink": "/r/NoStupidQuestions/comments/o14hye/why_do_neonazis_so_often_deny_the_holocaust/",
  "subreddit": "NoStupidQuestions",
  "id": "o14hye",
  "is_self": true,
  "media": null,
  "is_video": false
}