{
  "author": "derstherower",
  "original_created_utc": 1626667418,
  "title": "During the Jersey Shore Shark Attacks of 1916, many scientists refused to blame sharks for the deaths. They suggested sea turtles, mackerel, or even German U-Boats were the cause of death. Shark attacks are rare, but hardly unheard of. What led to this belief that sharks just did not attack humans?",
  "created_utc": 1626705068,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Currently, there are on average over 30 shark attacks a year in the United States, with about one death every two years. These numbers were almost certainly lower over 100 years ago, but there&#39;s no way that there were <em>no</em> shark attacks in the years before 1916. Why was a shark attack thought of as an unlikely possibility?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/on6fxz/during_the_jersey_shore_shark_attacks_of_1916/",
  "subreddit": "AskHistorians",
  "id": "on6fxz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Currently, there are on average over 30 shark attacks a year in the United\nStates, with about one death every two years. These numbers were almost\ncertainly lower over 100 years ago, but there's no way that there were no shark\nattacks in the years before 1916. Why was a shark attack thought of as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現在、アメリカでは年間平均30件以上のサメ被害が発生しており\n米国では年間平均30件以上のサメ被害が発生しており、2年に1件の割合で死者が出ています。この数字は、100年以上前にはもっと少なかったはずです。\n100年以上前にはもっと少なかったはずですが、1916年以前にサメ被害がなかったということはありません。\n1916年以前にサメ被害がなかったはずはない。サメの攻撃がなぜ...と思われたのか？",
      "title": "1916年に発生したジャージーショアのサメ襲撃事件では、多くの科学者が死因をサメのせいにすることを拒みました。ウミガメやサバ、あるいはドイツのUボートが死因ではないかと考えたのである。サメの攻撃はまれですが、前代未聞というわけではありません。では、なぜサメは人間を襲わないと言われるようになったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "目前，在美国平均每年有超过30起鲨鱼袭击事件。\n美国平均每年有30多起鲨鱼袭击事件，大约每两年就有一人死亡。这些数字在100多年前几乎是\n在100多年前，这些数字肯定要低一些，但在1916年之前，不可能没有鲨鱼袭击。\n但在1916年之前的几年里不可能没有鲨鱼袭击。为什么鲨鱼袭击被认为是...",
      "title": "在1916年泽西海岸鲨鱼袭击事件中，许多科学家拒绝将死亡归咎于鲨鱼。他们建议海龟，鲭鱼，甚至德国U型潜艇是死亡的原因。鲨鱼袭击是罕见的，但几乎没有闻所未闻的。是什么导致了这种认为鲨鱼就是不攻击人类的信念？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "目前，在美國平均每年有超過30起鯊魚襲擊事件。\n美國平均每年有30多起鯊魚襲擊事件，大約每兩年就有一人死亡。這些數字在100多年前幾乎是\n在100多年前，這些數字肯定要低一些，但在1916年之前，不可能沒有鯊魚襲擊。\n但在1916年之前的幾年裏不可能沒有鯊魚襲擊。爲什麼鯊魚襲擊被認爲是...",
      "title": "在1916年澤西海岸鯊魚襲擊事件中，許多科學家拒絕將死亡歸咎於鯊魚。他們建議海龜，鯖魚，甚至德國U型潛艇是死亡的原因。鯊魚襲擊是罕見的，但幾乎沒有聞所未聞的。是什麼導致了這種認爲鯊魚就是不攻擊人類的信念？"
    }
  ]
}