{
  "author": "Aussiefarmgirl",
  "original_created_utc": 1650418801,
  "title": "What most likely happened to my Great Grandmother?",
  "created_utc": 1650431196,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If anyone would be able to shed some light to what most likely occurred, that would be amazing. My Czech grandfather remembers being sick in bed with the measles at 8yo in about 1941, possibly in Brno. His mother was dragged out of the house and disappeared for 2 years. He has absolutely no idea why. He says she was a loving affectionate mother but she was cold and generally a completely different person when she returned. His father had already &amp;#39;disappeared&amp;#39; only to return years later, not sure why either. His mother was German and his father Czech and I believe his father may have been the mayor of the town at the time. He rambles and mind all over the place so it&amp;#39;s hard to pin point exact details. Any ideas?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/u7l508/what_most_likely_happened_to_my_great_grandmother/",
  "subreddit": "AskHistorians",
  "id": "u7l508",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If anyone would be able to shed some light to what most likely occurred, that\nwould be amazing. My Czech grandfather remembers being sick in bed with the\nmeasles at 8yo in about 1941, possibly in Brno. His mother was dragged out of\nthe house and disappeared for 2 years. He has absolutely no idea…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし、どなたか、このようなことが起こった可能性が高いということを教えてくださる方がいらっしゃれば、幸いです。\nはすごいと思います。私のチェコ人の祖父は、病気で寝込んでいたのを覚えています。\n1941年頃、おそらくブルノで、8歳の時に麻疹にかかりました。彼の母親は引きずり出され\n2年間行方不明になった。彼は全く知らないのです...",
      "title": "曾祖母はどうなったのだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人能够说明最可能发生的情况，那就太好了。\n那就太好了。我的捷克祖父记得他在1941年8岁时因麻疹而病倒在床上，可能是在布尔诺。\n大约在1941年，8岁的时候出麻疹，可能是在布尔诺。他的母亲被拖出了\n他的母亲被拖出家门，消失了2年。他完全不知道...",
      "title": "我的曾祖母最可能发生了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人能夠說明最可能發生的情況，那就太好了。\n那就太好了。我的捷克祖父記得他在1941年8歲時因麻疹而病倒在牀上，可能是在布爾諾。\n大約在1941年，8歲的時候出麻疹，可能是在布爾諾。他的母親被拖出了\n他的母親被拖出家門，消失了2年。他完全不知道...",
      "title": "我的曾祖母最可能發生了什麼？"
    }
  ]
}