{
  "author": "Casiopea22",
  "original_created_utc": 1627271044,
  "title": "Early morning today I sold all my BTC, you can now thank me brothers.",
  "created_utc": 1627282181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I had a couple hundred bucks and I joined on this bullrun. I had an average entry price of around 42k but with the fall to 29k I managed to get it around 34k.</p>\n\n<p>Once I was at a tiny gain of like 0.2% I decided to sell.</p>\n\n<p>Crypto is awesome but this has been such a tough experience... I feel so scared everytime I get into an exchange and call me crazy but I always think I&#39;m one click away from missplacing all my portfolio or getting scammed. So I guess I went full coward and sold all my BTC as soon as I was officially out of loss. I must accept it kinda gave me some peace.</p>\n\n<p>Funny thing? I return home tonight and find out about BTC almost breaking 40k...</p>\n\n<p>I absolutely burst into laughter, I&#39;m not even mad. This is so ridiculous it was obviously going to happen to me and there we go...</p>\n\n<p>On the bright side I must say DCAing and this sub have taught me a lot! I think I will keep learning and hopefully get back into this when I feel more confident on what I&#39;m doing.</p>\n</div><!-- SC_ON -->",
  "score": 301,
  "permalink": "/r/CryptoCurrency/comments/orqq0j/early_morning_today_i_sold_all_my_btc_you_can_now/",
  "subreddit": "CryptoCurrency",
  "id": "orqq0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had a couple hundred bucks and I joined on this bullrun. I had an average\nentry price of around 42k but with the fall to 29k I managed to get it around\n34k.\n\nOnce I was at a tiny gain of like 0.2% I decided to sell.\n\nCrypto is awesome but this has been such a tough experience... I feel so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は数百ドルを持っていたので、このブルランに参加した。私は平均的なエントリー価格を\n約42kのエントリー価格でしたが、29kまで下落したので、なんとか34k前後になりました。\n34k.\n\n0.2%程度のわずかな利益しか得られなかったので、売ることにしました。\n\n暗号は素晴らしいですが、これはとても辛い経験でした...。私はとても...",
      "title": "今日の早朝、私はすべてのBTCを売りました、あなたは今、私の兄弟に感謝することができます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有几百块钱，我加入了这个牛市。我有一个平均\n我的平均价格在4.2万左右，但随着下跌到2.9万，我设法把它弄到3.4万左右。\n34k.\n\n一旦我达到了0.2%的微小收益，我就决定卖掉。\n\n加密货币是令人敬畏的，但这是一个艰难的经历...... 我觉得很...",
      "title": "今天清晨，我卖掉了我所有的BTC，你们现在可以感谢我的兄弟了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有幾百塊錢，我加入了這個牛市。我有一個平均\n我的平均價格在4.2萬左右，但隨着下跌到2.9萬，我設法把它弄到3.4萬左右。\n34k.\n\n一旦我達到了0.2%的微小收益，我就決定賣掉。\n\n加密貨幣是令人敬畏的，但這是一個艱難的經歷...... 我覺得很...",
      "title": "今天清晨，我賣掉了我所有的BTC，你們現在可以感謝我的兄弟了。"
    }
  ]
}