{
  "author": "DarshanSinghji1",
  "original_created_utc": 1651352224,
  "title": "Why am I expected to respect religions that says I will suffer eternally in hell if I don't believe in it?",
  "created_utc": 1651360945,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Just to be clear, I&amp;#39;m making a distinction between respect for a religion (an ideology, a belief system) and its adherents, the latter I acknowledge should not all be generalized and castigated simply for their religious beliefs. Some religions such as Christianity, Islam, Judaism say that if you don&amp;#39;t believe in their religion regardless of your moral character or deeds, you will be condemned to hellfire and suffer horrifically, some examples which are explicitly stated in the Quran for example where it states that the unbelievers will have their skin roasted off and then grown back and roasted again continuously. Why is it considered a condemnable action to criticize or make crude statements against these religions in mainstream society when it seems to me that these religions brought on these criticisms with their lack of respect of others?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/ufjwc6/why_am_i_expected_to_respect_religions_that_says/",
  "subreddit": "TooAfraidToAsk",
  "id": "ufjwc6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Just to be clear, I'm making a distinction between respect for a religion (an\nideology, a belief system) and its adherents, the latter I acknowledge should\nnot all be generalized and castigated simply for their religious beliefs. Some\nreligions such as Christianity, Islam, Judaism say that if you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はっきりさせておきたいのですが、私は、ある宗教に対する尊敬と、ある宗教のための\nイデオロギー、信念体系）に対する敬意と、その信奉者を区別しているのであって、後者は、私が認めるところでは、単に宗教的信念のために一般化され、非難されるべきではありません。\n後者は、単に宗教的信念のために一般化され、非難されるべきではないと認識しています。いくつかの\nキリスト教、イスラム教、ユダヤ教のような宗教では、もしあなたが...",
      "title": "なぜ、信じなければ地獄で永遠に苦しむという宗教を尊重しなければならないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "为了清楚起见，我是在区分对一个宗教（一种意识形态、一种信仰体系）的尊重和对其信徒的尊重。\n意识形态、信仰体系）和其追随者之间的区别，我承认后者不应\n不应该仅仅因为他们的宗教信仰就一概而论，对他们进行指责。一些\n宗教，如基督教、伊斯兰教、犹太教说，如果你...",
      "title": "为什么要我尊重那些说我不相信就会在地狱里永远受苦的宗教？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲了清楚起見，我是在區分對一個宗教（一種意識形態、一種信仰體系）的尊重和對其信徒的尊重。\n意識形態、信仰體系）和其追隨者之間的區別，我承認後者不應\n不應該僅僅因爲他們的宗教信仰就一概而論，對他們進行指責。一些\n宗教，如基督教、伊斯蘭教、猶太教說，如果你...",
      "title": "爲什麼要我尊重那些說我不相信就會在地獄裏永遠受苦的宗教？"
    }
  ]
}