{
  "author": "Ok_Manufacturer_2180",
  "the_new_excerpt": "If someone, say, won a lottery of two to three hundred million after taxes or\nsold a company for that much and decided to invest at least half of their\nearnings in diversified Vanguard ETFs, would that be a good idea? Three to five\nfunds would cover it. Wouldn't this be cheaper and more effective…",
  "original_created_utc": 1623762306,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "もし誰かが、税金を払って2〜3億円の宝くじを当てたり、それくらいの金額で会社を売ったりしたとしたら\nもし誰かが宝くじで税引き後2～3億円を当てたり、会社をそれくらいで売却して、その利益の半分以上を\nその利益の半分以上をバンガードのETFに分散投資するとしたら、それは良いアイデアでしょうか？3～5本の\nファンドでカバーできるでしょう。この方が安くて効果的だと思いませんか...。",
      "title": "超富裕層向けのボーグルヘッド？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果有人，比如说，在税后赢得了两到三亿的彩票，或者卖掉了一家公司，获得了这么多钱，并决定将至少一半的资金用于投资。\n税后两到三亿的彩票，或者卖掉一家公司获得这么多钱，并决定将至少一半的收入投资于多元化的先锋ETF。\n投资于多元化的Vanguard ETF，这是不是一个好主意？三到五只\n基金就可以了。这不是更便宜、更有效吗...",
      "title": "为超高净值人士提供的Bogleheads？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果有人，比如說，在稅後贏得了兩到三億的彩票，或者賣掉了一家公司，獲得了這麼多錢，並決定將至少一半的資金用於投資。\n稅後兩到三億的彩票，或者賣掉一家公司獲得這麼多錢，並決定將至少一半的收入投資於多元化的先鋒ETF。\n投資於多元化的Vanguard ETF，這是不是一個好主意？三到五隻\n基金就可以了。這不是更便宜、更有效嗎...",
      "title": "爲超高淨值人士提供的Bogleheads？"
    }
  ],
  "title": "Bogleheads for ultra-high-net-worth individuals?",
  "created_utc": 1623772630,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If someone, say, won a lottery of two to three hundred million after taxes or sold a company for that much and decided to invest at least half of their earnings in diversified Vanguard ETFs, would that be a good idea? Three to five funds would cover it. Wouldn&#39;t this be cheaper and more effective than hiring wealth management or starting a family office, especially if the goal would be to protect and preserve wealth rather than aggressive growth to billionaire status?</p>\n</div><!-- SC_ON -->",
  "score": 115,
  "permalink": "/r/Bogleheads/comments/o0dw6r/bogleheads_for_ultrahighnetworth_individuals/",
  "subreddit": "Bogleheads",
  "id": "o0dw6r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741230
}