{
  "author": "NameInsertedHere",
  "the_new_excerpt": "I'll start by providing a chronological history of the company, then I'll\nexplain the three pillars of Score Media and Gaming which drive the company\ntoday and some further context.\n\nTheir History:\n\n * 1993 - They launched SportScope, a Canadian TV channel with a sports\n   ticker/scroll banner at…",
  "original_created_utc": 1614210748,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我先按时间顺序介绍一下公司的历史，然后我会\n解释推动公司发展的Score Media和Gaming的三大支柱。\n今天，以及一些进一步的背景。\n\n他们的历史。\n\n * 1993年，他们推出了加拿大的体育频道SportScope。\n   Ticker/scroll banner at...",
      "title": "$SCR - 在该公司向纳斯达克上市之前，你需要了解的一切。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我先按時間順序介紹一下公司的歷史，然後我會\n解釋推動公司發展的Score Media和Gaming的三大支柱。\n今天，以及一些進一步的背景。\n\n他們的歷史。\n\n * 1993年，他們推出了加拿大的體育頻道SportScope。\n   Ticker/scroll banner at...",
      "title": "$SCR - 在該公司向納斯達克上市之前，你需要了解的一切。"
    }
  ],
  "title": "$SCR - Everything you need to know about this company before their IPO to the NASDAQ",
  "created_utc": 1614224914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll start by providing a chronological history of the company, then I&#39;ll explain the three pillars of Score Media and Gaming which drive the company today and some further context.</p>\n\n<p>Their History:</p>\n\n<ul>\n<li>1993 - They launched SportScope, a Canadian TV channel with a sports ticker/scroll banner at the bottom.</li>\n<li>1997 - SportScope morphs into Headline Sports.</li>\n<li>2000 - Headline Sports morphs into &quot;the Score Television Network&quot;.</li>\n<li>2007 - theScore is the first multisport news and data app launched on Apple App Store.</li>\n<li>2011 - theScore established itself as market leader in the mobile sports coverage space with 1 million active users.</li>\n<li>2012 - theScore Inc is created after theScore sells its TV company &quot;theScore Television Network&quot; to  Rogers Communications.</li>\n<li>2015 - theScore creates its eSports platform on YouTube.</li>\n<li>2019 - They partner with Bet.Works to create betting backend technology. They launch sports betting in New Jersey in partnership with Monmouth Racetrack, becoming the first and only US media company to create and operate a mobile sportsbook. They also enter into a strategic multi-State market access partnership with Penn National Gaming</li>\n<li>2020 - They launch sports betting in Colorado and Indiana and up list from TSXV to TSX.</li>\n<li>2021 - They&#39;ve launched in Iowa and have announced their IPO for the NASDAQ. They stated that there will be more state expansions to come this year for theScore Bet.</li>\n</ul>\n\n<p><strong>The three pillars</strong></p>\n\n<p><em>theScore</em></p>\n\n<ul>\n<li>theScore app is one of the most popular mobile sports apps in North America, ranking 3rd in North America and in Canada among multi-sport news and data applications. In Canada, theScore app had approximately double the users of its closest competitors, TSN and Sportsnet, and approximately ten times the users of ESPN’s app.</li>\n<li>theScore app generated approximately 3.7 billion user sessions over the last year, with average monthly sessions per active user growing at approximately 9% from 2016 to present.</li>\n<li>Users of theScore app engaged with the application for approximately 101 minutes per month on average, ranking first among their peers</li>\n<li>Their user chat features are very popular, particularly among users focused on sports betting, with approximately 48% of users who chat sending betting-related messages, and approximately 40% of their overall monthly active users consuming public chat content.</li>\n<li><p>They recently announced their all time record in revenue generated from ads in their app.</p>\n\n<p><em>theScore esports</em> </p></li>\n<li><p>theScore esports produces and shares original videocontent pieces across its web and social platforms, including features and documentaries on high-profile teams, games and players from across the world of esports, as well as highlights and interviews. theScore esports’ video content is distributed across YouTube, Facebook, Twitter, Instagram, and TikTok.</p></li>\n<li><p>They have approximately 1.6 million subscribers to their YouTube channel.</p></li>\n<li><p>1.1 million followers on TikTok as of Dec 2020</p></li>\n<li><p>Their esports video content generated approximately 357 million views across all channels during the three-month period which ended November 30, 2020. Representing a 358% year-over-year growth in total views of their esports video content from the same period last year.</p></li>\n<li><p>Worldwide, it&#39;s estimated that 495 million people watched esports online or on television in 2020, and that viewership could grow up to 646 million people annually by 2023. As a result of growth of interest in younger generations of sports fans, it is estimated that esports will become one of the biggest categories of sports betting over the long-term.</p></li>\n</ul>\n\n<p><em>theScore Bet</em> </p>\n\n<ul>\n<li> theScore Bet is authorized to provide sports betting services in New Jersey, Colorado, Indiana, and in Iowa. They also have market access for up to nine additional states via their multi-state market access agreements with Penn National Gaming </li>\n<li>  theScore Bet has market access to operate an online casino in New Jersey via a multi-year agreement with Twin River Worldwide Holdings, Inc. and anticipates launching its product in the state in the second half of calendar 2021. This is important because</li>\n<li>Approximately 50% of users of theScore Bet on iOS devices are also users of theScore app, engaging with their content and their integrated media and betting ecosystem. This means that because they already have the userbase through their media that they don&#39;t have to spend as much on marketing compared to their competitors.</li>\n<li> The total online gross gaming revenue generated in the United States is estimated to reach approximately $18 billion, of which approximately $6.4 billion is estimated to be generated in the states covered by their market access agreements. </li>\n</ul>\n\n<p><strong>Further Context:</strong></p>\n\n<p>Canada is on the brink of legalizing single event sports betting through bill C-218. It passed the 2nd reading by a vote of 303 and 15. It&#39;s estimated that wagering will begin by September (Start of the NFL). This is important for thescore because of their strong Canadian user base.</p>\n\n<p>On February 11 2021 theScore completed a 10-1 share consolidation for the purpose of up-listing to the NASDAQ. They announced their IPO this week and several sources indicate that their pricing will take place tomorrow. Usually the stock starts trading 1 day after the pricing, therefore it will start trading on the NASDAQ on Friday. I expect to receive an official statement from theScore tomorrow. The stock will trade under SCR on the TSX and the NAS.</p>\n\n<p>The two key factors to their success as a betting company will rely strongly on the integrations between their media and betting platforms which no other company can compete with and their massive user base from their sports media app converting to bettors. As I stated above, almost 50% of the users who chat via their media app also bet.</p>\n\n<p>SCR&#39;S market cap currently sits at 1.64B, in comparison DKNG sits at 23.61B and PENN sits at 18.69. </p>\n\n<p>This shows the kind of opportunity that theScore has and the unique position that it is placed in.</p>\n\n<p>EDIT: theScore just <a href=\"https://finance.yahoo.com/news/thescore-announces-pricing-upsized-initial-010000199.html\">announced</a> that they will be trading on the NASDAQ as of TOMORROW. The IPO price is listed at $27</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/stocks/comments/lrqsv3/scr_everything_you_need_to_know_about_this/",
  "subreddit": "stocks",
  "id": "lrqsv3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332887597
}