{
  "author": "kriptonicx",
  "the_new_excerpt": "> Tesla reported earnings after the bell and it’s a miss on earnings, but\n> another profitable quarter for Elon Musk’s electric vehicle and solar\n> business.\n> \n> Shares were down about 3% after hours.\n> \n> Here are the results, versus what analysts were expecting according to\n> estimates compiled…",
  "original_created_utc": 1611795996,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "> 特斯拉在盘后公布了财报，虽然财报失利，但是\n> 埃隆-马斯克的电动汽车和太阳能又获利了一季。\n> 业务。\n> \n> 股价盘后下跌约3%。\n> \n> 以下是结果，与分析师的预期相比，根据。\n> 编制的估计数...",
      "title": "特斯拉第四季度财报失利。0.80美元，预期1.03美元，Rev107.4亿美元，预期104亿美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> 特斯拉在盤後公佈了財報，雖然財報失利，但是\n> 埃隆-馬斯克的電動汽車和太陽能又獲利了一季。\n> 業務。\n> \n> 股價盤後下跌約3%。\n> \n> 以下是結果，與分析師的預期相比，根據。\n> 編制的估計數...",
      "title": "特斯拉第四季度財報失利。0.80美元，預期1.03美元，Rev107.4億美元，預期104億美元。"
    }
  ],
  "title": "Tesla misses on Q4 earnings. $0.80 vs $1.03 expected, Rev $10.74b vs $10.4b expected",
  "created_utc": 1611820604,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>Tesla reported earnings after the bell and it’s a miss on earnings, but another profitable quarter for Elon Musk’s electric vehicle and solar business.</p>\n\n<p>Shares were down about 3% after hours.</p>\n\n<p>Here are the results, versus what analysts were expecting according to estimates compiled by Refinitiv:</p>\n\n<p>Earnings: 80 cents adj. vs $1.03 per share expected</p>\n\n<p>Revenue: $10.74 billion vs $10.4 billion expected</p>\n\n<p>The company also gave some production guidance going forward, writing “Over a multi-year horizon, we expect to achieve 50% average annual growth in vehicle deliveries.” Tesla expects faster delivery growth than that for 2021, with two new factories expected to come online this year and updated versions of its Model S and X vehicles about to begin production.</p>\n\n<p>Gross margins reached 19.2% for Tesla in the fourth quarter of 2020, the lowest since the last quarter of 2019. Capital expenditures hit $1.15 billion for the period ending December 31, 2020.</p>\n\n<p>The company also reported positive free cash flow for 2020 of $2.79 billion, more than double its 2019 figure of $1.08 billion.</p>\n\n<p>Tesla previously said it had delivered 499,550 vehicles in 2020, falling barely shy of its guidance for half a million vehicle deliveries in 2020. (Deliveries are the closest approximation of sales numbers disclosed by Tesla.) It produced 509,737 vehicles during the year.</p>\n\n<p>Both deliveries and production numbers set a new record for the maturing electric car company, seen as a triumph in a year when auto sales and factory operations were dampened by a global pandemic.</p>\n\n<p>Automotive revenue grew to $9.31 billion in Q4, while revenue from energy generation and storage reached $752 million, and services and other revenue grew to $678 million. “Other” revenue includes sales of Tesla merchandise including the company’s own tequila, apparel and more essential vehicle accessories like car charging adapters.</p>\n\n<p>Tesla spent $522 million on research and development and nearly a billion on SG&amp;A, sales, general and administrative costs in the last quarter of 2020.</p>\n\n<p>Looking ahead, Tesla said it would begin producing its newest model -- the crossover SUV known as the Model Y -- at new plants in Austin, Texas, and Brandenburg, Germany, in 2021. Tesla intends to incorporate its own new “tabless” battery cells, which it unveiled at an annual shareholder meeting and battery presentation in September last year in those vehicles.</p>\n\n<p>Today’s report is Tesla’s first since its addition to the S&amp;P 500.</p>\n\n<p>Vehicle sales in China largely enabled Tesla to hit record deliveries in 2020. So did the introduction of a new crossover SUV, the Model Y, which Tesla began to produce in serious volumes in the first quarter last year out of its Fremont, California car plant.</p>\n\n<p>In the fourth quarter, after multiple price cuts, and a shift from selling more expensive Model S and X vehicles, to selling lower priced Model 3 and Y vehicles, including in China, Tesla’s average sales price dipped by about 11%.</p>\n\n<p>Since Tesla’s third quarter earnings call in October 2020, the price of the company’s stock has more than doubled, giving it a market capitalization of more than $835 billion and making it the fifth-most valuable company in the U.S.</p>\n</blockquote>\n\n<p>Source: <a href=\"https://www.cnbc.com/2021/01/27/tesla-tsla-earnings-q4-2020.html\">https://www.cnbc.com/2021/01/27/tesla-tsla-earnings-q4-2020.html</a></p>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/investing/comments/l6jw1u/tesla_misses_on_q4_earnings_080_vs_103_expected/",
  "subreddit": "investing",
  "id": "l6jw1u",
  "is_self": true,
  "media": null,
  "is_video": false
}