{
  "author": "FantasticPiglet",
  "original_created_utc": 1627691001,
  "title": "For Medieval peoples, was wilderness seen as beautiful and pristine as we see it now or was it seen as hostile and harsh?",
  "created_utc": 1627708584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With our modern lens it seems that wilderness is a nice place to take a vacation and take pretty pictures, but I&#39;d imagine people from the past might see it as dangerous and unforgiving.  I&#39;m unaware of any medieval or classical era writing on the subject.  Or from other areas like China or India.  I just remember watching the old Jungle Book movie and the Indian town folk seemed to be terrified of the jungle.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/oux8ac/for_medieval_peoples_was_wilderness_seen_as/",
  "subreddit": "AskHistorians",
  "id": "oux8ac",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "With our modern lens it seems that wilderness is a nice place to take a vacation\nand take pretty pictures, but I'd imagine people from the past might see it as\ndangerous and unforgiving. I'm unaware of any medieval or classical era writing\non the subject. Or from other areas like China or India. I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現代のレンズでは、大自然は休暇を取ってきれいな写真を撮るのに適した場所のようですが\n綺麗な写真が撮れる素敵な場所のように見えますが、昔の人からすると危険で過酷な場所に見えたのではないでしょうか。\n昔の人には危険で容赦のない場所に見えたのではないでしょうか。中世や古典時代に書かれたものを私は知りません。\n中世や古典時代の書物を知らない。あるいは、中国やインドなど他の地域のものも。I...",
      "title": "中世の人々にとって、荒野は現在のように美しく原始的なものであったのか、それとも敵対的で厳しいものであったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我们的现代镜头下，荒野似乎是一个度假的好地方\n和拍摄漂亮照片的好地方，但我想过去的人可能会把它视为\n危险和无情的。我不知道有什么中世纪或古典时代的著作\n关于这个问题。或者来自中国或印度等其他地区。I...",
      "title": "对于中世纪的人们来说，荒野被视为像我们现在看到的那样美丽和原始，还是被视为敌对和严酷？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我們的現代鏡頭下，荒野似乎是一個度假的好地方\n和拍攝漂亮照片的好地方，但我想過去的人可能會把它視爲\n危險和無情的。我不知道有什麼中世紀或古典時代的著作\n關於這個問題。或者來自中國或印度等其他地區。I...",
      "title": "對於中世紀的人們來說，荒野被視爲像我們現在看到的那樣美麗和原始，還是被視爲敵對和嚴酷？"
    }
  ]
}