{
  "author": "SiarX",
  "the_new_excerpt": "General sanctions obviously dont work, since only common Russians get poorer and\nhate West more, while oligarches just do not care about falling ruble or\nweakening economy - they keep all their money abroad\n[https://thebell.io/en/where-do-russia-s-wealthy-keep-their-money/] and mostly\nwithin reach…",
  "original_created_utc": 1621372822,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "一般的な制裁は明らかに効果がありません。なぜなら、一般のロシア人はより貧しくなり、西洋をより憎むようになるだけだからです。\n庶民のロシア人だけが貧しくなり、西欧をより憎むようになり、オリガルチはルーブルの下落や通貨の弱体化を気にしないからです。\nオリガルチはルーブルの下落や経済の弱体化を気にせず、すべての資金を海外に置いているからです。\n[https://thebell.io/en/where-do-russia-s-wealthy-keep-their-money/] そしてほとんどの場合\n手の届くところに置いているからです。",
      "title": "なぜアメリカや他の国は、ロシアのオリガルチに対して一般的な制裁ではなく、ターゲット制裁を行わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一般的制裁显然不起作用，因为只有普通的俄罗斯人变得更穷，更讨厌西方。\n而寡头们则不在乎卢布下跌或经济疲软。\n经济疲软--他们把所有的钱都放在国外\n[https://thebell.io/en/where-do-russia-s-wealthy-keep-their-money/]而且大多\n在可承受范围内......",
      "title": "为什么美国和其他国家不对俄罗斯的寡头进行目标制裁，而要进行全面制裁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一般的制裁顯然不起作用，因爲只有普通的俄羅斯人變得更窮，更討厭西方。\n而寡頭們則不在乎盧布下跌或經濟疲軟。\n經濟疲軟--他們把所有的錢都放在國外\n[https://thebell.io/en/where-do-russia-s-wealthy-keep-their-money/]而且大多\n在可承受範圍內......",
      "title": "爲什麼美國和其他國家不對俄羅斯的寡頭進行目標制裁，而要進行全面制裁？"
    }
  ],
  "title": "Why USA and other countries do not place target sanctions on Russian oligarches instead of general sanctions?",
  "created_utc": 1621456972,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>General sanctions obviously dont work, since only common Russians get poorer and hate West more, while oligarches just do not care about falling ruble or weakening economy - <a href=\"https://thebell.io/en/where-do-russia-s-wealthy-keep-their-money/\">they keep all their money abroad</a> and mostly within reach of the West, it seems. Would not it make much more sense to hurt their wallets instead? Freezing assets of oligarches and other members of Putin clique, confiscating their property abroad, banning entering Western countries, etc most likely can make them change their aggressive international behavior... So why not?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/Ask_Politics/comments/nfmm0k/why_usa_and_other_countries_do_not_place_target/",
  "subreddit": "Ask_Politics",
  "id": "nfmm0k",
  "is_self": true,
  "media": null,
  "is_video": false
}