{
  "author": "throwaway29801A",
  "original_created_utc": 1629574264,
  "title": "2025-bitcoin is 400k-and people say....",
  "created_utc": 1629594724,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You bought bitcoin at $50,000? LUCKY they shout. Before our pride gets to us and our ego makes our head so big it can&#39;t get through the door, this is a repeat of what happened before.</p>\n\n<p>The people who bought Amazon in 2000.</p>\n\n<p>How about the crazy woman who put $5,000 into netflix in the beginning?</p>\n\n<p>How about that friend who has half his IRA in Tesla?</p>\n\n<p>That guy who took his sales commissions and kept buying real estate in 2014,2015,2016,2017?</p>\n\n<p>That family friend who bought gold in the early 70s (no joke my dad&#39;s friend did this-he sold and even borrowed to buy as much gold as possible in the early 70s).</p>\n\n<p>Most of society doesn&#39;t want to invest. We could state that most cannot invest due to wages. FAIR point. However, I know tons of people who could invest-they have the disposable income. They don&#39;t want to. I repeat -they do NOT want to. They don&#39;t want to learn. They want to just roll with it. Maybe they put some money into what their advisor recommends. And why does he recommend it? His boss told him it&#39;s a good investment.</p>\n\n<p>If you are buying bitcoin, unless you are trying to be a quick trader (hint: most traders lose money), you have done something different. Bitcoin is not close to on the radar for most people. You have accepted volatility in exchange for a long term vision. Best of luck!</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "permalink": "/r/Bitcoin/comments/p8xpcj/2025bitcoin_is_400kand_people_say/",
  "subreddit": "Bitcoin",
  "id": "p8xpcj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You bought bitcoin at $50,000? LUCKY they shout. Before our pride gets to us and\nour ego makes our head so big it can't get through the door, this is a repeat of\nwhat happened before.\n\nThe people who bought Amazon in 2000.\n\nHow about the crazy woman who put $5,000 into netflix in the beginning?\n\nHow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインを5万円で買った？LUCKY」と叫ぶ。プライドが邪魔をして\nプライドが邪魔をして、エゴが頭を大きくしてドアを通れなくなる前に、これは以前に起こったことの繰り返しです。\n前にもあったことだ。\n\n2000年にアマゾンを買った人たち。\n\n2000年にアマゾンを買った人たち、最初にネットフリックスに5000ドルをつぎ込んだクレイジーな女性はどうでしょう？\n\nどう...",
      "title": "2025年 ビットコインは400円、そして人々は...."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你在50,000美元买了比特币？他们喊的是LUCKY。在我们的自尊心得到满足和\n我们的自尊心让我们的头大到无法穿过这扇门，这是一个重复的\n之前发生的事情。\n\n2000年买下亚马逊的人。\n\n当初在netflix投入5000美元的疯女人怎么样？\n\n如何...",
      "title": "2025年比特币是400K，人们说...."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你在50,000美元買了比特幣？他們喊的是LUCKY。在我們的自尊心得到滿足和\n我們的自尊心讓我們的頭大到無法穿過這扇門，這是一個重複的\n之前發生的事情。\n\n2000年買下亞馬遜的人。\n\n當初在netflix投入5000美元的瘋女人怎麼樣？\n\n如何...",
      "title": "2025年比特幣是400K，人們說...."
    }
  ]
}