{
  "author": "ElvenNeko",
  "the_new_excerpt": "\"Those who want the power do not deserve it\".\n\nPeople complain that their governments are corrupted. That they are acting in\ntheir own interests, and interests of the corporations of their friends, etc.\nThat they playing political games around the world instead of improving lives of\nthe…",
  "original_created_utc": 1615988618,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "\"要权力的人不配拥有权力\"。\n\n人们抱怨他们的政府腐败。他们的行为\n他们自己的利益，以及他们朋友的公司的利益，等等。\n他们在世界各地玩政治游戏，而不是改善人们的生活。\n的...",
      "title": "为什么人们在选择统治者的时候，大多是在那些基本欲望是积累财富和获得权力的人中选择？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"要權力的人不配擁有權力\"。\n\n人們抱怨他們的政府腐敗。他們的行爲\n他們自己的利益，以及他們朋友的公司的利益，等等。\n他們在世界各地玩政治遊戲，而不是改善人們的生活。\n的...",
      "title": "爲什麼人們在選擇統治者的時候，大多是在那些基本慾望是積累財富和獲得權力的人中選擇？"
    }
  ],
  "title": "Why people chosing their rulers mostly among the people who's basic desires are building wealth and gaining power?",
  "created_utc": 1616023601,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Those who want the power do not deserve it&quot;. </p>\n\n<p>People complain that their governments are corrupted. That they are acting in their own interests, and interests of the corporations of their friends, etc. That they playing political games around the world instead of improving lives of the citizens. </p>\n\n<p>People are upset. People chosing different leaders - sometimes even trough violent and bloody revolutions, or other forms of unrest. But almost every single time they chosing rich people as their rulers. </p>\n\n<p>If someone dedicated their entire life to growing wealth and gaining power - does it really comes as a surprise when such person starts using their political post to gain even more wealth and abuse their power for personal benefits? </p>\n\n<p>So why people keep doing it? How often someone who spent their entire life as a volounteer, helping others without profits were chosen as a president or at least as a mayor? What about people with low incomes who are happy about them, or even better - downshifters? Those people had an opportunity to make more money but they refused it for something else - it&#39;s safe to say that risk of them being corrupted is much lower than if you would chose a buisnessman instead. And there is higher chance for those people to pursue goals such as quality of life improvment, science, medicine and art support, better education, etc, instead of corporative support, military presence, etc. </p>\n\n<p>The only problem i see that people with less than average income may have problems with running various propaganda champaigns, but do they really need them? All their campaigns would be based on simply who they are. </p>\n\n<p>I am not saying that people should vote for everyone who happened to be poor  - but it seems weird that people who chose to refuse money and power for various reasons (especially if those reasons are providing unpaid help for other humans) are not the ones everyone wants to see in the ruling posts. Why?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TrueAskReddit/comments/m70pev/why_people_chosing_their_rulers_mostly_among_the/",
  "subreddit": "TrueAskReddit",
  "id": "m70pev",
  "is_self": true,
  "media": null,
  "is_video": false
}