{
  "author": "Iiau_",
  "original_created_utc": 1630426891,
  "title": "Today is the lawsuit date: Why Ripple has to win the lawsuit against SEC, and why this should matter to everyone",
  "created_utc": 1630458362,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today, Aug 31 is the hearing most likely.</p>\n\n<p>So SEC sued XRP as a security.</p>\n\n<p>Crypto is not a security or a commodity, it is its own set of assets. XRP is not a security because anyone can own XRP with anonymity. A stock has your name written says you own it. But crypto is different. Why do you think you can own a fraction of any coin? You can even burn XRP by sending it to a nonexistent address, you can&#39;t just burn stock shares. It isn&#39;t a commodity because it has no intrinsic value; it&#39;s just bits stacked on a blockchain. But crypto has value because of the people willing to exchange monetary value for it, and the miners and validators who keep this system running. XRP is a cryptocurrency just how you can call a stock a security and how you can call gold a commodity.</p>\n\n<p>So, if SEC wins, they can treat every crypto that had an ICO or sale of crypto just like a security, like stocks, and will regulate the shit out of it. Exchanges will start dropping these coins like flies so they don&#39;t get targeted, and coins may suffer the same fate as XRP when it dropped 50%. Even ETH would be regulated. In the grand scheme of things this can cause a, pun unintended, ripple effect in the market, ICO or not.</p>\n\n<p>If Ripple wins it&#39;ll be a huge step for crypto.</p>\n\n<p>Fortunately, they just sued without giving in why, so they have no basis why crypto  classifies as security and rather mostly trustless and anonymous  decentralized currency. If they release some internal documents clarifying why, Ripple will  definitely poke holes through the SEC&#39;s weak and scummy reasoning. If  they don&#39;t, well SEC is making a fool out of themselves.</p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/pf97oi/today_is_the_lawsuit_date_why_ripple_has_to_win/",
  "subreddit": "CryptoCurrency",
  "id": "pf97oi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Today, Aug 31 is the hearing most likely.\n\nSo SEC sued XRP as a security.\n\nCrypto is not a security or a commodity, it is its own set of assets. XRP is not\na security because anyone can own XRP with anonymity. A stock has your name\nwritten says you own it. But crypto is different. Why do you think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、8月31日がヒアリングの日である可能性が高い。\n\nSECはXRPを証券として訴えたわけです。\n\nCryptoは証券でも商品でもなく、それ自体が資産の集合体です。XRPは\nXRPは誰でも匿名で所有することができるので、証券です。株は自分の名前\nと書かれています。しかし暗号は違います。なぜ、そう思うのか...",
      "title": "今日は訴訟日：リップル社がSECとの訴訟に勝たなければならない理由、そしてこれが誰にとっても重要である理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，8月31日是听证会，最有可能。\n\n所以SEC将XRP作为一种证券起诉。\n\n加密货币不是一种证券或商品，它是自己的一套资产。XRP不是\n证券，因为任何人都可以匿名拥有XRP。一支股票有你的名字\n写着你拥有它。但加密货币是不同的。为什么你认为...",
      "title": "今天是诉讼日：为什么瑞波公司必须赢得对SEC的诉讼，以及为什么这对每个人来说都很重要"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，8月31日是聽證會，最有可能。\n\n所以SEC將XRP作爲一種證券起訴。\n\n加密貨幣不是一種證券或商品，它是自己的一套資產。XRP不是\n證券，因爲任何人都可以匿名擁有XRP。一支股票有你的名字\n寫着你擁有它。但加密貨幣是不同的。爲什麼你認爲...",
      "title": "今天是訴訟日：爲什麼瑞波公司必須贏得對SEC的訴訟，以及爲什麼這對每個人來說都很重要"
    }
  ]
}