{
  "author": "deathtolucky",
  "original_created_utc": 1632144236,
  "title": "Everyone here talking about how people should have seen today’s correction coming are like kids who said they knew the answer after you told them.",
  "created_utc": 1632152619,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“Anyone who analyses charts knows that we were due for a correction”</p>\n\n<p>“If you can’t handle dips, you shouldn’t be in this space”</p>\n\n<p>“BTC just dipped below the 200 day MA so get ready for a downward trend”</p>\n\n<p>“I’m smart and knew what was going to happen all along. Everyone should be like me and listen to what I say even though I was posting the exact opposite shit yesterday”</p>\n\n<p>It’s ridiculous. You didn’t know jack. It’s like kids in elementary school who say “that’s what I was gonna say” after the teacher gives the answer to the class. You’re full of it. </p>\n\n<p>This sub turns on a dime. Make the best decision for you and stick with it. Take profits or don’t but don’t rely on anyone else’s “advice” because nobody is culpable for the consequences of your actions except for you. Enjoy the dip and load up your chips!</p>\n</div><!-- SC_ON -->",
  "score": 412,
  "permalink": "/r/CryptoCurrency/comments/prutgq/everyone_here_talking_about_how_people_should/",
  "subreddit": "CryptoCurrency",
  "id": "prutgq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "“Anyone who analyses charts knows that we were due for a correction”\n\n“If you can’t handle dips, you shouldn’t be in this space”\n\n“BTC just dipped below the 200 day MA so get ready for a downward trend”\n\n“I’m smart and knew what was going to happen all along. Everyone should be like\nme and listen to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"チャートを分析する人なら誰でも知っている\"\"修正の時期が来たことを\"\n\n\"ディップに対応できないなら\"\"この分野にいるべきではない\"\n\n\"BTCは200日MAを割り込んだ\"\"下降トレンドの準備を\"\n\n\"私は賢く、最初から何が起こるか分かっていた。誰もが私のようになるべきだ。\n私のようになるべきだ」「...",
      "title": "ここで「今日の修正を予想していたはずだ」と言っている人たちは、「教えてもらったら答えがわかった」と言っている子供のようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"任何分析图表的人都知道，我们应该进行一次修正\"\n\n\"如果你不能应对下跌，你就不应该进入这个领域\"\n\n\"BTC刚刚跌破了200天的MA，所以要准备好迎接下跌的趋势\"\n\n\"我很聪明，一直都知道会发生什么。每个人都应该像\n我一样，听从...",
      "title": "这里每个人都在谈论人们应该看到今天的修正，就像那些在你告诉他们之后说他们知道答案的孩子。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"任何分析圖表的人都知道，我們應該進行一次修正\"\n\n\"如果你不能應對下跌，你就不應該進入這個領域\"\n\n\"BTC剛剛跌破了200天的MA，所以要準備好迎接下跌的趨勢\"\n\n\"我很聰明，一直都知道會發生什麼。每個人都應該像\n我一樣，聽從...",
      "title": "這裏每個人都在談論人們應該看到今天的修正，就像那些在你告訴他們之後說他們知道答案的孩子。"
    }
  ]
}