{
  "author": "littlemonky",
  "the_new_excerpt": "Hello everyone, I would like to share my thoughts on the lumber market for the\nnext 4-6 months and an ETF that could benefit heavily (WOOD).\n\nWhy WOOD?\n\n * Exposure to companies that produce forest products, agricultural products,\n   and paper and packaging products.\n * Targeted access to timber &…",
  "original_created_utc": 1616435520,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我想和大家分享一下我对木材市场的看法。\n未来4-6个月，以及可能会大幅受益的ETF（WOOD）。\n\n为什么选择WOOD？\n\n *接触生产林产品、农产品的公司。\n   和纸及包装产品。\n * 有针对性地进入木材和...",
      "title": "iShares全球木材及林业ETF(WOOD)DD--木材价格持续看涨的理由及2021年展望。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我想和大家分享一下我對木材市場的看法。\n未來4-6個月，以及可能會大幅受益的ETF（WOOD）。\n\n爲什麼選擇WOOD？\n\n *接觸生產林產品、農產品的公司。\n   和紙及包裝產品。\n * 有針對性地進入木材和...",
      "title": "iShares全球木材及林業ETF(WOOD)DD--木材價格持續看漲的理由及2021年展望。"
    }
  ],
  "title": "iShares Global Timber & Forestry ETF (WOOD) DD - Bullish Case For Continued Lumber Prices & 2021 Outlook",
  "created_utc": 1616507800,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello everyone, I would like to share my thoughts on the lumber market for the next 4-6 months and an ETF that could benefit heavily (WOOD). </p>\n\n<p>Why WOOD? </p>\n\n<ul>\n<li>Exposure to companies that produce forest products, agricultural products, and paper and packaging products.</li>\n<li>Targeted access to timber &amp; forestry stocks from around the world</li>\n<li>Use to express a global sector view</li>\n<li>Directly affected by lumber futures</li>\n</ul>\n\n<p>Why not lumber futures? </p>\n\n<ul>\n<li>Lumber futures have never attracted the level of volume and OI for a successful futures contract. I have traded various futures ranging from agricultural to energy and lumber is a nightmare for liquidity. You&#39;d buy and be stuck in your position essentially so opening a position in the WOOD ETF is a much safer bet. </li>\n</ul>\n\n<p>Now that we have the &quot;Whys&quot; out of the way, let&#39;s get into a brief discussion on lumber markets. </p>\n\n<ul>\n<li>[New record highs for wood futures] (<a href=\"https://www.nasdaq.com/market-activity/commodities/lbs\">https://www.nasdaq.com/market-activity/commodities/lbs</a>)</li>\n<li>The housing market reflects optimism on rates\n\n<ul>\n<li>The US Housing Market has been booming despite the high level of unemployment and economic contraction from COVID. However, the pandemic is changing trends in where people are choosing to live (Zoom Towns). As the work environment has changed to remote and people are leaving urban areas, we are seeing a demand spike for new homes which is increasing the requirements for wood. </li>\n<li>Record low interest rates are providing support for new construction and existing homes. We also know that Jerome &quot;Print Money, Honey&quot; Powell is taking us into the low interest rate promise land until 2023. </li>\n</ul></li>\n<li>Home Improvement and Mill Closures\n\n<ul>\n<li>Obviously people are spending more time on projects at home given they are at home more often these days. Sales at Home Depot (HD) and Lowe&#39;s (LOW) have pushed both companies to record highs in late 2020. This trend will continue into the Spring as people look to add onto their homes outside with the better weather.</li>\n<li>Lumber mills across the country, and even Canada, have closed down or limited production of wood products since Q42020. Increased demand and very low supply levels have created a perfect storm for bullish lumber futures. </li>\n</ul></li>\n<li>Market Sentiment\n\n<ul>\n<li>Admittedly, I am going to be in this play because I am a direct end user of pallets. I am constantly being updated, sometimes daily but definitely weekly, on the price of lumber. Some of the quotes from the supplier are as follows:\n\n<ul>\n<li>&quot;We are going to get to a point where it&#39;s not about the price we/you are going to have to pay, it&#39;s going to be about can we even buy it - regardless of the price we/you have to pay.&quot; - March 5, 2021</li>\n<li>&quot;White hot demand and nothing to buy. It&#39;s not a matter of price at this point. The market is a runaway freight train. Not much else I can say&quot; - March 12, 2021</li>\n<li>&quot;Wish we had better news to deliver but this market is something no one has seen before. My opinion is we will see prices in this range for 90 days, AT LEAST&quot; - March 21, 2021</li>\n<li>&quot;At this point, would plan on this tight supply and high pricing to stand for at least 90 days as I see little hope for relief and demand is extremely strong. Where is additional supply even going to come from?? Very concerned&quot; - March 22, 2021</li>\n</ul></li>\n</ul></li>\n</ul>\n\n<p>Continued Catalysts for Lumber Futures</p>\n\n<ul>\n<li>Agricultural season is starting up in California which will push demand up even more. California accounts for almost 14% of cash receipts in the US for agriculture. They have a LOT of demand for lumber via pallets. </li>\n<li>Mills continue to struggle with inventory levels on tight supply. Given that a good portion of mills have closed down with no plans to reopen until COVID is settled, I continue to see issues on the supply side.</li>\n<li>Mills have strong order files through end of April and feel little pressure to discount prices at this point. Current pricing makes it difficult to &quot;stock up&quot; on inventory due to credit restraints so it&#39;s forcing people to continue to step in on a weekly basis to cover their needs as orders/business comes their way. This keeps buyers going back to the mills to purchase which enables mills to hold their price as material continues to be gobbled up. It&#39;s a VICIOUS cycle. </li>\n<li>Improved weather will cause more people to purchase lumber as they begin Spring/Summer projects.</li>\n<li>Infrastructure rebuilding under Biden Administration. </li>\n</ul>\n\n<p>Bearish Case:</p>\n\n<ul>\n<li>My primary bear case is based on the rollout of COVID vaccines which would allow for a return to a more normal lifestyle. The vaccine could lead to a slowdown in housing construction and demand. Those who have been vaccinated could move or stay in cities where steel is the dominant choice for construction. </li>\n<li>US &amp; Canadian Mills that have shutdown due to COVID start to come online which would add a large supply to the market. This would completely kill my thesis.<br/></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>I wish I would have taken a position back in November 2020 when the writing was on the wall but I think there is still juice left to squeeze based on market conditions. Potential upside would be ~30% over the course of 4-6 months. It could go higher but that is a conservative estimate. </p>\n\n<p>Current WOOD Price: ~85/share. </p>\n\n<p>Price Target by July 2021: ~$110/share.</p>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/investing/comments/matlli/ishares_global_timber_forestry_etf_wood_dd/",
  "subreddit": "investing",
  "id": "matlli",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752819536
}