{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Wednesday, April 7, 2021\n\nStocks traded largely flat on Wednesday, with the S&P 500 (SPY) and Dow Jones\n(DIA) hovering near record highs, as market participants continue to consider\nthe latest batch of strong economic data and commentary by FOMC members.\n\nThis week, market…",
  "original_created_utc": 1617826093,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイコ・マーケット・リカップ - 2021年4月7日（水\n\n2021年4月7日（水）の株式市場は、S&P 500 (SPY)とDow Jones (DIA)が史上最高値付近で推移し、ほぼ横ばいで推移しました。\nS&P 500 (SPY)とDow Jones (DIA)は過去最高値付近で推移しました。\nこれは、市場参加者が最近の強い経済データとFOMCメンバーのコメントを考慮しているためです。\n\n今週、市場...",
      "title": "本日2021年4月7日（水）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年4月7日，星期三。\n\n周三股市交易基本持平，标普500指数（SPY）和道琼斯指数（Dow Jones\n(DIA)在纪录高位附近徘徊，市场参与者继续考虑到\n最新一批强劲的经济数据和FOMC成员的评论。\n\n本周，市场...",
      "title": "以下是2021年4月7日（星期三）今天的市场回顾。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年4月7日，星期三。\n\n週三股市交易基本持平，標普500指數（SPY）和道瓊斯指數（Dow Jones\n(DIA)在紀錄高位附近徘徊，市場參與者繼續考慮到\n最新一批強勁的經濟數據和FOMC成員的評論。\n\n本週，市場...",
      "title": "以下是2021年4月7日（星期三）今天的市場回顧。"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, April 7, 2021",
  "created_utc": 1617836018,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Wednesday, April 7, 2021</strong></p>\n\n<p>Stocks traded largely flat on Wednesday, with the S&amp;P 500 (SPY) and Dow Jones (DIA) hovering near record highs, as market participants continue to consider the latest batch of strong economic data and commentary by FOMC members.</p>\n\n<p>This week, market participants have digested a host of better-than-expected economic data, with the March job report blowing past consensus estimates, an index tracking activity in the service sector reached a record level, and The Institute for Supply Management (ISM) said on Thursday its index of national factory activity jumped to a reading of 64.7 last month from 60.8 in February, the highest level since December 1983. The International Monetary Fund upgraded its global growth forecast to 6% this year from the 5.5% rise seen previously, largely reflecting the expectation of quick recovery in the U.S. economy. Moreover, JP Morgan (JPM) CEO Jamie Dimon said the current US economic boom “could easily run into 2023” amid the massive fiscal and monetary policy support provided to people and businesses. </p>\n\n<p>This week, the Federal Open Market Committee have shed light on how monetary policymakers are thinking about the current economic climate. Most important, market participants want to know what conditions would warrant an adjustment of the Fed’s current policy stance and their thoughts on potential inflation. FOMC members noted that the economy was “far from achieving the [FOMC’s] broad-based an inclusive goal of maximum employment” suggesting policymakers are willing to maintain their current accommodative stance for the foreseeable future, barring a sharp and unforeseen upturn in inflation or economic recovery.</p>\n\n<p>Looking ahead, we are eagerly awaiting first-quarter earnings season in the coming weeks, with the hope that the reports show corporate profits are growing strongly in tandem with strengthening economic conditions. Deutsche Bank Strategist Binky Chadha wrote in a note “Very near term, we expect equities to continue to be well supported by the acceleration in macro growth, and see buying by systematic strategies and buybacks driving a grind higher. But we expect a significant period of consolidation as growth peaks over the next three months.” </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Shares of embattled EV-company Nikola (NKLA) sank further after the company said its head of fuel-cell development departed from the company. </li>\n<li>An index tracking U.S. mortgage applications slid for a fifth straight week last week as mortgage rates climbed higher. Mortgage applications fell by 5.1% week-on-week, the Mortgage Bankers Association said Wednesday.</li>\n<li>Both Instacart and DoorDash (DASH) plan to launch their own credit cards</li>\n<li>JPMorgan may eventually move all its European operations from London following Brexit, according to multiple reports.</li>\n<li>Advanced Micro Devices (AMD) and Xilinx (XLNX) shareholders voted to approve AMD’s acquisition of Xilinx, the companies said Wednesday. The deal needs to pass regulatory approvals and is expected to close by the end of 2021. </li>\n<li>Nio said Wednesday its 100,000th mass-produced vehicle rolled out of the production line. It has taken Nio a little less than three years fro mthe rollout of their first vehicle to reach this milestone</li>\n<li>BYD (BYDDY), a Chinese EV company that is backed by Berkshire Hathaway (BRK.B) sold 38,599 vehicles, a 113% year-on-year.</li>\n<li>**<strong>Please note that current stock price was written premarket and does not reflect intraday movement*\\</strong>*</li>\n<li>Applied Materials (AMAT) with too many target raises to list. Consensus price target $150 at Buy. Stock currently around $140</li>\n<li>Citigroup (C) target raised by Barclays from $77 to $84 at Equal-Weight. Stock currently around $73</li>\n<li>Capital One Financial (COF) target raised by Barclays from $145 to $162 at Overweight. Stock currently around $132</li>\n<li>Discovery (DISCA) target raised by Deutshce Bank from $35 to $60 at Buy. Stock currently around $43</li>\n<li>Goldman Sachs (GS) target raised by Barclays from $392 to $420 at Overweight. Stock currently around $327</li>\n<li>JP Morgan (JPM) target raised by Barclays from $172 to $187 at Overweight. Stock currently around $153</li>\n<li>Paychex (PAYX) target raised by Argus from $103 to $105 at Buy. Stock currently around $95</li>\n<li>SMART Global (SGH) with three target raises. Stock currently around $49\n\n<ul>\n<li>Needham &amp; Co from $56 to $65 Buy</li>\n<li>Stifel Nicolaus from $55 to $62.50 Buy</li>\n<li>Deutsche Bank from $48 to $60 at Buy. </li>\n</ul></li>\n<li>Tapestry (TPR) target raised by Piper Sandler from $45 to $54 at Overweight. Stock currently around $43</li>\n<li>Voya Financial (VOYA) target raised by Royal Bank of Canada from $66 to $74 at Outperform. Stock currently around $66</li>\n<li>Whirlpool (WHR) target raised by JP Morgan (JPM) from $258 to $261 at Overweight. Stock currently around $234</li>\n</ul>\n\n<p>“Success is not final, failure is not fatal: It is the courage to continue that counts.” - Winston Churchill</p>\n</div><!-- SC_ON -->",
  "score": 207,
  "permalink": "/r/stocks/comments/mmar4u/here_is_a_market_recap_for_today_wednesday_april/",
  "subreddit": "stocks",
  "id": "mmar4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961880367
}