{
  "author": "Lifeisbuttermelon",
  "original_created_utc": 1624619479,
  "title": "The History *of* Greek Myths?",
  "created_utc": 1624698734,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m re-listening to Stephen Fry&#39;s Mythos, and I&#39;ve been thinking about how Greek myths seem to be this huge collection of disparate belief systems, woven together. I&#39;ve tried to look for some history of the development of Greek myth but it&#39;s hard to get beyond retellings of the myths themselves. Is there  much information about when certain beliefs emerged, or is it mostly speculative? </p>\n\n<p>For instance, there&#39;s two simultaneous goddesses of the moon - Semele (Titan) and Artemis (Olympian). Were they simultaneous? Or were they regional? Or did Artemis supplant Semele? Is there anything to show when the stories of e.g. the birth of Artemis and Apollo or Athena emerged, and do these seem to be much later than than the beginning of them being worshipped? Did their cults grow up after the cults of Zeus, Hera, Poseidon, and the other &#39;original&#39; Olympians, and is there anything to show how and when a coherent sense of the 12 Olympian gods as a complete pantheon came into play? </p>\n\n<p>I find it so fascinating that e.g. Leto, the Titaness mother of Apollo and Artemis, had temples dedicated to her, as per the myth of  Leucippus, even though she wasn&#39;t a &#39;god&#39;. Is this comparable to having a devotion to particular saints in Catholicism/Orthodox Christianity?</p>\n\n<p>I find it tempting to read a history of how beliefs developed in the region into the mythic history - with Gaia, Uranus and the nature spirits being older deities, who were supplanted by worship of the Titans - perhaps originally the gods of a conquering tribe - who in turn lost ground to belief in the Olympians as their adherents gained power in the region. However this seems too neat and obvious! Would love some pointers on where to read more about this.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/o7lkc0/the_history_of_greek_myths/",
  "subreddit": "AskHistorians",
  "id": "o7lkc0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm re-listening to Stephen Fry's Mythos, and I've been thinking about how Greek\nmyths seem to be this huge collection of disparate belief systems, woven\ntogether. I've tried to look for some history of the development of Greek myth\nbut it's hard to get beyond retellings of the myths themselves. Is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スティーブン・フライの「神話」を聴き直していて、ギリシャ神話がいかにバラバラな信仰体系の巨大な集合体であるかについて考えていました。\nギリシャ神話は、異なる信念体系が織り込まれた巨大な集合体のようだと考えています。\n織り込まれている。ギリシャ神話の発展の歴史を探してみたのですが\nしかし、神話自体の再話を超えることは困難です。それは...",
      "title": "ギリシャ神話の歴史？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正在重听斯蒂芬-弗莱的《神话》，我一直在思考希腊神话是如何\n我一直在想，希腊神话似乎是一个巨大的集合，由不同的信仰体系交织而成。\n在一起。我试图寻找一些希腊神话的发展历史\n但很难超越神话本身的复述。是...",
      "title": "希腊神话的历史*？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正在重聽斯蒂芬-弗萊的《神話》，我一直在思考希臘神話是如何\n我一直在想，希臘神話似乎是一個巨大的集合，由不同的信仰體系交織而成。\n在一起。我試圖尋找一些希臘神話的發展歷史\n但很難超越神話本身的複述。是...",
      "title": "希臘神話的歷史*？"
    }
  ]
}