{
  "author": "Hairybeast777",
  "original_created_utc": 1628216938,
  "title": "When do we stop talking about how to prevent climate change and instead talk about how to survive it?",
  "created_utc": 1628239836,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see study after study about climate change over the past 20 years and the studies continue to get worse.  Some studies state we have passed the point of no return and I just read a study of ocean currents in the Atlantic possibly in the process of changing.  </p>\n\n<p>With human nature we are reactive not proactive and as a realist I understand that we won’t change as a species until we are forced too by lack of resources.  With the pandemic we have found that the fear of mass death isn’t enough to phase the population to change so it will literally be when we no longer have clean potable water, food or other resources that are necessary for human life.  So once we get to that level everything will be too late.  </p>\n\n<p>So again since it is inevitable that climate change won’t be stopped or reversed when do we talk about how to survive it instead?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/oyxlyi/when_do_we_stop_talking_about_how_to_prevent/",
  "subreddit": "TooAfraidToAsk",
  "id": "oyxlyi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I see study after study about climate change over the past 20 years and the\nstudies continue to get worse. Some studies state we have passed the point of no\nreturn and I just read a study of ocean currents in the Atlantic possibly in the\nprocess of changing.\n\nWith human nature we are reactive not…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去20年間の気候変動に関する研究を見てきました。\n研究結果は悪化の一途をたどっています。ある研究では、私たちは帰れない地点を通過したと言っています。\n大西洋の海流が変化している可能性があるという研究結果を読んだばかりです。\n大西洋の海流は変化の過程にあるかもしれないという研究を読んだばかりです。\n\n人間の性質として、私たちは反応しません...",
      "title": "いつになったら、気候変動を防ぐ方法を語るのをやめて、気候変動を生き延びる方法を語ることができるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的20年里，我看到了一个又一个关于气候变化的研究报告，而且这些研究报告还在继续恶化。\n研究继续变得更糟。一些研究指出，我们已经过了不归路。\n我刚刚读了一份关于大西洋洋流可能处于变化过程中的研究报告。\n变化的过程。\n\n以人类的天性，我们是被动的，不是...",
      "title": "我们什么时候才能停止谈论如何防止气候变化，而是谈论如何在气候变化中生存？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的20年裏，我看到了一個又一個關於氣候變化的研究報告，而且這些研究報告還在繼續惡化。\n研究繼續變得更糟。一些研究指出，我們已經過了不歸路。\n我剛剛讀了一份關於大西洋洋流可能處於變化過程中的研究報告。\n變化的過程。\n\n以人類的天性，我們是被動的，不是...",
      "title": "我們什麼時候才能停止談論如何防止氣候變化，而是談論如何在氣候變化中生存？"
    }
  ]
}