{
  "author": "oscarbelle",
  "original_created_utc": 1647790419,
  "title": "Does crying actually contribute to emotional regulation?",
  "created_utc": 1647797735,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I see such conflicting answers on this. I know that we cry in response to extreme emotions, but I can&amp;#39;t actually find a source that I know is reputable that says that crying helps to stabilize emotions. Personal experience would suggest the opposite, and it seems very &amp;#39;four humors theory&amp;#39; to say that a process that dehydrates you somehow also makes you feel better, but personal experience isn&amp;#39;t the same as data, and I&amp;#39;m not a biology or psychology person. &lt;/p&gt;\n\n&lt;p&gt;So... what does emotion-triggered crying actually do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 141,
  "permalink": "/r/askscience/comments/tinmm6/does_crying_actually_contribute_to_emotional/",
  "subreddit": "askscience",
  "id": "tinmm6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I see such conflicting answers on this. I know that we cry in response to\nextreme emotions, but I can't actually find a source that I know is reputable\nthat says that crying helps to stabilize emotions. Personal experience would\nsuggest the opposite, and it seems very 'four humors theory' to say…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これについては、相反する答えがあるように思います。私たちが泣くのは\nしかし、信頼できる情報源を見つけることができません。\n泣くことで感情を安定させることができると言っています。個人的な経験では\nその逆で、「四体液説」のような気がするのですが...。",
      "title": "泣くことは実際に感情の調節に寄与しているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到关于这个问题的答案如此矛盾。我知道我们哭是为了回应\n但我实际上找不到一个我知道是有信誉的来源\n说哭泣有助于稳定情绪。个人经验表明\n个人经验表明情况恰恰相反，而且这似乎非常 \"四种幽默感理论\"，说...",
      "title": "哭泣是否真的有助于情绪调节？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到關於這個問題的答案如此矛盾。我知道我們哭是爲了回應\n但我實際上找不到一個我知道是有信譽的來源\n說哭泣有助於穩定情緒。個人經驗表明\n個人經驗表明情況恰恰相反，而且這似乎非常 \"四種幽默感理論\"，說...",
      "title": "哭泣是否真的有助於情緒調節？"
    }
  ]
}