{
  "author": "corn_dick",
  "original_created_utc": 1634844487,
  "title": "Should there be an upper age limit for government officials?",
  "created_utc": 1634860501,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Joe Biden, Donald Trump, Nancy Pelosi, Bernie Sanders, Elizabeth Warren, Mitch McConnell, Janet Yellen, Joe Manchin are all well over 70 years old, and those are just the ones I know off the top of my head. </p>\n\n<p>I think they should all step down for the good of the American people, and no one older than 65 can run for election or be appointed to office. It would get rid of some of the more lazy, complacent, stubborn, politicians who have spent years cultivating relationships with special interest groups. And let’s be honest, these people just don’t have the same mental faculties as someone 15-20 years younger than them, they’re more likely to forget, space out, suffer from illness, and they’re more likely to have traditional ideas that they’re not willing to change, have less motivation and energy to tackle all America’s problems or perform well in their position. </p>\n\n<p>This would also force new faces to take their place, increasing the turnover in office and expose new ideas/perspective. </p>\n\n<p>But let’s be honest, politician in America are incredibly self interested and would never even consider implementing something like this</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/qczez2/should_there_be_an_upper_age_limit_for_government/",
  "subreddit": "TooAfraidToAsk",
  "id": "qczez2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Joe Biden, Donald Trump, Nancy Pelosi, Bernie Sanders, Elizabeth Warren, Mitch\nMcConnell, Janet Yellen, Joe Manchin are all well over 70 years old, and those\nare just the ones I know off the top of my head.\n\nI think they should all step down for the good of the American people, and no\none older than…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ジョー・バイデン、ドナルド・トランプ、ナンシー・ペロシ、バーニー・サンダース、エリザベス・ウォーレン、ミッチ\nマッコンネル、ジャネット・イエレン、ジョー・マンチンなどは70歳を超えていますが、これらは私が知っているだけでも\nこれは私が知っている限りの話です。\n\nアメリカ国民のために、彼らは全員退陣すべきだと思います。\nそれ以上の年齢の人は...",
      "title": "政府関係者の年齢に上限を設けるべきか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Joe Biden, Donald Trump, Nancy Pelosi, Bernie Sanders, Elizabeth Warren, Mitch\n麦康奈尔、珍妮特-耶伦、乔-曼钦都已超过70岁，而这些只是我所知道的。\n这些只是我所知道的那些人。\n\n我认为，为了美国人民的利益，他们都应该下台，而且没有人比\n没有人比...",
      "title": "对政府官员是否应该有一个年龄上限？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Joe Biden, Donald Trump, Nancy Pelosi, Bernie Sanders, Elizabeth Warren, Mitch\n麥康奈爾、珍妮特-耶倫、喬-曼欽都已超過70歲，而這些只是我所知道的。\n這些只是我所知道的那些人。\n\n我認爲，爲了美國人民的利益，他們都應該下臺，而且沒有人比\n沒有人比...",
      "title": "對政府官員是否應該有一個年齡上限？"
    }
  ]
}