{
  "author": "nootherside",
  "original_created_utc": 1631041150,
  "title": "Is my boyfriend gay or is something else wrong?",
  "created_utc": 1631060970,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>F27 and boyfriend M30. \nWe&#39;ve been together almost 8 years, but we stopped having sex around 3 years ago. We only indulge in mutual masterbation. Usually its me giving him head and then him fingering me till I cum. He says he doesn&#39;t enjoy sex anymore because its painful. When he tries to put it in, the foreskin gets pulled back which is painful. Is that a thing? None of my previous boyfriends had this issue. Lately when he&#39;s fingering me and playing with my tits there&#39;s no boner. That&#39;s a mood killer.</p>\n\n<p>We bought lube and condoms to help him with the pain but he still doesn&#39;t seem keen on entering me even though I&#39;ve suggested it multiple times. I feel deprived, unsatisfied and horny.\nMy boyfriend said I can go and get other dick if I need it, since he cannot give it to me. \nI am not interested in other dick at the moment because I can&#39;t do one night stands. It&#39;s not me. I want to be fucked like a ho, by my loving partner. </p>\n\n<p>I am confused and kinda sad. I wonder if he&#39;s a closet gay. Or if I dont interest him anymore. Or if it&#39;s really just the pain. But what about the limp dick and very little sexual initiation from him? Is he asexual? He&#39;s been a porn addict for years. He says he doesn&#39;t watch it anymore. But I think he does. I think he prefers watching porn and doing himself rather than doing me. I am not sure. What do you guys think? </p>\n\n<p>Thanks for reading, I already feel better typing this out.</p>\n</div><!-- SC_ON -->",
  "score": 171,
  "permalink": "/r/TooAfraidToAsk/comments/pjth6e/is_my_boyfriend_gay_or_is_something_else_wrong/",
  "subreddit": "TooAfraidToAsk",
  "id": "pjth6e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "F27 and boyfriend M30. We've been together almost 8 years, but we stopped having\nsex around 3 years ago. We only indulge in mutual masterbation. Usually its me\ngiving him head and then him fingering me till I cum. He says he doesn't enjoy\nsex anymore because its painful. When he tries to put it in,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "F27と彼氏のM30。付き合って8年ほどになりますが、3年ほど前からセックスレスになりました。\n3年ほど前からセックスをしなくなりました。私たちはお互いにマスターベーションをするだけです。通常は、私が彼に頭を与え\n私が彼に頭を差し出し、彼が私がイクまで指を入れてくれます。彼は、もうセックスを楽しめないと言っています。\n彼はもうセックスを楽しめないと言っていますが、それは痛いからです。彼が挿入しようとすると...",
      "title": "私の彼氏はゲイなのか、それとも他に何か問題があるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "F27和男友M30。我们在一起快8年了，但我们不再有\n但我们大约在3年前停止了性生活。我们只沉溺于相互主宰。通常情况下，我\n通常是我给他头，然后他用手指指着我，直到我射精。他说他并不享受\n性生活，因为它很痛苦。当他试图把它放进去时，...",
      "title": "我的男朋友是同性恋还是有其他问题？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "F27和男友M30。我們在一起快8年了，但我們不再有\n但我們大約在3年前停止了性生活。我們只沉溺於相互主宰。通常情況下，我\n通常是我給他頭，然後他用手指指着我，直到我射精。他說他並不享受\n性生活，因爲它很痛苦。當他試圖把它放進去時，...",
      "title": "我的男朋友是同性戀還是有其他問題？"
    }
  ]
}