{
  "author": "mcjanzton",
  "the_new_excerpt": "Bot hates me so here is a link [http://www.bloomberg.com/news]\n\nIn the late 90's we had a similar Tech/Digital stock rally (this is not nearly\nas bad though, so chill, companies are actually destroying the estimates and\nprofits are strong).\n\nBack then it was web page development and internet…",
  "original_created_utc": 1612593606,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "Bot讨厌我，所以这里有一个链接[http://www.bloomberg.com/news]\n\n在90年代末，我们也有过类似的科技股/数码股的上涨（这不是近乎\n虽说不好，但这么寒酸，公司其实是在破坏估计和。\n利润强劲）。)\n\n当年是网页开发和互联网...",
      "title": "关于Dot Com泡沫的故事，一些获利、退出策略和资金与资本的关系。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Bot討厭我，所以這裏有一個鏈接[http://www.bloomberg.com/news]\n\n在90年代末，我們也有過類似的科技股/數碼股的上漲（這不是近乎\n雖說不好，但這麼寒酸，公司其實是在破壞估計和。\n利潤強勁）。)\n\n當年是網頁開發和互聯網...",
      "title": "關於Dot Com泡沫的故事，一些獲利、退出策略和資金與資本的關係。"
    }
  ],
  "title": "A story about the Dot Com bubble, some profit taking, exit strategies and money vs capital",
  "created_utc": 1612600789,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"http://www.bloomberg.com/news\"> Bot hates me so here is a link</a></p>\n\n<p>In the late 90&#39;s we had a similar Tech/Digital stock rally (this is not nearly as bad though, so chill, companies are actually destroying the estimates and profits are strong).</p>\n\n<p>Back then it was web page development and internet providers, now it&#39;s mainly electric vehicles and some parts of tech. </p>\n\n<p>“St0nks” were only going up, up and up. You heard things like - Dude, its a new economy, this is the new normal. This is the future, you can&#39;t use old models to define value. Die all boomers and burn traditional stocks (ok I might be exaggerating on this one). </p>\n\n<p>Anyway, I was a finance major at a prominent university in London, UK. I was destined for greatness and a trainee spot at Deutsche Bank&#39;s analyst desk. My friend - let&#39;s call him Eli, because his name was actually Eli - was a stock genius. </p>\n\n<p>Everybody is a genious in a bull market, you put some money in to a company in IT and BAM, the new Buffett (or Cathie).</p>\n\n<p>Eli was good for about 350kUSD at one point, not bad for a student. Or I should say, 350kUSD nominal value in stocks. Because, its not money until you sell. Eli learned the hard way.</p>\n\n<p>The &quot;dip&quot; came. Eli figured &quot;st0nks only go up&quot; - I&#39;m gonna &quot;buy the dip&quot;. The dip became a slide, then a vortex and finally evolving in to a capital sucking black hole (not an anus ok).</p>\n\n<p>Eli bought and bought, he also had a debt position of about 25% of his portfolio. This increased to 50%. The bank called, Hey Eli - that collateral isn&#39;t so hot anymore, pay up dude. Eli paid up. One year later he had -13kUSD on his account for accrued interest rates and trading fees.</p>\n\n<p>So what&#39;s there to learn. Well, depends on how risk averse you are, but I see a lot of new investors that ask about when and how to take home profits. There is no rule or best practice, but here&#39;s at least an strategy that I&#39;m using myself.</p>\n\n<ol>\n<li>I don&#39;t let a stock grow beyond 20% of my portolio, if it does I automatically start scaling back profits and weight to other, new opportunities. </li>\n</ol>\n\n<p>Compound that interest, bitch.</p>\n\n<ol>\n<li><p>I always keep a 10-15% cash position so I can take advantage on dips or other opportunities. This capital has had a ridiculous payback over the years. This is not money, this is capital. I have a savings account with 3 months salary. That’s money. </p></li>\n<li><p>For every 20% growth I take home for example 20% of the profit. So in G-ME for example I started buying early and by $90 I only had profits invested. By 300 I had sold about 2/3 and on the way down I dropped the last stocks at 115. </p></li>\n</ol>\n\n<p>So let’s say a stock grows from 100 to 120. I take back 4. Then it goes to 140, I take back another 8 so now I have taken 12 total. </p>\n\n<p>Obviously there is some flexibility here, but use it for inspiration. For more secure stocks you may wanna hold on more and longer, but for me it’s a lot about maintaining that cash position.</p>\n\n<p>So what do I do with my profits? Well, I do a few things. </p>\n\n<ol>\n<li>I reinvest them in to other stocks, so I make sure I have a short list of alternatives at all times.  For example, my G-ME winnings (yes it was a casino) paid for 300 PayPal stocks at $231. They’re now up 15%. </li>\n</ol>\n\n<p>Compound that interest, bitch.</p>\n\n<ol>\n<li><p>I put them in the cash position so I can be opportunistic (but still max 15%). Life saver in March, pure rocket fuel baby. </p></li>\n<li><p>I buy my wife or kids presents, I get a nice Rolex or refurbish the house.  I turn it in to money. I have money so I can spend it, use it. </p></li>\n</ol>\n\n<p>Moral of the story or TLDR;</p>\n\n<p>Make money, you probably won&#39;t see another opportunity like the one of the past 6-10 months. Its not coming back for a while. </p>\n\n<p>Don&#39;t step out of the market, pick your stocks wisely, keep some cash to pounce on some disappointing earning calls or dips and remember: IT IS NOT MONEY UNTIL YOU SELL.</p>\n\n<p>Disclaimer 2: I am a licensed financial advisor, but do your own research. </p>\n\n<p>PS Eli went on to be a very successful entrepreneur and has started a few companies. I believe one of them is going to IPO soon DS</p>\n</div><!-- SC_ON -->",
  "score": 4315,
  "permalink": "/r/investing/comments/ldrsgq/a_story_about_the_dot_com_bubble_some_profit/",
  "subreddit": "investing",
  "id": "ldrsgq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199852
}