{
  "author": "DivineEu",
  "the_new_excerpt": "HATE THE PUMP AND DUMP GROUPS DON'T HATE THE VICTIMIZED COIN!\n\n\n\nIll start by saying I don't hate Doge, honestly I love Doge, this coin had a\npurpose to become a great meme and he fulfilled it successfully.\n\n\n\nBut I would never never think about investing hefty amounts of money in doge,\nits a shame…",
  "original_created_utc": 1612172141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "讨厌PUMP和DUMP集团不讨厌受害币!\n\n\n\n首先我要说的是，我不讨厌Doge，说实话，我喜欢Doge，这枚硬币有一个。\n成为一个伟大的meme的目的，他成功地完成了它。\n\n\n\n但我永远不会想到在狗哥身上投资巨额资金。\n真可惜",
      "title": "讨厌抽水团和甩水团不要讨厌被害币! *文字墙*"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "討厭PUMP和DUMP集團不討厭受害幣!\n\n\n\n首先我要說的是，我不討厭Doge，說實話，我喜歡Doge，這枚硬幣有一個。\n成爲一個偉大的meme的目的，他成功地完成了它。\n\n\n\n但我永遠不會想到在狗哥身上投資鉅額資金。\n真可惜",
      "title": "討厭抽水團和甩水團不要討厭被害幣! *文字牆*"
    }
  ],
  "title": "Hate the Pump and Dump Groups Don't hate the Victimized coin! *Wall of Text*",
  "created_utc": 1612190037,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>Hate the Pump and Dump Groups Don&#39;t hate the Victimized coin!</h1>\n\n<p>&#x200B;</p>\n\n<p>Ill start by saying I don&#39;t <strong>hate</strong> Doge, honestly I <strong>love</strong> Doge, this coin had a purpose to become a great meme and he fulfilled it successfully.</p>\n\n<p>&#x200B;</p>\n\n<p>But I would <strong>never never</strong> think about investing hefty amounts of <strong>money</strong> in <strong>doge</strong>, its a shame that <strong>doge</strong> was a targeted by that <strong>pump and dump</strong> groups and got to the state he is in today.</p>\n\n<p>seems like Many people mistake Meme coins purpose and think their only use is to <strong>Pump and Dump.</strong></p>\n\n<p><strong>that not</strong> entirely true, I Believe memes coins are great way to have fun with it and introduce newcomers with funny coins that don&#39;t really worth that much just to show them the way of crypto.</p>\n\n<p>Let&#39;s take a look at another Meme coincalled &quot;Banano&quot; :</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4lqtlub43ue61.png?width=200&amp;format=png&amp;auto=webp&amp;s=f34e259af7ec3314e43cc3cc2ddb18579760ac24\">https://preview.redd.it/4lqtlub43ue61.png?width=200&amp;format=png&amp;auto=webp&amp;s=f34e259af7ec3314e43cc3cc2ddb18579760ac24</a></p>\n\n<p>&#x200B;</p>\n\n<p>It&#39;s a simple meme coin that you can get in a Couple of ways :</p>\n\n<ol>\n<li>participating in Banano reddit or Discord and get tipped or win a giveaway.</li>\n<li> Folding@Home-  By folding at home you can &quot;Mine&quot; Banano by renting your GPU and CPU power to True Medical Research.</li>\n</ol>\n\n<p>with a low value of each Banano coin you can truly have fun with it by accumulating some , giving away some or contribution to Medical Research,</p>\n\n<p>and that&#39;s the purpose of a Meme coin <strong>in my opinion- Having fun.</strong></p>\n\n<p>People should understand that Investing Hefty amounts of money in meme coins isn&#39;t a wise choice!</p>\n\n<p>but people can do whatever they want, if you decide to invest in something you should DYOR and take full responsibilities of the outcome.</p>\n\n<p>&#x200B;</p>\n\n<h1>Fight against the Pump and Dump Groups</h1>\n\n<p>Back to our Topic, Don&#39;t Hate the Coins that are being Pumped and Dumped, most of them probably being victimized by Pump and Dump groups.</p>\n\n<p><strong>Hate The Pump and Dump groups</strong>, because these groups can move from Coin to Coin every single day and create chaos that isn&#39;t even connected to a certain coin.</p>\n\n<p>For example many people in this sub like LTO, Fantom or more low Marketcap coins, heck this Pump and Dump groups are now targeting XRP so its not just Low Market Cap coins, lets think about XLM, Ada, VET and more.</p>\n\n<p>&#x200B;</p>\n\n<p>How would you react if a Pump and Dump groups will decide to pump of your favorite coin?</p>\n\n<p>Would you turn your anger towards the Developers or the managers of that coin? </p>\n\n<p>You Should turn that anger to that Pump and Dump groups that will bring chaos to a legit coin.</p>\n\n<p>&#x200B;</p>\n\n<p>So I&#39;m asking you one thing don&#39;t turn your hate towards a certain coin, turn your anger against these groups, don&#39;t Join them, Downvotes their posts, report them to the admins and try to prevent people from joining these groups.</p>\n\n<h1>Only together we can stop it!</h1>\n\n<p>&#x200B;</p>\n\n<p>Thanks you for coming to my TED talk, feel free to leave your comments below and discuss it.</p>\n</div><!-- SC_ON -->",
  "score": 411,
  "permalink": "/r/CryptoCurrency/comments/l9zfyk/hate_the_pump_and_dump_groups_dont_hate_the/",
  "subreddit": "CryptoCurrency",
  "id": "l9zfyk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518530867
}