{
  "author": "Innit4theTech",
  "original_created_utc": 1632075338,
  "title": "Why is my bank concerned about me losing money buying crypto but don’t mind me losing my money gambling?",
  "created_utc": 1632080094,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I got a message from my bank a month ago saying something like, “investing in crypto is not safe and it’s dangerous”, I have stopped using that bank now.</p>\n\n<p>This is actually hilarious, because as I like to bet some money on sports (just a little bit for fun) and I’ve never received a message about the dangers of gambling.</p>\n\n<p>There has been so many cases of lives being ruined by gambling and if the bank want to advise us about something, they should advise us about not gambling instead of investing crypto..</p>\n\n<p>In the end, I do understand their point. They are probably scared shaking about crypto’s threat to their banking system.</p>\n</div><!-- SC_ON -->",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/prd97u/why_is_my_bank_concerned_about_me_losing_money/",
  "subreddit": "CryptoCurrency",
  "id": "prd97u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I got a message from my bank a month ago saying something like, “investing in\ncrypto is not safe and it’s dangerous”, I have stopped using that bank now.\n\nThis is actually hilarious, because as I like to bet some money on sports (just\na little bit for fun) and I’ve never received a message about the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1ヶ月前に銀行から「暗号への投資は安全ではなく、危険である」というようなメッセージを受け取りました。\nというようなメッセージを受け取ったので、その銀行を使うのをやめました。\n\n私はスポーツにお金を賭けるのが好きなので、これはとても面白いことです。\nなぜなら、私はスポーツにお金を賭けるのが好きで（遊びで少しだけ）、これまでにそのようなメッセージを受け取ったことがないからです...",
      "title": "なぜ私の銀行は、私が暗号を買ってお金を失うことを心配しているのに、私がギャンブルでお金を失うことは気にしないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一个月前，我的银行给我发了一条信息，说什么 \"投资加密货币不安全，很危险\"。\n我现在已经停止使用该银行了。\n\n这其实是很搞笑的，因为我喜欢在体育上投注一些钱（只是\n因为我喜欢在体育上投注一些钱（只是为了好玩），而且我从来没有收到过关于加密货币的信息。",
      "title": "为什么我的银行担心我买加密货币会赔钱，却不介意我赌博赔钱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一個月前，我的銀行給我發了一條信息，說什麼 \"投資加密貨幣不安全，很危險\"。\n我現在已經停止使用該銀行了。\n\n這其實是很搞笑的，因爲我喜歡在體育上投注一些錢（只是\n因爲我喜歡在體育上投注一些錢（只是爲了好玩），而且我從來沒有收到過關於加密貨幣的信息。",
      "title": "爲什麼我的銀行擔心我買加密貨幣會賠錢，卻不介意我賭博賠錢？"
    }
  ]
}