{
  "author": "gswizzle911",
  "the_new_excerpt": "So I have landed a solid job in my career and finally have money to invest in.\nI’m going to be playing with stocks alittle, but I’m also planning to build a\nsolid nest egg out of a long term index-based fund. After tons of research, I’ve\nnarrowed down my top 3 to be (in order):\n\nVTI (Vanguard Total…",
  "original_created_utc": 1615005624,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我在事业上找到了一份稳定的工作，终于有了投资的钱。\n我打算玩股票一点，但我也打算建立一个。\n从长期指数型基金中获得坚实的养老金。经过大量的研究，我已经\n缩小了我的前三名是（按顺序）。\n\nVTI (Vanguard Total... )",
      "title": "长期应该选择哪只ETF？(10-15+年)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我在事業上找到了一份穩定的工作，終於有了投資的錢。\n我打算玩股票一點，但我也打算建立一個。\n從長期指數型基金中獲得堅實的養老金。經過大量的研究，我已經\n縮小了我的前三名是（按順序）。\n\nVTI (Vanguard Total... )",
      "title": "長期應該選擇哪隻ETF？(10-15+年)"
    }
  ],
  "title": "Which ETF should I choose for long term? (10-15+ years)",
  "created_utc": 1615085914,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I have landed a solid job in my career and finally have money to invest in. I’m going to be playing with stocks alittle, but I’m also planning to build a solid nest egg out of a long term index-based fund. After tons of research, I’ve narrowed down my top 3 to be (in order):</p>\n\n<p>VTI (Vanguard Total Market)</p>\n\n<p>IVV (iShares S&amp;P 500)</p>\n\n<p>VOO (Vanguard S&amp;P 500)</p>\n\n<p>My main criteria were low expense ratios (these are all at 0.03%), stability, and longevity. I like VTI more than VOO because VOO wasn’t started until 2010, so it’s lifetime yield isn’t a good comparison since it missed the 08-09 crash. VTI has slightly better gains than IVV over its lifetime, but IVV has had better short-term growth. IVV and VOO also had better dividend yields.</p>\n\n<p>My brain is honestly fried going over all the numbers and I just want to know if it really matters all that much which of the three I choose. Is VTI a good investment over the other two? Is there a better long-term fund I haven’t listed? Any advice is welcome, I’m just trying to make the smart move.</p>\n\n<p>Edit: I’ve gotten great advice so far, thank you very much, but people need to stop spamming Ark etfs. You clearly didn’t read the low expense ratio part. No chance am I paying 0.75% for such a volatile etf. 0.10% is the highest I’m willing to go.</p>\n</div><!-- SC_ON -->",
  "score": 51,
  "permalink": "/r/stocks/comments/lyu64n/which_etf_should_i_choose_for_long_term_1015_years/",
  "subreddit": "stocks",
  "id": "lyu64n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542576958
}