{
  "author": "MalletSwinging",
  "original_created_utc": 1645672484,
  "title": "This Russia shit is out of control. Any Russians in here that can answer a few questions about the mood / sentiment in Russia right now and how it relates to crypto?",
  "created_utc": 1645699387,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve all seen how this news is affecting crypto - as Ukraine keeps getting pushed further and further toward being conquered by Putin all of our favorite assets are being driven down and we are all losing our asses unless we had the foresight to short a month ago.&lt;/p&gt;\n\n&lt;p&gt;Here are a few questions I would like to ask any Russians on this sub:&lt;/p&gt;\n\n&lt;p&gt;1) What is the overall sentiment toward this invasion in Russia right now?&lt;/p&gt;\n\n&lt;p&gt;2) What percentage of people you know have (or had I guess, based on the legality of it now) crypto in Russia?&lt;/p&gt;\n\n&lt;p&gt;3) Do you think most Russians actually approve of Putin or does he not actually have a 100% approval rating like the Kremlin suggests? Does crypto factor into this for you?&lt;/p&gt;\n\n&lt;p&gt;4) In your opinion, what would the best outcome for Russia be in this situation?&lt;/p&gt;\n\n&lt;p&gt;5) If you could move to any country on the planet (including staying in Russia) where would you go? Would crypto factor into your decision?&lt;/p&gt;\n\n&lt;p&gt;I realize you might fear for your lives in answering these questions honestly but I am genuinely curious and if you are brave enough to answer honestly you might get a few moons as a tip.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "permalink": "/r/CryptoCurrency/comments/t009kf/this_russia_shit_is_out_of_control_any_russians/",
  "subreddit": "CryptoCurrency",
  "id": "t009kf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We've all seen how this news is affecting crypto - as Ukraine keeps getting\npushed further and further toward being conquered by Putin all of our favorite\nassets are being driven down and we are all losing our asses unless we had the\nforesight to short a month ago.\n\nHere are a few questions I would…"
}