{
  "author": "Arthur_Rex_uel_Dux",
  "the_new_excerpt": "There have been a few films about me over the years and, to be brutally honest,\nI’ve been a bit disappointed by them all, and there certainly haven’t been any\nthat, for want of a better phrase, ‘get me’. However, Medraut recommended this\none to me, as apparently the filmmakers went to a lot of…",
  "original_created_utc": 1617296395,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这些年有几部关于我的电影，说实话。\n我对他们都有点失望，当然也没有任何的\n我想用一个更好的词来形容，就是 \"得到我\"。然而，梅德劳特建议\n一个给我，因为显然电影制作人去了很多... ...",
      "title": "[评论]亚瑟王（2004）：Hoc电影 est frustrabor。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這些年有幾部關於我的電影，說實話。\n我對他們都有點失望，當然也沒有任何的\n我想用一個更好的詞來形容，就是 \"得到我\"。然而，梅德勞特建議\n一個給我，因爲顯然電影製作人去了很多... ...",
      "title": "[評論]亞瑟王（2004）：Hoc電影 est frustrabor。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "これまでに私を題材にした映画はいくつかありますが、正直に言うと\n正直なところ、私はそれらすべてに少し失望しています。\n言い方は悪いですが、「私を理解してくれる」映画はありませんでした。しかし、メドラウトがこの作品を勧めてくれました。\nこの作品を勧めてくれたのは、どうやら映画製作者が多くのことを...",
      "title": "レビュー】キング・アーサー（2004）：Hoc movie est frustrabor"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "これまでに私を題材にした映画はいくつかありますが、正直に言うと\n正直なところ、私はそれらすべてに少し失望しています。\n言い方は悪いですが、「私を理解してくれる」映画はありませんでした。しかし、メドラウトがこの作品を勧めてくれました。\nこの作品を勧めてくれたのは、どうやら映画製作者が多くのことを...",
      "title": "レビュー】キング・アーサー（2004）：Hoc movie est frustrabor"
    }
  ],
  "title": "[Review] King Arthur (2004): Hoc movie est frustrabor",
  "created_utc": 1617333330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There have been a few films about me over the years and, to be brutally honest, I’ve been a bit disappointed by them all, and there certainly haven’t been any that, for want of a better phrase, ‘get me’. However, Medraut recommended this one to me, as apparently the filmmakers went to a lot of effort to really capture the reality of my life. He’s a good friend Medraut. Or is it enemy? Well, one of the two. Anyway, I’m sorry to say that <em>King Arthur</em> (2004) is riddled with inaccuracies.</p>\n\n<p>First off, the very title contains an error. I was not, in fact, a king. Or was I? I forget. The film is set in AD 410, but I actually lived in the early sixth century, I think. Speaking of the setting, I was not, as the film suggests, active in the region of Hadrian’s Wall. I was actually fighting battles in Linnius, or possibly Dumnonia, or Alt Clut now I come to think of it? If I’m honest, my memory’s a bit hazy. At the start of the film, the fictional me meets with Bishop Germanus, whose actual visit to Britain took place around 429. And then again 10 years later, unless it was just the one visit? I’m such a scatterbrain. In any case, the central plot of the film revolves around an incursion of Saxons in northern Britain. In reality, Anglo-Saxons did not invade Britain north of Hadrian’s Wall, apart from the ones who did, of course.</p>\n\n<p>One thing the film does get right is portraying me as a cavalry commander. We Britons use a lot of cavalry in battle, possibly. Whereas the Saxons invariably fight on foot, except when they don’t, that is. Another thing they get spot on is by having me as the British leader at the Battle of Badon Hill. That was definitely me. Or was it Ambrosius? Hmm, not sure on that one. You know, sometimes it’s a bit hard to remember the specifics of whether you were in Caerleon in 489 or 513, or whether you actually went to Chester. Or York? I’ll check my diary. Damn! I just remembered I’m an illiterate Celtic chieftain who received a classical Latin education at the school in Corinium. Okay, I’ve checked now, and the battle at Chester took place in 616. At least one did, we might have fought a couple actually. I’ll ask Urien, he’s from that part of the world, or at the very least he might be.</p>\n\n<p>All I’ll say is that films like this are very damaging to my mental health. Sometimes I almost feel like I’m not there…</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/mhzpuj/review_king_arthur_2004_hoc_movie_est_frustrabor/",
  "subreddit": "AskHistorians",
  "id": "mhzpuj",
  "is_self": true,
  "media": null,
  "is_video": false
}