{
  "author": "LifeReboot___",
  "original_created_utc": 1649310991,
  "title": "People who made enough profit for their entire life, what now?",
  "created_utc": 1649335099,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last year, I have made enough of profit from leveraging my exposure to ETH with DeFI, I made profit by over-leveraging and taking extreme risk, which I&amp;#39;d like to call it gamble instead of investing, just that I was lucky enough to made profit from it.&lt;/p&gt;\n\n&lt;p&gt;(Yes, before of that I did spend a lot of time reading technical analysis book, reading blog posts, watching YouTube videos, but none of that really matter, it&amp;#39;s mostly just luck.)&lt;/p&gt;\n\n&lt;p&gt;The smartest thing I&amp;#39;ve done after making these profit is to quickly lock them into ETH 2.0 validator, so I keep myself away from gambling them away in market, and all my validators generate much more than I need for my monthly expenses.&lt;/p&gt;\n\n&lt;p&gt;I thought I&amp;#39;m going to live a happy life after that enjoying all the money without having to work again, but one year later I find myself depressed, became a heavy smoker and drink quite often.&lt;/p&gt;\n\n&lt;p&gt;The reason is because I was a guy with big dreams, I wanted to have some achievement that I&amp;#39;m proud to tell my family and friends, not how lucky I made some gambling money, but after getting these money, I&amp;#39;m too afraid to make another move anymore, which made me feel like I&amp;#39;m stuck.&lt;/p&gt;\n\n&lt;p&gt;Stuck because I do not have the experience or skills to get a job with rewarding that I feel like worth my time, nor want to work for anything less rewarding, especially when my validator income is like 5x~10x the salary of the job I can get.&lt;/p&gt;\n\n&lt;p&gt;And I obviously doesn&amp;#39;t want to give up my wealth or take any more extreme risk with them, I believe I am not the only one feel the same, any thoughts?&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT:&lt;/strong&gt; Thanks for all the response, didn&amp;#39;t expect to receive so many replies, I really appreciate anyone who gave their advice, I would be going through one by one to read each of them.&lt;/p&gt;\n\n&lt;p&gt;I understand that I will have to make some adjustment to my mentality, also happy someone recommended books, I do love to read books to learn different perspective to life.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;EDIT2:&lt;/strong&gt; A lot of people have recommended travel, I will probably do that soon, the only thing holding me back is knowing that I am most likely going to be travel alone, and I&amp;#39;m kinda introvert and socially awkward irl.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 358,
  "permalink": "/r/CryptoCurrency/comments/ty6bnk/people_who_made_enough_profit_for_their_entire/",
  "subreddit": "CryptoCurrency",
  "id": "ty6bnk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Last year, I have made enough of profit from leveraging my exposure to ETH with\nDeFI, I made profit by over-leveraging and taking extreme risk, which I'd like\nto call it gamble instead of investing, just that I was lucky enough to made\nprofit from it.\n\n(Yes, before of that I did spend a lot of time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨年、私はETHにレバレッジをかけ、十分な利益を得ました。\nDeFIでは、レバレッジをかけすぎて、極端なリスクをとって利益を得ました。\n投資ではなくギャンブルと呼ぶべきもので、ただ、運良く儲けられたというだけです。\nを得ることができました。\n\n(そう、その前に私は多くの時間を費やしました...)",
      "title": "一生分の利益を出した人たち、今度は何？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "去年，我通过利用我在ETH上的风险敞口，赚取了足够的利润。\nDeFI，我通过过度杠杆化和承担极端风险而获利。\n我想把它称为赌博而不是投资，只是我很幸运地从中赚取了\n盈利。\n\n(是的，在这之前我确实花了很多时间...",
      "title": "赚够了一辈子的利润的人，现在怎么办？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "去年，我通過利用我在ETH上的風險敞口，賺取了足夠的利潤。\nDeFI，我通過過度槓桿化和承擔極端風險而獲利。\n我想把它稱爲賭博而不是投資，只是我很幸運地從中賺取了\n盈利。\n\n(是的，在這之前我確實花了很多時間...",
      "title": "賺夠了一輩子的利潤的人，現在怎麼辦？"
    }
  ]
}