{
  "author": "roberthonker",
  "the_new_excerpt": "Too many people treat this like a casino or like the latest r/wallstreetbets\n[/r/wallstreetbets] stock play. Crypto is a long game. People that bought the\npeak in 2017 had to wait three years to break even, it's not always a quick\nprocess.\n\nDon't get me wrong, if you buy crypto you will make a…",
  "original_created_utc": 1623949000,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あまりにも多くの人が、これをカジノのように、あるいは最新のr/wallstreetbetsのように扱っています。\n[/r/wallstreetbets]のストックプレイのようなものです。暗号は長期的なゲームです。2017年のピークを買った人は\n2017年のピーク時に買った人は、損益分岐点に達するまで3年待たなければならず、必ずしも迅速なプロセスではありません。\nのプロセスです。\n\n誤解しないでほしいのは、暗号を買えば儲かる...",
      "title": "暗号は一攫千金を狙うものではありません。お金を稼ぎたいのであれば、しばらくの間、保有する覚悟が必要です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "太多的人把这当做一个赌场，或者像最新的r/wallstreetbets一样。\n[/r/wallstreetbets] 股票游戏。隐形货币是一个长期游戏。那些在2017年的高峰期买入的人\n的人不得不等待三年才能实现收支平衡，这并不总是一个快速的\n过程。\n\n不要误会我的意思，如果你买了加密货币，你会赚到...",
      "title": "加密货币并不是一个快速致富的计划。如果你想赚钱，要准备好持有一段时间。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "太多的人把這當做一個賭場，或者像最新的r/wallstreetbets一樣。\n[/r/wallstreetbets] 股票遊戲。隱形貨幣是一個長期遊戲。那些在2017年的高峯期買入的人\n的人不得不等待三年才能實現收支平衡，這並不總是一個快速的\n過程。\n\n不要誤會我的意思，如果你買了加密貨幣，你會賺到...",
      "title": "加密貨幣並不是一個快速致富的計劃。如果你想賺錢，要準備好持有一段時間。"
    }
  ],
  "title": "Crypto isn't a get rich quick scheme. If you want to make money, be prepared to hold for a while.",
  "created_utc": 1623969198,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Too many people treat this like a casino or like the latest <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> stock play. Crypto is a long game. People that bought the peak in 2017 had to wait three years to break even, it&#39;s not always a quick process.</p>\n\n<p>Don&#39;t get me wrong, if you buy crypto you will make a significant amount of money, you just have to hold long enough. 5+ years should be your timeframe.</p>\n\n<p><strong>Big gains in crypto require diamond balls and years of holding.</strong></p>\n</div><!-- SC_ON -->",
  "score": 345,
  "permalink": "/r/CryptoCurrency/comments/o21xot/crypto_isnt_a_get_rich_quick_scheme_if_you_want/",
  "subreddit": "CryptoCurrency",
  "id": "o21xot",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009741221
}