{
  "author": "sgebb",
  "the_new_excerpt": "As one of the many that was a part of the 2018 crash, don't trust anyone when\nthey tell you to buy the dip, that bots are dumping the prices to accumulate,\nthat paypal is involved so there's no way it'll ever crash, that people sold to\nbuy gifts for valentines day or chinese new year. At best these…",
  "original_created_utc": 1613384837,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为2018年车祸中的一员，不要相信任何人，当。\n他们告诉你买跌，机器人在抛售价格积累。\n支付宝参与，所以有没有办法 它会永远崩溃，人们卖给\n买礼物的情人节或中国新年。最好这些...",
      "title": "不要再叫人买 \"沾 \"了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲2018年車禍中的一員，不要相信任何人，當。\n他們告訴你買跌，機器人在拋售價格積累。\n支付寶參與，所以有沒有辦法 它會永遠崩潰，人們賣給\n買禮物的情人節或中國新年。最好這些...",
      "title": "不要再叫人買 \"沾 \"了。"
    }
  ],
  "title": "Stop telling people to buy the \"dip\"",
  "created_utc": 1613399907,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As one of the many that was a part of the 2018 crash, don&#39;t trust anyone when they tell you to buy the dip, that bots are dumping the prices to accumulate, that paypal is involved so there&#39;s no way it&#39;ll ever crash, that people sold to buy gifts for valentines day or chinese new year. At best these people genuinely believe this is true, at worst they are trying to increase demand to drive up the price so they can sell, but no matter what they have no way of knowing if btc is overpriced or not.</p>\n\n<p>We just had a MINOR correction from ~50k btc down to ~47k. This may be just a small dip on the way to the moon, but it is definitely not the fire sale you guys are looking for to dump all your savings in. Crypto is super volatile and irrational, it&#39;s not like stocks where the market value is at least in part rooted in actual financial data, in crypto a coin can double in value if someone makes a well written post or a funny meme on <a href=\"/r/cc\">/r/cc</a>.</p>\n\n<p>I&#39;m not claiming to know if btc is going up or down, I&#39;m just saying, invest carefully and take profits when they have a meaningful impact on your life</p>\n</div><!-- SC_ON -->",
  "score": 586,
  "permalink": "/r/CryptoCurrency/comments/lkayw7/stop_telling_people_to_buy_the_dip/",
  "subreddit": "CryptoCurrency",
  "id": "lkayw7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728617849
}