{
  "author": "SaintShrink",
  "the_new_excerpt": "In the modern day, obviously, if the president found his way into a camp in the\nmiddle east, he's well known enough that if someone was impersonating him, it's\na Mystique situation, as opposed to a random guy claiming to be him.\n\nThis question actually came from an episode of the West Wing, when…",
  "original_created_utc": 1623076445,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現代では、明らかに、大統領が中東のキャンプに入り込んだとしたら\n彼は十分に知られているので、もし誰かが彼になりすましていたとしたら、それはミスティックな状況です。\n誰かが彼になりすましているとしたら、それはミスティークのような状況であり、無作為に彼を名乗っているわけではありません。\n\nこの質問は、実際に「ウエスト・ウィング」のエピソードから来ています。",
      "title": "時は14世紀のヨーロッパ、戦争が激化している。私は軍の駐屯地に入り、中世版の司令官のテントに押し入り、自分が王様であると主張して命令を叫び始めた。私が本当に王様かどうか、私の命令に従うべきかどうかを確認するセキュリティは確保されているのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在现代，很明显，如果总统发现他进入中东的一个营地，他是众所周知的，如果有人冒充他，就会有很多人知道。\n中东地区，他的知名度很高，如果有人冒充他，这就是\n这是一个神秘的情况，而不是一个随机的人声称是他。\n\n这个问题实际上来自《西翼》的一集，当时...",
      "title": "这是14世纪的欧洲，战争正在肆虐。我走进一个军营，冲进中世纪版本的指挥官的帐篷，开始发号施令，声称自己是他们的领主。他们是否有安保措施来验证我是否真的是国王，以及是否应该遵守我的命令？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在現代，很明顯，如果總統發現他進入中東的一個營地，他是衆所周知的，如果有人冒充他，就會有很多人知道。\n中東地區，他的知名度很高，如果有人冒充他，這就是\n這是一個神祕的情況，而不是一個隨機的人聲稱是他。\n\n這個問題實際上來自《西翼》的一集，當時...",
      "title": "這是14世紀的歐洲，戰爭正在肆虐。我走進一個軍營，衝進中世紀版本的指揮官的帳篷，開始發號施令，聲稱自己是他們的領主。他們是否有安保措施來驗證我是否真的是國王，以及是否應該遵守我的命令？"
    }
  ],
  "title": "It's Europe in the 14th century and war is raging. I walk into a military camp, storm into the medieval version of a CO's tent, and start barking orders, claiming to be their liege. Do they have security in place to verify if I am in fact the king, and whether or not my orders should be followed?",
  "created_utc": 1623141113,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the modern day, obviously, if the president found his way into a camp in the middle east, he&#39;s well known enough that if someone was impersonating him, it&#39;s a Mystique situation, as opposed to a random guy claiming to be him. </p>\n\n<p>This question actually came from an episode of the West Wing, when President Bartlet gives an order to the Chairman of the Joint Chiefs and the chairman relays they order over the phone using what is presumably a specific code reading to verify his identity. </p>\n\n<p>In medieval Europe, prior to universal recognition of the appearance of the leader, was there a similar way of identifying that the orders were coming from the head honcho? Would every platoon leader know what the king looks like and be able to spot my fakery? Would it depend on my dress, my accent, my comportment? Did I have a code phrase I used when giving orders? Did they have to be written and sealed with wax? Could I conceivably get away with this cockamamie plan?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/nue09r/its_europe_in_the_14th_century_and_war_is_raging/",
  "subreddit": "AskHistorians",
  "id": "nue09r",
  "is_self": true,
  "media": null,
  "is_video": false
}