{
  "author": "crypto_grandma",
  "original_created_utc": 1634549136,
  "title": "We are about the same amount of days since the 2020 halving as when Bitcoin reached its December 2017 all time high after the 2016 halving",
  "created_utc": 1634614388,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The 2016 halving occurred on 10th July. Bitcoin reached its ATH for that cycle (of a little under $20k) on December 17th 2017. That was 17 months and 7 days after the halving.</p>\n\n<p>The most recent having occurred on 11th May 2020. That was 17 months and 7 days ago.</p>\n\n<p>So we are now at roughly the same stage of the 4 year halving cycle as when Bitcoin reached its previous peak (I say roughly as the halving doesn&#39;t occur exactly every 4 years).</p>\n\n<p>Does this mean we should be seeing Bitcoin&#39;s peak right now? Well, Bitcoin hit its ATH in November 2013 exactly 12 months after the 2012 halving. So the ATH that came after the 2016 halving took about 5 months longer to reach than the ATH that came after the 2012 halving, so one theory is that each cycle from halving to ATH becomes longer. But it&#39;s just that- a theory.</p>\n\n<p>I&#39;m not much of a TA person (as you can probably tell by my lack of TA terms and diagrams with lines on them). I don&#39;t really look at charts. But I am interested in the having cycle and thought I&#39;d share roughly where we currently are in this cycle compared to the previous ones, in case some of you out there find it interesting too.</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qaj4wz/we_are_about_the_same_amount_of_days_since_the/",
  "subreddit": "CryptoCurrency",
  "id": "qaj4wz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The 2016 halving occurred on 10th July. Bitcoin reached its ATH for that cycle\n(of a little under $20k) on December 17th 2017. That was 17 months and 7 days\nafter the halving.\n\nThe most recent having occurred on 11th May 2020. That was 17 months and 7 days\nago.\n\nSo we are now at roughly the same…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2016年の半減期は7月10日に発生しました。ビットコインがそのサイクルのATHに達したのは\n(20kドル弱)に達したのは2017年12月17日。半分になってから17ヶ月と7日後のことです。\n半分になってからです。\n\n最新の having は 2020 年 5 月 11 日に発生しました。それは17ヶ月と7日前\n前です。\n\nつまり、ほぼ同じ時期に...",
      "title": "2020年の半減期からの日数は、ビットコインが2016年の半減期を経て2017年12月の史上最高値に達した時と同じくらいです"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "2016年的减半发生在7月10日。比特币在该周期内达到其ATH\n(略低于2万美元)于2017年12月17日。那是17个月零7天\n在减半之后。\n\n最近的一次发生在2020年5月11日。那是17个月零7天\n前。\n\n因此，我们现在处于大致相同的...",
      "title": "我们在2020年减半后的天数与比特币在2016年减半后达到2017年12月的历史高点时差不多。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "2016年的減半發生在7月10日。比特幣在該週期內達到其ATH\n(略低於2萬美元)於2017年12月17日。那是17個月零7天\n在減半之後。\n\n最近的一次發生在2020年5月11日。那是17個月零7天\n前。\n\n因此，我們現在處於大致相同的...",
      "title": "我們在2020年減半後的天數與比特幣在2016年減半後達到2017年12月的歷史高點時差不多。"
    }
  ]
}