{
  "author": "HugoWullAMA",
  "original_created_utc": 1643593023,
  "title": "\"Jesus Christ Superstar\" was the number one selling album in 1971. It is an anomaly among best-selling albums of that year, and outperformed many progressive rock albums that are better-regarded today. How did this album become a commercial success *before* the premier of the musical?",
  "created_utc": 1643637672,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Simply put, it&amp;#39;s a weird album, even for its time. It was the best-selling album of the year, and Billboard&amp;#39;s #1 album; among other hit albums, it&amp;#39;s fairly unique. The Contemporary Christian Music scene hadn&amp;#39;t really taken off yet at that time. Progressive rock bands such as King Crimson, Yes, Emerson Lake and Palmer, and Genesis would release albums around this time that didn&amp;#39;t reach gold until years later; Jethro Tull, Pink Floyd, and Deep Purple would have releases with similar sales numbers, that didn&amp;#39;t chart nearly as high.&lt;/p&gt;\n\n&lt;p&gt;Meanwhile, &amp;#39;Jesus Christ Superstar&amp;#39; was considered a long-shot when it was recorded. Weber and Rice released the album because they were unsuccessful in producing it into a stage show. However, the album became a huge success, even before it earned the name-recognition of the popular show. All-in-all, it seems like a real underdog. Why did this particular album see more success than other stylistically similar albums, and how did it become a pop hit from out of the stylistic left-field?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/sgostg/jesus_christ_superstar_was_the_number_one_selling/",
  "subreddit": "AskHistorians",
  "id": "sgostg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Simply put, it's a weird album, even for its time. It was the best-selling album\nof the year, and Billboard's #1 album; among other hit albums, it's fairly\nunique. The Contemporary Christian Music scene hadn't really taken off yet at\nthat time. Progressive rock bands such as King Crimson, Yes,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "簡単に言うと、当時としても変なアルバムなんです。最も売れたアルバムであり\nその年のビルボード1位のアルバムで、他のヒットアルバムの中では、かなり\nユニークです。現代キリスト教音楽のシーンは、まだ本格的な普及には至っていませんでした。\n当時は キング・クリムゾン、イエス、...といったプログレッシブ・ロック・バンドが活躍していた。",
      "title": "\"ジーザス・クライスト・スーパースター \"は、1971年のアルバム売り上げ1位である。この年のベストセラー・アルバムの中では異例で、現在評価されている多くのプログレッシブ・ロック・アルバムを凌駕している。ミュージカル初演前に、なぜこのアルバムが商業的に成功したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "简单地说，这是一张奇怪的专辑，即使是在它的时代。它是当年最畅销的专辑\n它是当年最畅销的专辑，也是公告牌排名第一的专辑；在其他热门专辑中，它是相当\n独一无二。当代基督教音乐界在当时还没有真正起飞。\n那时候，当代基督教音乐界还没有真正起飞。前卫摇滚乐队，如克里姆森国王（King Crimson）、是的（Yes），...",
      "title": "\"耶稣基督超级明星 \"是1971年销量第一的专辑。在当年的最畅销专辑中，它是一个反常现象，其表现超过了许多在今天看来更好的前卫摇滚专辑。这张专辑是如何在音乐剧首演之前就取得商业成功的*？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "簡單地說，這是一張奇怪的專輯，即使是在它的時代。它是當年最暢銷的專輯\n它是當年最暢銷的專輯，也是公告牌排名第一的專輯；在其他熱門專輯中，它是相當\n獨一無二。當代基督教音樂界在當時還沒有真正起飛。\n那時候，當代基督教音樂界還沒有真正起飛。前衛搖滾樂隊，如克里姆森國王（King Crimson）、是的（Yes），...",
      "title": "\"耶穌基督超級明星 \"是1971年銷量第一的專輯。在當年的最暢銷專輯中，它是一個反常現象，其表現超過了許多在今天看來更好的前衛搖滾專輯。這張專輯是如何在音樂劇首演之前就取得商業成功的*？"
    }
  ]
}