{
  "author": "ExcellentNoThankYou",
  "the_new_excerpt": "Goldman Sachs Group Inc. is exploring how it can meet rising customer demand to\nown and invest in bitcoin, while still staying on the right side of regulation,\nbank President and Chief Operating Officer John Waldron said on Wednesday.\n\n“Client demand is rising,” Waldron said. “We are regulated on…",
  "original_created_utc": 1615421022,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "高盛集团（Goldman Sachs Group Inc.）正在探索如何满足客户日益增长的需求，以实现。\n拥有和投资比特币，同时还能保持在监管的正确性。\n银行总裁兼首席运营官John Waldron周三表示。\n\n\"客户需求正在上升，\"Waldron说。\"我们是在...",
      "title": "高盛首席运营官报告称客户对比特币的需求正在上升。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "高盛集團（Goldman Sachs Group Inc.）正在探索如何滿足客戶日益增長的需求，以實現。\n擁有和投資比特幣，同時還能保持在監管的正確性。\n銀行總裁兼首席運營官John Waldron週三表示。\n\n\"客戶需求正在上升，\"Waldron說。\"我們是在...",
      "title": "高盛首席運營官報告稱客戶對比特幣的需求正在上升。"
    }
  ],
  "title": "Goldman Sachs COO Reports Clients’ Demand for Bitcoin is Rising",
  "created_utc": 1615442403,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Goldman Sachs Group Inc. is exploring how it can meet rising customer demand to own and invest in bitcoin, while still staying on the right side of regulation, bank President and Chief Operating Officer John Waldron said on Wednesday.</p>\n\n<p>“Client demand is rising,” Waldron said. “We are regulated on what we can do. We continue to evaluate it ... and engage on it.”</p>\n\n<p>The bank recently restarted its cryptocurrency trading desk and this month it started dealing bitcoin futures and non-deliverable forwards for clients.</p>\n\n<p>Goldman is also exploring a bitcoin exchange traded fund and has issued a request for information to explore digital asset custody.</p>\n\n<p>Waldron said Goldman can custody digital assets “but can’t principle” them, and is in talks with regulators and central banks about how banks should be regulated when dealing with digital money.</p>\n\n<p>The U.S. Securities and Exchange Commission is mulling how to regulate broker-dealers who are holding digital assets for clients and asked for public comments on the matter in December.</p>\n\n<p>The pandemic caused an explosion in online commerce, as consumers spent more time shopping from their couch than in-person over the past year.</p>\n\n<p>Goldman believes this trend will continue and that it will cause a corresponding “explosion” in the use of digital currency, Waldron said.</p>\n\n<p>“The pandemic has been a significant accelerant,” Waldron said. “There is no question in our mind there will be more digital commerce … and (use of) digital money.”</p>\n\n<p><a href=\"https://www.reuters.com/article/us-goldman-sachs-conference-waldron-idUSKBN2B22E2\">https://www.reuters.com/article/us-goldman-sachs-conference-waldron-idUSKBN2B22E2</a></p>\n</div><!-- SC_ON -->",
  "score": 334,
  "permalink": "/r/investing/comments/m2cwjy/goldman_sachs_coo_reports_clients_demand_for/",
  "subreddit": "investing",
  "id": "m2cwjy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542575841
}