{
  "author": "ImChaotiic",
  "the_new_excerpt": "There is an unfortunate abundance of hate and jealousy from people presumably\n\"missing out\" on significant price increases and frankly I don't understand that\nmentality.\n\nWe should be congratulating our brothers and sisters in crypto and not\ncriticizing their choice of coin.\n\nCrypto isn't a race to…",
  "original_created_utc": 1620089203,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "残念なことに、大幅な値上げを \"見逃した \"と推定される人々からの憎しみや嫉妬が溢れています。\n大幅な値上げを \"逃す \"ことになった人たちの憎しみや嫉妬が残念ながら溢れていますが、正直言って私には理解できません。\n精神的なものです。\n\n私たちは、暗号化された兄弟や姉妹を祝福すべきであり、彼らが選んだコインを批判するべきではありません。\nコインの選択を批判してはいけません。\n\n暗号は競争ではありません...",
      "title": "自分の持っているコインでちゃんとした利益を出している人はおめでとうございます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "不幸的是，人们有大量的仇恨和嫉妒，估计是 \"错过 \"了大幅涨价。\n\"错过了大幅涨价的机会，坦率地说，我不理解这种心理。\n心态。\n\n我们应该祝贺我们的加密货币兄弟姐妹，而不是\n批评他们对币的选择。\n\n低碳货币并不是一场竞赛，而是要...",
      "title": "祝贺任何从他们拥有的硬币中获得体面利润的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "不幸的是，人們有大量的仇恨和嫉妒，估計是 \"錯過 \"了大幅漲價。\n\"錯過了大幅漲價的機會，坦率地說，我不理解這種心理。\n心態。\n\n我們應該祝賀我們的加密貨幣兄弟姐妹，而不是\n批評他們對幣的選擇。\n\n低碳貨幣並不是一場競賽，而是要...",
      "title": "祝賀任何從他們擁有的硬幣中獲得體面利潤的人。"
    }
  ],
  "title": "Congratulations to anyone making decent profit from the coins they own",
  "created_utc": 1620114238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There is an unfortunate abundance of hate and jealousy from people presumably &quot;missing out&quot; on significant price increases and frankly I don&#39;t understand that mentality.</p>\n\n<p>We should be congratulating our brothers and sisters in crypto and not criticizing their choice of coin.</p>\n\n<p>Crypto isn&#39;t a race to become rich, it&#39;s a much longer journey with plenty of ups and downs and ultimately, we&#39;re all in it together!</p>\n\n<p>So let&#39;s just congratulate others on their recent successes and if you believe in your portfolio then your time will come too.</p>\n\n<p>PS: (insert coin) to the moon!</p>\n</div><!-- SC_ON -->",
  "score": 365,
  "permalink": "/r/CryptoCurrency/comments/n4c19b/congratulations_to_anyone_making_decent_profit/",
  "subreddit": "CryptoCurrency",
  "id": "n4c19b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380964318
}