{
  "author": "Ahjustsea",
  "original_created_utc": 1638064877,
  "title": "I built a website for assessing the levels of Dips and Moons in crypto prices (so I guess you don't have to)",
  "created_utc": 1638106248,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For those that have seen me before, you know that I have become obsessed with the popular saying &quot;<strong>Buy The Dip</strong>&quot;. What the !@#$ does that actually mean? How much decrease is actually a dip? How much of a rise in prices is actually a rocket to the moon? The standards of this were obviously subjective...</p>\n\n<p>So I built a live website that statistically tests whether there&#39;s a significant decrease or increase in price (p-value &lt; 0.05) in relation to historical performance (multiple testing correction not included).</p>\n\n<h1>The Main Dashboard (<a href=\"https://buythedips.io/\">buythedips.io</a>)</h1>\n\n<p><a href=\"https://preview.redd.it/0v0ku07dt8281.png?width=1862&amp;format=png&amp;auto=webp&amp;s=f0c4f0db64c010c8018e6cb688a75b1687b82652\">BuyTheDips &#37;&gt;&#37; Dashboard @ https://buythedips.io/ </a></p>\n\n<p>So let&#39;s go through the graphs one by one.</p>\n\n<h2>1. z-score movements in the last 48 hours.</h2>\n\n<ul>\n<li>Displays historical z-scores (z-price) in the last 48 hours. The others, z-volume and performance, are available on the “Historicals” tab (the graphs here work a lot better in fullscreen mode).</li>\n</ul>\n\n<h2>2. current performance on 14d volume adjusted avg.</h2>\n\n<ul>\n<li>Shows how your crypto is performing currently when compared to the 14-day volume-adjusted moving average price.</li>\n</ul>\n\n<h2>3. z-score in %in% current price (z-price).</h2>\n\n<ul>\n<li>These are z-scores calculated on current price.</li>\n<li><strong>z-scores are essentially the numbers that tell you whether you have a statistically significant dip or moon. z-score of minus 2 means that the price is significantly lower than the norm, while z-score greater 2 means that the price is significantly higher than the norm.</strong></li>\n<li>Hover on cryptos to see Mole’s suggestions on dips.</li>\n</ul>\n\n<h2>4. z-score in %in% current trading volume (z-volume).</h2>\n\n<ul>\n<li><strong>These are z-scores can be calculated on trading volume as well. The same guidelines apply. z-volume &gt; 2.0 is volume that is significantly higher than expected, and z-volume less than -2.0 is significantly less. Calculated from historical 14 day moving averages of trading volume.</strong></li>\n</ul>\n\n<h2>5. scatter %in% price (z-price vs. z-volume).</h2>\n\n<ul>\n<li>Scatter plot of items 3 and 4</li>\n<li>This is my new favourite way to see cryptos action now.</li>\n<li>White box in the middle (x and y boundaries @ -2 and 2) is essentially what I call <strong>“the-safezone-of-stability”</strong>.</li>\n<li>If your crypto is in this zone, it’s price and trading volume is as expected (e.g., regular, normal).</li>\n<li>When a crypto starts to “<strong>moon</strong>”, it’ll first make significant lateral movement towards the right and then tread upwards into the to the right-top corner.</li>\n</ul>\n\n<h2>6. scatter %in% volatility (volatility in price vs. volatility in trading volume).</h2>\n\n<ul>\n<li>Scatter plot of items 7 and 8</li>\n<li>Percent volatility (i.e., the tendency to change rapidly and unpredictably) is calculated on both crypto prices and trading volume, and then plotted against each other.</li>\n<li>the faded white boxes show IQR ranges for each metric. Where the boxes overlap in the middle, is where you expect % volatility values to be. Outside of this area indicates that current volatility is higher or lower than the norm.</li>\n</ul>\n\n<h2>7. &amp; 8. Volatility %in% price and trading volume.</h2>\n\n<ul>\n<li>Percent volatility (i.e., the tendency to change rapidly and unpredictably) is calculated on both crypto prices and trading volume.</li>\n<li>Presented as bar graphs.</li>\n</ul>\n\n<h1>The Days Since tab</h1>\n\n<p><a href=\"https://preview.redd.it/6ixr4pzbt8281.png?width=383&amp;format=png&amp;auto=webp&amp;s=0ce34bc3a09da59401ae71f35513cb38c645e942\">Using these metrics, it&#39;s possible to document how long it&#39;s been since the last time a crypto has mooned or dipped.</a></p>\n\n<p><strong><em>TL;DR</em></strong>: Come check it out if you have some time. There is no financial advice given nor coins shilled, just numbers for you to assess your favourite crypto and the current market.  You can also find me via my twitter bot (link in bio), which I made a post about previously.</p>\n\n<p>Final note: I built it on one of the cheapest AWS trial server, so it&#39;s not the most <em>stable</em>. I&#39;m also working on a pretty comprehensive portfolio manager that provides personalized analysis of your holdings beyond traditional apps, but I&#39;ll save that for another day.</p>\n\n<p><strong>Edit</strong>: It works a tiny bit better on desktop.</p>\n\n<p><strong>Edit2</strong>: There&#39;s a good chance that the server will crash overnight, but I&#39;m heading to bed now... If it&#39;s not up when you click the link, I&#39;m sorry... I&#39;ll put it back up when I wake up tomorrow...</p>\n\n<p><strong>Edit3</strong>: So it did crash last night. Retrospectively, it was a bad idea to make a post about it before bed time. My bad. </p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/r3t05b/i_built_a_website_for_assessing_the_levels_of/",
  "subreddit": "CryptoCurrency",
  "id": "r3t05b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For those that have seen me before, you know that I have become obsessed with\nthe popular saying \"Buy The Dip\". What the !@#$ does that actually mean? How\nmuch decrease is actually a dip? How much of a rise in prices is actually a\nrocket to the moon? The standards of this were obviously…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前に私を見たことがある方は、私が、流行の言葉に夢中になっていることをご存知でしょう。\n\"Buy The Dip \"という言葉に夢中になっていることをご存知でしょうか。この言葉の意味は何でしょうか？どのくらいの\nどの程度の下落が実際のディップなのか？どれくらいの価格上昇が実際には月へのロケットなのか？\n月へのロケット？その基準は、明らかに...",
      "title": "暗号価格のDipsとMoonのレベルを評価するためのウェブサイトを作りました（だから、あなたはその必要はないと思います）。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于那些以前见过我的人来说，你知道我已经迷上了\n俗话说 \"买跌停\"。这到底是什么意思？跌多少才算跌？\n跌多少才是真正的下跌？价格上涨多少才是真正的\n火箭登月？这其中的标准显然是...",
      "title": "我建立了一个网站，用于评估加密货币价格的跌落和月球水平（所以我想你不必这样做）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於那些以前見過我的人來說，你知道我已經迷上了\n俗話說 \"買跌停\"。這到底是什麼意思？跌多少纔算跌？\n跌多少纔是真正的下跌？價格上漲多少纔是真正的\n火箭登月？這其中的標準顯然是...",
      "title": "我建立了一個網站，用於評估加密貨幣價格的跌落和月球水平（所以我想你不必這樣做）。"
    }
  ]
}