{
  "author": "mister_sleepy",
  "original_created_utc": 1654129454,
  "title": "My wife has serious email anxiety, but I can’t relate and she hates talking about it. People who experience this: what is that like, what is it about, and is there a way for me to help?",
  "created_utc": 1654176853,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have experienced lots of kinds of executive dysfunction, but I don’t understand e-mail anxiety at all. The concept of someone expecting a communication and relying on you for that makes me feel anxiety about &lt;em&gt;not&lt;/em&gt; sending emails, even if they’re difficult or anxiety-inducing.&lt;/p&gt;\n\n&lt;p&gt;I don’t at all understand being so anxious about the act of sending an email that you just &lt;em&gt;can’t&lt;/em&gt; even though the situation is getting worse and worse through inaction.&lt;/p&gt;\n\n&lt;p&gt;EDIT: &lt;em&gt;To be clear&lt;/em&gt;—This isn’t advice-seeking. My wife is a grown lady, she can handle herself. Or she won’t. Either way she’s been clear with me that she hates talking about it, so it’s not my place to “diagnose” her or try to “fix” her problem and it’s not yours either. &lt;/p&gt;\n\n&lt;p&gt;What I asked was for &lt;em&gt;other people to describe their own experience,&lt;/em&gt; because I have no frame of reference for it and wish to be able to better empathize with the general case of her specific experience. That’s a healthy part of being in a relationship—putting in the work on your own to better understand your partner—even in the abstract—because you care about them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/v2vyre/my_wife_has_serious_email_anxiety_but_i_cant/",
  "subreddit": "TrueAskReddit",
  "id": "v2vyre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have experienced lots of kinds of executive dysfunction, but I don’t\nunderstand e-mail anxiety at all. The concept of someone expecting a\ncommunication and relying on you for that makes me feel anxiety about not\nsending emails, even if they’re difficult or anxiety-inducing.\n\nI don’t at all…"
}