{
  "author": "mister_sleepy",
  "original_created_utc": 1654129454,
  "title": "My wife has serious email anxiety, but I can’t relate and she hates talking about it. People who experience this: what is that like, what is it about, and is there a way for me to help?",
  "created_utc": 1654176853,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have experienced lots of kinds of executive dysfunction, but I don’t understand e-mail anxiety at all. The concept of someone expecting a communication and relying on you for that makes me feel anxiety about &lt;em&gt;not&lt;/em&gt; sending emails, even if they’re difficult or anxiety-inducing.&lt;/p&gt;\n\n&lt;p&gt;I don’t at all understand being so anxious about the act of sending an email that you just &lt;em&gt;can’t&lt;/em&gt; even though the situation is getting worse and worse through inaction.&lt;/p&gt;\n\n&lt;p&gt;EDIT: &lt;em&gt;To be clear&lt;/em&gt;—This isn’t advice-seeking. My wife is a grown lady, she can handle herself. Or she won’t. Either way she’s been clear with me that she hates talking about it, so it’s not my place to “diagnose” her or try to “fix” her problem and it’s not yours either. &lt;/p&gt;\n\n&lt;p&gt;What I asked was for &lt;em&gt;other people to describe their own experience,&lt;/em&gt; because I have no frame of reference for it and wish to be able to better empathize with the general case of her specific experience. That’s a healthy part of being in a relationship—putting in the work on your own to better understand your partner—even in the abstract—because you care about them.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TrueAskReddit/comments/v2vyre/my_wife_has_serious_email_anxiety_but_i_cant/",
  "subreddit": "TrueAskReddit",
  "id": "v2vyre",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have experienced lots of kinds of executive dysfunction, but I don’t\nunderstand e-mail anxiety at all. The concept of someone expecting a\ncommunication and relying on you for that makes me feel anxiety about not\nsending emails, even if they’re difficult or anxiety-inducing.\n\nI don’t at all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこれまで、たくさんの種類の実行機能不全を経験してきましたが、その中でも特に\nメール不安は全く理解できない。相手がコミュニケーションを期待し\nを期待され、それを頼りにされるのが不安でたまらない。\n難しい内容や不安を煽るようなメールでも、送ってしまう。\n\n私は全く...",
      "title": "妻は深刻なメール不安を抱えているが、私は共感できないし、妻はその話をするのを嫌がる。これを経験する人々：それはどのようなものですか、それは何ですか、そして、私が助ける方法はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我经历过很多种类的执行功能障碍，但我没有\n我完全不理解电子邮件焦虑症。有人期望与你沟通并依赖你，这个概念让我觉得\n沟通并依赖你的概念让我感到焦虑，因为我不想\n发送电子邮件，即使它们是困难的或令人焦虑的。\n\n我一点也不...",
      "title": "我妻子有严重的电子邮件焦虑症，但我无法体会，她也不喜欢谈论这个问题。有这种经历的人：那是什么感觉，是什么原因，有什么办法可以让我帮忙吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經歷過很多種類的執行功能障礙，但我沒有\n我完全不理解電子郵件焦慮症。有人期望與你溝通並依賴你，這個概念讓我覺得\n溝通並依賴你的概念讓我感到焦慮，因爲我不想\n發送電子郵件，即使它們是困難的或令人焦慮的。\n\n我一點也不...",
      "title": "我妻子有嚴重的電子郵件焦慮症，但我無法體會，她也不喜歡談論這個問題。有這種經歷的人：那是什麼感覺，是什麼原因，有什麼辦法可以讓我幫忙嗎？"
    }
  ]
}