{
  "author": "M00OSE",
  "original_created_utc": 1626602381,
  "title": "A curated list of the best crypto research tools to help anyone navigate the cryptoverse",
  "created_utc": 1626618760,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Cryptoverse is difficult to navigate; there&#39;s thousands of different coins and new one&#39;s being made everyday. It&#39;s also a young space, meaning innovation is happening on the go; London fork, Taproot, Alonzo, <em>what do all of these even mean?</em> </p>\n\n<p>Most crypto veterans place an emphasis on <em>Doing Your Own Research</em> (DYOR), but it&#39;s, as with most things, it&#39;s easier said than done. So here&#39;s a curated list of useful crypto research tools for two types of long-term hodlers: fundamental and quantitative analyzers.</p>\n\n<h1>Set it and forget it hodlers</h1>\n\n<p>As a <em>set it and forget it hodler</em> your best friend is fundamental research and crypto news. You also want to avoid the &#39;noise&#39; of the daily market to make it easier to hold. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Messari</strong></p>\n\n<p><a href=\"https://preview.redd.it/o3ugjki9lvb71.png?width=2556&amp;format=png&amp;auto=webp&amp;s=2801663de7532701b308473fb1d1c33f86a7f60a\">Bitcoin research page in Messari</a></p>\n\n<p><a href=\"https://messari.io/\">Messari</a> is the king of crypto research tools. While it may look a bit intimidating at first, it makes crypto research incredibly easy once you&#39;re able to navigate the site. They have a crypto profile that shows you things like type (currency, privacy coin, smart-contract platform, etc.), consensus algorithm, inception, and a clear and concise description. They also have links to communities, white papers, codes, and research articles. </p>\n\n<p>It&#39;s not something you have to check all the time. It&#39;s particularly useful whenever you have to do some deep-dive research. There is a paid version but the free version suffices.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Kraken Daily Hash Newsletter</strong></p>\n\n<p><a href=\"https://preview.redd.it/qz6erl44nvb71.png?width=1206&amp;format=png&amp;auto=webp&amp;s=138324bf68393cdf0b4e184cd3b2bc9ae144fa81\">Sample of Kraken newsletter, the Daily Hash.</a></p>\n\n<p>Again, as a long-term hodler, you want to focus on the big news instead of what X billionaire has to say about crypto. You&#39;re talking regulations, milestones, and adoption. Kraken has a daily newsletter (Mondays-Fridays), the Daily Hash, that aggregates the most relevant crypto headlines. They also have research reports about market recaps and other big events once a month or so. </p>\n\n<p>You can subscribe to them <a href=\"https://www.kraken.com/en-us/subscribe/intelligence\">here</a> or visit their website. For this section, only the Daily Hash and the Research reports are recommended. I also subscribe to the OTC report but that&#39;s for more technical discussions that may or may not be suited for long-term hodling. </p>\n\n<h1>Data-oriented Investors</h1>\n\n<p>Despite crypto being an incredibly young market, there&#39;s a lot to love about crypto market data. In my opinion, the data-oriented aspect of crypto is underrated. We have tons of models and theories backed by a sufficient number of years, that make the cryptoverse a unique investing environment. For example, there&#39;s always been one long-term bull and bear market per halvening and each of them having less ROI and longer runs than the prior cycle, this follows the <em>diminishing returns</em> and <em>lengthening cycles theory</em>, respectively. So here&#39;s where you can find all the important indicators.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Altcoin Season Index</strong> </p>\n\n<p><a href=\"https://preview.redd.it/bfz70qcdrvb71.png?width=2200&amp;format=png&amp;auto=webp&amp;s=c6563a8bacc36016d67cdd91985249e92e3d2d41\">Altcoin Index Chart indicating Alt Season and Bitcoin Season</a></p>\n\n<p>One of the most important concepts to understand in the current market environment is <em>Bitcoin Dominance</em> and how this relates to the price action of alts. In summary, when Bitcoin falls, alts fall faster; when Bitcoin rises, alts rise faster. Because of this, lots of people like to move to Bitoin, a crypto &#39;safe haven&#39; during bear markets and times of uncertainty, aka <em>Bitcoin Season</em>, and move into other coins during bull markets, aka <em>Altcoin Season</em>.</p>\n\n<p><a href=\"https://www.youtube.com/redirect?event=video_description&amp;redir_token=QUFFLUhqbmlpcW5zUW5GZ0g2dnFiRnZsQUdMN3VDQVQ0QXxBQ3Jtc0trZEZXOXU3bzhZT1p6RHVUTnRvWk8yR09mQlFyTUoxcEJPMGxkQ2NpTWN1UzVSZkdIV0p6U01MYzRmT1dNbG5SUHdxRjhReFN3cTA5WmowQ1JvZVJhQzV0VnlCRTNWWlNtb3ZrbkRiZkJWR3ZscUxDTQ&amp;q=https%3A%2F%2Fwww.blockchaincenter.net%2Faltcoin-season-index%2F\">The Altcoin Season Index</a> shows you when it is an optimal time to invest in altcoins and when you might want to be in BTC. Additionally, the blockchain center is also a number of useful tools and technical indicators like the famous, <a href=\"https://www.blockchaincenter.net/bitcoin-rainbow-chart/\">Bitcoin logarithmic Rainbow</a>.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Glassnode</strong></p>\n\n<p><a href=\"https://preview.redd.it/0txfekfhtvb71.png?width=1246&amp;format=png&amp;auto=webp&amp;s=2253cefca9bb580b54b50d7d489232cd986ae632\">Sample Glassnode Insights newsletter</a></p>\n\n<p>This is an on-chain market indicators site, showing data for Bitcoin and Ethereum. They have the  <a href=\"https://studio.glassnode.com/\">Studio</a>, a live on-chain data explorer with visualisations of the most fundamental on-chain metrics, Glassnode <a href=\"https://glassnode.com/metrics\">Metrics</a>, a comprehensive library of on-chain metrics, and <a href=\"https://insights.glassnode.com/\">Insights</a>, contextualized reports and analyses drawn from on-chain data.</p>\n\n<p>They also have an academy where you can learn how to read all of these metrics and data. Like Kraken Intelligence, they also have a <a href=\"https://cdn.forms-content.sg-form.com/f6bb0156-cafb-11e9-941a-e2e604f90f01\">newsletter</a> for technical discussions on major cryptocurrencies. At this point, I&#39;d also recommend subscribing to <a href=\"https://www.kraken.com/en-us/subscribe/intelligence\">Kraken&#39;s OTC newsletter</a>.</p>\n\n<h1>Bybt</h1>\n\n<p><a href=\"https://preview.redd.it/4ivx1qz4awb71.png?width=2552&amp;format=png&amp;auto=webp&amp;s=d12253209655b802dc6a33d89904ddce31664df6\">Stock-to-Flow Model page</a></p>\n\n<p>Last but not the least is Bybt, a derivative data analytics tool typically reserved  for advanced crypto traders. They have a data section that houses all of the most relevant crypto market valuation models such as the Stock-to-Flow Model, Puell Multiple, and the Crypto Fear and Greed Index.</p>\n\n<p>But the main dish for Bybt is the derivative tools: futures &amp; options open interest, funding rates &amp; longs vs. shorts across a range of different exchanges. While I don&#39;t use this to guide my financial decisions, <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/mdf4la/this_is_what_happens_to_bitcoin_when_options/\">some people</a> like to make connections between the derivatives market and price action. </p>\n\n<p>&#x200B;</p>\n\n<h1>Bonus Tools:</h1>\n\n<ul>\n<li><strong>CoinGecko &amp; CoinMarketCap:</strong> these are the standard crypto screeners, not ideal for hodlers--can get addicting.</li>\n<li><strong>CryptoPanic</strong>: a news aggregator with sentiment scores and feedback, ideal for staying up-to-date.</li>\n<li><strong>TradingView</strong>: cloud-based charting and social networking platform, ideal for traders.</li>\n<li><strong>CoinDance</strong>: for hash rate, mining, and market volume statistics, ideal for advanced research.</li>\n<li><strong>CryptoQuant</strong>: similar statistics to <em>CoinDance.</em></li>\n<li><strong>CoinMarketCal</strong>: a calendar for all the important crypto-related events, ideal for staying up-to-date.</li>\n<li><strong>RugDoc</strong>: a tool to check the risk-level and timeline of defi projects, ideal for defi investors.</li>\n<li><strong>CryptoResearchReport:</strong> Full in-depth reports with easy-to-understand language, ideal for readers.<br/></li>\n</ul>\n\n<p>That&#39;s all for now folks, lemme know if I missed anything that&#39;s useful to you.</p>\n</div><!-- SC_ON -->",
  "score": 412,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?auto=webp&s=376da8e0c38d288bad5a6b78cf5399e259f9a15f",
          "width": 2400,
          "height": 1254
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?width=108&crop=smart&auto=webp&s=c5c16b2337dccc6154624fad622e5660e5be256f",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?width=216&crop=smart&auto=webp&s=ff7fc28313f821a26d374260ee950782b16f31e3",
            "width": 216,
            "height": 112
          },
          {
            "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?width=320&crop=smart&auto=webp&s=e782b33935053555a99918a767524efdac1ebd3c",
            "width": 320,
            "height": 167
          },
          {
            "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?width=640&crop=smart&auto=webp&s=317bf2e975234057c1f6d3f1060af62a4a4d12b6",
            "width": 640,
            "height": 334
          },
          {
            "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?width=960&crop=smart&auto=webp&s=c81d1be6aad7e1a9518b9a77e244c2ac2ad5aad6",
            "width": 960,
            "height": 501
          },
          {
            "url": "https://external-preview.redd.it/WfHQT8Fytr3xSvgtfUtqCtYvKGIZEkTAXsEZrBMaq_4.jpg?width=1080&crop=smart&auto=webp&s=aa69a9a78085ef8f681c2ad996715b5823e57cca",
            "width": 1080,
            "height": 564
          }
        ],
        "variants": {},
        "id": "Yz1bqe5_0XiCVOjcjCMnozGbH8auxzn_eBhAPYCaYXw"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/omnozt/a_curated_list_of_the_best_crypto_research_tools/",
  "subreddit": "CryptoCurrency",
  "id": "omnozt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Cryptoverse is difficult to navigate; there's thousands of different coins\nand new one's being made everyday. It's also a young space, meaning innovation\nis happening on the go; London fork, Taproot, Alonzo, what do all of these even\nmean?\n\nMost crypto veterans place an emphasis on Doing Your…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリプトバースはナビゲートするのが難しく、何千種類ものコインがあり\n毎日のように新しいコインが作られています。また、若い空間なので、イノベーションがどんどん起こっています。\nLondon fork、Taproot、Alonzo、これらは何を意味するのでしょうか？\n意味があるのでしょうか？\n\nほとんどの暗号化のベテランたちは、「自分で...",
      "title": "クリプトバースをナビゲートするための最高の暗号研究ツールを厳選して紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密世界是很难浏览的；有成千上万种不同的钱币\n而且每天都有新的硬币诞生。这也是一个年轻的空间，意味着创新正在发生。\n意思是创新正在发生；London fork, Taproot, Alonzo, 这些都是什么意思？\n是什么意思？\n\n大多数加密货币的老手都强调 \"做你自己\"。",
      "title": "最好的加密货币研究工具清单，帮助任何人浏览加密世界"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密世界是很難瀏覽的；有成千上萬種不同的錢幣\n而且每天都有新的硬幣誕生。這也是一個年輕的空間，意味着創新正在發生。\n意思是創新正在發生；London fork, Taproot, Alonzo, 這些都是什麼意思？\n是什麼意思？\n\n大多數加密貨幣的老手都強調 \"做你自己\"。",
      "title": "最好的加密貨幣研究工具清單，幫助任何人瀏覽加密世界"
    }
  ]
}