{
  "author": "lightband101",
  "the_new_excerpt": "I’m a little dumbfounded over the last week or so... I know December can be a\ntough month because people like to sell and bank their gains a lot before the\nend of the calendar year...\n\nI had a few short-term positions that I ended up watching hit upwards of 15%,\nsomething I would have been fine…",
  "original_created_utc": 1608563438,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在过去一周左右的时间里有点目瞪口呆.我知道十二月可以是一个\n艰难的一个月，因为人们喜欢在经济衰退前大量抛售并将收益存入银行。\n公历年末..。\n\n我有几个短期头寸，最后我看到这些头寸涨到了15%以上，\n一些我本来可以做的事，…",
      "title": "疫苗的推出和刺激方案的通过，然而今天仍然有一大片红色的海洋…怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在過去一週左右的時間裏有點目瞪口呆.我知道十二月可以是一個\n艱難的一個月，因爲人們喜歡在經濟衰退前大量拋售並將收益存入銀行。\n公曆年末..。\n\n我有幾個短期頭寸，最後我看到這些頭寸漲到了15%以上，\n一些我本來可以做的事，…",
      "title": "疫苗的推出和刺激方案的通過，然而今天仍然有一大片紅色的海洋…怎麼回事？"
    }
  ],
  "title": "Vaccine rolling out & stimulus passed, yet there’s still a big sea of red today... what gives?",
  "created_utc": 1608573711,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a little dumbfounded over the last week or so... I know December can be a tough month because people like to sell and bank their gains a lot before the end of the calendar year...</p>\n\n<p>I had a few short-term positions that I ended up watching hit upwards of 15%, something I would have been fine with. However since a good chunk were travel related, I decided to wait for vaccine/stimulus news because that’s always been when those spike.</p>\n\n<p>Well the vaccine approval news hit and we were red, then there was the second vaccine approval over the weekend, and finally yesterday there was stimulus success after months and months. But again here we are, RED.</p>\n\n<p>What gives?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/stocks/comments/khj70s/vaccine_rolling_out_stimulus_passed_yet_theres/",
  "subreddit": "stocks",
  "id": "khj70s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609183389353
}