{
  "approved_at_utc": null,
  "subreddit": "wallstreetbets",
  "selftext": "tldr: You probably have no idea what PLBY is going to do, and the market probably doesn't either. Take advantage of that. Long term potential, and big catalyst early December. Make money with the bunny. Beware: Lots of execution risk.\n\n\\---\n\nThere's an ancient saying, probably: Can't go tits up investing in tits out. Since the dawn of humankind, men have been willing to shell out their hard earned money in order to suspend all disbelief that, despite the reality that they are disgusting and utterly replaceable blobs of flesh engineered strictly to carry and disperse sperm, they are sexually desirable and relevant.\n\nPlayboy made its name exploiting this innate male desire and also made it culturally acceptable -- they somehow convinced people that this practice of shooting swimmers all over the planet is not morally bankrupt, not entirely meaningless and pointless, but rather: it is an *aspiration* for both men and women to be a part of.\n\nTo the dismay of the sock industry Playboy also invented a second, rather high margin, use for glossy paper. By printing images of naked women (likely also seeking the feeling of sexual desirability and relevance) on those pages, Playboy was able to sell those glossy sheets of paper for an incredible mark up... every month. They were also able to build one of the world's most recognizable brands. (It's estimated that the brand has 97% recall. Try to name any other brand with that kind of branding valued below $2b)\n\n&#x200B;\n\n[From the interview within: \\\\\"I think any man enjoys flirtations, and if he said he didn’t, he’d be lying or he’d be a politician trying to get the extra four votes. I think everybody likes knowing he’s well responded to.\\\\\"](https://preview.redd.it/4yop9ww188081.jpg?width=1136&format=pjpg&auto=webp&s=8c89c24a3a378e34a53309c2f1342860b2e2de41)\n\nBut the times changed, and so did the time honored tradition of rubbing a quick one out between some pages and hastily disposing of the evidence. Though Viagra was able to extend and harden the founder's penis, it did not, unfortunately, have a similar effect on the business. First VHS, then the internet. Before too long, sock companies were once again rejoicing as hoards of mongers fixed their eyes to screens and their hands to computer peripherals and footwear. At least we're saving some trees.\n\nAs the popularity of Playboy faded, management tried a few retarded last ditch efforts to pep up their brand, including removing the cartoons, ending full frontal nudity, and ditching the slogan \"Entertainment for Men\". It was, unsurprisingly, to no avail.\n\nPlayboy's last physical print was February 2016, and by Hugh Hefner's death in late 2017, Playboy was basically a limp dick -- left to decay as dying publishing business with no vision behind it, leaving behind only an iconic logo, brand, and story.\n\n\\---\n\n# 1. The new Playboy\n\nPlayboy was taken private in 2010, only to resurface publicly as a SPAC earlier this year. At the helm, CEO Ben Kohn has put a significant amount of work and thought into reviving and positioning the business to fit into today's world.\n\nI won't get into the details of the acquisitions and pivots PLBY has made since Ben took the helm and PLBY went public. Basically, it's been a year-long revamp. The main theme of the new PLBY is to focus on high-margin direct-to-consumer ecommerce, with the recent reveal of Centerfold tying it all together.\n\n&#x200B;\n\n[Pieces set in place... and beast Centerfold on the way.](https://preview.redd.it/t0jb1z2388081.png?width=1023&format=png&auto=webp&s=b57916204f31e0b9666548515be80c0b0d396e39)\n\nA summary of the pieces they've collected:\n\n* Licensing: leveraging the brand to collect easy tendies. Improving licensing deals is basically free money, and they're making progress.\n* Playboy.com: High margin DTC ecommerce. It's clear from sales data it's not boomer-centered.\n* Yandy & Lovers: Sexual Wellness products. Ideally, Centerfold will drive even more revenue.\n* Honey Birdette: High quality, high margin lingerie and swimwear. Also important: talent and logistics. Think designers and supply chain capabilities. Rather than outsourcing design and manufacturing of clothes, PLBY can keep the margin to themselves. Ideally, they'll be selling a lot of this stuff as they drive customers to it from Centerfold.\n* NFTs: A team that's proven the ability to launch NFTs and print money. Several successful projects under their belt at this point. NFT transfers provide recurring revenue via OpenSea's \"royalty\" system. Eg, each time an NFT is traded, PLBY gets 10%.\n* Centerfold: They acquired \"Dream.me\" in Oct, which provides the technology and talent of which Centerfold will be built on. The team was acquired in nearly all stock, so their interests are aligned: build a kick ass platform and profit.\n\nPLBY has its fingers in a lot of pies, but what stands out to me is how everything will fit together with Centerfold. **Centerfold will be Playboy's creator platform.** Think Patreon, or OnlyFans... **except not only is there massive revenue potential in and of itself, there is the potential to drive revenue through all the other channels set in place.** Centerfold was announced September, with a launch date of Q2 2022... but on Oct 21 was advanced to Q4 2021, and in Q3 earnings call to \"early December\". More on the Centerfold story later.\n\n## The Q3 Inflection Point\n\nIt's not an easy task to take a dying publishing company with a fading image and come up with a cohesive strategy to revive it, and it's even harder to communicate that strategy to the market... especially in such a murky industry. If you read through the various statements of what PLBY is and its direction, you'll find a lot of major (and minor) pivots along the way in the past year or two. **However, for me, Q3 marks the point at which all the pieces are set and the real execution begins in earnest.**\n\nWhat I mean by \"inflection point\" here is that the strategy is solidifying, and is showing early signs of working. The Q3 call has provided the following:\n\n* the direction PLBY has settled on: high-margin goods, DTC, Licensing, NFTs, and Centerfold tying it all together.\n* how the company plans to leverage their brand\n* revenues are growing, even without Centerfold\n* Centerfold is indeed going to happen, and the launch of it seems promising\n\nBasically, the strategy has been set, is showing signs of working. **PLBY is clearly transitioning from a shell of a brand into a business that will print.** Centerfold will kick this all into high gear:\n\n>\"And then when you couple that with CENTERFOLD, and how this flywheel all works together. CENTERFOLD is not only an unbelievably lucrative financial opportunity for the company. It also provides an ongoing relationship with the talent that we have worked with for 70 plus years. We also have access now to all of those subscribers on the CENTERFOLD platform that will benefit not only the Playboy membership, but also our commerce efforts as well. And so, all of this sort of comes together in this cohesive ecosystem or flywheel. I'm really excited by the potential for what we can deliver moving forward on a recurring revenue basis.\" - Ben Kohn, CEO, Q3 earnings.\n\nPerhaps more importantly, I also think that the messaging and marketing to investors has reached an inflection point as well. Starting now, when investors ask \"what the fuck is PLBY and why should I care\", a clear picture can be messaged. It's shifting from \"a once-dying publishing business that is now a sexual wellness lifestyle brand, brough public via SPAC\" -- it's more like a real business with clear strategy that can print.\n\nFrom the picture above, it's clear that Centerfold is the meat of the sandwich, so let's get into it.\n\n\\---\n\n# 2. CENTERFOLD vs OnlyFans\n\n&#x200B;\n\n[OnlyFans felt like destroying their reputation. They've since reversed this, but the damage has been done.](https://preview.redd.it/fn9vs5b488081.png?width=1018&format=png&auto=webp&s=443883caa4eba6904ea439895730ee94575ae247)\n\nIt's incredible to me that I hadn't heard about Centerfold until a few weeks ago. In fact, that's what got me started down this rabbit hole: A publicly listed company is going to create an OnlyFans competitor? How the fuck have I not heard of this? **I think the potential of Centerfold is barely priced in to PLBY**.\n\n**You probably heard about OnlyFans' ban on sexual content... but did you hear about Centerfold? That's about how priced in this is.**\n\nThe potential here:\n\n* Publicity for the stock.\n* Ability for market to gain exposure to a thriving industry.\n* Massive amount of recurring tendies, which the market loves.\n* Revenue that could easily eclipse the rest of PLBY's portfolio.\n* Putting Playboy back into the zeitgeist and ushering in the next generation of cultural relevance.\n* Memeability.\n\nDig a little deeper, and you'll find the timing could not possibly be better:\n\n* OnlyFans fucked up in August by announcing a ban on sexual content (they reverted this days later). Massive reputational damage, and fears payment processing might be rug pulled.\n* The revelation that the OnlyFans owner is a piece of shit\n* Stories about how OnlyFans does not vet creators properly, allowing a 14yo on the platform.\n* **Content creators want to ditch OnlyFans**\n* Cultural push towards female empowerment and entrepreneurship\n* Can you think of a better company to do this than Playboy?\n* Retarded market offering crazy valuations for anything remotely technology or WFH based\n* Launch date pushed up to early December\n\n## Understanding the content creation business\n\nI know the first thing you retards are going to think is \"durr... Mixer couldn't get market share from Twitch... so Centerfold gonna fail too!!\" Ok, fuckheads, try to wrap your head around this: **There are major differences between the Twitch/Mixer business and the OnlyFans/Centerfold business**. Yes, they both involve content creators and viewers. Yes, they both take a cut of subscriptions. But use your fucking wrinkles and you'll see some key differences.\n\n**There's a reason that \"hey whats your OF\" is a meme, and \"hey whats your twitch\" isn't.**\n\nTwitch/Mixer:\n\n* What creators want: exposure to as wide an audience as possible. More viewers = more ad revenue, subscriptions, etc.\n* What viewers want: a wide array of content. Discoverability. Time wasting.\n* Network effect: **MASSIVE**. More creators = more audience. More audience = more creators.\n* Structure: basically like a TV with various channels\n* Summary: audience draws in creators, creators draw in more viewers, a virtuous cycle.\n\nOnlyFans/Centerfold:\n\n* What creators want: a platform to handle the hosting and monetization of their content.\n* What viewers want: a place to \"consume content\" of very particular creator(s)\n* Network effect: **LOW**.  Subscriptions are driven by creators hustling their OF link. Discoverability is not required.\n* Structure: basically separate \"blogs\" for each content creator\n* Summary: creators draw in their own audience, eg: \"What's your OF link?\"\n\nIn short: Twitch/Mixer business relies on both viewers and content creators joining their platform -- the more of each, the better. Massive network effect, massive moat for Twitch. **OnlyFans/Centerfold relies, almost soley, on content creators joining their platform.** This is all made evident by how the sites are structured (channels vs blogs), and how they are used (think of how you'd find a twitch streamer vs how you'd find an OF creator).\n\n## How PLBY steals market share from OnlyFans\n\nThe key question is: **if you were a content creator trying to sell your feet pics, how do you choose which platform to use?**\n\n## Reputation\n\nYou'd probably want to choose a platform that will pay you, that will allow your content, and that is not owned by a scumbag. Let's compare.\n\nOnlyFans:\n\n* In August, said they were having trouble raising money and with payment processing. As a result, **said they would no longer allow sexual content, effective within weeks**. (They reversed this decision days later.) Imagine having all of your revenue suddenly pulled out from under you. Well, first imagine you made money to begin with. **Massive, irrecoverable reputation damage.**\n* Founder is a shithead. He made his money creating websites that would claim to have links to pedophilia and bestiality. Thankfully, it was a scam: those links went to legit porn sites and produced affiliate revenue. Imagine a person that the world is thankful is a scammer. That's this guy.\n* Allowed under-18s on the platform. Google it. Not a good look, not investable, either.\n* Overall, for better or worse, a somewhat trashy reputation to say you're on OnlyFans.\n\nPlayboy:\n\n* Decades long reputation of free speech, sex positivity, and sophistication.\n* Publicly traded revenue generating company; high confidence they will keep paying your bills.\n* Not much shame in saying you were a playmate. Lots of bunny tattoos.\n\nIn short... would you rather tattoo your ankle with an OnlyFans logo, or a Playboy bunny logo? And which company would you trust to pay you?\n\n## Economics and the 80/20 rule\n\nWhile there are countless creators on OnlyFans, the vast majority of revenue comes from a tiny minority of creators. PLBY just needs to win those creators over. It's not as monstrous of a task as you might think.\n\n>\"More than 300 OnlyFans creators reportedly earn at least $1 million annually, while 16,000 creators make at least $50,000 a year.\" -CNBC article\n\nPLBY can offer creators more revenue, and more revenue streams:\n\n* Offer a higher rev share\n* Allow creators to sell merchandise\n* Allow creators to sell NFTs\n\n\\---\n\n# 3. CENTERFOLD vs Instagram\n\n&#x200B;\n\n[Instagram is not a fan of tits and will slam the banhammer.](https://preview.redd.it/t7ya5hz588081.png?width=946&format=png&auto=webp&s=0c7c3392c43b7d2ca4a3ddd6be784c0f18b5d6de)\n\nWith regards to Centerfold, less talked about is how it can function as a nudity friendly version of Instagram, and the potential there.\n\nInstagram has a pretty strict content policy, and models are finding their accounts randomly get deleted due to TOS violations. Tens to hundreds of thousands of followers can vanish in an instant. Tumblr is gone, too -- so where's a girl to go to post her new fake tits?\n\n**There is huge potential in a nudity friendly Instagram clone.** Playboy's motto? \"nudity is normal\".\n\nPlayboy won't have to rely on ads to generate revenue from Centerfold -- they can simply drive traffic to their existing assets. Lingerie. Sex toys. Centerfold subscriptions.\n\nEasy win, here, and if you go around reading DDs about PLBY and Centerfold, you'll find it overlooked.\n\n\\---\n\n# 4. Centerfold Launch Progress\n\nCenterfold was initially announced in September, shortly after OnlyFans made their retarded announcement that they would not allow sexual content. The initial launch date was planned for Q2 2022. Google \"playboy centerfold medium\".\n\nOn Oct 21, Centerfold announced the acquisition of Dream.me, a creator-driven/social media platform. Basically, a clone of Instagram. This acquisition was in all stock, and provided a skeleton for the platform, but more importantly a strongly incentivized team willing to bust their ass to get this thing out there. Launch date was move up to Q4 2021.\n\nSince then, the stock has been marching upwards.\n\nQ3 earnings, as hoped, provided some guidance on how things are going with Centerfold.\n\n>\"In general, the platform is in place and we think what we have assembled today is truly a competitive differentiator moving forward as we think about membership and CENTERFOLD. What we can offer the creative community is something that no one else can offer. And I think that's referenced by the founding creators that we have signed up to launch with that represent in excess of 300 million social media followers.\" - Q3 earnings call\n\nAlso, there's this:\n\n>\"Founding creators on CENTERFOLD will bring in \\~300 million social media followers, and hundreds of millions in existing GMV\" -whossayn on theideafund\n\nAnd this, in response to \"And one super quick follow up for these early CENTERFOLD launch partners, what kinds of creators are in there?\":\n\n>\"So they are huge music stars, to former playmates, to adult stars, to artists, to other influencers, actors, celebrities. It's really -- we've really been overwhelmed by the response from the creator community, and also by the diversity of the creators that we brought in. And I think it's going to truly be something that's unique\" -Ben Kohn\n\n\\---\n\n# 5. NFTs\n\n&#x200B;\n\n[ \\\\\"Rabbitar\\\\\" NFTs will grant special membership and perks to various things. What, exactly, is TBA.](https://preview.redd.it/ni0dz7l788081.png?width=294&format=png&auto=webp&s=5e06ef1abd961abf6630b7621443b13ea27d0dcd)\n\nI don't personally give a shit about NFTs, but PLBY is interesting in this regard. I'll keep this brief:\n\n* Their run up to $60 was due to an NFT they launched.\n* They've since launched a much larger, and more interesting NFT series: Rabbitars. Sold out quickly, produced $9M in revenue, and will produce recurring revenue (10% on each transfer). No run up this time, though\n* Rabbitar NFT will have an IRL use: it's planned to serve as \"membership\" to various Playboy/Centerfold things. Perks, discounts, live events... a lot of possibilities here, especially if each Rabbitar has different perks. AFAIK, no other public company has tied NFTs to real life.\n\n\\---\n\n# 6. Additional considerations\n\nI don't think PLBY has reach anywhere near its peak in terms of potential market interest, both retail and institutional. It has a lot of solid followers and believers of the stock, though:\n\n* GME O.G. and banana aficionado /u/uberkikz11 is quite vocally bullish\n* Google \"hedgeye PLBY\"\n* Just google the damn ticker and do some DD for yourself\n* PLBY might represent the best ticker in the market to invest in men jerking off and women whoring themselves.\n\n\\---\n\n# 7. ⚠️⚠️⚠️⚠️ THE BEAR CASES ⚠️⚠️⚠️⚠️\n\nIt's important to understand Centerfold is not a sure fire thing. There is **considerable execution risk**. I'll lay out what I think are the big \"ifs\".\n\n## The Product\n\n* **Flaccid launch**: It's possible Centerfold, when launched, just sucks. It can come off as a shitty clone of Instagram or OnlyFans, and the market's confidence can be shaken.\n* **Delayed launch**: It's a tech product, and subject to feature creep, bugs, etc. The deadline is extremely aggressive, and it's possible it gets pushed back. However, guidance on release was given days ago, so it's likely. But, still possible.\n* **Exposure concerns**: investability / payment processor / etc. Despite what you might think, PLBY has a strong E.S.G. vibe to it, so I think it should be OK. They are >50% female employees (I think), and for better or worse, they're very vocally woke. I think Ben Kohn does a great job walking the line between investable and \"proper\".\n\n## The Policies\n\nThe biggest risks, in my opinion.\n\n* **Shitty creators**: Though the pool of initial creators has been talked up by management, but not defined.  It's possible they actually suck. Imagine a line-up of \"unconventional beauty\". Eg, \"body positive\" woke bullshit that is attempted to be marketed as the new wave of sexual wellness. While this is possible, I think it's unlikely. Ben Kohn knows what's up.\n* **Content policy**. On a recent interview on FOX, where the host was an asshole, Ben Kohn stated there will be no \"porn\".. or orgies on their airplane. However, the term \"porn\" was never defined... and he was talking with FOX, so he had to be careful what he said. In my opinion, if they allow nudity but no masturbation, that could be bad. If there's no scat, probably less of a concern.\n\nI'm somewhat worried about these given the amount of woke-speak of this company, but I'm confident management knows where the dollars are:  \n\n\n[Content policy is up in the air. Requires faith.](https://preview.redd.it/skj0dm4988081.png?width=1353&format=png&auto=webp&s=dd4cabddc5d8399212e098288ab8e8399a68e93c)\n\nEach notch up on the \"debauchery\" scale of porn likely captures less and less revenue. For fun, that scale might look like this:\n\n1. See through clothes, costumes, etc\n2. Frontal Nudity\n3. Pussy close-ups\n4. Light bondage\n5. Sucking on dildos\n6. Insertion of dildos\n7. Butthole stuff\n8. Penises\n9. Penises inside of things\n10. Aggressive BDSM\n11. Cum\n12. A lot of cum all over and inside of various things\n13. Pee-pee and poo-poo\n14. I don't even know. Feel free to comment!\n\nThe risk is they land somewhere too low on the scale to capture significant revenue and interest from OnlyFans-esque creators. Again, I trust their judgement... but I'd feel much more comfortable knowing the exact policy before launch.\n\nOn the plus side, there's likely an 80/20 rule here. Going up the the scale will uncapture less and less revenue. So, even if they go pretty light, there's plenty of opportunity. And, it should be noted that even if they go very light, the Centerfold vs. Instagram thesis would still hold quite strong. Creators need a home to post nudes.\n\n## Insider Selling\n\nThis last one you might have heard about if you follow the stock.\n\nSome people made a big deal about a recent filing where the CEO and other insiders were granted a bunch of shares to sell. Rumors went flying that a ton of shares were about to get sold.\n\nIt's my understanding this is a nothingburger and par for the course. Yes, they got their shares... per their employment agreements or whatever. No, there is nothing there that is saying they will sell.  They *can* sell, but management has been clear they are in this for the long run.\n\n\\---\n\n# 8. Technicals\n\n## Historical IV\n\n[IV far lower than it was due to NFTs, despite PLBY having more catalysts right now.](https://preview.redd.it/rl85o1ca88081.png?width=706&format=png&auto=webp&s=95310a4d17798ac12f268f3947529968bace9ff3)\n\nGiven an advertised massive catalyst coming in early December, the IV30 sits at around 95%. I believe this is a massive mispricing.\n\n## Price Action\n\n[Annotated events of interest](https://preview.redd.it/csr85xqb88081.png?width=1817&format=png&auto=webp&s=c3099ef24563c813f6405421dbf46fca09104990)\n\nHere's summary of price action this year. Notice the creep up after Centerfold was announced. I personally think this is bullish and the start of an upwards channel as we approach early December, but what the fuck do I know.\n\n## Gamma\n\n&#x200B;\n\n[Modest gamma](https://preview.redd.it/76uf800d88081.png?width=1194&format=png&auto=webp&s=b661e18dac8583348a92644e0a3e0c0aaf084f9b)\n\nGamma on this one is nothing too crazy, though as a percentage of daily volume it is significant. A rush into options would likely push the price up somewhat, but I doubt a squeeze is in play.\n\n\\---\n\n# 9. Positions and Price Target\n\n## Positions\n\n[Shares and calls. This is the way.](https://preview.redd.it/36zeksle88081.png?width=643&format=png&auto=webp&s=ad0d3855d682b58c9a264248afbcdc888fb3b296)\n\n* 2000 x Shares: Safest bet. I'm happy locking these away and looking at them a year from now.\n* 60 x Jan $35 calls: Anticipating a run up towards Centerfold launch (early December), giving a little extra time for bumps.\n* 80 x Jan $40 calls: More aggressive, and hoping to capture some IV gain here.\n\n## Targets\n\nI'm selling if IV30 runs above 200. Not worth that much risk. I'm trimming at $50, much more aggressively at $60, and out if hits $70. This is my personal preference, based on my personal risk tolerance and what I hope to gain, and is not investment advice.\n\n## Other Notes\n\nRead the bear case, please. And do your own DD.\n\n\\---\n\n# 10. TLDR: 🍆💦 = 🐰🚀\n\nPLBY has loaded a lot of fuel into a rocket. OnlyFans, by being fuck-ups, also contributed some fuel to the rocket. So has Instagram. When Centerfold launches, PLBY will be igniting that rocket. If you are unaware of the company turnaround, and that Centerfold is launching soon, then it is likely not yet priced in. Despite all this... IV30 sits at 94%. I like the stock, and I'm jacked to the tits with shares and Jan $35 and $40. Also, afaik, so is the GME banana guy.",
  "author_fullname": "t2_rx33rz7",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 2,
  "clicked": false,
  "title": "🍆💦 = 🐰🚀 -- $PLBY hitting an inflection point, and will challenge OnlyFans and Instagram in early December.",
  "link_flair_richtext": [
    {
      "e": "text",
      "t": "DD"
    }
  ],
  "subreddit_name_prefixed": "r/wallstreetbets",
  "hidden": false,
  "pwls": 7,
  "link_flair_css_class": "dd",
  "downs": 0,
  "thumbnail_height": 105,
  "top_awarded_type": null,
  "hide_score": false,
  "media_metadata": {
    "csr85xqb88081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 48,
          "x": 108,
          "u": "https://preview.redd.it/csr85xqb88081.png?width=108&crop=smart&auto=webp&s=d9f247c997d7a71082c629cec687bbaa42cfc9b6"
        },
        {
          "y": 97,
          "x": 216,
          "u": "https://preview.redd.it/csr85xqb88081.png?width=216&crop=smart&auto=webp&s=abe8dc74bd8d5123b93ccaf380fa9095bf5a8e18"
        },
        {
          "y": 144,
          "x": 320,
          "u": "https://preview.redd.it/csr85xqb88081.png?width=320&crop=smart&auto=webp&s=3295a64cccb44ba7c191552d63b2024c70575e26"
        },
        {
          "y": 288,
          "x": 640,
          "u": "https://preview.redd.it/csr85xqb88081.png?width=640&crop=smart&auto=webp&s=c1597e7915014180e9b9360e6be8392b430358fe"
        },
        {
          "y": 432,
          "x": 960,
          "u": "https://preview.redd.it/csr85xqb88081.png?width=960&crop=smart&auto=webp&s=45afd8dab27a0751c59e6061f5f6896dcd3efdcd"
        },
        {
          "y": 486,
          "x": 1080,
          "u": "https://preview.redd.it/csr85xqb88081.png?width=1080&crop=smart&auto=webp&s=ec119627728812560480773179f4122aab467497"
        }
      ],
      "s": {
        "y": 818,
        "x": 1817,
        "u": "https://preview.redd.it/csr85xqb88081.png?width=1817&format=png&auto=webp&s=c3099ef24563c813f6405421dbf46fca09104990"
      },
      "id": "csr85xqb88081"
    },
    "4yop9ww188081": {
      "status": "valid",
      "e": "Image",
      "m": "image/jpg",
      "p": [
        {
          "y": 81,
          "x": 108,
          "u": "https://preview.redd.it/4yop9ww188081.jpg?width=108&crop=smart&auto=webp&s=ac13963b56935742d445b59a074976c8af749629"
        },
        {
          "y": 162,
          "x": 216,
          "u": "https://preview.redd.it/4yop9ww188081.jpg?width=216&crop=smart&auto=webp&s=23361f4ac1dff8995d1700d2e8b09d462235c54a"
        },
        {
          "y": 240,
          "x": 320,
          "u": "https://preview.redd.it/4yop9ww188081.jpg?width=320&crop=smart&auto=webp&s=b2b7c315afa7ab6711cf14c825f7d2382255b83c"
        },
        {
          "y": 480,
          "x": 640,
          "u": "https://preview.redd.it/4yop9ww188081.jpg?width=640&crop=smart&auto=webp&s=2fe6a0b1d0ddda90eee293bbaf8ca40099c4c15c"
        },
        {
          "y": 720,
          "x": 960,
          "u": "https://preview.redd.it/4yop9ww188081.jpg?width=960&crop=smart&auto=webp&s=af86965d449d533fd9dbdeebb895ecfe9cb076db"
        },
        {
          "y": 810,
          "x": 1080,
          "u": "https://preview.redd.it/4yop9ww188081.jpg?width=1080&crop=smart&auto=webp&s=0e4704f23f216077e48da4c9bfa618b7e94b0c03"
        }
      ],
      "s": {
        "y": 852,
        "x": 1136,
        "u": "https://preview.redd.it/4yop9ww188081.jpg?width=1136&format=pjpg&auto=webp&s=8c89c24a3a378e34a53309c2f1342860b2e2de41"
      },
      "id": "4yop9ww188081"
    },
    "t0jb1z2388081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 66,
          "x": 108,
          "u": "https://preview.redd.it/t0jb1z2388081.png?width=108&crop=smart&auto=webp&s=bb642db75a49f84f39f3012057c6aa892fe9f2d2"
        },
        {
          "y": 133,
          "x": 216,
          "u": "https://preview.redd.it/t0jb1z2388081.png?width=216&crop=smart&auto=webp&s=4ec317ac9e97a66f11225326ec87e2ac8702a9ec"
        },
        {
          "y": 197,
          "x": 320,
          "u": "https://preview.redd.it/t0jb1z2388081.png?width=320&crop=smart&auto=webp&s=a3df6e5c1cb5c4759bff25e1444bfc2e7d8cfbec"
        },
        {
          "y": 395,
          "x": 640,
          "u": "https://preview.redd.it/t0jb1z2388081.png?width=640&crop=smart&auto=webp&s=04ef92d98f88a98880cd1ecb8ff5c9e0bb9d36cc"
        },
        {
          "y": 593,
          "x": 960,
          "u": "https://preview.redd.it/t0jb1z2388081.png?width=960&crop=smart&auto=webp&s=d00492ac66dc84d936c85d60ecdbcd1a5bb1b3cb"
        }
      ],
      "s": {
        "y": 632,
        "x": 1023,
        "u": "https://preview.redd.it/t0jb1z2388081.png?width=1023&format=png&auto=webp&s=b57916204f31e0b9666548515be80c0b0d396e39"
      },
      "id": "t0jb1z2388081"
    },
    "rl85o1ca88081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 52,
          "x": 108,
          "u": "https://preview.redd.it/rl85o1ca88081.png?width=108&crop=smart&auto=webp&s=8ed1bc915487ec48422be4d2bb70a4dfae033030"
        },
        {
          "y": 105,
          "x": 216,
          "u": "https://preview.redd.it/rl85o1ca88081.png?width=216&crop=smart&auto=webp&s=10dcfa45ab5b021a04b160ee130bc7969303cf73"
        },
        {
          "y": 155,
          "x": 320,
          "u": "https://preview.redd.it/rl85o1ca88081.png?width=320&crop=smart&auto=webp&s=a458b1aee08b921170d23acbaeb6e1cb8fd05a65"
        },
        {
          "y": 311,
          "x": 640,
          "u": "https://preview.redd.it/rl85o1ca88081.png?width=640&crop=smart&auto=webp&s=2a1bc0dd66416a7e49a1feb073d39aaa019b2e37"
        }
      ],
      "s": {
        "y": 344,
        "x": 706,
        "u": "https://preview.redd.it/rl85o1ca88081.png?width=706&format=png&auto=webp&s=95310a4d17798ac12f268f3947529968bace9ff3"
      },
      "id": "rl85o1ca88081"
    },
    "t7ya5hz588081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 48,
          "x": 108,
          "u": "https://preview.redd.it/t7ya5hz588081.png?width=108&crop=smart&auto=webp&s=5a9c2e12d524aae14a3c1810c670632a3d388819"
        },
        {
          "y": 96,
          "x": 216,
          "u": "https://preview.redd.it/t7ya5hz588081.png?width=216&crop=smart&auto=webp&s=4634425f3458be30ad9be8ea38a114b942372beb"
        },
        {
          "y": 143,
          "x": 320,
          "u": "https://preview.redd.it/t7ya5hz588081.png?width=320&crop=smart&auto=webp&s=694224880a90b5062c217664362b87abeecb2c06"
        },
        {
          "y": 286,
          "x": 640,
          "u": "https://preview.redd.it/t7ya5hz588081.png?width=640&crop=smart&auto=webp&s=31e7f938aa539bb1fe27478b430f1e38cb859506"
        }
      ],
      "s": {
        "y": 424,
        "x": 946,
        "u": "https://preview.redd.it/t7ya5hz588081.png?width=946&format=png&auto=webp&s=0c7c3392c43b7d2ca4a3ddd6be784c0f18b5d6de"
      },
      "id": "t7ya5hz588081"
    },
    "ni0dz7l788081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 106,
          "x": 108,
          "u": "https://preview.redd.it/ni0dz7l788081.png?width=108&crop=smart&auto=webp&s=26409fba8782511c5b4d44586eed992aa69a412b"
        },
        {
          "y": 213,
          "x": 216,
          "u": "https://preview.redd.it/ni0dz7l788081.png?width=216&crop=smart&auto=webp&s=8de1a47d4a8f77323d24b5bf84a66df7d8c02ed4"
        }
      ],
      "s": {
        "y": 291,
        "x": 294,
        "u": "https://preview.redd.it/ni0dz7l788081.png?width=294&format=png&auto=webp&s=5e06ef1abd961abf6630b7621443b13ea27d0dcd"
      },
      "id": "ni0dz7l788081"
    },
    "skj0dm4988081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 14,
          "x": 108,
          "u": "https://preview.redd.it/skj0dm4988081.png?width=108&crop=smart&auto=webp&s=b2010842ca927b56b0eb8849aca80e9e2aa46127"
        },
        {
          "y": 28,
          "x": 216,
          "u": "https://preview.redd.it/skj0dm4988081.png?width=216&crop=smart&auto=webp&s=3e5ac5941b34da411aa76eff8b89d83cd4ac5e22"
        },
        {
          "y": 41,
          "x": 320,
          "u": "https://preview.redd.it/skj0dm4988081.png?width=320&crop=smart&auto=webp&s=a5537af24f43b1c53ecece1548c72f6e57c1b0ce"
        },
        {
          "y": 83,
          "x": 640,
          "u": "https://preview.redd.it/skj0dm4988081.png?width=640&crop=smart&auto=webp&s=de65faf1fae75b22a488306f66ce01ffbacadde5"
        },
        {
          "y": 124,
          "x": 960,
          "u": "https://preview.redd.it/skj0dm4988081.png?width=960&crop=smart&auto=webp&s=4ac3d9579ade8cf4892be8fc695afd80e68e8620"
        },
        {
          "y": 140,
          "x": 1080,
          "u": "https://preview.redd.it/skj0dm4988081.png?width=1080&crop=smart&auto=webp&s=0928d1b46e0f8725a3d8ba28a86edcab1e9b26bf"
        }
      ],
      "s": {
        "y": 176,
        "x": 1353,
        "u": "https://preview.redd.it/skj0dm4988081.png?width=1353&format=png&auto=webp&s=dd4cabddc5d8399212e098288ab8e8399a68e93c"
      },
      "id": "skj0dm4988081"
    },
    "fn9vs5b488081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 66,
          "x": 108,
          "u": "https://preview.redd.it/fn9vs5b488081.png?width=108&crop=smart&auto=webp&s=0156d3326e506ad33097acae94e8c75edb8c038e"
        },
        {
          "y": 132,
          "x": 216,
          "u": "https://preview.redd.it/fn9vs5b488081.png?width=216&crop=smart&auto=webp&s=f2bde818eca06e89e48ba5cafd8c9806ff85a69f"
        },
        {
          "y": 196,
          "x": 320,
          "u": "https://preview.redd.it/fn9vs5b488081.png?width=320&crop=smart&auto=webp&s=8f541918f0dd7f960dbc0584b24c5a9cb6c32a1f"
        },
        {
          "y": 393,
          "x": 640,
          "u": "https://preview.redd.it/fn9vs5b488081.png?width=640&crop=smart&auto=webp&s=f52e34b4ecb22b6144ed84423a40c0b69734e099"
        },
        {
          "y": 590,
          "x": 960,
          "u": "https://preview.redd.it/fn9vs5b488081.png?width=960&crop=smart&auto=webp&s=063ae07e5b43b54af7265ca564531224dc86b62f"
        }
      ],
      "s": {
        "y": 626,
        "x": 1018,
        "u": "https://preview.redd.it/fn9vs5b488081.png?width=1018&format=png&auto=webp&s=443883caa4eba6904ea439895730ee94575ae247"
      },
      "id": "fn9vs5b488081"
    },
    "76uf800d88081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 48,
          "x": 108,
          "u": "https://preview.redd.it/76uf800d88081.png?width=108&crop=smart&auto=webp&s=ff91bc0cda8cdcf3417e053090c039ae59d77156"
        },
        {
          "y": 96,
          "x": 216,
          "u": "https://preview.redd.it/76uf800d88081.png?width=216&crop=smart&auto=webp&s=a6971a2500cdacf7bb0dc713c89d755dcabbd2f6"
        },
        {
          "y": 142,
          "x": 320,
          "u": "https://preview.redd.it/76uf800d88081.png?width=320&crop=smart&auto=webp&s=d39db9960bd1185d44d54ce1906e53a1766f12de"
        },
        {
          "y": 285,
          "x": 640,
          "u": "https://preview.redd.it/76uf800d88081.png?width=640&crop=smart&auto=webp&s=2e046d0133fe626da1b4557278fe3b3c5f4931e3"
        },
        {
          "y": 428,
          "x": 960,
          "u": "https://preview.redd.it/76uf800d88081.png?width=960&crop=smart&auto=webp&s=f9a0163cb26869d3d63bbd33acc382c64b2ee9cb"
        },
        {
          "y": 482,
          "x": 1080,
          "u": "https://preview.redd.it/76uf800d88081.png?width=1080&crop=smart&auto=webp&s=86016cc315097dd894939d6199127d424db0ad85"
        }
      ],
      "s": {
        "y": 533,
        "x": 1194,
        "u": "https://preview.redd.it/76uf800d88081.png?width=1194&format=png&auto=webp&s=b661e18dac8583348a92644e0a3e0c0aaf084f9b"
      },
      "id": "76uf800d88081"
    },
    "36zeksle88081": {
      "status": "valid",
      "e": "Image",
      "m": "image/png",
      "p": [
        {
          "y": 14,
          "x": 108,
          "u": "https://preview.redd.it/36zeksle88081.png?width=108&crop=smart&auto=webp&s=e66986813edc21c0c19e403364208722a416b56e"
        },
        {
          "y": 28,
          "x": 216,
          "u": "https://preview.redd.it/36zeksle88081.png?width=216&crop=smart&auto=webp&s=d4557670b05dba50cd0004bdca180d8b7fd7ec5f"
        },
        {
          "y": 42,
          "x": 320,
          "u": "https://preview.redd.it/36zeksle88081.png?width=320&crop=smart&auto=webp&s=92143bd328ff1c05bf133a1c28b2e02785375ae9"
        },
        {
          "y": 84,
          "x": 640,
          "u": "https://preview.redd.it/36zeksle88081.png?width=640&crop=smart&auto=webp&s=f012669dfb87cc09ebee950ad7bed1344c08d056"
        }
      ],
      "s": {
        "y": 85,
        "x": 643,
        "u": "https://preview.redd.it/36zeksle88081.png?width=643&format=png&auto=webp&s=ad0d3855d682b58c9a264248afbcdc888fb3b296"
      },
      "id": "36zeksle88081"
    }
  },
  "name": "t3_qw9w1b",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.93,
  "author_flair_background_color": "transparent",
  "subreddit_type": "public",
  "ups": 1529,
  "total_awards_received": 74,
  "media_embed": {},
  "thumbnail_width": 140,
  "author_flair_template_id": "78806c26-46a2-11e9-82c1-0ee7a9b74720",
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "DD",
  "can_mod_post": false,
  "score": 1529,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "https://a.thumbs.redditmedia.com/yCQYU3ckfImWTEO-xlbFmCwwM7370SLqd_WDSWfdAv4.jpg",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [
    {
      "e": "text",
      "t": "James and the giant green dick"
    }
  ],
  "gildings": {
    "gid_1": 3,
    "gid_2": 2,
    "gid_3": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1637185824,
  "link_flair_type": "richtext",
  "wls": 7,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "richtext",
  "domain": "self.wallstreetbets",
  "allow_live_comments": true,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>tldr: You probably have no idea what PLBY is going to do, and the market probably doesn&#39;t either. Take advantage of that. Long term potential, and big catalyst early December. Make money with the bunny. Beware: Lots of execution risk.</p>\n\n<p>---</p>\n\n<p>There&#39;s an ancient saying, probably: Can&#39;t go tits up investing in tits out. Since the dawn of humankind, men have been willing to shell out their hard earned money in order to suspend all disbelief that, despite the reality that they are disgusting and utterly replaceable blobs of flesh engineered strictly to carry and disperse sperm, they are sexually desirable and relevant.</p>\n\n<p>Playboy made its name exploiting this innate male desire and also made it culturally acceptable -- they somehow convinced people that this practice of shooting swimmers all over the planet is not morally bankrupt, not entirely meaningless and pointless, but rather: it is an <em>aspiration</em> for both men and women to be a part of.</p>\n\n<p>To the dismay of the sock industry Playboy also invented a second, rather high margin, use for glossy paper. By printing images of naked women (likely also seeking the feeling of sexual desirability and relevance) on those pages, Playboy was able to sell those glossy sheets of paper for an incredible mark up... every month. They were also able to build one of the world&#39;s most recognizable brands. (It&#39;s estimated that the brand has 97% recall. Try to name any other brand with that kind of branding valued below $2b)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/4yop9ww188081.jpg?width=1136&amp;format=pjpg&amp;auto=webp&amp;s=8c89c24a3a378e34a53309c2f1342860b2e2de41\">From the interview within: \\&quot;I think any man enjoys flirtations, and if he said he didn’t, he’d be lying or he’d be a politician trying to get the extra four votes. I think everybody likes knowing he’s well responded to.\\&quot;</a></p>\n\n<p>But the times changed, and so did the time honored tradition of rubbing a quick one out between some pages and hastily disposing of the evidence. Though Viagra was able to extend and harden the founder&#39;s penis, it did not, unfortunately, have a similar effect on the business. First VHS, then the internet. Before too long, sock companies were once again rejoicing as hoards of mongers fixed their eyes to screens and their hands to computer peripherals and footwear. At least we&#39;re saving some trees.</p>\n\n<p>As the popularity of Playboy faded, management tried a few retarded last ditch efforts to pep up their brand, including removing the cartoons, ending full frontal nudity, and ditching the slogan &quot;Entertainment for Men&quot;. It was, unsurprisingly, to no avail.</p>\n\n<p>Playboy&#39;s last physical print was February 2016, and by Hugh Hefner&#39;s death in late 2017, Playboy was basically a limp dick -- left to decay as dying publishing business with no vision behind it, leaving behind only an iconic logo, brand, and story.</p>\n\n<p>---</p>\n\n<h1>1. The new Playboy</h1>\n\n<p>Playboy was taken private in 2010, only to resurface publicly as a SPAC earlier this year. At the helm, CEO Ben Kohn has put a significant amount of work and thought into reviving and positioning the business to fit into today&#39;s world.</p>\n\n<p>I won&#39;t get into the details of the acquisitions and pivots PLBY has made since Ben took the helm and PLBY went public. Basically, it&#39;s been a year-long revamp. The main theme of the new PLBY is to focus on high-margin direct-to-consumer ecommerce, with the recent reveal of Centerfold tying it all together.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/t0jb1z2388081.png?width=1023&amp;format=png&amp;auto=webp&amp;s=b57916204f31e0b9666548515be80c0b0d396e39\">Pieces set in place... and beast Centerfold on the way.</a></p>\n\n<p>A summary of the pieces they&#39;ve collected:</p>\n\n<ul>\n<li>Licensing: leveraging the brand to collect easy tendies. Improving licensing deals is basically free money, and they&#39;re making progress.</li>\n<li>Playboy.com: High margin DTC ecommerce. It&#39;s clear from sales data it&#39;s not boomer-centered.</li>\n<li>Yandy &amp; Lovers: Sexual Wellness products. Ideally, Centerfold will drive even more revenue.</li>\n<li>Honey Birdette: High quality, high margin lingerie and swimwear. Also important: talent and logistics. Think designers and supply chain capabilities. Rather than outsourcing design and manufacturing of clothes, PLBY can keep the margin to themselves. Ideally, they&#39;ll be selling a lot of this stuff as they drive customers to it from Centerfold.</li>\n<li>NFTs: A team that&#39;s proven the ability to launch NFTs and print money. Several successful projects under their belt at this point. NFT transfers provide recurring revenue via OpenSea&#39;s &quot;royalty&quot; system. Eg, each time an NFT is traded, PLBY gets 10%.</li>\n<li>Centerfold: They acquired &quot;Dream.me&quot; in Oct, which provides the technology and talent of which Centerfold will be built on. The team was acquired in nearly all stock, so their interests are aligned: build a kick ass platform and profit.</li>\n</ul>\n\n<p>PLBY has its fingers in a lot of pies, but what stands out to me is how everything will fit together with Centerfold. <strong>Centerfold will be Playboy&#39;s creator platform.</strong> Think Patreon, or OnlyFans... <strong>except not only is there massive revenue potential in and of itself, there is the potential to drive revenue through all the other channels set in place.</strong> Centerfold was announced September, with a launch date of Q2 2022... but on Oct 21 was advanced to Q4 2021, and in Q3 earnings call to &quot;early December&quot;. More on the Centerfold story later.</p>\n\n<h2>The Q3 Inflection Point</h2>\n\n<p>It&#39;s not an easy task to take a dying publishing company with a fading image and come up with a cohesive strategy to revive it, and it&#39;s even harder to communicate that strategy to the market... especially in such a murky industry. If you read through the various statements of what PLBY is and its direction, you&#39;ll find a lot of major (and minor) pivots along the way in the past year or two. <strong>However, for me, Q3 marks the point at which all the pieces are set and the real execution begins in earnest.</strong></p>\n\n<p>What I mean by &quot;inflection point&quot; here is that the strategy is solidifying, and is showing early signs of working. The Q3 call has provided the following:</p>\n\n<ul>\n<li>the direction PLBY has settled on: high-margin goods, DTC, Licensing, NFTs, and Centerfold tying it all together.</li>\n<li>how the company plans to leverage their brand</li>\n<li>revenues are growing, even without Centerfold</li>\n<li>Centerfold is indeed going to happen, and the launch of it seems promising</li>\n</ul>\n\n<p>Basically, the strategy has been set, is showing signs of working. <strong>PLBY is clearly transitioning from a shell of a brand into a business that will print.</strong> Centerfold will kick this all into high gear:</p>\n\n<blockquote>\n<p>&quot;And then when you couple that with CENTERFOLD, and how this flywheel all works together. CENTERFOLD is not only an unbelievably lucrative financial opportunity for the company. It also provides an ongoing relationship with the talent that we have worked with for 70 plus years. We also have access now to all of those subscribers on the CENTERFOLD platform that will benefit not only the Playboy membership, but also our commerce efforts as well. And so, all of this sort of comes together in this cohesive ecosystem or flywheel. I&#39;m really excited by the potential for what we can deliver moving forward on a recurring revenue basis.&quot; - Ben Kohn, CEO, Q3 earnings.</p>\n</blockquote>\n\n<p>Perhaps more importantly, I also think that the messaging and marketing to investors has reached an inflection point as well. Starting now, when investors ask &quot;what the fuck is PLBY and why should I care&quot;, a clear picture can be messaged. It&#39;s shifting from &quot;a once-dying publishing business that is now a sexual wellness lifestyle brand, brough public via SPAC&quot; -- it&#39;s more like a real business with clear strategy that can print.</p>\n\n<p>From the picture above, it&#39;s clear that Centerfold is the meat of the sandwich, so let&#39;s get into it.</p>\n\n<p>---</p>\n\n<h1>2. CENTERFOLD vs OnlyFans</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fn9vs5b488081.png?width=1018&amp;format=png&amp;auto=webp&amp;s=443883caa4eba6904ea439895730ee94575ae247\">OnlyFans felt like destroying their reputation. They&#39;ve since reversed this, but the damage has been done.</a></p>\n\n<p>It&#39;s incredible to me that I hadn&#39;t heard about Centerfold until a few weeks ago. In fact, that&#39;s what got me started down this rabbit hole: A publicly listed company is going to create an OnlyFans competitor? How the fuck have I not heard of this? <strong>I think the potential of Centerfold is barely priced in to PLBY</strong>.</p>\n\n<p><strong>You probably heard about OnlyFans&#39; ban on sexual content... but did you hear about Centerfold? That&#39;s about how priced in this is.</strong></p>\n\n<p>The potential here:</p>\n\n<ul>\n<li>Publicity for the stock.</li>\n<li>Ability for market to gain exposure to a thriving industry.</li>\n<li>Massive amount of recurring tendies, which the market loves.</li>\n<li>Revenue that could easily eclipse the rest of PLBY&#39;s portfolio.</li>\n<li>Putting Playboy back into the zeitgeist and ushering in the next generation of cultural relevance.</li>\n<li>Memeability.</li>\n</ul>\n\n<p>Dig a little deeper, and you&#39;ll find the timing could not possibly be better:</p>\n\n<ul>\n<li>OnlyFans fucked up in August by announcing a ban on sexual content (they reverted this days later). Massive reputational damage, and fears payment processing might be rug pulled.</li>\n<li>The revelation that the OnlyFans owner is a piece of shit</li>\n<li>Stories about how OnlyFans does not vet creators properly, allowing a 14yo on the platform.</li>\n<li><strong>Content creators want to ditch OnlyFans</strong></li>\n<li>Cultural push towards female empowerment and entrepreneurship</li>\n<li>Can you think of a better company to do this than Playboy?</li>\n<li>Retarded market offering crazy valuations for anything remotely technology or WFH based</li>\n<li>Launch date pushed up to early December</li>\n</ul>\n\n<h2>Understanding the content creation business</h2>\n\n<p>I know the first thing you retards are going to think is &quot;durr... Mixer couldn&#39;t get market share from Twitch... so Centerfold gonna fail too!!&quot; Ok, fuckheads, try to wrap your head around this: <strong>There are major differences between the Twitch/Mixer business and the OnlyFans/Centerfold business</strong>. Yes, they both involve content creators and viewers. Yes, they both take a cut of subscriptions. But use your fucking wrinkles and you&#39;ll see some key differences.</p>\n\n<p><strong>There&#39;s a reason that &quot;hey whats your OF&quot; is a meme, and &quot;hey whats your twitch&quot; isn&#39;t.</strong></p>\n\n<p>Twitch/Mixer:</p>\n\n<ul>\n<li>What creators want: exposure to as wide an audience as possible. More viewers = more ad revenue, subscriptions, etc.</li>\n<li>What viewers want: a wide array of content. Discoverability. Time wasting.</li>\n<li>Network effect: <strong>MASSIVE</strong>. More creators = more audience. More audience = more creators.</li>\n<li>Structure: basically like a TV with various channels</li>\n<li>Summary: audience draws in creators, creators draw in more viewers, a virtuous cycle.</li>\n</ul>\n\n<p>OnlyFans/Centerfold:</p>\n\n<ul>\n<li>What creators want: a platform to handle the hosting and monetization of their content.</li>\n<li>What viewers want: a place to &quot;consume content&quot; of very particular creator(s)</li>\n<li>Network effect: <strong>LOW</strong>.  Subscriptions are driven by creators hustling their OF link. Discoverability is not required.</li>\n<li>Structure: basically separate &quot;blogs&quot; for each content creator</li>\n<li>Summary: creators draw in their own audience, eg: &quot;What&#39;s your OF link?&quot;</li>\n</ul>\n\n<p>In short: Twitch/Mixer business relies on both viewers and content creators joining their platform -- the more of each, the better. Massive network effect, massive moat for Twitch. <strong>OnlyFans/Centerfold relies, almost soley, on content creators joining their platform.</strong> This is all made evident by how the sites are structured (channels vs blogs), and how they are used (think of how you&#39;d find a twitch streamer vs how you&#39;d find an OF creator).</p>\n\n<h2>How PLBY steals market share from OnlyFans</h2>\n\n<p>The key question is: <strong>if you were a content creator trying to sell your feet pics, how do you choose which platform to use?</strong></p>\n\n<h2>Reputation</h2>\n\n<p>You&#39;d probably want to choose a platform that will pay you, that will allow your content, and that is not owned by a scumbag. Let&#39;s compare.</p>\n\n<p>OnlyFans:</p>\n\n<ul>\n<li>In August, said they were having trouble raising money and with payment processing. As a result, <strong>said they would no longer allow sexual content, effective within weeks</strong>. (They reversed this decision days later.) Imagine having all of your revenue suddenly pulled out from under you. Well, first imagine you made money to begin with. <strong>Massive, irrecoverable reputation damage.</strong></li>\n<li>Founder is a shithead. He made his money creating websites that would claim to have links to pedophilia and bestiality. Thankfully, it was a scam: those links went to legit porn sites and produced affiliate revenue. Imagine a person that the world is thankful is a scammer. That&#39;s this guy.</li>\n<li>Allowed under-18s on the platform. Google it. Not a good look, not investable, either.</li>\n<li>Overall, for better or worse, a somewhat trashy reputation to say you&#39;re on OnlyFans.</li>\n</ul>\n\n<p>Playboy:</p>\n\n<ul>\n<li>Decades long reputation of free speech, sex positivity, and sophistication.</li>\n<li>Publicly traded revenue generating company; high confidence they will keep paying your bills.</li>\n<li>Not much shame in saying you were a playmate. Lots of bunny tattoos.</li>\n</ul>\n\n<p>In short... would you rather tattoo your ankle with an OnlyFans logo, or a Playboy bunny logo? And which company would you trust to pay you?</p>\n\n<h2>Economics and the 80/20 rule</h2>\n\n<p>While there are countless creators on OnlyFans, the vast majority of revenue comes from a tiny minority of creators. PLBY just needs to win those creators over. It&#39;s not as monstrous of a task as you might think.</p>\n\n<blockquote>\n<p>&quot;More than 300 OnlyFans creators reportedly earn at least $1 million annually, while 16,000 creators make at least $50,000 a year.&quot; -CNBC article</p>\n</blockquote>\n\n<p>PLBY can offer creators more revenue, and more revenue streams:</p>\n\n<ul>\n<li>Offer a higher rev share</li>\n<li>Allow creators to sell merchandise</li>\n<li>Allow creators to sell NFTs</li>\n</ul>\n\n<p>---</p>\n\n<h1>3. CENTERFOLD vs Instagram</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/t7ya5hz588081.png?width=946&amp;format=png&amp;auto=webp&amp;s=0c7c3392c43b7d2ca4a3ddd6be784c0f18b5d6de\">Instagram is not a fan of tits and will slam the banhammer.</a></p>\n\n<p>With regards to Centerfold, less talked about is how it can function as a nudity friendly version of Instagram, and the potential there.</p>\n\n<p>Instagram has a pretty strict content policy, and models are finding their accounts randomly get deleted due to TOS violations. Tens to hundreds of thousands of followers can vanish in an instant. Tumblr is gone, too -- so where&#39;s a girl to go to post her new fake tits?</p>\n\n<p><strong>There is huge potential in a nudity friendly Instagram clone.</strong> Playboy&#39;s motto? &quot;nudity is normal&quot;.</p>\n\n<p>Playboy won&#39;t have to rely on ads to generate revenue from Centerfold -- they can simply drive traffic to their existing assets. Lingerie. Sex toys. Centerfold subscriptions.</p>\n\n<p>Easy win, here, and if you go around reading DDs about PLBY and Centerfold, you&#39;ll find it overlooked.</p>\n\n<p>---</p>\n\n<h1>4. Centerfold Launch Progress</h1>\n\n<p>Centerfold was initially announced in September, shortly after OnlyFans made their retarded announcement that they would not allow sexual content. The initial launch date was planned for Q2 2022. Google &quot;playboy centerfold medium&quot;.</p>\n\n<p>On Oct 21, Centerfold announced the acquisition of Dream.me, a creator-driven/social media platform. Basically, a clone of Instagram. This acquisition was in all stock, and provided a skeleton for the platform, but more importantly a strongly incentivized team willing to bust their ass to get this thing out there. Launch date was move up to Q4 2021.</p>\n\n<p>Since then, the stock has been marching upwards.</p>\n\n<p>Q3 earnings, as hoped, provided some guidance on how things are going with Centerfold.</p>\n\n<blockquote>\n<p>&quot;In general, the platform is in place and we think what we have assembled today is truly a competitive differentiator moving forward as we think about membership and CENTERFOLD. What we can offer the creative community is something that no one else can offer. And I think that&#39;s referenced by the founding creators that we have signed up to launch with that represent in excess of 300 million social media followers.&quot; - Q3 earnings call</p>\n</blockquote>\n\n<p>Also, there&#39;s this:</p>\n\n<blockquote>\n<p>&quot;Founding creators on CENTERFOLD will bring in ~300 million social media followers, and hundreds of millions in existing GMV&quot; -whossayn on theideafund</p>\n</blockquote>\n\n<p>And this, in response to &quot;And one super quick follow up for these early CENTERFOLD launch partners, what kinds of creators are in there?&quot;:</p>\n\n<blockquote>\n<p>&quot;So they are huge music stars, to former playmates, to adult stars, to artists, to other influencers, actors, celebrities. It&#39;s really -- we&#39;ve really been overwhelmed by the response from the creator community, and also by the diversity of the creators that we brought in. And I think it&#39;s going to truly be something that&#39;s unique&quot; -Ben Kohn</p>\n</blockquote>\n\n<p>---</p>\n\n<h1>5. NFTs</h1>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ni0dz7l788081.png?width=294&amp;format=png&amp;auto=webp&amp;s=5e06ef1abd961abf6630b7621443b13ea27d0dcd\"> \\&quot;Rabbitar\\&quot; NFTs will grant special membership and perks to various things. What, exactly, is TBA.</a></p>\n\n<p>I don&#39;t personally give a shit about NFTs, but PLBY is interesting in this regard. I&#39;ll keep this brief:</p>\n\n<ul>\n<li>Their run up to $60 was due to an NFT they launched.</li>\n<li>They&#39;ve since launched a much larger, and more interesting NFT series: Rabbitars. Sold out quickly, produced $9M in revenue, and will produce recurring revenue (10% on each transfer). No run up this time, though</li>\n<li>Rabbitar NFT will have an IRL use: it&#39;s planned to serve as &quot;membership&quot; to various Playboy/Centerfold things. Perks, discounts, live events... a lot of possibilities here, especially if each Rabbitar has different perks. AFAIK, no other public company has tied NFTs to real life.</li>\n</ul>\n\n<p>---</p>\n\n<h1>6. Additional considerations</h1>\n\n<p>I don&#39;t think PLBY has reach anywhere near its peak in terms of potential market interest, both retail and institutional. It has a lot of solid followers and believers of the stock, though:</p>\n\n<ul>\n<li>GME O.G. and banana aficionado <a href=\"/u/uberkikz11\">/u/uberkikz11</a> is quite vocally bullish</li>\n<li>Google &quot;hedgeye PLBY&quot;</li>\n<li>Just google the damn ticker and do some DD for yourself</li>\n<li>PLBY might represent the best ticker in the market to invest in men jerking off and women whoring themselves.</li>\n</ul>\n\n<p>---</p>\n\n<h1>7. ⚠️⚠️⚠️⚠️ THE BEAR CASES ⚠️⚠️⚠️⚠️</h1>\n\n<p>It&#39;s important to understand Centerfold is not a sure fire thing. There is <strong>considerable execution risk</strong>. I&#39;ll lay out what I think are the big &quot;ifs&quot;.</p>\n\n<h2>The Product</h2>\n\n<ul>\n<li><strong>Flaccid launch</strong>: It&#39;s possible Centerfold, when launched, just sucks. It can come off as a shitty clone of Instagram or OnlyFans, and the market&#39;s confidence can be shaken.</li>\n<li><strong>Delayed launch</strong>: It&#39;s a tech product, and subject to feature creep, bugs, etc. The deadline is extremely aggressive, and it&#39;s possible it gets pushed back. However, guidance on release was given days ago, so it&#39;s likely. But, still possible.</li>\n<li><strong>Exposure concerns</strong>: investability / payment processor / etc. Despite what you might think, PLBY has a strong E.S.G. vibe to it, so I think it should be OK. They are &gt;50% female employees (I think), and for better or worse, they&#39;re very vocally woke. I think Ben Kohn does a great job walking the line between investable and &quot;proper&quot;.</li>\n</ul>\n\n<h2>The Policies</h2>\n\n<p>The biggest risks, in my opinion.</p>\n\n<ul>\n<li><strong>Shitty creators</strong>: Though the pool of initial creators has been talked up by management, but not defined.  It&#39;s possible they actually suck. Imagine a line-up of &quot;unconventional beauty&quot;. Eg, &quot;body positive&quot; woke bullshit that is attempted to be marketed as the new wave of sexual wellness. While this is possible, I think it&#39;s unlikely. Ben Kohn knows what&#39;s up.</li>\n<li><strong>Content policy</strong>. On a recent interview on FOX, where the host was an asshole, Ben Kohn stated there will be no &quot;porn&quot;.. or orgies on their airplane. However, the term &quot;porn&quot; was never defined... and he was talking with FOX, so he had to be careful what he said. In my opinion, if they allow nudity but no masturbation, that could be bad. If there&#39;s no scat, probably less of a concern.</li>\n</ul>\n\n<p>I&#39;m somewhat worried about these given the amount of woke-speak of this company, but I&#39;m confident management knows where the dollars are:  </p>\n\n<p><a href=\"https://preview.redd.it/skj0dm4988081.png?width=1353&amp;format=png&amp;auto=webp&amp;s=dd4cabddc5d8399212e098288ab8e8399a68e93c\">Content policy is up in the air. Requires faith.</a></p>\n\n<p>Each notch up on the &quot;debauchery&quot; scale of porn likely captures less and less revenue. For fun, that scale might look like this:</p>\n\n<ol>\n<li>See through clothes, costumes, etc</li>\n<li>Frontal Nudity</li>\n<li>Pussy close-ups</li>\n<li>Light bondage</li>\n<li>Sucking on dildos</li>\n<li>Insertion of dildos</li>\n<li>Butthole stuff</li>\n<li>Penises</li>\n<li>Penises inside of things</li>\n<li>Aggressive BDSM</li>\n<li>Cum</li>\n<li>A lot of cum all over and inside of various things</li>\n<li>Pee-pee and poo-poo</li>\n<li>I don&#39;t even know. Feel free to comment!</li>\n</ol>\n\n<p>The risk is they land somewhere too low on the scale to capture significant revenue and interest from OnlyFans-esque creators. Again, I trust their judgement... but I&#39;d feel much more comfortable knowing the exact policy before launch.</p>\n\n<p>On the plus side, there&#39;s likely an 80/20 rule here. Going up the the scale will uncapture less and less revenue. So, even if they go pretty light, there&#39;s plenty of opportunity. And, it should be noted that even if they go very light, the Centerfold vs. Instagram thesis would still hold quite strong. Creators need a home to post nudes.</p>\n\n<h2>Insider Selling</h2>\n\n<p>This last one you might have heard about if you follow the stock.</p>\n\n<p>Some people made a big deal about a recent filing where the CEO and other insiders were granted a bunch of shares to sell. Rumors went flying that a ton of shares were about to get sold.</p>\n\n<p>It&#39;s my understanding this is a nothingburger and par for the course. Yes, they got their shares... per their employment agreements or whatever. No, there is nothing there that is saying they will sell.  They <em>can</em> sell, but management has been clear they are in this for the long run.</p>\n\n<p>---</p>\n\n<h1>8. Technicals</h1>\n\n<h2>Historical IV</h2>\n\n<p><a href=\"https://preview.redd.it/rl85o1ca88081.png?width=706&amp;format=png&amp;auto=webp&amp;s=95310a4d17798ac12f268f3947529968bace9ff3\">IV far lower than it was due to NFTs, despite PLBY having more catalysts right now.</a></p>\n\n<p>Given an advertised massive catalyst coming in early December, the IV30 sits at around 95%. I believe this is a massive mispricing.</p>\n\n<h2>Price Action</h2>\n\n<p><a href=\"https://preview.redd.it/csr85xqb88081.png?width=1817&amp;format=png&amp;auto=webp&amp;s=c3099ef24563c813f6405421dbf46fca09104990\">Annotated events of interest</a></p>\n\n<p>Here&#39;s summary of price action this year. Notice the creep up after Centerfold was announced. I personally think this is bullish and the start of an upwards channel as we approach early December, but what the fuck do I know.</p>\n\n<h2>Gamma</h2>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/76uf800d88081.png?width=1194&amp;format=png&amp;auto=webp&amp;s=b661e18dac8583348a92644e0a3e0c0aaf084f9b\">Modest gamma</a></p>\n\n<p>Gamma on this one is nothing too crazy, though as a percentage of daily volume it is significant. A rush into options would likely push the price up somewhat, but I doubt a squeeze is in play.</p>\n\n<p>---</p>\n\n<h1>9. Positions and Price Target</h1>\n\n<h2>Positions</h2>\n\n<p><a href=\"https://preview.redd.it/36zeksle88081.png?width=643&amp;format=png&amp;auto=webp&amp;s=ad0d3855d682b58c9a264248afbcdc888fb3b296\">Shares and calls. This is the way.</a></p>\n\n<ul>\n<li>2000 x Shares: Safest bet. I&#39;m happy locking these away and looking at them a year from now.</li>\n<li>60 x Jan $35 calls: Anticipating a run up towards Centerfold launch (early December), giving a little extra time for bumps.</li>\n<li>80 x Jan $40 calls: More aggressive, and hoping to capture some IV gain here.</li>\n</ul>\n\n<h2>Targets</h2>\n\n<p>I&#39;m selling if IV30 runs above 200. Not worth that much risk. I&#39;m trimming at $50, much more aggressively at $60, and out if hits $70. This is my personal preference, based on my personal risk tolerance and what I hope to gain, and is not investment advice.</p>\n\n<h2>Other Notes</h2>\n\n<p>Read the bear case, please. And do your own DD.</p>\n\n<p>---</p>\n\n<h1>10. TLDR: 🍆💦 = 🐰🚀</h1>\n\n<p>PLBY has loaded a lot of fuel into a rocket. OnlyFans, by being fuck-ups, also contributed some fuel to the rocket. So has Instagram. When Centerfold launches, PLBY will be igniting that rocket. If you are unaware of the company turnaround, and that Centerfold is launching soon, then it is likely not yet priced in. Despite all this... IV30 sits at 94%. I like the stock, and I&#39;m jacked to the tits with shares and Jan $35 and $40. Also, afaik, so is the GME banana guy.</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": "James and the giant green dick",
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2th52",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#365b8c",
  "id": "qw9w1b",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "pennyether",
  "discussion_type": null,
  "num_comments": 245,
  "send_replies": true,
  "whitelist_status": "some_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": "dark",
  "permalink": "/r/wallstreetbets/comments/qw9w1b/plby_hitting_an_inflection_point_and_will/",
  "parent_whitelist_status": "some_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/wallstreetbets/comments/qw9w1b/plby_hitting_an_inflection_point_and_will/",
  "subreddit_subscribers": 11185836,
  "created_utc": 1637228774,
  "num_crossposts": 1,
  "media": null,
  "is_video": false,
  "original_created_utc": 1637185824,
  "the_new_excerpt": "tldr: You probably have no idea what PLBY is going to do, and the market\nprobably doesn't either. Take advantage of that. Long term potential, and big\ncatalyst early December. Make money with the bunny. Beware: Lots of execution\nrisk.\n\n---\n\nThere's an ancient saying, probably: Can't go tits up…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "tldr: PLBYが何をしようとしているのか、あなたはおそらく知らないでしょうし、市場もおそらく知らないでしょう。\n市場もおそらくわからないでしょう。それを利用しましょう。長期的な可能性があり、大きな\n12月初旬には大きなカタリストになるでしょう。バニーでお金を稼ぎましょう。注意してください。多くの実行\nリスクがあります。\n\n---\n\n古くから言われていることですが、おそらく \"Can't go tits up...",
      "title": "🍆💦 = 🐰🚀 -- 変曲点を迎えた$PLBY、12月上旬にOnlyFansとInstagramに挑戦します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "tldr: 你可能不知道PLBY要做什么，而市场也可能不知道。\n可能也不知道。利用这个优势。长期的潜力，以及大\n12月初的催化剂。用小兔子赚钱。小心。大量的执行\n风险。\n\n---\n\n有句古话，大概是这样的。不可能一败涂地......",
      "title": "🍆 = 🐰🚀 -- $PLBY达到了一个拐点，并将在12月初挑战OnlyFans和Instagram。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "tldr: 你可能不知道PLBY要做什麼，而市場也可能不知道。\n可能也不知道。利用這個優勢。長期的潛力，以及大\n12月初的催化劑。用小兔子賺錢。小心。大量的執行\n風險。\n\n---\n\n有句古話，大概是這樣的。不可能一敗塗地......",
      "title": "🍆 = 🐰🚀 -- $PLBY達到了一個拐點，並將在12月初挑戰OnlyFans和Instagram。"
    }
  ],
  "source_updated_at": 1637919680592
}