{
  "author": "Jacobiah",
  "the_new_excerpt": "I wasn't aware of the sub till it made it to all the other day. A quick look\nthrough all the top posts seem to be entiley geared toward strategically\nmanipulating men.\n\nThere's posts about 'why you should never give an ugly guy a chance'. I have\nknown people throughout my life with great…",
  "original_created_utc": 1619181059,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、すべてに掲載されるまでサブ機の存在を知りませんでした。ざっと見たところ\n男性を戦略的に操ることに主眼が置かれているようです。\n男性を戦略的に操作するためのものです。\n\n醜い男にチャンスを与えてはいけない理由」についての投稿もあります。私はこれまでの人生で\nこれまでの人生で、素晴らしい...",
      "title": "私は何かを見逃しているのか、それともr/femaledatingstrategyは単なるミサンドリストのカルトであるのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道有这个子，直到有一天它被送到了所有的地方。快速浏览一下\n通过所有的顶级帖子，似乎完全是为了在战略上\n操纵男人。\n\n有关于 \"为什么你不应该给一个丑陋的家伙一个机会 \"的帖子。我有\n我认识的人在我的生活中都有很好的...",
      "title": "我是不是错过了什么，还是说r/femaledatingstrategy只是一个MISSANDRIST的邪教组织？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道有這個子，直到有一天它被送到了所有的地方。快速瀏覽一下\n通過所有的頂級帖子，似乎完全是爲了在戰略上\n操縱男人。\n\n有關於 \"爲什麼你不應該給一個醜陋的傢伙一個機會 \"的帖子。我有\n我認識的人在我的生活中都有很好的...",
      "title": "我是不是錯過了什麼，還是說r/femaledatingstrategy只是一個MISSANDRIST的邪教組織？"
    }
  ],
  "title": "Am I missing something or is r/femaledatingstrategy just a missandrist cult",
  "created_utc": 1619265112,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wasn&#39;t aware of the sub till it made it to all the other day. A quick look through all the top posts seem to be entiley geared toward strategically manipulating men.</p>\n\n<p>There&#39;s posts about &#39;why you should never give an ugly guy a chance&#39;. I have known people throughout my life with great personalities who are not the best looking and it seems to me they think these people just deserve to die alone.</p>\n\n<p>Now nobody should have to be forced to want to date anyone but creating a movement to universally write these guys off seems just cruel and excessive. </p>\n\n<p>My initial instinct was that this is a kinda female incel club but the fact it made it to all is kinda hilarious/disconcerting.</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/mwu6g8/am_i_missing_something_or_is/",
  "subreddit": "NoStupidQuestions",
  "id": "mwu6g8",
  "is_self": true,
  "media": null,
  "is_video": false
}