{
  "author": "leanpreneur",
  "original_created_utc": 1653225279,
  "title": "I made a free landing page template specifically for Google Ads to improve your conversion rates and Google scores. This DIY html template comes with complete documentation on how to implement it using GA4 + GTM, and how to manage your leads via a spreadsheet.",
  "created_utc": 1653233909,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In my 10+ years of career working with paid traffic, I&amp;#39;ve noticed that landing pages are one of the best ways to improve conversion rates, but also one of the most complicated. I made a solution to the problem - any digital marketer can make a DIY landing page that&amp;#39;s faster and better than any paid landing page builder.&lt;/p&gt;\n\n&lt;p&gt;The template integrates with a google spreadsheet to collect leads (name and email for example) but also a few important user parameters (GCLID and GA&amp;#39;s Customer ID) to report conversions accurately with values.&lt;/p&gt;\n\n&lt;p&gt;How it works is simple: a user fills out a form, and it&amp;#39;s being sent directly to the google spreadsheet using JavaScript. Along with the form you get a GCLID and Client ID in the hidden strings for each lead. These parameters will be used to upload offline conversions into GA or Google Ads. This solves a big problem when you want to report not just all leads, but only qualified ones. I tried this approach with a number of my customers, and the form from my template was able to capture more leads than their own CRM, so they needed to investigate why they are not getting them all. This makes me believe that the code is of good quality.&lt;/p&gt;\n\n&lt;p&gt;As many of you already know, GA Universal will be deprecated next year, that&amp;#39;s why I added a GTM + GA4 integration.&lt;/p&gt;\n\n&lt;p&gt;The page loads almost instantly and gets above-average scores in Google Ads and Google Lighthouse. It&amp;#39;s important that the landing page opens quickly even if a user is on a low-speed 3G connection.&lt;/p&gt;\n\n&lt;p&gt;And most importantly, this is all for free, with no paid plugins, no ads, and no affiliate links. I&amp;#39;m giving back to the community, and use this approach with my customers too. I&amp;#39;m also interested if people need this and should I add more features, so feedback is very welcome.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://targetingpage.com/\"&gt;High-Converting Landing Page Template for PPC&lt;/a&gt;.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "permalink": "/r/SideProject/comments/uvaqy1/i_made_a_free_landing_page_template_specifically/",
  "subreddit": "SideProject",
  "id": "uvaqy1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In my 10+ years of career working with paid traffic, I've noticed that landing\npages are one of the best ways to improve conversion rates, but also one of the\nmost complicated. I made a solution to the problem - any digital marketer can\nmake a DIY landing page that's faster and better than any paid…"
}