{
  "author": "Brilliant-Ad31785",
  "the_new_excerpt": "So I’ve been watching YouTube videos trying to understand options.\n\nMostly while I row, so I have it on with subtitles. And I’m listening to music.\nSo maybe not the best way to learn.\n\nSo I finally get like I kinda got it. Then I heard some new on Thursday about\nVirgin Galactic being able to launch…",
  "original_created_utc": 1621779776,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そこで、オプションを理解しようとYouTubeのビデオを見ています。\n\nたいていは仕事をしながらなので、字幕付きで見ています。それに音楽も聴いています。\nだから、学ぶのに最適な方法ではないかもしれない。\n\nそれでようやく、なんとなくわかったような気がします。そんな中、木曜日にヴァージンギャラクティック社が\nヴァージン・ギャラクティック社が打ち上げ可能な...",
      "title": "ファーストオプション"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我一直在看YouTube视频，试图理解选项。\n\n大部分是在我划船的时候，所以我开了字幕。而且我还在听音乐。\n所以也许这不是最好的学习方式。\n\n所以我终于明白，我有点明白了。然后我在星期四听到一些关于\n维珍银河公司能够发射...",
      "title": "第一个选项"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我一直在看YouTube視頻，試圖理解選項。\n\n大部分是在我划船的時候，所以我開了字幕。而且我還在聽音樂。\n所以也許這不是最好的學習方式。\n\n所以我終於明白，我有點明白了。然後我在星期四聽到一些關於\n維珍銀河公司能夠發射...",
      "title": "第一個選項"
    }
  ],
  "title": "First Option",
  "created_utc": 1621800028,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I’ve been watching YouTube videos trying to understand options. </p>\n\n<p>Mostly while I row, so I have it on with subtitles. And I’m listening to music. So maybe not the best way to learn. </p>\n\n<p>So I finally get like I kinda got it. Then I heard some new on Thursday about Virgin Galactic being able to launch yesterday. </p>\n\n<p>I thought, shit this is good news. If it happens, great, if not oh well… so I quickly bought a $20 strike for the following day. </p>\n\n<p>Realizing the news would be better the following week, I bought a 2nd option at $20 for May 28. </p>\n\n<p>The first was executed because E*TRADE automatically executes a contract if you’re in the money at close, which I was. So that was kind of dumb luck. </p>\n\n<p>Anyway. More of a rant and just exciting cause it was my first!</p>\n</div><!-- SC_ON -->",
  "score": 76,
  "permalink": "/r/stocks/comments/nj8r6q/first_option/",
  "subreddit": "stocks",
  "id": "nj8r6q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389728
}