{
  "author": "Active_Recognition88",
  "the_new_excerpt": "CHENGDU, China/SHANGHAI, Jan 11 (Reuters) - China's electric vehicle (EV) maker\nNio Inc , which competes with conventional premium automakers including Daimler\nAG and BMW , may make mass market products under another marque, its chief\nexecutive said. \"As EV technologies advance and battery cost…",
  "original_created_utc": 1610361531,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "路透中国成都/上海1月11日电-中国电动汽车(EV)制造商\nNIO Inc.，与包括戴姆勒(Daimler)在内的传统豪华汽车制造商竞争\nAG和宝马(BMW)可能会在另一个品牌下生产大众市场产品，其首席执行官\n主管说。随着电动汽车技术的进步和电池成本…",
      "title": "中国电动汽车制造商NIO可能在另一个品牌下推出大众市场汽车"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "路透中國成都/上海1月11日電-中國電動汽車(EV)製造商\nNIO Inc.，與包括戴姆勒(Daimler)在內的傳統豪華汽車製造商競爭\nAG和寶馬(BMW)可能會在另一個品牌下生產大衆市場產品，其首席執行官\n主管說。隨着電動汽車技術的進步和電池成本…",
      "title": "中國電動汽車製造商NIO可能在另一個品牌下推出大衆市場汽車"
    }
  ],
  "title": "Chinese EV maker Nio may launch mass market vehicles under another marque",
  "created_utc": 1610385271,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>CHENGDU, China/SHANGHAI, Jan 11 (Reuters) - China&#39;s electric vehicle (EV) maker Nio Inc , which competes with conventional premium automakers including Daimler AG and BMW , may make mass market products under another marque, its chief executive said.\n&quot;As EV technologies advance and battery cost lowers, it is possible that we may enter the massive market, but definitely not with Nio brand,&quot; William Li, chief executive of Nio told reporters on Sunday. He gave no more detail.\nNio did not immediately respond to a request for further details. The company is currently delivering three sports utility vehicle (SUV) models built at its Hefei plant, which are mostly priced above 300,000 yuan ($46,200).\nNio, which also competes with Tesla Inc in China, on Saturday launched its first sedan model as it eyes a greater share of the world&#39;s largest car market.\nNio delivered 43,728 vehicles last year and has a market capitalisation of over $92 billion, surpassing conventional automakers Daimler and General Motors Co .\n($1 = 6.4898 Chinese yuan renminbi)\n(Reporting by Yilei Sun and Brenda Goh; editing by Jane Wardell)\n((<a href=\"mailto:Y.Sun@thomsonreuters.com\">Y.Sun@thomsonreuters.com</a>; +86 10 66271262; Reuters Messaging: <a href=\"mailto:y.sun.thomsonreuters.com@reuters.net\">y.sun.thomsonreuters.com@reuters.net</a>))\nKeywords: NIO CHINA/ (PIX)</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/stocks/comments/kv093c/chinese_ev_maker_nio_may_launch_mass_market/",
  "subreddit": "stocks",
  "id": "kv093c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706381136
}