{
  "author": "mafternoonshyamalan",
  "the_new_excerpt": "He's under investigation for sex trafficking by the Justice Department. Yet,\nhe's responding to all the accusations as if he's being caught up in the #MeToo\nmovement and facing a trial on Twitter. All of his actions since it was revealed\nhe's under investigation feel like the opposite of what any…",
  "original_created_utc": 1618266853,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼は司法省から性売買の調査を受けている。それなのに。\nまるで#MeToo運動に巻き込まれているかのように、すべての告発に反応しています。\nツイッターで裁判を受けているかのように対応しています。調査を受けていることが明らかになってからの彼の行動は\n調査を受けていることが明らかになってからの彼の行動は、誰が見ても正反対のように感じられます。",
      "title": "マット・ゲッツが何をしようとしているのか、誰か説明してください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "他正在接受司法部的性交易调查 He's under investigation for sex trafficking by the Justice Department. 但是\n他对所有的指控作出回应 就好像他被卷入了#MeToo事件一样\n运动，并在Twitter上面临审判。他的所有行为自从被曝光后\n他被调查的感觉就像相反的任何...",
      "title": "谁能解释一下马特-盖茨想做什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "他正在接受司法部的性交易調查 He's under investigation for sex trafficking by the Justice Department. 但是\n他對所有的指控作出迴應 就好像他被捲入了#MeToo事件一樣\n運動，並在Twitter上面臨審判。他的所有行爲自從被曝光後\n他被調查的感覺就像相反的任何...",
      "title": "誰能解釋一下馬特-蓋茨想做什麼？"
    }
  ],
  "title": "Can someone explain what Matt Gaetz is trying to do?",
  "created_utc": 1618294386,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>He&#39;s under investigation for sex trafficking by the Justice Department. Yet, he&#39;s responding to all the accusations as if he&#39;s being caught up in the #MeToo movement and facing a trial on Twitter. All of his actions since it was revealed he&#39;s under investigation feel like the opposite of what any lawyer would recommend for a person in his position to do. </p>\n\n<p>Why is he trying to frame the narrative as if it&#39;s part of cancel culture when that will have no bearing on an actual criminal trial?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/Ask_Politics/comments/mpp4pt/can_someone_explain_what_matt_gaetz_is_trying_to/",
  "subreddit": "Ask_Politics",
  "id": "mpp4pt",
  "is_self": true,
  "media": null,
  "is_video": false
}