{
  "author": "russel_leffingwell",
  "the_new_excerpt": "Hi all, just wanted to give a little extra insight on a common little metric\nthat I've been seeing thrown around too loosely around various investing\nsubreddits. Thought this would be useful for all your DD efforts.\n\nROE (Return on Equity) aka Net Income / Average Shareholders' Equity\n\nPeople love…",
  "original_created_utc": 1613420643,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好，我只是想给大家额外介绍一下一个常用的小指标\n我一直看到的太松散的各种投资周围抛出。\n子reddits。觉得这对你所有的DD工作都是有用的。\n\nROE(Return on Equity)又名净收入/平均股东权益。\n\n人们喜欢...",
      "title": "为什么你应该对ROE产生怀疑？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好，我只是想給大家額外介紹一下一個常用的小指標\n我一直看到的太鬆散的各種投資周圍拋出。\n子reddits。覺得這對你所有的DD工作都是有用的。\n\nROE(Return on Equity)又名淨收入/平均股東權益。\n\n人們喜歡...",
      "title": "爲什麼你應該對ROE產生懷疑？"
    }
  ],
  "title": "Why You Should be Suspicious of ROE",
  "created_utc": 1613427893,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, just wanted to give a little extra insight on a common little metric that I&#39;ve been seeing thrown around too loosely around various investing subreddits. Thought this would be useful for all your DD efforts.</p>\n\n<p>ROE (Return on Equity) aka Net Income / Average Shareholders&#39; Equity</p>\n\n<p>People love throwing out ROE numbers to get you to love whatever they are pitching, but you should be automatically suspicious of ROE as a headliner number.</p>\n\n<p>ROE can be written another way: ROE = ROA x Financial Leverage.</p>\n\n<p>ROA is an <strong>operating</strong> metric.</p>\n\n<p>Financial Leverage is a <strong>capital structure</strong> metric.</p>\n\n<p>So ROE is a blended metric of both: operations and capital structure.</p>\n\n<p>This is significant because when you are comparing two competitors and think that one with a higher ROE is a better value play that may be a mistake. </p>\n\n<p>Those two hypothetical companies may have the same exact ROA but company A may just have borrowed heavily, which will jack up ROE. No change in business model, operations, efficiency, etc, just a simple increase in debt will make your ROE go up, even if you just sit on the cash and don&#39;t use it.</p>\n\n<p>Remember, debt is risky for equity holders, no guarantee that a company will use it for productive projects. This risk is further compounded in a near zero rate environment.</p>\n\n<p>ROA is a more relevant metric if you are commenting on the core business model.</p>\n\n<p>At best, ROE without context is a distraction. At worst, it can be downright misleading.</p>\n\n<p>Happy Investing!</p>\n\n<p>&#x200B;</p>\n\n<p>btw this wouldn&#39;t apply to bank stocks</p>\n</div><!-- SC_ON -->",
  "score": 1147,
  "permalink": "/r/investing/comments/lkm91d/why_you_should_be_suspicious_of_roe/",
  "subreddit": "investing",
  "id": "lkm91d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621142
}