{
  "author": "rootpl",
  "original_created_utc": 1655556215,
  "title": "That's why taking profits during a bull run is important.",
  "created_utc": 1655592141,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;We&amp;#39;ve heard many times on this sub that you should &amp;#39;never sell and HODL forever&amp;#39; and other nonsense. I am a big fan of taking profits and regularly skimming the cream from the top of my portfolio.&lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s do a little thought experiment. Suppose you were a super unlucky bastard and bought 1 BTC at $20,000 back in the 2017/2018 cycle. BTC goes parabolic during a pandemic and hits $67,000. What&amp;#39;s so bad with selling 10% for example? or 20% of your entire stack?&lt;/p&gt;\n\n&lt;p&gt;I bet some people will say &amp;#39;but it&amp;#39;s impossible to time the market and to hit the exact top&amp;#39;. OK sure, it&amp;#39;s very difficult. But BTC was over $50,000 from the 5th of October 2021 to the 10th of December 2021. That&amp;#39;s two months to make that decision. Two months is a looong time. And it was above 60k for over a month. If someone sold 10% of their 1 BTC during that time (without hitting the exact top at all) they&amp;#39;d still have 0.9 BTC remaining in their wallet and around $5000-6000 dollars in their pocket. You just put that into a stablecoin and keep it for later. Patience is a virtue. And timing the market is not that very hard really. The moment everyone in your family, at work, on the news and every celebrity is talking about it. When people talk about crypto during Saturday Night Live you know this is the time to get the hell out of the crypto space. When your grandma asks you about the magic internet money that&amp;#39;s your signal to get the hell out. ASAP.&lt;/p&gt;\n\n&lt;p&gt;Now comes June 2022. BTC is under $20k again. You can use that $5000 and buy another 0.25 BTC for practically free. Now you have 1.15 BTC for the next cycle and you can keep it to retire or whatever. Assuming that you&amp;#39;ve never DCA&amp;#39;d in the last 4-5 years you still have 1.15 BTC in your pocket. Now you can sell 0.15 BTC during the next cycle to skim profits again when BTC hits $100,000 for example. And you&amp;#39;ll still have your initial 1 BTC safe in your wallet for your retirement. Now you can put down a deposit for your first house with that $25,000. Or buy a car, or go for a nice long holiday. Whatever. Anything you want.&lt;/p&gt;\n\n&lt;p&gt;But be aware that taking profits does feel bad sometimes, especially when prices continue to go up. And I know this from my personal experience, I felt really bad when I sold my ETH at $1400, $1700, and again at $2500 marks. Because it went over $4000 later. But you know what? I&amp;#39;ve still made over 450% in profits. And now ETH dropped below $1k. I can either keep my 450% profit in stablecoins or I can buy 4.5 more ETH than I had before from my 450% profit that I&amp;#39;ve skimmed. Now, it doesn&amp;#39;t feel so bad anymore. I hope you get my point. Sure it would be nice to sell at $4k and make 900% or 1400% profit but like I said it&amp;#39;s very hard to predict the market and hit the exact top. So why not just chill and skim some profits from time to time?&lt;/p&gt;\n\n&lt;p&gt;TAKE PROFIT NEXT TIME PEOPLE it&amp;#39;s not that hard.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/vf5gqm/thats_why_taking_profits_during_a_bull_run_is/",
  "subreddit": "CryptoCurrency",
  "id": "vf5gqm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "We've heard many times on this sub that you should 'never sell and HODL forever'\nand other nonsense. I am a big fan of taking profits and regularly skimming the\ncream from the top of my portfolio.\n\nLet's do a little thought experiment. Suppose you were a super unlucky bastard\nand bought 1 BTC at…"
}