{
  "author": "Nadeline01",
  "original_created_utc": 1655135966,
  "title": "My boyfriend didn’t get me anything for my birthday. Should I do the same?",
  "created_utc": 1655149064,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently turned 20 and I barely got a “congratulations” from him, much less a gift. &lt;/p&gt;\n\n&lt;p&gt;His birthday is in less than a month, and i’ve been planning to make him a picnic with some wine and food, in a cozy place at night. My friends says that it’s too much due to the fact that I didn’t get anything from him; but I love him and I want to do something nice. &lt;/p&gt;\n\n&lt;p&gt;However, he’s never even invited me on a date, and i’m always the one who buys us stuff. What should I do?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/vbfgqp/my_boyfriend_didnt_get_me_anything_for_my/",
  "subreddit": "TooAfraidToAsk",
  "id": "vbfgqp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently turned 20 and I barely got a “congratulations” from him, much less a\ngift.\n\nHis birthday is in less than a month, and i’ve been planning to make him a\npicnic with some wine and food, in a cozy place at night. My friends says that\nit’s too much due to the fact that I didn’t get anything…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近20歳になったのですが、かろうじて「おめでとう」の一言があっただけで、ましてや\nましてやプレゼントなんて。\n\n彼の誕生日まであと1ヶ月を切りましたが、私は彼にピクニックをさせようと思っています。\nピクニックをしようと思っているのですが、ワインと料理を用意して、夜、居心地の良い場所で。私の友人はこう言います。\n何ももらってないから余計に...」と言われました。",
      "title": "彼氏が誕生日に何もプレゼントしてくれないんです。私も同じようにするべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近刚满20岁，我几乎没有收到他的 \"祝贺\"，更不用说礼物了。\n礼物。\n\n他的生日还有不到一个月就到了，我一直在计划给他做一个\n野餐，带些酒和食物，晚上在一个舒适的地方。我的朋友说\n由于我没有得到任何东西，这太过分了......",
      "title": "我的男朋友没有为我的生日送任何东西。我也应该这样做吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近剛滿20歲，我幾乎沒有收到他的 \"祝賀\"，更不用說禮物了。\n禮物。\n\n他的生日還有不到一個月就到了，我一直在計劃給他做一個\n野餐，帶些酒和食物，晚上在一個舒適的地方。我的朋友說\n由於我沒有得到任何東西，這太過分了......",
      "title": "我的男朋友沒有爲我的生日送任何東西。我也應該這樣做嗎？"
    }
  ]
}