{
  "author": "Yener07",
  "original_created_utc": 1642968108,
  "title": "Who else has no strategy after the crash and just sit by and watch their coins?",
  "created_utc": 1642980835,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think most of us can relate to this, at least I hope so. The last few days, I have only opened Binance, checked my balance and left. I used to look at crypto analyses, check out what my favorite investors said etc. But I just don&amp;#39;t feel like doing any of this anymore. Even if I look at analyses, what is going to change? I am in such a big loss that I can&amp;#39;t sell, so why bother?&lt;/p&gt;\n\n&lt;p&gt;I just wanted to hear what you guys are doing in this crash. Because I am certainly not doing anything other than watching my portfolio dip even further.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/sb2ekq/who_else_has_no_strategy_after_the_crash_and_just/",
  "subreddit": "CryptoCurrency",
  "id": "sb2ekq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I think most of us can relate to this, at least I hope so. The last few days, I\nhave only opened Binance, checked my balance and left. I used to look at crypto\nanalyses, check out what my favorite investors said etc. But I just don't feel\nlike doing any of this anymore. Even if I look at analyses,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ほとんどの人が共感できると思うし、少なくとも私はそう願っています。ここ数日、私は\nBinanceを開いて残高を確認し、帰るだけ。以前は暗号を見たり\nの分析、お気に入りの投資家の発言などをチェックしています。でも、もう\nもう何もかもが好きです。分析を見ても、、、。",
      "title": "暴落後に何の戦略も持たず、ただ傍観してコインを眺めている人が他にいるだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我们大多数人都能体会到这一点，至少我希望如此。在过去的几天里，我\n只打开了Binance，检查了我的余额就离开了。我过去经常看加密货币\n分析，看看我最喜欢的投资者怎么说等等。但我只是不觉得\n喜欢做这些事了。即使我看了分析报告，...",
      "title": "还有谁在崩盘后没有任何策略，只是坐视自己的钱币？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我們大多數人都能體會到這一點，至少我希望如此。在過去的幾天裏，我\n只打開了Binance，檢查了我的餘額就離開了。我過去經常看加密貨幣\n分析，看看我最喜歡的投資者怎麼說等等。但我只是不覺得\n喜歡做這些事了。即使我看了分析報告，...",
      "title": "還有誰在崩盤後沒有任何策略，只是坐視自己的錢幣？"
    }
  ]
}