{
  "author": "Christophercolonbus",
  "original_created_utc": 1629812494,
  "title": "Why is the western world so supportive of the fat-acceptance movement?",
  "created_utc": 1629873736,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Being obese is in no way good and it&#39;s an undeniable fact yet the western world criticizes anyone who says otherwise. I don&#39;t mean to say that we should go out of our way to shame fat people (that&#39;s cruel) but no one should be supportive of that kind of lifestyle either.  It decreases your lifespan and adversely affects your life in numerous ways. A lot of them even become a burden on their families and society.</p>\n\n<p>Edit: when I say fat,I in no way mean people who don&#39;t have toned,perfect bodies because it&#39;s totally fine to have curves and a a little meat on your body.</p>\n\n<p>This post is not about people who are obese because they suffer from mental/physical disorders,trauma or injury.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/panki8/why_is_the_western_world_so_supportive_of_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "panki8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Being obese is in no way good and it's an undeniable fact yet the western world\ncriticizes anyone who says otherwise. I don't mean to say that we should go out\nof our way to shame fat people (that's cruel) but no one should be supportive of\nthat kind of lifestyle either. It decreases your lifespan…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "肥満は決して良いことではありません。これは紛れもない事実ですが、欧米諸国では\nそうでないと言う人を批判します。わざわざ太った人を辱めるようなことを言うつもりはありません。\n太っている人をわざわざ辱めるようなことを言うつもりはありませんが（それは残酷です）、そのようなライフスタイルを支持する人もいないはずです。\nそのようなライフスタイルを支持すべきではありません。寿命が短くなる...。",
      "title": "欧米では、なぜ脂肪受容運動が支持されているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "肥胖绝非好事，这是一个不可否认的事实，然而西方世界\n却批评任何持反对意见的人。我的意思并不是说我们应该去\n我并不是说我们应该去羞辱胖子（这很残酷），但没有人应该支持肥胖。\n这种生活方式。它减少了你的寿命...",
      "title": "为什么西方世界对脂肪接受运动如此支持？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "肥胖絕非好事，這是一個不可否認的事實，然而西方世界\n卻批評任何持反對意見的人。我的意思並不是說我們應該去\n我並不是說我們應該去羞辱胖子（這很殘酷），但沒有人應該支持肥胖。\n這種生活方式。它減少了你的壽命...",
      "title": "爲什麼西方世界對脂肪接受運動如此支持？"
    }
  ]
}