{
  "author": "DangerousBongo666",
  "original_created_utc": 1652645078,
  "title": "I took my crypto off Coinbase today, I'm now the proud owner of a hardware wallet. I feel so relaxed now I have control of my coins",
  "created_utc": 1652672125,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After the recent market turmoil I became anxious that Coinbase might collapse and I&amp;#39;d lose my Bitcoin. &lt;/p&gt;\n\n&lt;p&gt;The Coinbase share price has fallen from $345 to only $53 in six months. Although unlikely, it&amp;#39;s possible that Coinbase will go out of business and everyone who holds their crypto on the exchange will lose everything. &lt;/p&gt;\n\n&lt;p&gt;The idea of losing all my Bitcoin really made me feel very uneasy, the solution was obvious, get a hardware wallet.&lt;/p&gt;\n\n&lt;p&gt;Setting up the Ledger Nano S was easy and transferring my BTC liberating, I can feel a weight lifted from my shoulders knowing I now have full control of my keys and my crypto. &lt;/p&gt;\n\n&lt;p&gt;If anyone is wondering &amp;#39;what happens if Ledger go out of business?&amp;#39; fear not! If Ledger did i go out of business, neither your cryptocurrency nor your private and public keys would disappear. You are totally safe.&lt;/p&gt;\n\n&lt;p&gt;Do not trust someone else to look after your crypto, the unthinkable could happen!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/uqe9hw/i_took_my_crypto_off_coinbase_today_im_now_the/",
  "subreddit": "CryptoCurrency",
  "id": "uqe9hw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After the recent market turmoil I became anxious that Coinbase might collapse\nand I'd lose my Bitcoin.\n\nThe Coinbase share price has fallen from $345 to only $53 in six months.\nAlthough unlikely, it's possible that Coinbase will go out of business and\neveryone who holds their crypto on the exchange…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近の市場の混乱で、Coinbaseが破綻するのではないかと不安になりました。\n私のビットコインを失ってしまうのではないかと不安になりました。\n\nCoinbaseの株価は半年で345ドルからわずか53ドルまで下落しました。\n可能性は低いですが、Coinbaseが倒産して、Coinbaseに暗号を預けている人たち全員が\nコインベースが倒産し、取引所に暗号を保有するすべての人が...",
      "title": "今日、Coinbaseから暗号を持ち出しました。今は自慢のハードウェアウォレットの持ち主です。自分のコインをコントロールできるようになったので、とてもリラックスしています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在最近的市场动荡之后，我开始担心Coinbase可能会倒闭。\n而我将失去我的比特币。\n\nCoinbase的股价在六个月内从345美元跌到只有53美元。\n虽然不太可能，但Coinbase有可能会倒闭，而在Coinbase上持有加密货币的每个人都有可能被解雇。\n所有在该交易所持有加密货币的人...",
      "title": "我今天把我的加密货币从Coinbase上取下来了，我现在是一个硬件钱包的自豪主人。我现在感觉很轻松，我可以控制我的硬币了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在最近的市場動盪之後，我開始擔心Coinbase可能會倒閉。\n而我將失去我的比特幣。\n\nCoinbase的股價在六個月內從345美元跌到只有53美元。\n雖然不太可能，但Coinbase有可能會倒閉，而在Coinbase上持有加密貨幣的每個人都有可能被解僱。\n所有在該交易所持有加密貨幣的人...",
      "title": "我今天把我的加密貨幣從Coinbase上取下來了，我現在是一個硬件錢包的自豪主人。我現在感覺很輕鬆，我可以控制我的硬幣了。"
    }
  ]
}