{
  "author": "DangerousBongo666",
  "original_created_utc": 1652645078,
  "title": "I took my crypto off Coinbase today, I'm now the proud owner of a hardware wallet. I feel so relaxed now I have control of my coins",
  "created_utc": 1652672125,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;After the recent market turmoil I became anxious that Coinbase might collapse and I&amp;#39;d lose my Bitcoin. &lt;/p&gt;\n\n&lt;p&gt;The Coinbase share price has fallen from $345 to only $53 in six months. Although unlikely, it&amp;#39;s possible that Coinbase will go out of business and everyone who holds their crypto on the exchange will lose everything. &lt;/p&gt;\n\n&lt;p&gt;The idea of losing all my Bitcoin really made me feel very uneasy, the solution was obvious, get a hardware wallet.&lt;/p&gt;\n\n&lt;p&gt;Setting up the Ledger Nano S was easy and transferring my BTC liberating, I can feel a weight lifted from my shoulders knowing I now have full control of my keys and my crypto. &lt;/p&gt;\n\n&lt;p&gt;If anyone is wondering &amp;#39;what happens if Ledger go out of business?&amp;#39; fear not! If Ledger did i go out of business, neither your cryptocurrency nor your private and public keys would disappear. You are totally safe.&lt;/p&gt;\n\n&lt;p&gt;Do not trust someone else to look after your crypto, the unthinkable could happen!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 330,
  "permalink": "/r/CryptoCurrency/comments/uqe9hw/i_took_my_crypto_off_coinbase_today_im_now_the/",
  "subreddit": "CryptoCurrency",
  "id": "uqe9hw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "After the recent market turmoil I became anxious that Coinbase might collapse\nand I'd lose my Bitcoin.\n\nThe Coinbase share price has fallen from $345 to only $53 in six months.\nAlthough unlikely, it's possible that Coinbase will go out of business and\neveryone who holds their crypto on the exchange…"
}