{
  "author": "dammitjanetihateyou",
  "original_created_utc": 1650438818,
  "title": "Can someone tell me what my husband is doing called?",
  "created_utc": 1650456003,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If my husband and I are arguing and I&amp;#39;m trying to use my phone to ignore him and he takes it away from me physically because he pays the bills, what is that called? &lt;/p&gt;\n\n&lt;p&gt;I told him I&amp;#39;m an adult and he can&amp;#39;t do that to me but he says he pays the bills and I&amp;#39;m a SAHM so that means he can. I don&amp;#39;t think he should, though. I feel like I should be allowed to hold on to my phone always, even if he did pay for it because he got it for me and he asked why. I&amp;#39;m not really sure what to answer. He had told me it was a gift but he&amp;#39;s still paying monthly for it. I&amp;#39;m honestly more embarrassed than afraid to ask anyone I know so I thought I&amp;#39;d come here to ask.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/u7qq5o/can_someone_tell_me_what_my_husband_is_doing/",
  "subreddit": "TooAfraidToAsk",
  "id": "u7qq5o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If my husband and I are arguing and I'm trying to use my phone to ignore him and\nhe takes it away from me physically because he pays the bills, what is that\ncalled?\n\nI told him I'm an adult and he can't do that to me but he says he pays the bills\nand I'm a SAHM so that means he can. I don't think…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "夫と口論になり、私が携帯電話を使って夫を無視しようとしているときに、夫が携帯電話を取り上げると\n携帯を取り上げられたとしたら、それは何ですか？\nと呼ばれるのでしょうか？\n\n私は大人だからそんなことはできないと言いましたが、彼は自分が請求書を払うと言います。\n私はSAHMなので、彼ができることを意味します。そんなこと...",
      "title": "どなたか、夫が何と呼ばれているか教えてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我丈夫和我在争吵，而我想用手机来忽略他，他却因为我的身体而把手机拿走。\n他从我身上拿走了手机，因为他要付账单，这叫什么？\n叫做什么？\n\n我告诉他我是成年人，他不能对我这样做，但他说他要付账单\n而我是一个家庭主妇，所以这意味着他可以。我不认为...",
      "title": "谁能告诉我，我丈夫在做什么叫？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我丈夫和我在爭吵，而我想用手機來忽略他，他卻因爲我的身體而把手機拿走。\n他從我身上拿走了手機，因爲他要付賬單，這叫什麼？\n叫做什麼？\n\n我告訴他我是成年人，他不能對我這樣做，但他說他要付賬單\n而我是一個家庭主婦，所以這意味着他可以。我不認爲...",
      "title": "誰能告訴我，我丈夫在做什麼叫？"
    }
  ]
}