{
  "author": "CheezusRiced06",
  "the_new_excerpt": "I was scanning Gamestop options over the next 4 weeks sorting by various\nnumbers, and when I selected open interest I was met with some very interesting\ninformation. Someone please look at the options distribution for 4/16 and tell\nme what you think it means.\n\nFrom Fidelity's option chain table:…",
  "original_created_utc": 1616273471,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在接下来的4周里，我在扫描Gamestop的选项时，按照各种\n数字，而当我选择开放兴趣时，我遇到了一些非常有趣的。\n的信息。谁来看看4/16的期权分布情况，并告知\n我你认为这意味着什么。\n\n从富达的期权链表：... ...",
      "title": ""
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在接下來的4周裏，我在掃描Gamestop的選項時，按照各種\n數字，而當我選擇開放興趣時，我遇到了一些非常有趣的。\n的信息。誰來看看4/16的期權分佈情況，並告知\n我你認爲這意味着什麼。\n\n從富達的期權鏈表：... ...",
      "title": ""
    }
  ],
  "title": "$GME Options for April 16 (27 Days) are absolutely nuts - Decryption assistance needed looking at OI",
  "created_utc": 1616349523,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was scanning Gamestop options over the next 4 weeks sorting by various numbers, and when I selected open interest I was met with some very interesting information. Someone please look at the options distribution for 4/16 and tell me what you think it means.</p>\n\n<p>From Fidelity&#39;s option chain table: PUTS EXPIRING 4/16/21 in order of Open Interest quantity and including dollar values if ITM - NOTE these are just dollar values of the shares if exercised, it is not the dollar value of the CONTRACTS representing the shares. I need to eat more wax fruit to unlock options math level 2.</p>\n\n<p>-50 cent strike - OI of 58,862 - $2.94m</p>\n\n<p>-10 dollar strike - OI of 33,581 - $33.58m</p>\n\n<p>-5 dollar strike - OI of 29,438 - $14.71m</p>\n\n<p>-1 dollar strike - OI of 18,839 - $1.88m</p>\n\n<p>-40 dollar strike - OI of 17,686 - $70.74m</p>\n\n<p>-50 dollar strike - OI of 15,606 - $78.03m</p>\n\n<p>-20 dollar strike - OI of 14,464 - $28.92m</p>\n\n<p>-3 dollar strike - OI of 11,098 - $3.32m</p>\n\n<p>-30 dollar strike - OI 10,876 - $32.62m</p>\n\n<p>all the rest are under 10k contracts OI, with the top being the 7 dollar strike with an OI of 8,444 - representing 5.9m USD worth of shares if ITM</p>\n\n<p>honorable mention due to dollar value - 200P 4,048 OI = $80.96m</p>\n\n<p>This is where it gets wack, because the calls are all anticipating a moon, but do not have anywhere close the open interest of the puts despite having very similar dollar values if ITM. The 800C far outstrips any others with a whopping 15,581 OI ($1.24 BILLION WITH A B worth of shares if ITM), the next highest being the 400C at 4,582 OI ($183m if ITM), and all the others (100,200,300,500, etc.) have roughly 4k OI or less.</p>\n\n<p>Is this the day of reckoning??? If hedges were betting Ch. 11 filed by April 16 that represents 353.6 million dollars worth of shares now ITM, no telling how much was paid in premium to acquire those. The value of the top 2 call strikes (If GME were 800+) represents a quadruple return over the 353m if GME were at zero.</p>\n\n<p>Whats the alternative? Based on this, it seems to me like they are going to ride this squeeze and cash in the options and make a profit 100x what any retailer will -<em>from their own mistake</em>- and the manipulation over the last few months is what enabled it. My gut tells me that most retailers dont have the cash to mess with options in these quantities due to IV spiking premiums.</p>\n\n<p>&#x200B;</p>\n\n<p>What do you think is more likely now - the puts go out of the money and the calls print, hedge funds make fat $$$ off recent their recent big bet to acquire tons of high strike calls... OR Hedges original bet of GME hitting zero was actually correct and the puts print? This does of course mean that GME must hit $800/share or higher for the options to be cashed in...</p>\n\n<p>&#x200B;</p>\n\n<p>Not financial advice as I cant read or write.</p>\n</div><!-- SC_ON -->",
  "score": 1235,
  "permalink": "/r/wallstreetbets/comments/m9fx0y/gme_options_for_april_16_27_days_are_absolutely/",
  "subreddit": "wallstreetbets",
  "id": "m9fx0y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752826455
}