{
  "author": "PokePirat",
  "original_created_utc": 1632683460,
  "title": "Facebook doesn't want Bitcoin to succeed",
  "created_utc": 1632704915,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s start this off with.. I don&#39;t have anything against Facebook.. In fact I spend an absolute ton advertising there, have stock in FB, and meet with FB regularly. \nI do have a problem with the Suggested news feed Algo items that FB spits out at me on a consistent basis so I decided to count how many Bitcoin negative sentiment versus Bitcoin positive sentiment articles they feed me and how I personally feel each time one is suggested to me. Today I finally hit 100 and the results shouldn&#39;t be shocking at all.</p>\n\n<p>The majority of sources for these articles are Forbes, Business Insider and Coindesk. You should know that all 3 of them are pay to play.. meaning if you want to pay $$$ your article can be featured on them.</p>\n\n<p>Without further delay.. of the 100, only 3 had a positive sentiment for Bitcoin. I don&#39;t follow any Bitcoin pages, don&#39;t follow any groups and don&#39;t contribute to any crypto discussions on the platform so the suggestion is purely FB&#39;s way of saying yes we know you&#39;re into crypto so here&#39;s what we think you should read. The headlines have been &quot;Miamicoin set to grow faster than Bitcoin&quot; .. &quot;Find out why this viral TikToker has predicted Bitcoin&#39;s fall from #1&quot; .. &quot;Why Bitcoin is going to lose value due to X&quot;</p>\n\n<p>I&#39;m not fucking selling.. But why does Facebook want me to so badly? Why does Facebook want me to think that Bitcoin is going to lose to some random shit coin? Why does Facebook care that I read about Bitcoin with negative sentiment?  Why doesn&#39;t Facebook share relevant positive sentiment articles? </p>\n\n<p>Facebook knows whether you&#39;re pro or not. Facebook knows if you hodl. So here&#39;s my 2 cents.. If libracoin can&#39;t succeed than why should the Winklevoss twins have something more valuable than FB and FB will exert it&#39;s power over the people with it&#39;s own agenda through suggested news feed articles to negative sentiment articles that people will read and recite as if it&#39;s the gospel..</p>\n</div><!-- SC_ON -->",
  "score": 154,
  "permalink": "/r/Bitcoin/comments/pw080m/facebook_doesnt_want_bitcoin_to_succeed/",
  "subreddit": "Bitcoin",
  "id": "pw080m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let's start this off with.. I don't have anything against Facebook.. In fact I\nspend an absolute ton advertising there, have stock in FB, and meet with FB\nregularly. I do have a problem with the Suggested news feed Algo items that FB\nspits out at me on a consistent basis so I decided to count how…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず始めに... 私はFacebookに何の恨みもありません。実際に私は\n実際、私は大量の広告を出していますし、FBの株も持っていますし、定期的にFBと会っています。\nと定期的に会っています。私は、FBが一貫して私に吐き出すニュースフィードアルゴの提案項目に問題があります。\n私は、FBが一貫して私に吐き出すサジェストニュースフィードアルゴアイテムに問題があるので、どのようにカウントすることにしました...",
      "title": "Facebookはビットコインの成功を望んでいない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们从以下方面开始。我并不反对Facebook。事实上，我\n事实上，我在那里花了绝对多的广告费，有FB的股票，并定期与FB会面。\n定期会面。我确实对FB的建议新闻源阿尔戈项目有意见。\n吐出来的东西，所以我决定计算一下，我是如何...",
      "title": "Facebook不希望比特币成功"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們從以下方面開始。我並不反對Facebook。事實上，我\n事實上，我在那裏花了絕對多的廣告費，有FB的股票，並定期與FB會面。\n定期會面。我確實對FB的建議新聞源阿爾戈項目有意見。\n吐出來的東西，所以我決定計算一下，我是如何...",
      "title": "Facebook不希望比特幣成功"
    }
  ]
}