{
  "author": "TheComm96002",
  "original_created_utc": 1627556309,
  "title": "How could people fight in armor during summer in the middle ages?",
  "created_utc": 1627570803,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I live in the south of Italy in Brindisi, Apulia. In this hot day of july I was walking In my town and I  passed by the Swabian Castle built by Fredrick II of Swabia and then I thought came trough my mind : How could people of that age manage to fight in armour during summer when I am struggling with heat and sweat with a t shirt and shorts on. I own a replica bascinet which I wore sometimes at home and outdoor during autumn, and It wasn&#39;t the most comfortable experience, but it was ok, but I guess in summer it would be an hell with the sun heating up the metal. I don&#39;t own other armour parts yet but I am quite sure wearing that during hot months would not definitely be comfy.</p>\n</div><!-- SC_ON -->",
  "score": 130,
  "permalink": "/r/AskHistorians/comments/otv8p5/how_could_people_fight_in_armor_during_summer_in/",
  "subreddit": "AskHistorians",
  "id": "otv8p5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I live in the south of Italy in Brindisi, Apulia. In this hot day of july I was\nwalking In my town and I passed by the Swabian Castle built by Fredrick II of\nSwabia and then I thought came trough my mind : How could people of that age\nmanage to fight in armour during summer when I am struggling with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は南イタリアのブリンディジ（アプリア州）に住んでいます。7月の暑い日に、私は町を歩いていました。\nシュヴァーベンのフレデリック2世が建てたシュヴァーベン城の前を通ってから\nその時、私は次のようなことを考えました：あの時代の人々は、夏に鎧を着て戦うことができたのだろうか？\n夏に鎧を着て戦うことができるのだろうか？",
      "title": "中世の夏に鎧を着て戦うことができたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我住在意大利南部的布林迪西，阿普利亚。在7月的这个炎热的日子里，我在我的城市里散步。\n在我的小镇上散步，路过由弗雷德里克二世建造的斯瓦比亚城堡。\n然后我想到：那个时代的人怎么能在夏天穿着盔甲作战呢？\n能在夏天穿着盔甲作战，而我却在为......挣扎。",
      "title": "在中世纪，人们怎么可能在夏天穿着盔甲作战？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我住在意大利南部的布林迪西，阿普利亞。在7月的這個炎熱的日子裏，我在我的城市裏散步。\n在我的小鎮上散步，路過由弗雷德裏克二世建造的斯瓦比亞城堡。\n然後我想到：那個時代的人怎麼能在夏天穿着盔甲作戰呢？\n能在夏天穿着盔甲作戰，而我卻在爲......掙扎。",
      "title": "在中世紀，人們怎麼可能在夏天穿着盔甲作戰？"
    }
  ]
}