{
  "author": "Orfgorf",
  "original_created_utc": 1630339168,
  "title": "My Masters level Finance professor used the tulip mania FUD",
  "created_utc": 1630355981,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This happened last semester during a Zoom class. By the end of the semester we started to have more fun in class and make jokes about GME and crypto, but on a serious note my professor told everyone in class to look up tulip mania if they are thinking about buying bitcoin.</p>\n\n<p>3-4 years ago during the first 10,000 break people were throwing this around left and right and I even have comment history from that time arguing with people about it lol.</p>\n\n<p>It&#39;s just amazing to me that well established, highly successful people in the world of Academia and finance could be this astonishingly misinformed. Just sharing to let you know how early we still are.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/Bitcoin/comments/pekymg/my_masters_level_finance_professor_used_the_tulip/",
  "subreddit": "Bitcoin",
  "id": "pekymg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This happened last semester during a Zoom class. By the end of the semester we\nstarted to have more fun in class and make jokes about GME and crypto, but on a\nserious note my professor told everyone in class to look up tulip mania if they\nare thinking about buying bitcoin.\n\n3-4 years ago during the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先学期のZoomクラスでの出来事です。学期の終わりには、私たちは\nクラスではもっと楽しくなり、GMEや暗号についてジョークを言うようになりましたが、実際には\n教授は、ビットコインを買おうと思っている人はチューリップ・マニアを調べてみるようにとクラスのみんなに言った。\nビットコインを買おうと思っている人は、チューリップ・マニアを調べてみてください。\n\n3～4年前の...",
      "title": "修士課程のファイナンスの教授は、チューリップ・マニアのFUDを使っていました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这事发生在上学期的一个Zoom课上。学期结束时，我们\n我们开始在课堂上有更多的乐趣，并开关于GME和加密货币的玩笑，但在一个严肃的问题上\n我的教授告诉大家，如果他们想买比特币，就去查查郁金香狂热症。\n想买比特币。\n\n3-4年前，在...",
      "title": "我的金融学硕士水平的教授用郁金香狂热的FUD"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這事發生在上學期的一個Zoom課上。學期結束時，我們\n我們開始在課堂上有更多的樂趣，並開關於GME和加密貨幣的玩笑，但在一個嚴肅的問題上\n我的教授告訴大家，如果他們想買比特幣，就去查查鬱金香狂熱症。\n想買比特幣。\n\n3-4年前，在...",
      "title": "我的金融學碩士水平的教授用鬱金香狂熱的FUD"
    }
  ]
}