{
  "author": "ripple_mcgee",
  "original_created_utc": 1641853870,
  "title": "If you picked up ETH between $2900-3100, that is a good price! It's not cheap, its not expensive, just a solid entry point IMO.",
  "created_utc": 1641893848,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title says it all, but I know I have to write a bunch of shit here for the post to get some traction.&lt;/p&gt;\n\n&lt;p&gt;Like many of you, I bought this delicious dip. I&amp;#39;m out of money now, but I have an average ETH buy price of $2984...which I think is pretty good. I&amp;#39;m hodling this for the intermediate term because I expect the price of ETH to rise as the date for ETH 2.0 (a.k.a. The Merge) draws nearer. Any ETH traders that are shorting right now should definitely make sure you close out before the date is confirmed because the hype will come on fast and you&amp;#39;ll get rekt. &lt;/p&gt;\n\n&lt;p&gt;Naturally, there could be another delay in the launch which, to be fair, would not be great. But if you check out the number of commits on github for ETH 2 clients, many reference improvements to clients for the merge which tells me the devs are working hard at it. I like it!&lt;/p&gt;\n\n&lt;p&gt;Strap in, its going to be a bumpy but very fun year.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 319,
  "permalink": "/r/CryptoCurrency/comments/s0wlru/if_you_picked_up_eth_between_29003100_that_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "s0wlru",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title says it all, but I know I have to write a bunch of shit here for the post\nto get some traction.\n\nLike many of you, I bought this delicious dip. I'm out of money now, but I have\nan average ETH buy price of $2984...which I think is pretty good. I'm hodling\nthis for the intermediate term because…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルが全てを物語っていますが、ここにクソみたいなことを書かないと記事にならないことは分かっています。\nということです。\n\n多くの方と同じように、私もこの美味しいディップを買いました。今はお金がありませんが、私は\nETHの平均購入価格は2984ドル...これはかなり良いと思います。私は、ホドリング\nこれは中期的なものです。",
      "title": "2900～3100円の間でETHを拾ったのであれば、いい値段だと思います 安くもなく、高くもない、ちょうど良いエントリーポイントだと思いますIMO。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "标题说明了一切，但我知道我必须在这里写一堆狗屎，才能让帖子有一些吸引力\n以获得一些牵引力。\n\n像你们中的许多人一样，我买了这个美味的蘸酱。我现在没钱了，但我有\n平均买入ETH的价格是2984美元......我认为这很不错。我在做\n这是个中期计划，因为...",
      "title": "如果你在2900-3100美元之间捡到ETH，那就是一个好的价格! 它不便宜，也不贵，只是一个坚实的入门点，IMO。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "標題說明了一切，但我知道我必須在這裏寫一堆狗屎，才能讓帖子有一些吸引力\n以獲得一些牽引力。\n\n像你們中的許多人一樣，我買了這個美味的蘸醬。我現在沒錢了，但我有\n平均買入ETH的價格是2984美元......我認爲這很不錯。我在做\n這是個中期計劃，因爲...",
      "title": "如果你在2900-3100美元之間撿到ETH，那就是一個好的價格! 它不便宜，也不貴，只是一個堅實的入門點，IMO。"
    }
  ]
}