{
  "author": "tittysniffer22",
  "the_new_excerpt": "My worst nightmare is bumping into someone I know in public. It could be my\nsecondary school bully or my best friend, it doesn't matter, its always the most\nawkward experience. I never know what to do or say.\n\nNow, if I arrange to hang out with someone I always have a good time and it\nwouldn't be…",
  "original_created_utc": 1620863466,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の最悪の悪夢は、公共の場で知り合いにぶつかることです。それは中学時代のいじめっ子かもしれないし\n中学時代のいじめっ子だったり、親友だったり、そんなことはどうでもよくて、いつも一番気まずい思いをします。\n気まずい思いをします。何をすればいいのか、何を言えばいいのか、わからないのです。\n\n今では、誰かと一緒に出かけることになれば、いつも楽しい時間を過ごすことができます。\nとはなりません。",
      "title": "好きな人がいても、人とぶつかるのが嫌なのは普通ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最糟糕的噩梦是在公共场合撞到我认识的人。这可能是我的\n我的中学恶霸或我最好的朋友，这并不重要，它总是最尴尬的\n尴尬的经历。我从来不知道该做什么或说什么。\n\n现在，如果我安排和某人一起出去玩，我总是有一个好的时间，而且\n不会是...",
      "title": "即使我喜欢的人，也讨厌撞见他们，这正常吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最糟糕的噩夢是在公共場合撞到我認識的人。這可能是我的\n我的中學惡霸或我最好的朋友，這並不重要，它總是最尷尬的\n尷尬的經歷。我從來不知道該做什麼或說什麼。\n\n現在，如果我安排和某人一起出去玩，我總是有一個好的時間，而且\n不會是...",
      "title": "即使我喜歡的人，也討厭撞見他們，這正常嗎？"
    }
  ],
  "title": "Is it normal to hate bumping into people even if I like them?",
  "created_utc": 1620884660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My worst nightmare is bumping into someone I know in public. It could be my secondary school bully or my best friend, it doesn&#39;t matter, its always the most awkward experience. I never know what to do or say. </p>\n\n<p>Now, if I arrange to hang out with someone I always have a good time and it wouldn&#39;t be awkward, but if I unintentionally bump into that same person my brain shuts down and all social cues go out the window.  </p>\n\n<p>Is this normal?</p>\n</div><!-- SC_ON -->",
  "score": 321,
  "permalink": "/r/TooAfraidToAsk/comments/nb325f/is_it_normal_to_hate_bumping_into_people_even_if/",
  "subreddit": "TooAfraidToAsk",
  "id": "nb325f",
  "is_self": true,
  "media": null,
  "is_video": false
}