{
  "author": "cidadefalcao",
  "original_created_utc": 1633817227,
  "title": "The average millionaire today can have at most 0.375 BTC, and this number gets lower by the day",
  "created_utc": 1633836728,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Credit Suisse Research Institute puts the number of millionaires worldwide at 56 million total, of which 40% are in the United States. (Source: <a href=\"https://www.economist.com/graphic-detail/2019/10/22/millions-of-millionaires\">https://www.economist.com/graphic-detail/2019/10/22/millions-of-millionaires</a>)</p>\n\n<p>There are many, many things that all millionaires can have and buy. A full bitcoin is not one of them. This number is likely even lower due to several additional factors:</p>\n\n<ul>\n<li>Institutions and individuals buying it, holding, and not selling anytime soon</li>\n<li>Satoshi&#39;s stash plus lost coins</li>\n<li>Coins in the hands of non-millionaires</li>\n</ul>\n\n<p>among others. This 0.375 BTC number however gets lower and lower over time because:</p>\n\n<ul>\n<li>More fiat is issued, creating more fiat millionaires</li>\n<li>BTC is lost</li>\n<li>BTC is bought and held by everyone else</li>\n</ul>\n\n<p>If you have this amount, there are only two possibilities for you in the next 10 or so years: I. BTC fails. II. BTC wins (I actually believe like many that it has already won), and you will be a fiat millionaire (in today&#39;s purchasing power, let alone future years purchasing power). In this case, you should celebrate not because you have one million dollars, which might as well be less useful than toilet paper in ten years, but because you can buy and have whatever it buys today.</p>\n\n<p>An important point mentioned in this research is that &quot; The total net worth of all millionaires stood at US$158,261 trillion. &quot; That&#39;s the lower bound for BTC&#39;s total addressable market (TAM). No other shitcoin has that, because they are trying to be something else than money: bitcoin is the soundest money, and there is no close competitor (like Michael Saylor would say &quot;this story about 60% dominance is bs. It&#39;s like 95 or 96 percent dominance&quot;). Hence it&#39;s pointless to compare whatever market cap they have with bitcoin. The important conclusion from that is that bitcoin has the highest risk-adjusted upside potential: we are talking about a 150x from here <strong>at least</strong>. Whatever shitcoin you can think of that has surpassed, let&#39;s say, 20 billion market cap, is competing with some 10 others on a single digits trillion dollar addressable market (other than money) at best. Money printing helps us more than it helps them (i.e. our TAM increases at least as much as theirs). So there is really no point in holding any other coin other than bitcoin <strong>if you believe that either bitcoin alone or &quot;crypto&quot; is the future: either bitcoin alone succeeds, and it offers you the best return, or bitcoin and others succeed, and bitcoin offers you the best return.</strong> The only reason to hold other coins is if you wanna gamble. In that case, your fate is a nice -99.99% either in fiat terms or in bitcoin terms sooner or later.</p>\n\n<p>Now an also important fact on <strong>billionaires</strong>:</p>\n\n<p>This has been said repeatedly and I believe it is worth repeating once again: <strong>we are seeing the biggest wealth transfer in the history of the world</strong>. If you read the mainstream media you might have read multiple times that &quot;billionaires have never been richer&quot;, &quot;billionaires wealth are growing faster during the pandemic&quot;, etc. These are half-truths (or lies). Their wealth is shrinking and it is shrinking fast in BTC terms. I&#39;d be surprised if there was one single billionaire whose wealth decreased by less than 95% in the last five years.</p>\n\n<p>For those willing to do the math, here&#39;s the historical billionaires list:</p>\n\n<p><a href=\"https://stats.areppim.com/stats/links_billionairexlists.htm\">https://stats.areppim.com/stats/links_billionairexlists.htm</a></p>\n\n<p>I invite those knowledgeable in how to put this through to come up with something similar to <a href=\"https://www.pricedinbitcoin21.com/landing\">https://www.pricedinbitcoin21.com/landing</a> but for the world&#39;s richest people over time. Will be nice to see how the money game looks when you are counting points with the soundest money on earth instead of monopoly money.</p>\n</div><!-- SC_ON -->",
  "score": 182,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?auto=webp&s=5d857ec74a9ae2f95a69934435820a35eac155cb",
          "width": 1280,
          "height": 755
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?width=108&crop=smart&auto=webp&s=431ba8455b5a02bf3f07f00efac1755440c3cffe",
            "width": 108,
            "height": 63
          },
          {
            "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?width=216&crop=smart&auto=webp&s=86c988547a8db758735eb2786b422496979e1aa2",
            "width": 216,
            "height": 127
          },
          {
            "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?width=320&crop=smart&auto=webp&s=6fc10d87b9e716b3acbcc7eabed4d6e2278686e0",
            "width": 320,
            "height": 188
          },
          {
            "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?width=640&crop=smart&auto=webp&s=f7b62b4543a7ff8a367ca05a728464c210b0336c",
            "width": 640,
            "height": 377
          },
          {
            "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?width=960&crop=smart&auto=webp&s=97f1225ce21b89984ed27f3103ab4f14f5b46c33",
            "width": 960,
            "height": 566
          },
          {
            "url": "https://external-preview.redd.it/PNyUltajvuxBU5Uldc6_8A2owUw1iVZig1DOP4wU-Rs.jpg?width=1080&crop=smart&auto=webp&s=b9dc904636cba6457ad49f2fcc35be70ca0161d3",
            "width": 1080,
            "height": 637
          }
        ],
        "variants": {},
        "id": "y7cgnzmRtocYGRIq282yAkIF7Wnq3a28lV7zLhSB108"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/q4v6dq/the_average_millionaire_today_can_have_at_most/",
  "subreddit": "Bitcoin",
  "id": "q4v6dq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Credit Suisse Research Institute puts the number of millionaires worldwide at 56\nmillion total, of which 40% are in the United States. (Source:\nhttps://www.economist.com/graphic-detail/2019/10/22/millions-of-millionaires)\n\nThere are many, many things that all millionaires can have and buy. A…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クレディ・スイス・リサーチ・インスティテュートは、世界のミリオネアの数を56百万人と発表しました。\n百万人で、そのうち40％が米国にいます。(出典\nhttps://www.economist.com/graphic-detail/2019/10/22/millions-of-millionaires)\n\nすべての大富豪が持っているもの、買えるものはたくさんあります。A...",
      "title": "今日の平均的な億万長者が持てるのはせいぜい0.375BTCであり、この数字は日に日に小さくなっています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "瑞士信贷研究所认为全球百万富翁的数量为5600万，其中40%在美国。\n万人，其中40%在美国。(资料来源。\nhttps://www.economist.com/graphic-detail/2019/10/22/millions-of-millionaires)\n\n有很多很多东西是所有百万富翁都可以拥有和购买的。A...",
      "title": "今天的平均百万富翁最多可以拥有0.375个BTC，而且这个数字会越来越低。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "瑞士信貸研究所認爲全球百萬富翁的數量爲5600萬，其中40%在美國。\n萬人，其中40%在美國。(資料來源。\nhttps://www.economist.com/graphic-detail/2019/10/22/millions-of-millionaires)\n\n有很多很多東西是所有百萬富翁都可以擁有和購買的。A...",
      "title": "今天的平均百萬富翁最多可以擁有0.375個BTC，而且這個數字會越來越低。"
    }
  ]
}