{
  "author": "busterrulezzz",
  "original_created_utc": 1647354151,
  "title": "I worked for a crypto start-up for two months. It was horrible.",
  "created_utc": 1647362060,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A few months ago, I wrote on this sub that my objective for 2022 was getting a job in crypto. It worked : I got hired for a start-up in December, and started to work for them in January. I resigned a few weeks ago, and now I want to share my (not so good) story with you.&lt;/p&gt;\n\n&lt;p&gt;(I won&amp;#39;t name the company in question, because I have signed a NDA. But rest assured : you never heard of it before, and it&amp;#39;s not a major player in the ecosystem - it&amp;#39;s not even a minor player.)&lt;/p&gt;\n\n&lt;p&gt;First of all, &lt;strong&gt;the level of disorganisation and chaos was absolute madness&lt;/strong&gt;. Each morning we had a different objective, based on the most recent trend in the market. NFTs are becoming popular? Let&amp;#39;s do NFTs! This particular token is performing well? Let&amp;#39;s buy it, even if it&amp;#39;s at ATH! One of our product doesn&amp;#39;t work anymore because we rushed a bug-fixing patch? Let&amp;#39;s pretend that never happened and let&amp;#39;s keep pushing rosy marketing articles!&lt;/p&gt;\n\n&lt;p&gt;I know that start-ups are notoriously disorganised. I get it. But you can&amp;#39;t expect to be a profitable company, or even be a productive member of the crypto ecosystem, if you can&amp;#39;t even define your objectives and stick to it.&lt;/p&gt;\n\n&lt;p&gt;Secondly, &lt;strong&gt;we cheated.&lt;/strong&gt; What I mean is that we bought bots for our TG channels, we faked users in our Discord, and we partenered with dubious &amp;quot;influencers&amp;quot; to make it look like our products were far more popular than they really were. This kind of stuff is what gives crypto it&amp;#39;s bad reputation to the outside world, and I deeply regret having been a part of this for a short time.&lt;/p&gt;\n\n&lt;p&gt;And finally, and I think this is the most important part : &lt;strong&gt;the founders didn&amp;#39;t care about the crypto ecosystem at all&lt;/strong&gt;. Their main objective was making as much money as quickly as possible. We were acting like an evil hedge fund, precisely the type of institution crypto is supposed to fight. &lt;/p&gt;\n\n&lt;p&gt;I felt sad. I felt like a scammer. So I quitted. And, keeping in line with everything I wrote before, &lt;strong&gt;they didn&amp;#39;t pay me for my last week of work&lt;/strong&gt;. They just ghosted me.&lt;/p&gt;\n\n&lt;p&gt;So... yeah. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t want to discourage people from getting a job in crypto. I still believe in the future of this industry. &lt;strong&gt;But I would advise to stick with the well-known companies of our ecosystem&lt;/strong&gt;, and not waste your time in little-known start-ups that have big dreams, but can&amp;#39;t deliver. We have a long, very long way to go before we become a respectable industry.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/teq4rx/i_worked_for_a_crypto_startup_for_two_months_it/",
  "subreddit": "CryptoCurrency",
  "id": "teq4rx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A few months ago, I wrote on this sub that my objective for 2022 was getting a\njob in crypto. It worked : I got hired for a start-up in December, and started\nto work for them in January. I resigned a few weeks ago, and now I want to share\nmy (not so good) story with you.\n\n(I won't name the company…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前、私はこのサブ記事で、2022年の目標は「就職」だと書きました。\n暗号に関わる仕事 12月にあるスタートアップ企業に採用され、その会社で働き始めました。\n1月から働いています。数週間前に退職しました。\n私の（あまり良くない）ストーリーを紹介します。\n\n(会社名は伏せますが・・・。",
      "title": "暗号のスタートアップ企業で2ヶ月間働きました。それはひどいものでした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我在这个子上写道，我在2022年的目标是获得一份\n在加密货币领域的工作。它成功了：我在12月被一家初创公司聘用，并在1月开始为他们工作。\n一月开始为他们工作。几周前我辞职了，现在我想和大家分享一下\n我的（不那么好的）故事与你分享。\n\n(我不会说出公司的名字...",
      "title": "我在一家加密货币创业公司工作了两个月。这很可怕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我在這個子上寫道，我在2022年的目標是獲得一份\n在加密貨幣領域的工作。它成功了：我在12月被一家初創公司聘用，並在1月開始爲他們工作。\n一月開始爲他們工作。幾周前我辭職了，現在我想和大家分享一下\n我的（不那麼好的）故事與你分享。\n\n(我不會說出公司的名字...",
      "title": "我在一家加密貨幣創業公司工作了兩個月。這很可怕。"
    }
  ]
}