{
  "author": "shardplugged",
  "original_created_utc": 1627109537,
  "title": "It's almost as if no one has a clue! Predicting is a joke in crypto market",
  "created_utc": 1627155237,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>One day they&#39;ll be like &quot;Oh Bitcoin definitely will go down as low as $7k&quot; and tomorrow, now that it&#39;s shown a difference in movement &quot;We bet our money on $100k, why you should, too!&quot;. One billionaire invests in crypto and another pulls the rug. A company keeps praising crypto but not even entering the market, another says nothing and accumulates behind the shadows.</p>\n\n<p>It&#39;s almost as if no one knows where it will go! Of course that&#39;s not the case though. Crystal balls do exist, afterall! /s</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/oqkvlt/its_almost_as_if_no_one_has_a_clue_predicting_is/",
  "subreddit": "CryptoCurrency",
  "id": "oqkvlt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "One day they'll be like \"Oh Bitcoin definitely will go down as low as $7k\" and\ntomorrow, now that it's shown a difference in movement \"We bet our money on\n$100k, why you should, too!\". One billionaire invests in crypto and another\npulls the rug. A company keeps praising crypto but not even entering…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある日、彼らは「ああ、ビットコインは間違いなく7kドルまで下がるだろう」と言い、明日には動きの違いを見せて「我々はお金に賭けた」と言うだろう。\n明日には、動きに差が出てきたので「私たちは100kドルにお金を賭けました。\nなぜあなたもそうすべきなのか！」と言っています。ある億万長者はクリプトに投資し、別の億万長者は\n別の億万長者が暗号に投資し、別の億万長者が暗号を取り上げる。ある会社は暗号を賞賛し続けているが、参入すらしていない...。",
      "title": "まるで誰も手掛かりを持っていないかのように！？暗号市場では予測はジョークに過ぎない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，他们会说：\"哦，比特币肯定会跌到7千美元\"，而明天，它已经显示出不同的走势，\"我们把我们的钱押在它身上\"。\n明天，既然它已经显示出不同的走势，\"我们把我们的钱押在了\n10万美元，为什么你也应该这样！\"。一个亿万富翁投资于加密货币，另一个则\n拔掉了地毯。一家公司不断赞美加密货币，但甚至没有进...",
      "title": "几乎就像没有人有线索一样! 预测是加密货币市场的一个笑话"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，他們會說：\"哦，比特幣肯定會跌到7千美元\"，而明天，它已經顯示出不同的走勢，\"我們把我們的錢押在它身上\"。\n明天，既然它已經顯示出不同的走勢，\"我們把我們的錢押在了\n10萬美元，爲什麼你也應該這樣！\"。一個億萬富翁投資於加密貨幣，另一個則\n拔掉了地毯。一家公司不斷讚美加密貨幣，但甚至沒有進...",
      "title": "幾乎就像沒有人有線索一樣! 預測是加密貨幣市場的一個笑話"
    }
  ]
}