{
  "author": "coconut_dodger",
  "original_created_utc": 1626428024,
  "title": "My unemotional, detached investment strategy",
  "created_utc": 1626442246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My strategy is based on a few hard learnt principles:</p>\n\n<ol>\n<li>Given the right market conditions, the value of all cryptocurrencies trends towards zero.</li>\n<li>The biggest obstacle towards success is yourself, your emotions and over-trading, they sabotage you.</li>\n<li>All information except price is just noise.</li>\n</ol>\n\n<p>Just to caveat that I don&#39;t claim these to be universal or absolute truths. They are just my beliefs and how I base my investment strategy. Also, this is an investment strategy only and does not cover things like research.</p>\n\n<p>Here is my strategy:</p>\n\n<h1>Never buy on green days. If the price is in the green DO NOT BUY.</h1>\n\n<p>This is called FOMO. Seeing the market pump and that awful feeling that you are missing out on parabolic price action. Buying in the green is what certain market participants would call &quot;dumb money&quot; or providing exit-liquidity to whales or those whose cost-basis is much much lower than yours. Of course, it&#39;s not that simple, but regardless I&#39;m just not interested in buying on green days, even if it may continue to pump - not buying.</p>\n\n<h1>Use price alerts. DO NOT LOOK AT CHARTS.</h1>\n\n<p>Install an app that provides price alerts that you can configure. Do not look at price charts. There is a common meme of being &quot;<a href=\"https://www.youtube.com/watch?v=KV5QlSgq7lg\">bogged</a>&quot;; seeing the price drop as soon as you buy, or seeing the price pump as soon as you sell. You cannot detach yourself emotionally if you are watching the minute or hourly price movements. Bitcoin often loses hundreds of dollars in a second and then recovers by several thousands by end of the day,</p>\n\n<h1>Only buy on double-digit red days (-10% 24hrs).</h1>\n\n<p>I don&#39;t follow the &quot;buy the dip&quot; meme. I only start buying once the market crashes or corrects by 10% or more. I use alerts to be notified to this.</p>\n\n<h1>Do not use stop losses.</h1>\n\n<p>I&#39;ve been using unregulated exchanges for long enough to have lost all faith and trust in stop losses. Let&#39;s just leave it at that.</p>\n\n<h1>Sell in tapered increments</h1>\n\n<p>Keep 50% of your portfolio in cold storage and 50% on an exchange. Set your sell orders at tapered increments. </p>\n\n<p>Something like this, or whatever suits you:</p>\n\n<ul>\n<li>Sell 10% of coin A at 10% profit</li>\n<li>Sell 25% of coin A at 20% profit</li>\n<li>Sell 30% of coin A at 40% profit</li>\n<li>Sell 25% of coin A at 60% profit</li>\n<li>Sell 10% of coin A at 80% profit</li>\n</ul>\n\n<p>I keep 50% in cold storage on the basis that it is a long term hold. I forget about these. That&#39;s why I only invest in legit projects, because once you buy a token or coin, it&#39;s a long term relationship. Even if you sell 100% of your holdings, you may still live for years in regret at missed opportunities.</p>\n\n<h1>Buy in tapered increments</h1>\n\n<p>As mentioned earlier, I use price alerts. Once I&#39;m alerted of a 10% drop, I will start buying. I usually place half my buy order manually, and the other half on tapered increments of 3-5% drops. The reason for this is that I want to use at least half of my available cash to buy immediately on a 10% drop and the other half distributed in case we are truly in a black swan event and not just a &quot;correction&quot;.</p>\n\n<h1>Re-asses your portfolio &amp; buy/sell orders once a month only</h1>\n\n<p>Now you have your sell and buy orders set up and your price alerts, and you&#39;ve stopped looking at charts. You have no reason to look at your portfolio unless you&#39;re alerted, so do not do that. You can just take one day a month to rebalance your portfolio and adjust your orders based on the current market conditions.</p>\n\n<h1>Try to keep at least 30% of your portfolio in cash.</h1>\n\n<p>Cash, or stable coins are your leverage in this market. In some ways, your cash is just as important if not more so than your crypto. Being liquid in this market is very important to take advantage of opportunities. Again, do not over-trade, resist the desire to &quot;buy the dip&quot;. Hold your cash for REAL opportunities.  I recommend instead of DCA&#39;ing every month or pay-day into crypto, DCA into cash/stables instead. So you are ready-to-buy crypto on double-digit red days. Build your investment cash stack. Some exchanges apps also offer decent APYs on stables, so there is a double sided benefit there to stacking and waiting, waiting for blood on the streets.</p>\n\n<h1>Do not trade based on anything you read on social media.</h1>\n\n<p>When it comes to money, everyone, EVERYONE has an agenda. Whether a bull, a bear, a maximalist or a skeptical no-coiner, do not listen to any of them. I used to follow a range of channels to try and a get a broad and balanced view or crypto but then soon realized that it&#39;s impossible. I don&#39;t want to get into too much detail but frankly nowadays I am only interested in price. I participate in Reddit only to quell my moon fomo and to try and have some legit discussions or help newbies.</p>\n\n<p>&#x200B;</p>\n\n<p>Now there are some obvious things like <em>don&#39;t invest more than you can afford, never sell at a loss and don&#39;t use leverage</em> etc, but frankly I don&#39;t look at these things because ultimately people will just do what they want. The whole point of my strategy is to detach myself as much as possible.</p>\n\n<p>Finally, I&#39;m not really a crypto expert. Although I have been buying Bitcoin since 2014. I&#39;ve attached a screenshot to support my credentials for my first crypto p2p purchase from my bank. It was for 1 Bitcoin for about 300 pounds. So this strategy is based on many years of experience. I&#39;m not a Johnny come lately giving out advice - who knows, maybe ukbitworks is lurking on reddit :)</p>\n\n<p><a href=\"https://preview.redd.it/0xx1mhyngjb71.jpg?width=3023&amp;format=pjpg&amp;auto=webp&amp;s=95d9deb67d116e3c8cb4d72dc53905fb6735435f\">https://preview.redd.it/0xx1mhyngjb71.jpg?width=3023&amp;format=pjpg&amp;auto=webp&amp;s=95d9deb67d116e3c8cb4d72dc53905fb6735435f</a></p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/oldhlt/my_unemotional_detached_investment_strategy/",
  "subreddit": "CryptoCurrency",
  "id": "oldhlt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My strategy is based on a few hard learnt principles:\n\n 1. Given the right market conditions, the value of all cryptocurrencies trends\n    towards zero.\n 2. The biggest obstacle towards success is yourself, your emotions and\n    over-trading, they sabotage you.\n 3. All information except price is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の戦略は、懸命に学んだいくつかの原則に基づいています。\n\n 1. 適切な市場条件があれば、すべての暗号通貨の価値はゼロに向かう。\n    ゼロに向かっていく。\n 2. 2. 成功への最大の障害は、自分自身、自分の感情、そしてオーバー・トレードです。\n    過剰なトレードは、あなたを妨害します。\n 3. 価格以外のすべての情報は...",
      "title": "感情的にならず、冷静に考えた投資戦略"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的策略是基于几个艰苦学习的原则。\n\n 1. 在正确的市场条件下，所有加密货币的价值都会趋向于\n    趋向于零。\n 2. 2.走向成功的最大障碍是你自己，你的情绪和\n    过度交易，它们破坏了你。\n 3. 除了价格，所有的信息都是...",
      "title": "我的不带感情色彩的、超脱的投资策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的策略是基於幾個艱苦學習的原則。\n\n 1. 在正確的市場條件下，所有加密貨幣的價值都會趨向於\n    趨向於零。\n 2. 2.走向成功的最大障礙是你自己，你的情緒和\n    過度交易，它們破壞了你。\n 3. 除了價格，所有的信息都是...",
      "title": "我的不帶感情色彩的、超脫的投資策略"
    }
  ]
}