{
  "author": "Legal_Smile",
  "original_created_utc": 1631755558,
  "title": "AMC will accept ETH, LTC and BCH at their theaters by the end of 2021. Just awesome.",
  "created_utc": 1631763632,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The CEO of AMC, Adam Aron, just sent out a Tweet confirming that they will also accept ETH, LTC and BCH in addition to BTC in all of their theaters by the end of 2021. While I don&#39;t think this is going to make any of these coins do any parabolic movements as a result, to me this is just another awesome step in the global adoption of crypto as a whole.</p>\n\n<p><a href=\"https://preview.redd.it/c3bhyctaprn71.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=e1db14028c841776a22a9858e5872e6d53f78e88\">https://preview.redd.it/c3bhyctaprn71.jpg?width=1125&amp;format=pjpg&amp;auto=webp&amp;s=e1db14028c841776a22a9858e5872e6d53f78e88</a></p>\n\n<p>From the Tweet: &quot;<em>Cryptocurrency enthusiasts: you likely know AMCTheatres has announced we will accept Bitcoin for online ticket and concession payments by year-end 2021. I can confirm today that when we do so, we also expect that we similarly will accept Ethereum, Litecoin and Bitcoin Cash.</em>&quot;</p>\n</div><!-- SC_ON -->",
  "score": 751,
  "permalink": "/r/CryptoCurrency/comments/pp3ith/amc_will_accept_eth_ltc_and_bch_at_their_theaters/",
  "subreddit": "CryptoCurrency",
  "id": "pp3ith",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The CEO of AMC, Adam Aron, just sent out a Tweet confirming that they will also\naccept ETH, LTC and BCH in addition to BTC in all of their theaters by the end\nof 2021. While I don't think this is going to make any of these coins do any\nparabolic movements as a result, to me this is just another…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "AMCのCEOであるAdam Aronは、年末までにすべての映画館でBTCに加えてETH、LTC、BCHも受け入れることを確認するツイートを発信しました。\n2021年末までに、すべての映画館でBTCに加えてETH、LTC、BCHを受け入れることを確認しました。\n2021年の終わりまでに これによって、これらのコインが何かパラボリックな動きをするとは思いませんが\nこれは、どのコインも結果的にパラボリックな動きをするとは思いませんが、私にとっては、これはただの...",
      "title": "AMCは2021年末までにETH、LTC、BCHを映画館で受け入れる予定です。とにかくすごい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "AMC的首席执行官Adam Aron刚刚发了一条推特，确认他们也将在年底前在所有影院接受ETH、LTC和BCH。\n除了BTC之外，他们还将在2021年底之前在所有的影院接受ETH、LTC和BCH。\n2021年年底。虽然我不认为这将使这些硬币中的任何一个发生任何\n抛物线运动的结果，对我来说，这只是另一个...",
      "title": "AMC将在2021年底前在其影院接受ETH、LTC和BCH。真是太棒了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "AMC的首席執行官Adam Aron剛剛發了一條推特，確認他們也將在年底前在所有影院接受ETH、LTC和BCH。\n除了BTC之外，他們還將在2021年底之前在所有的影院接受ETH、LTC和BCH。\n2021年年底。雖然我不認爲這將使這些硬幣中的任何一個發生任何\n拋物線運動的結果，對我來說，這只是另一個...",
      "title": "AMC將在2021年底前在其影院接受ETH、LTC和BCH。真是太棒了。"
    }
  ]
}