{
  "author": "WarmStreet9",
  "original_created_utc": 1627761286,
  "title": "Was I raped?",
  "created_utc": 1627789564,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok, I know the title sounds harsh but let me cut to the chase. My friend who i’ve been messing around with for a few weeks was in a rough spot mentally, I went over to help her with what she was going through by being there with her. I’m 19M. So she finally calms down enough to where we can go to sleep, I’m tired, I work from 7 - 9pm the next day and wanted sleep, she asks if I wanted to fuck before bed, I say no, she asks me again this time with a different tone, I say “nah yo i’m tired.” She then bumps her thang up against my shit and asks me again, I say “Bruh i’m tired let me sleep.” She then proceeds to start touching my shit and me being me smh, i get hard, so i sigh and she thinks it a sign that i’m in the mood, She starts sucking my dick and i say “this has to be breaking some type of law” she continues, so i say fuck it and pipe her down just so i can sleep, quickest nut of my life just so i can sleep. Was i raped? sexually assaulted ? idk how to feel, it’s been 3 days and i feel used and violated, i have no one to talk fo about this cause i don’t think people understand how i feel. any advice is helpful thank you</p>\n</div><!-- SC_ON -->",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/ovdtrg/was_i_raped/",
  "subreddit": "TooAfraidToAsk",
  "id": "ovdtrg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Ok, I know the title sounds harsh but let me cut to the chase. My friend who\ni’ve been messing around with for a few weeks was in a rough spot mentally, I\nwent over to help her with what she was going through by being there with her.\nI’m 19M. So she finally calms down enough to where we can go to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "さて、タイトルは厳しいようですが、本題に入らせていただきます。私の友人で\n数週間前からちょっかいを出しているのですが、精神的に荒れているようでした。\n彼女が抱えている問題を解決するために、一緒に行ってあげました。\n私は19Mです。それで彼女はやっと落ち着いて、私たちは...",
      "title": "私はレイプされたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我知道这个标题听起来很刺耳，但让我切入正题。我的朋友\n我的朋友和我一起混了几个星期，她的精神状态很不好，我过去帮她解决她的问题。\n我过去帮助她解决她正在经历的事情，陪着她。\n我是19M。所以她终于平静下来，我们可以去...",
      "title": "我被强奸了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我知道這個標題聽起來很刺耳，但讓我切入正題。我的朋友\n我的朋友和我一起混了幾個星期，她的精神狀態很不好，我過去幫她解決她的問題。\n我過去幫助她解決她正在經歷的事情，陪着她。\n我是19M。所以她終於平靜下來，我們可以去...",
      "title": "我被強姦了嗎？"
    }
  ]
}