{
  "author": "Patchman66",
  "the_new_excerpt": "I don’t know why this happens to me. It makes me avoid watching movies because I\ndislike when they end, I grow to like the characters, and my mind treats it as\nif I knew them personally, and watching them go is heart wrenching for some\nreason.\n\nI feel like this is super weird and I should not feel…",
  "original_created_utc": 1619765333,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "なぜこのようなことが起こるのか、私にはわかりません。映画を見ないようになったのは\n登場人物が好きになり、まるで個人的にその人物を知っているかのように感じるからです。\n登場人物が好きになり、まるで個人的に知っているかのように扱い、彼らが去っていくのを見るのはなぜか心が痛むのです。\nなぜか。\n\nこれはとても奇妙なことで、私は感じるべきではないと思うのですが...。",
      "title": "映画や良いテレビ番組が終わると、深い悲しみや寂しさを感じる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道为什么这种情况会发生在我身上。它使我避免看电影，因为我不喜欢电影的结局。\n我不喜欢电影的结尾，我逐渐喜欢上了电影中的人物，而且我的大脑把它当成了我认识的人。\n如果我认识他们本人，看着他们离去就会感到心痛，因为某些原因\n原因。\n\n我觉得这超级奇怪，我不应该觉得...",
      "title": "还有人在电影或好的电视节目结束时有一种深深的悲伤或孤独的感觉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道爲什麼這種情況會發生在我身上。它使我避免看電影，因爲我不喜歡電影的結局。\n我不喜歡電影的結尾，我逐漸喜歡上了電影中的人物，而且我的大腦把它當成了我認識的人。\n如果我認識他們本人，看着他們離去就會感到心痛，因爲某些原因\n原因。\n\n我覺得這超級奇怪，我不應該覺得...",
      "title": "還有人在電影或好的電視節目結束時有一種深深的悲傷或孤獨的感覺嗎？"
    }
  ],
  "title": "Does anyone else get a deep feeling of sadness or loneliness when movies or a good TV show ends?",
  "created_utc": 1619782992,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know why this happens to me. It makes me avoid watching movies because I dislike when they end, I grow to like the characters, and my mind treats it as if I knew them personally, and watching them go is heart wrenching for some reason.</p>\n\n<p>I feel like this is super weird and I should not feel this way, especially when I know that they are just actors, and not the actual characters they play as.</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/n1o8g6/does_anyone_else_get_a_deep_feeling_of_sadness_or/",
  "subreddit": "TooAfraidToAsk",
  "id": "n1o8g6",
  "is_self": true,
  "media": null,
  "is_video": false
}