{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "Good Friday evening to all of you here on r/stocks. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week & month ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning August 2nd, 2021.\n\n# **July jobs report could be what gives the market its next big jolt in the week ahead - [(Source)](https://www.cnbc.com/2021/07/30/july-jobs-report-could-be-what-gives-the-market-its-next-big-jolt-in-the-week-ahead.html)**\n*****\n> Friday’s jobs report could be a catalyst that helps determine whether markets are volatile or will trade like it’s the quiet dog days of August.\n*****\n> More than a quarter of the S&P 500 report earnings in the coming week. The calendar includes companies in sectors such as consumer staples, insurance, pharma, travel and media. From Booking Holdings to ViacomCBS, Wayfair and Kellogg, investors will be watching to see what companies say about reopening activity, supply chain disruptions and rising costs.\n*****\n> “I think as much as 85% of the companies which are reporting earnings mentioned inflation on their earnings calls,” Franklin Templeton Fixed Income chief investment officer Sonal Desai said. “Inflation may not be a problem to policymakers and financial markets, which seem not to be concerned at all. It does seem to bother the people who have to buy stuff or people who produce stuff.”\n*****\n> # The jobs factor\n> The Federal Reserve has said the sharp jump in inflation is just temporary, and many investors appear to be taking it in stride for now. The market is intensely focused on the central bank’s other mandate: the labor market. Fed Chairman Jerome Powell said Wednesday he would like to see strong jobs reports before winding down the central bank’s $120 billion a month bond-buying program.\n*****\n> The U.S. Bureau of Labor Statistics will release the July employment report on the morning of Friday, Aug. 6. It’s expected to show 788,000 nonfarm payrolls, down from 850,000 in June, according to Dow Jones. The unemployment rate is expected to dip to 5.7% from 5.9%. Average hourly wages are expected to rise 3.9% year over year.\n*****\n> Ironsides Macroeconomics director of research Barry Knapp said he expects the next two monthly jobs reports will be strong, and the Fed should then be ready to announce in September that it is ready to start the slow unwind of its bond purchasing program.\n*****\n> That is an important step since it would be the first real move away from the central bank’s easy policies that were put in place in the pandemic. It would also mean the Fed would be open to raising interest rates once the tapering is completed.\n*****\n> # Game changer for markets\n> “Friday could be a game changer,” Knapp said of the employment report. Before that, he expects stocks to trade in a narrow range.\n*****\n> If the number of jobs added in July is much higher than expected, at more than 1 million, Knapp said the market could immediately sell off on the idea the Fed would be ready to pare back its bond purchases.\n*****\n> If the number is weaker than expected, the market could rally. “We are in a dead period after earnings, with concerns about the pace of the reopening. It’s still a bit of a question mark. The bias would be higher after a weak number. ... Bad is good. Good is bad,” said Knapp.\n*****\n> Like some other strategists, he expects to see a stock market correction, possibly later this summer.\n*****\n> “I’m in the camp where I think we’re going to have our first major correction.” Knapp said. “What we’re likely to get is at least 10% or more. ... It could really happen when they [Fed officials] make the announcement in September.”\n*****\n> Wilmington Trust chief economist Luke Tilley said he expects just 350,000 jobs, based on the high frequency data he watches.\n*****\n> “We think the run rate is about 500,000 jobs. Last month seems a little bit overcooked,” he said.\n*****\n> # Reflation trade\n> The S&P 500 was down 0.4% in the past week, finishing at 4,395, while the Nasdaq lost even more , down 1.1% at 14,672.\n*****\n> Cyclical stocks were among the best performers. Materials jumped 2.8% in the week, and energy shares were up 1.6%. Financials gained 0.7%. But tech fell 0.7%.\n*****\n> Knapp said it now makes sense to hold stocks that are in the reflation trade, such as energy, industrials or materials.\n*****\n> The surge in the delta variant of the coronavirus has become a worry among investors and has been a factor holding down interest rates. The 10-year yield, which moves opposite price, has held at low levels and was at 1.23% on Friday, amid concern that the delta variant of the coronavirus could slow growth.\n*****\n> Investors will be watching other important data in the coming week, including the Institute for Supply Management’s manufacturing data Monday, and jobless claims and trade data Thursday.\n*****\n> # The China trade\nChina was also a dominant market story in the past week and could continue to be. Hong Kong’s Hang Seng Index fell 5% for the week. Chinese regulators continued their crackdown on internet companies, publicly traded education companies and other industries.\n*****\n> Strategists say Beijing is trying to reclaim its biggest companies as its own and turn them away from listings in foreign markets. Officials were particularly upset with Didi Global which reportedly went public even after being warned not to by Beijing.\n*****\n> Chinese regulators reportedly spoke with international banks after their actions sparked a wave of selling in internet stocks and the broader Chinese stock market. The regulators said companies could continue to go public in the U.S. if they met listing requirements.\n*****\n> “We will continue to see regulators try to calm the waters. I would say this was a communications misstep,” said Franklin Templeton’s Desai. “You don’t have massive swings without having negative impact.” She added it sent ripples through emerging markets.\n*****\n> “This is China trying to gain control, and they tried to do it in a very heavy way, and they were surprised at the backlash,” Desai said.\n*****\n> The KraneShares CSI China Internet ETF has lost about half its value from its peak in February, and was down another 2.6% Friday.\n*****\n> Internet retailer Alibaba is one of the ETF’s top holdings. The company is expected to announce earnings on Tuesday.\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/eQ4pMub.png))**\n\n# **S&P Sectors for this past week:**\n###### **([CLICK HERE FOR THE S&P SECTORS FOR THE PAST WEEK!](https://i.imgur.com/vhlrMce.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/RRSF7cS.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/hTKiEb3.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/YrCuf8W.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/fZKzJfU.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/59nY5gO.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/flIRmSl.png))**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ZpaVwYn.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/GB7yn3W.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/5r4Hlqm.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/L68F4GF.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/VocjXSz.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/oDsO8vO.png))**\n\n*****\n\n> # August has been a dangerous month for the market\n\n> August is the worst DJIA, S&P 500, Russell 1000 and Russell 2000 month over the last 33 years, 1988-2020 with average declines ranging from 0.4% by Russell 2000 to 0.8% by DJIA. For NASDAQ August ranks second worst over the same period with an average gain of 0.2%.\n\n> Contributing to this poor performance since 1987; the second shortest bear market in history (45 days) caused by turmoil in Russia, the Asian currency crisis and the Long-Term Capital Management hedge fund debacle ending August 31, 1998 with the DJIA shedding 6.4% that day. DJIA dropped a record 1344.22 points for the month, off 15.1%—which is the second worst monthly percentage DJIA loss since 1950. Saddam Hussein triggered a 10.0% slide in August 1990. Sizeable losses in 2010, 2011, 2013 and 2015 of over 4% on DJIA have widened Augusts’ average decline.\n\n> In post-election years, Augusts’ rankings are little changed. August is the worst month for DJIA and Russell 1000 and second worst for S&P 500, NASDAQ and Russell 2000. Average declines in post-election year Augusts swell to 0.8% by Russell 2000 to 1.7% by DJIA. Each index has also seen more declining post-election year Augusts than positive.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/78fd9b0e8110b9d2e779ce650c18cd79/3293cb0a1c43f61d-02/s400x600/92f8c448cdafe2c1f033ccdad8bd7b3461f26a66.jpg))**\n\n*****\n\n> # Modern 4-Year Cycle Theory Approaching Near Term High\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/e7c3175df9fa85b593af70440d79c62f/b5c96d0e540e1659-24/s500x750/5c976a9f3f233c0795ead0a363cd399469eab8e2.jpg))**\n\n> Despite the recent uptick in volatility and today’s drop the S&P 500% is up 17.2% year-to-date. This is right in line with our 2021 Annual Forecast best case scenario made last December. Our updated outlook is for S&P 500 to finish the year in the 4300-4500 range or even higher.\n\n> However, as you can see in the chart of the Modern 4-Year Presidential Election Cycle we are due for a pause over the next couple of months before the rally resumes in the September/October timeframe. This illustration of the average 4-year cycle uses the S&P 500 back to 1949, which is the first full cycle post-WWII vs. other comparisons that use the Dow back 125 years to 1896.\n\n> We feel the more recent dataset is a better representation of the modern cycle where post-election years have been better and election years weaker – impacted by the undecided election in 2000 and the financial crisis of 2008. Midterm years are still lackluster with propensity for the significant bottoms and pre-election years are still the tops.\n\n> This creates the sweet spot of the 4-year cycle from Q4 in the midterm year through Q2 in the pre-election year. From the midterm low to the pre-election year high DJIA averages a 45% gain since 1950 and NASDAQ averages a 70% gain since 1974.\n\n*****\n\n> # Neutral Sentiment Surge Continues\n\n> The AAII's weekly sentiment survey saw an equal percentage (30.6%) of respondents report as bullish and bearish last week. This week saw a much more optimistic pivot as 36.2% of respondents reported bullish sentiment. While higher, bullish sentiment is still at one of the lowest levels since last fall. At 36.2%, bullish sentiment is also now just below the historical average of 38%. While the AAII reading on bullish sentiment was higher but still muted, the Investors Intelligence survey of newsletter writers showed bullish sentiment fall 8.1 percentage points to 53.1%. While that is not a particularly low reading (the lowest since only the end of May), it was the largest one week decline since October 2019. In other words, bullish sentiment is not necessarily collapsing, but it has lost some footing.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Bull.png))**\n\n> With more bulls in the AAII survey, fewer respondents reported bearish sentiment. In fact, less than a quarter of investors reported bearish sentiment this week. That is down 6.5 percentage points from the prior week; the largest one-week decline since a 6.6 percentage point decline in the first week of June.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Bear.png))**\n\n> The inverse moves in bullish and bearish sentiment resulted in the bull-bear spread to rise 12.1 points. While off the lows, it is still not as strong of a reading as has been seen for most of this year. In fact, the current reading is 5.5 points below the average since the start of the year.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Spread.png))**\n\n> The most impressive sentiment reading this week was neutral sentiment. Over the past four weeks, neutral sentiment has risen 10.5 percentage points without a single decline in that time. That is the biggest four-week rise since mid-May when it had risen 14.9 percentage points. Now as the predominant sentiment with just below 40% of respondents reporting as such, neutral sentiment is at the highest level since the first week of 2020 when this reading was 1.2 percentage points higher.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Neutral.png))**\n\n*****\n\n> # Services Consumption Lifts GDP Growth\n\n> Lofty expectations for second quarter gross domestic product (GDP) growth were left somewhat wanting as a decent headline number fell short of expectations. Peering under the hood, though, we think this is still a fairly solid report.\n\n> The Bureau of Economic Analysis released its preliminary estimate for second quarter GDP this morning, showing the U.S. economy grew at a 6.5% annualized pace against the Bloomberg median forecast for 8.4%. While this represented a small acceleration from the first quarter’s 6.3% pace, investors viewed the headline number as a mild disappointment in light of the heightened expectations. The composition of the growth, though, largely reinforces the prevailing narratives of a strong consumer juxtaposed with supply chain bottlenecks, restricting growth.\n\n> “The positive takeaway from today’s report is that we are clearly seeing a rebound in the in-person consumption of services,” said LPL Financial Chief Investment Strategist Ryan Detrick. “This indicates a confidence by consumers to reengage with the parts of the economy beaten down most by COVID, and continued momentum here will be key if we are to see the consumer continue to power overall growth.”\n\n> As seen in the LPL Chart of the day, the US consumer continued to do the heavy lifting, offsetting weakness in most other major GDP components.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/07/7.29.21-Blog-1-Chart-1.png?ssl=1))**\n\n> Business fixed investment came in strong and demonstrated business’ attempts to ramp up output to meet surging demand. Residential investment had a more predictable decline, as well-documented labor shortages and high materials costs are restricting new projects. The volatile inventory components, though, did represent a drag.\n\n> Looking forward, we expect continued growth in the third quarter but with a different composition. Consumer spending should still be respectable, but likely will recede a bit due to the fading impact of past government transfer payments. New momentum in services as in-person commerce picks up should continue under the hood. Picking up the slack; though, business investment should continue to recover, and net exports may improve as the rest of the world plays catch-up to the U.S. in their recoveries, consuming more of our goods and services. Government spending and inventories also both have favorable outlooks.\n\n> The Delta variant of COVID-19 presents a risk to the outlook, but we see strong reason to remain optimistic. The U.S. is lagging the U.K. in its exposure to the Delta variant, and if we model our trajectory after theirs, which obviously is an imperfect comparison, we expect to see a peak in cases in the coming weeks. In fact, the U.K. is already on a strong path to recovery despite doomsday headlines. Domestically, COVID-19 cases are spiking in areas with the lowest vaccination rates. But, there is evidence that these are also the states experiencing the highest uptick in new vaccinations, which should help self-correct the trends. Positivity rates can be thought of as the fastest-twitch indicator, with hospitalization trends following in the ensuing weeks. Through that lens we see that some of the hardest hit states may have already seen their positivity rates peak.\n\n> We upgraded our 2021 forecast for U.S. real GDP growth earlier this year from 5–5.5% to 6.25–6.75%, and while there are sure to be bumps along the way, we expect to see the economy continue growing at a strong pace as activity further normalizes over the course of the year.\n\n*****\n\nHere are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-\n\n*****\n\n> * (**T.B.A. THIS WEEKEND.**)\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/GB7yn3W.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/TQmsBSu.png))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 2 WEEKS!](https://i.imgur.com/Gzq3pvf.jpg))**\n###### **([CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY'S MARKET OPEN!](https://i.imgur.com/6Fs8mPV.jpg))**\n\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 8.2.21 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/ZWp8OaE.png))\n\n> # ***Monday 8.2.21 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/ohdyr9p.png))\n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/slHJD4Q.png))\n\n*****\n\n> # ***Tuesday  8.3.21 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/1zkKsVE.png))\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/WAATOMk.png))\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #3!](https://i.imgur.com/xh7l5Zv.png))\n\n> # ***Tuesday 8.3.21 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/e0sMEnG.png))\n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/2IwGNKM.png))\n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #3!](https://i.imgur.com/cW7zxea.png))\n\n*****\n\n> # ***Wednesday 8.4.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/jqS9aXG.png))\n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/Rp9cJXU.png))\n\n> # ***Wednesday 8.4.21 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/tgLqTTK.png))\n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/ZBTMpeg.png))\n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #3!](https://i.imgur.com/mt44H8d.png))\n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #4!](https://i.imgur.com/NzzJziN.png))\n\n*****\n\n> # ***Thursday 8.5.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/FFtYdqW.png))\n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/TIbnFLG.png))\n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #3!](https://i.imgur.com/y2pICGr.png))\n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #4!](https://i.imgur.com/niaft8M.png))\n\n> # ***Thursday 8.5.21 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/HzDehyM.png))\n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/IP92TD5.png))\n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #3!](https://i.imgur.com/jtvNw70.png))\n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #4!](https://i.imgur.com/9z7EDva.png))\n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK #5!](https://i.imgur.com/6VRQZfz.png))\n\n*****\n\n> # ***Friday 8.6.21 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #1!](https://i.imgur.com/he9f0pH.png))\n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES LINK #2!](https://i.imgur.com/PiPV8iT.png))\n\n*****\n\n> # ***Friday 8.6.21 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # (T.B.A. THIS WEEKEND.)\n**(T.B.A. THIS WEEKEND.)** (T.B.A. THIS WEEKEND.).\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=SPY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend a great trading week ahead r/stocks. :)",
  "author_fullname": "t2_eaak0",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Wall Street Week Ahead for the trading week beginning August 2nd, 2021",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": null,
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_ouykv9",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.94,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 46,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": null,
  "can_mod_post": false,
  "score": 46,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": true,
  "thumbnail": "",
  "edited": 1627733492,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {
    "gid_1": 1
  },
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1627696526,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Friday evening to all of you here on <a href=\"/r/stocks\">r/stocks</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week &amp; month ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning August 2nd, 2021.</p>\n\n<h1><strong>July jobs report could be what gives the market its next big jolt in the week ahead - <a href=\"https://www.cnbc.com/2021/07/30/july-jobs-report-could-be-what-gives-the-market-its-next-big-jolt-in-the-week-ahead.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Friday’s jobs report could be a catalyst that helps determine whether markets are volatile or will trade like it’s the quiet dog days of August.</p>\n\n<hr/>\n\n<p>More than a quarter of the S&amp;P 500 report earnings in the coming week. The calendar includes companies in sectors such as consumer staples, insurance, pharma, travel and media. From Booking Holdings to ViacomCBS, Wayfair and Kellogg, investors will be watching to see what companies say about reopening activity, supply chain disruptions and rising costs.</p>\n\n<hr/>\n\n<p>“I think as much as 85% of the companies which are reporting earnings mentioned inflation on their earnings calls,” Franklin Templeton Fixed Income chief investment officer Sonal Desai said. “Inflation may not be a problem to policymakers and financial markets, which seem not to be concerned at all. It does seem to bother the people who have to buy stuff or people who produce stuff.”</p>\n\n<hr/>\n\n<h1>The jobs factor</h1>\n\n<p>The Federal Reserve has said the sharp jump in inflation is just temporary, and many investors appear to be taking it in stride for now. The market is intensely focused on the central bank’s other mandate: the labor market. Fed Chairman Jerome Powell said Wednesday he would like to see strong jobs reports before winding down the central bank’s $120 billion a month bond-buying program.</p>\n\n<hr/>\n\n<p>The U.S. Bureau of Labor Statistics will release the July employment report on the morning of Friday, Aug. 6. It’s expected to show 788,000 nonfarm payrolls, down from 850,000 in June, according to Dow Jones. The unemployment rate is expected to dip to 5.7% from 5.9%. Average hourly wages are expected to rise 3.9% year over year.</p>\n\n<hr/>\n\n<p>Ironsides Macroeconomics director of research Barry Knapp said he expects the next two monthly jobs reports will be strong, and the Fed should then be ready to announce in September that it is ready to start the slow unwind of its bond purchasing program.</p>\n\n<hr/>\n\n<p>That is an important step since it would be the first real move away from the central bank’s easy policies that were put in place in the pandemic. It would also mean the Fed would be open to raising interest rates once the tapering is completed.</p>\n\n<hr/>\n\n<h1>Game changer for markets</h1>\n\n<p>“Friday could be a game changer,” Knapp said of the employment report. Before that, he expects stocks to trade in a narrow range.</p>\n\n<hr/>\n\n<p>If the number of jobs added in July is much higher than expected, at more than 1 million, Knapp said the market could immediately sell off on the idea the Fed would be ready to pare back its bond purchases.</p>\n\n<hr/>\n\n<p>If the number is weaker than expected, the market could rally. “We are in a dead period after earnings, with concerns about the pace of the reopening. It’s still a bit of a question mark. The bias would be higher after a weak number. ... Bad is good. Good is bad,” said Knapp.</p>\n\n<hr/>\n\n<p>Like some other strategists, he expects to see a stock market correction, possibly later this summer.</p>\n\n<hr/>\n\n<p>“I’m in the camp where I think we’re going to have our first major correction.” Knapp said. “What we’re likely to get is at least 10% or more. ... It could really happen when they [Fed officials] make the announcement in September.”</p>\n\n<hr/>\n\n<p>Wilmington Trust chief economist Luke Tilley said he expects just 350,000 jobs, based on the high frequency data he watches.</p>\n\n<hr/>\n\n<p>“We think the run rate is about 500,000 jobs. Last month seems a little bit overcooked,” he said.</p>\n\n<hr/>\n\n<h1>Reflation trade</h1>\n\n<p>The S&amp;P 500 was down 0.4% in the past week, finishing at 4,395, while the Nasdaq lost even more , down 1.1% at 14,672.</p>\n\n<hr/>\n\n<p>Cyclical stocks were among the best performers. Materials jumped 2.8% in the week, and energy shares were up 1.6%. Financials gained 0.7%. But tech fell 0.7%.</p>\n\n<hr/>\n\n<p>Knapp said it now makes sense to hold stocks that are in the reflation trade, such as energy, industrials or materials.</p>\n\n<hr/>\n\n<p>The surge in the delta variant of the coronavirus has become a worry among investors and has been a factor holding down interest rates. The 10-year yield, which moves opposite price, has held at low levels and was at 1.23% on Friday, amid concern that the delta variant of the coronavirus could slow growth.</p>\n\n<hr/>\n\n<p>Investors will be watching other important data in the coming week, including the Institute for Supply Management’s manufacturing data Monday, and jobless claims and trade data Thursday.</p>\n\n<hr/>\n\n<h1>The China trade</h1>\n\n<p>China was also a dominant market story in the past week and could continue to be. Hong Kong’s Hang Seng Index fell 5% for the week. Chinese regulators continued their crackdown on internet companies, publicly traded education companies and other industries.</p>\n\n<hr/>\n\n<p>Strategists say Beijing is trying to reclaim its biggest companies as its own and turn them away from listings in foreign markets. Officials were particularly upset with Didi Global which reportedly went public even after being warned not to by Beijing.</p>\n\n<hr/>\n\n<p>Chinese regulators reportedly spoke with international banks after their actions sparked a wave of selling in internet stocks and the broader Chinese stock market. The regulators said companies could continue to go public in the U.S. if they met listing requirements.</p>\n\n<hr/>\n\n<p>“We will continue to see regulators try to calm the waters. I would say this was a communications misstep,” said Franklin Templeton’s Desai. “You don’t have massive swings without having negative impact.” She added it sent ripples through emerging markets.</p>\n\n<hr/>\n\n<p>“This is China trying to gain control, and they tried to do it in a very heavy way, and they were surprised at the backlash,” Desai said.</p>\n\n<hr/>\n\n<p>The KraneShares CSI China Internet ETF has lost about half its value from its peak in February, and was down another 2.6% Friday.</p>\n\n<hr/>\n\n<p>Internet retailer Alibaba is one of the ETF’s top holdings. The company is expected to announce earnings on Tuesday.</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/eQ4pMub.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/vhlrMce.png\">CLICK HERE FOR THE S&amp;P SECTORS FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/RRSF7cS.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/hTKiEb3.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/YrCuf8W.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/fZKzJfU.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/59nY5gO.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/flIRmSl.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ZpaVwYn.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/GB7yn3W.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/5r4Hlqm.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/L68F4GF.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/VocjXSz.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/oDsO8vO.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>August has been a dangerous month for the market</h1>\n\n<p>August is the worst DJIA, S&amp;P 500, Russell 1000 and Russell 2000 month over the last 33 years, 1988-2020 with average declines ranging from 0.4% by Russell 2000 to 0.8% by DJIA. For NASDAQ August ranks second worst over the same period with an average gain of 0.2%.</p>\n\n<p>Contributing to this poor performance since 1987; the second shortest bear market in history (45 days) caused by turmoil in Russia, the Asian currency crisis and the Long-Term Capital Management hedge fund debacle ending August 31, 1998 with the DJIA shedding 6.4% that day. DJIA dropped a record 1344.22 points for the month, off 15.1%—which is the second worst monthly percentage DJIA loss since 1950. Saddam Hussein triggered a 10.0% slide in August 1990. Sizeable losses in 2010, 2011, 2013 and 2015 of over 4% on DJIA have widened Augusts’ average decline.</p>\n\n<p>In post-election years, Augusts’ rankings are little changed. August is the worst month for DJIA and Russell 1000 and second worst for S&amp;P 500, NASDAQ and Russell 2000. Average declines in post-election year Augusts swell to 0.8% by Russell 2000 to 1.7% by DJIA. Each index has also seen more declining post-election year Augusts than positive.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/78fd9b0e8110b9d2e779ce650c18cd79/3293cb0a1c43f61d-02/s400x600/92f8c448cdafe2c1f033ccdad8bd7b3461f26a66.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Modern 4-Year Cycle Theory Approaching Near Term High</h1>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/e7c3175df9fa85b593af70440d79c62f/b5c96d0e540e1659-24/s500x750/5c976a9f3f233c0795ead0a363cd399469eab8e2.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Despite the recent uptick in volatility and today’s drop the S&amp;P 500% is up 17.2% year-to-date. This is right in line with our 2021 Annual Forecast best case scenario made last December. Our updated outlook is for S&amp;P 500 to finish the year in the 4300-4500 range or even higher.</p>\n\n<p>However, as you can see in the chart of the Modern 4-Year Presidential Election Cycle we are due for a pause over the next couple of months before the rally resumes in the September/October timeframe. This illustration of the average 4-year cycle uses the S&amp;P 500 back to 1949, which is the first full cycle post-WWII vs. other comparisons that use the Dow back 125 years to 1896.</p>\n\n<p>We feel the more recent dataset is a better representation of the modern cycle where post-election years have been better and election years weaker – impacted by the undecided election in 2000 and the financial crisis of 2008. Midterm years are still lackluster with propensity for the significant bottoms and pre-election years are still the tops.</p>\n\n<p>This creates the sweet spot of the 4-year cycle from Q4 in the midterm year through Q2 in the pre-election year. From the midterm low to the pre-election year high DJIA averages a 45% gain since 1950 and NASDAQ averages a 70% gain since 1974.</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Neutral Sentiment Surge Continues</h1>\n\n<p>The AAII&#39;s weekly sentiment survey saw an equal percentage (30.6%) of respondents report as bullish and bearish last week. This week saw a much more optimistic pivot as 36.2% of respondents reported bullish sentiment. While higher, bullish sentiment is still at one of the lowest levels since last fall. At 36.2%, bullish sentiment is also now just below the historical average of 38%. While the AAII reading on bullish sentiment was higher but still muted, the Investors Intelligence survey of newsletter writers showed bullish sentiment fall 8.1 percentage points to 53.1%. While that is not a particularly low reading (the lowest since only the end of May), it was the largest one week decline since October 2019. In other words, bullish sentiment is not necessarily collapsing, but it has lost some footing.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Bull.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>With more bulls in the AAII survey, fewer respondents reported bearish sentiment. In fact, less than a quarter of investors reported bearish sentiment this week. That is down 6.5 percentage points from the prior week; the largest one-week decline since a 6.6 percentage point decline in the first week of June.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Bear.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The inverse moves in bullish and bearish sentiment resulted in the bull-bear spread to rise 12.1 points. While off the lows, it is still not as strong of a reading as has been seen for most of this year. In fact, the current reading is 5.5 points below the average since the start of the year.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Spread.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The most impressive sentiment reading this week was neutral sentiment. Over the past four weeks, neutral sentiment has risen 10.5 percentage points without a single decline in that time. That is the biggest four-week rise since mid-May when it had risen 14.9 percentage points. Now as the predominant sentiment with just below 40% of respondents reporting as such, neutral sentiment is at the highest level since the first week of 2020 when this reading was 1.2 percentage points higher.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2021/07/072921-AAII-Neutral.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Services Consumption Lifts GDP Growth</h1>\n\n<p>Lofty expectations for second quarter gross domestic product (GDP) growth were left somewhat wanting as a decent headline number fell short of expectations. Peering under the hood, though, we think this is still a fairly solid report.</p>\n\n<p>The Bureau of Economic Analysis released its preliminary estimate for second quarter GDP this morning, showing the U.S. economy grew at a 6.5% annualized pace against the Bloomberg median forecast for 8.4%. While this represented a small acceleration from the first quarter’s 6.3% pace, investors viewed the headline number as a mild disappointment in light of the heightened expectations. The composition of the growth, though, largely reinforces the prevailing narratives of a strong consumer juxtaposed with supply chain bottlenecks, restricting growth.</p>\n\n<p>“The positive takeaway from today’s report is that we are clearly seeing a rebound in the in-person consumption of services,” said LPL Financial Chief Investment Strategist Ryan Detrick. “This indicates a confidence by consumers to reengage with the parts of the economy beaten down most by COVID, and continued momentum here will be key if we are to see the consumer continue to power overall growth.”</p>\n\n<p>As seen in the LPL Chart of the day, the US consumer continued to do the heavy lifting, offsetting weakness in most other major GDP components.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2021/07/7.29.21-Blog-1-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Business fixed investment came in strong and demonstrated business’ attempts to ramp up output to meet surging demand. Residential investment had a more predictable decline, as well-documented labor shortages and high materials costs are restricting new projects. The volatile inventory components, though, did represent a drag.</p>\n\n<p>Looking forward, we expect continued growth in the third quarter but with a different composition. Consumer spending should still be respectable, but likely will recede a bit due to the fading impact of past government transfer payments. New momentum in services as in-person commerce picks up should continue under the hood. Picking up the slack; though, business investment should continue to recover, and net exports may improve as the rest of the world plays catch-up to the U.S. in their recoveries, consuming more of our goods and services. Government spending and inventories also both have favorable outlooks.</p>\n\n<p>The Delta variant of COVID-19 presents a risk to the outlook, but we see strong reason to remain optimistic. The U.S. is lagging the U.K. in its exposure to the Delta variant, and if we model our trajectory after theirs, which obviously is an imperfect comparison, we expect to see a peak in cases in the coming weeks. In fact, the U.K. is already on a strong path to recovery despite doomsday headlines. Domestically, COVID-19 cases are spiking in areas with the lowest vaccination rates. But, there is evidence that these are also the states experiencing the highest uptick in new vaccinations, which should help self-correct the trends. Positivity rates can be thought of as the fastest-twitch indicator, with hospitalization trends following in the ensuing weeks. Through that lens we see that some of the hardest hit states may have already seen their positivity rates peak.</p>\n\n<p>We upgraded our 2021 forecast for U.S. real GDP growth earlier this year from 5–5.5% to 6.25–6.75%, and while there are sure to be bumps along the way, we expect to see the economy continue growing at a strong pace as activity further normalizes over the course of the year.</p>\n</blockquote>\n\n<hr/>\n\n<p>Here are the most notable companies (tickers) reporting earnings in this upcoming trading week ahead-</p>\n\n<hr/>\n\n<blockquote>\n<ul>\n<li>(<strong>T.B.A. THIS WEEKEND.</strong>)</li>\n</ul>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/GB7yn3W.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/TQmsBSu.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/Gzq3pvf.jpg\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES FOR THE NEXT 2 WEEKS!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/6Fs8mPV.jpg\">CLICK HERE FOR THE MOST ANTICIPATED EARNINGS RELEASES BEFORE MONDAY&#39;S MARKET OPEN!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 8.2.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/ZWp8OaE.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 8.2.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/ohdyr9p.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/slHJD4Q.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  8.3.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/1zkKsVE.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/WAATOMk.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/xh7l5Zv.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n\n<h1><strong><em>Tuesday 8.3.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/e0sMEnG.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/2IwGNKM.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/cW7zxea.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 8.4.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/jqS9aXG.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/Rp9cJXU.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h1><strong><em>Wednesday 8.4.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/tgLqTTK.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/ZBTMpeg.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/mt44H8d.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/NzzJziN.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 8.5.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/FFtYdqW.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/TIbnFLG.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/y2pICGr.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/niaft8M.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!</a>)</h6>\n\n<h1><strong><em>Thursday 8.5.21 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/HzDehyM.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/IP92TD5.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/jtvNw70.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #3!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/9z7EDva.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #4!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/6VRQZfz.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK #5!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 8.6.21 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/he9f0pH.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #1!</a>)</h6>\n\n<h6>(<a href=\"https://i.imgur.com/PiPV8iT.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES LINK #2!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 8.6.21 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>(T.B.A. THIS WEEKEND.)</h1>\n\n<p><strong>(T.B.A. THIS WEEKEND.)</strong> (T.B.A. THIS WEEKEND.).</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=SPY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend a great trading week ahead <a href=\"/r/stocks\">r/stocks</a>. :)</p>\n</div><!-- SC_ON -->",
  "likes": null,
  "suggested_sort": null,
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "",
  "id": "ouykv9",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "bigbear0083",
  "discussion_type": null,
  "num_comments": 3,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/ouykv9/wall_street_week_ahead_for_the_trading_week/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/ouykv9/wall_street_week_ahead_for_the_trading_week/",
  "subreddit_subscribers": 2939223,
  "created_utc": 1627763807,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1627696526,
  "the_new_excerpt": "Good Friday evening to all of you here on r/stocks [/r/stocks]. I hope everyone\non this sub made out pretty nicely in the market this past week, and is ready\nfor the new trading week & month ahead.\n\nHere is everything you need to know to get you ready for the trading week\nbeginning August 2nd,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "r/stocks[/r/stocks]をご覧の皆様、金曜日の夜はいかがお過ごしでしょうか。このサブの皆さんは\nこのサブにいる皆さんは、先週の市場でうまく儲けて、新しい取引の準備ができていることと思います。\nこれから始まる新しい取引に向けて準備ができていることと思います。\n\nここでは、8月2日から始まるトレーディングウィークに向けて、知っておくべきことをお伝えします。\n8月2日からの",
      "title": "2021年8月2日から始まる取引週のWall Street Week Ahead"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在r/stocks [/r/stocks]上的各位周五晚上好。我希望每个人\n在过去的一周里在市场上赚得盆满钵满，并准备好迎接新的交易周和新的月份。\n准备好迎接新的交易周和新的月份。\n\n以下是你需要知道的一切，让你为交易周做好准备\n从8月2日开始，...",
      "title": "2021年8月2日开始的交易周，华尔街一周前瞻"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在r/stocks [/r/stocks]上的各位週五晚上好。我希望每個人\n在過去的一週裏在市場上賺得盆滿鉢滿，並準備好迎接新的交易周和新的月份。\n準備好迎接新的交易周和新的月份。\n\n以下是你需要知道的一切，讓你爲交易周做好準備\n從8月2日開始，...",
      "title": "2021年8月2日開始的交易周，華爾街一週前瞻"
    }
  ],
  "source_updated_at": 1628242941146
}