{
  "author": "ernestscr1bbler",
  "original_created_utc": 1642077986,
  "title": "What was the significance of “young person” vs “young lady” in Victorian times?",
  "created_utc": 1642103334,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m reading Dickens’ Martin Chuzzlewit and the following passage struck me;&lt;/p&gt;\n\n&lt;p&gt;‘I am afraid, sir,’ continued the landlady, first looking round to assure herself that there was nobody within hearing, and then looking down upon the floor. ‘I am very much afraid, sir, that his conscience is troubled by his not being related to—or—or even married to—a very young lady—’\n‘Mrs Lupin!’ said Mr Pecksniff, holding up his hand with something in his manner as nearly approaching to severity as any expression of his, mild being that he was, could ever do. ‘Person! young person?’\n‘A very young person,’ said Mrs Lupin, curtseying and blushing; ‘—I beg your pardon, sir, but I have been so hurried to-night, that I don’t know what I say—who is with him now.’&lt;/p&gt;\n\n&lt;p&gt;I’ve noticed this several times in Victorian novels; a woman is referred to as a “young lady”, upon which the speaker is corrected (often by a snobby or pedantic character) and reminded that the woman in question is a “young person” and not a “young lady”. Was it a class thing? That only higher class or respectable women were “ladies” (in the same way that higher class men were “gentlemen”) and that lower class or morally questionable women shouldn’t be addressed as such? If so, why person specifically? I feel like I should know this since I did my MA in Modern English Lit but I’ve never seen it explicitly addressed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s2ynoi/what_was_the_significance_of_young_person_vs/",
  "subreddit": "AskHistorians",
  "id": "s2ynoi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m reading Dickens’ Martin Chuzzlewit and the following passage struck me;\n\n‘I am afraid, sir,’ continued the landlady, first looking round to assure\nherself that there was nobody within hearing, and then looking down upon the\nfloor. ‘I am very much afraid, sir, that his conscience is troubled by…"
}