{
  "author": "kazamasta31",
  "the_new_excerpt": "I started trading stocks last year when corona happened just like other people\ndid. I'm a university student who got laid off due to the pandemic and have yet\nto find a job since. When meme stocks blew up (BB, AMC, NOK, and GME or BANG) I\njumped on the bandwagon thinking it's a fast way to make…",
  "original_created_utc": 1612476718,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我去年开始交易股票，当电晕发生时，就像其他人一样。\n了。我是一名大学生，因为流行病而下岗，还没有。\n来找工作，因为。当meme股票炸了（BB，AMC，NOK，和GME或BANG），我\n跳上了这个行列，认为这是一个快速的方式，使... ...",
      "title": "GME和meme股票昂贵的教训。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我去年開始交易股票，當電暈發生時，就像其他人一樣。\n了。我是一名大學生，因爲流行病而下崗，還沒有。\n來找工作，因爲。當meme股票炸了（BB，AMC，NOK，和GME或BANG），我\n跳上了這個行列，認爲這是一個快速的方式，使... ...",
      "title": "GME和meme股票昂貴的教訓。"
    }
  ],
  "title": "GME and meme stock an expensive lesson to learn.",
  "created_utc": 1612486011,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I started trading stocks last year when corona happened just like other people did. I&#39;m a university student who got laid off due to the pandemic and have yet to find a job since. When meme stocks blew up (BB, AMC, NOK, and GME or BANG) I jumped on the bandwagon thinking it&#39;s a fast way to make gains overnight instead of waiting for a company to grow organically. I spent 80% of what I have to my name and bought out shares of BANG, unfortunately, I have now lost 75% of my initial investment. Really expensive lesson but now I&#39;ve learned and will grow from this and come back stronger. Luckily, I made a deal with my mom when I started university so I don&#39;t have any bills to pay other than phone bill, gym membership, netflix, spotify etc. Just the basic stuff so I can still live off of what I left myself with for at least a few months. I&#39;m also in the last semester for a Computer Information System degree so I&#39;m hoping that I can get a job and get back what I lost. I will be holding my meme stocks until I die as a reminder of my very expensive mistake. If they go up great, if not it&#39;s no big deal as I have come to finally accept that I lost. Just something I wanna get out of my chest to be at peace with myself.</p>\n</div><!-- SC_ON -->",
  "score": 915,
  "permalink": "/r/investing/comments/lcroz5/gme_and_meme_stock_an_expensive_lesson_to_learn/",
  "subreddit": "investing",
  "id": "lcroz5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198804
}