{
  "author": "fishMaster63",
  "original_created_utc": 1644242535,
  "title": "Does not wanting to have anything to do with LGBT makes you a homophobe in any way?",
  "created_utc": 1644254405,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was talking yesterday with a friend of mine, she recently discovered that she&amp;#39;s bisexual and is an active member of the lgbt community. We started talking about our common friends that currently live in our home town because of covid when she told me that she stopped talking to one of our friends and she generally dislikes him.&lt;/p&gt;\n\n&lt;p&gt;As it just happens I had a small beef with the guy a week ago and I was more than ready to gossip with her, when she told me something that left me kinda perplexed.&lt;/p&gt;\n\n&lt;p&gt;The reason she&amp;#39;s mad at him is because a couple of months ago there was the pride parade in our town. She and her bf were going and she asked the friend if he wants to come with them. His reply was that he doesn&amp;#39;t want to associate himself with the movement (as in the parade itself). And that&amp;#39;s why she&amp;#39;s been mad for a couple of months on someone that we&amp;#39;ve been hanging out with since almost childhood.&lt;/p&gt;\n\n&lt;p&gt;Apparently the way she sees it is: if he doesn&amp;#39;t want to associate himself with the parade and lgbt it automatically means that he won&amp;#39;t associate himself with her, so in case she ever gets together with another female he won&amp;#39;t give them his full support (i don&amp;#39;t really know what this means tho). I didn&amp;#39;t really know how to respond as to not offend her, since I share the same feelings with the guy in question.&lt;/p&gt;\n\n&lt;p&gt;Any opinions? Is this what makes a transphobe? I want to make clear that he is not against homosexuals or anything like that, he just probably didn&amp;#39;t want to go to the parade and most likely would not give a shit if our bi friend would get with a girl. Is one sentence enough to brand you as a transphobe?&lt;/p&gt;\n\n&lt;p&gt;Edit: sorry for the title, translated in my native language it sounds different. He doesn&amp;#39;t want anything to do with the parade itself and probably the movement, but he is not against people, or how they express their sexuality&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 117,
  "permalink": "/r/TooAfraidToAsk/comments/smqym8/does_not_wanting_to_have_anything_to_do_with_lgbt/",
  "subreddit": "TooAfraidToAsk",
  "id": "smqym8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was talking yesterday with a friend of mine, she recently discovered that\nshe's bisexual and is an active member of the lgbt community. We started talking\nabout our common friends that currently live in our home town because of covid\nwhen she told me that she stopped talking to one of our friends…"
}