{
  "author": "cdoghusk1",
  "original_created_utc": 1625622820,
  "title": "Just started watching \"Downton Abbey.\" Can someone explain to me what these people did?",
  "created_utc": 1625652219,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>American here. I am eight episodes in and enjoying it, but I&#39;ll be danged if I can say exactly what these people DO, or how they maintain an estate that huge.</p>\n\n<p>The servants work to make money. Farmers farm. Royalty...does royalty things, generally rules. I understand all of that, at least enough so that I can grasp what&#39;s happening in other shows. But I don&#39;t get what the Crawleys, and their class of people, actually DID. They had money, but from what? And what for?</p>\n\n<p>In the series, you sometimes hear them saying things like, &quot;We all have our part to play.&quot; But what part did families like this actually play? They seem to just sit around all day and worry about the house, their name, their legacy, but I don&#39;t see them going to important business meetings or anything like that.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/AskHistorians/comments/of98iv/just_started_watching_downton_abbey_can_someone/",
  "subreddit": "AskHistorians",
  "id": "of98iv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "American here. I am eight episodes in and enjoying it, but I'll be danged if I\ncan say exactly what these people DO, or how they maintain an estate that huge.\n\nThe servants work to make money. Farmers farm. Royalty...does royalty things,\ngenerally rules. I understand all of that, at least enough so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカ人です。私は8話まで見ましたが、とても楽しめました。\nこの人たちが何をしているのか、どうやってあんなに巨大な財産を維持しているのか、正確に言えるかどうか。\n\n召使はお金を稼ぐために働きます。農家は農業をする。王族は...王族のことをする。\n一般的なルールを守る。私はそのすべてを、少なくとも十分に理解しています...",
      "title": "\"ダウントン・アビー \"を見始めたところです。誰かこの人たちが何をしたのか説明してくれませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是美国人。我已经看了八集，很喜欢，但如果我能够准确地说出这些人在做什么，或者他们是如何维持那么大的财产的，那我就太糟糕了。\n能说清楚这些人到底在做什么，或者他们是如何维持那么大的一个庄园的。\n\n仆人们工作挣钱。农民耕种。皇室成员......做皇室成员的事情。\n总的来说，就是统治。我了解所有这些，至少足够如此......",
      "title": "刚开始看 \"唐顿庄园\"。谁能向我解释一下这些人做了什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是美國人。我已經看了八集，很喜歡，但如果我能夠準確地說出這些人在做什麼，或者他們是如何維持那麼大的財產的，那我就太糟糕了。\n能說清楚這些人到底在做什麼，或者他們是如何維持那麼大的一個莊園的。\n\n僕人們工作掙錢。農民耕種。皇室成員......做皇室成員的事情。\n總的來說，就是統治。我瞭解所有這些，至少足夠如此......",
      "title": "剛開始看 \"唐頓莊園\"。誰能向我解釋一下這些人做了什麼？"
    }
  ]
}