{
  "author": "peekkk",
  "original_created_utc": 1635895672,
  "title": "I spent nearly a year trying to make documents suck less!",
  "created_utc": 1635915273,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi <a href=\"/r/SideProject\">/r/SideProject</a> </p>\n\n<p><strong>TL;DR — Updating reports and other data-heavy documents manually sucks, and costs a lot of time/money. I built</strong> <a href=\"https://Livedocs.com\"><strong>Livedocs.com</strong></a> <strong>to try and solve that problem.</strong>  </p>\n\n<h1>Backstory — </h1>\n\n<p>A year and a half ago, I was a product owner at a tech co, and I realized I was spending a huge amount of time simply doing document-drudgery. I would update reports and documents for meetings, then more documents for reports that would go out directly to clients (complete with a phone call to walk them through what those numbers mean). </p>\n\n<p>That&#39;s when I realized, looking back at my career, from small team projects to Fortune 500s, documents were the backbone of every team I was on. At some point, each of those teams build documents that needed constant updating (PNL statements, sales reports, cross-channel marketing reports, etc)  Oddly, teams still lose many hours a day “updating” documents (copy-paste new numbers, screenshots from dashboards, etc). </p>\n\n<p>Once I saw this anti-pattern, I quit my job set out to solve this problem. After months of gathering feedback, testing, building and fine-tuning — I built <a href=\"https://livedocs.com\">livedocs.com</a></p>\n\n<p><strong>Livedocs helps you bring live data from your existing tools into beautiful, customizable documents in just a few clicks. My goal is to enable your team to make data-driven decisions quickly, with zero learning curve.</strong> </p>\n\n<h1>What can I do with livedocs?:</h1>\n\n<p>Here’s some interesting ways I&#39;ve seen Livedocs being used </p>\n\n<ol>\n<li><strong>Founders</strong>: Solopreneurs, startups, small businesses. Keep track of your teams’ vitals. Livedocs is the fastest way to track revenue, churn, developer productivity, web traffic, conversion, or whatever is most important to your business. Bring in data from Stripe, Google Analytics, Mailchimp, and more. Easy to set up, even easier to share with your team!</li>\n<li><strong>Social media managers:</strong> Build cross-channel reports with data from Twitter, Instagram, Google Analytics, etc. Spend less time visualizing numbers and fighting with spreadsheets, and more time growing brands. Use for in-house social media management or client servicing as an agency</li>\n<li><strong>Marketers and sales operators</strong>: Ads &amp; Performance marketing, financial numbers, and more. Building reports with engagement and web traffic data is literally a 3-click process with Livedocs.</li>\n</ol>\n\n<p>It&#39;s still pretty buggy and would really appreciate if you took it for a spin (start a doc from scratch or check out the small but growing list of <a href=\"https://livedocs.com/templates\">templates you can clone</a>) and offered some feedback. It&#39;s a free, 14-day trial, and I&#39;m happy to offer extended trials and discounts if it sounds like something you see yourself using. </p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/qlh7xf/i_spent_nearly_a_year_trying_to_make_documents/",
  "subreddit": "SideProject",
  "id": "qlh7xf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi /r/SideProject\n\nTL;DR — Updating reports and other data-heavy documents manually sucks, and\ncosts a lot of time/money. I built Livedocs.com [https://Livedocs.com] to try\nand solve that problem.\n\n\nBACKSTORY — \n\nA year and a half ago, I was a product owner at a tech co, and I realized I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは /r/SideProject\n\nTL;DR - レポートやその他のデータの多いドキュメントを手動で更新するのは、時間とお金がかかります。\n多くの時間とお金がかかっています。私はこの問題を解決するためにLivedocs.com [https://Livedocs.com]を作りました。\nこの問題を解決するためにLivedocs.comを作りました。\n\n\nバックストーリー \n\n1年半前、私は技術系の会社でプロダクト・オーナーをしていましたが、ある時、自分が...",
      "title": "私は1年近くかけて、ドキュメントの吸い込みを少なくするために努力しました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨 /r/SideProject\n\nTL;DR - 手动更新报告和其他数据量大的文件很糟，而且\n花费大量的时间/金钱。我建立了Livedocs.com[https://Livedocs.com]来尝试\n和解决这个问题。\n\n\n背景 - \n\n一年半前，我是一家科技公司的产品负责人，我意识到我...",
      "title": "我花了将近一年的时间，试图让文件不那么糟糕！这就是我的工作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨 /r/SideProject\n\nTL;DR - 手動更新報告和其他數據量大的文件很糟，而且\n花費大量的時間/金錢。我建立了Livedocs.com[https://Livedocs.com]來嘗試\n和解決這個問題。\n\n\n背景 - \n\n一年半前，我是一家科技公司的產品負責人，我意識到我...",
      "title": "我花了將近一年的時間，試圖讓文件不那麼糟糕！這就是我的工作。"
    }
  ]
}