{
  "author": "Wutduhshit",
  "original_created_utc": 1630417558,
  "title": "Why aren't people with alopecia universalis deaf?",
  "created_utc": 1630434393,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I know basic information about alopecia and being deaf so maybe my question is bizarre. I always thought that humans ability to hear came from little hairs inside your ear that vibrated.. then blah blah your brain does magic and you can hear. </p>\n\n<p>At the same time I thought people with alopecia universalis have completely lost the ability to grow hair.  </p>\n\n<p>I think you can see where I&#39;m going with this.  If you can&#39;t grow hair in your ears for sound to vibrate. How do people with alopecia hear?</p>\n</div><!-- SC_ON -->",
  "score": 114,
  "permalink": "/r/askscience/comments/pf66e8/why_arent_people_with_alopecia_universalis_deaf/",
  "subreddit": "askscience",
  "id": "pf66e8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I know basic information about alopecia and being deaf so maybe my question\nis bizarre. I always thought that humans ability to hear came from little hairs\ninside your ear that vibrated.. then blah blah your brain does magic and you can\nhear.\n\nAt the same time I thought people with alopecia…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ですから、脱毛症や耳が聞こえないことについての基本的な情報は知っているので、私の質問は奇抜なものかもしれません。\n奇抜な質問かもしれません。私はずっと、人間の聴覚能力は耳の中の小さな毛が振動することで得られると思っていました。\n耳の中の小さな毛が振動して、脳が魔法をかけて、聞こえるようになるんだと思っていました。\n聞こえます。\n\nそれと同時に、脱毛症の人は...",
      "title": "万能脱毛症の人はなぜ耳が聞こえないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我知道关于脱发症和耳聋的基本信息，所以我的问题可能\n是很奇怪的。我一直认为人类的听觉能力来自于你耳朵里的小毛发。\n耳朵里的小毛发振动......然后胡说八道，你的大脑施展魔法，你就可以\n听力。\n\n同时，我认为患有脱发症的人...",
      "title": "为什么普遍性脱发症患者不失聪？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我知道關於脫髮症和耳聾的基本信息，所以我的問題可能\n是很奇怪的。我一直認爲人類的聽覺能力來自於你耳朵裏的小毛髮。\n耳朵裏的小毛髮振動......然後胡說八道，你的大腦施展魔法，你就可以\n聽力。\n\n同時，我認爲患有脫髮症的人...",
      "title": "爲什麼普遍性脫髮症患者不失聰？"
    }
  ]
}