{
  "author": "Qtredit",
  "original_created_utc": 1636025648,
  "title": "What are things you don't understand about crypto but too afraid to ask?",
  "created_utc": 1636043896,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Not every answer can be easily found by Googling.</p>\n\n<p>Some questions are about a deeper level of understanding.</p>\n\n<p>For example, I&#39;m not 100% sure how do blockchain updates work.\nFor example, if my ETH is in a cold wallet with no internet connection, how will it get the update? </p>\n\n<p>Or do only the nodes need to get the updates?</p>\n\n<p>Now I understand this could be a stupid question coming from a lack knowledge, but I really want to understand the technology more.</p>\n\n<p><strong>What are things you want to know but \n too afraid to ask about crypto?</strong></p>\n</div><!-- SC_ON -->",
  "score": 471,
  "permalink": "/r/CryptoCurrency/comments/qmil4p/what_are_things_you_dont_understand_about_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qmil4p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Not every answer can be easily found by Googling.\n\nSome questions are about a deeper level of understanding.\n\nFor example, I'm not 100% sure how do blockchain updates work. For example, if\nmy ETH is in a cold wallet with no internet connection, how will it get the\nupdate?\n\nOr do only the nodes need…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "すべての答えが、グーグルで簡単に見つかるわけではありません。\n\n質問の中には、より深いレベルでの理解が必要なものもあります。\n\n例えば、ブロックチェーンのアップデートがどのように機能するのか、100％はわかりません。例えば、もし\n私のETHがインターネットに接続されていないコールドウォレットにある場合、どのようにして更新を受け取るのでしょうか？\n更新されますか？\n\nそれとも、ノードだけが必要とするのでしょうか...",
      "title": "暗号についてわからないことがあっても、怖くて聞けないことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "并非每一个答案都可以通过谷歌搜索轻易找到。\n\n有些问题是关于更深层次的理解。\n\n例如，我不是100%确定区块链更新是如何工作的。比如说，如果\n我的ETH在一个没有网络连接的冷钱包里，它将如何获得\n更新？\n\n还是只有节点需要...",
      "title": "你对加密货币有哪些不了解但又不敢问的事情？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "並非每一個答案都可以通過谷歌搜索輕易找到。\n\n有些問題是關於更深層次的理解。\n\n例如，我不是100%確定區塊鏈更新是如何工作的。比如說，如果\n我的ETH在一個沒有網絡連接的冷錢包裏，它將如何獲得\n更新？\n\n還是隻有節點需要...",
      "title": "你對加密貨幣有哪些不瞭解但又不敢問的事情？"
    }
  ]
}