{
  "author": "M13Calvin",
  "original_created_utc": 1626465157,
  "title": "Just bought a vehicle with BTC",
  "created_utc": 1626510929,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Actually, the seller wanted half cash, half BTC. Guess which half was more of a pain for me? The BTC was quick and easy, cost me about $5 in fees since I wanted to send it fast. One test transaction and then the whole amount, done in 1 block confirmation.</p>\n\n<p>The cash... I had to transfer money via ACH (2-3 days) and then call my (no branches) bank to raise my debit cash advance limit. Then I had to drive to a bank and wait in line, then carry an uncomfortably large amount of cash around until I could pay the seller.</p>\n\n<p>If it had been up to me, I would have paid the whole amount in BTC. It also helped that the price has been somewhat stable over the last few days.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/Bitcoin/comments/olom36/just_bought_a_vehicle_with_btc/",
  "subreddit": "Bitcoin",
  "id": "olom36",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Actually, the seller wanted half cash, half BTC. Guess which half was more of a\npain for me? The BTC was quick and easy, cost me about $5 in fees since I wanted\nto send it fast. One test transaction and then the whole amount, done in 1 block\nconfirmation.\n\nThe cash... I had to transfer money via ACH…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "実際、売り手は半分の現金と半分のBTCを欲しがっていました。どっちの方が面倒だったかというと\n私にとってはどちらが苦痛だったと思いますか？BTCは迅速かつ簡単で、早く送りたかったので手数料は5ドルほどでした。\n速く送りたかったので、手数料は5ドルほどでした。試しに1回取引した後、全額を1ブロックで取引しました。\n確認。\n\n現金は... ACHで送金しなければなりませんでした...。",
      "title": "BTCで車を購入しました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "实际上，卖家想要一半现金，一半BTC。猜猜看哪一半对我来说更麻烦？\n对我来说更痛苦？BTC是快速和简单的，花了我大约5美元的费用，因为我想要\n迅速发送。一笔测试交易，然后是全部金额，在一个区块内完成。\n确认。\n\n现金... 我不得不通过ACH转账...",
      "title": "刚刚用BTC买了一辆车"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "實際上，賣家想要一半現金，一半BTC。猜猜看哪一半對我來說更麻煩？\n對我來說更痛苦？BTC是快速和簡單的，花了我大約5美元的費用，因爲我想要\n迅速發送。一筆測試交易，然後是全部金額，在一個區塊內完成。\n確認。\n\n現金... 我不得不通過ACH轉賬...",
      "title": "剛剛用BTC買了一輛車"
    }
  ]
}