{
  "author": "BobbyBleustone",
  "original_created_utc": 1637420088,
  "title": "And the vote for the most delusional crypto community goes to?",
  "created_utc": 1637443841,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve all seen them. A community for a coin that has a cult like following for a project  that is just, not going anywhere.</p>\n\n<p>Either it suffered a rugpull, or has no utility, or the larger crypto space just doesn’t care about it anymore, this community just won’t give up on it.</p>\n\n<p>More than that, their extremely bullish for the future, with no logical reason that’s grounded in reality. </p>\n\n<p>Does a name pop into your head?</p>\n\n<p>Does this sound like any community you know? </p>\n\n<p>Which community gets your vote for their foolish but unwavering faith?</p>\n\n<p>My vote, very honestly, has to go to the folks at Bitcoin Cash, who are still excited about a project that no one else seems to be at all. They forked and have never returned to their all time high. It just seems like their legacy keeps them even slightly relevant, but they are still sure that they’re going to change the world.</p>\n\n<p>Edit: Y’all need to give explanations. I need reasons!</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/qy76pr/and_the_vote_for_the_most_delusional_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "qy76pr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’ve all seen them. A community for a coin that has a cult like following for a\nproject that is just, not going anywhere.\n\nEither it suffered a rugpull, or has no utility, or the larger crypto space just\ndoesn’t care about it anymore, this community just won’t give up on it.\n\nMore than that, their…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰もが見たことがあるはずです。カルト的な人気を誇るコインのコミュニティが、あるプロジェクトのために\nどこにも行かないプロジェクト。\n\n淘汰されてしまったのか、実用性がないのか、はたまた大きな暗号空間が\nこのコミュニティはそれを諦めません。\n\nそれ以上に、彼らの...",
      "title": "そして、最も妄想的な暗号コミュニティに選ばれたのは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们都见过它们。一个硬币的社区，对一个项目有着崇拜般的追随。\n项目，但却没有任何进展。\n\n要么它遭遇了一场大地震，要么没有实用性，要么更大的加密货币空间只是\n越来越不关心它了，这个社区就是不放弃它。\n\n不仅如此，他们的...",
      "title": "最具妄想性的加密货币社区的选票是？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們都見過它們。一個硬幣的社區，對一個項目有着崇拜般的追隨。\n項目，但卻沒有任何進展。\n\n要麼它遭遇了一場大地震，要麼沒有實用性，要麼更大的加密貨幣空間只是\n越來越不關心它了，這個社區就是不放棄它。\n\n不僅如此，他們的...",
      "title": "最具妄想性的加密貨幣社區的選票是？"
    }
  ]
}