{
  "author": "admiral_asswank",
  "the_new_excerpt": "Edit 3: ZJZ reply is at the top of the thread. Please, be kind. I tried to\nsummarise the feelings of users in this post, so we don't need to continue\ngriefing the mod team... You could say... I LIKE the mod team.\n\nWhy did we not get transparency about how gæmstonk megathreads were going to…",
  "original_created_utc": 1614760081,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "编辑3：ZJZ的回复在最前面。请大家多多包涵。我试图\n总结一下网友在本帖中的感受，我们就不用再继续了\n哀伤的MOD团队... 你可以说... 我喜欢版主团队。\n\n为什么我们没有得到透明度关于如何gæmstonk巨型线程要... ...",
      "title": "有些事情是不对的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯3：ZJZ的回覆在最前面。請大家多多包涵。我試圖\n總結一下網友在本帖中的感受，我們就不用再繼續了\n哀傷的MOD團隊... 你可以說... 我喜歡版主團隊。\n\n爲什麼我們沒有得到透明度關於如何gæmstonk巨型線程要... ...",
      "title": "有些事情是不對的。"
    }
  ],
  "title": "Something isn't right.",
  "created_utc": 1614788840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Edit 3: <em>ZJZ reply is at the top of the thread. Please, be kind. I tried to summarise the feelings of users in this post, so we don&#39;t need to continue griefing the mod team... You could say... I LIKE the mod team.</em></p>\n\n<p>Why did we not get transparency about how gæmstonk megathreads were going to be handled, ahead of time?</p>\n\n<p>First, the thread wasn&#39;t made.</p>\n\n<p>Then the threads made by users were being manually deleted.</p>\n\n<p>Then we got a comment stickied to the top of the daily thread saying words to the effect of &quot;no more gæmstonk daily threads, more news later.&quot;</p>\n\n<p>That comment got deleted.</p>\n\n<p>Then we&#39;re told &quot;it&#39;s because interest in gæmstonk has died down&quot; (???????? Do you people LOOK at your own subreddit?)</p>\n\n<p>Then RKT gets a sticky. It gets MASS brigaded by the rightly fucked off gæmstonk pushers.</p>\n\n<p>Then we get told that the mods simply &quot;forgot&quot; to make the gæmstonk thread.</p>\n\n<p>Then finally, it was because Opinion forgot to set an alarm.</p>\n\n<p>...</p>\n\n<p>What. The. Fuck. Is. Going. On?</p>\n\n<p>You don&#39;t want people to believe in conspiracies? Act homogeneously and transparently.</p>\n\n<p>I haven&#39;t seen ANY good DD on gæmstonk for DAYS even though there is TONS of important movement going on with it. Somehow RKT is the ONLY majorly mentioned DD ticker on Monday? Somehow <em>that alone justifies a sticky?</em></p>\n\n<p>That precedent is extremely dangerous. I hope you have highly competent tools that protect against vote manipulation and spam... because if all it takes is a single highly rated post and ticker the day before to earn a sticky the following day... you leave the entire subreddit vulnerable.</p>\n\n<p>As a side note... Everyone believes 3/19 is the MOASS date... BUT OPEN INTEREST IN gæmstonk IS HIGHER THIS FRIDAY. THIS. FRIDAY.</p>\n\n<p>I am extremely bullish on GME and in my opinion this is the second best time to buy. It can&#39;t only go up. But if momentum is there... it can. I doubt MM&#39;s have delta&#39;d for 200. 250. 300. 350... for this Friday, because right now it&#39;s limping at 115. And there are 24,000 calls at 800 for Friday. That is just ASTRONOMICAL.</p>\n\n<p>Movement is best THIS WEEK.</p>\n\n<p>Nobody knows it... because all the front page gæmstonk text posts are just straight dumpster garbage. Zero information. All fluff. And people wonder why they think it&#39;s a dead play, a dumb play. </p>\n\n<p>I don&#39;t want to believe asinine theories like top-down manipulation. So some clarity on this is going to deeply alleviate that poisonous sentiment.</p>\n\n<p>Edit: there is a mod reply, please don&#39;t downvote it.</p>\n\n<p>Edit 2: this is a really good time to remind retail that... we are a significant force. Decoherent, stupid, self destructive... but sometimes even a room full of monkeys all throw their shit in the same direction. So just be more conscious of what that direction is.</p>\n\n<p>Edit 4: I censored the ticker to avoid spam from bots. Guess it worked. Had hardly any (like one?) Emoji/stupid comment.</p>\n</div><!-- SC_ON -->",
  "score": 4621,
  "permalink": "/r/wallstreetbets/comments/lwoys5/something_isnt_right/",
  "subreddit": "wallstreetbets",
  "id": "lwoys5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937759867
}