{
  "author": "hyperfish3d",
  "the_new_excerpt": "Hello,\n\nbefore I looked into this, I always thought that it was certain that Hitler's\nbody was burned immediately after his suicide. I had assumed that there were no\nphotos or even video footage of Hitler's dead body.\n\nI recently watched Tarkovsky's The Mirror (found on Youtube). At 1:03:31 you…",
  "original_created_utc": 1619869422,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n調べる前は、ヒトラーの遺体が自殺直後に焼かれたのは確かだと思っていました。\n自殺後すぐに焼かれたのは間違いないと思っていました。ヒトラーの死体の写真や映像はないものと思っていました。\nと思っていました。\n\n最近、タルコフスキーの「鏡」を見ました（Youtubeで見つけました）。1:03:31にあなた...",
      "title": "ヒトラーの遺体の映像 - 混乱しています。(NSFW)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n在我研究这个问题之前，我一直认为可以肯定的是，希特勒的\n尸体在他自杀后立即被烧毁。我曾认为，没有\n照片，甚至是希特勒尸体的录像。\n\n我最近看了塔尔科夫斯基的《镜子》（在Youtube上找到）。在1:03:31，你...",
      "title": "希特勒尸体的录像--我很疑惑。(NSFW)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n在我研究這個問題之前，我一直認爲可以肯定的是，希特勒的\n屍體在他自殺後立即被燒燬。我曾認爲，沒有\n照片，甚至是希特勒屍體的錄像。\n\n我最近看了塔爾科夫斯基的《鏡子》（在Youtube上找到）。在1:03:31，你...",
      "title": "希特勒屍體的錄像--我很疑惑。(NSFW)"
    }
  ],
  "title": "Footage of Hitler's dead body - I'm confused. (NSFW)",
  "created_utc": 1619890446,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello,</p>\n\n<p>before I looked into this, I always thought that it was certain that Hitler&#39;s body was burned immediately after his suicide. I had assumed that there were no photos or even video footage of Hitler&#39;s dead body.</p>\n\n<p>I recently watched Tarkovsky&#39;s The Mirror (found on Youtube). At 1:03:31 you can see (supposed?) video footage of Hitler&#39;s dead body. I then did some research to find out where these recordings came from or if it is already known that they were staged. Unfortunately, so far I have only found a few articles (some of them questionable) that refer to the footage, such as <a href=\"https://www.independent.co.uk/news/world/europe/film-of-hitler-s-body-shown-in-russian-tv-programme-1551802.html\">this</a> one. The article claims the footage was later published by the KGB and also shown on Russian TV.</p>\n\n<p>(Also Bezemensky&#39;s autopsy report confirms that the body was found in an unburned state. I looked at the report and found no photos or video evidence there either. Moreover, the report was later strongly criticized and acknowledged to be false).</p>\n\n<p>Now I still wonder, where did this video footage come from, and was it ever proven to be fake?</p>\n\n<p>Thanks for any further information!</p>\n\n<p>Edit: I also found the footage somewhere else on youtube, where they say the corpse might be from a doppelgänger. Does anyone have a citeable/credible source for that?</p>\n\n<p>Translated with deepl</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/AskHistorians/comments/n2gqes/footage_of_hitlers_dead_body_im_confused_nsfw/",
  "subreddit": "AskHistorians",
  "id": "n2gqes",
  "is_self": true,
  "media": null,
  "is_video": false
}