{
  "author": "Magelis86",
  "the_new_excerpt": "The ultimate cold storage [https://imgur.com/gallery/5pVB72j]\n\nDNA is used since 4 billion years to encode information. It is the only thing\nthat will never become obsolete. Like Bill gates once said: ‘DNA is like a\ncomputer program but far, far more advanced than any software ever created'.\n\nSo,…",
  "original_created_utc": 1613432238,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "终极冷库[https://imgur.com/gallery/5pVB72j]\n\nDNA在40亿年前就被用来编码信息。它是唯一\n永远不会过时的。就像比尔-盖茨曾经说过的那样：\"DNA就像一个。\n计算机程序，但比任何软件都要先进得多'。\n\n所以，...",
      "title": "终极冷藏：我将我的钥匙加密在DNA中，并将其存放在-195°C / -319F的环境中。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "終極冷庫[https://imgur.com/gallery/5pVB72j]\n\nDNA在40億年前就被用來編碼信息。它是唯一\n永遠不會過時的。就像比爾-蓋茨曾經說過的那樣：\"DNA就像一個。\n計算機程序，但比任何軟件都要先進得多'。\n\n所以，...",
      "title": "終極冷藏：我將我的鑰匙加密在DNA中，並將其存放在-195°C / -319F的環境中。"
    }
  ],
  "title": "The ultimate cold storage : I encrypted my keys in DNA and stored them at -195°C / -319F",
  "created_utc": 1613464916,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://imgur.com/gallery/5pVB72j\"><strong>The ultimate cold storage</strong></a></p>\n\n<p>DNA is used since 4 billion years to encode information. It is the only thing that will never become obsolete. Like Bill gates once said: ‘DNA is like a computer program but far, far more advanced than any software ever created&#39;.</p>\n\n<p>So, how is it possible to encode a crypto private key using DNA? I will offer in this post a quick overview on how I successfully encoded and stored my crypto keys using DNA.</p>\n\n<p>Let’s start with the basics: the standard (also called Roman) alphabet is a standardized set of basic 26 written symbols (called graphemes) that can be combined to create words. Hence, combining those symbols into organized sequences of words (sentences) allow humans to materialize/deliver information (like the paragraph that I just wrote, entire books or even your private key).</p>\n\n<p>DNA language is much easier than roman alphabet: it is only made up of four letters: A, T, C and G (abbreviations for the 4 molecules (called nucleotides) that make up the rungs of the DNA ladder). Like the concept of words and sentences that I previously introduced, it is the combination of nucleotides into particular sequences that allows to encode a particular genetic information.</p>\n\n<p>Then, how do you encode complex sequences with only 4 letters?</p>\n\n<p>Each group of 3 nucleotides (called codon) encodes one amino acid. <a href=\"https://imgur.com/gallery/5Z0SSzJ\">There are (so far) 20 amino acids</a>, each of them (as you can see on the list) identified by a full name and a unique letter abbreviation. For instance, when sorted by alphabetic order, the first amino acid in the list is Alanine, abbreviated ‘A’, the second is Cysteine abbreviated ‘C’ etc. till Tryptophan (W) and Tyrosine (Y). Thus, the amino acid list offers a set of 20 letters which, at the end, is pretty similar to the Roman alphabet.</p>\n\n<p>Thereby, with only four starting letters (nucleotides) that can be organized in particular codons, it is possible to encode a virtually endless string with, at each position, 1 of the 20 amino acid. Like letters and words, it is possible to use DNA codons to make sentences. <a href=\"https://imgur.com/gallery/47OPKfl\">Here is a simple one ;)</a></p>\n\n<p>Once you understand that, you realize that it is virtually possible to encode anything using DNA.</p>\n\n<p>And this is what I did for some of my private keys. I know that for the public, manipulation of the DNA sounds like complex science fiction, but for most of the molecular biologists, converting a data file into DNA is a surprisingly simple, cheap and easy process. Synthetizing a particular sequence takes between 5 minutes and 3 hours and roughly costs up to $5 while decrypting it (using sequencing) is as fast and cheap. The DNA can then be stored in a cold environment ranging from a simple fridge (4°C / 40F) to a liquid nitrogen tank (-195°C / -319F).</p>\n\n<p>Beyond the simple encryption of my keys, hundred of proof of concept implying DNA storage are published every year. Among the most interesting: some researcher 3D-printed a bunny which contains its blueprint in the plastic filament used for printing. By clipping off a tiny bit of the ear of the bunny, scientists were able to read out the blueprint, multiply it and produce a next generation of bunnies. Additionally, In June 2019, scientists reported that all 16 GB of text from Wikipedia&#39;s English-language version have been encoded into synthetic DNA.</p>\n\n<p>These concepts led to the emergence of a revolutionary and completely new type of industry called DNA digital data storage. Some experts even think that after entering the IoT (internet of things) age, humankind could move towards the ‘DNA of things’ era.</p>\n\n<p>We are not there yet, but it is a very interesting emerging industry. And for those wondering : for security reasons, nothing prevents me from changing the correspondance between codons and amino acids to generate a new genetic code that I&#39;m the only one able to decrypt. And, as you can see, there is also redundancy in the list (several codons code for the same amino acid) thus allowing me to even add characters (for instance the 6 letters missing in the original genetic code).</p>\n\n<p>Thanks for reading.</p>\n\n<p>TL;DR :  &#39;Yeah so I used the building blocks of life itself to store the password to my internet magic money&#39; (©Villeto)</p>\n\n<p>Wild times</p>\n</div><!-- SC_ON -->",
  "score": 335,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?auto=webp&s=2baa69210c5e5815bbe88739bb90487ac62645e8",
          "width": 3024,
          "height": 4032
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?width=108&crop=smart&auto=webp&s=5e31d236b48e1a22fb2023d4c1e8a86cf9a60d8b",
            "width": 108,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?width=216&crop=smart&auto=webp&s=8ae0c1e40a00755231f4116ad87beea9eb15a57d",
            "width": 216,
            "height": 288
          },
          {
            "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?width=320&crop=smart&auto=webp&s=eae3b2396da7e2d9a7e6f41c471ebfb5e4496c7f",
            "width": 320,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?width=640&crop=smart&auto=webp&s=8b86b9d25ba4d563d77fcae2256f69b875c09f80",
            "width": 640,
            "height": 853
          },
          {
            "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?width=960&crop=smart&auto=webp&s=c53f3571c87b19568a8bbef4eea333218bcb0c11",
            "width": 960,
            "height": 1280
          },
          {
            "url": "https://external-preview.redd.it/kvvLXuZsQOXS_ITv0CjT5qx7pakLBsk0YWq1g-N87_w.jpg?width=1080&crop=smart&auto=webp&s=847aa19fa359c52b09bee832e945f207561cb37a",
            "width": 1080,
            "height": 1440
          }
        ],
        "variants": {},
        "id": "Ke7_tf71kLH3H6kEloS02td_iTwkUZY2zcFXGGIFPtk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/lkqcjh/the_ultimate_cold_storage_i_encrypted_my_keys_in/",
  "subreddit": "CryptoCurrency",
  "id": "lkqcjh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619120
}