{
  "author": "FIRE_and_forget_it",
  "the_new_excerpt": "Since we are in a bull run (the big one?) I thought I might share some\nreflections. I’m seeing a lot of newcomers (welcome!) as well as some sophomore\ntypes with questions, ideas, admonitions, and the like. Pull up a chair, I've\nbeen around these parts for a while. And if anyone starts in with the…",
  "original_created_utc": 1610263460,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "既然我们正处于牛市(大牛市？)我想我可以分享一些\n反射。我看到很多新来者(欢迎！)还有一些大二的学生\n用问题、想法、告诫等打字。拉把椅子来，我已经\n在这一带待了一段时间了。如果有人开始使用…",
      "title": "2017年，我以150万美元的价格出售了100个BTC(和BCH)-一些想法"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "既然我們正處於牛市(大牛市？)我想我可以分享一些\n反射。我看到很多新來者(歡迎！)還有一些大二的學生\n用問題、想法、告誡等打字。拉把椅子來，我已經\n在這一帶待了一段時間了。如果有人開始使用…",
      "title": "2017年，我以150萬美元的價格出售了100個BTC(和BCH)-一些想法"
    }
  ],
  "title": "In 2017 I sold 100 BTC (and BCH) for 1.5M dollars USD – Some thoughts",
  "created_utc": 1610273030,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Since we are in a bull run (the big one?) I thought I might share some reflections. I’m seeing a lot of newcomers (welcome!) as well as some sophomore types with questions, ideas, admonitions, and the like. Pull up a chair, I&#39;ve been around these parts for a while. And if anyone starts in with the &quot;but yr account is only 2 years old&quot; bullshit... come on, use your head.</p>\n\n<p>First off, as Ecclesiastes 1:9 states:</p>\n\n<blockquote>\n<p>What has been will be again,</p>\n\n<p>what has been done will be done again;</p>\n\n<p>there is nothing new under the sun.</p>\n</blockquote>\n\n<p>Over the last 7 years I have seen all these questions about what to do, these statements of selling, and others commenting how stupid and ignorant anyone who sells “right now” must be. People have called me a fucking moron for daring to part with some of my bitcoin, or argued with me that I don’t understand what I did. They are sad people (jealous? myopic? entitled? I still don’t know what they are trying to prove.) </p>\n\n<p>Secondly: I’m certain a number of you will not believe my story. That is your right. I will not provide tx-id’s or any other form of proof. I just ask that you look at my post history and ponder – either this guy made up a story several years ago and stuck to it, posting every so often between <a href=\"/r/bitcoin\">/r/bitcoin</a> and <a href=\"/r/financialindependence\">/r/financialindependence</a> for magic internet points or maybe he is telling the truth. Seriously; if you doubt my story look at the post history and see if that helps, if not… so be it.</p>\n\n<p>If you care about the deeper parts of my story, and the lively debates/admonitions/disbelievers check out my previous posts:</p>\n\n<p><a href=\"https://www.reddit.com/r/Bitcoin/comments/bpxgyq/since_shit_is_cray_again_in_btc_land_i_sold/\">Short basics</a></p>\n\n<p><a href=\"https://www.reddit.com/r/financialindependence/comments/b2bfko/fire_1_year_in_a_few_reflections/\">More details / 1 year retired reflections</a></p>\n\n<p><a href=\"https://www.reddit.com/r/financialindependence/comments/etgc2q/fire_2_years_in_a_few_more_reflections/\">2yr retired reflections</a></p>\n\n<p><a href=\"https://www.reddit.com/r/Bitcoin/comments/fxho4v/stop_the_bullshit_if_you_sell_your_btc_on/\">Selling, Taxes, Coinbase</a></p>\n\n<p><strong>The story</strong> </p>\n\n<p>I got into bitcoin back in 2013 or so, reading about it and really going down the rabbit hole. I am a scientist, and it is my nature to go deep on things of interest. One thing I learned in my graduate studies was “how to learn” (how to research). For you whippersnappers – that means more than Google and YouTube. So I learned, I read, I watched interviews, I set up a node, I mined shitcoins to understand how that worked (and traded them for bitcoin in the end.) Nobody I knew was into bitcoin, and nobody would listen to me about it. I tried to get my brother interested. I tried to get a tech friend interested. Both of them agreed it was “interesting” but not enough to acquire any bitcoin (this was around the time of bitcoin being just under $1k, before it dropped for several years post MtGox meltdown). So I carried on alone, with just the interwebs to console me.</p>\n\n<p>In 2017 when bitcoin hit $4,000 or so, I sold 40 - enough to pay off my mortgage and cover my original costs to acquire all my holdings (avg sale price $4320). If bitcoin ate shit and died, I had a good ride, and had a paid off house to boot. I think it was a week or two later that it was $8,000. Then soon after it almost hit $20k and started dropping. I didn’t panic, but I woke up in mid-December and my brain screamed “don’t be greedy” to me. I listened to my brain and sold 60 BTC at around $15.6k each. Additionally, as I had my coins on Coinbase, when they opened trading for BCH in late December I dumped them within the first hour for around $3550 each. When all was said and done I had made somewhere near 1.5M USD. </p>\n\n<p>If you have questions about how much I paid in taxes, how I moved the money, if my bank gave a shit (spoiler: they did not) etc. it’s covered in <a href=\"https://www.reddit.com/r/Bitcoin/comments/fxho4v/stop_the_bullshit_if_you_sell_your_btc_on/\">this post</a> with details asked in the comments. You also get to see people tell me I am wrong, so there’s that fun as well. </p>\n\n<p>I kept the rest of my BTC, and watched the price shrink down over the next couple years. I wondered if I had made a mistake by not cashing out, missed my “big chance for maxxx profits” or whatever, but it didn’t really matter that much because a few months after I made the initial money and paid my taxes, <strong>I fucking retired</strong>. Yes, as of almost 3 years ago, I retired. It wasn’t only because of the bitcoin – I had saved money, had a 401k, and an IRA. I was on my way to a modest retirement somewhere in my 50’s or so if I wanted it, but then BOOM, I had a huge nest egg, a paid off house, other savings, and additional bitcoin for the future. Cool. kthxbye work world!</p>\n\n<p>I have spent the last 3 years leisurely pursuing my own things like art and music, woodworking, collage, gardening along with sleeping in and lots of meditation and porch dwelling. There have been several small tragedies in my life since then (parents in poor health, for one) and so I have been able to tend to that more so than I could if I was working. Being retired has given me so many options and so much control over my life. I love it.</p>\n\n<p>Some of you might be thinking something along the lines of - Now here we are…bitcoin is worth $40k so roughly speaking this guy (me) “lost out” so far on about 2.4M after taxes. There’s also the fact that if I had kept working these last 3 years I would have additional income/savings that I could have invested so let’s round up to 3M after taxes, assuming I sold the 100 BTC now and the BCH immediately (I’m not a fan, and actually am surprised it didn’t die). How do I feel about losing out on $3M (and counting)? Honestly, not particularly bad.</p>\n\n<p>Here’s the deal – when you get to a certain point in your net worth, where you can cover your costs for your lifestyle and more (and this number is different for everyone, for me I’m really chill, so no lambo interests) the money sort of converts itself into a score like on a video game. I can look back and think “oh man, 3 million fucking dollars more! Oh shit!” but do I lose sleep over it? No. Do I kick myself? Not really. My score is lower than it could have been… but in return, I got to help a friend die peacefully, I helped another friend pivot his business, I moved to a new city and bought a cool house (still own the old one as a rental, but maybe not for much longer), and I get to wake up every day and do exactly what I want to do (minus covid issues). It’s really nice to be out of the rat race. It suits me well. I know now that I could have made more - but at the time I had no clue, and there is something to be said for the comfort of the sure thing. </p>\n\n<p>My base take is this – we only have so much time on this planet, and I’d like to maximize my control (vs. my wealth) as much as possible. It would be hard to imagine reliving the last 3 years with a full time job, and I don’t care to dwell on what might have been. I hit my retirement number (1.5x my number + remaining BTC) and GTFO of the system. That money has grown in the funds I put it into, and I never touch principle. My remaining bitcoin became and remain gravy and I plan on hodling until it doesn’t make sense anymore. My advice to all of you is to do your research, know your game plan for selling (I didn’t really have a solid one, honestly), be excellent to each other, and live that life. Ignore the noise – from nosy people in internet forums, from grouchy jealous jerkoffs, etc. This is your deal. </p>\n\n<p>I’m happy to answer any questions. Hope you found this interesting.</p>\n</div><!-- SC_ON -->",
  "score": 3160,
  "permalink": "/r/Bitcoin/comments/ku9yjr/in_2017_i_sold_100_btc_and_bch_for_15m_dollars/",
  "subreddit": "Bitcoin",
  "id": "ku9yjr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706371558
}