{
  "author": "apexium",
  "original_created_utc": 1629193131,
  "title": "How did couples deal with cultural differences in royal intermarriages during the Medieval-Elizabethan period? Were any of their struggles documented?",
  "created_utc": 1629213891,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apologies for the really vague timeline, but I&#39;m thinking of when Phillip of Spain married Queen Mary, we know a good chunk of the population wasn&#39;t too happy with a Spanish (and Catholic) prince consort, Catherine of Aragon writing in Latin to Prince Arthur because they couldn&#39;t speak any other common language, Emperors of China having concubines from different tributaries, and when Michael VIII sent his 2 daughters to marry Mongolian rulers to secure alliances. I&#39;ve specified the Medieival/Elizabethan period since that&#39;s what popped into mind first (with the above examples all coming from roughly that period), but if there are any accounts from any other time period I&#39;d be interested too.</p>\n\n<p>Royal intermarriage throughout history was seemingly common to consolidate land and create alliances, but do we know how these princesses/princes felt when they were sent to a foreign country to marry someone they couldn&#39;t communicate with (or even disliked)? Did royalty prefer to marry vassals for this reason? How did people work out these cultural differences? Did they just avoid each other as much as possible? Was there any outright racism/racial tensions? Are there any accounts of public reactions to these marriages? Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/AskHistorians/comments/p60hi6/how_did_couples_deal_with_cultural_differences_in/",
  "subreddit": "AskHistorians",
  "id": "p60hi6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Apologies for the really vague timeline, but I'm thinking of when Phillip of\nSpain married Queen Mary, we know a good chunk of the population wasn't too\nhappy with a Spanish (and Catholic) prince consort, Catherine of Aragon writing\nin Latin to Prince Arthur because they couldn't speak any other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "時系列が曖昧で申し訳ないのですが、スペインのフィリップがメアリー王妃と結婚した時のことを考えています。\nスペインのフィリップがメアリー王妃と結婚したときのことです。\nカトリーヌ・オブ・アラゴンはアーサー王子にラテン語で手紙を書きました。\nアーサー王子にラテン語で手紙を書いたのは、他の言葉が話せなかったからだと...。",
      "title": "中世からエリザベス朝にかけての王室の婚姻において、夫婦は文化の違いにどのように対処したのでしょうか。彼らの苦労が記録されたものはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "请原谅我的时间线非常模糊，但我想到的是西班牙的菲利普与玛丽女王结婚时的情况。\n西班牙的菲利普与玛丽王后结婚时，我们知道有很大一部分人并不是很高兴\n对西班牙（和天主教）太子妃不满意，阿拉贡的凯瑟琳用拉丁文给亚瑟王子写信\n阿拉贡的凯瑟琳用拉丁语写给亚瑟王子，因为他们不会说任何其他语言......",
      "title": "在中世纪-伊丽莎白时期，夫妻双方是如何处理王室通婚中的文化差异的？他们的挣扎是否有记录？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "請原諒我的時間線非常模糊，但我想到的是西班牙的菲利普與瑪麗女王結婚時的情況。\n西班牙的菲利普與瑪麗王后結婚時，我們知道有很大一部分人並不是很高興\n對西班牙（和天主教）太子妃不滿意，阿拉貢的凱瑟琳用拉丁文給亞瑟王子寫信\n阿拉貢的凱瑟琳用拉丁語寫給亞瑟王子，因爲他們不會說任何其他語言......",
      "title": "在中世紀-伊麗莎白時期，夫妻雙方是如何處理王室通婚中的文化差異的？他們的掙扎是否有記錄？"
    }
  ]
}