{
  "author": "AskScienceModerator",
  "the_new_excerpt": "We partnered to teach you all about how to restore coral reefs and save our\noceans. Liv is a Ph.D. candidate and scientific SCUBA diver at the University of\nMiami with a passion for coral reef conservation. She loves baby corals, and\nruns a sort of \"fertility clinic\" to help corals reproduce and…",
  "original_created_utc": 1620039652,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サンゴ礁を回復させ、海を救う方法を皆さんにお伝えするために提携しました。\n海を守るためにはどうすればいいのかを教えてくれるパートナーです。リヴは、マイアミ大学の博士課程に在籍し、サンゴ礁の保護に情熱を燃やす科学的なスクーバダイバーです。\nリヴは、マイアミ大学の博士課程に在籍する科学的なスクーバダイバーで、サンゴ礁の保護に情熱を注いでいます。彼女は赤ちゃん珊瑚が大好きで\nサンゴの繁殖を助けるために、一種の「不妊治療クリニック」を運営しています。",
      "title": "AskScience AMAシリーズ。私たちは、NauiダイブマスターとNBCLXのホストであるタビサ・リプキンとリヴ・ウィリアムソン、そしてそれぞれ海洋生物学者です。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们合作，教你如何恢复珊瑚礁，拯救我们的\n海洋。丽芙是迈阿密大学的博士生和科学潜水员，热衷于珊瑚礁保护。\n迈阿密大学的博士生和科学潜水员，对珊瑚礁保护充满热情。她喜欢小珊瑚，并且\n她经营着一家 \"生育诊所\"，帮助珊瑚繁衍和繁殖。",
      "title": "AskScience AMA系列。我们是Tabitha Lipkin和Liv Williamson，分别是Naui潜水大师和NBCLX的主持人和海洋生物学家。请向我们提出任何问题!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們合作，教你如何恢復珊瑚礁，拯救我們的\n海洋。麗芙是邁阿密大學的博士生和科學潛水員，熱衷於珊瑚礁保護。\n邁阿密大學的博士生和科學潛水員，對珊瑚礁保護充滿熱情。她喜歡小珊瑚，並且\n她經營着一家 \"生育診所\"，幫助珊瑚繁衍和繁殖。",
      "title": "AskScience AMA系列。我們是Tabitha Lipkin和Liv Williamson，分別是Naui潛水大師和NBCLX的主持人和海洋生物學家。請向我們提出任何問題!"
    }
  ],
  "title": "AskScience AMA Series: We are Tabitha Lipkin and Liv Williamson a Naui Dive Master and NBCLX host and a marine biologist respectively. Ask us anything!",
  "created_utc": 1620050012,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We partnered to teach you all about how to restore coral reefs and save our oceans. Liv is a Ph.D. candidate and scientific SCUBA diver at the University of Miami with a passion for coral reef conservation. She loves baby corals, and runs a sort of &quot;fertility clinic&quot; to help corals reproduce and raise their offspring to be fit to survive under environmental stress. Tabitha has been scuba diving for more than 10 years on reefs all over the world. In 2014 she won &quot;Miss Scuba International&quot;, and with the title and platform, she&#39;s continued to share her passion for ocean conservation and activism around the world.</p>\n\n<p>We&#39;ll be here at 1pm ET (17 UT), ask us anything! </p>\n\n<p>Username: <a href=\"/u/NBCLX\">/u/NBCLX</a></p>\n</div><!-- SC_ON -->",
  "score": 128,
  "permalink": "/r/askscience/comments/n3t9tj/askscience_ama_series_we_are_tabitha_lipkin_and/",
  "subreddit": "askscience",
  "id": "n3t9tj",
  "is_self": true,
  "media": null,
  "is_video": false
}