{
  "author": "tenminuteegg",
  "the_new_excerpt": "I'm devastated. 4 days ago, Cake Wallet said that it was insecure and that I\nneed to remove my funds immediately, but I didn't see it since I didn't look.\nNow my wallet got hacked and I lost most of my funds. 0.03 is a very significant\namount for me and this makes me loose trust. Does anyone know…",
  "original_created_utc": 1621337031,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "打ちひしがれています。4日前にCake Walletが安全ではないと言っていて、私は\n4日前にCake Walletが安全ではないと言っていて、すぐに資金を削除する必要があると言っていましたが、見ていなかったのでわかりませんでした。\n今、私のウォレットはハッキングされ、私は資金のほとんどを失いました。0.03は私にとって非常に大きな金額です。\n私にとっては非常に大きな金額で、これでは信頼を失ってしまいます。誰か知っていますか...",
      "title": "ハッキングされてCake Walletで0.03Bitcoinを失った"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很受打击。4天前，Cake Wallet说，它不安全，我需要立即删除我的资金。\n需要立即删除我的资金，但我没有看到，因为我没有看。\n现在我的钱包被黑了，我失去了大部分的资金。0.03是一个非常重要的\n对我来说是非常重要的数额，这让我失去了信任。有没有人知道...",
      "title": "我被黑了，在Cake Wallet上损失了0.03个比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很受打擊。4天前，Cake Wallet說，它不安全，我需要立即刪除我的資金。\n需要立即刪除我的資金，但我沒有看到，因爲我沒有看。\n現在我的錢包被黑了，我失去了大部分的資金。0.03是一個非常重要的\n對我來說是非常重要的數額，這讓我失去了信任。有沒有人知道...",
      "title": "我被黑了，在Cake Wallet上損失了0.03個比特幣"
    }
  ],
  "title": "I got hacked and lost 0.03 Bitcoin on Cake Wallet",
  "created_utc": 1621348233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m devastated. 4 days ago, Cake Wallet said that it was insecure and that I need to remove my funds immediately, but I didn&#39;t see it since I didn&#39;t look. Now my wallet got hacked and I lost most of my funds. 0.03 is a very significant amount for me and this makes me loose trust. Does anyone know anything I could do?</p>\n</div><!-- SC_ON -->",
  "score": 703,
  "permalink": "/r/CryptoCurrency/comments/nf85aj/i_got_hacked_and_lost_003_bitcoin_on_cake_wallet/",
  "subreddit": "CryptoCurrency",
  "id": "nf85aj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590801350
}