{
  "author": "CruentusVI",
  "original_created_utc": 1627552308,
  "title": "9 straight green days hasn't happened in at least 4 years",
  "created_utc": 1627577741,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For real this time. Yes, I actually went and checked rather than just coming here to say it. There have been several instances of 8 but not a single one of 9 days straight all the way back to 08/17/17, which is as far as I can go on Binance, and far enough for me to consider it significant. Of course, the day hasn&#39;t closed yet so we might not have a green day after all but so far it&#39;s green, if slim.</p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/otueor/9_straight_green_days_hasnt_happened_in_at_least/",
  "subreddit": "CryptoCurrency",
  "id": "otueor",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For real this time. Yes, I actually went and checked rather than just coming\nhere to say it. There have been several instances of 8 but not a single one of 9\ndays straight all the way back to 08/17/17, which is as far as I can go on\nBinance, and far enough for me to consider it significant. Of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今回は本当に そう、ここに来ただけではなく、実際に確認してきました。\nここに来て言うのではなく、実際に確認しました。8は何度かありましたが、9は一度もありませんでした。\n私がBinanceで調べられる範囲である2017年8月17日まで遡っても、8日連続は数回ありましたが、9日連続は一度もありませんでした。\nこれは私がBinanceで調べられる範囲であり、私が重要だと考えるには十分な期間です。のですが・・・。",
      "title": "9日連続のグリーンデーは少なくとも4年ぶりの出来事"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这次是真的。是的，我真的去查了，而不是仅仅来\n在这里说。有几个8天的例子，但没有一个9天的例子。\n几天的情况，但没有一次是连续9天，一直到17年8月，这是我在Binance上能查到的最远的地方。\nBinance，而且远到足以让我认为它很重要。其中...",
      "title": "连续9个绿天至少有4年没有发生过了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這次是真的。是的，我真的去查了，而不是僅僅來\n在這裏說。有幾個8天的例子，但沒有一個9天的例子。\n幾天的情況，但沒有一次是連續9天，一直到17年8月，這是我在Binance上能查到的最遠的地方。\nBinance，而且遠到足以讓我認爲它很重要。其中...",
      "title": "連續9個綠天至少有4年沒有發生過了"
    }
  ]
}