{
  "author": "lizard81288",
  "original_created_utc": 1651347911,
  "title": "Why are shy people told to become more outgoing but outgoing people are never told to be more shy/shut up?",
  "created_utc": 1651353907,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As a shy person, I&amp;#39;ve been told many times that I need to be more outgoing. However, I overthink conversations and think, &amp;quot;if I say this, where does that lead this person to say&amp;quot;. However, outgoing people are never told to be more quieter or just shut up. I&amp;#39;ve been on the receiving end of many boring stories I can&amp;#39;t relate to or just stories that lead nowhere in conversation when it comes to my turn. They just generally end with, &amp;quot;well, you had to be there&amp;quot; type situations.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/NoStupidQuestions/comments/ufii8l/why_are_shy_people_told_to_become_more_outgoing/",
  "subreddit": "NoStupidQuestions",
  "id": "ufii8l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As a shy person, I've been told many times that I need to be more outgoing.\nHowever, I overthink conversations and think, \"if I say this, where does that\nlead this person to say\". However, outgoing people are never told to be more\nquieter or just shut up. I've been on the receiving end of many…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人見知りの私は、何度も「もっと外に出なさい」と言われました。\nしかし、私は会話を考えすぎて、「これを言ったら、この人はどこを言うのだろう？\nと考えてしまう。しかし、積極的な人は、「もっと静かにしろ」とか「黙れ」とは言われません。\n黙れ」と言われることはない。私は何度も言われたことがあるのですが...。",
      "title": "なぜ、内気な人は「もっと外向的になれ」と言われるのに、外向的な人は「もっと内気になれ／黙れ」と言われないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个害羞的人，我曾多次被告知我需要更加外向。\n然而，我在谈话中想得太多了，认为 \"如果我这样说，会让这个人说什么呢？\n导致这个人说\"。然而，外向的人从未被告知要更加\n沉默寡言或闭上嘴巴。我一直在接受许多人的批评。",
      "title": "为什么害羞的人被告知要变得更外向，而外向的人却从未被告知要更害羞/闭嘴？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個害羞的人，我曾多次被告知我需要更加外向。\n然而，我在談話中想得太多了，認爲 \"如果我這樣說，會讓這個人說什麼呢？\n導致這個人說\"。然而，外向的人從未被告知要更加\n沉默寡言或閉上嘴巴。我一直在接受許多人的批評。",
      "title": "爲什麼害羞的人被告知要變得更外向，而外向的人卻從未被告知要更害羞/閉嘴？"
    }
  ]
}