{
  "author": "idiotstrike",
  "original_created_utc": 1659306791,
  "title": "Thoughts on NFTs being used to back up ownership of real world, physical items?",
  "created_utc": 1659389718,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;NFTs are currently not very popular because most people think of them as just dumb jpegs without any real value. Whenever NFTs are brought up people question what real world problems they can solve.&lt;/p&gt;\n\n&lt;p&gt;I think there is a huge use case that is not really achievable with any other existing technology and that is a proof of ownership of real world, physical items. Some companies are already utilising this, such as Tiffany &amp;amp; Co. announcing their NFTiff NFTs that sell for whopping 30 ETH a pop and can be redeemed for a custom, physical piece of jewelry.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also StockX which uses NFTs as a proof of ownership of physical shoes. The NFTs can be redeemed at any time for a pair of the actual shoes from the StockX vault. This solves many problems because hyped shoes are being scalped in bulk and shipped around the world many times as they are being re-sold. NFTs can single-handedly remove all problems that this currently has:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;No need to ship the physical box around - this reduces emissions and make it more eco friendly&lt;/li&gt;\n&lt;li&gt;Makes flipping way easier for both the buyer and the seller&lt;/li&gt;\n&lt;li&gt;Reasonable royalty fees guarantee that the creator still gets paid on resales (this is very useful for concert tickets in my opinion - which are also scalped and re-sold at 3x the price)&lt;/li&gt;\n&lt;li&gt;Completely removes fakes from the market &lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Now, how StockX executed on this is another topic completely however I think there is so much potential here if done correctly. In your opinion, what are the pros and cons of this?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 303,
  "permalink": "/r/CryptoCurrency/comments/wd0xlm/thoughts_on_nfts_being_used_to_back_up_ownership/",
  "subreddit": "CryptoCurrency",
  "id": "wd0xlm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "NFTs are currently not very popular because most people think of them as just\ndumb jpegs without any real value. Whenever NFTs are brought up people question\nwhat real world problems they can solve.\n\nI think there is a huge use case that is not really achievable with any other\nexisting technology…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "NFTは現在、あまり普及していません。\nと思われているからです。NFTが話題になるたびに、人々は「NFTが現実の問題を解決できるのか？\nNFTが話題になるたびに、人々はNFTが現実世界のどんな問題を解決できるのか疑問に思うのです。\n\nNFTが話題になるたびに、現実の問題として何が解決できるのかという疑問が湧きますが、私は、他のどの技術でも実現できないような大きなユースケースがあると考えています。\nと思うのですが...。",
      "title": "NFTが現実世界の現物所有の裏付けとして使われることについてどう思われますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "NFT目前不是很流行，因为大多数人认为它们只是\n愚蠢的jpegs，没有任何实际价值。每当提起NFT，人们都会质疑\n它们能解决什么实际问题。\n\n我认为有一个巨大的用例是任何其他现有技术都无法真正实现的\n现有技术无法实现的巨大用例...",
      "title": "对NFT被用来支持现实世界中的实物物品的所有权有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "NFT目前不是很流行，因爲大多數人認爲它們只是\n愚蠢的jpegs，沒有任何實際價值。每當提起NFT，人們都會質疑\n它們能解決什麼實際問題。\n\n我認爲有一個巨大的用例是任何其他現有技術都無法真正實現的\n現有技術無法實現的巨大用例...",
      "title": "對NFT被用來支持現實世界中的實物物品的所有權有什麼看法？"
    }
  ]
}