{
  "author": "shnanogans",
  "the_new_excerpt": "I just started weightlifting and have never heard a peep from any woman working\nout; yes even weightlifting. Meanwhile, the men are like \"HEEUGGHHGH\". I know\nthat for women, vocalizing during sex is an innate trait that's present in our\nclose cousins (other apes) too. So that makes sense. But that…",
  "original_created_utc": 1618189915,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はウエイトリフティングを始めたばかりですが、運動をしている女性から何か言われたことはありません。\nそう、ウエイトリフティングでさえも。一方、男性は「HEEUGGHGH」と言っています。私は知っています。\n女性にとって、セックスの際に声を出すことは、私たちの近親者（他の猿）にもある生得的な特徴ですよね。\n女性にとって、セックスの際に声を出すことは生得的な特徴であり、近いいとこ（他の類人猿）にもあることを知っています。だから、それは納得できる。でも、それは...。",
      "title": "なぜ、男性はジムで音を出し、セックスでは音を出さないのに、女性はセックスで音を出し、ジムでは音を出さないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我刚刚开始举重，从来没有听说过任何女性工作的窥视。\n出；是的甚至举重。同时，男人们就像 \"HEEUGHGHGH\"。我知道\n对女性来说，在性爱中发声是一种与生俱来的特征，存在于我们的身体里。\n近亲（其他猿类）了。所以这就说得通了。但那...",
      "title": "为什么男人在健身房会发出声音，而在做爱时不会发出声音，而女人在做爱时却不会发出声音？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我剛剛開始舉重，從來沒有聽說過任何女性工作的窺視。\n出；是的甚至舉重。同時，男人們就像 \"HEEUGHGHGH\"。我知道\n對女性來說，在性愛中發聲是一種與生俱來的特徵，存在於我們的身體裏。\n近親（其他猿類）了。所以這就說得通了。但那...",
      "title": "爲什麼男人在健身房會發出聲音，而在做愛時不會發出聲音，而女人在做愛時卻不會發出聲音？"
    }
  ],
  "title": "Why do men make noise at the gym and not during sex but women make noise during sex but not at the gym?",
  "created_utc": 1618213134,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I just started weightlifting and have never heard a peep from any woman working out; yes even weightlifting. Meanwhile, the men are like &quot;HEEUGGHHGH&quot;. I know that for women, vocalizing during sex is an innate trait that&#39;s present in our close cousins (other apes) too. So that makes sense. But that doesn&#39;t explain why dudes are so &quot;HEUGHHGUEHH&quot; at the gym while women are quiet.</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/TooAfraidToAsk/comments/mp3qq8/why_do_men_make_noise_at_the_gym_and_not_during/",
  "subreddit": "TooAfraidToAsk",
  "id": "mp3qq8",
  "is_self": true,
  "media": null,
  "is_video": false
}