{
  "author": "Remarkable-Party7382",
  "the_new_excerpt": "I work for a Software company, and this week I had a meeting with the CEO, we\ncan submit questions anonymously so the CEO will reply those in the Q&A.\n\nI asked if those who wanted, could be paid part of the salary or the bonus in\nCrypto, and not only the CEO said no, but everyone laughed, and…",
  "original_created_utc": 1616358141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在一家软件公司工作，这周我和CEO开了个会，我们。\n可以匿名提交问题，这样CEO就会在问答中回答这些问题。\n\n我问了一下，如果有意愿的人，是否可以将部分工资或奖金分给他们。\n快讯，不仅CEO说不，大家都笑了，...",
      "title": "我的公司拒绝用比特币支付我的工资，当我问我的同事时，他们都笑了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在一家軟件公司工作，這周我和CEO開了個會，我們。\n可以匿名提交問題，這樣CEO就會在問答中回答這些問題。\n\n我問了一下，如果有意願的人，是否可以將部分工資或獎金分給他們。\n快訊，不僅CEO說不，大家都笑了，...",
      "title": "我的公司拒絕用比特幣支付我的工資，當我問我的同事時，他們都笑了。"
    }
  ],
  "title": "My company refuses to pay me in Bitcoin , and my colleagues laughed when I asked",
  "created_utc": 1616416566,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I work for a Software company, and this week I had a meeting with the CEO, we can submit questions <em>anonymously</em> so the CEO will reply those in the Q&amp;A.</p>\n\n<p>I asked if those who wanted, could be paid part of the salary or the bonus in Crypto, and not only the CEO said no, but everyone laughed, and started to make very ignorant comments and jokes about Crypto and Bitcoin like &#39;where is that money even coming from&#39;. The CEO also used a patronising excuse : &#39;Bitcoin is too volatile&#39;.</p>\n\n<p>Now, I want to repeat this: it was a meeting in a Software Company. Most of the people working in the company are Developers, the kind of people who knows about Bitcoin, and should be able to understand it. </p>\n\n<p>I used to think people will rush to buy Bitcoin when it will be at 100K, but I think I was wrong, and &#39;most people&#39; will only rush into it when it is at $1M</p>\n\n<p>EDITED: The main reason to ask that was to check everyone’s reaction towards Bitcoin, and I was very surprised, that it was the same most of the population had 5-7 years ago.\nI THOUGHT every smart dev was at least considering getting into Bitcoin, and it definitely didn’t look like.\nGuess we are still very early</p>\n</div><!-- SC_ON -->",
  "score": 188,
  "permalink": "/r/Bitcoin/comments/ma584d/my_company_refuses_to_pay_me_in_bitcoin_and_my/",
  "subreddit": "Bitcoin",
  "id": "ma584d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752813419
}