{
  "author": "stevebmmm",
  "the_new_excerpt": "As a veteran of WallStreetBets - made a ‘modest’ $2.5 million there a few years\nago\n[https://www.reddit.com/r/wallstreetbets/comments/80e7x2/the_big_long_made_25_million_in_january_off_100k/]\n- I decided to post this here instead of WSB because there’s no chance anyone\nthere would listen.\n\nI know…",
  "original_created_utc": 1612048018,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为WallStreetBets的老手--几年前在那里赚了 \"微薄 \"的250万美元。\n以前\n[https://www.reddit.com/r/wallstreetbets/comments/80e7x2/the_big_long_made_25_million_in_january_off_100k/]\n- 我决定把这个贴在这里，而不是WSB，因为没有机会让人\n那里会听。\n\n我知道...",
      "title": "购买GME并不是在欺骗华尔街，而是把您的钱交给他们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲WallStreetBets的老手--幾年前在那裏賺了 \"微薄 \"的250萬美元。\n以前\n[https://www.reddit.com/r/wallstreetbets/comments/80e7x2/the_big_long_made_25_million_in_january_off_100k/]\n- 我決定把這個貼在這裏，而不是WSB，因爲沒有機會讓人\n那裏會聽。\n\n我知道...",
      "title": "購買GME並不是在欺騙華爾街，而是把您的錢交給他們。"
    }
  ],
  "title": "Buying GME is NOT screwing Wall Street - It is giving them your money",
  "created_utc": 1612056933,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a veteran of WallStreetBets - <a href=\"https://www.reddit.com/r/wallstreetbets/comments/80e7x2/the_big_long_made_25_million_in_january_off_100k/\">made a ‘modest’ $2.5 million there a few years ago</a> - I decided to post this here instead of WSB because there’s no chance anyone there would listen.</p>\n\n<p>I know this won’t be well received, but I’m concerned for a lot of people who’ve been buying GME stock thinking they’re somehow taking on Wall Street. To be fair, those who were early to the trade actually did hurt a couple hedge funds, but the people who followed changed the dynamic considerably.</p>\n\n<p>I know you guys all want to stick it to the man. Unfortunately, you’ve created a situation where the man is going to screw you, hard.</p>\n\n<p>What’s one thing hedge funds do that lead to this?</p>\n\n<p>They find stocks that are overvalued, short them, and then wait.</p>\n\n<p>What have you all done?</p>\n\n<p>Created a horrifically overvalued stock.</p>\n\n<p>Why do you think the short ratio is still more than 100% of the float?</p>\n\n<p>Who do you think’s been selling you GME at $300 a share?</p>\n\n<p>The guys who are going to buy it back from you in a month for $30. They have deeper pockets and more margin than Citron, and are perfectly content to wait you out, whether it’s next week or next year.</p>\n\n<p><em>To be clear, I have no skin in this game in either direction, though if I could stomach taking your life savings, I&#39;d be one of the people selling you GME for $300.</em></p>\n\n<p>All this talk about retail investors screwing over hedge funds - you are literally giving those hedge funds all your money. People have leveraged their entire life savings to buy an overvalued stock. You are not beating Wall Street. This is their game. You are giving them your money.</p>\n\n<p>Yes, it was funny, and Citron and Melvin took a hit on their initial trades. But now it’s open season on everyone who bought in. At the end of the day, you grossly overpaid for shares of a struggling retail company. That is what you now own.</p>\n\n<p>How do you unwind this position? Is everyone going to hold until they die? What happens if GameStop, like so many other retail chains, goes bankrupt in a couple years, wiping out all the shareholders?</p>\n\n<p>Even if you hold, you’ll be wiped out long before then. <strong>At these price levels, GameStop’s leadership has a fiscal obligation to start diluting their stock as soon as legally possible.</strong> It won’t matter if everyone holds if there’s suddenly 300% more shares available.</p>\n\n<p>In the short term, the price could definitely go higher if retail investors have money to keep buying. So what happens if you manage to push it to $500, or $1000? Wall Street will be thrilled to keep selling you more shorted stock just like GameStop will be thrilled to keep printing it.</p>\n\n<p>There is no way for everyone to unload their positions without losing massive amounts of money. There is no way for everyone to hold their positions without losing massive amounts of money.</p>\n\n<p>You are playing Wall Street’s game and they are happy to take your money. This is going to end badly and is going to hurt a lot of people who can least afford it.  </p>\n\n<p>Congrats to everyone who made a killing with buying options early - even though they used the rest of you to inflate the stock price. But for everyone holding the stock - I wish you the best luck.</p>\n</div><!-- SC_ON -->",
  "score": 261,
  "permalink": "/r/stocks/comments/l8yamo/buying_gme_is_not_screwing_wall_street_it_is/",
  "subreddit": "stocks",
  "id": "l8yamo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518537983
}