{
  "author": "smellysocks62",
  "original_created_utc": 1653893179,
  "title": "my boyfriend won’t initiate sex. what do i do?",
  "created_utc": 1653916272,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Throwaway.&lt;/p&gt;\n\n&lt;p&gt;My (23F) boyfriend (23M) have had very little sex recently. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend and I have been dating for 4 years. Our sex drive and sex life has always been good. He is usually the one who initiates sex and that’s how it’s always worked for us.&lt;/p&gt;\n\n&lt;p&gt;However, about a month ago, we had a conversation about our sex life and he hasn’t  initiated sex ever since. &lt;/p&gt;\n\n&lt;p&gt;It was just right after we had finished having sex and we were both talking about it and reflecting. We don’t do this often so it was uncomfortable and strange at first but after a couple of minutes we were both talking about it openly to each other. &lt;/p&gt;\n\n&lt;p&gt;The conversation consisted of us asking each other questions about what we like and what we don’t like, our feelings and thoughts etc.&lt;/p&gt;\n\n&lt;p&gt;I realize that this is a very common conversation that couples have but like I said, we’ve been dating for years, our sex life has always been great, and we had this conversation because some time has passed since we’ve last had a convo like this so I thought it would be healthy to touch on it. &lt;/p&gt;\n\n&lt;p&gt;The conversation concluded in us both agreeing that our sex life is good but it can be better.&lt;/p&gt;\n\n&lt;p&gt;Well my boyfriend hasn’t initiated sex since…&lt;/p&gt;\n\n&lt;p&gt;After a couple of weeks, I have asked him why he hasn’t initiated sex and at first he just said that he doesn’t know why and that he’s too tired and not in the mood after work (we both work long hours until 9 PM most of the week)&lt;/p&gt;\n\n&lt;p&gt;This conversation had been brought up again however this time he told me that he doesn’t initiate sex because he doesn’t think it’s good enough for me based on our first conversation.&lt;/p&gt;\n\n&lt;p&gt;I was shocked and confused as to why he would think so because to me, it was simply a normal and healthy conversation to have about our sex life and in the end we both agreed. Our sex life is great and I never even hinted that it wasn’t good enough or that I was unhappy with it. &lt;/p&gt;\n\n&lt;p&gt;We’ve had sex once since the last conversation (I was the one who initiated it) and it’s been 2 weeks since then. I feel like this is just going to continue and I don’t know how to resolve it.&lt;/p&gt;\n\n&lt;p&gt;Am I missing something here? Is he offended or did he become insecure after that conversation? &lt;/p&gt;\n\n&lt;p&gt;We are both very sexual people (my boyfriend is even more than I am) I plan on talking to him about it again but I don’t want to pressure him or overwhelm him.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 148,
  "permalink": "/r/TooAfraidToAsk/comments/v0u6nj/my_boyfriend_wont_initiate_sex_what_do_i_do/",
  "subreddit": "TooAfraidToAsk",
  "id": "v0u6nj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Throwaway.\n\nMy (23F) boyfriend (23M) have had very little sex recently.\n\nMy boyfriend and I have been dating for 4 years. Our sex drive and sex life has\nalways been good. He is usually the one who initiates sex and that’s how it’s\nalways worked for us.\n\nHowever, about a month ago, we had a…"
}