{
  "author": "wowzaps",
  "original_created_utc": 1635561427,
  "title": "I was just pooped on by a man while walking, is there a way to identify him from his poop?",
  "created_utc": 1635575286,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was walking under bleachers and poop splattered next to me and got on my shoes and pants. I looked up and saw a man hovering his ass over the side of the bleachers. He ran away, now I’m here covered in poop. Who do I call, the police? Is that a crime. How do I get it tested?</p>\n\n<p>PS I’m not joking please don’t laugh about it I’m not in the mood for jokes I want a serious answer.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/qis72p/i_was_just_pooped_on_by_a_man_while_walking_is/",
  "subreddit": "NoStupidQuestions",
  "id": "qis72p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I was walking under bleachers and poop splattered next to me and got on my shoes\nand pants. I looked up and saw a man hovering his ass over the side of the\nbleachers. He ran away, now I’m here covered in poop. Who do I call, the police?\nIs that a crime. How do I get it tested?\n\nPS I’m not joking…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "観覧席の下を歩いていたら、隣にウンコが飛び散って靴やズボンについた。\n靴とズボンについた。ふと見ると、男の人が観覧席の横にお尻を浮かせていました。\n見上げると、男が観客席の横に尻を浮かせていた。彼は逃げてしまい、今私はここでウンコまみれになっています。誰を呼べばいいんだろう、警察？\nこれは犯罪ですか？どうやって検査するの？\n\nPS 冗談ではありません...。",
      "title": "歩いている時に男性にウンコをされたのですが、ウンコから特定する方法はありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在看台下行走，大便溅到我旁边，沾到我的鞋子和裤子上。\n和裤子上。我抬起头，看到一个男人把他的屁股悬在看台的一侧。\n看台。他跑开了，现在我在这里，浑身都是大便。我该给谁打电话，警察吗？\n这算不算犯罪。我怎样才能得到它的测试？\n\nPS 我不是在开玩笑...",
      "title": "我刚刚在走路时被一个男人拉了一泡屎，有没有办法从他的大便中辨别出他？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在看臺下行走，大便濺到我旁邊，沾到我的鞋子和褲子上。\n和褲子上。我擡起頭，看到一個男人把他的屁股懸在看臺的一側。\n看臺。他跑開了，現在我在這裏，渾身都是大便。我該給誰打電話，警察嗎？\n這算不算犯罪。我怎樣才能得到它的測試？\n\nPS 我不是在開玩笑...",
      "title": "我剛剛在走路時被一個男人拉了一泡屎，有沒有辦法從他的大便中辨別出他？"
    }
  ]
}