{
  "author": "CanaKagan",
  "original_created_utc": 1625045536,
  "title": "Okay everyone, get ready for a bullrun. I’m going to try swing trading, again. You can all thank me later.",
  "created_utc": 1625056500,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Had the thought of trying swing trades, as the market trades sideways. But from my past experiences, I’ll most likely cause a massive bullrun, as I sell at a -1% day, just to miss a massive upward spike the next day of +1000%.</p>\n\n<p>You can all thank me later. Happy to be of service…</p>\n\n<p>Edit - commas are nice, let me add a few</p>\n\n<p>Edit - if you happen to afford a few lambos, please paint one Iridescent Fuscia in my honor. That was my go to Need for Speed Underground color. Queue Doomsday by Overseer.</p>\n</div><!-- SC_ON -->",
  "score": 318,
  "permalink": "/r/CryptoCurrency/comments/oatq5m/okay_everyone_get_ready_for_a_bullrun_im_going_to/",
  "subreddit": "CryptoCurrency",
  "id": "oatq5m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Had the thought of trying swing trades, as the market trades sideways. But from\nmy past experiences, I’ll most likely cause a massive bullrun, as I sell at a\n-1% day, just to miss a massive upward spike the next day of +1000%.\n\nYou can all thank me later. Happy to be of service…\n\nEdit - commas are…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "相場が横ばいなので、スイングトレードをやってみようと思っていました。しかし、過去の経験から\n私の過去の経験からすると、-1％の日に売ると、大規模なブルランを引き起こす可能性が高いです。\n-しかし、過去の経験から、私は大規模なブルランを引き起こす可能性が高い。\n\n皆さんは後で私に感謝するでしょう。お役に立てて嬉しいです...。\n\n編集 - カンマは...",
      "title": "皆さん、ブルランの準備をしてください。私はもう一度、スイングトレードに挑戦します。皆さんは後で私に感謝することになるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有过尝试波段交易的想法，因为市场的交易是横向的。但根据我过去的经验\n我过去的经验，我很可能会导致大规模的牛市，因为我在一个\n-1%的时候卖出，却错过了第二天+1000%的巨大上升空间。\n\n你们以后都可以感谢我。很高兴能为你们服务...\n\n编辑 - 逗号是...",
      "title": "好了，各位，准备好迎接一场牛市吧。我将再次尝试波段交易。你们以后都可以感谢我。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有過嘗試波段交易的想法，因爲市場的交易是橫向的。但根據我過去的經驗\n我過去的經驗，我很可能會導致大規模的牛市，因爲我在一個\n-1%的時候賣出，卻錯過了第二天+1000%的巨大上升空間。\n\n你們以後都可以感謝我。很高興能爲你們服務...\n\n編輯 - 逗號是...",
      "title": "好了，各位，準備好迎接一場牛市吧。我將再次嘗試波段交易。你們以後都可以感謝我。"
    }
  ]
}