{
  "author": "L0wCharisma",
  "original_created_utc": 1625620072,
  "title": "Am I the only one who finds inspirational speechs incredibly annoying?",
  "created_utc": 1625630039,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think my hatred for them started everyone said &quot;were all in the same boat&quot; at the start of 2020, and now I just groan when ever I hear them because its isn&#39;t anything I haven&#39;t heard already like &quot;you deserve all the good things in life&quot; or &quot;you just need to work harder&quot;</p>\n\n<p>not to mention the way people say them can sound incredibly patronizing and make me feel like an idiot.</p>\n\n<p>does anyone feel this way or am I just an asshole?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/TooAfraidToAsk/comments/of8hlw/am_i_the_only_one_who_finds_inspirational_speechs/",
  "subreddit": "TooAfraidToAsk",
  "id": "of8hlw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think my hatred for them started everyone said \"were all in the same boat\" at\nthe start of 2020, and now I just groan when ever I hear them because its isn't\nanything I haven't heard already like \"you deserve all the good things in life\"\nor \"you just need to work harder\"\n\nnot to mention the way…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が彼らを嫌うようになったのは、2020年初頭の「みんな同じ船に乗っている」という言葉からだと思います。\n2020年の初めに \"we are all in the boat \"と言われてからだと思いますが、今では聞くたびに唸ってしまいます。\nあなたは人生で良いことをする資格がある」とか「もっと頑張ればいい」とか\n\"あなたは人生で良いことをする資格がある\" とか \"もっと頑張ればいいんだ\" とか\n\nましてや、その方法は...。",
      "title": "感動的なスピーチが信じられないほど腹立たしいと思うのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我对他们的憎恨始于每个人在2020年开始时说的 \"我们都在同一条船上\"。\n2020年开始，现在我一听到他们的声音就会呻吟，因为没有什么是我没听过的。\n我还没有听说过的东西，比如 \"你应该得到生活中所有的好东西\"\n或 \"你只需要更努力工作\"\n\n更不用说......的方式了。",
      "title": "难道只有我一个人觉得鼓舞人心的演讲令人难以置信地讨厌吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我對他們的憎恨始於每個人在2020年開始時說的 \"我們都在同一條船上\"。\n2020年開始，現在我一聽到他們的聲音就會呻吟，因爲沒有什麼是我沒聽過的。\n我還沒有聽說過的東西，比如 \"你應該得到生活中所有的好東西\"\n或 \"你只需要更努力工作\"\n\n更不用說......的方式了。",
      "title": "難道只有我一個人覺得鼓舞人心的演講令人難以置信地討厭嗎？"
    }
  ]
}