{
  "author": "EchoingSimplicity",
  "the_new_excerpt": "I'm only twenty, but I think about this a lot. Shouldn't pursuing your dreams be\nwhat makes you happy? Having 2.1 kids, a suburban home, and the usual 9-5, it\nall seems a bit crushing to me. This set-up doesn't work for many people, yet\nit's still seen as the default. Can someone who's older explain…",
  "original_created_utc": 1622508957,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はまだ20歳ですが、このことについてよく考えます。夢を追いかけることが、自分の幸せにつながるのではないか。\n幸せになることではないのでしょうか？2.1人の子供がいて、郊外の家に住んでいて、普通の9時から5時までの生活をしていると\n私にはちょっとつまらないことのように思えます。この設定は多くの人にとってうまくいかないものですが、それでも\nこの設定は多くの人にとってうまくいかないのに、いまだにデフォルトとして見られています。どなたか年配の方に説明していただけますか？",
      "title": "なぜ、人は年をとると夢を捨てて「落ち着く」のでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我只有二十岁，但我经常思考这个问题。追求自己的梦想难道不应该是\n使你快乐吗？有2.1个孩子，有一个郊区的家，还有通常的朝九晚五的生活，这一切对我来说似乎有点压抑。\n对我来说，这一切似乎有点压抑。这种设置对很多人来说都不适用，但\n它仍然被看作是默认的。有谁能解释一下...",
      "title": "为什么人们在年老的时候会放下自己的梦想，\"安定下来 \"呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我只有二十歲，但我經常思考這個問題。追求自己的夢想難道不應該是\n使你快樂嗎？有2.1個孩子，有一個郊區的家，還有通常的朝九晚五的生活，這一切對我來說似乎有點壓抑。\n對我來說，這一切似乎有點壓抑。這種設置對很多人來說都不適用，但\n它仍然被看作是默認的。有誰能解釋一下...",
      "title": "爲什麼人們在年老的時候會放下自己的夢想，\"安定下來 \"呢？"
    }
  ],
  "title": "Why is it that people let go of their dreams and 'settle down' as they grow old?",
  "created_utc": 1622559725,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m only twenty, but I think about this a lot. Shouldn&#39;t pursuing your dreams be what makes you happy? Having 2.1 kids, a suburban home, and the usual 9-5, it all seems a bit crushing to me. This set-up doesn&#39;t work for many people, yet it&#39;s still seen as the default. Can someone who&#39;s older explain to me what happens as we grow older that pushes us down this path? Shouldn&#39;t it be more like everyone has their own path rather than following a life script? I&#39;m definitely confused, but would love to talk about this, so let me know!</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TrueAskReddit/comments/nphwqp/why_is_it_that_people_let_go_of_their_dreams_and/",
  "subreddit": "TrueAskReddit",
  "id": "nphwqp",
  "is_self": true,
  "media": null,
  "is_video": false
}