{
  "author": "abacus_porkrind",
  "original_created_utc": 1650541586,
  "title": "If Dwight Eisenhower felt the military-industrial complex was a cause for concern, why would he have been reduced to offering a single warning at the very end of his public life?",
  "created_utc": 1650551156,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As president, Dwight Eisenhower famously coined the term &amp;quot;military–industrial complex&amp;quot; in his 1961 farewell address. In context, it&amp;#39;s typically described as a warning to the American people. Given that Eisenhower served eight years as president, and was the first entirely post war president, did he not have significant influence over the landscape in which the military–industrial complex formed? To what extent could he (or did he) act to mitigate &amp;quot;the dangers of massive military spending, particularly  deficit spending and government contracts to private military manufacturers&amp;quot;?  &lt;/p&gt;\n\n&lt;p&gt;The quoted text is Wikipedia&amp;#39;s definition of the term but my lack of education is exactly why I came here to ask this.  I hope the question is within the sub&amp;#39;s rules.  I would be extremely grateful for any context or insight offered.  Thank you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 169,
  "permalink": "/r/AskHistorians/comments/u8lpmx/if_dwight_eisenhower_felt_the_militaryindustrial/",
  "subreddit": "AskHistorians",
  "id": "u8lpmx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As president, Dwight Eisenhower famously coined the term \"military–industrial\ncomplex\" in his 1961 farewell address. In context, it's typically described as a\nwarning to the American people. Given that Eisenhower served eight years as\npresident, and was the first entirely post war president, did he…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ドワイト・アイゼンハワーが大統領だった1961年の退任演説で、「軍産複合体」という言葉を作ったのは有名な話だ。\n1961年の退任演説で「軍産複合体」という言葉を使ったのは有名な話だ。この言葉は、一般的にはアメリカ国民への警告として語られることが多い。\nアメリカ国民への警告である。アイゼンハワーは8年間大統領を務めた。\nアイゼンハワーは8年間大統領を務め、戦後初の完全な大統領であったことを考えると、彼は...",
      "title": "もし、ドワイト・アイゼンハワーが軍産複合体を懸念していたのなら、なぜ、公生涯の最後にたった一つの警告を発するだけにとどめたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为总统，德怀特-艾森豪威尔在1961年的告别演说中创造了著名的 \"军事工业综合体 \"一词。\n在他1961年的告别演说中提出了 \"军工综合体 \"一词。在上下文中，它通常被描述为对美国人民的一个警告。\n对美国人民的警告。鉴于艾森豪威尔担任了八年的总统\n是战后的第一位总统，他是否...",
      "title": "如果德怀特-艾森豪威尔觉得军工综合体是一个值得关注的问题，他为什么会沦落到在其公共生活的最后阶段提出一个警告？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲總統，德懷特-艾森豪威爾在1961年的告別演說中創造了著名的 \"軍事工業綜合體 \"一詞。\n在他1961年的告別演說中提出了 \"軍工綜合體 \"一詞。在上下文中，它通常被描述爲對美國人民的一個警告。\n對美國人民的警告。鑑於艾森豪威爾擔任了八年的總統\n是戰後的第一位總統，他是否...",
      "title": "如果德懷特-艾森豪威爾覺得軍工綜合體是一個值得關注的問題，他爲什麼會淪落到在其公共生活的最後階段提出一個警告？"
    }
  ]
}