{
  "author": "Soft-Kale23",
  "original_created_utc": 1629758461,
  "title": "Is it okay to be hurt over my(27f) boyfriend(33m) using onlyfans?",
  "created_utc": 1629779052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So a few weeks ago I found my boyfriend was subscribed to an onlyfans. we were looking at his phone when the charge text came up. so perfect. i ask what that was and he just kept saying what what, as if I didn&#39;t see what the charge was for. I was so hurt. Months ago he was going through his email and i thought I had seen an onlyfans email and I even asked but he ignored me and for some reason I didn&#39;t press him about it. But once I saw this text it was so clear. I was so upset and angry and hurt, I left his house for a while but ended up going back. I told him how hurt I was. To me personally it feels offensive for my partner to pay for a woman&#39;s nudes, especially when we hadn&#39;t been having sex, he doesn&#39;t really spend money on me because hes not currently working. So knowing he willingly just sends someone else money monthly, no matter what the price is, fucked me up.</p>\n\n<p>I asked him who it was, I don&#39;t know why I want to see. I want to know who it is,  since he said it was some random girl on his explore page and not &quot;someone he follows&quot;, I want to know how much he was paying but he refuses to show me. He said he deleted his account when I left and I believe him. But now I don&#39;t trust him. He&#39;s asking me to try. But now all I think about is wanting to know who it is, wondering if hell make another account and how he&#39;s just going to be more cautious and sneaky. Now hes trying to be more lovey dovey but Im like a stone I feel so cold I cant reciprocate it. Ive been having really disturbing nightmares about awful things happening to me daily since it happened and I just figured out it might be from that. I feel like Im being silenced and just being forced to move on and get over it because he refused to answer my questions. I feel like I cant talk to anyone about this because its so embarrassing, like I cant even talk to my best friend about it Im ashamed and I did nothing wrong. I dont know why this affected me so hard. I dont forgive him. Is it wrong for me to be hurt over this? I wouldnt be bothered if it was just porn but something about him paying a specific girl just hurts me so much. I thought our relationship was good til now I question everything. I dont know what to do.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/paamp2/is_it_okay_to_be_hurt_over_my27f_boyfriend33m/",
  "subreddit": "TooAfraidToAsk",
  "id": "paamp2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So a few weeks ago I found my boyfriend was subscribed to an onlyfans. we were\nlooking at his phone when the charge text came up. so perfect. i ask what that\nwas and he just kept saying what what, as if I didn't see what the charge was\nfor. I was so hurt. Months ago he was going through his email…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数週間前、私の彼氏がonlyfansに登録していることを知りました。\n彼の携帯を見ていたら、課金のテキストが出てきました。\n彼は何度も何度も言っていましたが、まるで私が何のための課金なのかわからないように\nのです。私はとても傷つきました。数ヶ月前、彼は自分のメールを見ていて...",
      "title": "私(27f)の彼氏(33m)がonlyfansを使っていることに傷ついてもいいのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个星期前，我发现我的男朋友订阅了一个onlyfans。\n我们正在看他的手机，这时收费短信出现了，太完美了。\n我问他那是什么，他只是不停地说什么什么，好像我没有看到收费的内容一样。\n的内容。我很受伤。几个月前，他正在翻阅他的电子邮件......",
      "title": "为我(27岁)的男朋友(33岁)使用onlyfans而受伤可以吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個星期前，我發現我的男朋友訂閱了一個onlyfans。\n我們正在看他的手機，這時收費短信出現了，太完美了。\n我問他那是什麼，他只是不停地說什麼什麼，好像我沒有看到收費的內容一樣。\n的內容。我很受傷。幾個月前，他正在翻閱他的電子郵件......",
      "title": "爲我(27歲)的男朋友(33歲)使用onlyfans而受傷可以嗎？"
    }
  ]
}