{
  "author": "dkkc19",
  "original_created_utc": 1651355081,
  "title": "I dont get how Solana still has supporters. After devs had to restart the blockchain I lost all faith in it.",
  "created_utc": 1651422678,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before I begin this post. I will NOT be posting hate but simply FACTS.&lt;/p&gt;\n\n&lt;p&gt;EDIT: Solana is at 2 TPS right now and is basically down LMAO&lt;/p&gt;\n\n&lt;p&gt;Now I’ll press ahead.&lt;/p&gt;\n\n&lt;p&gt;Yeah it’s fast and cheap since it boasts what might be the highest TPS in the market.  But what use is this ultra high TPS if half of the time I can’t even use the network cause of its awful downtime?&lt;/p&gt;\n\n&lt;p&gt;Even their own freaking CEO notoriously said “it doesn’t matter if the network crashes”&lt;/p&gt;\n\n&lt;p&gt;If the CEO of a platform or service doesn’t trust its performance, then why tf should I trust it? It just makes no sense how this coin is still at number 6 in rank.&lt;/p&gt;\n\n&lt;p&gt;Sure, almost every chain on the market has suffered from downtime here and there but never to the extent that Solana did.&lt;/p&gt;\n\n&lt;p&gt;I would much rather stay where I am on Polygon right now. Transactions are just as fast and even cheaper and their ecosystem is WAY more superior with recent news about more than 19k dApps build on top of it.\nBut most importantly, its way more reliable.&lt;/p&gt;\n\n&lt;p&gt;And its not just Polygon. I just mentioned it cause its the platform I use the most. Literally any other platform right now is more reliable than Solana.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/CryptoCurrency/comments/ufkt75/i_dont_get_how_solana_still_has_supporters_after/",
  "subreddit": "CryptoCurrency",
  "id": "ufkt75",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Before I begin this post. I will NOT be posting hate but simply FACTS.\n\nEDIT: Solana is at 2 TPS right now and is basically down LMAO\n\nNow I’ll press ahead.\n\nYeah it’s fast and cheap since it boasts what might be the highest TPS in the\nmarket. But what use is this ultra high TPS if half of the time…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この投稿を始める前に 私は憎しみを投稿するのではなく、単に事実を投稿するつもりです。\n\nEDIT: ソラナは今2TPSで、基本的にダウンしています LMAO\n\nさて、先に進みます。\n\nそうですね、市場最高峰のTPSを誇っているので、速くて安いですね。\nを誇っています。しかし、この超高速TPSは、もし半分の時間が...であれば、何の役に立つのでしょうか？",
      "title": "ソラナにまだ支持者がいるのが理解できない。開発者がブロックチェーンを再起動させた後、私はその信頼性を失いました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我开始这个帖子之前。我将不会发布仇恨，而只是发布事实。\n\n编辑：Solana现在只有2个TPS，而且基本上已经倒下了LMAO\n\n现在我将继续前进。\n\n是的，它的速度很快，而且很便宜，因为它拥有可能是市场上最高的TPS。\n市场上最高的TPS。但是，如果有一半的时间......这种超高的TPS有什么用呢？",
      "title": "我不明白索拉纳怎么还会有支持者。在开发者不得不重新启动区块链之后，我对它失去了所有的信心。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我開始這個帖子之前。我將不會發布仇恨，而只是發佈事實。\n\n編輯：Solana現在只有2個TPS，而且基本上已經倒下了LMAO\n\n現在我將繼續前進。\n\n是的，它的速度很快，而且很便宜，因爲它擁有可能是市場上最高的TPS。\n市場上最高的TPS。但是，如果有一半的時間......這種超高的TPS有什麼用呢？",
      "title": "我不明白索拉納怎麼還會有支持者。在開發者不得不重新啓動區塊鏈之後，我對它失去了所有的信心。"
    }
  ]
}