{
  "author": "mxdSirty",
  "original_created_utc": 1636985222,
  "title": "What crypto is way overvalued in your opinion?",
  "created_utc": 1637005099,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As the title says, what crypto do you think is way overvalued? Normally, we always hear about what crypto everyone is bullish on, whether it&#39;s the next moon shot or has an amazing bright future, but i&#39;m interested to hear what crypto you think is the complete opposite. </p>\n\n<p>For me, I think ethereum classic is extremely overvalued and should revert back to its old 2020 prices. There&#39;s so many better alternatives compared to ethereum classic, and I just don&#39;t see how it can prosper as much as other ethereum alternatives. It will be interesting to see what you guys think as everyone has their own opinions which might be influenced by what they hold.</p>\n</div><!-- SC_ON -->",
  "score": 208,
  "permalink": "/r/CryptoCurrency/comments/quh7tb/what_crypto_is_way_overvalued_in_your_opinion/",
  "subreddit": "CryptoCurrency",
  "id": "quh7tb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As the title says, what crypto do you think is way overvalued? Normally, we\nalways hear about what crypto everyone is bullish on, whether it's the next moon\nshot or has an amazing bright future, but i'm interested to hear what crypto you\nthink is the complete opposite.\n\nFor me, I think ethereum…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "タイトルにあるように、あなたが過大評価されていると思う暗号は？通常、私たちは\n通常は、次の月面探査であるとか、驚異的な明るい未来があるとか、皆が強気になっている暗号について聞きます。\nしかし、私はあなたが全く逆のことを考えている暗号を聞きたいのです。\n私は、皆さんが全く逆のことを考えている暗号を聞きたいと思っています。\n\n私の場合は、イーサリアム...",
      "title": "あなたの意見では、どの暗号が過大評価されていますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "正如标题所说，你认为什么加密货币的价值被严重高估？通常情况下，我们\n我们总是听到每个人都看好什么加密货币，不管它是下一个月球射手还是有惊人的光明前景。\n或有一个惊人的光明未来，但我很想听听你认为什么加密货币\n认为是完全相反的。\n\n对我来说，我认为以太坊...",
      "title": "在你看来，什么加密货币的价值被高估了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "正如標題所說，你認爲什麼加密貨幣的價值被嚴重高估？通常情況下，我們\n我們總是聽到每個人都看好什麼加密貨幣，不管它是下一個月球射手還是有驚人的光明前景。\n或有一個驚人的光明未來，但我很想聽聽你認爲什麼加密貨幣\n認爲是完全相反的。\n\n對我來說，我認爲以太坊...",
      "title": "在你看來，什麼加密貨幣的價值被高估了？"
    }
  ]
}