{
  "author": "AccutaneQ123",
  "original_created_utc": 1628972907,
  "title": "Unpopular opinion: It’s not bad to keep your coins in an exchange",
  "created_utc": 1628980833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>For some people the chances of them losing their private keys is higher than the exchange getting hacked.</strong></p>\n\n<p>Of course, storing your crypto on a wallet is better if you are able to manage it well. </p>\n\n<p>If not, then keeping your coins in an exchange is not a bad idea.</p>\n\n<p>But there is one important rule you must know: <strong>Never use RobbingHood</strong></p>\n</div><!-- SC_ON -->",
  "score": 204,
  "permalink": "/r/CryptoCurrency/comments/p4fh8r/unpopular_opinion_its_not_bad_to_keep_your_coins/",
  "subreddit": "CryptoCurrency",
  "id": "p4fh8r",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "For some people the chances of them losing their private keys is higher than the\nexchange getting hacked.\n\nOf course, storing your crypto on a wallet is better if you are able to manage\nit well.\n\nIf not, then keeping your coins in an exchange is not a bad idea.\n\nBut there is one important rule you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人によっては、取引所がハッキングされるよりも、秘密鍵を紛失する可能性の方が高い場合もあります。\n交換所がハッキングされることよりも、秘密鍵を失う可能性の方が高いという人もいるでしょう。\n\nもちろん、自分の暗号をウォレットに保管する方が、しっかりと管理できるのであればそれに越したことはありません。\nもちろん、ウォレットに暗号を保管するのは、それをうまく管理できる人なら良いでしょう。\n\nそうでなければ、取引所にコインを保管しておくことは悪い考えではありません。\n\nしかし、一つ重要なルールがあります。",
      "title": "不人気な意見ですが コインを取引所に預けるのは悪いことではない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对于一些人来说，他们丢失私钥的机会比交易所被黑的机会还要大。\n交易所被黑。\n\n当然，如果你能很好地管理你的加密货币，将其储存在钱包里会更好。\n妥善管理。\n\n如果没有，那么将你的硬币存放在交易所也不是一个坏主意。\n\n但有一个重要的规则，你...",
      "title": "不受欢迎的意见。把你的硬币放在交易所也不错"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於一些人來說，他們丟失私鑰的機會比交易所被黑的機會還要大。\n交易所被黑。\n\n當然，如果你能很好地管理你的加密貨幣，將其儲存在錢包裏會更好。\n妥善管理。\n\n如果沒有，那麼將你的硬幣存放在交易所也不是一個壞主意。\n\n但有一個重要的規則，你...",
      "title": "不受歡迎的意見。把你的硬幣放在交易所也不錯"
    }
  ]
}