{
  "author": "TNGSystems",
  "original_created_utc": 1655457075,
  "title": "Clearly unafraid of the SEC bending him over a barrel, Safemoon CEO once again steals 28,879 BNB and uses it to market manipulate the price of V2.",
  "created_utc": 1655508665,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m on mobile so I really CBA with fancy formatting.  &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://media.discordapp.net/attachments/923316772227153959/986718938215903263/C9FE02B1-C8B1-4E17-8496-E0EE59C7DB48.jpg?width=309&amp;amp;height=667\"&gt;Safemoon spent the better part of a year advertising that their LP’s are locked and therefore it’s “Safe” and “unruggable”.&lt;/a&gt;  &lt;/p&gt;\n\n&lt;p&gt;In fact, that’s the original Dev saying how the LP’s are locked. There is one locked LP which is faithfully locked for a couple more years, but the other LPs are getting drained constantly.  &lt;/p&gt;\n\n&lt;p&gt;Safemoon is a token with no revenue stream. The devs aren’t selling anything to anyone, and at the start of this year, they changed the tax system so they now receive 1% of all transactions. However, the wallet that receives those 1% has barely been withdrawn from, yet all the devs live lavish lives with McLarens, mansions, private jets, gold-plated steaks… so where did all that money come from?  &lt;/p&gt;\n\n&lt;p&gt;Rhetorical questioning aside, here’s the nuts and bolts of what’s going on.  &lt;/p&gt;\n\n&lt;p&gt;John Karony is taking thousands of BNB (worth over $6m today) out of the V1 LP and using it to buy V2 tokens on the open market. There are several problems with this:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Safemoon are custodians of the LP, they do not own the LP contents because they didn’t pay for those tokens directly. Therefore it is not their money to spend and this will be seen as theft. &lt;/li&gt;\n&lt;li&gt;By buying tokens on the open market, they are pumping the price in a clear manipulation effort. This is the second time John has done this while the price of Safemoon has gone terminal. &lt;/li&gt;\n&lt;li&gt;it gives whales a huge heads up to sell their bags at a massive short-term profit. Which is exactly what happened the first time.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;it fools new investors into thinking it’s a real pump, they will buy in and get rekt.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;John is buying himself tokens&lt;/strong&gt;. He’s not just transferring BNB. He’s buying himself millions of dollars worth of Safemoon tokens. &lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Here’s the wallet purchasing the funds with the LP.  Every few seconds it buys another 3.2BNB (a stupid marketing gimmick they have) of Safemoon in the open market. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://bscscan.com/address/0xff53c5fe4d9865fe9c6fa4866f1b4647d4125c82\"&gt;https://bscscan.com/address/0xff53c5fe4d9865fe9c6fa4866f1b4647d4125c82&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The CEO has the capability of giving himself tokens from the deployer, pairing them with V1 BNB, and then using the AddLiquidity function to just put the V1 liquidity into the V2 pool, but of course he doesn’t because he wants to enrich himself at Safemoon holders expense.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The US Securities Exchange Act defines market manipulation as &amp;quot;transactions which create an artificial price or maintain an artificial price for a tradable security&amp;quot;. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is quite a clear violation of SEC Market Manipulation rules, and Safemoon &lt;strong&gt;DEFINITELY&lt;/strong&gt; falls under SEC’s guidelines of a security.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The SEC uses something called “the Howey Test” to determine whether or not something qualifies as being a security. The test has a four-part parameter:  &lt;/p&gt;\n\n&lt;p&gt;Investment of money… meaning that someone has invested in goods or services&lt;/p&gt;\n\n&lt;p&gt;In a “common enterprise”… meaning that investor’s funds are either interwoven (horizontal commonality) or there’s a direct correlation between the promotion of the investment and its success or failure (vertical commonality)&lt;/p&gt;\n\n&lt;p&gt;With an “expectation of profit”… an expectation of profits can be either from fixed returns or capital appreciation&lt;/p&gt;\n\n&lt;p&gt;“Solely on the efforts of others”… meaning that if any profit involved stems from the efforts of the people who promoted the investment, it fulfills the fourth part of the Howey Test&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;As you can see, Safemoon fails (or passes?) the Howey Test handsomely.  &lt;/p&gt;\n\n&lt;p&gt;So, speculation time, why would the CEO do this? Does he want an SEC investigation as a good reason to shut the token down now he’s made his millions? Just a reminder that Safemoon has not delivered one single product from their roadmap apart from the wallet which is entirely unremarkable, and a swap which has poor functionality and only lists other shitcoins.  &lt;/p&gt;\n\n&lt;p&gt;Because not only does Safemoon fail the Howey test, they’re also inviting an investigation AND risking huge fines / jail time for market manipulation, AND they’re doing this in the midst of THREE Class Action Lawsuits (two of which have been consolidated and a judge has been appointed… meaning… it’s going to court!!).  &lt;/p&gt;\n\n&lt;p&gt;You could make a risky play and try and get in to make profit until the address runs out of BNB, BUT, there are well over 100 whales with tens of millions of tokens who are clamouring for an exit. Don’t be their exit liquidity. Plus, it’s Safemoon. Ew, and you need to make over 23% profit just to break even!!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 304,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/y_wApeZFCYF3lz1WZBDEO85vcFUjutIIZrND9mreBko.jpg?auto=webp&amp;s=eb010248ac9353ddcfad0d7ebb298a8420856aa8",
          "width": 309,
          "height": 667
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/y_wApeZFCYF3lz1WZBDEO85vcFUjutIIZrND9mreBko.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=907bb9ac535566f1b636d45bf8e0493f6284e64c",
            "width": 108,
            "height": 216
          },
          {
            "url": "https://external-preview.redd.it/y_wApeZFCYF3lz1WZBDEO85vcFUjutIIZrND9mreBko.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=4eccae668233631926b87f7baa2831350de4632a",
            "width": 216,
            "height": 432
          }
        ],
        "variants": {},
        "id": "_XsJspEZjf_UsVELDqC7rqrUe7AzJpHI6niHDN1M33I"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/ve8wl8/clearly_unafraid_of_the_sec_bending_him_over_a/",
  "subreddit": "CryptoCurrency",
  "id": "ve8wl8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m on mobile so I really CBA with fancy formatting.\n\nSafemoon spent the better part of a year advertising that their LP’s are locked\nand therefore it’s “Safe” and “unruggable”.\n[https://media.discordapp.net/attachments/923316772227153959/986718938215903263/C9FE02B1-C8B1-4E17-8496…"
}