{
  "author": "whatarewedoing91",
  "original_created_utc": 1637411760,
  "title": "The word Homosexuality was falsely translated back in 1946.",
  "created_utc": 1637422584,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In 1946 a group of men got together to retranslate the bible and make the Revised Standard Version, RSV. \nWhen they got to 1 Corinthians 6:9 they translated the last Greek word in that verse to Homosexuality:</p>\n\n<p>1 Corinthians 6:9 (ESV): 9 Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived: neither the sexually immoral, nor idolaters, nor adulterers, nor men who practice homosexuality,\n(I know this is ESV and not RSV. Will explain later).</p>\n\n<p>This was the first and only time the English word homosexuality has appeared in both the new and old testament. </p>\n\n<p>Once they released the RSV, a seminary student wrote to the head of the RSV translation team, Luther Allan Weigle, and told him that he thought they made a mistake translating that word. According to that student this Greek word is very rare and only appears in all Greek transcripts 100 times, and when it does it better translates to &quot;Sexual Pervert.&quot; Luther Weigle wrote back and agreed that they had made a mistake, but that he couldn&#39;t make any edits for ten years.</p>\n\n<p>Currently the RSV does use the word sexual pervert, but as the ESV version above shows and other versions of the bible show that word has stuck and hasn&#39;t gone away. </p>\n\n<p>Questions:\n1) I have been a Christian my whole life and never heard this story. Supposedly the Yale archives has these letters between the student and Luther Weigle. What&#39;s your take on this story? Is it accurate, did I miss anything or miss represent something?\n2) To the Greek scholars out there did they make a mistake translating that word? Not being a Greek scholar, how could I check this myself?\n3) If I wanted to see the primary sources of those letters between the student and Luther Weigle would I need to travel to Yale, or is there a way to check online?</p>\n\n<p>Thanks!</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/AskHistorians/comments/qy4qft/the_word_homosexuality_was_falsely_translated/",
  "subreddit": "AskHistorians",
  "id": "qy4qft",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In 1946 a group of men got together to retranslate the bible and make the\nRevised Standard Version, RSV. When they got to 1 Corinthians 6:9 they\ntranslated the last Greek word in that verse to Homosexuality:\n\n1 Corinthians 6:9 (ESV): 9 Or do you not know that the unrighteous will not\ninherit the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1946年に男性グループが集まり、聖書を再翻訳して、「改訂標準聖書」を作りました。\nRSV（Revised Standard Version）です。コリント人への手紙6章9節を読んだとき、彼らはその節の最後のギリシャ語を\nその節の最後のギリシャ語を「同性愛」と訳しました。\n\n1 コリント 6:9 (ESV): 9 あるいは、あなたがたは、不義の者は、...を継がないことを知らないのか。\n受け継ぐことができないことを知らないのですか。",
      "title": "Homosexualityという言葉は、1946年に誤って翻訳されました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "1946年，一群人聚集在一起，重新翻译圣经，并制作了\n修订的标准版本，RSV。当他们读到哥林多前书6:9时，他们\n他们把那节经文中的最后一个希腊字翻译成同性恋。\n\n哥林多前书6:9 (ESV): 9 或者你们不知道不义的人不会\n继承......。",
      "title": "同性恋这个词早在1946年就被错误地翻译了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "1946年，一羣人聚集在一起，重新翻譯聖經，並製作了\n修訂的標準版本，RSV。當他們讀到哥林多前書6:9時，他們\n他們把那節經文中的最後一個希臘字翻譯成同性戀。\n\n哥林多前書6:9 (ESV): 9 或者你們不知道不義的人不會\n繼承......。",
      "title": "同性戀這個詞早在1946年就被錯誤地翻譯了。"
    }
  ]
}