{
  "author": "vitaminBTC",
  "the_new_excerpt": "so I said-\n\n\n\nYou are totally correct, I agree fully. It is not because Bitcoin is\nappreciating in value that is why it will become the base value holder for the\nentire future of world commerce. The price appreciation is just the market\nrecognizing over time that Bitcoin is a standalone system…",
  "original_created_utc": 1614903538,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以我说\n\n\n\n你说的完全正确，我完全同意。这不是因为比特币是\n升值，这就是为什么它将成为基本价值持有人的原因。\n整个世界商业的未来。价格升值只是市场\n随着时间的推移，认识到比特币是一个独立的系统... ...",
      "title": "然后那个人说，不能因为某样东西升值了，就认为它是整个未来世界商业的基础价值持有者....。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我說\n\n\n\n你說的完全正確，我完全同意。這不是因爲比特幣是\n升值，這就是爲什麼它將成爲基本價值持有人的原因。\n整個世界商業的未來。價格升值只是市場\n隨着時間的推移，認識到比特幣是一個獨立的系統... ...",
      "title": "然後那個人說，不能因爲某樣東西升值了，就認爲它是整個未來世界商業的基礎價值持有者....。"
    }
  ],
  "title": "and then the guy said, just because something appreciates in value, doesn’t make it the base value holder for the entire future of world commerce....",
  "created_utc": 1614929429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>so I said-</p>\n\n<p>&#x200B;</p>\n\n<p>You are totally correct, I agree fully. It is not because Bitcoin is appreciating in value that is why it will become the base value holder for the entire future of world commerce. The price appreciation is just the market recognizing over time that Bitcoin is a standalone system outside of the world of central banking and finance capable of final settlement without concern for borders, apolitical and neutral, permissionless and nearly frictionless, open for transactions 24/7/365 and with open markets every second of the day with a bid and an ask in practically every currency pair, free from government manipulation and debasement. (PS did you know that the stock market is open 6.5 hours a day, 5 days a week, or 32.5 hours per week, ie - open only (7x24=168) 32.5/168, just under 20% of the time, not including holidays or circuit breaks. That means every year of Bitcoin trading is actually 5+ years of stock market trading)</p>\n\n<p>The problem with comparing Bitcoin to the massive list of companies/commodities/currencies that have shot way up before coming crashing back down is, how many of those experienced massive drawdowns, were left for dead, and then they rose again to even higher levels than ever thought possible before? Its crashed, and I mean CRASHED, about a dozen times with 80% or more drawdowns -- curiously though, always at higher lows. And here we are somehow, scraping $50k a coin, 900 Billion dollars worth of value created out of uhhh - a bit of ingenious code and a transparent ledger.</p>\n\n<p>The question you must ask yourself is, why? Why does it not die? It has every reason to! No other example comes to mind of anything coming back from the dead once, let alone multiple times.</p>\n\n<p>Bitcoin is a protocol layer on top of which the application layer rests. The only comparable example is TCP/IP - otherwise known as, the internet. The internet digitized and democratized information- it is now in the same power as you and I as someone with access to the world&#39;s best minds to find out whatever we want at the absolute cost of ZERO. Bitcoin is the digitization of money, it is the democratization of money. Today only the privileged in first world countries can have access to bank accounts, credit cards, checkbooks... To send a wire internationally you can pay $35 and wait a couple of days, that is if the country you are sending to is a country your country is down with and the amount of money does not raise any eyebrows in compliance departments.</p>\n\n<p>But we are now in the process of seeing the transformation that will allow any person anywhere the ability to send money unfettered, without questions, without unreasonable fees, nearly instantaneously, from Istanbul to Venezuela if that is where their family members live, on a Saturday, at 11PM, and the person receiving it is not charged extortion fees, or bullied, or marked, or followed, or known to have received any value whatever.</p>\n\n<p>How much is something like that worth?</p>\n\n<p>So in the end if price is all you see, there is a reason for it, it is the iceberg under the surface that you are not seeing, this irresistible, unstoppable force that has been released into the world without hope of curtailing it no matter how much those who control the money supply might try.</p>\n\n<p>And that is because Bitcoin, without firing a single round and without spilling a drop of blood, has forever placed beyond the reach of man the ability to manipulate and control the money. It is a voluntary system with clearly defined unchangeable rules (21M BTC, Nodes, Proof of Work, Difficulty adjustment, permissionless, non-sovereign, neutral, Supply schedule set in stone for the next hundreds of years) that if you would like to participate in, you are more than welcome to. If you decide you don&#39;t like it, you may sell it and leave. And without a CEO, marketing team, or coercion to transact in it as in FIAT, it has made people believe in it to the point of it being today one of the top 15 companies/ commodities/currencies with the highest of market caps, and it is the only one that looks bent on rising the ranks faster than any of the others. And for the first time in its history the macro external outlook has made it look by comparison, FOR THE FIRST TIME, as a desirable place to park value by those with value to park, accumulating enough liquidity to interest public companies. Validation for the thesis subtly embedded in the first block, ambitious and ridiculous in its scope and imagination, PLAYING OUT IN REAL TIME, earning respect in the eyes of the most serious of capital allocators.</p>\n\n<p>And isn&#39;t it interesting that as the price appreciates, it actually becomes more useful and valuable, a better network, more reachable to bigger and bigger entities? It is the world&#39;s most fine-tuned positive feedback loop ever witnessed. Created by someone (anonymous of course, how else!) who understood this needed to be a public utility (as in water or electricity) and never cashed in on their deca-Billions! IS YOUR MIND BLOWN YET</p>\n\n<p>Bitcoin is in the envious position of having time on its side. Everything else feels like it is borrowing against the future at ever-steepening costs to attempt to keep the charade going for another day. Short term gain, long term pain. Every decision at a corporate and government level today is made with the short term in mind, without paying a lick of mind to the long term. Bitcoin just mines another block. And another one. Miners keep dedicating to it more hashpower. It gets stronger and more secure. Monetary policy automatically tightens every 210,000 blocks/ approx every 4 years. Price rises. And the loop goes on.</p>\n\n<p>With this scenario as laid before you, in the long term, how does this all play out from here?</p>\n\n<p>Bitcoin in the end, is an unalienable right. Like water. Like electricity. Like the internet, arguably.</p>\n\n<p>because... We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness. And that includes freedom of monetary opression. For every human being on the planet, INDISCRIMINATELY, let freedom ring.</p>\n</div><!-- SC_ON -->",
  "score": 319,
  "permalink": "/r/Bitcoin/comments/lxzfmz/and_then_the_guy_said_just_because_something/",
  "subreddit": "Bitcoin",
  "id": "lxzfmz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542567857
}