{
  "author": "bawdyanarchist",
  "the_new_excerpt": "By percentage, what is your actual usage of any of these shitcoins for real\neconomic exchange as a currency? And no, cashing out to fiat doesn't count. What\nreal goods and services have you actually purcahsed with crypto? I'm gonna guess\nfor the vast majority of you, it's pretty close to zero.\n\nDo…",
  "original_created_utc": 1619409674,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これらのコインを実際に通貨として使用している割合はどのくらいですか？\n通貨として経済的に交換していますか？不換紙幣へのキャッシュアウトはカウントされません。どのような\n実際に暗号を使って購入した商品やサービスは？推測ですが\n大多数の人はゼロに近いでしょうね\n\nそうだな...",
      "title": "暗号通貨に「通貨」は存在しないし、存在したこともない"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "按百分比计算，你对这些狗屎币的实际使用量是多少？\n作为一种货币进行经济交换？不，兑现成法币不算。哪些\n你真正用加密货币购买过哪些真正的商品和服务？我猜想\n对于你们中的绝大多数人来说，这都是非常接近于零的。\n\n做...",
      "title": "加密货币中没有 \"货币 \"了，而且几乎没有了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "按百分比計算，你對這些狗屎幣的實際使用量是多少？\n作爲一種貨幣進行經濟交換？不，兌現成法幣不算。哪些\n你真正用加密貨幣購買過哪些真正的商品和服務？我猜想\n對於你們中的絕大多數人來說，這都是非常接近於零的。\n\n做...",
      "title": "加密貨幣中沒有 \"貨幣 \"了，而且幾乎沒有了"
    }
  ],
  "title": "There's no \"Currency\" Left in Cryptocurrency, and There Hardly Ever Was",
  "created_utc": 1619418831,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>By percentage, what is your <em>actual</em> usage of any of these shitcoins for real economic exchange as a currency? And no, cashing out to fiat doesn&#39;t count. What <em>real goods and services</em> have you actually purcahsed with crypto? I&#39;m gonna guess for the vast majority of you, it&#39;s pretty close to zero.</p>\n\n<p>Do the shitcoins you&#39;re holding have these properties, REQUIRED to function as a currency:</p>\n\n<ul>\n<li>Divisibility</li>\n<li>Durability</li>\n<li>Portability</li>\n<li>FUNGIBILITY </li>\n<li>Recognizability</li>\n<li>Privacy</li>\n<li>Limited supply</li>\n</ul>\n\n<p>If it doesn&#39;t have those qualities, it&#39;s not money. So no, your transparent chain, premined, heavy inflation, huge fees per transaction, barely functional network, is NOT currency. They&#39;re gambling tokens, and you people have a gambling problem. You&#39;re not &quot;revolutionizing paradigms,&quot; you&#39;re not &quot;fighting the banks,&quot; you&#39;re not doing anything other than speculate on garbage which will never be used as an actual currency.</p>\n\n<p>And WHEN this bubble pops, and you lose 90% of your paper wealth, you will have deserved it for being equally as greedy as the banks you hate, but with a much higher level of ignorance than those parasites. Now downvote me.</p>\n</div><!-- SC_ON -->",
  "score": 610,
  "permalink": "/r/CryptoCurrency/comments/myp3nt/theres_no_currency_left_in_cryptocurrency_and/",
  "subreddit": "CryptoCurrency",
  "id": "myp3nt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776210464
}