{
  "author": "deevee12",
  "the_new_excerpt": "> “Tesla has repeatedly rolled out crude beta features, some of which can put\n> people’s safety at risk and shouldn’t be used anywhere but on a private test\n> track or proving ground,” says William Wallace, manager of safety policy for\n> Consumer Reports.\n> \n> Tesla says these features will improve…",
  "original_created_utc": 1621556259,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "> テスラは粗悪なベータ版機能を繰り返し提供してきましたが、その中には人々の安全を脅かすものもあります。\n> テスラは、人々の安全を脅かす可能性のある粗悪なベータ機能を繰り返し提供してきましたが、これはプライベートなテストコースや実験場以外では使用すべきではありません。\n> コンシューマーレポートの安全政策担当マネージャー、ウィリアム・ウォレスは\n> コンシューマーレポート社の安全政策担当マネージャー、ウィリアム・ウォレス氏は次のように述べています。\n> \n> テスラによれば、これらの機能により...",
      "title": "コンシューマーレポートがテスラの完全自動運転機能について厳しいレビューを発表"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "> \"特斯拉多次推出粗糙的测试版功能，其中一些功能可能会使\n> 人们的安全受到威胁，除了在私人测试场或试验场，不应该在其他地方使用。\n>轨道或试验场，\"《消费者报告》的安全政策经理威廉-华莱士说。\n> 消费者报告》的安全政策经理威廉-华莱士说。\n> \n> 特斯拉表示，这些功能将改善...",
      "title": "消费者报告》发表对特斯拉全面自动驾驶能力的严厉评论"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "> \"特斯拉多次推出粗糙的測試版功能，其中一些功能可能會使\n> 人們的安全受到威脅，除了在私人測試場或試驗場，不應該在其他地方使用。\n>軌道或試驗場，\"《消費者報告》的安全政策經理威廉-華萊士說。\n> 消費者報告》的安全政策經理威廉-華萊士說。\n> \n> 特斯拉表示，這些功能將改善...",
      "title": "消費者報告》發表對特斯拉全面自動駕駛能力的嚴厲評論"
    }
  ],
  "title": "Consumer Reports publishes scathing review of Tesla’s Full Self-Driving Capability",
  "created_utc": 1621568960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p>“Tesla has repeatedly rolled out crude beta features, some of which can put people’s safety at risk and shouldn’t be used anywhere but on a private test track or proving ground,” says William Wallace, manager of safety policy for Consumer Reports. </p>\n\n<p>Tesla says these features will improve over time, but at this point they don’t seem worth the hefty $8,000 price tag.</p>\n\n<p>“It seems like Tesla is focused on being the automaker with the most features rather than ensuring that the features work well,” Funkhouser says. “Its time and energy could be better spent on developing a driver monitoring system for Autopilot to significantly improve the safety and usefulness of that system.”</p>\n</blockquote>\n\n<p><a href=\"https://www.consumerreports.org/autonomous-driving/tesla-full-self-driving-capability-review-falls-short-of-its-name/\">https://www.consumerreports.org/autonomous-driving/tesla-full-self-driving-capability-review-falls-short-of-its-name/</a></p>\n</div><!-- SC_ON -->",
  "score": 138,
  "permalink": "/r/stocks/comments/nhfij4/consumer_reports_publishes_scathing_review_of/",
  "subreddit": "stocks",
  "id": "nhfij4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197388320
}