{
  "author": "Tehteddypicker",
  "original_created_utc": 1649209214,
  "title": "How does people like Matt Gaetz remain in the house of representatives?",
  "created_utc": 1649244811,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;From what I can gather he has been caught multiple times with underage people, he constantly contradicts himself and is usually against anything that seems totally sane. He voted against a sex trafficking law, against sactions against russia and against capping the price of insulin at 35 dollars. Obviously everyone has the right to an opinion but when youre one of the very few within the republicans with some of these beliefs surely some bells has to ring?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/txasfy/how_does_people_like_matt_gaetz_remain_in_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "txasfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "From what I can gather he has been caught multiple times with underage people,\nhe constantly contradicts himself and is usually against anything that seems\ntotally sane. He voted against a sex trafficking law, against sactions against\nrussia and against capping the price of insulin at 35 dollars.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の知る限り、彼は何度も未成年者と一緒にいるところを捕まっています。\n彼は常に矛盾しており、普段は何でも反対しているようです。\n全くまともです。彼は、性的人身売買法に反対し、対外政策に反対しました。\nロシア、インスリンの価格を35ドルにすることに反対...。",
      "title": "マット・ゲッツのような人が、どうして下院に残っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，他曾多次与未成年的人一起被抓。\n他经常自相矛盾，而且通常反对任何看起来完全理智的事情。\n完全理智的事情。他投票反对性交易法，反对针对俄罗斯的行动。\n他还反对将胰岛素的价格上限定在35美元，....。",
      "title": "像Matt Gaetz这样的人是如何留在众议院的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，他曾多次與未成年的人一起被抓。\n他經常自相矛盾，而且通常反對任何看起來完全理智的事情。\n完全理智的事情。他投票反對性交易法，反對針對俄羅斯的行動。\n他還反對將胰島素的價格上限定在35美元，....。",
      "title": "像Matt Gaetz這樣的人是如何留在衆議院的？"
    }
  ]
}