{
  "author": "pickmeboi",
  "original_created_utc": 1654205309,
  "title": "How do I not let myself slip into inceldom?",
  "created_utc": 1654227051,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I(21M) find myself flipping back and forth between trying to be an ally to women and believing in TRP or BP stuff.&lt;/p&gt;\n\n&lt;p&gt;I often feel frustrated and bitter towards women a lot because of my failures in dating. I’ve never had a girl like me and I’m still a virgin at 21 both of these make me feel awful about myself. I wouldn’t say that I hate women on the level of other incels, but I’d be lying if I said I didn’t often feel resentment.&lt;/p&gt;\n\n&lt;p&gt;I find myself wondering why I can’t just be a chad and why women are so shallow when I know that’s not exactly rational. I have really shitty self esteem, and have been shown and in some cases have sought out incel beliefs. I’ve looked through incel forums since I was 14.&lt;/p&gt;\n\n&lt;p&gt;I feel like I constantly see confirmation of things about women I’ve read online through the girls around me. Specifically in my close female friends and female bullies.&lt;/p&gt;\n\n&lt;p&gt;I really don’t want to be an incel but I feel myself sliding on a slippery slope to that.&lt;/p&gt;\n\n&lt;p&gt;How do I not be one?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 430,
  "permalink": "/r/TooAfraidToAsk/comments/v3je88/how_do_i_not_let_myself_slip_into_inceldom/",
  "subreddit": "TooAfraidToAsk",
  "id": "v3je88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I(21M) find myself flipping back and forth between trying to be an ally to women\nand believing in TRP or BP stuff.\n\nI often feel frustrated and bitter towards women a lot because of my failures in\ndating. I’ve never had a girl like me and I’m still a virgin at 21 both of these\nmake me feel awful…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私(21M)は、女性の味方であろうとすることの間を行ったり来たりしている自分に気づきました。\nとTRPやBPを信じたりしています。\n\n私は、出会い系での失敗から、女性に対して不満や辛さを感じることがよくあります。\nデートで 21歳にもなって童貞であること、好きな女性がいないこと。\nを考えると、とても嫌な気持ちになります...。",
      "title": "どうすればインセンドに陥らないか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（21岁）发现自己在试图成为妇女的盟友和相信TRP或BAT之间来回摇摆。\n和相信TRP或BP的东西。\n\n由于我在约会方面的失败，我经常对女性感到沮丧和痛苦。\n约会。我从来没有一个女孩喜欢我，而且我在21岁时还是个处女，这两点都让我感到很糟糕......\n让我感觉很糟糕...",
      "title": "我怎样才能不让自己滑向不稳定？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（21歲）發現自己在試圖成爲婦女的盟友和相信TRP或BAT之間來回搖擺。\n和相信TRP或BP的東西。\n\n由於我在約會方面的失敗，我經常對女性感到沮喪和痛苦。\n約會。我從來沒有一個女孩喜歡我，而且我在21歲時還是個處女，這兩點都讓我感到很糟糕......\n讓我感覺很糟糕...",
      "title": "我怎樣才能不讓自己滑向不穩定？"
    }
  ]
}