{
  "author": "Feed-Me-Your-Tron",
  "the_new_excerpt": "Ok ok... I understand the buying and selling of items in games because well...\nthey have a purpose. You can use them to enhance your gaming experience...\n\nI understand music.. I buy an album and then forever own it. If you wipe your\nhard drive you can recover it without having to buy it again..\n\nI…",
  "original_created_utc": 1622896026,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "OK OK...。ゲーム内でのアイテムの売買を理解しているのは、まあ...\nそれには目的があるからです。ゲームをより楽しむために使うことができるからです。\n\n私は音楽を理解しています。私はアルバムを購入して、それを永遠に所有します。もしハードディスクを消去しても\nハードドライブを消去しても、再度購入しなくても回復できます...。\n\nI...",
      "title": "NFTのアートブームがわからないのは私だけでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，好吧... 我理解游戏中物品的买卖，因为......\n他们有一个目的。你可以用它们来提高你的游戏体验...\n\n我理解音乐。我买了一张专辑，然后永远拥有它。如果你擦掉你的\n你可以恢复它，而不需要再次购买它。\n\nI...",
      "title": "难道只有我一个人不明白NFT艺术的热潮吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，好吧... 我理解遊戲中物品的買賣，因爲......\n他們有一個目的。你可以用它們來提高你的遊戲體驗...\n\n我理解音樂。我買了一張專輯，然後永遠擁有它。如果你擦掉你的\n你可以恢復它，而不需要再次購買它。\n\nI...",
      "title": "難道只有我一個人不明白NFT藝術的熱潮嗎？"
    }
  ],
  "title": "Am I the only one who doesn't get the NFT art craze?",
  "created_utc": 1622913603,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Ok ok... I understand the buying and selling of items in games because well... they have a purpose. You can use them to enhance your gaming experience... </p>\n\n<p>I understand music.. I buy an album and then forever own it. If you wipe your hard drive you can recover it without having to buy it again..</p>\n\n<p>I don&#39;t understand why on earth people pay huge money for gifs and jpgs. What do you do with it? Set it as your wallpaper? </p>\n\n<p>I&#39;m being a bit facetious, I understand the concept of collectables but I don&#39;t see how it translates into digital form. If I buy a Rembrandt there&#39;s that knowledge its the exact canvas he worked on.. the texture, wear and tear, the history etc. In the digital world, the original has all the same properties as a replica. Why is one more special than the other?</p>\n\n<p>Am I the only one?</p>\n</div><!-- SC_ON -->",
  "score": 790,
  "permalink": "/r/CryptoCurrency/comments/nsuobu/am_i_the_only_one_who_doesnt_get_the_nft_art_craze/",
  "subreddit": "CryptoCurrency",
  "id": "nsuobu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404881322
}