{
  "author": "SSIIUUUUUUU",
  "original_created_utc": 1628319658,
  "title": "Crypto is a threat to traditional economy - Says the guys that are running the very same economy to ground by screwing over poor and bending over for the rich",
  "created_utc": 1628340730,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a way, Crypto is helping atleast a fraction of lower/middle class population (although right now, I agree, an even bigger fraction were screwed by shitcoins, fomo and rugpulls) and they don&#39;t want it, they want to screw us all over and make us dependent on them as we&#39;ve been since our birth.</p>\n\n<p>Governments ?\nUS (or any other government) will do everything but tax the rich lol. Easiest way to solve all socio-economic problems but they would bend over for these billionaires and won&#39;t do that. They would happily commit genocides, screw over their own middle/lower class citizens, and go to war and risk their own soldiers lives but won&#39;t do anything that would actually help their poor.</p>\n\n<p>They would gladly allow the rich to transfer and stake most of their wealth and evade taxes by exploiting loopholes in their dumb system, but wouldn&#39;t allow the average Joe to make it in the world by working hard. Tax rates start screwing us more and more, the moment we start earning slightly increased sum of money, but guys that own large corporations can evade because they don&#39;t get any salary on paper, created some side business abroad and invested their money in it.</p>\n\n<p>Banks? \nTake a small student loan, take a home loan, not only will they make it as difficult as possible for you to get one and they&#39;ll hunt you till the ends of earth to make you pay up. But for billionaires? They&#39;ll happily offer all their money with little or no collateral to save failing businesses and then when they screw up, come back and charge us more to get back their losses. </p>\n\n<p>For example when Glazers bought Manchester United football club, it was fully financed by a bank, and collateral was some club properties that they didn&#39;t own. Basically, buy the club and then give us collateral</p>\n\n<p>They don&#39;t want us to prosper whilst being independent of them.</p>\n</div><!-- SC_ON -->",
  "score": 295,
  "permalink": "/r/CryptoCurrency/comments/ozokab/crypto_is_a_threat_to_traditional_economy_says/",
  "subreddit": "CryptoCurrency",
  "id": "ozokab",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a way, Crypto is helping atleast a fraction of lower/middle class population\n(although right now, I agree, an even bigger fraction were screwed by shitcoins,\nfomo and rugpulls) and they don't want it, they want to screw us all over and\nmake us dependent on them as we've been since our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある意味、Cryptoは少なくとも一部の低・中流階級の人々を助けています。\n(現在は、さらに多くの人々がクソコインに騙されていることに同意しますが。\n彼らはそれを望んでおらず、私たち全員をねじ伏せて、私たちを依存させようとしています。\nそして、彼らはそれを望まず、私たち全員をねじ伏せ、私たちが昔からそうであったように彼らに依存するようにしたいのです。",
      "title": "暗号は伝統的な経済への脅威である - 貧乏人を騙し、金持ちのために屈して、まさに同じ経済を動かしている人たちが言う。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从某种程度上说，加密货币至少在帮助一部分中下阶层的人\n(虽然现在，我同意，更大的一部分人被狗屎币坑了。\nfomo和rugpulls），而他们并不希望这样，他们想把我们都搞垮，让我们像我们一样依赖他们。\n让我们依赖他们，因为我们一直在......",
      "title": "加密货币是对传统经济的威胁--说这话的人正是那些通过坑害穷人和为富人弯腰的方式把经济搞垮的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從某種程度上說，加密貨幣至少在幫助一部分中下階層的人\n(雖然現在，我同意，更大的一部分人被狗屎幣坑了。\nfomo和rugpulls），而他們並不希望這樣，他們想把我們都搞垮，讓我們像我們一樣依賴他們。\n讓我們依賴他們，因爲我們一直在......",
      "title": "加密貨幣是對傳統經濟的威脅--說這話的人正是那些通過坑害窮人和爲富人彎腰的方式把經濟搞垮的人。"
    }
  ]
}