{
  "author": "LittleWompRat",
  "original_created_utc": 1645336341,
  "title": "How did gendered languages come to be? Who assigned genders to these random objects?",
  "created_utc": 1645363394,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By gendered languages, I mean languages that have genders for nouns like masculine, feminine, and neutral. &lt;/p&gt;\n\n&lt;p&gt;As someone whose native language is a non gendered language, learning gendered languages always confuse me. It&amp;#39;s very hard to memorize what genders that these objects have, especially since a lot of times they don&amp;#39;t have patterns.&lt;/p&gt;\n\n&lt;p&gt;But I&amp;#39;m curious. How did these concepts come to be? Who assigned genders to those objects?&lt;/p&gt;\n\n&lt;p&gt;Say, I&amp;#39;m a guy from 10k years ago who just found these unique objects that had never been found anywhere else. Should I just randomly call this object masculine and tell everyone else that this object is masculine?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 104,
  "permalink": "/r/AskHistorians/comments/swu5x1/how_did_gendered_languages_come_to_be_who/",
  "subreddit": "AskHistorians",
  "id": "swu5x1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By gendered languages, I mean languages that have genders for nouns like\nmasculine, feminine, and neutral.\n\nAs someone whose native language is a non gendered language, learning gendered\nlanguages always confuse me. It's very hard to memorize what genders that these\nobjects have, especially since a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "性別のある言語というのは、名詞に性別があるような言語のことです。\n男性型、女性型、中性型。\n\n性別に関係ない言語を母国語とする人間にとって、性別に関係なく学ぶことは\nの言語にはいつも困惑させられます。どのような性別があるのかを覚えるのは、とても大変なことです。\n特に、...",
      "title": "ジェンダーのある言語はどのようにして生まれたのか？誰がランダムなものに性別をつけたのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所谓性别化语言，我指的是对名词有性别的语言，如\n阳性、阴性和中性。\n\n作为一个母语是无性别语言的人，学习有性别的语言\n语言总是让我感到困惑。要记住这些物体的性别是什么，非常困难。\n物体有哪些性别，特别是由于一个...",
      "title": "性别化的语言是如何形成的？谁给这些随机的物体分配了性别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所謂性別化語言，我指的是對名詞有性別的語言，如\n陽性、陰性和中性。\n\n作爲一個母語是無性別語言的人，學習有性別的語言\n語言總是讓我感到困惑。要記住這些物體的性別是什麼，非常困難。\n物體有哪些性別，特別是由於一個...",
      "title": "性別化的語言是如何形成的？誰給這些隨機的物體分配了性別？"
    }
  ]
}