{
  "author": "777pen",
  "original_created_utc": 1645683987,
  "title": "Is it normal to feel grief after an abortion as a man?",
  "created_utc": 1645702443,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know that it’s normal to experience grief and mourning after an abortion or a miscarriage for the mother, but i’m (M18) the father and i’m being made to feel like i’m insensitive and selfish for grieving a baby i never held and never saw, even though the fact i never saw it is part of why i’m so upset. &lt;/p&gt;\n\n&lt;p&gt;Aborting it was the only option because of the mother’s mother, but it pains me to think about there being a part of me beginning to grow and me never being able to hold it or love it. &lt;/p&gt;\n\n&lt;p&gt;And i feel so dumb because it was probably the size of a small coin and wasn’t even a proper baby, so why do i feel like this? Is this normal?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/t03zm2/is_it_normal_to_feel_grief_after_an_abortion_as_a/",
  "subreddit": "NoStupidQuestions",
  "id": "t03zm2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know that it’s normal to experience grief and mourning after an abortion or a\nmiscarriage for the mother, but i’m (M18) the father and i’m being made to feel\nlike i’m insensitive and selfish for grieving a baby i never held and never saw,\neven though the fact i never saw it is part of why i’m so…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "中絶や手術をした後、悲しみや嘆きを経験するのは普通のことだと知っています。\n母親は流産しているのに、父親である私（M18)は、そのような気持ちにさせられています。\n抱いたことも見たこともない赤ん坊を悲しむなんて、無神経で自分勝手な人間のようだ。\n見たことがないという事実が、私がそうである理由の一部であるにもかかわらず、...",
      "title": "中絶後の悲しみを感じるのは男性として普通なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道堕胎或流产后经历悲痛和哀悼是正常的。\n流产的母亲，但我（M18）是父亲，而我却被指责为\n就像我对一个我从未抱过也从未见过的婴儿感到悲痛是不敏感和自私的。\n尽管我从未见过这个孩子，这也是我为什么如此......",
      "title": "作为一个男人，堕胎后感到悲痛是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道墮胎或流產後經歷悲痛和哀悼是正常的。\n流產的母親，但我（M18）是父親，而我卻被指責爲\n就像我對一個我從未抱過也從未見過的嬰兒感到悲痛是不敏感和自私的。\n儘管我從未見過這個孩子，這也是我爲什麼如此......",
      "title": "作爲一個男人，墮胎後感到悲痛是正常的嗎？"
    }
  ]
}