{
  "author": "Incorrect_passport",
  "original_created_utc": 1631193930,
  "title": "The SEC is not the right body to regulate crypto.",
  "created_utc": 1631215857,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not American so the SEC&#39;s intentions interest me only to a certain extent. However, I believe that the SEC&#39;s actions are not to protect cryptocurrencies users but rather the opposite and even if operating only on American territory, its actions have repercussions on the entire world of crypto market. </p>\n\n<p>I agree that regulation in the crypto world is needed if we aim to achieve better adoption levels but I don&#39;t think the SEC will ever be suitable for the role. </p>\n\n<p>What we would really need would be the establishment of a new governmental body or even better a global body in order to be able to regulate gorilla the crypto market with knowledge and without national interests </p>\n\n<p>I&#39;m pretty sure what I&#39;m saying at the moment is a complete utopia, however someday maybe ...</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/pkxrgz/the_sec_is_not_the_right_body_to_regulate_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "pkxrgz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm not American so the SEC's intentions interest me only to a certain extent.\nHowever, I believe that the SEC's actions are not to protect cryptocurrencies\nusers but rather the opposite and even if operating only on American territory,\nits actions have repercussions on the entire world of crypto…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はアメリカ人ではないので、SECの意図にはある程度しか興味がありません。\nしかし、私は、SECの行動は、暗号通貨のユーザーを守るためではなく、むしろ逆に\nユーザーを守るためではなく、むしろその逆で、たとえアメリカ国内だけで活動していたとしても\nアメリカ国内だけのことであっても、その行動は暗号の世界全体に影響を与えるものだと思います...",
      "title": "SECは、暗号を規制するのに適した機関ではありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不是美国人，所以美国证券交易委员会的意图我只在某种程度上感兴趣。\n然而，我认为SEC的行动不是为了保护加密货币\n用户，而是恰恰相反，即使只在美国境内运作。\n它的行动对整个加密货币世界产生了影响...",
      "title": "美国证券交易委员会不是监管加密货币的正确机构。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不是美國人，所以美國證券交易委員會的意圖我只在某種程度上感興趣。\n然而，我認爲SEC的行動不是爲了保護加密貨幣\n用戶，而是恰恰相反，即使只在美國境內運作。\n它的行動對整個加密貨幣世界產生了影響...",
      "title": "美國證券交易委員會不是監管加密貨幣的正確機構。"
    }
  ]
}