{
  "author": "rogerwil",
  "original_created_utc": 1628623902,
  "title": "What's the deal with the jungle-themed funerals for communist functionaries in the USSR?",
  "created_utc": 1628635957,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Montefiore mentiones it several times in passing, but i don&#39;t think he explained where that tradition is coming from. I recently watched &#39;State Funeral&#39; and the palm trees are very prominent around Stalin&#39;s casket viewing etc. </p>\n\n<p>This seems so strange, exotic, foreign, even inappropriate somehow, almost like an insider joke. Even back at Lenin&#39;s funeral, there seem to be banana plants placed around his coffin? (pictures aren&#39;t high def like with Stalin) Who came up with this? Is it a russian thing, is it a bolshevik thing or what&#39;s the meaning behind it?</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/AskHistorians/comments/p1wgh8/whats_the_deal_with_the_junglethemed_funerals_for/",
  "subreddit": "AskHistorians",
  "id": "p1wgh8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Montefiore mentiones it several times in passing, but i don't think he explained\nwhere that tradition is coming from. I recently watched 'State Funeral' and the\npalm trees are very prominent around Stalin's casket viewing etc.\n\nThis seems so strange, exotic, foreign, even inappropriate somehow,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "モンテフィオーレは何度か言及していますが、その伝統がどこから来ているのか説明していないように思います。\nその伝統がどこから来ているのかは説明していなかったと思います。最近、「ステイト・フューネラル」を見たのですが、ヤシの木が\nスターリンの棺の周りには椰子の木が非常に目立っていました。\n\nこれはとても奇妙で、エキゾチックで、外国のようで、どこか不謹慎な感じさえするのですが...。",
      "title": "ソ連の共産党幹部の葬儀がジャングルをテーマにしているのはどういうことだ？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Montefiore顺便提了几次，但我认为他没有解释。\n这个传统是从哪里来的。我最近看了《国葬》，斯大林灵柩周围的棕榈树非常突出。\n棕榈树在斯大林的灵柩周围非常突出，等等。\n\n这看起来很奇怪，有异国情调，很陌生，甚至有些不合适，...",
      "title": "苏联的共产主义职能部门以丛林为主题的葬礼是怎么回事？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Montefiore順便提了幾次，但我認爲他沒有解釋。\n這個傳統是從哪裏來的。我最近看了《國葬》，斯大林靈柩周圍的棕櫚樹非常突出。\n棕櫚樹在斯大林的靈柩周圍非常突出，等等。\n\n這看起來很奇怪，有異國情調，很陌生，甚至有些不合適，...",
      "title": "蘇聯的共產主義職能部門以叢林爲主題的葬禮是怎麼回事？"
    }
  ]
}