{
  "author": "skipflat",
  "the_new_excerpt": "So, I'm long baba both shares and calls, we had a decent run to $245 after\nsettlement was reached over anti-competitive practices with CCP. Settle back to\n$230 or so last week. Got earnings in early May it should be a catalyst for\ngrowth and in subsequent quarters. I don't believe it will be…",
  "original_created_utc": 1619353851,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "株とコールの両方でbabaをロングしていますが、CCPとの競争法に関する和解が成立した後、245ドルまでうまく行きました。\nCCPとの反競争的慣行に関する和解が成立した後、245ドルまで上昇しました。先週は230ドルほどに戻った。\n先週は230ドルほどに戻った。5月初旬に決算がありますが、これが成長のきっかけになるはずです。\n成長のきっかけになるはずです。私はそうは思いませんが・・・。",
      "title": "BABAです。悔しさはいつ終わるのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我做多巴巴的股票和看涨期权，在与CCP的反竞争行为达成和解后，我们有一个体面的运行到245美元。\n与CCP的反竞争行为达成了和解。上周又回到了\n上周230美元左右。5月初有收益，这应该是增长的催化剂。\n增长和后续季度的催化剂。我不相信这将是...",
      "title": "BABA。挫折感何时才能结束？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我做多巴巴的股票和看漲期權，在與CCP的反競爭行爲達成和解後，我們有一個體面的運行到245美元。\n與CCP的反競爭行爲達成了和解。上週又回到了\n上週230美元左右。5月初有收益，這應該是增長的催化劑。\n增長和後續季度的催化劑。我不相信這將是...",
      "title": "BABA。挫折感何時才能結束？"
    }
  ],
  "title": "BABA: When will the frustration end?",
  "created_utc": 1619364712,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, I&#39;m long baba both shares and calls, we had a decent run to $245 after settlement was reached over anti-competitive practices with CCP.  Settle back to $230 or so last week.  Got earnings in early May it should be a catalyst for growth and in subsequent quarters.  I don&#39;t believe it will be delisted, to much money at stake for exchanges to let that happen, plus wall street does not want to give up it&#39;s roll as a global financial hub.  The stock is cheap, relatively, but my frustration is not abiding.  I&#39;m still thinking we hit $300 plus in 2021, am I f&#39;ing crazy?</p>\n</div><!-- SC_ON -->",
  "score": 544,
  "permalink": "/r/stocks/comments/my7dfo/baba_when_will_the_frustration_end/",
  "subreddit": "stocks",
  "id": "my7dfo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215985
}