{
  "author": "xevioso",
  "the_new_excerpt": "Apparently the Order of Brothers of the German House of Saint Mary in Jerusalem,\nas the Teutonic Order is now known, currently operate a modern General Hospital\nwith all of the modern conveniences and expertise you might expect, in Friesach,\nAustria. It has an Internal Medicine department, a…",
  "original_created_utc": 1618865215,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサレムの聖マリアのドイツ人ハウスの兄弟たちの修道会らしいです。\nドイツのエルサレム聖母の家の兄弟たちは、現在、フリエザッハで、近代的な設備と専門知識を備えた近代的な総合病院を運営している。\n現在、オーストリアのフリーザッハで、近代的な総合病院を運営しています。\nオーストリア この病院には、内科、...",
      "title": "15世紀に精鋭の傭兵部隊として北欧を支配していたチュートン騎士団は、どのようにして今日、オーストリアのフリーザッハで近代的な総合病院を運営するに至ったのか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "显然，耶路撒冷的德国圣母院兄弟会。\n目前在弗里萨赫经营着一家现代化的综合医院。\n拥有你所期望的所有现代便利设施和专业知识，位于弗里萨赫。\n奥地利。它有一个内科部门，一个外科部门和一个妇科部门。",
      "title": "条顿骑士团是如何从15世纪以一支精锐的雇佣兵部队控制北欧大部分地区，到今天在奥地利弗里萨赫管理一家现代综合医院的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "顯然，耶路撒冷的德國聖母院兄弟會。\n目前在弗裏薩赫經營着一家現代化的綜合醫院。\n擁有你所期望的所有現代便利設施和專業知識，位於弗裏薩赫。\n奧地利。它有一個內科部門，一個外科部門和一個婦科部門。",
      "title": "條頓騎士團是如何從15世紀以一支精銳的僱傭兵部隊控制北歐大部分地區，到今天在奧地利弗裏薩赫管理一家現代綜合醫院的？"
    }
  ],
  "title": "How did the Teutonic Knights go from controlling much of northern Europe with an elite mercenary force in the 15th century to managing a modern General Hospital in Friesach, Austria today?",
  "created_utc": 1618917064,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Apparently the Order of Brothers of the German House of Saint Mary in Jerusalem, as the Teutonic Order is now known, currently operate a modern General Hospital with all of the modern conveniences and expertise you might expect, in Friesach, Austria.  It has an Internal Medicine department, a Department of Anaesthesiology and Intensive Care, and so on, staffed by modern medical professionals.</p>\n\n<p>How did the Teutonic Order go from being suppressed by the Nazis after the annexation of Austria in 1938 to adapting successfully to the modern world by running a hospital with their own Teutonic Order ambulances? (!)</p>\n\n<p>I post their website here only to show that I&#39;m not making this up: dokh.at</p>\n\n<p>This is mind-boggling to me, especially considering the fates of the Templar Knights, disbanded in 1312.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/mua524/how_did_the_teutonic_knights_go_from_controlling/",
  "subreddit": "AskHistorians",
  "id": "mua524",
  "is_self": true,
  "media": null,
  "is_video": false
}