{
  "author": "seldomsage",
  "the_new_excerpt": "I recently got back on Reddit after a long hiatus - the volatility in Gamestop\nand other names brought me back to r/wallstreetbets [/r/wallstreetbets] and\nr/stocks [/r/stocks].\n\nLately I have been doing some research on Cathie Wood's Ark ETFs and am quite\nalarmed by what I am seeing. I am by no…",
  "original_created_utc": 1614579141,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我最近回到Reddit上，经过长时间的休整--Gamestop的波动性。\n和其他名字把我带回了r/wallstreetbets[/r/wallstreetbets]和。\nr/stocks[/r/stocks]。\n\n最近我对凯西伍德的方舟ETF做了一些研究，很是\n被我看到的东西吓到了 我不是...",
      "title": "投资者要注意：$ARKK是一场等待发生的流动性灾难。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近回到Reddit上，經過長時間的休整--Gamestop的波動性。\n和其他名字把我帶回了r/wallstreetbets[/r/wallstreetbets]和。\nr/stocks[/r/stocks]。\n\n最近我對凱西伍德的方舟ETF做了一些研究，很是\n被我看到的東西嚇到了 我不是...",
      "title": "投資者要注意：$ARKK是一場等待發生的流動性災難。"
    }
  ],
  "title": "Investors beware: $ARKK is a liquidity disaster waiting to happen",
  "created_utc": 1614584161,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently got back on Reddit after a long hiatus - the volatility in Gamestop and other names brought me back to <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> and <a href=\"/r/stocks\">r/stocks</a>.</p>\n\n<p>Lately I have been doing some research on Cathie Wood&#39;s Ark ETFs and am quite alarmed by what I am seeing. I am by no means an expert in finance, but I work in finance professionally. I spent 2 years on a long-short equity hedge fund in NYC right after college, and have worked in M&amp;A for an asset management firm for the last 5.5 years. I am intimately aware of how active and passive (ETF) investment products function and acutely aware of the impact that investor fund flows can have on price and performance of an ETF.</p>\n\n<p>In the case of $ARKK and the family of ETFs, it is glaringly apparent to me that all of these ETFs in the last 12-14 months have become victims of their own success. What do I mean by this?</p>\n\n<p>We&#39;ll use $ARKK as an example. In the last 14 months, investors (and many of you) plowed money into $ARKK at a stunning rate - $10 billion in 2020, and another $5 billion in just the first two months of 2021. In conjunction with those investor flows, the Ark ETFs have developed what by any industry standard represent HUGE holdings in many of the portfolio companies, as high as 25-30% in dozens of cases. Many of these holdings are illiquid companies that don&#39;t trade significant volume on any given day. The combination of low liquidity, huge investor inflows into the ETF, and now enormous ownership stakes in the portfolio companies has had the effect of driving share prices higher. Much of the ETF&#39;s performance over the last 12-14 months is not a function of fundamental improvement of the portfolio companies, but a function of the ETF having to buy illiquid equity securities when inflows are positive. This may not be readily apparent to the untrained eye, but it is crystal clear for those with access to industry flow data.</p>\n\n<p>I ran an analysis on the weekly net flows into ARKK over the last 60 weeks, and found that portfolio performance of the ETF was highly correlated with ETF inflows.</p>\n\n<p><strong><em>Correlation of 70%</em></strong></p>\n\n<p><strong><em>R-squared of 0.49</em></strong> </p>\n\n<p>That is to say, the tail is wagging the dog! ARKK has created its own good performance, but not because the companies have grown or fundamentally improved. Nearly entirely the result of the ETF buying.</p>\n\n<p>What happens next?</p>\n\n<p>Last week was a taste of the trouble ahead. When investors sell the ETF instead of buy, in order to cash out the investors the ETF must sell some of the stock in its portfolio companies, except that liquidity or lack of liquidity becomes a much bigger problem when investors are selling and when the broad equity/tech markets have a correction.</p>\n\n<p>The ARKK ETF price has appreciated nearly 350% in a very short time. Now that Cathie Wood represents a big chunk of the outstanding shares within companies that have become overvalued by almost all measures, and trade with very thin liquidity, any meaningful reversal in investor flows (out instead of in) will result in a cascading collapse of the Ark ETFs. If the fund can generate returns of 350% in roughly a year, just imagine what may happen if investors move toward the exits in a much shorter period of time.</p>\n\n<p>As someone who takes pride in my analytical work, and who is concerned about the limited investor knowledge of many people who own Cathie Wood&#39;s funds, I would strongly encourage you to do more research. Learn about the companies held by the ETFs. Try to educate yourselves on valuation methods. And please understand that unless you are willing to lose every dollar that you have invested with Ark, you should take some time to reflect on the risks you are taking.</p>\n\n<p>After spending a very short amount of time on this subreddit and others, I am concerned that many people may not be aware of these risks, and unfortunately the small investors in Cathie&#39;s funds will be the ones who bear the brunt of any crisis.</p>\n\n<p>As usual with Wall Street, the insiders like Cathie Wood will get huge payouts and the little guys will get to hold the bag. It is not widely known, but good food for though that Cathie has sold 51% of her company to American Beacon, and she is likely to receive a check from American Beacon this year that will total in the hundreds of millions of dollars. Whatever happens, Cathie Wood will be just fine, but the small investors may not be.</p>\n\n<p>Good luck and I hope I am wrong.</p>\n\n<p>Edit - for inquiring minds, the link below is a detailed and succinct overview of some of these concerns from a Fintwit personality.</p>\n\n<p><a href=\"https://twitter.com/BradMunchen/status/1366028953828270082\">https://twitter.com/BradMunchen/status/1366028953828270082</a></p>\n</div><!-- SC_ON -->",
  "score": 3322,
  "permalink": "/r/stocks/comments/lv1sjx/investors_beware_arkk_is_a_liquidity_disaster/",
  "subreddit": "stocks",
  "id": "lv1sjx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937743325
}