{
  "author": "alexm901",
  "the_new_excerpt": "So I noticed a few posts that say they're selling their crypto or taking\nprofits. Doesn't feel right. Feels like someone rich and powerful wants the\nlittle guy to sell his crypto on the cheap so they can buy it all up.\n\nAnyone notice this?\n\nEdit: Just to be clear, I'm not against anyone taking…",
  "original_created_utc": 1621104788,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのため、暗号を売ったり、利益を得たりしているという投稿がいくつかあることに気がつきました。\n利益を得ています。違和感があります。誰か金持ちや権力者が\n誰か金持ちの権力者が、自分の暗号を安く売って買い占めようとしているような気がします。\n\nこれに気づいた人はいますか？\n\n編集：明確にしておきますが、私は誰かが...を取ることに反対しているわけではありません。",
      "title": "売れています」という投稿の増加 - 協調攻撃？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我注意到有几个帖子说他们正在卖出他们的加密货币或获取\n盈利。感觉不对。感觉就像某个有钱有势的人想让小人物廉价卖掉他的加密货币，这样他们就可以全部买下。\n小家伙廉价出售他的加密货币，这样他们就可以把它全部买下来。\n\n有人注意到这一点吗？\n\n编辑：为了明确起见，我不反对任何人拿...",
      "title": "\"我在卖东西 \"的帖子增多--协调攻击？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我注意到有幾個帖子說他們正在賣出他們的加密貨幣或獲取\n盈利。感覺不對。感覺就像某個有錢有勢的人想讓小人物廉價賣掉他的加密貨幣，這樣他們就可以全部買下。\n小傢伙廉價出售他的加密貨幣，這樣他們就可以把它全部買下來。\n\n有人注意到這一點嗎？\n\n編輯：爲了明確起見，我不反對任何人拿...",
      "title": "\"我在賣東西 \"的帖子增多--協調攻擊？"
    }
  ],
  "title": "Increase in \"I'm Selling\" posts - Coordinated attack??",
  "created_utc": 1621121436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I noticed a few posts that say they&#39;re selling their crypto or taking profits. Doesn&#39;t feel right. Feels like someone rich and powerful wants the little guy to sell his crypto on the cheap so they can buy it all up.</p>\n\n<p>Anyone notice this?</p>\n\n<p>Edit: Just to be clear, I&#39;m not against anyone taking profits, that&#39;s the whole point in investing IMO. It just seems like there&#39;s more posts about selling than usual.</p>\n\n<p>Edit 2: The top post on Reddit right now is about selling and the user <a href=\"/u/AmishMagic\">u/AmishMagic</a> is 1 month old and has just this one post which got upvoted to hell. And we all know upvote bots are active on Reddit.</p>\n\n<p>Edit 4; This post is getting down voted hard</p>\n</div><!-- SC_ON -->",
  "score": 1060,
  "permalink": "/r/CryptoCurrency/comments/nd5sic/increase_in_im_selling_posts_coordinated_attack/",
  "subreddit": "CryptoCurrency",
  "id": "nd5sic",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798343
}