{
  "author": "Soggy-Drink-2528",
  "original_created_utc": 1635050174,
  "title": "Is it a douchebag move to not want a relationship with my neighbors?",
  "created_utc": 1635067371,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I think it&#39;s rude to not speak to them. I wave hello and give a smile whenever I see them, but I don&#39;t really want to have diner with them, or watch the game at their house. I&#39;m not the most social guy in the world as you can tell. I&#39;m afraid to ask this question because it seems like everyone would be quick to call me a piece of shit. Am I being a jerk? How would you feel if someone like me was living next to you?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/qel099/is_it_a_douchebag_move_to_not_want_a_relationship/",
  "subreddit": "TooAfraidToAsk",
  "id": "qel099",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think it's rude to not speak to them. I wave hello and give a smile whenever I\nsee them, but I don't really want to have diner with them, or watch the game at\ntheir house. I'm not the most social guy in the world as you can tell. I'm\nafraid to ask this question because it seems like everyone would…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "声をかけないのは失礼だと思います。会えば手を振ったり、笑顔を見せたりしますが\nしかし、一緒に食事をしたり、家で試合を見たりしたいとは思いません。\n彼らの家でゲームを見たいとは思わない。ご存知の通り、私は世界で最も社交的な男ではありません。私は\nこの質問をするのが怖いのは、誰もがそうすると思われるからです。",
      "title": "隣人と関係を持ちたくないというのは、同人誌的な行動なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为不和他们说话是不礼貌的。每当我看到他们时，我都会挥手问好并报以微笑。\n但我并不真的想和他们一起吃饭，或在他们家看比赛。\n他们家看比赛。我不是世界上最善于社交的人，你可以看出。我\n我不敢问这个问题，因为看起来每个人都会...",
      "title": "不希望与我的邻居发生关系，这是一个恶棍的举动吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲不和他們說話是不禮貌的。每當我看到他們時，我都會揮手問好並報以微笑。\n但我並不真的想和他們一起喫飯，或在他們家看比賽。\n他們家看比賽。我不是世界上最善於社交的人，你可以看出。我\n我不敢問這個問題，因爲看起來每個人都會...",
      "title": "不希望與我的鄰居發生關係，這是一個惡棍的舉動嗎？"
    }
  ]
}