{
  "author": "DaddySkates",
  "original_created_utc": 1643300055,
  "title": "Cardano network clogged, Avalanche congested a while ago, Polygon almost stopped completely due to some flower picking game. Are these really going to work as an alternative to Ethereum with its high gas fees?",
  "created_utc": 1643309028,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Before anyone goes nuclear I will say that ETH is too damn expensive. But are the alternatives really so much better? &lt;/p&gt;\n\n&lt;p&gt;Recent news about Cardano congestion shooting up around 90% and more, Polygon being borderline unresponsive during Sunflower popularity/incident, and AVAX fees getting sky high while network suffered congestion a few months ago.&lt;/p&gt;\n\n&lt;p&gt;If these networks had the Ethereum levels of activitynon them, they wouldnt hold for long. Cardano has a handful of dapps and its already clogged? Same with Polygon. 1 dapp putting whole network on stop is really not what people would expect of the so called &amp;quot;next gen eth competitors.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;While I 100% agree that gas fees on Ethereum are absurd, I wonder if the alternatives that we have at the moment in top10 are going to solve that. All claim insane TPS and finality times, but when the shit gets real, the fees and network congestion go up to the sky.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 631,
  "permalink": "/r/CryptoCurrency/comments/se1ytq/cardano_network_clogged_avalanche_congested_a/",
  "subreddit": "CryptoCurrency",
  "id": "se1ytq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Before anyone goes nuclear I will say that ETH is too damn expensive. But are\nthe alternatives really so much better?\n\nRecent news about Cardano congestion shooting up around 90% and more, Polygon\nbeing borderline unresponsive during Sunflower popularity/incident, and AVAX\nfees getting sky high…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かが核武装する前に、私はETHがあまりにもひどく高価であることを言うでしょう。しかし\nは、本当にそんなに良いのでしょうか？\n\n最近のニュースでは、Cardanoの混雑率が90%以上に上昇したことや、Polygon\nひまわり人気・事件時のボーダーラインの無反応、AVAX\n手数料が高くなった...",
      "title": "Cardanoのネットワークは詰まり、Avalancheは少し前に渋滞し、Polygonはどこかの花摘みゲームのせいでほぼ完全に止まってしまった。これらは本当にガス代が高いイーサリアムの代替品として機能するのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在有人提出异议之前，我要说的是，ETH太他妈贵了。但是\n替代品真的好得多吗？\n\n最近关于Cardano的拥挤程度达到了90%以上的新闻，Polygon\n在 \"向日葵 \"流行/事件期间几乎没有任何反应，以及AVAX\n费用越来越高......",
      "title": "Cardano网络堵塞，Avalanche前一阵子拥堵，Polygon由于一些采花游戏几乎完全停止。这些真的能作为以太坊的替代物吗，因为它的气体费用很高？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在有人提出異議之前，我要說的是，ETH太他媽貴了。但是\n替代品真的好得多嗎？\n\n最近關於Cardano的擁擠程度達到了90%以上的新聞，Polygon\n在 \"向日葵 \"流行/事件期間幾乎沒有任何反應，以及AVAX\n費用越來越高......",
      "title": "Cardano網絡堵塞，Avalanche前一陣子擁堵，Polygon由於一些採花遊戲幾乎完全停止。這些真的能作爲以太坊的替代物嗎，因爲它的氣體費用很高？"
    }
  ]
}