{
  "author": "fan_of_hakiksexydays",
  "original_created_utc": 1656611778,
  "title": "Here's how similar things are to the 2018 bear market bottom.",
  "created_utc": 1656642640,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/lequyd8jls891.jpg?width=925&amp;amp;format=pjpg&amp;amp;auto=webp&amp;amp;s=611dde751075a6bb1474d5b2f68904efceb4fabf\"&gt;2018 bottom vs today&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;The prelude was a similar +60% drop from ATH, with a period of stagnating prices, or &amp;quot;crabbing&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Until at point 1, came the breaking point where the market went into full panic mode and everyone who had any doubt, exited the market. Going at maximum selling pressure. &lt;/p&gt;\n\n&lt;p&gt;In both cases the drop was at over 40%.&lt;/p&gt;\n\n&lt;p&gt;Until at point 4 came the saturation point. The stampeded of sellers had all sold, and were all out of the market. &lt;/p&gt;\n\n&lt;p&gt;The price went too far below the bulk of the bull run&amp;#39;s entry points and stop losses, and extended as far as supply and demanded forces allowed. &lt;/p&gt;\n\n&lt;p&gt;At point 5 the price bounced back but then was followed by a period of slow decline, and ultimately in both cases, tried to re-test the lows. Which is what we see now with the drop below $19K. &lt;/p&gt;\n\n&lt;p&gt;There is the issue of time being different. With the 2018 taking about 3 months, versus 1 month. But they&amp;#39;re still both under 3 months. The more important part is they are both similar in proportions in terms of drop.&lt;/p&gt;\n\n&lt;h1&gt;Why are things suddenly similar?&lt;/h1&gt;\n\n&lt;p&gt;Probably because we are dealing with very similar market dynamics, and supply and demand interactions.&lt;/p&gt;\n\n&lt;p&gt;In both cases, we came out of a major stress in terms of drop and fear, crashing from an ATH, and going into a bear market. &lt;/p&gt;\n\n&lt;p&gt;That level of fear and panic creates a more emotional market.&lt;/p&gt;\n\n&lt;p&gt;When markets get emotional, they follow more of the classic market emotional psychology, rather than follow logic, fundamentals, or macro economics.&lt;/p&gt;\n\n&lt;p&gt;The market will always follow supply and demand, and the path of least resistance.&lt;/p&gt;\n\n&lt;p&gt;Once you run out of sellers, because they all panicked out at the same time, are too far in the red, or have already hit all their stop losses, you&amp;#39;ll start seeing selling pressure max out, and then eventually reverting to buying pressure, as demand comes back to pick up the scraps and overextended low prices.&lt;/p&gt;\n\n&lt;p&gt;Which is what we started seeing later on in February and March 2018.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 326,
  "permalink": "/r/CryptoCurrency/comments/voej7v/heres_how_similar_things_are_to_the_2018_bear/",
  "subreddit": "CryptoCurrency",
  "id": "voej7v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "2018 bottom vs today\n[https://preview.redd.it/lequyd8jls891.jpg?width=925&format=pjpg&auto=webp&s=611dde751075a6bb1474d5b2f68904efceb4fabf]\n\nThe prelude was a similar +60% drop from ATH, with a period of stagnating\nprices, or \"crabbing\".\n\nUntil at point 1, came the breaking point where the market…"
}