{
  "author": "HeIioz",
  "original_created_utc": 1630094499,
  "title": "Ethereum is Undergoing an Emergency Hot Patch Due to a Bug. Don't do Ethereum Transactions Right Now.",
  "created_utc": 1630114727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&quot;Fork between latest geth and older geth on mainnet. Stay away from doing txs for awhile till confirmed, unless you are sure you are submitting to latest geth,&quot; tweeted Yearn Finance Founder Andre Cronje</p>\n\n<p>A bug affecting older versions of a major Ethereum client is causing those nodes to split from the main network. This affects around 54% of Ethereum nodes.</p>\n\n<p>The bug may lead to double spend exploits where users spend cryptocurrency but the transaction is overwritten on an alternative chain. The bug also impacts other EVM-compatible chains like Binance Smart Chain and Polygon.</p>\n\n<p>After Ethereum core developers were informed about the issue, they released a patch on August 24 but it works only for those who have since updated their node.</p>\n</div><!-- SC_ON -->",
  "score": 165,
  "permalink": "/r/CryptoCurrency/comments/pcuw7v/ethereum_is_undergoing_an_emergency_hot_patch_due/",
  "subreddit": "CryptoCurrency",
  "id": "pcuw7v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "\"Fork between latest geth and older geth on mainnet. Stay away from doing txs\nfor awhile till confirmed, unless you are sure you are submitting to latest\ngeth,\" tweeted Yearn Finance Founder Andre Cronje\n\nA bug affecting older versions of a major Ethereum client is causing those nodes\nto split from…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"メインネット上の最新のゲスと古いゲスの間のフォーク。txsの使用は控えてください。\n最新のgethに送信していることが確実でない限り、確認されるまでしばらくの間、txsを行うことは避けてください。\nと、Yearn Financeの創業者Andre Cronjeがツイートしました。\n\n主要なEthereumクライアントの古いバージョンに影響を与えるバグは、それらのノードを...\nから分裂する可能性があります。",
      "title": "イーサリアムは、バグにより緊急ホットパッチを実施中です。今はイーサリアムの取引をしないでください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"最新的GETH和主网的老GETH之间的分叉。在确认之前，暂时不要做txs\n暂时不要做txs，直到确认，除非你确定你提交的是最新的\ngeth，\"Yearn Finance的创始人Andre Cronje在推特上说。\n\n一个影响旧版以太坊客户端的错误导致这些节点\n导致这些节点从...",
      "title": "以太坊正在进行紧急热补丁，因为有漏洞。现在不要做Ethereum交易。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"最新的GETH和主網的老GETH之間的分叉。在確認之前，暫時不要做txs\n暫時不要做txs，直到確認，除非你確定你提交的是最新的\ngeth，\"Yearn Finance的創始人Andre Cronje在推特上說。\n\n一個影響舊版以太坊客戶端的錯誤導致這些節點\n導致這些節點從...",
      "title": "以太坊正在進行緊急熱補丁，因爲有漏洞。現在不要做Ethereum交易。"
    }
  ]
}