{
  "author": "mic_droo",
  "original_created_utc": 1637494752,
  "title": "For the first time in more than half a year, there are no meme coins in the top 10. Enjoy it while it lasts, they will be back.",
  "created_utc": 1637523391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In mid-April, a bit more than 7 months ago, DOGE started its second crazy rally of the year, going from $0.5 to $0.4 and after a short pause even over $0.70. This was more than enough for it to enter the top 10, as it had multiple times before. But this time, it stayed there for quite a while. A few weeks ago, a second meme coin, SHIB, joined it in the top 10 - as far as I know it was the first time than any other meme coin but DOGE did so.</p>\n\n<p>SHIB already left the top 10 a week or two ago, now DOGE has been kicked out by AVAX. Personally, I&#39;m pretty neutral regarding meme coins - would never buy them but don&#39;t care at all if others do - but I know some of you will be happy about this. What I do dislike, however, is this sub&#39;s tendency to declare meme coins and other coins it doesn&#39;t like dead if they dip a few %, which they would call a &quot;healthy correction&quot; or a &quot;tasty dip&quot; for coins popular on here.</p>\n\n<p>Love them or hate them, meme coins are not gone and one of them, be it DOGE or something else, will re-enter the top 10 probably rather sooner than later - those coins tend to pump really hard once they do. Memes will be a big part of crypto ecosystem, at least until it matures - and hey, I wouldn&#39;t bet that it ever will. </p>\n\n<p>Long story short: DOGE is out of the top 10 for the first time since April. Enjoy it while it lasts, it probably will be back.</p>\n</div><!-- SC_ON -->",
  "score": 187,
  "permalink": "/r/CryptoCurrency/comments/qyt918/for_the_first_time_in_more_than_half_a_year_there/",
  "subreddit": "CryptoCurrency",
  "id": "qyt918",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In mid-April, a bit more than 7 months ago, DOGE started its second crazy rally\nof the year, going from $0.5 to $0.4 and after a short pause even over $0.70.\nThis was more than enough for it to enter the top 10, as it had multiple times\nbefore. But this time, it stayed there for quite a while. A few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今から7ヶ月以上前の4月中旬、DOGEは今年2度目の狂ったようなラリーを始めた。\n0.5ドルから0.4ドルになり、一時的に0.70ドルを超えました。\nこれは、過去に何度もあったように、トップ10に入るのに十分すぎるほどでした。\nした。しかし、今回はかなりの期間、そこに留まりました。いくつかの...",
      "title": "半年以上ぶりにトップ10にミームコインが入っていません。今のうちに楽しんでおけば、また戻ってくるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在4月中旬，也就是7个多月前，DOGE开始了今年第二次疯狂的反弹。\n今年的第二次疯狂反弹，从0.5美元涨到0.4美元，在短暂的停顿后甚至超过了0.7美元。\n这足以让它进入前十名，就像它之前多次出现的那样\n之前多次。但是这一次，它在那里停留了相当长的时间。有几个...",
      "title": "半年多来第一次，前十名中没有回忆币。趁着这段时间好好享受吧，他们会回来的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在4月中旬，也就是7個多月前，DOGE開始了今年第二次瘋狂的反彈。\n今年的第二次瘋狂反彈，從0.5美元漲到0.4美元，在短暫的停頓後甚至超過了0.7美元。\n這足以讓它進入前十名，就像它之前多次出現的那樣\n之前多次。但是這一次，它在那裏停留了相當長的時間。有幾個...",
      "title": "半年多來第一次，前十名中沒有回憶幣。趁着這段時間好好享受吧，他們會回來的。"
    }
  ]
}