{
  "author": "Acceptable-Risks",
  "original_created_utc": 1653751005,
  "title": "Bitcoin is not a hedge against inflation. It's a hedge against central banking as a whole.",
  "created_utc": 1653785456,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Inflation is a symptom of a bigger disease called central banking and unfortunately, as I post this, bitcoin is still tied to and valued in fiat currency. While people still invest in bitcoin hoping to cash out for fiat, you can be sure bitcoin will not decouple from fiat currency, and you&amp;#39;ll see the &amp;quot;value&amp;quot; of it move with other markets tied to fiat (although we all know the real value is priceless)&lt;/p&gt;\n\n&lt;p&gt;We know the central banking system is collapsing. The ship is sinking and they cannot keep it afloat much longer. Decades of manipulation and Bipolar policy has damaged fiat beyond repair. It&amp;#39;s going to zero, as it has in many areas of the world already. When you buy bitcoin you should understand you&amp;#39;re betting against the central banks. You&amp;#39;re betting against fiat currency altogether. You&amp;#39;re expressing your desire to see this decentralized monetary system become the standard, so you should expect to have to hold for a decade or several decades to see the vision come true. Once the fiat currency system finally collapses for good (and it will) your Bitcoin will be the only life raft you have. It will be the only life raft anyone has, and then you&amp;#39;ll see everything else valued in satoshis. &lt;/p&gt;\n\n&lt;p&gt;Do you think the world is going back to trading physical gold when fiat finally collapses? I don&amp;#39;t think so. In today&amp;#39;s world technology is important and convenience. The world will choose bitcoin when central banking dies. Get on the boat and don&amp;#39;t sell your bitcoin for any shitcoins especially the ultimate shitcoin USD.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 302,
  "permalink": "/r/Bitcoin/comments/uzpemi/bitcoin_is_not_a_hedge_against_inflation_its_a/",
  "subreddit": "Bitcoin",
  "id": "uzpemi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Inflation is a symptom of a bigger disease called central banking and\nunfortunately, as I post this, bitcoin is still tied to and valued in fiat\ncurrency. While people still invest in bitcoin hoping to cash out for fiat, you\ncan be sure bitcoin will not decouple from fiat currency, and you'll see…"
}