{
  "author": "Socialinfluencing",
  "original_created_utc": 1635100226,
  "title": "Bitcoin just dipped below 60k, how to survive the bear market.",
  "created_utc": 1635137056,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Btc just dipped below 60k momentarily. This means that the polar ice caps are melting and polar ice caps have the word polar in them, and you know what usually follows after polar? Bears. And those kinds of bears can only be found in very cold temperatures. They typically survive in climates where there&#39;s lots of red and no hope. Their favourite meal is the endangered paperhands. These rare seals are known to simply roll over and allow you to eat them, this explains their near extinction.</p>\n\n<p>My advice? Stay away from paperhands, if you spot one in the wild you can be sure a polar bear is already stalking it. In a cold climate where it&#39;s below 60000k degrees, these bears will eat anything. Do not lay in the snow motionless otherwise you&#39;ll be mistaken for a paperhand seal pup, you&#39;ve been warned!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/qey1a0/bitcoin_just_dipped_below_60k_how_to_survive_the/",
  "subreddit": "CryptoCurrency",
  "id": "qey1a0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Btc just dipped below 60k momentarily. This means that the polar ice caps are\nmelting and polar ice caps have the word polar in them, and you know what\nusually follows after polar? Bears. And those kinds of bears can only be found\nin very cold temperatures. They typically survive in climates where…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Btcは一瞬60kを割り込んだ。これは、極地の氷柱が\n極地の氷冠が溶けているということです。極地の氷冠にはpolarという言葉が入っています。\npolarの次は何が来ると思いますか？クマです。そして、そのような種類のクマは、非常に寒い場所でしか見つかりません。\n極寒の地でしか見られません。彼らが生存するのは、通常...",
      "title": "ビットコインが60kを割り込んだ！弱気な市場をどう乗り切るか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Btc刚刚瞬时跌破60K。这意味着，极地冰盖正在\n这意味着极地冰盖正在融化，而极地冰盖上有极地这个词，你知道极地后面通常有什么？\n你知道在极地后面通常有什么吗？熊。而那些熊只能在非常寒冷的温度下找到\n在非常寒冷的温度下。它们通常生存在这样的气候条件下...",
      "title": "比特币刚刚跌破6万，如何在熊市中生存。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Btc剛剛瞬時跌破60K。這意味着，極地冰蓋正在\n這意味着極地冰蓋正在融化，而極地冰蓋上有極地這個詞，你知道極地後面通常有什麼？\n你知道在極地後面通常有什麼嗎？熊。而那些熊只能在非常寒冷的溫度下找到\n在非常寒冷的溫度下。它們通常生存在這樣的氣候條件下...",
      "title": "比特幣剛剛跌破6萬，如何在熊市中生存。"
    }
  ]
}