{
  "author": "HappyBus8759",
  "the_new_excerpt": "For all the new GME investors who might be slightly confused about why and how\nthe hedge funds have gotten themselves backed into this corner..\n\nMelvin and friends thought that GameStop was a failing company, so they decided\nto short it's stock. They got so greedy, they decided that they would short…",
  "original_created_utc": 1614373427,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "对于所有新加入GME的投资者来说，他们可能会对为什么要这样做以及如何做有些困惑。\n对冲基金已经得到了自己 回到这个角落... ...\n\n梅尔文和朋友们认为GameStop是一家倒闭的公司 所以他们认为\n做空它的股票。他们太贪心了，他们决定要做空... ...",
      "title": "篱笆们多么希望这一切能... ..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對於所有新加入GME的投資者來說，他們可能會對爲什麼要這樣做以及如何做有些困惑。\n對沖基金已經得到了自己 回到這個角落... ...\n\n梅爾文和朋友們認爲GameStop是一家倒閉的公司 所以他們認爲\n做空它的股票。他們太貪心了，他們決定要做空... ...",
      "title": "籬笆們多麼希望這一切能... ..."
    }
  ],
  "title": "How the hedges hoped this would go...",
  "created_utc": 1614443846,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For all the new GME investors who might be slightly confused about why and how the hedge funds have gotten themselves backed into this corner..</p>\n\n<p>Melvin and friends thought that GameStop was a failing company, so they decided to short it&#39;s stock. They got so greedy, they decided that they would short the company by more stock than actually existed (naked short selling),  such was their confidence that GameStop was worthless.</p>\n\n<p>The very act of doing this, if it hadn&#39;t been discovered might very well have driven Gamestop into bankruptcy, with the company still being viable.</p>\n\n<p>When a company goes bankrupt, the short sellers don&#39;t haver to buy back or return the stock, so if GameStop had been driven into bankruptcy, this dirty illegal tactic they used might never have been exposed. By not having to buy the stock back, they make maximum profit on their short trade, and don&#39;t even have to pay any taxes on their profits. This is a short sellers wet dream.</p>\n\n<p>Tens of thousands of people lose their jobs, homes get repossessed, suicides increase, families devastated, all while Melvin and his buddies eat caviar, sip champagne on balconies and count their ill gotten gains. It really is the devil&#39;s work what they do.</p>\n\n<p>But now that the hedgie&#39;s devious ways have been exposed and shared with apes allover the world, Melvin and his friends can never drive GameStop into the ground, so they will be forced to buy back the shares at some stage. And because they were so greedy by naked short selling, now they have to buy back more shares than actually exist. They sold fake counterfeit shares, but they need to buy back real shares, the shares we own.</p>\n\n<p>So even if you only hold 1 share, they need it. They need to buy every single share that actually exists to cover their position. And that is why 1 share of GameStop is worth whatever price you&#39;re willing to sell for, even if it&#39;s $500k and above.</p>\n\n<p>For the last few weeks, Melvin and friends have been using even dirtier tactics, trying to fool us all into thinking that they do not need our shares.</p>\n\n<p>Do not fall for this. They will use every psychological tactic they can to convince you to sell. Manipulating the price, turning off the buy button via RobinHood, paying media to say they have already covered etc. They are going to be using even dirtier tactics over the coming weeks,  some that we haven&#39;t event thought of yet.</p>\n\n<p>All we need to do is hold ; nothing else, and get on with life.</p>\n\n<p>&#x200B;</p>\n\n<p>As an Irish Ape, I will finish by sharing an Irish patriotic saying..</p>\n\n<p>&quot;<em>Tiocfaidh Ar La - Our Day will Come&quot;</em></p>\n</div><!-- SC_ON -->",
  "score": 3551,
  "permalink": "/r/wallstreetbets/comments/lt7sfo/how_the_hedges_hoped_this_would_go/",
  "subreddit": "wallstreetbets",
  "id": "lt7sfo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937750640
}