{
  "author": "slvbtc",
  "original_created_utc": 1644534813,
  "title": "Bitcoins true value is somewhere between $500k to $10m. And it will get there faster than anyone could possibly imagine.",
  "created_utc": 1644561585,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Microstrategy bought bitcoin in 2020. Two years later an institutional wave of money is now entering.&lt;/p&gt;\n\n&lt;p&gt;El Salvador bought bitcoin in 2021, by 2023 a wave of sovereign nations will be buying bitcoin to hold as reserves.&lt;/p&gt;\n\n&lt;p&gt;Bitcoins fair value is somewhere between gold and global debt which is between $10 trillion and $200 trillion ($500k to  $10 million per coin).&lt;/p&gt;\n\n&lt;p&gt;New tech is always overvalued before it is fully adopted just like the dot com bubble in the 90s getting way ahead of itself before most people even had a home internet connection.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin will not rise slowly. It will not give people the chance to take their time. It will melt faces off as it leaves everyone behind. A million dollar bitcoin will not take another 10 years, and it doesn&amp;#39;t need to be held by five billion people to get there. It will be overvalued well before mainstream adoption takes place. &lt;/p&gt;\n\n&lt;p&gt;Once institutional fomo is well underway and sovereign nation fomo is heating up the price will rise by $100k in a month. It took 12 years to go from zero to a one trillion dollar market cap and once we are solidly above one trillion it could reach two trillion in a matter of months.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin will find its true value somewhere between $500k and $10 million per coin and it will happen faster than anyone on earth could possibly imagine.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/Bitcoin/comments/spjhxz/bitcoins_true_value_is_somewhere_between_500k_to/",
  "subreddit": "Bitcoin",
  "id": "spjhxz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Microstrategy bought bitcoin in 2020. Two years later an institutional wave of\nmoney is now entering.\n\nEl Salvador bought bitcoin in 2021, by 2023 a wave of sovereign nations will be\nbuying bitcoin to hold as reserves.\n\nBitcoins fair value is somewhere between gold and global debt which is…"
}