{
  "author": "WhiteGoldTeef",
  "original_created_utc": 1625963036,
  "title": "It's fight night, big fellas!! Tonight embarks the beginning of a 10 year deal between the UFC and Crypto.com, where our ecosystem will be represented and showcased to millions of UFC fans around the world, almost every weekend.",
  "created_utc": 1625999439,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Its so crazy to me seeing crypto being shown during major live sporting events, talked about on traditional stock market media platforms and slowly becoming a part of poeples daily lives, whether it be by being involved or exposed to it through the media they consume.</p>\n\n<p>Its getting easier by the day to get involved with this space and we&#39;ve come so far in such a short amount of time!</p>\n\n<p>It feels surreal sometimes.</p>\n\n<p>Who are you guys rooting for tonight? Coins and fighters!</p>\n</div><!-- SC_ON -->",
  "score": 183,
  "permalink": "/r/CryptoCurrency/comments/ohu8nm/its_fight_night_big_fellas_tonight_embarks_the/",
  "subreddit": "CryptoCurrency",
  "id": "ohu8nm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Its so crazy to me seeing crypto being shown during major live sporting events,\ntalked about on traditional stock market media platforms and slowly becoming a\npart of poeples daily lives, whether it be by being involved or exposed to it\nthrough the media they consume.\n\nIts getting easier by the day…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大規模なスポーツイベントの中継で暗号が表示されているのを見ると、とても不思議な気持ちになります。\n伝統的な株式市場のメディアプラットフォームで話題になり、徐々に一般人の日常生活の一部になっていくのを見るのはとても不思議です。\n人々の日常生活の一部になりつつある。\nそして、人々の日常生活の一部となっていきます。\n\n日に日に簡単になってきています...。",
      "title": "ファイトナイトだ！大物たちよ！！」。今夜は、UFCとCrypto.comとの10年契約の始まりです。ほぼ毎週末、世界中の何百万人ものUFCファンに向けて、当社のエコシステムを紹介していきます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我来说，看到加密货币在大型现场体育赛事中被展示是如此疯狂。\n在传统的股票市场媒体平台上谈论，并逐渐成为人们日常生活的一部分。\n逐渐成为人们日常生活的一部分，无论是通过参与还是通过消费的媒体接触到它\n通过他们所消费的媒体。\n\n它一天比一天容易...",
      "title": "这是战斗之夜，大伙儿！! 今晚是UFC和Crypto.com之间10年协议的开始，我们的生态系统将被代表并展示给世界各地数百万UFC粉丝，几乎每个周末都有。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我來說，看到加密貨幣在大型現場體育賽事中被展示是如此瘋狂。\n在傳統的股票市場媒體平臺上談論，並逐漸成爲人們日常生活的一部分。\n逐漸成爲人們日常生活的一部分，無論是通過參與還是通過消費的媒體接觸到它\n通過他們所消費的媒體。\n\n它一天比一天容易...",
      "title": "這是戰鬥之夜，大夥兒！! 今晚是UFC和Crypto.com之間10年協議的開始，我們的生態系統將被代表並展示給世界各地數百萬UFC粉絲，幾乎每個週末都有。"
    }
  ]
}