{
  "author": "UrMuMGaEe",
  "the_new_excerpt": "I'm not going to make a big paragraph, just point to point facts.\n\nThe Basics :-\n\nFact 1 : This subreddit is a discussion forum for various CryptoCurrencies.\n\nFact 2 : This is NOT a PUMP and DUMP subreddit where we encourage users to buy a\ncoin showing various articles and ask them to FOMO in.\n\nFact…",
  "original_created_utc": 1611940670,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不打算大段大段的说，只是点到为止的事实。\n\n基本情况 :-\n\n事实1：这个subreddit是一个讨论各种加密货币的论坛。\n\n事实2：这不是一个PUMP和DUMP的子reddit，在这里我们鼓励用户买一个\n币显示各种文章，并要求他们在FOMO。\n\n事实...",
      "title": "新人们听好了!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不打算大段大段的說，只是點到爲止的事實。\n\n基本情況 :-\n\n事實1：這個subreddit是一個討論各種加密貨幣的論壇。\n\n事實2：這不是一個PUMP和DUMP的子reddit，在這裏我們鼓勵用戶買一個\n幣顯示各種文章，並要求他們在FOMO。\n\n事實...",
      "title": "新人們聽好了!"
    }
  ],
  "title": "Newcomers listen up!",
  "created_utc": 1611955818,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m not going to make a big paragraph, just point to point facts.</p>\n\n<p>The Basics :-</p>\n\n<p>Fact 1 : This subreddit is a discussion forum for various CryptoCurrencies.</p>\n\n<p>Fact 2 : This is NOT a PUMP and DUMP subreddit where we encourage users to buy a coin showing various articles and ask them to FOMO in.</p>\n\n<p>Fact 3 : CryptoCurrencies can be traded 24/7 on exchanges, there is no closing or opening, and there are also no entities that can HALT trading and prevent you from buying/selling.</p>\n\n<p>Fact 4 : There is a lot of volatility in crypto relative to normal stocks. This is an emerging concept and get in only if you can LOSE your money in a SINGLE DAY!</p>\n\n<p>Fact 4 : There is also a lot of misinformation on all social media in regards to Crypto. Assume every single person explaining why a coin is better is a SHILLER, AKA he wants you and all the people he talks to buy his favourite coin so that price can increase.</p>\n\n<p>Fact 5 : Don&#39;t trust even a veteran investor or any other person showing fancy graphs saying that certain coin will go up or down. Especially twitter is full of these people, don&#39;t even trust the verified twitter accounts.</p>\n\n<p>Fact 6 : DO NOT BUY THESE GIVEAWAYS, no one gives you crypto if you send them some amount, IF you send it, it is GONE! Can&#39;t come back!</p>\n\n<p>Fact 7 : The DOGECOIN growth is now a PUMP! so remember, all the PUMPS follow a DUMP! I had a experience and I don&#39;t want this for others. Same was the case for XRP Ripple coin in 2017 and it is now running lawsuits to lawsuits.</p>\n\n<p>Fact 8 : CryptoCurrencies are NOT ILLEGAL! If you see warren buffet say what is bitcoin and we can&#39;t even see it, it isn&#39;t worth a dime, ask yourself, why is this man saying so? these people are the old ones who believe and live on DOLLARS! Crypto is harmful for their personal gains.</p>\n\n<p>Fact 9 : Crypto is NOT a GET RICH FAST scheme. And it is also never too late to get in or also get out!</p>\n\n<p>Fact 10 : DO YOUR OWN RESEARCH. A healthy Skepticism is what saves you in whatever situation you are! Imagine this, we all literally see the IMDB and RT ratings for a movie to watch it or not which can be watched at our whim via online streaming, then why shouldn&#39;t you READ the OFFICIAL WHITEPAPER and roadmap for a certain crypto?</p>\n\n<p>Okay basics done, now I assume you want to get into crypto.</p>\n\n<p>The intermediate stuff:</p>\n\n<p>Fact 1 : When you buy CryptoCurrency from an exchange, YOU DON&#39;T OWN THE CRYPTO. It is just the exchange saying that you have bought it. If the exchange  gets hacked, YOU LOSE ALL OF IT.</p>\n\n<p>Fact 2 : So, what to do? This is where WALLETS come in! You have to transfer your crypto from the exchange to your wallet. Every wallet has a private and public key and a backup phrase. The wallet Address is used as an &quot;Address&quot; i.e it is used to RECEIVE Crypto. If you want to withdraw your crypto from exchange or ask someone to send some crypto to you, you give them the WALLET ADDRESS.</p>\n\n<p>Fact 3 : Save your wallet backup phrase in case you lose the wallet. NEVER GIVE BACKUP PHRASE OR YOUR PRIVATE KEY TO SOMEONE. And for god&#39;s sake WRITE DOWN THE BACKUP PHRASE on a paper. Don&#39;t take a screenshot and throw it away in the depths of gallery waiting for your phone to be reset someday.</p>\n\n<p>Fact 4 : Wallets can be classified based on 2 things. Based on who holds them : Custodial and non-custodial. Custodial means that you DON&#39;T OWN THE WALLET and the wallet just merely gives you a way to interact with your crypto. Non custodial means that YOU ARE THE SOLE OWNER of that wallet and it is safer and also better to the cause of Crypto. Based on HARDWARE/SOFTWARE : As you guessed, software wallets are wallets that exist on your digital devices, phones are better than computers. Although these are better than holding in exchanges, Hardware wallets are even better. Hardware wallets are like the literal non-crackable personal SAFES you can BUY for around 50/60$.</p>\n\n<p>Fact 5 : Alright, wallets aside. Exchanges/your wallets have something called a transaction fee. This is used to perform your transaction and SEND your crypto to its destination.</p>\n\n<p>Fact 6 : Every coin/token has a UTILITY. See what it is and if you believe it can fulfil its purpose and also has the team/developers to take it forward, only then invest. For example ETH Ethereum was created to enable people to build Apps on it like a universal open source computer. And DOGECOIN is A MEME, the creator of DOGECOIN himself says it.</p>\n\n<p>Fact 7 : There is a long way to go and it will definitely be full of roadblocks and gains and losses. A single man tweeting bitcoin makes it go up and a news that someone sold big chuck of bitcoin makes it go down. Learn to have DIAMOND HANDS and hold!</p>\n\n<p>Fact 8 :  Although the mods here do their very best 24/7 to maintain a healthy environment here, there is no shortage of people commenting their coin will rise. Become immune to this. Daily articles are posted and also some success stories saying how BTC helped them buy lambos and stuff. This is survivor bias. No one will come over and say &quot;Hey I lost money buying crypto&quot;, human mentality itself is hardwired to share successes not failures.</p>\n\n<p>Fact 9 : Never ever take ADVICE from the INTERNET. Would you ever ask your neighbour where to put your 1000$? In the same way, if you ever ask someone what to buy, they will most prolly say to buy their coin.</p>\n\n<p>Fact 10 : INVEST ONLY WHAT YOU CAN LOSE. Learn what is Dollar Cost Averaging. Don&#39;t try to time the market and buy at lows and sell at highs. No one can predict these markets. Have an exit strategy for yourself. For example, I invest 300$ every month and no matter if it is an all time low or all time high. And I intend to pull a big chuck out if my BTC ever reaches to a level where I can afford higher education. Don&#39;t have a NUMBER decide your exit time, have a requirement/some personal threshold to pull out.</p>\n\n<p>And..,</p>\n\n<p>1 : What you see with the whole GME and short squeeze is literally an endorsement for crypto.</p>\n\n<p>2 : The game has been long rigged by Wall Street guys and crypto is &quot;Intended&quot; to remove these acts of rich people ruling over retail guys.</p>\n\n<p>3 : Crypto is to fiat/normal stock as how the &quot;Diners Club Card&quot; was back then. They said it was just a plastic card, it isn&#39;t money. Now look all round you, credit debit and cashless payments are UNAVOIDABLE. Generally speaking, when there is new concept or revolution, there are the early adopters, the denying people and maximalists. This is also a revolution, Warren Buffet said &quot;Bitcoin is RAT Poison&quot;, well now it is worth more than his own company&#39;s market cap. This is a revolution.</p>\n\n<p>4 : And if you are from <a href=\"/r/wallstreetbets\">r/wallstreetbets</a> , Welcome Aboard! What you guys have done is literally what is the aim of crypto! &quot;These whole series of events are bullish for Crypto&quot; ..now did you believe what I said,?  NO lol, that was listed in basics, DYOR! However a statement may seem correct, check it yourself!</p>\n\n<p>&#x200B;</p>\n\n<p>And lastly, welcome to Crypto and a new era of economy of the people, by the people and for the people. Crypto is an attempt to make sure that, &quot;The deserving win over the Privileged&quot; in this game.</p>\n\n<p>And have fun, weekends are meme days and we post memes too!  </p>\n\n<p>&#x200B;</p>\n\n<p>Terms to learn when surfing this sub:</p>\n\n<p>HODL : It means hold and don&#39;t sell and &quot;Hold On for Dear Life&quot; is accepted as its full form.</p>\n\n<p>SHILLER : A person who promotes his coin for his own personal gains.</p>\n\n<p>HFSP : Have fun staying poor</p>\n\n<p>Shitcoin : A coin worth nothing (from the sayer&#39;s perspective)</p>\n\n<p>Altcoin : Cryptocurrencies other than BTC and ETH. Although if ETH is also Altcoin is debatable.</p>\n\n<p>MOONs : The incentive/rewards in crypto given to you by the community for your contributions.</p>\n\n<p>ATH : All time high</p>\n\n<p>DEFI : DEcentralised FInance. Try to learn more about this concept...</p>\n</div><!-- SC_ON -->",
  "score": 552,
  "permalink": "/r/CryptoCurrency/comments/l7y5ye/newcomers_listen_up/",
  "subreddit": "CryptoCurrency",
  "id": "l7y5ye",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527088
}