{
  "author": "StealthRabbi",
  "the_new_excerpt": "I've got some long and short term purchases of a mutual fund, FSKAX. Fidelity\nshows my average cost basis and average % gain. But, if I look at all the\nindividual buys, it shows the same cost basis despite buying in at different\nprices.\n\nThis is as opposed to an ETF or stock, where you can see an…",
  "original_created_utc": 1613311184,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我有一些长期和短期购买的共同基金，FSKAX。Fidelity\n显示了我的平均成本基础和平均收益%。但是，如果我看一下所有的\n个别买入，尽管在不同的时间买入，但它显示出相同的成本基础。\n价格。\n\n这与ETF或股票不同，在这里你可以看到一个...",
      "title": "成本基础和跟踪收益。共同基金与ETF"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一些長期和短期購買的共同基金，FSKAX。Fidelity\n顯示了我的平均成本基礎和平均收益%。但是，如果我看一下所有的\n個別買入，儘管在不同的時間買入，但它顯示出相同的成本基礎。\n價格。\n\n這與ETF或股票不同，在這裏你可以看到一個...",
      "title": "成本基礎和跟蹤收益。共同基金與ETF"
    }
  ],
  "title": "Cost basis and tracking gains: Mutual Fund vs ETF",
  "created_utc": 1613330373,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve got some long and short term purchases of a mutual fund, FSKAX. Fidelity shows my average cost basis and average % gain. But, if I look at all the individual buys, it shows the same cost basis despite buying in at different prices. </p>\n\n<p>This is as opposed to an ETF or stock, where you can see an average cost basis as well as a breakdown of individual lots.</p>\n\n<p>Is there a way to change this? I&#39;d like to continue dollar cost averaging, but I find it difficult to track actual gains of specific lots. Am I looking at this wrong? I could sell off in to an equivalent gain, but then I&#39;d have to pay taxes. Or I could just start buying in to the ETF and let the MF sit, but then I have obvious overlap, but maybe that&#39;s OK, although it makes my portfolio larger. </p>\n\n<p>Does the MF give me something over an ETF? </p>\n\n<p>This is a personal investment account.</p>\n</div><!-- SC_ON -->",
  "score": 95,
  "permalink": "/r/investing/comments/ljouz3/cost_basis_and_tracking_gains_mutual_fund_vs_etf/",
  "subreddit": "investing",
  "id": "ljouz3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728621140
}