{
  "author": "_MelvinCapital",
  "the_new_excerpt": "I've chased meme stocks this year and had some great success, which was then\nevaportated by chasing more meme stocks and turned into a loss.\n\nAs a result, on Friday, I went safe. I split my entire potfolio across \"safe\"\nlong term S&P500 etf's, along with high dividend low volatility and FTSE…",
  "original_created_utc": 1620856938,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年はミーム銘柄を追いかけて大成功を収めましたが、その後、さらにミーム銘柄を追いかけて損失になりました。\nそれが、さらにミーム銘柄を追いかけたことで、損失になってしまった。\n\nその結果、金曜日には安全策を取りました。私の全ポートフォリオを \"安全 \"に分けました。\nS&P500の長期ETFと、高配当・低ボラティリティのFTSE...",
      "title": "現在の市場全体のボラティリティについて、どの程度心配していますか？暴落したのは私のせいです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今年，我一直在追寻纪念性股票，并取得了一些巨大的成功，但随后\n然后通过追逐更多纪念品股票而蒸发，变成了损失。\n\n因此，在周五，我选择了安全。我把我的全部投资组合分给了 \"安全的\"\n长期的S&P500 etf's，以及高股息低波动和富时指数。",
      "title": "你对目前整个市场的波动有多担心？Btw 这是我的错，是崩溃的原因。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今年，我一直在追尋紀念性股票，並取得了一些巨大的成功，但隨後\n然後通過追逐更多紀念品股票而蒸發，變成了損失。\n\n因此，在週五，我選擇了安全。我把我的全部投資組合分給了 \"安全的\"\n長期的S&P500 etf's，以及高股息低波動和富時指數。",
      "title": "你對目前整個市場的波動有多擔心？Btw 這是我的錯，是崩潰的原因。"
    }
  ],
  "title": "How worried are you about the current volatility across the market? Btw it's my fault for the crash.",
  "created_utc": 1620901870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve chased meme stocks this year and had some great success, which was then evaportated by chasing more meme stocks and turned into a loss.</p>\n\n<p>As a result, on Friday, I went safe. I split my entire potfolio across &quot;safe&quot; long term S&amp;P500 etf&#39;s, along with high dividend low volatility and FTSE ETF&#39;s also. I threw in a bit to things like Microsoft, Google and Berkshire aswell.</p>\n\n<p>Because I did this on Friday, the market has taken a dump all week, so I&#39;m sorry for that guys.</p>\n\n<p>I know this is a long term play, and I shouldnt be worried about the market taking a dump 3 days into my investment, but for the long term outlook, how are you guys thinking about the next 3-12 months?</p>\n\n<p>I know etf&#39;s should be held for years, but nobody can predict what will happen in 2028 so i&#39;m just curious about people&#39;s feelings for the rest of this year. Is this just a blip or the start of a huge plummet?</p>\n</div><!-- SC_ON -->",
  "score": 50,
  "permalink": "/r/stocks/comments/nb0p47/how_worried_are_you_about_the_current_volatility/",
  "subreddit": "stocks",
  "id": "nb0p47",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803279
}