{
  "author": "gdj11",
  "the_new_excerpt": "It’s easy to get caught up in the “buying crypto is investing in your future”\nmindset that’s often repeated here and convince yourself that you’re making wise\nfinancial decisions with any crypto purchase you make.\n\nI come from a family of gambling addicts and I’m very aware of the tricks they\nplay,…",
  "original_created_utc": 1620533419,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の購入は将来への投資」という考え方にとらわれがちです。\nここでよく言われている「暗号を買うことは未来への投資」という考え方にとらわれて、自分は賢い金融判断をしていると思い込んでしまいがちです。\n私はギャンブル中毒の家系なので、このようなことはありません。\n\n私はギャンブル依存症の家系なので、ギャンブル依存症が仕掛けるトリックをよく知っています。\n...",
      "title": "一攫千金を狙ってミームコインを購入するのは、投資ではなくギャンブルです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你很容易陷入 \"购买加密货币就是投资你的未来 \"的心态中。\n这里经常重复的心态，并说服自己，你的任何加密货币购买都是明智的\n的财务决策。\n\n我来自一个赌博成瘾的家庭，我非常清楚他们的伎俩\n的把戏，...",
      "title": "如果你购买纪念币，希望发财，你不是在投资，而是在赌博。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你很容易陷入 \"購買加密貨幣就是投資你的未來 \"的心態中。\n這裏經常重複的心態，並說服自己，你的任何加密貨幣購買都是明智的\n的財務決策。\n\n我來自一個賭博成癮的家庭，我非常清楚他們的伎倆\n的把戲，...",
      "title": "如果你購買紀念幣，希望發財，你不是在投資，而是在賭博。"
    }
  ],
  "title": "If you’re buying meme coins in hope of striking it rich, you’re not investing, you’re gambling.",
  "created_utc": 1620545429,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It’s easy to get caught up in the “buying crypto is investing in your future” mindset that’s often repeated here and convince yourself that you’re making wise financial decisions with any crypto purchase you make.</p>\n\n<p>I come from a family of gambling addicts and I’m very aware of the tricks they play, often on themselves, to convince themselves or others that they’re not actually gambling. “This is my entertainment” is an often repeated excuse they tell themselves as they’re transferring money out of their bank a 2nd time. “I’ve put in so much time that statistically I’m bound to win at any moment” is another lie they tell themselves. These are all signs of gambling addiction and I see it everywhere here. Just because you’re buying crypto does not mean it’s not gambling.</p>\n\n<p>Please try to think objectively about what you’re doing and don’t let yourself lie to yourself.</p>\n</div><!-- SC_ON -->",
  "score": 2148,
  "permalink": "/r/CryptoCurrency/comments/n864gy/if_youre_buying_meme_coins_in_hope_of_striking_it/",
  "subreddit": "CryptoCurrency",
  "id": "n864gy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985990899
}