{
  "author": "LavenderAutist",
  "the_new_excerpt": "FNKO (Funko [https://www.cnbc.com/2021/03/11/funko-fnko-q4-2020-earnings.html])\n\nShare Price (3/12/21) : $17.77\n\nShare Price (09/16/19) : $27.86\n\nShort Interest (1/26/21) : 12%\n\nNext Earnings Release: May 2021\n\nUpdating two previous DD posts on Funko Toys with new information based on their\nlatest…",
  "original_created_utc": 1615669224,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "FNKO (Funko [https://www.cnbc.com/2021/03/11/funko-fnko-q4-2020-earnings.html])\n\n股价 (3/12/21) : $17.77\n\n股价 (09/16/19) : $27.86\n\n短线利息 (1/26/21) : 12％的利息\n\n下一次财报发布。2021年5月\n\n更新之前两篇关于Funko玩具的DD文章，根据其新的信息，更新了\n最新...",
      "title": "DD - FNKO在2021年推出NFTs"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "FNKO (Funko [https://www.cnbc.com/2021/03/11/funko-fnko-q4-2020-earnings.html])\n\n股價 (3/12/21) : $17.77\n\n股價 (09/16/19) : $27.86\n\n短線利息 (1/26/21) : 12％的利息\n\n下一次財報發佈。2021年5月\n\n更新之前兩篇關於Funko玩具的DD文章，根據其新的信息，更新了\n最新...",
      "title": "DD - FNKO在2021年推出NFTs"
    }
  ],
  "title": "DD - FNKO Launching NFTs in 2021",
  "created_utc": 1615717712,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>FNKO (<a href=\"https://www.cnbc.com/2021/03/11/funko-fnko-q4-2020-earnings.html\">Funko</a>)</p>\n\n<p>Share Price (3/12/21) : $17.77</p>\n\n<p>Share Price (09/16/19) : $27.86</p>\n\n<p>Short Interest (1/26/21) : 12%</p>\n\n<p>Next Earnings Release: May 2021</p>\n\n<p>Updating two previous DD posts on Funko Toys with new information based on their latest conference call earlier this week (<a href=\"https://www.reddit.com/r/smallstreetbets/comments/l8fems/dd_funko_toys/?utm_medium=android_app&amp;utm_source=share\">DD1</a>, <a href=\"https://www.reddit.com/r/smallstreetbets/comments/lgm5db/new_info_funko_toys_dd/\">DD2</a>).</p>\n\n<p>Funko is well positioned for continued growth in 2021 with potential upside from entering the hot NFT market “fairly soon.”</p>\n\n<p>(TL;DR at the end)</p>\n\n<h1></h1>\n\n<p>Here are some highlights from their Q4 earnings report (3/11), Q4 earnings call (3/11), and an interview with the CEO this morning (3/12) with additional information on each bullet further down in the post (For more context please review the prior DDs linked above):</p>\n\n<p>· Funko beat expectations with its second highest revenue quarter ever</p>\n\n<p>· Growth is expected continue in 2021; driven by Europe, Loungefly, and other initiatives</p>\n\n<p>· Operational responsiveness and flexibility has allowed Funko to thrive during the pandemic while providing a way to engage with fans in new and more creative ways</p>\n\n<p>· Multiple analysts increased their price targets on the stock after the earnings release</p>\n\n<p>· Funko’s CEO Brian Mariotti announced the day after earnings that Funko intends to move into the NFT (Non-Fungible Token) market “fairly soon”</p>\n\n<h1></h1>\n\n<p>FUNKO BEATS EXPECTATIONS</p>\n\n<p>· Net Sales in Q4 2020 was up 6% vs Q4 2019 to $226 million</p>\n\n<p>o This represented Funko’s second highest revenue quarter in its history</p>\n\n<p>o Outperformance was driven by the US market which had its highest revenue quarter in history and grew 18% vs. Q4 2019</p>\n\n<p>o International was constrained by lockdowns; but still grew 10% vs. Q3 2020</p>\n\n<p>o Non-figure product revenue grew 30% in the quarter vs Q4 2019</p>\n\n<p>· Gross margins increased 37.2% in Q4 2020 vs. 29.2% in Q4 2019</p>\n\n<p>· SG&amp;A decreased 6% to $53 million</p>\n\n<p>· Cash Flow From Operations increased 69% to $47 million</p>\n\n<p>· Funko’s direct-to-consumer sales nearly doubled compared to the prior year</p>\n\n<p>GROWTH EXPECTED TO CONTINUE IN 2021</p>\n\n<p>· Funko is forecasting 30% revenue growth in Q1 2021 (vs. Q1 2020)</p>\n\n<p>· Full year sales growth is forecasted at between 25-30%</p>\n\n<p>· Gross margin is expected to strengthen in 2021; driven by Funko’s direct-to-consumer initiative and from regional / distribution mix shifts</p>\n\n<p>· Full year adjusted EBITDA is expected to increase 120 to 170 basis points to between 13.5% and 14.0%</p>\n\n<p>· Many major Television, Film, and other properties held back because of the pandemic are expected to return as the economy opens up. This will create demand for new purchases.</p>\n\n<p>o Marvel: It is expected that Marvel will be releasing about 5 new television shows on Disney + this year and another 5 films theatrically.</p>\n\n<p>o Games: Several hot game properties will be releases later this year that will create more content from which to create Funko toys</p>\n\n<p>o Other: Funko is always making deals for new IP licenses and expects to make a “major master toy announcement” fairly soon</p>\n\n<p>· Loungefly and Snapsies product lines continue to grow and provide additional avenues for Funko to drive more sales growth</p>\n\n<p>FUNKO THRIVES DURING THE PANDEMIC</p>\n\n<p>· Despite many major releases throughout the pandemic beyond The Mandalorian, Funko was still able to drive significant purchase activity of it’s brand and products</p>\n\n<p>o Evergreen content represented 68% of sales. (Evergreen content is essentially licensed properties that don’t have a major release associated with them at the time. For example, Harry Potter and The Office would be examples of Evergreen Television properties sold last quarter.)</p>\n\n<p>o As the economy opens up, Funko expects more properties to become available for licensing and product development</p>\n\n<p>· Funko was able to accelerate its move to create a direct-to-consumer website for Funko products in Europe ahead by two years ahead of schedule</p>\n\n<p>o FunkoEurope.com was launched in Q4 2020 (October); allowing Funko grow its sales in Europe despite lockdowns</p>\n\n<p>o Given that Funko’s direct-to-consumer site just launched, we can expect continued growth back to pre-pandemic levels in Europe over time as Funko drives traffic to its website and countries open back up from lockdown</p>\n\n<p>o Five months ago, Funko started in three EMEA countries and has since expanded to eight countries in the region</p>\n\n<p>· Funko’s diversification into other products like Loungefly bags and board games help Funko maintain growth during the pandemic</p>\n\n<p>o Non-figure products represented 23% of revenues</p>\n\n<p>o Funko’s expanded games portfolio grew 50%</p>\n\n<p>o Loungefly grew 55% in Q4</p>\n\n<p>-- Funko will be expanding its Loungefly relationship with Amazon this year</p>\n\n<p>-- Loungefly is seeing strong demand across EMEA and other regions</p>\n\n<p>o In board games, Funko launched new titles like Marvel Battleworld, Godzilla, Tokyo Clash, and Back To The Future to name a few</p>\n\n<p>· Funko’s overall e-commerce and direct-to-consumer business continued to perform well, expanding on strong Q3 2020 performance</p>\n\n<p>o Total direct-to-consumer sales were 8% of revenues in 2020 vs. 4% the prior year</p>\n\n<p>o Global mass market and third party e-commerce helped drive growth in 2020 as it represented 35% of sales in 2020 vs. 28% in 2019</p>\n\n<p>· Funko adjusted by finding new ways to connect with fans during the pandemic as in-person events like San Diego Comicon were not possible</p>\n\n<p>-- “Virtual cons” in connection with Comicon in San Diego, New York, and Emerald City were successful in driving revenue increases</p>\n\n<p>-- Social media promotions helped drive increased engagement / awareness</p>\n\n<p>-- In lieu of attending New York Toy Fair, Funko decided to host its first ever virtual “Funko Fair” where they partnered with their licensors and retailers to engage fans and launch new offerings.</p>\n\n<p>· The event was a big success leading to nearly 1.5 million units being pre-sold to fans through retail partners. Many of those items sold are still six to nine months away from being released.</p>\n\n<p>· Funko launched “Funko Pop Albums” in 2020 where they release Pop! versions of classic album covers</p>\n\n<p>o For example, the AC/DC’s classic “Black In Black” record was Funko’s top collectible item at one of their key mass market retailers</p>\n\n<p>o Given the strong initial fan reaction, Funko plans to expand the concept across new genres including sports, trading cards, and comic book covers</p>\n\n<p>MULTIPLE ANALYSTS INCREASE THEIR PRICE TARGETS</p>\n\n<p>· Goldman Sachs analyst Michael Ng</p>\n\n<p>o Raised the target price 130% to $15.30 (from $6.60)</p>\n\n<p>o Q4 EBITDA beat expectations</p>\n\n<p>o Impressed by Funko’s ability to pivot during the pandemic by leaning into e-commerce, games, and soft goods</p>\n\n<p>· DA Davidson analyst Lind Bolton Weiser</p>\n\n<p>o Raised the target price 142% to $17.00 (from $7.00)</p>\n\n<p>o Boosting their modeled multiple to 17-times earnings (from 9-times earnings)</p>\n\n<p>o Believes the company is returning to growth while improving its fundamentals</p>\n\n<p>· Truist analyst Michael Swartz</p>\n\n<p>o Raised the target price 38% to $18.00 (from $13.00)</p>\n\n<p>o Funko reported a much better than anticipated Q4 and 2021 guidance</p>\n\n<p>o Looks well positioned for the year ahead given the strong theatrical line-up, easy comps, product expansion initiatives, and the favorable impact of its high-growth DTC platform</p>\n\n<p>· Piper Sandler analyst Erinn Murphy</p>\n\n<p>o Raised the target price 46% to $22.00 (from $15.00)</p>\n\n<p>o Strong Q4 results</p>\n\n<h1></h1>\n\n<p><em>(At this point my post moves away from more traditional fundamental analysis / information towards more speculative types of things. While I do not really understand the fascination with cryptos nor NFT’s themselves, I do recognize that valuations throughout financial markets have deviated significantly from how I might value them based on more traditional metrics like price-to-earnings ratios or discounted free-cash-flow. Obviously, Tesla, AMC, and GameStop are recent examples of this in the stock market. Crpytos, sports cards, and Pokemon cards are recent examples in other markets (where there isn’t really any cashflow or profit stream intrinsic to the underlying asset from which to determine value). So, if you decide to purchase the stock based on factors outside of fundamental analysis, like momentum and meme-ability, please make sure to position size and be careful. As they say, return-of-capital is just as important as return-on-capital. So, once you move away from fundamental analysis to determine entry and exit into a position, the decision becomes primarily one based on emotion and “gut feel.” Finally, here are two books that I recommend on understanding market bubbles.</em> <a href=\"https://www.amazon.com/Devil-Take-Hindmost-Financial-Speculation/dp/0452281806\">BOOK 1</a><em>.</em> <a href=\"https://www.amazon.com/Manias-Panics-Crashes-History-Financial/dp/1137525754/ref=tmm_pap_swatch_0?_encoding=UTF8&amp;qid=&amp;sr=\">BOOK 2</a><em>. That’s all for my PSA. I’ll get off my soapbox now and go back to the DD. Thank you for reading. Obviously, the news today that Funko plans to enter the NFT marketplace soon is an important announcement. So any DD without incorporating NFT’s into it would clearly be incomplete.)</em></p>\n\n<h1></h1>\n\n<p>FUNKO MOVING INTO NFTs “FAIRLY SOON”</p>\n\n<p>There aren’t many publicly traded companies that I can think of at this point playing in the NFT space. You have companies like Square and Paypal getting into cryptos from traditional fintech. You have companies with a core business outside of cryptos like MicroStrategy and Tesla buying Bitcoin for their treasury. Then you have others like Coinbase and Grayscale Bitcoin Trust who were born from the crypto world. But there none I can think of that are tied directly to NFT’s right now other than Funko.</p>\n\n<p><em>(If you can think of any other publicly traded companies that have announced their intention to move into NFT’s, please post their names in the comments below. Thank you.)</em></p>\n\n<p>After today’s <a href=\"https://finance.yahoo.com/video/funko-ceo-ability-disrupt-nft-151936943.html\">interview</a> with CEO Brian Mariotti (quote at the end of this section), Funko seems to have the NFT market clearly in its sights. As we have seen with many other crpyto-related stocks, a company’s share price can swing wildly on a small announcement and the volatility can be extreme. If Funko issues a press release or makes a formal announcement about a new NFT product, the share price could move quickly one way or the other. Because of this, there is clearly additional value beyond its core physical Pops and Loungefly businesses that could be added to Funko’s valuation.</p>\n\n<p>I don’t even know how to begin to estimate the potential value of NFT’s on Funko’s stock price. So instead of doing that, I will try to provide some information and research on recent activity in the NFT space. Hopefully this will be useful to you in deciding whether you would like to incorporate NFT’s in the estimate of what you think Funko is worth. </p>\n\n<p>Highlights of recent NFT milestones and news events:</p>\n\n<p>· Beeple is the poster child of NFT right now as he recently sold his NFT for $69 million (<a href=\"https://www.npr.org/2021/03/11/976141522/beeple-jpg-file-sells-for-69-million-setting-crypto-art-record\">Here</a>)</p>\n\n<p>· NBA launches NBA Top Shots where people can buy NFTs highlights of basketball plays. This guy turned $175k into $20 million in value. (<a href=\"https://www.wsj.com/articles/nba-top-shot-nft-crypto-digital-collectibles-11615266042\">Here</a>)</p>\n\n<p>· Goldin Auctions getting into NFTs after dominating physical sports card auctions</p>\n\n<p>· Elon Musk’s girlfriend Grimes (a singer) sold $5.8 million in NFT art in 20 minutes (<a href=\"https://www.businessinsider.com/grimes-nft-art-warnymph-sells-for-millions-20-minutes-2021-3\">Here</a>)</p>\n\n<p>· Jack Dorsey is auctioning off the very first tweet as an NFT (<a href=\"https://www.theverge.com/2021/3/9/22321464/jack-dorsey-nft-tweet-auction-bitcoin-donate-charity\">Here</a>)</p>\n\n<p>· Nyan cat sells for $600,000 (<a href=\"https://www.businessinsider.com/bad-luck-brian-meme-nft-crypto-art-blockchain-ethereum-foundation-2021-3\">Here</a>)</p>\n\n<p>· Crypto Punks are sold for values from tens of thousands to millions of dollars (<a href=\"https://www.larvalabs.com/cryptopunks/topsales\">Here</a>)</p>\n\n<p>· CryptoKitties can sell for thousands or more (<a href=\"https://www.cryptokitties.co/\">Here</a>)</p>\n\n<p>· A start-up raises $5 million to create a fantasy-based NFT video game (<a href=\"https://venturebeat.com/2021/03/11/illuviam-raises-5-million-for-nft-based-fantasy-battle-game/\">Here</a>)</p>\n\n<p>· Video game items and real estate being purchased as NFTs, potentially changing how games are developed and monetized (<a href=\"https://venturebeat.com/2021/02/26/the-deanbeat-how-non-fungible-tokens-nfts-will-change-games/\">Here</a>)</p>\n\n<p>· Investment funds are being created to invest in NFTs (<a href=\"https://markets.businessinsider.com/currencies/news/what-are-risks-of-investing-in-nft-2021-3-1030187329\">Here</a>)</p>\n\n<p>· DC Comics tells artists not to create NFTs based on their IP while it researches the space; suggesting that DC Comics may already have NFT deals pending announcement or in negotiations (<a href=\"https://io9.gizmodo.com/dc-comics-tells-artists-to-stay-out-of-nft-business-or-1846466427\">Here</a>)</p>\n\n<p>Celebrities, famous people, and others talking about or playing in the NFT space:</p>\n\n<p><a href=\"https://www.businessinsider.com/post-selloff-investing-cathie-wood-nfts-trading-tips-insider-investing-2021-3\">Cathie Wood</a></p>\n\n<p><a href=\"https://markets.businessinsider.com/currencies/news/gary-vaynerchuk-nfts-bitcoin-regulation-coinbase-cheddar-interview-2021-3-1030186922\">Gary Vee</a></p>\n\n<p><a href=\"https://www.entrepreneur.com/article/367085\">Rob Gronkowski</a></p>\n\n<p><a href=\"https://www.prnewswire.com/news-releases/william-shatner-makes-history-on-the-wax-blockchain-301103510.html\">William Shatner</a></p>\n\n<p><a href=\"https://www.cnbc.com/2021/02/22/mark-cuban-the-business-id-start-now-would-center-around-blockchain.html\">Mark Cuban</a></p>\n\n<p><a href=\"https://www.cnbc.com/2021/03/12/patrick-mahomes-to-sell-nft-trading-cards.html\">Patrick Mahomes</a></p>\n\n<p><a href=\"https://www.forbes.com/sites/lawrencewintermeyer/2021/02/12/non-fungible-token-market-booms-as-big-names-join-cryptos-newest-craze/?sh=22ac801f460a\">Lindsey Lohan</a></p>\n\n<p>Potential impact of NFT’s on Funko’s go-to-market strategy (speculating on how Funko MIGHT implement NFT’s to expand and reinforce their business model):</p>\n\n<p>· Digital items have the ability to move globally in an instant; increasing the total addressable market. Both for Funko and for collectors.</p>\n\n<p>o For Funko it allows them to sell into harder to reach markets like Latin America, Africa, and Asia. There are probably wealthy collectors in many countries that want to own Funko and Loungefly products, but don’t have immediate access.</p>\n\n<p>o For collectors, it allows them to buy and sell digital items across the world instantly without having to wait on receiving a physical item. </p>\n\n<p>· All collectibles and art have concerns with fakes and counterfeits. By using blockchain technology and NFT’s, Funko can reduce the impact of counterfeiters on their business. When someone purchases a rare item, their NFT can serve as certification of its authenticity through the blockchain.</p>\n\n<p>· NFT’s allow Funko to move to blockchain based payment systems and tap wealthy investors looking to diversify out of their crypto coin holdings into physical and digital items.</p>\n\n<p>o There are many wealthy crypto investors that are looking to park their money in other investments to diversify their portfolio.</p>\n\n<p>o Additionally, there are other investors that are not currently investing in cryptos and blockchain that might be interesting in a solution that merges a rare physical item with a rare digital NFT.</p>\n\n<p>· NFT “artists” or “creators” can collect a piece of the revenue each time the specific digital asset turns over. For example, if Funko made an NFT and it was sold 20 times over the course of a year, a company Funko might collect a fee every time the NFT were sold (depending on how the system were structured).</p>\n\n<p>o Funko NFTs could be sold directly to the consumer through Funko’s website or (what I think is more likely) through retail partners like GameStop, Target, Walmart, Hot Topic, and other retailers looking to get in on the NFT craze.</p>\n\n<p>Quote from Funko’s CEO <a href=\"https://finance.yahoo.com/video/funko-ceo-ability-disrupt-nft-151936943.html\">interview</a> about NFT’s:</p>\n\n<p>“We’re excited about it and we have a plan in place. We have some technology in place. We are going to be out in the market fairly soon. But we’re going to out in the market in a very different way. We have the ability to disrupt this space in a way that nobody else is doing right now. We can tie digital NFT’s to our fan base and link NFT’s with physical products. And that’s not happening right now. So, for example, if you had a pack of NFT’s. I won’t mention licenses. And there are a few rare ones. If you have those rare ones, we’re going to give you a free product that is tied to that rare NFT. Which means you have a super rare physical product that ties to your super rare NFT. That’s disruptive. That’s new. It’s different. It’s only what Funko can do. And we’re really excited about what the future of NFT’s are. We’re certainly all over this. And I think you’ll see fairly soon from Funko in the market.”</p>\n\n<p>TL;DR:</p>\n\n<p>As expected, Funko had a strong Q4 2020, driven by continued strength in their core product line and e-commerce sales in the US market. Funko’s sales are expected to continue to grow in 2021 as the company builds upon its wins from the second half of 2020. Funko’s international business represents an area of additional opportunity as the company has not fully recovered from sales declines in the region yet. Continued development of Funko’s direct-to-consumer initiatives in Europe along with store reopenings after lockdowns should remedy this.</p>\n\n<p>While Funko has not formally announced their entry into the NFT market with a press release, thier CEO&#39;s interview with Yahoo Finance suggests that the company soon will. Funko announcing their entry into NFT’s would probably drive more attention to the stock and more investors to Funko products. At that point Funko would become more than just a “toy company.” They would become a collectibles company making products for the NFT marketplace. Many products made by Funko already command a significant premium in the secondary market. (Some examples: <a href=\"https://www.ebay.com/itm/Disney-Cast-Member-Exclusive-LE-600-Mickey-90th-Anniversary-Loungefly-Backpack/353336689947?hash=item524482051b:g:hj4AAOSwTu9fyDep\">Disney Bag 1</a>, <a href=\"https://www.ebay.com/itm/NWT-Disney-Loungefly-Sleeping-Beauty-DEC-Employee-Backpack/373488324364?hash=item56f5a38f0c:g:eWIAAOSw3qVgRW30\">Disney Bag 2</a>, <a href=\"https://www.ebay.com/itm/Funko-Freddy-Bloody-leatherface-POP-Exclusive-12-PIECES-EXTREMELY-RARE/143968624938?hash=item218532e12a:g:RgIAAOSwEiNgQco-\">Funko 1</a>, <a href=\"https://www.ebay.com/itm/FUNKO-Pop-Games-Fortnite-VALOR-463-Vinyl-Figure-NIB/392842180285?epid=15027456221&amp;hash=item5b7737f6bd:g:wRMAAOSwc7Ve6lE9\">Funko 2</a>, <a href=\"https://www.ebay.com/itm/Funko-POP-Star-Wars-Holographic-Darth-Maul-SDCC-480pcs/133480926875?hash=item1f14154e9b:g:JjMAAOSwfYpfJMGL\">Funko 3</a>). Imagine what could happen to prices if those same products were combined with accompanying NFTs. This new opportunity with NFT’s provides optionality on an already stable core business of collectible toys, games, and merchandise.</p>\n\n<p>Positions: Long Shares &amp; Calls</p>\n\n<p>Disclosure: I am long FNKO. This is not investment advice. I reserve the right to buy or sell FNKO without updating this thread. Do your own research and share (or not share) with the community in this thread. Thank you to the others on Reddit that shared this idea earlier.</p>\n\n<p>Feedback: If you have any additional information, ideas, or critiques please make sure to comment. It is great to get the perspective of others when making an investment.</p>\n\n<p>Previous DD:</p>\n\n<p><a href=\"https://www.reddit.com/r/smallstreetbets/comments/l8fems/dd_funko_toys/\">FNKO 1</a></p>\n\n<p><a href=\"https://www.reddit.com/r/smallstreetbets/comments/lgm5db/new_info_funko_toys_dd/\">FNKO 2</a></p>\n\n<p><a href=\"https://www.reddit.com/r/smallstreetbets/comments/hdllcr/herman_miller_mlhr_work_from_home_in_your_new/\">Herman Miller</a></p>\n</div><!-- SC_ON -->",
  "score": 66,
  "permalink": "/r/stocks/comments/m4fb1a/dd_fnko_launching_nfts_in_2021/",
  "subreddit": "stocks",
  "id": "m4fb1a",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382520
}