{
  "author": "JellySea6682",
  "the_new_excerpt": "So a year and a half ago, I became friends with two people who I genuinely\nenjoyed and likde, in general, and those two happened to be transexual (women\nwho were originally men...although me thinking that is apparently transphobic,\nmore details later...). I never was convinced about social sciences…",
  "original_created_utc": 1614350389,
  "localize": [
    {
      "locale": "zh",
      "title": "我的朋友告诉我，我是变性人......但我是吗？",
      "the_new_excerpt": "所以一年半以前，我和两个人成为朋友，我真的很喜欢他们，也很喜欢他们。\n这两个人恰好是变性人（原本是男人的女人。\n原本是男人......虽然我认为这显然是变性人的行为。\n更多的细节在后面......）。我从来没有对社会科学感到信服......"
    },
    {
      "locale": "zh-Hant",
      "title": "我的朋友告訴我，我是變性人......但我是嗎？",
      "the_new_excerpt": "所以一年半以前，我和兩個人成爲朋友，我真的很喜歡他們，也很喜歡他們。\n這兩個人恰好是變性人（原本是男人的女人。\n原本是男人......雖然我認爲這顯然是變性人的行爲。\n更多的細節在後面......）。我從來沒有對社會科學感到信服......"
    }
  ],
  "title": "My friends told me that I'm transphobic...but am I?",
  "created_utc": 1614357871,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So a year and a half ago, I became friends with two people who I genuinely enjoyed and likde, in general, and those two happened to be transexual (women who were originally men...although me thinking that is apparently transphobic, more details later...). I never was convinced about social sciences and gender studies in general, but I really didn&#39;t care at all: those were two human beings who I considered as friends, so just using the pronoun &quot;she&quot; instead of &quot;he&quot;, EVEN if I was not convinced of anything, really was no big deal, and I never once felt uncomfortable using the said pronouns...</p>\n\n<p>...however, very recently, I ended up asking questions, via a skype group (in which we&#39;re very active) about the very concept of transgender and transexuality, as well as (no surprise here) transphobia: people from the trans and lgbtq++ community kept telling us &quot;cisgenders&quot; that not wanting to have sex with a trans person was transphobic, that being attracted to people because of their ethnicity (being particularly attracted to a latina girl, for example) was racist, and that IF I was just tolerant of their gender and nothing else, which means I did not really believe in it but pretended to because I simply didn&#39;t want to hurt that person&#39;s feeling... THEN, I was transphobic.</p>\n\n<p>I said that I had trouble with the concept of gender in general, and that I indeed didn&#39;t want to have sex with a trans person, but that it was my taste, and my own...to which, people told me that it was a transphobic behavior. I also said that I&#39;ll admit taking into account the fact that, before their transition, trans people were either biologically men or women...but apparently they never were to begin with and it&#39;s insulting and oppressive to think so, it would seem that the proper way to say it is that they were &quot;assigned as a man/woman&quot; at birth...the conversation went on and on and on...but I probably shouldn&#39;t have asked so many questions and I definitely shouldn&#39;t have mentioned how I really felt about the entire thing. I didn&#39;t want to hurt anyone, but I can see how it could, since trans people have to deal with people like me all the time: everyone&#39;s patience has a limit.</p>\n\n<p>Later that day, after that debate ended, the people I thought were my friends ended up sending me a message, telling me they didn&#39;t want to hear from me, to talk to me, or to deal with me anymore, because what I said was transphobic, as being tolerant is not good enough, it just doesn&#39;t cut it: if I can&#39;t be &quot;inclusive&quot;, which means convince myself that they&#39;re 100% like any woman out there, which implies that I could have sex with them (or any trans people), then I&#39;m still transphobic, as I&#39;m &quot;denying their very existence&quot;.</p>\n\n<p>So apparently I hurt them...I hurt them a lot, according to them, but their rejection hurt quite a bit as well, as I still care about them.</p>\n\n<p>What should I make of all this, and what should I do?</p>\n\n<p><strong>NB: I just want to clarify, as it&#39;s very important: neither of my friends wanted to have sex with me at all (I&#39;m pretty sure of that), it&#39;s just that:</strong></p>\n\n<p><strong>1/</strong> for them, not completely accepting them as women, in my mind, was the same as not completely accepting them as women at all, no matter how polite I am and what kind of pronouns I use to respect them.</p>\n\n<p><strong>2/</strong>the  &quot;you&#39;re transphobic if you don&#39;t want to have sex with a trans person&quot; part is what I&#39;ve been told by the group we have debates with, and ALTHOUGH my friends were never sexually interested in me, in the first place, they still don&#39;t like that I said that, and see it as another transphobic behavior.</p>\n\n<p>Just wanted to make that clearer, thank you <sup><sup>.</sup></sup></p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/NoStupidQuestions/comments/lsyzfi/my_friends_told_me_that_im_transphobicbut_am_i/",
  "subreddit": "NoStupidQuestions",
  "id": "lsyzfi",
  "is_self": true,
  "media": null,
  "is_video": false
}