{
  "author": "nickachka",
  "the_new_excerpt": "I honestly thought it was a joke. All because ETH reached an all time high\n(again.) This is the same guy that bought it at $200 and sold at $300 a year\nago. I laughed in response. I have to give him credit because he is the one that\ngot me into crypto in the first place and even told me to buy ETH.…",
  "original_created_utc": 1620745812,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直、ジョークだと思っていました。ETHが史上最高値を記録したからです。\n(またか。)この人は1年前に200ドルで買って300ドルで売った人と同じだ。\n前に。それに対して私は笑いました。彼は私を最初に暗号化に参加させてくれた人なので、彼を信用しなければなりません。\nそもそも私を暗号に引き込んだのは彼ですし、ETH.... を買えとまで言ったのですから。",
      "title": "親父から電話があって、自分のETHの3分の1を売って、この割高な不動産市場に投入するようにと言われて、ビビった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我真的以为这是一个笑话。都是因为ETH达到了历史最高点\n这就是那个一年前在200美元买入、300美元卖出的人。\n前。我笑着回应。我必须给他点赞，因为是他\n让我开始接触加密货币，甚至告诉我购买ETH....。",
      "title": "我爸爸刚刚给我打电话吓坏了，告诉我卖掉三分之一的ETH，把它放在这个价格过高的房地产市场。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我真的以爲這是一個笑話。都是因爲ETH達到了歷史最高點\n這就是那個一年前在200美元買入、300美元賣出的人。\n前。我笑着迴應。我必須給他點贊，因爲是他\n讓我開始接觸加密貨幣，甚至告訴我購買ETH....。",
      "title": "我爸爸剛剛給我打電話嚇壞了，告訴我賣掉三分之一的ETH，把它放在這個價格過高的房地產市場。"
    }
  ],
  "title": "My dad just called me freaking out, telling me to sell a third of my ETH and put it in this overpriced real estate market.",
  "created_utc": 1620782583,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I honestly thought it was a joke. All because ETH reached an all time high (again.) This is the same guy that bought it at $200 and sold at $300 a year ago. I laughed in response. I have to give him credit because he is the one that got me into crypto in the first place and even told me to buy ETH. Selling at $4000 is cutting myself way too short. My job covers all of my expenses so I&#39;m not desperate for money and can wait until it reaches my price target, then sell some and HODL the rest.</p>\n</div><!-- SC_ON -->",
  "score": 241,
  "permalink": "/r/CryptoCurrency/comments/n9z7yz/my_dad_just_called_me_freaking_out_telling_me_to/",
  "subreddit": "CryptoCurrency",
  "id": "n9z7yz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992428
}