{
  "author": "Dudeman2777",
  "original_created_utc": 1638161310,
  "title": "Has anyone taken time off of crypto?",
  "created_utc": 1638237492,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I can’t help but feel addicted to checking the graphs as soon as I wake up, sometimes I can’t sleep because I get so titillated looking at the ups and downs</p>\n\n<p>So my question is..have any of you actually taken a significant amount of time off from checking crypto and come back weeks, months, or even years later revitalized seeing a huge upswing in price? Or unfortunately a big loss? Did you feel the break helped your mental?  I’m not complaining or anything I have control i swear ,I think, anyway I’m just genuinely curious about the community thoughts, I’m in bed eating cereal</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/r4nrdm/has_anyone_taken_time_off_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "r4nrdm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I can’t help but feel addicted to checking the graphs as soon as I wake up,\nsometimes I can’t sleep because I get so titillated looking at the ups and downs\n\nSo my question is..have any of you actually taken a significant amount of time\noff from checking crypto and come back weeks, months, or even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "目覚めたらすぐにグラフをチェックするのが習慣になっています。\n浮き沈みを見ていると興奮してきて眠れないこともあります。\n\nそこで質問ですが、皆さんの中で実際に暗号のチェックをかなりの時間休んで\n実際に暗号のチェックをやめて、数週間、数ヶ月、あるいは...",
      "title": "誰かがcryptoから時間を取ったことがありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不禁沉迷于一觉醒来就查看图表的感觉。\n有时我无法入睡，因为我看到涨跌的时候会很兴奋。\n\n所以我的问题是......你们中是否有人真的花了大量的时间\n暂停查看加密货币，并在数周、数月或甚至......回来时。",
      "title": "有没有人从加密货币中抽出时间来？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不禁沉迷於一覺醒來就查看圖表的感覺。\n有時我無法入睡，因爲我看到漲跌的時候會很興奮。\n\n所以我的問題是......你們中是否有人真的花了大量的時間\n暫停查看加密貨幣，並在數週、數月或甚至......回來時。",
      "title": "有沒有人從加密貨幣中抽出時間來？"
    }
  ]
}