{
  "author": "Additional-Apple-492",
  "original_created_utc": 1638583786,
  "title": "Read this if you’re scared...",
  "created_utc": 1638641949,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Best advice I ever received on Bitcoin.   My dad said if milk was typically $4 and suddenly it was $3 how would you feel?   I told him I would buy some.   He then said if next week it was $8 and everyone and their mom was rushing to buy it what would you think.  I said I would probably be confused.  He said to treat Bitcoin like how you would treat your groceries, buy all the sales and just chill when everyone is talking about it after it goes up rapidly.   I bought the absolute top in 2013 and panic sold the bottom lol.   But then learned more about BTC and bought back in around $9000 after 2017 bull run.  Just hodl and buy the dips.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 192,
  "permalink": "/r/Bitcoin/comments/r8f10c/read_this_if_youre_scared/",
  "subreddit": "Bitcoin",
  "id": "r8f10c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Best advice I ever received on Bitcoin. My dad said if milk was typically $4 and\nsuddenly it was $3 how would you feel? I told him I would buy some. He then said\nif next week it was $8 and everyone and their mom was rushing to buy it what\nwould you think. I said I would probably be confused. He…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインについて最高のアドバイスをもらった。私の父は言いました 牛乳が通常4ドルで\n突然3ドルになったとき、あなたはどう思いますか？と聞かれたので、「買うよ」と答えました。すると彼はこう言いました。\n来週には8ドルになって、みんなとその母親が急いで買うとしたら？\nと思うでしょう。私は「多分、混乱するだろう」と言いました。彼は...",
      "title": "怖いもの見たさで読んでみてください...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我收到的关于比特币的最佳建议。我父亲说，如果牛奶通常是4美元，而\n突然变成3美元，你会有什么感觉？我告诉他我会买一些。他接着说\n如果下周牛奶是8美元，每个人和他们的妈妈都抢着去买，你会怎么想？\n你会怎么想。我说我可能会感到困惑。他...",
      "title": "如果你害怕，就读这个..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我收到的關於比特幣的最佳建議。我父親說，如果牛奶通常是4美元，而\n突然變成3美元，你會有什麼感覺？我告訴他我會買一些。他接着說\n如果下週牛奶是8美元，每個人和他們的媽媽都搶着去買，你會怎麼想？\n你會怎麼想。我說我可能會感到困惑。他...",
      "title": "如果你害怕，就讀這個..."
    }
  ]
}