{
  "author": "cahlima",
  "the_new_excerpt": "After spending the weekend looking at marijuana stocks to get into before Dems\nmake it legal nationally CRLBF gets my seal of approval.\n\n 1. They sell a ton of gummies and edibles. I don't think legalizing weed is\n    going to drastically change the number of people that smoke it or how they\n    get…",
  "original_created_utc": 1612890816,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "在花了周末的时间看了看大麻股票，在民主党之前进入\n让它在全国合法化 CRLBF得到我的认可。\n\n 1. 他们卖了一吨的口香糖和食用菌。我不认为合法化的杂草是\n    将大幅改变的人的数量，吸烟，或他们是如何\n    得到...",
      "title": "花了一个周末的时间看了一下大麻股，我选出了我的头号狗。Cresco Labs CRLBF"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在花了週末的時間看了看大麻股票，在民主黨之前進入\n讓它在全國合法化 CRLBF得到我的認可。\n\n 1. 他們賣了一噸的口香糖和食用菌。我不認爲合法化的雜草是\n    將大幅改變的人的數量，吸菸，或他們是如何\n    得到...",
      "title": "花了一個週末的時間看了一下大麻股，我選出了我的頭號狗。Cresco Labs CRLBF"
    }
  ],
  "title": "After spending the weekend looking at marijuana stocks I've picked my top dog: Cresco Labs CRLBF",
  "created_utc": 1612896058,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>After spending the weekend looking at marijuana stocks to get into before Dems make it legal nationally CRLBF gets my seal of approval. </p>\n\n<ol>\n<li><p>They sell a ton of gummies and edibles. I don&#39;t think legalizing weed is going to drastically change the number of people that smoke it or how they get it. But most people in states that it is not legal in will get to enjoy edibles that were previously unavailable to them. Also edibles are easy to scale up the manufacturer and distribution of.</p></li>\n<li><p>Cresco is an American company. I think believe that the Canadian companies don&#39;t have as much potential for growth as American ones do. Just my opinion.</p></li>\n<li><p>Cresco is the nation&#39;s largest wholesale distributor. This will be huge when every Tom, Dick and Joe starts opening cannabis shops like starbucks. </p></li>\n<li><p>They are virtically intergraded. This makes them more nimble and gives them the ability to change fast when the time comes. </p></li>\n</ol>\n\n<p>All marijuana stocks are going to go up. I&#39;d be interested in some discussion about some lesser known small caps.</p>\n</div><!-- SC_ON -->",
  "score": 3321,
  "permalink": "/r/investing/comments/lg82wa/after_spending_the_weekend_looking_at_marijuana/",
  "subreddit": "investing",
  "id": "lg82wa",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123199879
}