{
  "author": "FluxRevived",
  "the_new_excerpt": "$WMT - The Cutthroat Expansion of a Monopoly - Walmart Bull Thesis\n\n--------------------------------------------------------------------------------\n\n \n\nGood evening fellas, Professor Flux here, bringing you some quality DD on $WMT.\nI originally wrote this post for /r/WSB, but figured it would also…",
  "original_created_utc": 1615905969,
  "localize": [
    {
      "locale": "zh",
      "title": "$WMT--垄断的割裂式扩张--沃尔玛大牛论文网",
      "the_new_excerpt": "$WMT--垄断企业的割裂式扩张--沃尔玛牛市毕业论文\n\n--------------------------------------------------------------------------------\n\n \n\n大家晚上好，我是Flux教授，给大家带来一些关于$WMT的高质量DD。\n我最初是为/r/WSB写的这篇文章，但我想它也会... ..."
    },
    {
      "locale": "zh-Hant",
      "title": "$WMT--壟斷的割裂式擴張--沃爾瑪大牛論文網",
      "the_new_excerpt": "$WMT--壟斷企業的割裂式擴張--沃爾瑪牛市畢業論文\n\n--------------------------------------------------------------------------------\n\n \n\n大家晚上好，我是Flux教授，給大家帶來一些關於$WMT的高質量DD。\n我最初是爲/r/WSB寫的這篇文章，但我想它也會... ..."
    }
  ],
  "title": "$WMT - The Cutthroat Expansion of a Monopoly - Walmart Bull Thesis",
  "created_utc": 1615923046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>$WMT - The Cutthroat Expansion of a Monopoly - Walmart Bull Thesis</strong></p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>Good evening fellas, Professor Flux here, bringing you some quality DD on $WMT. I originally wrote this post for <a href=\"/r/WSB\">/r/WSB</a>, but figured it would also be useful here. I censored out most of the &quot;ape talk&quot;, but if some slipped through the cracks, let me know and I&#39;ll edit it out! </p>\n\n<p>&nbsp;</p>\n\n<p>Although most people view Walmart as a boring, boomer dividend stock, I strongly believe that they’re poised to reclaim their ATHs over the coming months. What initially caught my eye about this entire play was the <a href=\"https://www.tradingview.com/x/Xu46Tnhv/\">chart</a>. A steep 11% dropoff after earnings led to an aggressive bounce, which was then promptly held at the longtime support level of 132/133. This leads us to the overarching question we need to answer <em>before</em> we get into the DD - Why did Walmart plummet in the first place?</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1>Why did Walmart Plunge?</h1>\n\n<p>Before we get into the DD, it’s important that we understand <em>why</em> Walmart dropped 11% in the first place. With overall sales <em>increasing</em> by 11%, eCommerce sales gapping up by 70%, a 20 billion dollar stock buyback, a dividend hike, and more, it may seem polarizing that Walmart <em>dropped</em> after reporting such strong earnings. </p>\n\n<p>&nbsp;</p>\n\n<p>Unfortunately, it seems as if investors (and algos) weren’t happy about the potential ER guidance, as well as the abundance of covid related costs. It’s no secret that operating expenses went up due to COVID, and as a result, Walmart’s operating margins took a hit to the tune of $1.1 billion. Although temporary, investors didn’t like that COVID related expenses increased due to the overall number of covid cases increasing (go figure). </p>\n\n<p>&nbsp;</p>\n\n<p>Furthermore, in the ER call, Walmart announced they were allocating more money towards future growth, which offput investors (for reasons beyond me). Walmart plans to invest 14 billion dollars to supply chain automation and additional technologies, while also looking to rollout Walmart+ to more users. They’re also looking to increase the average employee wage to above 15$, resulting in better service, and improved quality of life for Walmart employees. Walmart continues to build upon their next generation business model, investing in automation to fuel future sales and earnings growth. Unfortunately, short term investors dislike this, as these investments take away from the potential earnings of 2021, yet those with the foresight to look past this, see this as a viable, and necessary cost for sustained long term growth.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1>Earnings Report Summary</h1>\n\n<p>First things first, we need to go over the ER numbers, which were bullish as fuck. On  February 18th, Walmart reported that :</p>\n\n<ul>\n<li>Overall sales increased by over 11%</li>\n<li>Overall revenue was up 7% on the quarter</li>\n<li>Spending per visit increased by a factor of 22% </li>\n<li>They added <strong>$10 billion dollars to its annual free cash flow</strong>, as that metric jumped to $26 billion from $14.6 billion in the prior year\neCommerce sales increased 70%</li>\n<li>General expenses were <em>lower</em>, resulting in overall operating income increasing by 17%, even after accounting for COVID related expenses</li>\n<li>The dividend was increased for the 48th consecutive year in a row</li>\n<li>They are instantiating a new 20 <strong><em>billion</em></strong> dollar share buyback program</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p>These numbers alone are enough to warrant a <em>jump</em> in Walmart’s share price, but in fact, the opposite occurred, with Walmart tanking 11%. Fortunately for us, this provides us with an awesome dip buying opportunity! From fundamentals, alone Walmart is an awesome investment at this price.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1>Underlying Catalysts</h1>\n\n<p>Luckily for us, aside from rock solid fundamentals, Walmart also has plenty of “hidden” catalysts in store, which could easily lead to a gap up in stock price.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Stimulus</strong></p>\n\n<p>I hate to be that guy using the “stimulus” cop-out, but on average, the new stimulus cheques are going to end up in the pockets of retail stores. Sure, “on paper”, stimulus is going to positively affect <em>all</em> companies, but it’s important to understand that retail stores such as Walmart, Home Depot, Dollar General, etc, tend to <strong>benefit the most from it</strong>. The average American isn’t going to be buying a fucking Tesla, or a brand new iPhone with his newly minted $1400. I’m sure some people will, no doubt, but on average, these stimulus cheques are going to be spent at retail stores, for mundane, everyday things such as groceries, home furnishings, sporting goods, cheap electronics, etc, all of which is supplied by Walmart and similar retailers. Theres is a fuckload of stimulus money hitting the banks of average, everyday Americans, and most of it inevitably <em>will</em> end up being spent at Walmart. If you don’t believe me, the CEO of Walmart literally <a href=\"https://www.marketwatch.com/story/americans-spent-their-stimulus-checks-on-discretionary-goods-such-as-bikes-video-games-and-clothes-target-and-walmart-ceos-say-2020-05-20\">verified all this too.</a></p>\n\n<p>&nbsp;</p>\n\n<p>Another null-point to note is that many “savvy” Americans are going to look to invest their stimulus cheques. Although most cheques will end up getting stolen by MMs, some will still end up being invested in regular ass shares, bringing up the <em>entire</em> market, increasing Walmart’s value with it.</p>\n\n<p>&nbsp;</p>\n\n<p><strong>Partnerships, Expansions, and Diversified Growth Opportunities</strong></p>\n\n<p>Although not explicitly advertised, Walmart has many diversified opportunities for continued growth under their belts. I’m not going to comprehensively write about them all, since each would be an <em>entire</em> DD post in and of itself, but refer to the list below to get a comprehensive summary.</p>\n\n<p>&nbsp;</p>\n\n<ul>\n<li>Back in June, <a href=\"https://techcrunch.com/2020/06/15/walmart-partners-with-shopify-to-expand-its-online-marketplace\">Walmart partnered with Shopify</a>. As a result, thousands of sellers from Shopify would join the Walmart Marketplace, increasing traffic and generating more revenue from fees product transactions.</li>\n<li>In August, <a href=\"https://www.cnbc.com/2020/08/11/walmart-and-instacart-partner-in-fight-against-amazons-whole-foods.html\">Walmart partnered with Instacart</a> to provide same day grocery delivery. This takes market share away from other grocery stores, while also combating services like Amazon Fresh and Amazon Prime. This partnership helps Walmart establish a dominating position in the online grocery market.</li>\n<li>Back in July, <a href=\"https://www.wsj.com/articles/walmart-sells-its-indian-stores-to-flipkart-11595484002\">Walmart acquired a 77% stake in Flipkart</a> allowing Walmart to aggressively expand into India, further growing their business, and profits.</li>\n<li>Along a similar vein, Walmart has been expanding all around the world, to places such as <a href=\"https://www.cnn.com/2019/11/21/business/walmart-china-stores\">China</a> and <a href=\"https://talkbusiness.net/2018/09/walmarts-7-year-gamble-in-africa-slowly-paying-off/\">Africa</a>, creating significant opportunities for the continued growth of the company.</li>\n<li>In North America, <a href=\"https://www.statista.com/topics/1451/walmart/\">Walmart+ is being rolled out to more and more eligible Americans on a month by month basis</a>. Soon enough, all of America will have access to Walmart+, drastically increasing profits.</li>\n</ul>\n\n<p>&nbsp;</p>\n\n<p><strong>The Forgotten TikTok Deal</strong></p>\n\n<p>Remember the whole TikTok debacle? No? Understandable. Although it’s been a while, it’s technically <em>still</em> in play. Although it was promptly swept under the rug after the presidency change, there is still potential for the <a href=\"https://www.cnbc.com/2020/09/21/with-tiktok-deal-walmart-could-gain-a-front-row-seat-to-the-next-generation.html\">TikTok acquisition</a> to go through. As per the original agreement, Walmart will be granted a 7.5% stake in the newly founded company, which would be incredibly bullish for Walmart. Walmart would control and engage in an intensely valued platform, while having a front row seat to the next generation of consumers. The possibilities of this partnership are endless, but for the time being, it’s still in limbo. Regardless, it’s still another point us investors need to consider, as news could come out at any moment, causing Walmart to rocket.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1>An Ideal Entry</h1>\n\n<p>As touched upon in the intro, what initially caught my eye about $WMT <em>before</em> I started my research, was the <a href=\"https://www.tradingview.com/x/Xu46Tnhv/\">price action</a>. After the ER it plunged down to it’s $126 support level, bounced hard, and then came to rest at an even stronger level of support, at $132. This level of support serves perfectly as our entry point. At this level, a move to the downside is <em>extremely</em> unlikely, since algos and institutes gobble up shares likely candy when WMT is trading under $132. Furthermore, even if the price does move against us, we have levels of support at $126 and $125, allowing us to average down on our position in the unlikely event of another downside move. We have an awesome opportunity for entry here, alongside great downside protection.</p>\n\n<p>&nbsp;</p>\n\n<p>There are multiple ways you can play this bounce. You can go with ye old faithful, and “buy the fucking dip” like Warren Buffet does, loading up on shares and reaping the rewards of stock growth and dividends at the same time. Alternatively, for those with a greater stomach for risk, you can look to pick up <strong>$140 C 4/16</strong>, <strong>$140 C 05/21</strong>, or <strong>$160 C 06/18</strong>. Each of these options are relatively cheap, and offer an immense upside. Furthermore, with these longer dated contracts, you won’t get bitten by theta as badly, and will have plenty of time to reap the rewards, and for the price to become ITM.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1>Bearish Counterpoints</h1>\n\n<p>No DD would be complete without a bear thesis. Alongside every bull thesis, there must be a bear thesis, otherwise I’m no better than a pump-and-dumper. In this section I’ll look to address some of the overarching concerns that many investors may have about the stock.</p>\n\n<p>&nbsp;</p>\n\n<p>The various expansions and investments Walmart is making are very expensive in nature. If they fail to succeed in their ventures, it would be a colossal failure, and would ultimately be a huge revenue sink and waste of capital. Although they’re not necessarily difficult or risky, we need these investments and expansions to be successful to ensure the future growth of Walmart as a company. Another thing to consider is that these growth ventures may already be priced in. Although the growth cases for these scenarios have not yet been properly documented, it’s still something we as investors need to consider.</p>\n\n<p>&nbsp;</p>\n\n<p>Next, some are afraid that raising the minimum wage of Walmart employees up to 15$ will eat into company revenues. Although this may be true right out the gate, it will likely be shadowed by the fact that eventually <em>all</em> companies may have to do such a shift due to government policy. Walmart doing this <em>first</em> may initially be a negative, but it will ultimately have to happen at some point down the road. If a minimum wage policy is not enforced by the government, this policy <em>will</em> eat into Walmart&#39;s revenues, but may potentially be offset due to the enhanced quality of employees Walmart may be able to acquire with the newly increased wages. Time will tell.</p>\n\n<p>&nbsp;</p>\n\n<p>Lastly, through Walmart+ and their eCommerce department, Walmart enters a space heavily saturated by specialty online stores, which may currently have the edge over generalist marketplaces. In the short term, while they expand, they’ll have to wrestle away market share from these specialized brands, while retaining customers, which is no easy feat. Fortunately for Walmart, this likely won’t be an issue in the long term (hooray globalization), but short term, it’s still something we as investors need to consider. Furthermore, one also needs to consider that Amazon is working within this sector as well. Although Walmart has been able to compete with and wrestle away some of Amazon’s share, we are unsure if this growth will be sustained into the future.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<h1>Conclusion</h1>\n\n<p>All in all, following a healthy earnings report, a nice dip in Walmart’s price provides us with an awesome trading opportunity. With rock solid fundamentals, many bullish catalysts in play, and stimulus right around the corner, Walmart is poised to reclaim its ATHs, and make us some money. This play is incredibly safe, so grab some shares or options, and enjoy the ride! If you like my posts and want more finance content, you can find links to my socials on my profile!</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p><strong>TLDR :</strong> $WMT has awesome fundamentals, many bullish catalysts, and is poised to benefit from stimulus. BTFD!!!!</p>\n</div><!-- SC_ON -->",
  "score": 74,
  "permalink": "/r/stocks/comments/m6aop0/wmt_the_cutthroat_expansion_of_a_monopoly_walmart/",
  "subreddit": "stocks",
  "id": "m6aop0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382535
}