{
  "author": "dissolvedgiirll",
  "original_created_utc": 1656318474,
  "title": "Faced my abuser after 15 years, am i overreacting?",
  "created_utc": 1656348856,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So today I just burst into flames.\nMy brother in law abused me sexually when I was 11 to 12 yo. My sister never left him and my family never accused him to the police. \nHe and my sister live in my house with my mom, somehow... for whatever reason my mom allows this and i basically have to see him everyday. Hes a religious fanatic and he thinks Im a bad influence to my niece.&lt;/p&gt;\n\n&lt;p&gt;Today we were watching music videos and he said something that i couldnt hear. i asked him what did he say and he started to raise his voice at me saying that i was judging him without knowing what he said. at the beginning i didnt raise my voice because i was genuinely curious about what he said.\nImportant to say that I do not talk to him only if its necessary.\nSo, my mom got home and I was really heated and I said to her that either he goes or I do. My mom got really defensive and I just felt so sad and angry, got into my room crying like a teenager but i heard him talking shit,  so i went back and started spitting FIRE at him, saying that i would never forgive him and that he was a shit parent and husband. &lt;/p&gt;\n\n&lt;p&gt;I really was angry and just couldnt control myself, I felt i had so much to say to him and I did.\nMy nephew kind of already hates me for whatever reason and i feel he got ngry at me because i yelled at his dad. &lt;/p&gt;\n\n&lt;p&gt;I feel so bad about everything because now hes planning to leave, my sister did not back me up, she just stood there like nothing was happening.\nI cant help but wonder if i overreacted and if it was better to just keep my mouth shut.&lt;/p&gt;\n\n&lt;p&gt;I felt good after yelling at him because the little kid in me wanted to say all i said to him but she was too scared.\nAm i in the wrong for this? I kind of feel like I was :/ i feel really bad about all of this. &lt;/p&gt;\n\n&lt;p&gt;I appreciate it if someone would give me their insight about this. Thank you if you read this far.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/vlqmta/faced_my_abuser_after_15_years_am_i_overreacting/",
  "subreddit": "NoStupidQuestions",
  "id": "vlqmta",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So today I just burst into flames. My brother in law abused me sexually when I\nwas 11 to 12 yo. My sister never left him and my family never accused him to the\npolice. He and my sister live in my house with my mom, somehow... for whatever\nreason my mom allows this and i basically have to see him…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから今日、僕は燃え上がったんだ。義理の兄に性的虐待を受けたのは、私が11歳から12歳の頃です。\n11歳から12歳の頃でした。妹は兄から離れず、私の家族は兄を警察に訴えることもしませんでした。\n警察にも訴えませんでした。義兄と妹は私の家で私の母と暮らしていますが、なぜか...なぜか\n母はそれを許し、私は基本的に彼に会わなければならないのです...。",
      "title": "15年ぶりに加害者に会ったが、私は過剰反応なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，今天我就这样迸发了。在我11至12岁的时候，我的哥哥对我进行了性虐待。\n在我11至12岁的时候。我的妹妹从未离开过他，我的家人也从未向警察指控他。\n警察。他和我妹妹和我妈妈一起住在我家，不知为何......不管是什么原因，我妈妈允许这样做，而我基本上是和我妈妈一起住。\n不管是什么原因，我妈妈允许这样做，而我基本上必须看到他......",
      "title": "15年后面对虐待我的人，我是否反应过度？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，今天我就這樣迸發了。在我11至12歲的時候，我的哥哥對我進行了性虐待。\n在我11至12歲的時候。我的妹妹從未離開過他，我的家人也從未向警察指控他。\n警察。他和我妹妹和我媽媽一起住在我家，不知爲何......不管是什麼原因，我媽媽允許這樣做，而我基本上是和我媽媽一起住。\n不管是什麼原因，我媽媽允許這樣做，而我基本上必須看到他......",
      "title": "15年後面對虐待我的人，我是否反應過度？"
    }
  ]
}