{
  "author": "Shitheadthegreat",
  "the_new_excerpt": "I've seen the mods make several comments lately about the rapid number of new\nusers on this sub. So, I feel like there is chance to reach some people who may\nbe in the sweet spot for capitalizing on the value of an HSA. I really wish that\nat 25 (instead of 45) I had known about the investment value…",
  "original_created_utc": 1620762935,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、このサブの新規ユーザーが急増していることについて、司会者が何度かコメントしているのを見ました。\nこのサブでは、新しいユーザーが急速に増えています。だから、HSAの価値を活かすのに適しているかもしれない人たちにアプローチするチャンスがあると思っています。\nHSAの価値を最大限に生かすことができるかもしれません。私は本当に\n25歳のときに（45歳ではなく）、投資価値について知っていれば...。",
      "title": "新米投資家と若手投資家のためのPSA...HSAが必要です"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看到版主最近对这个子网站的新用户数量迅速增加做了一些评论。\n的新用户。因此，我觉得有机会接触到一些人，他们可能是\n处于利用HSA价值的最佳位置。我真的希望\n在25岁（而不是45岁）时就知道投资价值......",
      "title": "给新投资者和年轻投资者的PSA......你需要一个HSA"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看到版主最近對這個子網站的新用戶數量迅速增加做了一些評論。\n的新用戶。因此，我覺得有機會接觸到一些人，他們可能是\n處於利用HSA價值的最佳位置。我真的希望\n在25歲（而不是45歲）時就知道投資價值......",
      "title": "給新投資者和年輕投資者的PSA......你需要一個HSA"
    }
  ],
  "title": "PSA for new(ish) and young(ish) investors...You need an HSA",
  "created_utc": 1620766185,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve seen the mods make several comments lately about the rapid number of new users on this sub.  So, I feel like there is chance to reach some people who may be in the sweet spot for capitalizing on the value of an HSA.  I really wish that at 25 (instead of 45) I had known about the investment value of an HSA.  If you&#39;re in good health and your employer offers you a High Deductible Health Plan with an HSA  you should probably look into taking advantage of that. </p>\n\n<p>In my case, since my wife and I are covered by the HDHP we can contribute $7200/yr to our HSA.  We are required to keep $2000 in cash in that HSA.  Every other penny that we contribute gets invested (we auto invest in VTSAX right through our HSA, every 2 weeks.)    </p>\n\n<p>Why an HSA?</p>\n\n<ol>\n<li>you contribute pre-tax dollars..not paying taxes on money you earn is good.</li>\n<li>Your money grows tax free.  The magic of compounding over years and years without being taxed is a the secret sauce to growing your net worth (well, that and savings rate).</li>\n<li>If you withdraw money for qualified medical expenses it is tax free.  That means you&#39;re spending money you never paid any taxes on.<br/></li>\n<li>If you have the money to cover minor medical expenses you don&#39;t actually have to reimburse yourself from your HSA.  You can just leave all that money in the HSA, invested, and watch it grow over the years.  Just save your receipts because you can reimburse yourself later (any time later, eg 2060) for a medical expense incurred in 2021!  That gives your contributions years and years to grow before you withdraw them to cover an expense.</li>\n<li>At 65 you can withdraw from an HSA for any reason without penalty.  However, if the withdrawal isn&#39;t for medical expenses you will have to pay tax on the withdrawal.  Seriously though, the odds are exceptionally good that at age 65 you&#39;ll have plenty of medical expenses.  So you pull from the HSA to cover them with income (and growth) you&#39;ve never paid taxes on. </li>\n<li>When you eventually do get on Medicare you can use your HSA to cover Medicare premiums, copays, deductibles.  That&#39;s a significant retirement expense that you have covered!</li>\n</ol>\n\n<p>HDHP and HSA can&#39;t possibly be right for every situation but if you&#39;re young, healthy, and could potentially cover the high deductible in the event you need it, an HSA an excellent investment/retirement vehicle.  I&#39;m just hoping my relative good health holds out long enough for me to build a big ol&#39; pot of money in my HSA account!</p>\n</div><!-- SC_ON -->",
  "score": 413,
  "permalink": "/r/Bogleheads/comments/na61r3/psa_for_newish_and_youngish_investorsyou_need_an/",
  "subreddit": "Bogleheads",
  "id": "na61r3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994590
}