{
  "author": "avandoorslaer",
  "the_new_excerpt": "I've been looking at old scrapbooks from the 1920's to 1940's and it seems as if\nevery little party or gathering was in the newspaper. Often in great detail such\nas bridal shower decorations and lists of attendees for people of modest means,\nvacations people took, and children's parties. Did the…",
  "original_created_utc": 1617463060,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在看20世纪20年代到40年代的老剪贴簿，好像是。\n每一个小的聚会或集会都在报纸上。往往在很大的细节，如\n作为新娘洗澡的装饰品和出席者名单，供经济能力不强的人使用。\n人们的假期，和孩子们的聚会。难道...",
      "title": "为什么这么多看似不起眼的事件会在20世纪初登上报纸？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在看20世紀20年代到40年代的老剪貼簿，好像是。\n每一個小的聚會或集會都在報紙上。往往在很大的細節，如\n作爲新娘洗澡的裝飾品和出席者名單，供經濟能力不強的人使用。\n人們的假期，和孩子們的聚會。難道...",
      "title": "爲什麼這麼多看似不起眼的事件會在20世紀初登上報紙？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "1920年代から1940年代の古いスクラップブックを見ていると、まるで\nちょっとしたパーティや集まりがあると、必ず新聞に載っていたようです。例えば、ブライダルシャワーの飾り付けや\n例えば、裕福ではない人たちのブライダルシャワーの飾り付けや出席者のリスト。\n人々が行ったバケーションや子供のパーティーなどです。その時の新聞は...",
      "title": "1900年代初頭、一見些細な出来事がなぜ新聞に載ったのか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "1920年代から1940年代の古いスクラップブックを見ていると、まるで\nちょっとしたパーティや集まりがあると、必ず新聞に載っていたようです。例えば、ブライダルシャワーの飾り付けや\n例えば、裕福ではない人たちのブライダルシャワーの飾り付けや出席者のリスト。\n人々が行ったバケーションや子供のパーティーなどです。その時の新聞は...",
      "title": "1900年代初頭、一見些細な出来事がなぜ新聞に載ったのか？"
    }
  ],
  "title": "How did so many seemingly insignificant events get into the newspaper in the early 1900`s?",
  "created_utc": 1617473827,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been looking at old scrapbooks from the 1920&#39;s to 1940&#39;s and it seems as if every little party or gathering was in the newspaper. Often in great detail such as bridal shower decorations and lists of attendees for people of modest means, vacations people took, and children&#39;s parties. Did the newspaper actually send reporters to these events, print what people called in, or did people pay to publish their &quot;brags&quot;? I&#39;ve primarily seen this in small town papers.</p>\n</div><!-- SC_ON -->",
  "score": 137,
  "permalink": "/r/AskHistorians/comments/mjahod/how_did_so_many_seemingly_insignificant_events/",
  "subreddit": "AskHistorians",
  "id": "mjahod",
  "is_self": true,
  "media": null,
  "is_video": false
}