{
  "author": "foxtailavenger",
  "original_created_utc": 1631235281,
  "title": "How to DeFi: Getting Started 101 for Noobs Like Me",
  "created_utc": 1631299387,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Earlier today, I was trying to explain how to get started in DeFi from step 1. After writing it all out, I realised I should probably just turn it into a full post, flesh it out a little in the hopes of introducing more people into this space which has basically captured my interest for the last 5ish months. Here you go, enjoy:</p>\n\n<p><strong>WTF is DeFi</strong></p>\n\n<p>So, you’ve heard of DeFi and you want to generate returns in the DeFi space. But you have no idea where to even start! Your coins are all sitting in your [insert exchange name] account just gathering dust as you ride through the roller coaster that is the crypto world. Full disclaimer: I am not a financial advisor blah blah blah and I am only 5 months into DeFi (which considering the age of DeFi, is actually quite long), but I don’t purport to know everything there is to know, nor can I guarantee I can answer your questions if you have any (but I will certainly try).</p>\n\n<p>Since DeFi is a fast-moving space, whatever I will try to make this as applicable to as many chains as possible so this info is applicable to whichever chain becomes in favour in the future. For reference as to how fast things move, when I started DeFi in April (which feels like an eternity ago), Binance Smart Chain was the shit man. Then in May to June, Polygon was cool. Then that came and went, and Solana came in late July and in early Sept, we’re now seeing the rise in Fantom and Avalanche. All that in just 5 months.</p>\n\n<p><strong>&quot;It&#39;s dangerous to go alone! Take this.&quot;</strong></p>\n\n<p>Like most things, you’ll need some things set-up before getting to work.</p>\n\n<p>To start, you&#39;ll need:</p>\n\n<ul>\n<li>A way to on-ramp (this means turning fiat into crypto): This is usually a Centralised Exchange (Binance, FTX, Coinbase, Gemini, CDC whatever is good for whichever country you’re in).</li>\n<li>A wallet. A wallet is basically something that allows you to manage your coins/tokens. Every wallet supports different chains and there isn’t a single one that supports all of them. As such, if you are gonna be on multiple chains, you’ll likely end up with more than one wallet. For example, Solana is not compatible with Ethereum-based wallets, so they have their own set of wallets.\n\n<ul>\n<li><strong>Metamask</strong> (<a href=\"https://metamask.io/\">https://metamask.io/</a>) is the official and only Metamask site. I use it with Brave Browser, but as far as I know, Chrome and Firefox work great with it too. By default, Metamask is built for Ethereum, but it can be made to accommodate Binance Smart Chain, Polygon, Fantom and Avalanche as well amongst others. To figure out how to set up these chains, just search “How to add [chain name] to metamask?” and you should get a pretty good tutorial.</li>\n<li><strong>Phantom</strong> (<a href=\"https://phantom.app/\">https://phantom.app/</a>) is the official site for the Phantom wallet and in my opinion, is the best Solana wallet now.</li>\n</ul></li>\n</ul>\n\n<p>Once you’ve got both up, you’re ready to get started!</p>\n\n<p>All chains require a specific token to pay for gas, which can be thought of as a transaction fee for your transactions on-chain. Without this token, you <strong>WILL NOT be able to make a single transaction</strong>. This also means if you end up depositing all of your gas token into a project, you will not be able to withdraw from that contract LOL. It sounds dumb but it happened to me once kek I call it #forcedHODL.</p>\n\n<p>The gas tokens for some popular chains are as follows:</p>\n\n<ul>\n<li>Ethereum: ETH</li>\n<li>Binance Smart Chain: BNB</li>\n<li>Polygon: MATIC</li>\n<li>Solana: SOL</li>\n</ul>\n\n<p>Usually, the easiest way to get onto the chain is to send the gas token straight to the chain on your wallet. So, if I wanted to onboard to Binance Smart Chain, I would send BNB straight so I wouldn&#39;t have to send say, ETH and BNB, which would cost more in transaction fees. If you are sending over tokens from your exchange to your wallet, do make sure you’re sending on the right network. If you use the wrong network, you <strong>WILL lose your tokens</strong>, and no one can get it back for you. Same for wrong address.</p>\n\n<p>Do also note that generally, gas fees will depend on each chain and the relative congestion on each chain. You’ll be able to toggle the gas fees used to speed up your transaction (or slow it down if you’re really not in a rush). The more transactions taking place at any time, the higher the gas required to make it a fast transaction.</p>\n\n<p>Once your wallet is up with an appropriate gas token, you can start looking at the various things DeFi has to offer.</p>\n\n<p><strong>How to Interact with A Protocol: Where Do I Put It In?</strong>  <strong>( ͡° ͜ʖ ͡°)</strong></p>\n\n<p>Now with your wallet on the appropriate chain and with the appropriate gas token, you can head over to the project you wish to ape into!</p>\n\n<p>In this example, I’m using Uniswap. Upon entering the app, this is what you’ll see. You’ll need to connect your wallet to the protocol, and this is usually in the top right corner of the page (although this can vary obviously). Your wallet will ask you for permission and you just click yes! For most protocols, the ‘Connect Wallet’ button will change display your wallet address once your wallet is successfully connected.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/b46hmtv0qkm71.png?width=1869&amp;format=png&amp;auto=webp&amp;s=3819d4f5eb70acbb90ac3251b0fc9f39c37580e6\">https://preview.redd.it/b46hmtv0qkm71.png?width=1869&amp;format=png&amp;auto=webp&amp;s=3819d4f5eb70acbb90ac3251b0fc9f39c37580e6</a></p>\n\n<p>When making transactions, at each transaction, your wallet will prompt you to approve it. And it’ll look like this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/1bq5wtl1qkm71.png?width=800&amp;format=png&amp;auto=webp&amp;s=412413f2a935cdb738110d805b3b7768d34d8929\">https://preview.redd.it/1bq5wtl1qkm71.png?width=800&amp;format=png&amp;auto=webp&amp;s=412413f2a935cdb738110d805b3b7768d34d8929</a></p>\n\n<p>Here, they will allow you to edit the permission (i.e., how much the contract is allowed to spend) and the gas fee. It is good practice to edit the permission to exactly how much you want to deposit since by default this is infinite. The gas fee can be edited as mentioned earlier. Once done, just approve and you’re good to go.</p>\n\n<p>Don’t worry if nothing happens for a while. Depending on your chain and the congestion, it may take a while to process. Just check your wallet’s transaction history to see if the transaction is still pending. Do note that transactions can fail for a variety of reasons.</p>\n\n<p>Most people here are looking at lending and liquidity farming as these are the easiest to get into to earn some return on your assets.</p>\n\n<p><strong>Lending</strong></p>\n\n<p>Lending as the name implies, allows you to earn interest on assets you lent out. An example you can look at is Aave (<a href=\"https://aave.com/\">https://aave.com/</a>). The interest rates vary based on how many people are borrowing at any point in time (sometimes known as utilisation). As a lender, you will look at Supply Rates while borrowers look at Borrow Rates.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/3s9cnz05qkm71.png?width=1557&amp;format=png&amp;auto=webp&amp;s=fcd4a6fc8e87944b6be214878bb6eb8bca1dd784\">https://preview.redd.it/3s9cnz05qkm71.png?width=1557&amp;format=png&amp;auto=webp&amp;s=fcd4a6fc8e87944b6be214878bb6eb8bca1dd784</a></p>\n\n<p>The good thing about lending protocols is that generally, interest is paid in the token that you’re lending out. This means that if you lend out BTC, you’ll get your rewards in BTC.</p>\n\n<p>Lending is quite straightforward, so I won’t go into too much detail in it. Generally, for common tokens like BTC and ETH, the returns on lending are not very high. Stablecoins tend to give much higher lending returns (especially in volatile markets) as people borrow to ape.</p>\n\n<p><strong>Liquidity Farming</strong></p>\n\n<p>Liquidity farming is a little bit more complicated. This comes from liquidity pools.</p>\n\n<p>To understand what liquidity pools are, we must first understand Decentralised Exchanges. Decentralised Exchanges are the decentralised versions of Binance, Coinbase etc. on the chain. But because they are decentralised, they need some way to provide the assets for investors to buy and sell tokens. As such, liquidity pools are pools where investors deposit in assets (usually two, and generally in a 1:1 ratio) to facilitate the operations of decentralised exchanges. For example, a pool could be USDC-ETH. So, when an investor comes to this DEX to swap their USDC for ETH, the ETH is withdrawn from the pool and the USDC is deposited.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/9z9ruad4qkm71.png?width=1662&amp;format=png&amp;auto=webp&amp;s=ac2cb430fdf43c1713cf8f514009229a7d705204\">https://preview.redd.it/9z9ruad4qkm71.png?width=1662&amp;format=png&amp;auto=webp&amp;s=ac2cb430fdf43c1713cf8f514009229a7d705204</a></p>\n\n<p>In return for investors depositing their assets into the DEX, the DEX pays out rewards (usually in their native token). Native tokens are tokens that are issued by the project themselves. For Pancakeswap, it’s CAKE. For Uniswap, it’s UNI. These rewards usually have to be claimed/harvested for them to show up in your wallet.</p>\n\n<p>Do note that liquidity farming can lead to <a href=\"https://medium.com/coinmonks/understanding-impermanent-loss-9ac6795e5baa\">impermanent loss</a>. This is occurs when the assets you deposit move in different directions or in magnitude. As such, for beginners, I would advise using pools that contain only correlated assets, such as stablecoin pools or to a certain extent, BTC and ETH.</p>\n\n<p>Do also note that since rewards are paid out in native tokens, the actual returns you get may differ from the advertised rates if the token value changes over time. If it drops to zero, then you’ll have no rewards hahahaha. So for low cost chains, some investors will do what is known as farm and dump, where they harvest the tokens everyday or every once in a while to convert to another more stable token, to lock in their returns.</p>\n\n<p>Alternatively, you can also use a yield aggregator. These are projects which help you compound your rewards for you. Some popular ones include Autofarm (<a href=\"https://autofarm.network/\">https://autofarm.network/</a>) and Beefy (<a href=\"https://www.beefy.finance/\">https://www.beefy.finance/</a>).</p>\n\n<p><strong>OMG WHERE DID ALL MY TOKENS GO? SKEM!</strong></p>\n\n<p>Now, for DeFi, when you&#39;re farming/lending, the tokens aren&#39;t in your wallet, so it might be hard to how much you actually have. As such, most people use dashboards to see the value of all of their holdings. Do note that if your holdings are in a new or an obscure farm, they might not show up on your dashboard. These are my favourite:</p>\n\n<p><strong>APEBOARD FINANCE</strong> (<a href=\"https://apeboard.finance/dashboard\">https://apeboard.finance/dashboard</a>): This dashboard is aesthetic and simple and covers a large variety of chains: BSC, Ethereum, Solana, Polygon, Terra and even Ronin! They support a large number of projects across their chains too.</p>\n\n<p><strong>Debank</strong> (<a href=\"https://debank.com/\">https://debank.com/</a>): Debank is a close second for me (mainly due to lacking Sol support). They cover quite a number of chains too: BSC, Ethereum, Polygon, xDAI, HECO, OKexchain, Avalanche and Fantom. Debank loads much faster than Apeboard though so if you don&#39;t use Solana then Debank is the way to roll (they&#39;ve said that they&#39;re gonna add it in the future anyways!).</p>\n\n<p>Solana Specific:</p>\n\n<p><strong>Sonar Watch</strong> (<a href=\"https://sonar.watch/\">https://sonar.watch/</a>): Sonar watch is great for Solana as the dashboard incorporates a graph, plotting net worth and also breaks down where each of your coins are held: yield farming, mining, lending or just in your wallet.</p>\n\n<p><strong>Step Finance</strong> (<a href=\"https://step.finance/\">https://step.finance/</a>): Step finance is also pretty good and tends to load faster than Sonar although their selection of projects is less extensive I believe.</p>\n\n<p>Other Tools that I Like Too</p>\n\n<p><strong>DeFi Llama</strong> (<a href=\"https://defillama.com/home\">https://defillama.com/home</a>): Good for checking which are the big chains and big projects at the moment. Bigger projects tend to be safer, although not always the case.</p>\n\n<p><strong>Coingecko (</strong><a href=\"https://www.coingecko.com/en/portfolio\"><strong>https://www.coingecko.com/en/portfolio</strong></a><strong>)</strong>  <strong>/ Coinmarketcap (</strong><a href=\"https://coinmarketcap.com/\"><strong>https://coinmarketcap.com/</strong></a><strong>)</strong>: Both are useful to look at coins you&#39;re interested in an any of their other stats.</p>\n\n<p><strong>How to not lose your hard-earned dollahs</strong></p>\n\n<p>- If a stranger DMs you, it’s most probably a scam. No one wants to give you free tokens lmaooo</p>\n\n<p>- Only click links from official sources (project twitter, official telegram chat etc). I try to stay off discord since a lot of links get spammed there. Best to bookmark sites you use frequently. Watch out for phishing sites on Google search results too!</p>\n\n<p>- When interacting with smart contracts, edit the spending permissions (by default, it’s set to infinite, meaning if the contract is hacked, they can drain all of that token).</p>\n\n<p>- Once you’re done with a project, revoke the permissions from the contract. You can find these under token approvals on the respective block explorers (polygonscan/bscscan/ethscan/solscan etc).</p>\n\n<p>- If you’re using Metamask extension, right click your extension and under ‘This can read and change site data’ select only when you click the extension. This prevents the extension from being activated unless you click on it and reload the site. Same for any other wallet.</p>\n\n<p>- If you’re dealing with a substantial amount, a hardware wallet might be good to have. Ledger and Trezor tend to be the most recommended ones. If you purchase one, please get from the official store so the seed is not compromised.</p>\n\n<p>- When choosing projects, try to find audited ones (although many audited projects have been exploited before). Best to stick to high TVL ones and those that have been around for a while. Doxxed devs are generally a good sign as well.</p>\n\n<p>- Stick to the reputable projects to stay safe. Big is generally better. Use Defi Llama to help you find them.</p>\n\n<p>- Don’t connect to sus projects or sites</p>\n\n<p>- Stop surfing those shady sites LOL malware on your computer is bad for obvious reasons. Best is if you use a completely different device for crypto but of course, not everyone has that luxury.</p>\n\n<p>Oh and one more thing, <strong>DONT EVER TYPE YOUR SEED PHRASE</strong> unless you’re restoring a wallet (for myself I wrote it down on 3 separate pieces of paper and hid them in safe places hahaaha) Seed phrase being compromised is probably one of the most common ways of losing all your tokens at once.</p>\n\n<p>Hope this made it less daunting to start. Ultimately, the best way to learn is to try it out for yourself. If you’re not sure, start with a small amount. I’m pretty sure I spent at least $10-20 on gas when I first started doing silly transactions which were unnecessary hahaha.</p>\n\n<p>OKAY THAT’S ALL FOLKS! If you have any unanswered questions, ask away below and I (or someone from the community) will do my (their) best to answer! WAGMI</p>\n</div><!-- SC_ON -->",
  "score": 169,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?auto=webp&s=3b2a6cadcf175e7b6934d143cf3b5d1978639d43",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=108&crop=smart&auto=webp&s=0c5b3665287cd29680e9d291d94b751c080fde6f",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=216&crop=smart&auto=webp&s=d7e26e3dd005cd8f8087d98f847ab8996ef006c5",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=320&crop=smart&auto=webp&s=bda481b8d537cf7bfd3890c75d414b435be10ddd",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=640&crop=smart&auto=webp&s=4ad0a2b48b190f1d22ad85d05a5a11ecf06b95de",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=960&crop=smart&auto=webp&s=af87657d4879e0a086b5809b412d3cf154ee0764",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/JwMe4YLdENZpHEJNhV6yXpAdZXc7igicWZ0RZy0mc3Q.jpg?width=1080&crop=smart&auto=webp&s=829f9de305b30b51832f664c9703bd65edf4a706",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "4jPdiaVD-s35AxplTrYPcbo-8BUjZDBgXOuWFC8TM1Q"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/plamqh/how_to_defi_getting_started_101_for_noobs_like_me/",
  "subreddit": "CryptoCurrency",
  "id": "plamqh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Earlier today, I was trying to explain how to get started in DeFi from step 1.\nAfter writing it all out, I realised I should probably just turn it into a full\npost, flesh it out a little in the hopes of introducing more people into this\nspace which has basically captured my interest for the last…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日の午前中、私はDeFiをステップ1から始める方法を説明しようとしていました。\n書き出してみると、もっと多くの人にDeFiを知ってもらうためには、これを完全な記事にして\nもっと多くの人にこの世界を知ってもらいたいと思い、少し詳しく書いてみました。\nこれまで私が興味を持ってきたこの分野を、より多くの人に知ってもらうためにも...。",
      "title": "How to DeFi: 私のような初心者のためのスタートアップ101"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天早些时候，我试图解释如何从第1步开始进入DeFi。\n写完之后，我意识到我也许应该把它变成一个完整的\n帖，把它写得更充实一些，希望能把更多人引入这个\n这个空间基本上吸引了我的兴趣，在过去...",
      "title": "如何去做。像我这样的新手入门101"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天早些時候，我試圖解釋如何從第1步開始進入DeFi。\n寫完之後，我意識到我也許應該把它變成一個完整的\n帖，把它寫得更充實一些，希望能把更多人引入這個\n這個空間基本上吸引了我的興趣，在過去...",
      "title": "如何去做。像我這樣的新手入門101"
    }
  ]
}