{
  "author": "partymsl",
  "original_created_utc": 1649523984,
  "title": "SEC just had to release their emails about the XRP lawsuit, showing further improper behavior.",
  "created_utc": 1649555759,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Back in August 2021 the SEC was requested by a non-profit organization (Empower Oversight) to release their emails about the XRP lawsuit and inner conversations about it. Back then they declined, Empower Oversight filed a lawsuit and now they finally released those.&lt;/p&gt;\n\n&lt;p&gt;That does not make the SEC look good at all. The emails are showing how much of a improper behavior they had towards certain Cryptos and advantages for other Crypto, namely Ethereum.&lt;/p&gt;\n\n&lt;p&gt;William Hinman a former SEC official met several Law firms in NYC and ETH Co-founders. That comes before he in 2018 announced that ETH is not a security, but Ripple is. Obviously that does not mean that Etherum is going to have any problems as they did trigger those meetings, at least we don&amp;#39;t know yet.&lt;/p&gt;\n\n&lt;p&gt;Even if Ripple is a centralized crypto I&amp;#39;m 100% rooting for them here. A win for ripple would a for Crypto and it does look as if they could indeed win.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 415,
  "permalink": "/r/CryptoCurrency/comments/tzxje5/sec_just_had_to_release_their_emails_about_the/",
  "subreddit": "CryptoCurrency",
  "id": "tzxje5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Back in August 2021 the SEC was requested by a non-profit organization (Empower\nOversight) to release their emails about the XRP lawsuit and inner conversations\nabout it. Back then they declined, Empower Oversight filed a lawsuit and now\nthey finally released those.\n\nThat does not make the SEC look…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "2021年8月、SECは、NPO法人（Empower\nOversight)は、XRPの訴訟と内部の会話に関する電子メールを公開するように。\nについてです。当時は断られ、Empower Oversightは訴訟を起こし、そして今回\nそれをようやく公開したのです。\n\nこれではSECは...",
      "title": "SECは、XRPの訴訟に関する電子メールを公開し、さらなる不適切な行為を示すことになりました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早在2021年8月，美国证券交易委员会应一个非营利组织（Empower\n监督）要求公布他们关于XRP诉讼和内部谈话的电子邮件\n的内部谈话。当时他们拒绝了，Empower Oversight提起了诉讼，现在\n他们终于公布了这些。\n\n这并没有使SEC看起来...",
      "title": "SEC刚刚不得不公布了他们关于XRP诉讼的电子邮件，显示出进一步的不当行为。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早在2021年8月，美國證券交易委員會應一個非營利組織（Empower\n監督）要求公佈他們關於XRP訴訟和內部談話的電子郵件\n的內部談話。當時他們拒絕了，Empower Oversight提起了訴訟，現在\n他們終於公佈了這些。\n\n這並沒有使SEC看起來...",
      "title": "SEC剛剛不得不公佈了他們關於XRP訴訟的電子郵件，顯示出進一步的不當行爲。"
    }
  ]
}