{
  "author": "Accomplished-Design7",
  "original_created_utc": 1627177872,
  "title": "Never forget about TITAN",
  "created_utc": 1627220152,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TITAN was at around $60 during its ATH and now it&#39;s close to $0! </p>\n\n<p>Mark Cuban and his legendary investment in TITAN. Many people followed his lead and also invested in it and look what happened. Its crash was really something else, I doubt there has been anything like that in crypto history. Something so well known and a rug pull so big and hard. In a matter of few hours, it crashed like 100% of its value. Some people still believe it will recover, I cannot see the future but I believe it is safe to say it won&#39;t. </p>\n\n<p>What I am saying is always DYOR, don&#39;t just follow some celebrities and YOLO your life savings. Remember there are cases like TITAN!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/or2q7x/never_forget_about_titan/",
  "subreddit": "CryptoCurrency",
  "id": "or2q7x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "TITAN was at around $60 during its ATH and now it's close to $0!\n\nMark Cuban and his legendary investment in TITAN. Many people followed his lead\nand also invested in it and look what happened. Its crash was really something\nelse, I doubt there has been anything like that in crypto history.…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "TITANはATH時には約60ドルでしたが、今では0ドルに近づいています。\n\nMark Cubanと彼の伝説的なTITANへの投資。多くの人が彼に続いて\n多くの人が彼に続いてTITANに投資しましたが、その結果をご覧ください。その暴落は本当にすごいものでした。\n暗号の歴史の中で、このようなことはなかったと思います....",
      "title": "TITANを忘れるな"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "TITAN在ATH期间的价格在60美元左右，现在已经接近0美元了!\n\n马克-库班和他对TITAN的传奇性投资。许多人跟随他的步伐\n也投资于它，看看发生了什么。它的崩盘真的是一件\n别的，我怀疑在加密货币历史上有过这样的事情....。",
      "title": "永远不要忘记TITAN"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TITAN在ATH期間的價格在60美元左右，現在已經接近0美元了!\n\n馬克-庫班和他對TITAN的傳奇性投資。許多人跟隨他的步伐\n也投資於它，看看發生了什麼。它的崩盤真的是一件\n別的，我懷疑在加密貨幣歷史上有過這樣的事情....。",
      "title": "永遠不要忘記TITAN"
    }
  ]
}