{
  "author": "mocontrolla",
  "original_created_utc": 1627948648,
  "title": "Why is it often Colonels and not Generals that lead coup attempts?",
  "created_utc": 1627964209,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Throughout modern history, it seems that it is often junior military officers (groups of captains, colonels, lower ranking generals) that attempt to commit a coup d&#39;etat, or succeed in doing so. There are obviously plenty of coups committed by high ranking generals, but just looking through a history of coups and coup attempts and you can find tons committed by junior officers. This includes, among others:</p>\n\n<ul>\n<li>Colonel Reza Khan&#39;s 1921 coup that brought the Pahlavi dynasty to power in Iran</li>\n<li>The 1931 coup attempts by the Japanese Army (led by Lieutenant Colonel Kingoro Hashimoto)</li>\n<li>The 1967 coup by a group of colonels in Greece that established the military junta</li>\n<li>The 1969 Libyan coup d&#39;état in which Colonel Muammar Gaddafi took power</li>\n<li>The recent successful coup in Mali this past June by Colonel Assimi Goita</li>\n</ul>\n\n<p>Why do these more junior officers seem to be more inclined to take power in coups than high ranking generals or defense ministers? Are generals simply more satisfied with the status quo, and junior officers have more to gain?</p>\n</div><!-- SC_ON -->",
  "score": 116,
  "permalink": "/r/AskHistorians/comments/owr7e3/why_is_it_often_colonels_and_not_generals_that/",
  "subreddit": "AskHistorians",
  "id": "owr7e3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Throughout modern history, it seems that it is often junior military officers\n(groups of captains, colonels, lower ranking generals) that attempt to commit a\ncoup d'etat, or succeed in doing so. There are obviously plenty of coups\ncommitted by high ranking generals, but just looking through a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "近代史を振り返ってみると、下級武官（大尉、大佐、下級元帥のグループ）が\n(下級武官（大尉、大佐、下級大将のグループ）がクーデターを企てたり、成功させたりすることが多いようです。\nクーデターを起こそうとしたり、それに成功したりするのは、下級武官（大尉、大佐、下級将軍のグループ）が多いようです。高級将校によるクーデターももちろんありますが\n将軍によるクーデターもたくさんありますが・・・。",
      "title": "なぜクーデターを起こすのは将軍ではなく大佐が多いのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "纵观现代历史，似乎往往是低级别的军官\n(试图发动政变的往往是低级军官（由上尉、上校、低级将领组成的团体）。\n试图发动政变，或者成功地发动政变。显然，有很多政变\n显然，有很多政变是由高级将领实施的，但仅仅是翻阅一下...",
      "title": "为什么领导政变企图的往往是上校而不是将军？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "縱觀現代歷史，似乎往往是低級別的軍官\n(試圖發動政變的往往是低級軍官（由上尉、上校、低級將領組成的團體）。\n試圖發動政變，或者成功地發動政變。顯然，有很多政變\n顯然，有很多政變是由高級將領實施的，但僅僅是翻閱一下...",
      "title": "爲什麼領導政變企圖的往往是上校而不是將軍？"
    }
  ]
}