{
  "author": "Doctor_Fritz",
  "original_created_utc": 1640154917,
  "title": "People are wilfully ignorant towards crypto's actual energy consumption",
  "created_utc": 1640180368,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The other day there was a discussion in &lt;a href=\"/r/technology\"&gt;r/technology&lt;/a&gt; about NFT in games. Ubisoft as you all know have embraced Tezos (XTZ) as the blockchain to bring NFT to their games.&lt;/p&gt;\n\n&lt;p&gt;Instead of reading up on what this is exactly and how this could be used in games in the future the only thing happening in that topic was bashing crypto, blockchain and by extension the energy consumption needed to run the network. When I tried to comment that XTZ is actually quite low in energy needs, I just got ignorant replies and downvotes.&lt;/p&gt;\n\n&lt;p&gt;It seems to me that sensationalist news posts about crypto are keeping people in the dark regarding the true potentials of crypto and blockchain. As with everything new they focus on a single bad aspect and enlarge it without proper analysis. It kind of made me sad to see so much ignorance in a sub that&amp;#39;s supposed to be dedicated to technology, out of all topics available on reddit.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/rlz380/people_are_wilfully_ignorant_towards_cryptos/",
  "subreddit": "CryptoCurrency",
  "id": "rlz380",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The other day there was a discussion in r/technology [/r/technology] about NFT\nin games. Ubisoft as you all know have embraced Tezos (XTZ) as the blockchain to\nbring NFT to their games.\n\nInstead of reading up on what this is exactly and how this could be used in\ngames in the future the only thing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先日、r/technology [/r/technology]でNFTについて議論がありました。\nゲームにおける 皆さんご存知の通りUbisoftは、ブロックチェーンとしてTezos（XTZ）を採用し\nNFTをゲームに取り入れる。\n\nNFTとは何なのか、どのようにゲームに応用できるのか、読み解くことはできません。\n今後、ゲームといえば...",
      "title": "暗号の実際のエネルギー消費量について、人々は故意に無知である。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有一天，在r/technology[/r/technology]上有一个关于NFT的讨论\n在游戏中的应用。你们都知道，育碧已经接受了Tezos（XTZ）作为区块链，将NFT引入他们的游戏。\n将NFT引入他们的游戏。\n\n我没有阅读关于这到底是什么以及这在未来如何用于游戏的资料。\n而不是去了解这到底是什么，以及未来如何在游戏中使用，唯一的...",
      "title": "人们对加密货币的实际能源消耗故意视而不见。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有一天，在r/technology[/r/technology]上有一個關於NFT的討論\n在遊戲中的應用。你們都知道，育碧已經接受了Tezos（XTZ）作爲區塊鏈，將NFT引入他們的遊戲。\n將NFT引入他們的遊戲。\n\n我沒有閱讀關於這到底是什麼以及這在未來如何用於遊戲的資料。\n而不是去了解這到底是什麼，以及未來如何在遊戲中使用，唯一的...",
      "title": "人們對加密貨幣的實際能源消耗故意視而不見。"
    }
  ]
}