{
  "author": "Tricky_Troll",
  "original_created_utc": 1656486983,
  "title": "A Detailed Summary of Every Single Reason Why I am Bullish on ETH in 2022. (TL;DR at the bottom)",
  "created_utc": 1656506434,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;The following will be a list of the many reasons why I still hold and am still extremely bullish on ETH. This is the third updated version of this post since the &lt;a href=\"https://np.reddit.com/r/ethtrader/comments/jhrqv1/a_detailed_summary_of_every_single_reason_why_i/\"&gt;first one I made in 2020.&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;This is an extremely long post. If you just want the hopium without the detail, read the TL;DR at the bottom.&lt;/h1&gt;\n\n&lt;h1&gt;&lt;del&gt;ETH 2.0&lt;/del&gt; The Merge&lt;/h1&gt;\n\n&lt;p&gt;The switch from Proof of Work to Proof of Stake also known as “The Merge” (formerly known as ETH 2.0) has numerous enormous benefits for Ethereum. These include: &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;A 99.9% increase in power efficiency, making Ethereum by far the largest environmentally friendly blockchain.&lt;/li&gt;\n&lt;li&gt;Greater network security than PoW provides due to efficiencies with PoW and the new ability for the protocol to “slash” or punish dishonest validators/attackers.&lt;/li&gt;\n&lt;li&gt;An ~80-90% drop in ETH inflation from around 5%pa to well below 1%pa and these inflation numbers are excluding ETH burned from transaction fees which based on recent fees will turn ETH into a deflationary asset. This will reduce the current daily sell pressure of $20,000,000/day of new ETH being sold by miners to offset electricity costs to just $2,000,000-$5,000,000/day going to stakers who will sell less due to not having any significant operating expenses to pay off. Furthermore, these stakers won’t even be able to withdraw their earnings until after a later hard fork months after the merge.&lt;/li&gt;\n&lt;li&gt;An increase in ETH 2.0 staking rewards from the current 4-5% to [possibly as high as 7.5-15% due to miner/validator extractable value and network fees/tips.](nitter.snopyta.org/drakefjustin/status/1384124998084792324) &lt;sup&gt;The 25% value in that tweet is out of date and no longer likely.&lt;/sup&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;At this rate, the merge will go live later this year, likely in September. Lately there has been a series of successful shadow forks for merge testing as well as the Ropsten testnet which has successfully switched to Proof of Stake.&lt;/p&gt;\n\n&lt;h1&gt;Extended Ethereum Roadmap&lt;/h1&gt;\n\n&lt;p&gt;The extended Ethereum roadmap includes a wide range of very promising and forward thinking features which will keep Ethereum on the bleeding edge of blockchain tech for a long time. The roadmap was recently outlined by Vitalik and along with the aforementioned merge upgrade, it includes the following categories:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Surge:&lt;/strong&gt; Scalability for rollups through data sharding. This effectively allows rollups to scale another 100x from their current levels.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Verge:&lt;/strong&gt; Introduces stateless clients which means the blockchain can be verified without needing the complete history of the blockchain which came before it. This allows validators to run without the need for a large hard drive, dramatically reducing the hardware requirements to run a node, thus improving decentralisation.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Purge:&lt;/strong&gt; Technical debt elimination and elimination of historical data. This comes in multiple forms such as historical data expiry, state expiry and the removal of numerous other unnecessary functions. Much of this will make node operation and validating much easier as well as simplifying the wider Ethereum codebase.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;&lt;strong&gt;Splurge:&lt;/strong&gt; Numerous miscellaneous upgrades such as proposer builder separation, account abstraction and zkSNARK-ifying everything. These will further lighten the load for node operators and give smart contract wallets more functionality.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;It is worth noting that these upgrades won’t all rollout together under the above names like the merge. The above names are simply categories for different upgrades. These upgrades within each category will come at different times.&lt;/p&gt;\n\n&lt;h1&gt;EIP-1559 and ETH scarcity&lt;/h1&gt;\n\n&lt;p&gt;As I covered a while ago in &lt;a href=\"https://np.reddit.com/r/ethfinance/comments/izhkvk/minimum_viable_issuance_why_ethereums_lack_of_a/\"&gt;a previous post of mine,&lt;/a&gt; ETH doesn’t have a supply cap like Bitcoin. Instead, it has a monetary policy of “minimum viable issuance”, not only is this is a good thing for network security, but with the recent addition of EIP-1559, net ETH issuance is variable due to its fee burning feature. During times when network demand is high, transaction fees can rise to levels at which the amount of fee revenue being burned is greater than the inflation rate from new ETH issuance going to miners (and stakers post-merge). In effect, this fee burn acts a lot like a company such as Apple using profits to perform share buybacks, except instead of Apple using money from selling iPhones to reduce the supply of Apple shares, Ethereum is using the profits it makes from selling scarce, decentralised block space to reduce the supply of ETH. This creates a constant negative supply side pressure which without a matching reduction in demand, will lead to ETH price appreciation.&lt;/p&gt;\n\n&lt;p&gt;So what does this mean for ETH scarcity? It means that if the Ethereum economy is healthy and there is a constant demand for Ethereum’s scarce, decentralised block space, there will be a sink in the form of the fee burn which reduces the supply of ETH. If the fee burn is high enough, the fee burn can outweigh the new issuance being minted for miners and stakers. This threshold is around 100-150 Gwei under Proof of Work and around 10-15 Gwei post-merge/under Proof of Stake.&lt;/p&gt;\n\n&lt;p&gt;The long term prediction for ETH supply according to Ethereum researcher Justin Drake is that supply will peak just before the merge just below 120 million ETH before decreasing post-merge where over time the burn will lessen relative to new issuance before ETH supply eventually floats around 100-120 million ETH or continues to decrease at a slow rate. You can create your own post-merge issuance models by playing around with the variable inputs on &lt;a href=\"https://ultrasound.money\"&gt;ultrasound.money.&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;Layer 2 Scaling&lt;/h1&gt;\n\n&lt;p&gt;One of the most under appreciated aspects of Ethereum is its forward-thinking rollup centric scaling roadmap which is sometimes referred to as a “modular blockchain” architecture. Meanwhile many “Ethereum killers” or alternative layer one general purpose blockchains are still trying to scale with the outdated “monolithic blockchain” architecture and are having to compromise on one of the three elements of the blockchain scalability trilemma, scalability, decentralisation and security. But I won’t go on about this, I’ll let &lt;a href=\"/u/Liberosist\"&gt;u/Liberosist&lt;/a&gt; convince you about the superiority of &lt;a href=\"https://polynya.medium.com/rollups-data-availability-layers-modular-blockchains-introductory-meta-post-5a1e7a60119d\"&gt;Ethereum’s rollup centric roadmap and the modular blockchain thesis.&lt;/a&gt; What’s important here is that this model of scaling effectively flips the blockchain scalability trilemma on its head, allowing Ethereum to scale, become more decentralised and secure all at once.&lt;/p&gt;\n\n&lt;p&gt;Optimistic rollups and ZK rollups have been live on main net Ethereum for a while now. Arbitrum and Optimism have a very wide range of DApps and can offer transactions for less than a dollar and token swaps for not much more, all while retaining the Ethereum main chain’s security guarantees. Meanwhile, ZK rollups such as ZK sync offer even cheaper transactions at less than 10¢ per transfer with full Ethereum base layer security. Finally, rollups are only just getting started. There are many optimisations which have been proposed and will soon roll out such as EIP-4488 and call data compression. Together, &lt;a href=\"https://np.reddit.com/r/ethfinance/comments/r26hhv/rollupcentric_ethereum_roadmap_november_2021/\"&gt;these could boost throughput and cut fees by as much as 50x.&lt;/a&gt; As previously mentioned, rollups flip the blockchain trilemma on its head, meaning that the more people that use them, the cheaper they get and the more secure Ethereum becomes!&lt;/p&gt;\n\n&lt;h1&gt;DeFi and Composability&lt;/h1&gt;\n\n&lt;p&gt;If you’re reading this, I am sure you are aware of the phenomena which is Decentralised Finance (AKA DeFi or more accurately, open finance). Ethereum was the first and is still by far the largest platform to offer permissionless and immutable financial services which when interacting with each other, lead to unprecedented composability and innovation in financial applications. A whole new world of possibilities are opening up thanks to this composability as it allows anyone to take existing pieces of open source code from other DeFi projects, put them together like lego pieces (hence the term money legos) and create something the world has never seen before. None of this was possible before Ethereum because typically financial services are heavily regulated and FinTech is usually proprietary software, so you don’t have any open source lego bricks to build off and you have to build everything you need from scratch. That is if what you want to do is even legal for a centralised institution!&lt;/p&gt;\n\n&lt;h1&gt;NFTs and tokenisation&lt;/h1&gt;\n\n&lt;p&gt;NFTs or “Non-Fungible Tokens” – We’ve all heard of them by now. This once niche aspect of the Ethereum community has exploded into the mainstream through almost unprecedented hype and speculation in the modern era. Since then, they have received a lot of flak, and in some cases, rightfully so. The reality is that the future is not buying a JPEG of a cartoon ape which gives you nothing more than commercial rights to said JPEG and being able to flex your ownership of this NFT to others. The NFTs which have staying power and create real value will be the ones which have utility. This could be something directly practical like an &lt;a href=\"https://ens.domains/\"&gt;ENS name&lt;/a&gt; which allows you to use a human readable address for your wallet such as vitalik.eth, or it could be something more innovative and subjective in its value like a community token released by a musician which gives you many perks like private groups, special deals and even financial benefits such as tokenised song royalties.&lt;/p&gt;\n\n&lt;h1&gt;Institutional Adoption&lt;/h1&gt;\n\n&lt;p&gt;Ethereum is by far the most widely adopted blockchain by enterprises. Ethereum’s &lt;a href=\"https://entethalliance.org/\"&gt;Enterprise Ethereum Alliance&lt;/a&gt; (EEA) is the largest blockchain-enterprise partnership program and Ethereum is by far the most frequently leveraged blockchain for proof of concepts and innovation in the blockchain space by enterprises. Meanwhile, there are protocols like the &lt;a href=\"https://docs.baseline-protocol.org/\"&gt;Baseline protocol&lt;/a&gt; which is a shared framework which allows enterprises to use Ethereum as a common frame of reference and a base settlement layer without having to give up privacy when settling on the public Ethereum mainnet. This framework makes adopting Ethereum much easier for other enterprises. Another example is EY’s “Nightfall”, a Zero Knowledge optimistic rollup which provides full privacy and cheaper transactions for enterprise use.&lt;/p&gt;\n\n&lt;h1&gt;Institutional Investment&lt;/h1&gt;\n\n&lt;p&gt;This latest bull run was characterised by the beginning of institutional acceptance of cryptocurrencies as an asset class. Exposure to the space is becoming easier and easier for large institutions with custodial firms for institutional investment and hedge funds exposed to crypto offering their products left and right. But it doesn’t stop there with Ethereum. As businesses transact on Ethereum and better understand it, not only will they buy up ETH to pay for their transactions, but they will also realise that much like Bitcoin, Ethereum is a scarce asset. Better yet, a scarce asset which offers yield when staking. The first major mover in this field is Cloudflare who &lt;a href=\"https://blog.cloudflare.com/next-gen-web3-network/\"&gt;recently announced&lt;/a&gt; that they are buying and running their own staking nodes to help secure the network.&lt;/p&gt;\n\n&lt;h1&gt;Improvements in user onboarding and abstracting away complexity&lt;/h1&gt;\n\n&lt;p&gt;Ethereum has started making huge leaps forward in terms of usability for the end user. The aforementioned ENS names is a huge UX improvement which is equivalent to the huge leap forward for the internet which was DNS. No longer do you have to check every character of your ugly hexadecimal 0x43AB96D… ETH address to ensure you’re sending your ETH to the right person. Another major improvement is the advent of smart contract wallets like &lt;a href=\"https://www.argent.xyz/\"&gt;Argent wallet&lt;/a&gt;. Argent allows for users to access their wallets and interact with DeFi self-custodially from an app on their phone without having to record a private key or recovery phrase. Instead, they offer social recovery and their UI is straight forward enough for anyone who uses a smart phone to understand. Finally, for the more experienced users, DApps like Uniswap have pretty, super easy to use graphical user interfaces and can be used by anyone who knows how to run and use a browser extension like Metamask. While at times the Metamask UX still has a way to go to get to mass adoption levels of user friendliness, there have been improvements in the last year such as EIP-1559. EIP-1559 has removed the old gas price guessing game and subsequent waiting for an uncertain length of time for your transaction to be accepted. Metamask has also added a feature which allows you to switch networks to other chains or L2s in once click instead of having to manually add the RPC endpoints.&lt;/p&gt;\n\n&lt;p&gt;The user experience will continue to get better until it gets to the point where it is just like email today. So easy that even your grandmother can tap a couple of buttons and use DeFi without even knowing anything about how it works.&lt;/p&gt;\n\n&lt;h1&gt;The lack of an obvious #1 ETH killer&lt;/h1&gt;\n\n&lt;p&gt;One of Ethereum’s biggest threats is for it to be overthrown by a so-called “Ethereum killer” blockchain which claims to do everything Ethereum can do and sometimes more. However, one of the biggest hurdles to overthrowing Ethereum is finding consensus over its biggest competitor. Ethereum is by far the biggest, most decentralised and politically neutral smart contract platform which gives it a snowball effect of attracting most of the new users and builders in web 3.0. Furthermore, this gives it a stamp of legitimacy which other projects don’t have.&lt;/p&gt;\n\n&lt;p&gt;The best way to measure the adoption of a layer 1 chain is to compare the fee revenue. This is because blockchains sell block space and the fee revenue is the sum of money which people are willing to pay to access that block space. Ethereum’s fees in the last 24 hours (while I am writing this) total $3.9 million. Compare this to BNB (a network which doesn’t try to compete with Ethereum as a truly decentralised platform) which had $600,000 in fees in those same 24 hours. The next largest smart contract platform (one which actually claims to be decentralised) is Avalanche at just over $30,000. This means that Ethereum provides 100x the value to its users than its closest true competitor does. Source: &lt;a href=\"https://cryptofees.info/\"&gt;https://cryptofees.info/&lt;/a&gt;&lt;/p&gt;\n\n&lt;h1&gt;Network effects&lt;/h1&gt;\n\n&lt;p&gt;This is another topic which I made a &lt;a href=\"https://np.reddit.com/r/ethtrader/comments/guffdj/the_network_effect_is_king_what_i_have_learned/\"&gt;previous post on.&lt;/a&gt; The network effect is why Bitcoin is still the number one cryptocurrency and by such a long way. Bitcoin is not the most technologically advanced cryptocurrency. However, it has the most widespread name recognition and largest market cap. The network effect is also why most people use Zoom and Facebook Messenger/WhatsApp despite the existence of free, private, end to end encrypted alternatives which have all the same features (&lt;a href=\"https://meet.jit.si/\"&gt;https://meet.jit.si/&lt;/a&gt; for a Zoom alternative and Signal for the private messenger app. I highly recommend both. Let’s get their network effects going!). It is the same for Bitcoin. People have heard of Bitcoin and many understand it already. Many people don’t want to have to learn about or set up a wallet for alternative options. People like what is familiar and what other people use. Nobody wants to be “that guy” who makes you download yet another app and account you have to remember the password/private key for. In the same way, Enterprises don’t want to have to create a bridge between their existing systems and a dozen different blockchains. Developers don’t want to have to create DeFi money legos from scratch on a new chain if they can just plug in to existing services like Uniswap and AAVE. Likewise, users don’t want to have to download another browser extension to use DApps on another chain if they already use Ethereum. This is also why the vast majority of Ethereum killers are effectively just Ethereum clones with different specifications. The reason for this is of course because it is easier to build and onboard new users and apps if the experience is familiar and developers can port over existing applications rather than build them again from scratch.&lt;/p&gt;\n\n&lt;h1&gt;Ethereum is the most decentralised and provably neutral smart contract platform&lt;/h1&gt;\n\n&lt;p&gt;Ethereum is also the most decentralised and provably neutral smart contract platform. Unlike some of the competing smart contract platforms, you can’t round up everyone at the Ethereum Foundation or any select group of people and expect to be able to stop the network. Not only this, but the Ethereum foundation doesn’t have the ability to print more ETH or push through changes on a whim like some people would lead you on to believe. The community would reject detrimental EIPs and hard fork. Ever since the DAO hack, the Ethereum community has made it clear that it will not accept EIPs which attempt to roll back the chain even to recover hacked funds (see EIP-999).&lt;/p&gt;\n\n&lt;p&gt;Attacking Ethereum’s Proof of Stake beacon chain would be extremely costly and require a very large amount of money or influence over staking entities. In its current state, an attacker would need to control 66.7% of the &amp;gt;400,000 validators on the beacon chain to control the network. At the current moment, even the largest four custodial staking providers such as Coinbase and Kraken only add up to 34% of the total stake.&lt;/p&gt;\n\n&lt;p&gt;Finally, with the US dollar looking like it will lose its reserve currency status and the existing wire transfer system being outdated, superpowers like China won’t want to use US systems and the US won’t want to use a Chinese system. Enter Ethereum, the provably neutral settlement layer where the USA and China don’t have to trust each other or each other’s banks because they can trust Ethereum. While it may sound like a long shot, it does make sense if Ethereum hits a multi-trillion dollar market cap since it will be the most secure and politically neutral way to transfer value between adversaries. Not to mention if much of the world’s commerce were to be settled in the same place — on Ethereum — then it would make sense for governments to settle on the same platform. While this future is a long way away, it is very much a possibility.&lt;/p&gt;\n\n&lt;h1&gt;ETH distribution is decentralised&lt;/h1&gt;\n\n&lt;p&gt;Thanks to around 7 years of proof of work — a system where miners have to sell newly mined ETH to pay for electricity costs — newly mined ETH has found its way into the hands of everyday people who buy ETH off miners selling on exchanges. As pointed out by u /AdamSC1 in &lt;a href=\"https://medium.com/@adamscochran/the-10k-audit-42c100dd32bb\"&gt;his analysis of the top 10K ETH addresses&lt;/a&gt; (I highly recommend reading this if you haven’t already), the distribution of ETH is actually slightly more decentralised than Bitcoin with the top 10,000 ETH wallets holding 56.70% of ETH supply compared to the top 10,000 Bitcoin wallets which hold 57.44% of the Bitcoin supply. This decentralised distribution means that the introduction of staking won’t centralise ETH in the hands of a few wallets who could then control the network. This is an advantage for ETH which many proof of stake ETH killers will never have as they never used PoW to distribute funds widely throughout the community and these ETH killers often did funding rounds giving large numbers of tokens to VC investors.&lt;/p&gt;\n\n&lt;h1&gt;The community&lt;/h1&gt;\n\n&lt;p&gt;Finally, while I may be biased, I think that Ethereum has the friendliest community. Anecdotally, I find that the Ethereum developer community is full of forward thinking people who want to make the world a better place and build a better future, many of whom are altruistic and don’t always act in their best interests. Vitalik is one of the best examples of this. Vitalik holds less than 0.3% of the total ETH supply, a remarkably small percentage for any founder of a multi-billion dollar company or cryptocurrency (for reference, Jeff Bezos owns about 10% of Amazon and Satoshi owns about 5% of all Bitcoins). Not to mention his many charitable donations, including $1 billion dollars worth of SHIB sent to the Indian COVID relief fund (sure, there wasn’t $1 billion worth of liquidity in those SHIB tokens but it’s still a hell of a lot of money) and $5 million to aid in Ukraine among many other charitable donations. Compare this to the much more conservative, “at least we’re safe while the world burns” attitude which many Bitcoiners have. I don’t want to generalise too much here as the Bitcoin community can be great too and there are some wonderful people there. But the difference is clear if you compare the daily discussion of &lt;a href=\"/r/Bitcoin\"&gt;r/Bitcoin&lt;/a&gt; to the incredibly helpful and welcoming daily discussion of &lt;a href=\"/r/EthFinance\"&gt;r/EthFinance&lt;/a&gt; who will &lt;a href=\"https://np.reddit.com/r/ethfinance/comments/jh3zyy/daily_general_discussion_october_24_2020/g9vg1jw/\"&gt;happily answer your noob questions without calling you an idiot and telling you to do you own research&lt;/a&gt; (there are plenty more examples in any of the daily threads). Or the very helpful folks over at &lt;a href=\"/r/EthStaker\"&gt;r/EthStaker&lt;/a&gt; who will go out of their way to help you set up an Ethereum beacon chain staking node on the mainnet or testnet. Don’t believe me? Head over to those subs and see for yourself.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Please don’t hate on me if you disagree about which project has the best community, it is just my very biased personal opinion and I respect your opinion if you disagree! :)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;h1&gt;TL;DR:&lt;/h1&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;strong&gt;The Merge&lt;/strong&gt; - A ~ 90% drop in ETH issuance, beginning the era of deflationary ETH, AKA &lt;a href=\"https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Fi.imgur.com%2FDyjJE5u.jpg&amp;amp;f=1&amp;amp;nofb=1\"&gt;ultra sound money&lt;/a&gt;. Furthermore, staking yields will rise post merge. Plus, the merge starts the more secure and more environmentally friendly future of Ethereum.\n&lt;strong&gt;Extended Ethereum Roadmap&lt;/strong&gt; - The surge, the verge, the purge and the splurge offer a wide range of benefits and features which will dramatically increase Ethereum’s capabilities.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;EIP-1559 and ETH scarcity&lt;/strong&gt; - Ethereum is now the first actually profitable blockchain which doesn’t need constant inflation to pay for network security. This translates to ETH the asset actually remaining scarce and the Ethereum network secure.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Layer 2 Scaling&lt;/strong&gt; - Rollups and a “modular blockchain” architecture flip the blockchain trilemma on its head to allow Ethereum to scale while maintaining, or even increasing security and decentralisation. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;DeFi and Composability&lt;/strong&gt; - Money legos and open source code allowing for fast development and unprecedented innovation in the world of finance.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;NFTs and tokenisation&lt;/strong&gt; - Tokenise everything. No, seriously. NFTs will be so much more than just art NFTs.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Institutional Adoption&lt;/strong&gt; - Ethereum has the most enterprise partners (EEA) + the Baseline protocol and Nightfall are bullish AF. &lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Institutional Investment&lt;/strong&gt; - We have seen the beginning of institutional acceptance of crypto as an asset class but understanding is still very poor. It is a matter of time before more yield chasing institutions discover ETH, the deflationary, dividend paying/stakeable, environmentally friendly, more advanced version of Bitcoin.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Improving UX and abstracting away complexity&lt;/strong&gt; - Human readable addresses and smart contract wallets which even your mother could use. Even MetaMask and DApps are getting easier too.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;The lack of an obvious #1 ETH killer&lt;/strong&gt; - No ETH killer clearly sticks out from the rest. This makes it hard for one of them to create a big network effect. Furthermore, their actual value created is more than 100x lower than Ethereum’s.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Network effects&lt;/strong&gt; - Ethereum has by far the largest network effect and as Bitcoin has shown us, the network effect is extremely important.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;Ethereum is the most decentralised and provably neutral smart contract platform&lt;/strong&gt; - Super secure under Proof of Stake, no more tolerance of DAO like forks and a neutral platform for geopolitical adversaries on the world stage to settle on, removing the need for them to have to trust each other’s banking systems.&lt;/li&gt;\n&lt;li&gt;&lt;strong&gt;ETH distribution is decentralised&lt;/strong&gt; - Years of proof of work have put ETH in the hands of many. In fact, ETH supply is more decentralised than the supply of Bitcoin.\n&lt;strong&gt;The community&lt;/strong&gt; - Super duper mega friendly. Shoutout to &lt;a href=\"/r/ETHStaker\"&gt;r/ETHStaker&lt;/a&gt; and &lt;a href=\"/r/ETHFinance\"&gt;r/ETHFinance&lt;/a&gt;!&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Extra Sources:&lt;/p&gt;\n\n&lt;p&gt;Bankless Podcast Episode #99 - Vitalik Buterin - Endgame&lt;/p&gt;\n\n&lt;p&gt;Bankless Podcast Episode #57 and #44 - Justin Drake - Ultra sound money&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 614,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?auto=webp&amp;s=b972b3ff4a77b3df6ea016d7049412dd54920b4f",
          "width": 1200,
          "height": 630
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=89b02d2b3e490dafc2cab7c915dad29bf4ec1df7",
            "width": 108,
            "height": 56
          },
          {
            "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=ef6e7cef2778456547344422c015776bb2c3d148",
            "width": 216,
            "height": 113
          },
          {
            "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=1610abfac657f9c92d51659bb10950f9e69caab1",
            "width": 320,
            "height": 168
          },
          {
            "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=5e315215ddcd11351d0f6f30fe6ed06ad601af18",
            "width": 640,
            "height": 336
          },
          {
            "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=38979db7705d27c9b95b1b08b8c3a562fa34d5d9",
            "width": 960,
            "height": 504
          },
          {
            "url": "https://external-preview.redd.it/Cx3dA56oQSQYz-okfRMm6apiQ9AhvXQmml43w03UOEo.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=9715ad6020b662a8015990669a1ea145327abb9c",
            "width": 1080,
            "height": 567
          }
        ],
        "variants": {},
        "id": "S7qqR2wRghszbxgTpgxiLaywKO5T2Emmhc8zHm6-rrk"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/vn9qon/a_detailed_summary_of_every_single_reason_why_i/",
  "subreddit": "CryptoCurrency",
  "id": "vn9qon",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "The following will be a list of the many reasons why I still hold and am still\nextremely bullish on ETH. This is the third updated version of this post since\nthe first one I made in 2020.\n[https://np.reddit.com/r/ethtrader/comments/jhrqv1/a_detailed_summary_of_every_single_reason_why_i/]\n\n\nTHIS IS…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以下は、私が今でも保有している、多くの理由を列挙したものになります。\nETHに極めて強気である理由の一覧です。この投稿は、2020年に作成した最初のものから3回目の更新版です。\n2020年に作成した最初のものです。\n[https://np.reddit.com/r/ethtrader/comments/jhrqv1/a_detailed_summary_of_every_single_reason_why_i/]です。\n\n\nTHIS IS...",
      "title": "2022年に私がETHに強気な理由の一つ一つを詳しくまとめてみた。(最下部のTL;DR)"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "下面将列出我仍然持有并仍在持有的许多理由。\n极度看好ETH的诸多理由。这是自2020年我发表第一篇文章以来的第三个更新版本。\n我在2020年发表的第一篇文章。\n[https://np.reddit.com/r/ethtrader/comments/jhrqv1/a_detailed_summary_of_every_single_reason_why_i/]\n\n\n这就是...",
      "title": "2022年我看涨ETH的每一个理由的详细总结。(TL;DR在底部)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "下面將列出我仍然持有並仍在持有的許多理由。\n極度看好ETH的諸多理由。這是自2020年我發表第一篇文章以來的第三個更新版本。\n我在2020年發表的第一篇文章。\n[https://np.reddit.com/r/ethtrader/comments/jhrqv1/a_detailed_summary_of_every_single_reason_why_i/]\n\n\n這就是...",
      "title": "2022年我看漲ETH的每一個理由的詳細總結。(TL;DR在底部)"
    }
  ]
}