{
  "author": "MickeyTheHunter",
  "original_created_utc": 1630220705,
  "title": "So we're hating Ethereum now?",
  "created_utc": 1630247442,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Edit: Thank you everyone in the comments, my hope has been restored. Perhaps I just happened to run into the vocal minority during today&#39;s scrolling :)</em></p>\n\n<p>Looking at the front page and going through the comments, today&#39;s sentiment is clear - death to Ethereum and its exorbitant gas fees! I even spotted comments calling Ethereum a premined scam, something usually seen in the more... uhm, tribalistic subs.</p>\n\n<p>So with all the noise in <a href=\"/r/cc\">r/cc</a> I thought the world was burning (no pun intended) and checked the current gas, just to see ~40 GWEI. Oh.</p>\n\n<p>Throughout the bullrun we have seen worse, <em>much worse</em> congestion than this.</p>\n\n<p>I understand that the NFT minting spikes make for flashy screenshots - and yes, it is the NTFs. For those not aware, OpenSea currently guzzles more than twice as much gas as the next in line (Uniswap, the previous king of gas). And it tends to concentrate the gas into those ridiculous spikes. But if you&#39;re just a little patient you&#39;ll get your transaction in under 100 GWEI and if you have all day, probably under 30.</p>\n\n<p>For those interested in daily interactions with DeFi/dApps, we already have flourishing L2 ecosystems such as Polygon. Various rollups are gaining traction as well and hopefully will soon offload some of the L1 traffic.</p>\n\n<p>Sharding is still on the roadmap (and for some reason always burried at the bottom of the comment section).</p>\n\n<p>And we now also have the silver lining of burning some of the fees thanks to EIP-1559.</p>\n\n<p>Help me understand why we&#39;re hating Ethereum today and not half a year ago. Is it just because of the screenshot-worthy spikes? Is it because of the Cardano and/or Solana hype? Is it because people had the wrong expectations for EIP-1559? Or am I missing something fundamental that&#39;s going on?</p>\n\n<p>Don&#39;t get me wrong, gas fees are high and it is an issue. No one is disputing that. I just don&#39;t see how it is any worse than it used to be. And I sincerely doubt that Ethereum is going to &quot;kill itself because it&#39;s completely unusable&quot;.</p>\n\n<p>Thank you for coming to my TED rant.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pdqm80/so_were_hating_ethereum_now/",
  "subreddit": "CryptoCurrency",
  "id": "pdqm80",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: Thank you everyone in the comments, my hope has been restored. Perhaps I\njust happened to run into the vocal minority during today's scrolling :)\n\nLooking at the front page and going through the comments, today's sentiment is\nclear - death to Ethereum and its exorbitant gas fees! I even…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集部：コメント欄の皆さん、ありがとうございます！希望が戻りました。おそらく私は\n今日のスクロールでたまたま少数派の声に遭遇したのかもしれません。)\n\nフロントページとコメントを見ると、今日の感情は明確です。\nイーサリアムとその法外なガス料金に死を！」というものでした。私も...",
      "title": "イーサリアムが嫌いになったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：谢谢大家的评论，我的希望已经恢复了。也许我\n碰巧在今天的滚动中遇到了发声的少数人 :)\n\n看看头版和翻翻评论，今天的情绪是\n很明显--以太坊和其高昂的气体费用死亡！我甚至... 我甚至...",
      "title": "所以我们现在讨厌以太坊？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：謝謝大家的評論，我的希望已經恢復了。也許我\n碰巧在今天的滾動中遇到了發聲的少數人 :)\n\n看看頭版和翻翻評論，今天的情緒是\n很明顯--以太坊和其高昂的氣體費用死亡！我甚至... 我甚至...",
      "title": "所以我們現在討厭以太坊？"
    }
  ]
}