{
  "author": "RespectsWomen",
  "original_created_utc": 1624706044,
  "title": "6 months ago, I came out to my family.",
  "created_utc": 1624750233,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In a spur of the moment thing, I told my family that I own a bit of Crypto during a family Christmas get together. They looked at me like I had just told them I shoot up heroin under a bridge. My far relative took my dad to the side and told him to find a way to get me out of it before it&#39;s too late.</p>\n\n<p>I remember getting rock hard over 5% stock gains in 10 days. Thanks to this sub, I know to stay silent at family gatherings and not look down upon my uncle who holds a glass of whisky in his hands with a sense of elitism as he talks about his genius day trading techniques that give him 10-15% profit every year. Not to mention the other dads fawning over his skills and begging him to teach them. There I sit in the corner sipping my chocolate milkshake thinking about the time I saw a 130% gain on a certain alt coin in 24 hours.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/o88toz/6_months_ago_i_came_out_to_my_family/",
  "subreddit": "CryptoCurrency",
  "id": "o88toz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "In a spur of the moment thing, I told my family that I own a bit of Crypto\nduring a family Christmas get together. They looked at me like I had just told\nthem I shoot up heroin under a bridge. My far relative took my dad to the side\nand told him to find a way to get me out of it before it's too…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "クリスマスに家族で集まったとき、ふとしたきっかけで家族に自分が暗号を少し持っていることを話しました。\nクリスマスに家族で集まったときに、暗号を少し持っていることを伝えました。彼らは、まるで橋の下でヘロインを吸っていると言ったかのように私を見た。\n橋の下でヘロインを吸っていると言ったかのように見られました。遠い親戚は父を横に連れて行き\nして、手遅れになる前に俺を助け出す方法を見つけろと言ったんだ。",
      "title": "半年前、私は家族にカミングアウトしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在一次家庭圣诞聚会上，我突然告诉家人我拥有一点加密货币。\n在一次家庭圣诞聚会上。他们看着我，好像我刚刚告诉他们\n我在桥下吸食海洛因。我的远房亲戚把我父亲拉到一边\n并告诉他要想办法让我摆脱它，否则就太...",
      "title": "6个月前，我向我的家人坦白了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在一次家庭聖誕聚會上，我突然告訴家人我擁有一點加密貨幣。\n在一次家庭聖誕聚會上。他們看着我，好像我剛剛告訴他們\n我在橋下吸食海洛因。我的遠房親戚把我父親拉到一邊\n並告訴他要想辦法讓我擺脫它，否則就太...",
      "title": "6個月前，我向我的家人坦白了。"
    }
  ]
}