{
  "author": "AptitudeSky",
  "original_created_utc": 1638314240,
  "title": "We put down this sub way too much, when there is a lot of positivity for what this sub is and a lot of supportive people are here helping others",
  "created_utc": 1638394026,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think we have enough self deprecating humor to go around but I don’t think we focus on the positive at as much. &lt;/p&gt;\n\n&lt;p&gt;I’m not going to link the post because I don’t want to bring negativity to any one person but a post about inversing this sub got me pumped to post about positives I see.  &lt;/p&gt;\n\n&lt;p&gt;Here Goes: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I’ve been helped by those on here and I’ve seen others helped as well. For example, I changed phones and lost my moons as a result and &lt;a href=\"/u/nanooverbtc\"&gt;u/nanooverbtc&lt;/a&gt; took the time to help me recover them, with no expectation of anything in return. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;There are plenty of people who will wish you well if you are having trouble in crypto or life. I posted a comment about trying to stay positive amidst some life challenges and there were many that wished me well. Would link it  but don’t feel like scrolling through all of my comments to find it. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;This sub is a bastion of knowledge and information, if you ask and seek it. There are posts helping with taxes &lt;a href=\"/u/Kevin3683\"&gt;u/Kevin3683&lt;/a&gt; and &lt;a href=\"/u/supershwa\"&gt;u/supershwa&lt;/a&gt; and &lt;a href=\"/u/CryptoTaxLawyer\"&gt;u/CryptoTaxLawyer&lt;/a&gt; among others. Posts about NFTs and how to do your own research from &lt;a href=\"/u/_ArtosisCurse_\"&gt;u/_ArtosisCurse_&lt;/a&gt; and &lt;a href=\"/u/MrBluoe\"&gt;u/MrBluoe&lt;/a&gt; and so many more&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;We generally have pretty good discussions about the merits of crypto tech and philosophy and ways to get rich or lose it all&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;We have a lot of people posting about their mistakes  so you don’t make the same ones&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;We of course have the moon faucet from &lt;a href=\"/u/UnstoppableOnslaught\"&gt;u/UnstoppableOnslaught&lt;/a&gt; &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;And did I mention we have moons?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;And I’m sure there is plenty that I missed but it’s important to acknowledge the positive things, not just some of our misgivings.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 169,
  "permalink": "/r/CryptoCurrency/comments/r60ail/we_put_down_this_sub_way_too_much_when_there_is_a/",
  "subreddit": "CryptoCurrency",
  "id": "r60ail",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I think we have enough self deprecating humor to go around but I don’t think we\nfocus on the positive at as much.\n\nI’m not going to link the post because I don’t want to bring negativity to any\none person but a post about inversing this sub got me pumped to post about\npositives I see.\n\nHere Goes:\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちは、自分を卑下するユーモアは十分に持っていると思うのですが、そうではないと思っています。\nポジティブなことにフォーカスしている。\n\nネガティブな印象を与えたくないので、この記事のリンクは貼りません。\nしかし、このサブを反転させるという投稿をみて、私も投稿する気になりました。\nポジティブに考えています。\n\nさあ、どうぞ。\n\n...",
      "title": "このサブはポジティブなものが多く、多くの人がここで他の人を助けているのに、私たちはこのサブを貶め過ぎです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我认为我们有足够的自我贬低的幽默感，但我不认为我们\n我认为我们有足够多的自嘲式幽默，但我不认为我们有那么多关注积极的东西。\n\n我不打算链接这个帖子，因为我不想给任何一个人带来负面的影响。\n但一个关于反转这个子的帖子让我有动力去发表我看到的积极因素。\n我看到的积极因素。\n\n在这里。\n\n...",
      "title": "我们对这个子的评价太高了，因为这个子有很多正面的东西，很多支持的人在这里帮助别人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我認爲我們有足夠的自我貶低的幽默感，但我不認爲我們\n我認爲我們有足夠多的自嘲式幽默，但我不認爲我們有那麼多關注積極的東西。\n\n我不打算鏈接這個帖子，因爲我不想給任何一個人帶來負面的影響。\n但一個關於反轉這個子的帖子讓我有動力去發表我看到的積極因素。\n我看到的積極因素。\n\n在這裏。\n\n...",
      "title": "我們對這個子的評價太高了，因爲這個子有很多正面的東西，很多支持的人在這裏幫助別人。"
    }
  ]
}