{
  "author": "FrisbeeVR",
  "the_new_excerpt": "You have wallets or currency on exchanges. You wrote out some strings of words\nand have your passwords saved somewhere safe, two factor set up everywhere\npossible. Life is good. You're sure that if you lost you phone or if someone\nbroke into your house and stole your computers, no one else could…",
  "original_created_utc": 1624016812,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォレットや取引所の通貨を持っている方 あなたは、いくつかの文字列を書き出し\nパスワードを安全な場所に保存し、可能な限り2要素を設定している。\n可能です。人生は順調だ。もし携帯電話をなくしたり、誰かが私の携帯電話を壊したりしても、あなたは確信しています。\n誰かが家に侵入してコンピュータを盗んでも、他の誰にも...",
      "title": "Tip: 携帯電話を「なくす」練習をする。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你有钱包或交易所的货币。你写出了一些字串\n并将你的密码保存在安全的地方，在任何地方都设置了双因素\n可能的。生活是美好的。你确信，如果你的手机丢了，或者如果有人\n闯入你的房子，偷了你的电脑，别人也不可能......",
      "title": "提示。练习 \"丢失 \"你的手机。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你有錢包或交易所的貨幣。你寫出了一些字串\n並將你的密碼保存在安全的地方，在任何地方都設置了雙因素\n可能的。生活是美好的。你確信，如果你的手機丟了，或者如果有人\n闖入你的房子，偷了你的電腦，別人也不可能......",
      "title": "提示。練習 \"丟失 \"你的手機。"
    }
  ],
  "title": "Tip: Practice \"losing\" your phone.",
  "created_utc": 1624041198,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You have wallets or currency on exchanges. You wrote out some strings of words and have your passwords saved somewhere safe, two factor set up everywhere possible. Life is good. You&#39;re sure that if you lost you phone or if someone broke into your house and stole your computers, no one else could access your accounts and wallets.</p>\n\n<p>But could <em>you</em>? </p>\n\n<p>Make some time to test your own security. Imagine or recreate a situation where you can&#39;t access your usual devices. Will you be able to get your authenticators running again? How will you get your wallets up again?</p>\n\n<p>&quot;Your keys, your crypto&quot; is comforting, and knowing how to use the scribbled notes in your safe is far better than just vaguely knowing you could. In a test you might discover that something is missing, or you can&#39;t read your own handwriting. </p>\n\n<p>You never think it&#39;ll happen to you, but better to be safe than sorry.</p>\n\n<p>Edit1: i think this is the first time automod let a post of mine through! Congrats moon farmers, I&#39;m upvoting every reply here.</p>\n\n<p>Edit2: to everyone saying thanks for the advice, you&#39;re welcome. I hope this thread can actually save at least one person from preventable loss.\nFor people saying they&#39;ve lost access before and wish they had done this sooner, that fucking sucks and I&#39;m sorry to hear. Thanks for admitting it here, maybe it will inspire some people to test and beef up their setups.</p>\n\n<p>Edit3: Never had a reddit award before. How exciting! Thank you. :)</p>\n</div><!-- SC_ON -->",
  "score": 404,
  "permalink": "/r/CryptoCurrency/comments/o2n8ft/tip_practice_losing_your_phone/",
  "subreddit": "CryptoCurrency",
  "id": "o2n8ft",
  "is_self": true,
  "media": null,
  "is_video": false
}