{
  "author": "Markharris1989",
  "original_created_utc": 1634735439,
  "title": "The old adage “Buy land, they’re not making it anymore”, will some day be replaced with “Buy Bitcoin, they’re not mining it anymore”",
  "created_utc": 1634773228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am sure you’ve heard this one ad nausem, probably from anyone that owns land and wants to keep stacking the house of cards in their favour. But you know what? They are making more land, don’t believe me? Here are some thoughts:</p>\n\n<ul>\n<li><p>China has reclaimed more than 13,500 square km since 1949, that’s just shy of New York Cities larger than Los Angeles County or about the size of Connecticut.</p></li>\n<li><p>250 square km of Tokyo Bay is reclaimed, about 15% of the largest Metropolitan area in the world.</p></li>\n<li><p>Space X, Blue Origin and co are all looking to space for profits. Eventually they will be settling out there! What’s that going to do to your crappy million dollar shoe box in Sydney?</p></li>\n</ul>\n\n<p>Contrast that to Bitcoin, once it is fully distributed that’s it, no making more of it from thin air.</p>\n\n<p>So I am sure if Mark Twain was alive today he would have been singing a different tune.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qc0ioz/the_old_adage_buy_land_theyre_not_making_it/",
  "subreddit": "CryptoCurrency",
  "id": "qc0ioz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am sure you’ve heard this one ad nausem, probably from anyone that owns land\nand wants to keep stacking the house of cards in their favour. But you know\nwhat? They are making more land, don’t believe me? Here are some thoughts:\n\n * China has reclaimed more than 13,500 square km since 1949, that’s…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この話は、土地を所有している人なら誰でも聞いたことがあると思います。\n土地を持っていて、自分に有利になるようにカードの枚数を増やしたいと思っている人からは、よく聞く話です。しかし、知っていますか？\nでもね。信じられないかもしれませんが、彼らはもっと土地を作っています。信じられないかもしれませんが、いくつか考えてみましょう。\n\n * 中国は1949年以来、13,500平方キロメートル以上の土地を埋め立てた。",
      "title": "土地を買え、彼らはもうそれを作っていない」という古い格言は、いつの日か「ビットコインを買え、彼らはもうそれを採掘していない」と置き換えられるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信你已经听过这句话了，可能来自任何拥有土地的人\n并希望继续将纸牌堆积到对自己有利的地方。但你知道\n什么？他们正在制造更多的土地，不相信我？这里有一些想法。\n\n * 自1949年以来，中国已经填海造地超过13,500平方公里，那是...",
      "title": "古老的谚语 \"买土地，他们不再制造土地了\"，有一天会被 \"买比特币，他们不再挖矿了 \"所取代。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信你已經聽過這句話了，可能來自任何擁有土地的人\n並希望繼續將紙牌堆積到對自己有利的地方。但你知道\n什麼？他們正在製造更多的土地，不相信我？這裏有一些想法。\n\n * 自1949年以來，中國已經填海造地超過13,500平方公里，那是...",
      "title": "古老的諺語 \"買土地，他們不再製造土地了\"，有一天會被 \"買比特幣，他們不再挖礦了 \"所取代。"
    }
  ]
}