{
  "author": "yayeahnahna",
  "the_new_excerpt": "So, fanciful title aside, I don't really have much of an agenda going into this\nother than writing down the experience I've had over the last few weeks in one\ntake and hoping it has the impact that I'm aiming it to. For me, this is some\nlevel of catharsis because I'm still dealing with my distorted…",
  "original_created_utc": 1613400344,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "所以，抛开标题不谈，我对这篇文章并没有太多企图。\n除了把我过去几周的经历写成一篇文章之外\n并希望它有影响，我的目标是。对我来说，这是一些\n宣泄的程度，因为我还在处理我的扭曲... ...",
      "title": "PSA]止损：我的两周失败的期货。给别人一个警告，给有影响力的人一个信息。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以，拋開標題不談，我對這篇文章並沒有太多企圖。\n除了把我過去幾周的經歷寫成一篇文章之外\n並希望它有影響，我的目標是。對我來說，這是一些\n宣泄的程度，因爲我還在處理我的扭曲... ...",
      "title": "PSA]止損：我的兩週失敗的期貨。給別人一個警告，給有影響力的人一個信息。"
    }
  ],
  "title": "[PSA] Stop loss: my fortnight of failed futures. A warning to others, and a message to influencers.",
  "created_utc": 1613428869,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So, fanciful title aside, I don&#39;t really have much of an agenda going into this other than writing down the experience I&#39;ve had over the last few weeks in one take and hoping it has the impact that I&#39;m aiming it to. For me, this is some level of catharsis because I&#39;m still dealing with my distorted sense of self - and journaling it, even in these first few sentences, is the calm my mind has needed for a while, if for nothing else just to heal.</p>\n\n<p><sup>TL;DR - Bought crypto, made gains, moved to Binance, found futures - fucked mine.</sup></p>\n\n<p><strong>A note</strong>:<br/>\nCrypto is not foreign to me. While I may have been a new entrant in the 2021 market, I&#39;m a software engineer by trade and have been aware of it since the very early days of Bitcoin. My first buy-in was back in 2017, and we all know how that went, so I&#39;ve been nothing but cautious ever since. I knew the risks, I never put in more than I could afford, and I knew that if I just kept holding, it would usually (not always) come back around. None of these points were lost on me.</p>\n\n<p><strong>If you have had any previous trouble with addictions, even something as small as food, cigarettes, or alcohol, please read my story and take this as an extremely important lesson. I&#39;ll survive this, but I&#39;m absolutely certain there&#39;s plenty more who can&#39;t, or won&#39;t, especially coming into a bullish alt season. If this post has any goal, it&#39;s to minimise the possibility of that happening, and keep any losses contained to a balance sheet.</strong></p>\n\n<p><em>If you are an influencer or celebrity of any type, please make it very clear that when you&#39;re promoting cryptocurrency as an investment, there is quite a real possibility that people can slide into trading and by extension gambling. Some will lose their money, some will lose their sense of self, others will lose their lives. You have a responsibility to inform people of these risks when promoting them.</em></p>\n\n<p><em>I know that Elon frequents reddit, so please, just, take heed of this and don&#39;t let anyone find themselves where I did. Be more candid, it could make all of the difference.</em></p>\n\n<h1>Me, a brief history</h1>\n\n<p>As stated, I&#39;m a software engineer in his 30&#39;s that&#39;s worked hard to make sure I pulled myself out of a crappy childhood into the kind of life that I wished I was a part of when I was younger. I&#39;ve got a house, a couple of kids, a wife, a dog - just all the trimmings that give you that general sense of completeness.</p>\n\n<p>That doesn&#39;t mean I&#39;m not without my flaws. For as long as I can remember I&#39;ve battled an addictive personality on account of ADHD and other issues caused by a wide array of formative experiences. Alcohol, cigarettes, (soft) drugs, gambling, food, romantic escapades, and other thrill seeking behaviour was an every day occurrence for me when younger, ultimately causing me more harm than good.</p>\n\n<p>Since those days I&#39;ve worked very hard to shut off that part of my life - seeking treatment and overcoming it. This is important to note, because I&#39;m completely aware of the dangers associated with any of these behaviours, and I steer clear of any situation that may present itself that will push me back in front of that metaphoric freight train.</p>\n\n<h1>Enter, 2021</h1>\n\n<p>I&#39;ve had a decent 2020. Things went pretty bad during the first half, but I was able to really grind through the second half of the year and make sure that things were back on track and everyone in my life was looked after. I entered 2021 with a renewed sense of optimism and a great situation behind me, I&#39;d really set the bar pretty high for what was to come, and there was no way I was going to let anything stand in my way.</p>\n\n<p>In the midst of all of this, I&#39;m a redditor. Have been for near-on a decade now (I change accounts frequently), and I like to spend a little (lot) of each day scrolling through and catching up on what&#39;s happening in the world, what&#39;s funny, and just engage in a bit of conversation or crack a few jokes.</p>\n\n<p>So a few weeks ago we&#39;re all aware that WSB hit all time popularity due to the GME saga. It was thrilling, it was sticking it to wall street, it was everything that you love to see on the internet and a movement you could absolutely be a part of. Because of that, I bought my tickets - a couple of shares in GME. The excitement was off the charts, and I ultimately lost about a thousand bucks, but it was absolutely worth the price of admission. I feel like I&#39;d made an actual impact and done something useful.</p>\n\n<p>Off the back of that movement (I&#39;m sure you already know where I&#39;m going with this), Dogecoin was propelled back into the spotlight and I thought yeah, you know what, Elon is talking about it, everyone&#39;s hyped about it, I&#39;ll YOLO a bit of money at it and see how it goes. At worst I have a bag of Doge, right? I can still use it, it&#39;s another little bit of fun to be had, and it&#39;ll scratch that crypto itch that I&#39;ve been ignoring since the ring sting of 2017. Only this time I wont be making the same mistakes, or so I thought.</p>\n\n<h1>Gains gains gains!</h1>\n\n<p>So, Doge went nuts. I made about 3-4x what I initially threw in and once it started to stagnate I liquidated my position (only about 1.5x by that point) back into cash and thought okay, I&#39;ve got some money in my wallet and a crypto journey I want to start. Let&#39;s get into it. So I did my research, found a few coins that I thought were really promising, and started buying them up.</p>\n\n<p>Problem is, a lot of the coins I wanted to purchase weren&#39;t available on the exchange that I was using. So with a bit of googling I found that Binance was likely the best place for me to be able to buy the coins that I&#39;d decided I was going to put my money into. I signed up, transferred my funds, and started figuring out the interface. Being in the industry I love to poke around and see what it&#39;s made of, which is when I made the one discovery I&#39;ll live to regret: <em>futures trading</em>.</p>\n\n<p>You see, for the uninitiated: futures trading is gambling. There&#39;s no real other way to cut it, but it&#39;s gambling. You&#39;re risking what you have by borrowing what you don&#39;t in the pursuit of earning a multiplier rather than just purchasing an asset, so the risk is off the charts. Being that I&#39;d had no stock market experience and had no idea what it was, I thought it really was just a neat trading tool. I had a play around with it and instantly I was hooked. I had no idea how anybody could lose using this. It made me feel like the most badass trader around - sitting in front of my high-tech console with all my graphs, making longs and shorts, green indicators everywhere, it was an absolute wonder.</p>\n\n<h1>Knowing the market, trusting what you see</h1>\n\n<p>This was mistake #2. This sub, a few other subs, and social media are absolutely flooded with gains porn, advice on the market, information on what to invest in, and when to invest it. A lot of it is super helpful advice and if you&#39;re well versed in the internet it&#39;s easy enough to filter out the shills and make your own decision after researching what you&#39;ve read.</p>\n\n<p>Problem is that I had no idea the market conditions and how that can really influence your investment, especially if futures trading. I knew that there could be a bullish or bearish market, what each of those things meant, and I knew that it would go up and down, so look out for certain things on graphs and other indicators.</p>\n\n<p>One thing I didn&#39;t know much about is liquidation prices, margins, and how much things could go south by something as small as BTC rallying (turns out alts get hit pretty hard), new money flooding the market, whales putting up price walls and manipulating buys/sells, and just how fast all of those things could destroy my position.</p>\n\n<h1>The loss of it all</h1>\n\n<p>When you get addicted to something, all of the dopamine in your brain is telling you to do it again, do it more, take more risk, and everything else that you know not to be true - it&#39;s just true in that moment. Because the market was doing so well I was duped into thinking that <em>I</em> was doing well, that <em>I</em> was some masterful trader and had it all figured out, and I started to increase those positions and decrease margins, because the gains were even bigger that way. By this point, I had enough balance to cover what I put into coins originally + what I wasted on the WSB fiasco. That was absolutely perfect and I was going to take it out and put it back in the family bank, but I wanted to make another trade, just <em>one</em> more. This coin I&#39;m confident about is breaking out and I want to at least walk away with some profit after all was said and done.</p>\n\n<p>Well, that was the moment I learned that things can take a turn very quickly, and a liquidation event won&#39;t just <strong><em>reduce</em></strong> your position, it will completely wipe anything you have left + the margins. I locked my phone, attended to something around the house, opened my phone to look again, and there it was:</p>\n\n<p>Nothing.</p>\n\n<p>No trade, no balance, just nothing. The price had dipped below the liquidation point and unbeknownst to me it was all over just like that. Now, just like I said before, I never risked or put in what I couldn&#39;t afford to lose, and it was a completely avoidable mistake had I known more about it, but that&#39;s where things really started to fuck me up.</p>\n\n<h1>How could I have been so stupid?</h1>\n\n<p>This is where it starts to take a turn, because it really starts to play on your sense of self when you make a mistake that big due to not knowing. Losing it all on a big gamble, taking a known risk, any of those things - you can handle the loss. You were prepared for it, you set yourself up for it, you made that conscious choice to put yourself out there in that way and you didn&#39;t win. It sucks, but that&#39;s okay, you can handle it.</p>\n\n<p>This move wasn&#39;t that. This move was a complete and utter fuck up due to my lack of knowledge and understanding. Accidentally finding myself gambling and being unaware of it was bad enough, but losing it all like that so suddenly when I planned to dip out of the position if it went too poorly really shook me to the core. I had <em>plans</em> for that money, I was going to <em>do</em> things with that money. These are just some of thoughts that start swirling through your mind in the moment and you feel like you&#39;ve deprived yourself and the people around you of that opportunity by being an idiot. But it&#39;s okay, you&#39;re not an idiot, you just made a mistake.</p>\n\n<h1>Let&#39;s add more money, make it all back</h1>\n\n<p>This is the point that I was in too deep but had no idea. By this point, about a week in, trading had completely consumed me and my days/nights/interactions with family, my relationship with friends was thinned, I was irritable, I was distracted, I was always watching the market. I wasn&#39;t sleeping, I wasn&#39;t eating well, all I could watch and feel were my trades. I had to baby them, otherwise they wouldn&#39;t work. I was obsessive over all my moves, all of my positions, all of my research - the works.</p>\n\n<p>Only to me it had happened so gradually that I didn&#39;t even recognise that I was all the way down that hole. I didn&#39;t realise how consumed I&#39;d become or how bad things had gotten because I&#39;d just slowly and willingly walked into it all thinking it was completely innocent when it was anything but, so when I got to the point of losing that chunk of money, I thought I&#39;d just made a minor mistake and because my trades were already so good, and I could make that back in a second.</p>\n\n<p>So, stupidly and regretfully, I pulled a large sum of money out of my credit card and slapped it into my wallet. I was going to make back what I lost, make up for my stupid mistake, take it all out, and call it a day. I&#39;d flown too close to the flames and I just wanted to make my exit quietly and gracefully, pretend it never happened and move on.</p>\n\n<p>But it didn&#39;t happen like that.</p>\n\n<h1>The final moments</h1>\n\n<p>In order to make back what I&#39;d lost, I retook the same position that I&#39;d lost on in the first place. I thought it was a winning position, and honestly in the long run it really is. If I had more money, more time, and more knowledge, it would have - but I didn&#39;t have any of those things. I put the money right back in to where I made the mistake, vowing not to make it again now that I was armed with the knowledge of what to do, and started again.</p>\n\n<p>So earlier in the story I talked about BTC rallying and alts dropping rapidly, then whales smelling blood in the water and forcing others to panic sell / trigger stop losses / trigger liquidations, then gobbling up all that remains on the cheap. This is the point in my story where I learned all of those things happen. In order to prevent bleeding out and dying entirely I had to keep reducing my position when possible, and topping up my margin. It went lower, so I had to weather it. I was too deep to sell my position and take the loss, I just had to make sure I didn&#39;t bleed out - it was going to swing back up, right? It always has.</p>\n\n<p>That&#39;s where I was wrong. It didn&#39;t. Every time it went lower I had to sell off a portion and bolster my margins. I lost more, and more, and more, until eventually I had 1/4 of what I had left. At this point I was in too deep, so I vowed again to learn my mistakes, and use this money to slowly and incrementally make back what I&#39;d lost that time.</p>\n\n<p>But the market got worse, and I was caught completely unaware in a storm that I couldn&#39;t even comprehend. I was a man in a tin boat in the middle of a tsunami. It was all lost. That was it, it was over.</p>\n\n<p>Once all was said and done, I&#39;d lost around $20,000 USD.</p>\n\n<h1>The mind is more important than the pocket</h1>\n\n<p>This is I guess where I get to the core message, and the lesson that I want people to learn from where I&#39;m sitting.</p>\n\n<p>First of all, losing money is bad no matter how you cut it. Some people will go into this investing way more than they can afford to lose, and some people will keep it small. Some people, like me, will small but end up losing way more than they need to. It will take a while for me to recover, but it won&#39;t ruin my life. Either way, it&#39;s a very hard lesson to learn just on that front.</p>\n\n<p>Secondly is your sense of self, sanity, and reality. Now to me this is the absolute most important lesson to learn of them all. You can very easily find yourself down the rabbit hole and not even know you&#39;re there, just as I did. You can be in too deep, destroying your bank balance and everyone around you, and justify it because you&#39;ve so gradually moved into it that it&#39;s all part of your plan. Sort of like the frogs in a boiling pot analogy. By the time you&#39;ve noticed it&#39;s always going to be way too late, and by that point the damage is near irreparable.</p>\n\n<h1>Where I&#39;m at, and the future</h1>\n\n<p>For me this only ended within the last few days, so I&#39;m still processing how I even found myself here, and how to move forwards. Writing this out is helpful because it&#39;s allowing me to process and learn from my own mistakes as I go along.</p>\n\n<p>Ultimately I&#39;ve cost my family a lot of money, I&#39;ve cost myself some opportunities both cash-wise and coin-wise (I have a grand total of zero of the coins that I planned to keep as investments), and I&#39;m dealing with some existential problems that have shaken me so horribly I&#39;m in the middle of a mental breakdown. Don&#39;t get me wrong, I&#39;m writing this all very logically and reasonably, but the amount that I&#39;m struggling to comprehend how I ended up here, and the sheer scale of loss, is just making my question my entire self right to the core.</p>\n\n<p>But that&#39;s the lesson I want people to learn. It doesn&#39;t matter so much about the money, the opportunity, or anything else that you may lose if you find yourself on the losing side of a bad situation. It&#39;s about the mental toll and how you&#39;ll react to that, how you&#39;ll see yourself, how you&#39;ll see the world around you and the pain you&#39;ll have to go through as a result of it.</p>\n\n<p>I&#39;ll heal. Slowly. Time will get me there, but as a part of that I want to try and limit anyone else entering this market afresh from making the same mistakes that I did. Part of that is telling my story, and the other part is hoping that we can make people more aware that futures/margin trading is gambling. If you have an addictive personality, stay away from it. If you&#39;re encouraging people to get into crypto, make sure it&#39;s known.</p>\n\n<p>If I&#39;d have known, maybe I&#39;d be having a different time right now. But, honestly, it&#39;s hell. Through the tears, self-berating, and intrusive harmful thoughts, I just wish I could have picked it. I&#39;ve been through it all before and I can avoid these situations pretty successfully, and yet it <em>still</em> caught me with my pants down. That&#39;s something that&#39;s hard to accept no matter who you are.</p>\n\n<p>It can happen to you, too. No matter how smart you are, no matter what you&#39;ve been through, and no matter what you know.</p>\n\n<p>Just, don&#39;t be me. It&#39;ll torture you forever. If nothing else let me take that one for the team.</p>\n\n<p>Questions are welcome. Take care out there.</p>\n\n<p>———</p>\n\n<p>EDIT: Thank you all so much for the positive responses, constructive conversation, awards, and otherwise. You’re helping me way more than you could ever imagine. There’s such a big range of people here all the way from “it happened to me”, through to “thank you for warning me”. It makes me feel much less alone.</p>\n\n<p>A huge thanks as well to the anonymous redditor that tipped me 1 NANO. I’ve officially got coins again! I’m giggling like a little kid - that was super special and means so much, thank you.</p>\n</div><!-- SC_ON -->",
  "score": 329,
  "permalink": "/r/CryptoCurrency/comments/lkf1c5/psa_stop_loss_my_fortnight_of_failed_futures_a/",
  "subreddit": "CryptoCurrency",
  "id": "lkf1c5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728619116
}