{
  "author": "DarkLeoLion",
  "the_new_excerpt": "I have nothing against short sellers. But if you fully understand how that\nstrategy works then you also fully understand that 98% of all of the GameStop\nshort sellers are about to get the life burned out of them. The only way this\nstock can continue going up is if other short sellers continue having…",
  "original_created_utc": 1611359019,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不反对卖空者。但是，如果你完全理解如何\n策略有效，那么你也完全明白，98%的GameStop\n卖空的人就要被烧死了。唯一的办法是\n股票可以继续上涨是如果其他卖空者继续有...",
      "title": "Gamestop短裤即将被活活烧死!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不反對賣空者。但是，如果你完全理解如何\n策略有效，那麼你也完全明白，98%的GameStop\n賣空的人就要被燒死了。唯一的辦法是\n股票可以繼續上漲是如果其他賣空者繼續有...",
      "title": "Gamestop短褲即將被活活燒死!"
    }
  ],
  "title": "Gamestop Shorts about to get burned ALIVE!",
  "created_utc": 1611384786,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have nothing against short sellers. But if you fully understand how that strategy works then you also fully understand that 98% of all of the GameStop short sellers are about to get the life burned out of them. The only way this stock can continue going up is if other short sellers continue having bad positions and end up losing money. For 98% of you short sellers you&#39;re in it way too early. You going to end up buying those shares at much higher prices and in the process burning out other short sellers. That however is going to continue to push the price upward. Only the short sellers in the very end will win. And take this from a former GameStop employee. A lot of the upper management team of GameStop hold a dick load of shares. When they finally drop out so that they can cap these gains. The only people who are going to make money are them and the short sellers who would be holding positions when that happens. The rest of you guys, bend over and lube up because you&#39;re about to get F&#39;d.</p>\n</div><!-- SC_ON -->",
  "score": 43,
  "permalink": "/r/stocks/comments/l307zt/gamestop_shorts_about_to_get_burned_alive/",
  "subreddit": "stocks",
  "id": "l307zt",
  "is_self": true,
  "media": null,
  "is_video": false
}