{
  "author": "isaac_horstmeier",
  "original_created_utc": 1629649741,
  "title": "This lady from El Salvador, accepts Bitcoin on the street!",
  "created_utc": 1629664392,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lady who has a little food cart on the street on El Salvador, it&#39;s currently accepting Bitcoin as payment with Bitcoin Wallet transactions, and she prefers payments on Bitcoin rather than people paying with Fiat. She believes that Bitcoin it&#39;s like a (better) savings account.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/25rrc6g6qxi71.png?width=990&amp;format=png&amp;auto=webp&amp;s=dfdd5b306441747200f3b26f9ce2f69817a65df8\">The Food Cart.</a></p>\n\n<p>If you search on google &quot;El salvador Currency&quot; you get this:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/oi8vua2kqxi71.png?width=1078&amp;format=png&amp;auto=webp&amp;s=4d3452acaa05e8cc9cf56213031aaf3c28f4f5db\">\\&quot;El Salvador Currency\\&quot; Google search.</a></p>\n\n<p>This is the way my friends, bullish on El Salvador economy. Hopefully we can all see crypto adoption like this on our own countries on the future.</p>\n</div><!-- SC_ON -->",
  "score": 191,
  "permalink": "/r/CryptoCurrency/comments/p9flp9/this_lady_from_el_salvador_accepts_bitcoin_on_the/",
  "subreddit": "CryptoCurrency",
  "id": "p9flp9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lady who has a little food cart on the street on El Salvador, it's currently\naccepting Bitcoin as payment with Bitcoin Wallet transactions, and she prefers\npayments on Bitcoin rather than people paying with Fiat. She believes that\nBitcoin it's like a (better) savings account.\n\n\n\nThe Food…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エルサルバドルの路上で小さな屋台を経営している女性は、現在、ビットコインウォレット取引でビットコインの支払いを受け付けています。\nビットコイン・ウォレットでの取引でビットコインの支払いを受け付けています。\n彼女は、人々がフィアットで支払うよりも、ビットコインでの支払いを好んでいます。彼女は次のように考えています。\nビットコインは（より良い）貯蓄口座のようなものです。\n\n\n\nフード...",
      "title": "このエルサルバドルの女性は、路上でビットコインを受け付けています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一位女士在萨尔瓦多的街道上有一个小的食品车，它目前\n接受比特币作为比特币钱包交易的付款方式，而且她更喜欢\n她更喜欢用比特币付款，而不是人们用法币付款。她认为\n比特币它就像一个（更好的）储蓄账户。\n\n\n\n食物...",
      "title": "这位来自萨尔瓦多的女士，在街上接受比特币!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一位女士在薩爾瓦多的街道上有一個小的食品車，它目前\n接受比特幣作爲比特幣錢包交易的付款方式，而且她更喜歡\n她更喜歡用比特幣付款，而不是人們用法幣付款。她認爲\n比特幣它就像一個（更好的）儲蓄賬戶。\n\n\n\n食物...",
      "title": "這位來自薩爾瓦多的女士，在街上接受比特幣!"
    }
  ]
}