{
  "author": "OrderingTacos",
  "the_new_excerpt": "From Saturday's Wall Street Journal article on AMC:\n\n\"As the (AMC) stock rocketed the next day, day traders exhorted each other not\nto sell, flashing images of diamond hands on social media to signify the\nstrength of their commitment. But back among AMC's long-standing investor base\nof Wall Street…",
  "original_created_utc": 1614789884,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "来自周六《华尔街日报》关于AMC的文章。\n\n\"当AMC的股价在第二天飙升时，日间交易员们互相劝告，不要再买了\n来销售，在社交媒体上闪现钻石手的图片，以示。\n承诺的力度。但回到AMC的长期投资人群体之中\n华尔街的...",
      "title": "与华尔街相比，散户投资者更关心美国企业的成功。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "來自週六《華爾街日報》關於AMC的文章。\n\n\"當AMC的股價在第二天飆升時，日間交易員們互相勸告，不要再買了\n來銷售，在社交媒體上閃現鑽石手的圖片，以示。\n承諾的力度。但回到AMC的長期投資人羣體之中\n華爾街的...",
      "title": "與華爾街相比，散戶投資者更關心美國企業的成功。"
    }
  ],
  "title": "Retail investors care more for the success of American businesses than Wall Street",
  "created_utc": 1614819444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From Saturday&#39;s Wall Street Journal article on AMC:  </p>\n\n<p>&quot;As the (AMC) stock rocketed the next day, day traders exhorted each other not to sell, flashing images of diamond hands on social media to signify the strength of their commitment. But back among AMC&#39;s long-standing investor base of Wall Street players, there was money to be made. Silver Lake, which held a $600 million investment in the company&#39;s bonds, immediately capitalized on the rally by converting the debt into equity and liquidating its entire position, capturing a $113 million profit.&quot;  </p>\n\n<p>When I read this I was really pissed, until I read on and saw what it meant for AMC . . .  </p>\n\n<p>&quot;Silver Lake&#39;s quick decision amounted to a material gain for AMC. &#39;It was immediately beneficial...cause we got rid of $600 million of debt,&#39; Mr. Aron said.&quot;  </p>\n\n<p>&quot;Mr. Mahmoodzagedan, AMC&#39;s investment banker, said, &#39;The retail investor (that&#39;s you beautiful smoothbrained retards)  clearly had more faith in the long-term viability of this company than a lot of the institutional investors did.&#39; That, he said &#39;gave the company a major life-line. The retail investor really helped create that bridge to a post-pandemic future.&#39;&quot;  </p>\n\n<p>Remember this for when they haul you in front of a Senate Inquiry like they did DFV. &quot;We save American companies. Wall Street short sellers destroy them. I am not a cat. I am the savior of American businesses.&quot;</p>\n</div><!-- SC_ON -->",
  "score": 8614,
  "permalink": "/r/wallstreetbets/comments/lwyb27/retail_investors_care_more_for_the_success_of/",
  "subreddit": "wallstreetbets",
  "id": "lwyb27",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937759884
}