{
  "author": "damittydam",
  "the_new_excerpt": "Lately I've seen a lot of posts about day trading. These posts are not about\nrisk management, they're not about the amount of time, effort and commitment you\nneed at this job. These posts are just repetitive sentences usually in all caps\nsaying \"don't day trade\" \"invest and hold long term\".…",
  "original_created_utc": 1612491430,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "最近我看到很多关于日内交易的帖子。这些帖子不是关于\n风险管理，它们与你所花费的时间、精力和承诺无关。\n需要在这份工作中。这些职位只是重复的句子，通常是大写的。\n俗话说 \"不要当日交易\"\"投资并长期持有\"....",
      "title": "如果你要做交易，你需要绝对确定和认真对待。这是一个高层次的职业，不是爱好。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近我看到很多關於日內交易的帖子。這些帖子不是關於\n風險管理，它們與你所花費的時間、精力和承諾無關。\n需要在這份工作中。這些職位只是重複的句子，通常是大寫的。\n俗話說 \"不要當日交易\"\"投資並長期持有\"....",
      "title": "如果你要做交易，你需要絕對確定和認真對待。這是一個高層次的職業，不是愛好。"
    }
  ],
  "title": "If you're gonna be trading, you need to be absolutely certain and serious about it. It's a high level profession, not a hobby.",
  "created_utc": 1612503188,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lately I&#39;ve seen a lot of posts about day trading. These posts are not about risk management, they&#39;re not about the amount of time, effort and commitment you need at this job. These posts are just repetitive sentences usually in all caps saying &quot;don&#39;t day trade&quot; &quot;invest and hold long term&quot;. Investing is a good advice but these posts are low effort and not in depth.</p>\n\n<p>So, here&#39;s an in depth about the reality of trading.</p>\n\n<p><strong>A few things:</strong></p>\n\n<p><strong><em>1. &quot;X% (70-90, this number changes every time I read this quote) of traders lose money&quot;</em></strong>\nYes it is true, 70-90%, whatever number it is, it&#39;s a high number. Why is this?</p>\n\n<p>Trading is an actual profession, not a hobby. But unlike any other high level profession, it doesn&#39;t have any entry barriers. Getting into it is just as easy as clicking a few buttons. You want to be a doctor, lawyer, engineer, etc, you need to apply to universities, study hard, do entrance exams, study more, more exams, study even more for licencing exams and even more for higher degrees. All these entrance exams weed out the people who weren&#39;t committed enough. In case of trading, the free markets weed out (wipe out) the one&#39;s who aren&#39;t committed.</p>\n\n<p><strong><em>2. Difference between people who fail vs succeed.</em></strong></p>\n\n<p>People who aren&#39;t serious about it (losers) think it&#39;s easy money, they watch a few beginner videos on trading and a few clickbait videos like &quot;How to use this x indicator to double your gains&quot;. They go into trades based on their emotions or based on the one technical indicator they know about. They don&#39;t even research what they are trading. They might not even use stop limits. They either go in and out too quickly, in at the sight of a green candle, out at the first sight of a red candle. Or they go in and have an optimistic number they wanna exit at, sometimes they hit it, sometimes they&#39;re left holding the bag. They go all in at their starting position, rather than adding in increments.</p>\n\n<p>Where as people who are serious (winners), study and learn everything they can about all the indicators, not by watching 5 min clickbait videos, but by actually reading in depth about them or watching in depth educational videos. They practice on demo accounts or with small amounts. They research about the trades they go into. Based on their own technical analysis and strategy, they make a plan including the risk they are willing to accept for a particular trade and set stop losses accordingly. They enter their positions in increments, rather than going all in, crucial for risk management. They record and review their trades at the end of the day and adjust their strategy if needed.</p>\n\n<p>It&#39;s a zero sum game, for someone to make money someone has to lose money, the unprepared people who don&#39;t take this seriously, lose to the top ~20% who have done their homework.</p>\n\n<p><strong>Questions to ask yourself before trading:</strong></p>\n\n<ol>\n<li>Do I have the time to trade?</li>\n<li>Do I actually like the profession, do I like learning and studying technical analysis? Do I like researching about the coin and learning about its fundamentals?</li>\n<li>Am I likely to just watch a few videos and dabble into it and just give up?</li>\n<li>Do I wanna do day trading or swing trading or both? (Day trading is when you&#39;re in and out of a trade in few minutes or hours, swing trading is when you&#39;re in a trade for a few days, weeks or months)</li>\n</ol>\n\n<p><strong>Trading vs investing:</strong></p>\n\n<p>There is no &quot;vs&quot; in this. You can do both.\nTrading is a profession just like any other, it&#39;s a source of income. \nDiversified investing is for everyone, it gives you returns over many years. You still need to manage it every once in a while to weed out losers and add new emerging value assets. You don&#39;t want your investments to go tits up because of a few bad apples.</p>\n\n<p><strong>Some bullshit people say:</strong> </p>\n\n<p><strong><em>1. Technical analysis doesn&#39;t matter.</em></strong></p>\n\n<p>Ask any professional trader who makes consistent money, they all rely on multiple indicators for their entries and exits, one thing they don&#39;t rely on are emotions.\nTechnical analysis tools and indicators are named after the mathematicians and traders who came up with them and consistently beat the market using them.</p>\n\n<p><strong><em>2. Time in the market beats timing the market</em></strong></p>\n\n<p>What a vague statement, when we all know it&#39;s a mix bag of things.</p>\n\n<p>Good investors make bank, they manage their portfolio, recognising and removing shit assets, adding new promising ones. Bad investors let losing assets diminish their returns, watch their portfolio go tits up or barely make enough to account for the inflation.</p>\n\n<p>Good traders make bank, they know how to manage risk, how to maximize returns by adding to a winning position and having an exit strategy. Bad traders go all in with each trade, without a well formed strategy, they trade based on hopes, greed and fear.</p>\n\n<p><strong>Q. I want to invest/trade. How do I start?</strong></p>\n\n<p><em>For Investing:</em></p>\n\n<ul>\n<li>Do your own research into crypto/stocks you wanna invest in. Have a mix of some reliable assets that are most likely to survive the test of time, and some speculative one&#39;s that show potential. Make changes as you see fit on an yearly-ish basis.</li>\n<li>Find a reputable brokerage with large number of available stocks. For crypto find a reputable exchange, buy coins there and if you have a large sum, transfer them to your private wallet. Most wallets should let you create a recovery seed words that you keep safe and memorize incase you lose your wallet.</li>\n</ul>\n\n<p><em>For trading:</em></p>\n\n<ul>\n<li>First learn everything you can. A good place to learn is the scripts on trading view.</li>\n<li>Now practice applying what you&#39;ve learned on a demo account or with small amount to money (20-50$). Practice for a month atleast. Even tho its not as stressful as a large sum of money, it&#39;s still very helpful.</li>\n<li>Find a reputable brokerage or exchange account in your region.</li>\n<li>Research what you are trading, it&#39;s a misconception that traders don&#39;t need to know about the fundamentals of a company/coins coz they&#39;re in and out in a short term. One good news or bad news can determine how a stock/crypto will perform on that day. Learning about the fundamentals of different coins helps you stay away from pump and dump shitcoins.</li>\n<li>Don&#39;t trade with margin, if you are new.</li>\n<li>Don&#39;t jump in if you don&#39;t like the current price point, sometimes it&#39;s a waiting game, make a price alert. Always have a plan before entering a trade.</li>\n<li>Analyze and improve your strategies.</li>\n<li>And never forget stop losses/limits and moving them up as your trade goes into profit.</li>\n</ul>\n\n<p>Moral of the story, it&#39;s a good idea to let newcomers know that trading is an actual profession that requires studying, time and effort. But don&#39;t make shitposts about day trading if you don&#39;t know anything about it, or you don&#39;t like it, or because you were a shit trader and lost money.</p>\n</div><!-- SC_ON -->",
  "score": 1282,
  "permalink": "/r/CryptoCurrency/comments/lcwyje/if_youre_gonna_be_trading_you_need_to_be/",
  "subreddit": "CryptoCurrency",
  "id": "lcwyje",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123193192
}