{
  "author": "Cardassia",
  "original_created_utc": 1639800628,
  "title": "Has the belief in homeopathy decreased within the past few years?",
  "created_utc": 1639831878,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems like I very rarely hear about homeopathic medicine treated as anything other than quackery anymore. A few years ago it seemed like the Next Big Thing in alternative medicine. What has caused this, or am I incorrect and it is still widely believed in?&lt;/p&gt;\n\n&lt;p&gt;Disclaimer: I know homeopathy is objectively BS, just curious where belief in it is compared to 5-10 years ago.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/riz161/has_the_belief_in_homeopathy_decreased_within_the/",
  "subreddit": "askscience",
  "id": "riz161",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "It seems like I very rarely hear about homeopathic medicine treated as anything\nother than quackery anymore. A few years ago it seemed like the Next Big Thing\nin alternative medicine. What has caused this, or am I incorrect and it is still\nwidely believed in?\n\nDisclaimer: I know homeopathy is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ホメオパシー医学が何かとして扱われているという話はほとんど聞かないような気がします。\nもうヤブ医者以外の何者でもない。数年前までは 次なるビッグ・シングのように思えましたが\n代替医療における それとも、私が間違っていて、まだ残っているのでしょうか？\nが広く信じられているのでしょうか？\n\n免責事項：ホメオパシーは知っているのですが...",
      "title": "ここ数年、ホメオパシーに対する信仰は薄れてきているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我似乎很少听到有人把顺势疗法当作任何东西来对待。\n顺势疗法不再是庸医了。几年前，它似乎是替代医学的下一个大事件\n在替代医学中。是什么导致了这种情况，还是我的观点不正确，它仍然被广泛相信？\n疗法仍被广泛相信？\n\n免责声明：我知道顺势疗法是...",
      "title": "在过去的几年里，顺势疗法的信念是否有所下降？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我似乎很少聽到有人把順勢療法當作任何東西來對待。\n順勢療法不再是庸醫了。幾年前，它似乎是替代醫學的下一個大事件\n在替代醫學中。是什麼導致了這種情況，還是我的觀點不正確，它仍然被廣泛相信？\n療法仍被廣泛相信？\n\n免責聲明：我知道順勢療法是...",
      "title": "在過去的幾年裏，順勢療法的信念是否有所下降？"
    }
  ]
}