{
  "author": "Lemonmule69",
  "the_new_excerpt": "Look at how gme has been handled by Melvin and citadel. So much shady shit going\non in the background and now these big dawgs are here to play. Expect the same\nsort of shit. Remember the likes of this crew cooked up 2008.\n\nIt’s a finite resource and they want it. They will start pulling dodgy shit…",
  "original_created_utc": 1617231259,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "看看梅尔文和Citadel是如何处理Gme的。有那么多不光彩的事情发生\n而现在这些大块头在这里玩。期待同样的\n的那种狗屎。请记住，像这样的团队在2008年做了很多事情。\n\n这是一种有限的资源，他们想要它。他们会开始做一些不靠谱的事情......",
      "title": "现在，高盛和其他金融界的内部人士都在这里。记住，他们会做任何事情来开始把你和你的比特币分开。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看看梅爾文和Citadel是如何處理Gme的。有那麼多不光彩的事情發生\n而現在這些大塊頭在這裏玩。期待同樣的\n的那種狗屎。請記住，像這樣的團隊在2008年做了很多事情。\n\n這是一種有限的資源，他們想要它。他們會開始做一些不靠譜的事情......",
      "title": "現在，高盛和其他金融界的內部人士都在這裏。記住，他們會做任何事情來開始把你和你的比特幣分開。"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "メルビンとシタデルのgmeの扱いを見てください。多くのいかがわしいことが起こっています\nそして今、この大物たちが勝負に出た。同じことを\nのようなものです。2008年にこのメンバーで作ったことを思い出してください。\n\nそれは有限な資源であり、彼らはそれを望んでいる。彼らはいかがわしいことをし始めるだろう...。",
      "title": "ゴールドマンをはじめとする金融インサイダーが登場した今。彼らはあなたをビットコインから引き離すためなら、どんなことでもすることを忘れないでください。"
    }
  ],
  "title": "Now that Goldman and other financial insiders are here. Remember, they will do ANYTHING to start separating you from your bitcoin.",
  "created_utc": 1617248150,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Look at how gme has been handled by Melvin and citadel. So much shady shit going on in the background and now these big dawgs are here to play. Expect the same sort of shit. Remember the likes of this crew cooked up 2008.</p>\n\n<p>It’s a finite resource and they want it. They will start pulling dodgy shit like we have never seen. It’s that simple. They aim is to accumulate and the best way they know how is dunking the fuck out of retail.</p>\n\n<p>Hodl strong people, Goldman Sachs wants your bitcoin.</p>\n</div><!-- SC_ON -->",
  "score": 922,
  "permalink": "/r/CryptoCurrency/comments/mhhvp2/now_that_goldman_and_other_financial_insiders_are/",
  "subreddit": "CryptoCurrency",
  "id": "mhhvp2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138681
}