{
  "author": "cman2222222",
  "the_new_excerpt": "I’ve worked in customer service for about five years. And I know anecdote is not\nresearch and I know confirmation bias is a thing, but I can say confidently that\nboomers (usually men) are consistently the RUDEST and most self-centered people\nI’ve encountered. They demand special service and…",
  "original_created_utc": 1615357662,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我在客户服务部门工作了五年左右。我知道轶事不是\n研究，我知道确认偏差是一个东西， 但我可以自信地说，\n潮人（通常是男性）一直是最粗鲁和最以自我为中心的人。\n我遇到过。他们要求特殊的服务和...",
      "title": "还有人暗暗松了一口气，潮人人口老去了吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在客戶服務部門工作了五年左右。我知道軼事不是\n研究，我知道確認偏差是一個東西， 但我可以自信地說，\n潮人（通常是男性）一直是最粗魯和最以自我爲中心的人。\n我遇到過。他們要求特殊的服務和...",
      "title": "還有人暗暗鬆了一口氣，潮人人口老去了嗎？"
    }
  ],
  "title": "Is anyone else secretly relieved that the boomer population is aging out?",
  "created_utc": 1615409170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve worked in customer service for about five years. And I know anecdote is not research and I know confirmation bias is a thing, but I can say confidently that boomers (usually men) are consistently the RUDEST and most self-centered people I’ve encountered. They demand special service and discounts, they make what they think is banter but actually lacks any semblance of wit (and is usually just racist or homophobic or misogynistic or just plain stupid). Let’s set aside the fact that the 55+ demographic is singularly responsible for blocking any policy that could enact meaningful change in my or my peers’ lives (for the climate, a robust min wage commensurate with inflation, affordable education, healthcare that isn’t tied to an employer, etc etc). I am so relieved any time someone 18-40 is signing up for a membership at the gym where I work. They don’t disrespect “the help” because they’ve lived through the same series of economic disasters caused directly by the elite boomer class and know what it’s like to have to work in a service job without any benefits even when you have a college degree. Ive struggled with older family members to engage in meaningful discourse because they were never taught how to contemplate nuance or analyze a source. It’s painful. They demand so much in life and give nothing. I don’t articulate this perspective out loud because I’m fully aware of the generational prejudices I’ve developed as a consequence of my work and sexual orientation - but dang they are just a mean and nasty people forever siphoning resources and dishing out hate. (Context: I almost quit yesterday when a 65-year old couple refused to wear their masks as I took their temperatures before granting them access to the facility. They threw an enormous tantrum and threatened to have me fired for “forcing libtard ideas on them” but because they’re on the board of directors, I had to be polite).</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/m1r7sp/is_anyone_else_secretly_relieved_that_the_boomer/",
  "subreddit": "TooAfraidToAsk",
  "id": "m1r7sp",
  "is_self": true,
  "media": null,
  "is_video": false
}