{
  "author": "unoriginal_duck",
  "original_created_utc": 1656241562,
  "title": "Why are chess rankings separated by gender?",
  "created_utc": 1656253701,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I understand the argument for separating leagues by gender in sport, especially physical games like Ice Hockey and boxing, but chess is a mental sport, in which there seems to be no significant advantage for a certain gender, nor does it look like they use different rulesets.\nFIDE has 4 Titles, GrandMaster (GM), International Master (IM), FIDE Master (FM), and Candidate Master (CM). But it also has &amp;quot;Women&amp;#39;s&amp;quot; versions (WGM, WIM, WFM, and WCM), For seemingly no reason.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 124,
  "permalink": "/r/NoStupidQuestions/comments/vl2by3/why_are_chess_rankings_separated_by_gender/",
  "subreddit": "NoStupidQuestions",
  "id": "vl2by3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I understand the argument for separating leagues by gender in sport, especially\nphysical games like Ice Hockey and boxing, but chess is a mental sport, in which\nthere seems to be no significant advantage for a certain gender, nor does it\nlook like they use different rulesets. FIDE has 4 Titles,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スポーツにおける男女別リーグ分けの議論は理解できる、特に\nアイスホッケーやボクシングのような身体的な競技はそうですが、チェスは精神的なスポーツです。\n特定の性別に大きなアドバンテージがあるようには見えませんし、また、異なるルールセットを使\nルールセットを使い分けているようにも見えません。FIDEには4つのタイトルがあり、...",
      "title": "チェスのランキングはなぜ男女で分かれているのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我理解在体育运动中按性别划分联赛的论点，特别是像冰球和拳击这样的体力运动。\n但国际象棋是一项智力运动，在这种运动中，白人似乎没有明显的优势。\n某种性别似乎没有明显的优势，也没有\n看起来他们使用不同的规则。国际棋联有4个头衔，...",
      "title": "为什么国际象棋的排名要按性别分开？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我理解在體育運動中按性別劃分聯賽的論點，特別是像冰球和拳擊這樣的體力運動。\n但國際象棋是一項智力運動，在這種運動中，白人似乎沒有明顯的優勢。\n某種性別似乎沒有明顯的優勢，也沒有\n看起來他們使用不同的規則。國際棋聯有4個頭銜，...",
      "title": "爲什麼國際象棋的排名要按性別分開？"
    }
  ]
}