{
  "author": "SnooMacarons1548",
  "the_new_excerpt": "It's 2021 and the Corona virus is finally looking like it's coming to an end. A\nlight at the end of a dark dark tunnel. This is terrible for investors. The\neconomy opening up is the worst thing for businesses here in the year of our\nlord 2021. The best thing to happen to the market? A global…",
  "original_created_utc": 1616639342,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在是2021年，电晕病毒终于像是要结束了。A\n黑暗的隧道尽头的光。这对投资者来说是可怕的。的\n经济开放对我们这里的企业来说是最糟糕的事情，在我们的年\n主2021年。市场最好的事情是什么？一个全球...",
      "title": "2021年 - 最伟大的投资年"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在是2021年，電暈病毒終於像是要結束了。A\n黑暗的隧道盡頭的光。這對投資者來說是可怕的。的\n經濟開放對我們這裏的企業來說是最糟糕的事情，在我們的年\n主2021年。市場最好的事情是什麼？一個全球...",
      "title": "2021年 - 最偉大的投資年"
    }
  ],
  "title": "2021 - The greatest year of Investing",
  "created_utc": 1616663990,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s 2021 and the Corona virus is finally looking like it&#39;s coming to an end. A light at the end of a dark dark tunnel. This is terrible for investors. The economy opening up is the worst thing for businesses here in the year of our lord 2021. The best thing to happen to the market? A global pandemic that claimed the lives of millions and shut down the entire world. This was good for businesses and the economy. We all got rich except people who didn&#39;t believe tesla was worth a bazillion dollars. </p>\n\n<p>Our celebrity host president was amazing for our market, but someone with actual political background is horrific for the market. Biden needs to get a tan and hop on Twitter asap. </p>\n\n<p>Stimulus. Well, stimulus was amazing for stocks, until the media decided it wasn&#39;t. Now it&#39;d bad. Which brings us to inflation. One day treasury yeilds inching up a tad to expected levels is the scariest thing ever (oh my God! Inflation! Where did this alien thing come from and?!) and the worst thing to happen to tech in quite some time. What happens when those yeilds start to plummet? Oh it&#39;s also bad for tech. </p>\n\n<p>Fundamentally sound businesses are no longer worth investing in while GME and AMC are around - they are the best investments since Apple or Amazon. Amazing companies here in 2021. </p>\n\n<p>Oh and did I forget to mention semiconductors? This year has showed us that supply and demand is a Boomer metric that we should throw out. Massive global shortage of chips? Bad for chipmakers as there are way more demand for their products and less supply. This is obvious in modern day investing. What else am I missing? Can you guys name a few more?</p>\n\n<p>What&#39;s next I must ask.</p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/stocks/comments/mcnnqo/2021_the_greatest_year_of_investing/",
  "subreddit": "stocks",
  "id": "mcnnqo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752822105
}