{
  "author": "Zimavishon",
  "the_new_excerpt": "Saw this article by wall street journal, it says these firms are buying up\nthousands of houses to rent out. Why are they doing this instead of buying\npublic stocks or private companies? Isn't the return of single family real\nestate lower? What is the long term plan for them?\n\nIt's not like they are…",
  "original_created_utc": 1623347171,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ウォールストリートジャーナルの記事によると、これらの企業は何千もの家を購入して貸し出しているそうです。\n何千軒もの家を買い取って貸し出しているそうです。なぜ彼らは株式や民間企業を買うのではなく、このようなことをしているのでしょうか？\n公開株や民間企業を買うのではなく、なぜこのようなことをするのでしょうか？一戸建て不動産のリターンは低いのではないでしょうか？\nリターンは低いのではないか？彼らの長期的な計画はどうなっているのか？\n\nそれは、彼らが...",
      "title": "ブラックロックなどの投資会社が、なぜ全米の一戸建て住宅を買い集めているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "看到《华尔街日报》的这篇文章，它说这些公司正在收购\n数以千计的房屋用于出租。他们为什么这样做而不是购买\n公共股票或私人公司？单一家庭房地产的回报率不是很低吗？\n房地产的回报率不是更低吗？他们的长期计划是什么？\n\n他们又不像...",
      "title": "为什么像黑石这样的投资公司和其他公司正在购买美国各地的独立屋？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "看到《華爾街日報》的這篇文章，它說這些公司正在收購\n數以千計的房屋用於出租。他們爲什麼這樣做而不是購買\n公共股票或私人公司？單一家庭房地產的回報率不是很低嗎？\n房地產的回報率不是更低嗎？他們的長期計劃是什麼？\n\n他們又不像...",
      "title": "爲什麼像黑石這樣的投資公司和其他公司正在購買美國各地的獨立屋？"
    }
  ],
  "title": "Why are investment firms like Blackrock and others buying up single family homes across the US?",
  "created_utc": 1623369052,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Saw this article by wall street journal, it says these firms are buying up thousands of houses to rent out.   Why are they doing this instead of buying public stocks or private companies? Isn&#39;t the return of single family real estate lower? What is the long term plan for them?</p>\n\n<p>It&#39;s not like they are getting deals on them. They are paying above asking for many of these properties at already sky high prices. Can anyone explain this?</p>\n\n<p><a href=\"https://www.wsj.com/articles/if-you-sell-a-house-these-days-the-buyer-might-be-a-pension-fund-11617544801\">https://www.wsj.com/articles/if-you-sell-a-house-these-days-the-buyer-might-be-a-pension-fund-11617544801</a></p>\n</div><!-- SC_ON -->",
  "score": 583,
  "permalink": "/r/investing/comments/nwtq1w/why_are_investment_firms_like_blackrock_and/",
  "subreddit": "investing",
  "id": "nwtq1w",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009742336
}