{
  "author": "cinnamintdown",
  "original_created_utc": 1652391159,
  "title": "10 years ago the point of cryptocurrency was to be a P2P electronic cash that anyone in the world could use, a decentralized currency that no one can stop you from using. Are there any current projects that reflect this original design?",
  "created_utc": 1652446345,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I like the idea of a fully decentralized p2p e-cash, is there anything that still resembles this vision? &lt;/p&gt;\n\n&lt;p&gt;After reading the bitcoin whitepaper which outlines how bitcoin was supposed to work, crypto seemed really cool. But the vision of BTC is long dead and it no longer aims to be what it was designed to be.&lt;/p&gt;\n\n&lt;p&gt;One things I have to point out though is that &amp;#39;centralization&amp;#39; of control of money is decentralized by having many mining nodes, full nodes that don&amp;#39;t mine add zero value to decentralization.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m interested in a crypto that anyone can use for things, that no one can stop them from using. High fees pretty much make this not possible. Is there anything for me?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 334,
  "permalink": "/r/CryptoCurrency/comments/uobt7b/10_years_ago_the_point_of_cryptocurrency_was_to/",
  "subreddit": "CryptoCurrency",
  "id": "uobt7b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I like the idea of a fully decentralized p2p e-cash, is there anything that\nstill resembles this vision?\n\nAfter reading the bitcoin whitepaper which outlines how bitcoin was supposed to\nwork, crypto seemed really cool. But the vision of BTC is long dead and it no\nlonger aims to be what it was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は完全な分散型P2P電子キャッシュのアイデアが好きなのですが、このビジョンに似たものはありますか？\nこのビジョンに似たものはありますか？\n\nビットコインのホワイトペーパーを読んだ後、ビットコインがどのように機能するかを概説しています。\n暗号は本当にクールだと思いました。しかし、BTCのビジョンはとっくに終わり、かつてのようなものを目指しているわけではありません。\nしかし、BTCのビジョンはとっくに終わっており、かつてのようなものを目指してはいない...。",
      "title": "10年前、暗号通貨のポイントは、世界中の誰もが使えるP2P電子マネー、誰にも止められない非中央集権的な通貨であることでした。この当初の設計を反映した現在のプロジェクトはあるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢完全去中心化的p2p电子现金的想法，有什么东西还类似于这个愿景吗？\n仍然类似于这个愿景吗？\n\n在阅读了比特币白皮书之后，该白皮书概述了比特币应该如何工作。\n工作后，加密货币似乎真的很酷。但是，BTC的愿景早已不复存在，它不再是\n它的目标不再是它曾经的样子...",
      "title": "10年前，加密货币的重点是成为世界上任何人都可以使用的P2P电子现金，这是一种去中心化的货币，没有人可以阻止你使用。目前是否有任何项目反映了这一原始设计？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡完全去中心化的p2p電子現金的想法，有什麼東西還類似於這個願景嗎？\n仍然類似於這個願景嗎？\n\n在閱讀了比特幣白皮書之後，該白皮書概述了比特幣應該如何工作。\n工作後，加密貨幣似乎真的很酷。但是，BTC的願景早已不復存在，它不再是\n它的目標不再是它曾經的樣子...",
      "title": "10年前，加密貨幣的重點是成爲世界上任何人都可以使用的P2P電子現金，這是一種去中心化的貨幣，沒有人可以阻止你使用。目前是否有任何項目反映了這一原始設計？"
    }
  ]
}