{
  "author": "deepspace8",
  "original_created_utc": 1637765818,
  "title": "For those of you who are going to HODL until you die, do you at least use your crypto assets for something useful, such as borrowing against it or lending some out with interest?",
  "created_utc": 1637808062,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been buying since 2017 and have mostly HODL&#39;ed, cashing out a couple tiny amounts, but putting most of it back.  I&#39;ve been offered the opportunity to borrow against it from my exchange but declined.  I looked into lending but heard borrowers can and do default, and figured borrowers who borrow bitcoin likely do so because they get turned down from banks, and so I decided to not risk it.  So I mostly just sit on it.</p>\n\n<p>What do you do?</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/Bitcoin/comments/r171h5/for_those_of_you_who_are_going_to_hodl_until_you/",
  "subreddit": "Bitcoin",
  "id": "r171h5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been buying since 2017 and have mostly HODL'ed, cashing out a couple tiny\namounts, but putting most of it back. I've been offered the opportunity to\nborrow against it from my exchange but declined. I looked into lending but heard\nborrowers can and do default, and figured borrowers who borrow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は2017年から購入していますが、ほとんどHODL'EDで、ほんの少しだけキャッシュアウトしています。\nしてきましたが、そのほとんどを戻してきました。機会があれば、私は\n取引所から借りる機会がありましたが、断りました。貸し出しについても調べましたが、聞いた\n借り手がデフォルトする可能性があり、借り手が借りても...と考えました。",
      "title": "死ぬまでHODLをする人は、せめて暗号資産を借りたり、利子をつけて貸し出したりと、何か役に立つことに使っているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从2017年开始买入，主要是HODL'ed，套现了几个小数目。\n的金额，但大部分又放了回去。我已经有机会\n从我的交易所借钱，但被拒绝了。我研究过借贷，但听说\n借款人可以而且确实会违约，并且认为借款人如果借...",
      "title": "对于那些打算HODL到死的人来说，你至少要把你的加密货币资产用在有用的地方，比如用它来借钱，或者用利息借出一些？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從2017年開始買入，主要是HODL'ed，套現了幾個小數目。\n的金額，但大部分又放了回去。我已經有機會\n從我的交易所借錢，但被拒絕了。我研究過借貸，但聽說\n借款人可以而且確實會違約，並且認爲借款人如果借...",
      "title": "對於那些打算HODL到死的人來說，你至少要把你的加密貨幣資產用在有用的地方，比如用它來借錢，或者用利息借出一些？"
    }
  ]
}