{
  "author": "CBScott7",
  "original_created_utc": 1634089348,
  "title": "Algorand Foundation participating in the governance when they stated they would not.",
  "created_utc": 1634103197,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First let me start by saying this is not intended to be FUD but I find it very concerning.</p>\n\n<p>Yesterday I made a post which showed an account committing 50 million Algo to the governance. Upon further research this account belongs to the Algorand Foundation. If you look at the algo block explorer, you will see the Algorand6 account deposited these Algos to the account and proceeded  to commit them to governance.</p>\n\n<p><a href=\"https://algoexplorer.io/address/OVAA75Q4VPN7JLKD6GEKBRV6WEEZSQTN5H6RVR2XM4JMR3WXSABY4VAT6E\">https://algoexplorer.io/address/OVAA75Q4VPN7JLKD6GEKBRV6WEEZSQTN5H6RVR2XM4JMR3WXSABY4VAT6E</a></p>\n\n<p>And here is the link to the governance page showing the 50 million committed.</p>\n\n<p><a href=\"https://governance.algorand.foundation/governance-period-1/governors/OVAA75Q4VPN7JLKD6GEKBRV6WEEZSQTN5H6RVR2XM4JMR3WXSABY4VAT6E\">https://governance.algorand.foundation/governance-period-1/governors/OVAA75Q4VPN7JLKD6GEKBRV6WEEZSQTN5H6RVR2XM4JMR3WXSABY4VAT6E</a></p>\n\n<p>Here is the link to the Decentralizing Algorand Governance Proposal which explicitly states </p>\n\n<p>&quot;The Foundation will set up the votes but will not participate in the Governors’ program.&quot;</p>\n\n<p><a href=\"https://prismic-io.s3.amazonaws.com/algorandfoundationv2/1f4bd113-3f64-4d3e-b69b-bcd988305359_ALG102-21Q2-C_Governance+Proposal_en-IE_FINAL.PDF\">https://prismic-io.s3.amazonaws.com/algorandfoundationv2/1f4bd113-3f64-4d3e-b69b-bcd988305359_ALG102-21Q2-C_Governance+Proposal_en-IE_FINAL.PDF</a></p>\n\n<p>I&#39;m sure I am not alone when I say we need a real explanation from the Algorand Foundation for the sake of transparency regarding this situation. Who does this 50 million Algo belong to and how/who did they acquire it from?</p>\n\n<p>I sent a transaction of 0.001 algo to this account yesterday with an attached message which links to my reddit post yesterday and will do the same for this post so it will be immortalized on the Algo blockchain.</p>\n\n<p>Edit: Some users have pointed out that this may be an Algorand Inc account which is different than the Algorand Foundation. Even if that is the case, I still believe this warrants a detailed explanation and transparency is required showing where these two supposedly separate entities are collaborating and for what ends.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/q70ril/algorand_foundation_participating_in_the/",
  "subreddit": "CryptoCurrency",
  "id": "q70ril",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First let me start by saying this is not intended to be FUD but I find it very\nconcerning.\n\nYesterday I made a post which showed an account committing 50 million Algo to\nthe governance. Upon further research this account belongs to the Algorand\nFoundation. If you look at the algo block explorer, you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に言っておきますが、これはFUDを意図したものではありませんが、私は非常に気になります。\n気になります。\n\n昨日、あるアカウントが5千万アルゴをガバナンスにコミットしているという投稿をしました。\nガバナンスに5千万アルゴを投入しているアカウントの投稿をしました。調べてみると、この口座はAlgorand Foundationのものでした。\n財団です。アルゴブロックエクスプローラーを見てみると...",
      "title": "アルゴランド財団がガバナンスに参加しないと言っていたのに、参加してしまった。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我要说的是，这并不是想让人产生疑虑，但我发现它非常\n担忧。\n\n昨天我发了一个帖子，其中显示一个账户承诺将5000万Algo用于\n治理。经过进一步研究，这个账户属于Algorand\n基金会。如果你看一下阿尔戈区块探索器，你...",
      "title": "阿尔戈兰基金会在声明不参与治理的情况下参与了治理。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我要說的是，這並不是想讓人產生疑慮，但我發現它非常\n擔憂。\n\n昨天我發了一個帖子，其中顯示一個賬戶承諾將5000萬Algo用於\n治理。經過進一步研究，這個賬戶屬於Algorand\n基金會。如果你看一下阿爾戈區塊探索器，你...",
      "title": "阿爾戈蘭基金會在聲明不參與治理的情況下參與了治理。"
    }
  ]
}