{
  "author": "SummerLover69",
  "the_new_excerpt": "I realize what I'm about to say may be unpopular, but I'd like to start a\ngenuine discussion on this topic. I understand what is being said, when people\nrepeat the not your keys...phrase, but if Bitcoin wants to grow up, we need to\nget past that for a multitude of reasons. Full disclosure, I hold…",
  "original_created_utc": 1615563780,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我意识到我要说的话可能不受欢迎，但我想开始一个。\n关于这个话题的真正讨论。我明白大家在说什么，当人们\n重复着不是你的钥匙......这句话，但如果比特币想要成长起来，我们就需要\n摆脱过去的原因有很多。全面披露，我持有...",
      "title": "如果比特币要成为主流，我们需要从 \"不是你的钥匙，不是你的币\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我意識到我要說的話可能不受歡迎，但我想開始一個。\n關於這個話題的真正討論。我明白大家在說什麼，當人們\n重複着不是你的鑰匙......這句話，但如果比特幣想要成長起來，我們就需要\n擺脫過去的原因有很多。全面披露，我持有...",
      "title": "如果比特幣要成爲主流，我們需要從 \"不是你的鑰匙，不是你的幣\"。"
    }
  ],
  "title": "If Bitcoin is going to be mainstream, we need to move on from \"not your keys, not your coins.\"",
  "created_utc": 1615584870,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I realize what I&#39;m about to say may be unpopular, but I&#39;d like to start a genuine discussion on this topic. I understand what is being said, when people repeat the not your keys...phrase, but if Bitcoin wants to grow up, we need to get past that for a multitude of reasons. Full disclosure, I hold small amounts of Bitcoin in a hardware wallet and I also have IRA funds invested in GBTC as well as some on Coinbase.</p>\n\n<p>Recently I&#39;ve been talking to family members about investing in Bitcoin and I realize they have no business ever holding their own keys. I believe they are far better off using something like Paypal, Coinbase, Robinhood or investing through GBTC/OBTC etc. These people are smart and educated but older and not that tech savvy.</p>\n\n<p>Almost daily I see a post here from someone that has managed to lose their coins in any number of ways. Yet, also daily I see comments advising not to use Paypal/CashApp/RobinHood or Coinbase to hold Bitcoin. Having a 3rd party do the custodial duties is actually a valuable service to the majority of people. I know it&#39;s popular here to use hardware wallets and protect the seed words, but how will people handle that when they start to get dementia? I&#39;m wondering what I will do in a decade or 3 when I may not be as sharp as I am today. I believe insured custodial services are the future for the vast majority of future Bitcoin users and we shouldn&#39;t discourage their use.</p>\n</div><!-- SC_ON -->",
  "score": 506,
  "permalink": "/r/Bitcoin/comments/m3k6wz/if_bitcoin_is_going_to_be_mainstream_we_need_to/",
  "subreddit": "Bitcoin",
  "id": "m3k6wz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147373533
}