{
  "author": "captaincavalrycam",
  "original_created_utc": 1647846928,
  "title": "Is it bad that I literally don’t care about the aesthetic of my car?",
  "created_utc": 1647864724,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Like, people care so much about making sure their car is in pristine condition, but I just like, don’t care. All it is to me is a hunk of metal that conveniently gets me from place to place. Obviously I make sure the insides of the car are well kept up, as that can affect the actual performance of the car, but like, I don’t care if somebody scratches my car. Or dents it. I don’t care if it’s dirty. I don’t care if the paint fades. It’s literally just a “convenient transportation machine”. &lt;/p&gt;\n\n&lt;p&gt;My girlfriend is like, obsessed with her car, wants to always keep it looking perfect, and there’s nothing wrong with that imo, but she always tells me that I should take more care of my car and take pride in its appearance. I take good care of lots of my things, like my home, my various collections, etc. I just don’t care about car lol. Was wondering what some other people thought.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/NoStupidQuestions/comments/tj5wp1/is_it_bad_that_i_literally_dont_care_about_the/",
  "subreddit": "NoStupidQuestions",
  "id": "tj5wp1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Like, people care so much about making sure their car is in pristine condition,\nbut I just like, don’t care. All it is to me is a hunk of metal that\nconveniently gets me from place to place. Obviously I make sure the insides of\nthe car are well kept up, as that can affect the actual performance of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自分の車がきれいな状態であることを確認するために、人々はとても気を遣うのです。\nでも、私は気にしない。私にとっては、金属の塊で\n移動に便利なんです。もちろん、私は、その内部を確認します。\n車の性能に影響を与えるので、きちんと手入れをしています。",
      "title": "文字通り、車の美観にこだわらないのが悪いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "就像，人们如此关心确保他们的车处于原始状态。\n但我只是喜欢，并不关心。对我来说，它只是一坨金属，可以方便地让我从一个地方到另一个地方。\n方便地把我从一个地方送到另一个地方。很明显，我确保汽车内部保持良好的状态。\n显然，我确保汽车内部保持良好，因为这会影响到汽车的实际性能。",
      "title": "我真的不关心我的车的美感，这很糟糕吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "就像，人們如此關心確保他們的車處於原始狀態。\n但我只是喜歡，並不關心。對我來說，它只是一坨金屬，可以方便地讓我從一個地方到另一個地方。\n方便地把我從一個地方送到另一個地方。很明顯，我確保汽車內部保持良好的狀態。\n顯然，我確保汽車內部保持良好，因爲這會影響到汽車的實際性能。",
      "title": "我真的不關心我的車的美感，這很糟糕嗎？"
    }
  ]
}