{
  "author": "mamaxchaos",
  "original_created_utc": 1629844372,
  "title": "I’m a crotchety old man in the 1700s. What do I complain about “kids these days” not appreciating and what sort of new inventions are ruining the world?",
  "created_utc": 1629857025,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You know how cell phones are blamed now for social isolation and selfishness, when it was print newspapers not too long ago, “distracting” from social conversation in public? Laptops are blamed for “ruining” books and kids not knowing how to write, and available sheets of paper were blamed on “ruining” slates with chalk?</p>\n\n<p>What was it back in the 1700s? What did old men yell about back then?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/paxz6x/im_a_crotchety_old_man_in_the_1700s_what_do_i/",
  "subreddit": "AskHistorians",
  "id": "paxz6x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "You know how cell phones are blamed now for social isolation and selfishness,\nwhen it was print newspapers not too long ago, “distracting” from social\nconversation in public? Laptops are blamed for “ruining” books and kids not\nknowing how to write, and available sheets of paper were blamed on…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "携帯電話が社会的孤立や利己主義の原因になっていると言われていますよね。\n少し前の新聞では、公共の場での社会的な会話から「気をそらす」と書かれていたのに\n公共の場での会話の妨げになるからです。ノートパソコンは、本を台無しにし、子供たちが字を書けないと非難されています。\nノートパソコンは本をダメにしたと言われ、子供たちは字を書くことを知らないと言われ、紙が使えるようになったのは...",
      "title": "私は1700年代の腐った老人です。最近の子供」が評価しないことに文句を言い、どんな新しい発明が世の中をダメにするのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道现在手机是如何被指责为社会隔离和自私的。\n当它在不久前还是印刷报纸时，\"分散 \"了社会上的注意力\n谈话？笔记本电脑被指责为 \"毁了 \"书本，孩子们不知道如何写作。\n笔记本被指责为 \"毁了 \"书本和孩子们不知道如何写作，而可用的纸张则被指责为......",
      "title": "我是一个17世纪的老顽固。我抱怨 \"现在的孩子 \"不懂得欣赏，什么样的新发明会毁了这个世界？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道現在手機是如何被指責爲社會隔離和自私的。\n當它在不久前還是印刷報紙時，\"分散 \"了社會上的注意力\n談話？筆記本電腦被指責爲 \"毀了 \"書本，孩子們不知道如何寫作。\n筆記本被指責爲 \"毀了 \"書本和孩子們不知道如何寫作，而可用的紙張則被指責爲......",
      "title": "我是一個17世紀的老頑固。我抱怨 \"現在的孩子 \"不懂得欣賞，什麼樣的新發明會毀了這個世界？"
    }
  ]
}