{
  "author": "notapersonaltrainer",
  "the_new_excerpt": "With Coinbase bringing tons of attention and looking like it will have a sky\nhigh valuation many are going to be looking for cheaper c****o stocks.\n\nMining stocks produce leveraged returns over the underlying asset, whether it's\ngold, silver, or bitcoin.\n\n * You are buying the profit (variable)…",
  "original_created_utc": 1618325413,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "コインベースは注目を集めており、高額な評価を受けることになりそうです。\n多くの人が、より安価なC****o銘柄を探していることでしょう。\n\n鉱山株は、金、銀、ビットコインなどの原資産にレバレッジをかけてリターンを得るものです。\n金、銀、ビットコインなどの原資産にレバレッジをかけたリターンを得ることができます。\n\n * あなたは利益（変数）を購入している...",
      "title": "ビットコイン・マイニング銘柄のご案内"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "随着Coinbase带来大量的关注，看起来它将有一个天\n高估值很多人都会去寻找更便宜的c****o股票。\n\n矿业股产生的杠杆回报率高于标的资产，无论是\n黄金，白银，或比特币。\n\n * 你买的是利润（可变）... ...",
      "title": "比特币挖矿股票指南"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着Coinbase帶來大量的關注，看起來它將有一個天\n高估值很多人都會去尋找更便宜的c****o股票。\n\n礦業股產生的槓桿回報率高於標的資產，無論是\n黃金，白銀，或比特幣。\n\n * 你買的是利潤（可變）... ...",
      "title": "比特幣挖礦股票指南"
    }
  ],
  "title": "Guide to bitcoin mining stocks",
  "created_utc": 1618331800,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With Coinbase bringing tons of attention and looking like it will have a sky high valuation many are going to be looking for cheaper c****o stocks. </p>\n\n<p>Mining stocks produce leveraged returns over the underlying asset, whether it&#39;s gold, silver, or bitcoin. </p>\n\n<ul>\n<li><p>You are buying the profit (variable) minus costs (fixed). </p></li>\n<li><p>Say it costs $10 to mine $11 worth of bitcoin/gold. That&#39;s $1 (10%) profit. </p></li>\n<li><p>The asset doubles in price to $22 (+100%). Profit is $11 (+1100%).</p></li>\n</ul>\n\n<p>Evaluating miners can be daunting at first but they&#39;re actually very simple <a href=\"https://static.seekingalpha.com/uploads/2021/3/12/49782598-16155711719714544_origin.png\">quantifiable</a> operations with very little guesswork. By looking at <a href=\"https://static.seekingalpha.com/uploads/2021/4/5/49782598-16176481499887147_origin.png\">current</a> and <a href=\"https://imgur.com/a/FS884xP\">future</a> hashrate, electricity costs, and saved bitcoin we can value these companies with high precision at specific bitcoin price points. </p>\n\n<p>There are two ways to value these stocks. Based on <a href=\"https://static.seekingalpha.com/uploads/2021/4/5/49782598-16176654693896902_origin.png\">current hashrate</a> or <a href=\"https://static.seekingalpha.com/uploads/2021/4/5/49782598-16176645878387735_origin.png\">projected hashrate</a>. Their proper value probably lies somewhere in between. </p>\n\n<p>With a very very modest 25PE (miners and hot tech stocks often go into the 100&#39;s) and bitcoin $100k (lower than most institutional estimates) we can calculate a <a href=\"https://imgur.com/w7uvlo5\">3.5-5.1x potential</a>. </p>\n\n<p>Miners are a leveraged play on bitcoin like gold miners on gold. Their profit is the difference between the price floor to mine and price of bitcoin. Profitability data can be tracked <a href=\"https://bitinfocharts.com/comparison/bitcoin-mining_profitability.html#1y\">here</a>. </p>\n\n<p>Unlike leveraged bitcoin you can&#39;t be washed out. Unlike altc<em>ins you don&#39;t risk picking the wrong blockchain. They combine the upside of altc</em>ins with the inevitability of bitcoin but somehow get the least attention. This of course also means they are more volatile than bitcoin so you need an iron stomach. </p>\n\n<p>The public miners are in a race to secure hashrate and cheap power. With announced purchases we can calculate their <a href=\"https://imgur.com/W2gRL0K\">income</a>.</p>\n\n<p>Miners are incentivized to <a href=\"https://imgur.com/61rSlV9\">h*dl bitcoin</a> and in some cases outright buy bitcoin for their balance sheets. This further increases price appreciation when bitcoin moves for the stocks with a high h*dl. </p>\n\n<p>Mara and Riot have the highest market caps being on Nasdaq. However, the pre-Nasdaq stocks&#39; <a href=\"https://imgur.com/aKzj0PG\">market caps</a> are far behind what their hashrate should be valued. There are some massive <a href=\"https://imgur.com/P9qxdCx\">price dislocations</a> going on because of the Nasdaq barrier. </p>\n\n<p><a href=\"https://www.youtube.com/channel/UCPJvLknI9JEwW_p4m8xaAow\">Blonity</a> is a great analyst in the sector and has created an all in one <a href=\"https://imgur.com/V3wWOtS\">BMXI indicator</a> which calculates the degree of undervalue of each stock based on these hashrate-to-marketcap discrepancies. This <a href=\"https://www.youtube.com/playlist?list=PLuzv_eMtviCHnWJ9Irn-nqslzD1XV5xsY\">playlist</a> explains in more detail how the indicators work. Note: DGHI &amp; DMGI are new smallcap miners that were recently added and have less history than the rest and I wouldn&#39;t recommend making them a main position. </p>\n\n<p>A Nasdaq uplisting could be explosive for the OTC miners. However, Mara and Riot may outperform in the short term due to better accessibility. In the long term Mara has the most future hashrate secured and will dominate the scene. My strategy is to hold mostly OTC miners now then roll into the Nasdaq miners after the value gaps close. </p>\n\n<p>The biggest concern about miners (and what previous DDs here got wrong) is that mining is intensely competitive with little moat and they will lose marketshare as global hashpower ramps up. This is unfounded for multiple reasons. </p>\n\n<ol>\n<li>Asics and cheap megawatt energy &amp; facilities are in short supply and they have bought up large shares for months to years into the future. Backlogs are huge.<br/></li>\n<li>Bitcoin&#39;s price and mining profitability has always appreciated <a href=\"https://imgur.com/0E73cNv\">faster</a> than the hashrate &amp; difficulty so it&#39;s not an issue in the next year </li>\n<li>Public money should give them a growth advantage and I asked Blonity to test this hypothesis and indeed they are gobbling up <a href=\"https://imgur.com/rj0yW27\">marketshare</a>.</li>\n</ol>\n\n<p>These companies are also branching out. Argo has purchased a staking company, Hive &amp; Hut8 do some GPU mining which can be used for AI/Rendering computation, some are buying bitcoin like Microstrategy, etc. They will evolve into general blockchain and data companies. </p>\n\n<p>We can <a href=\"https://imgur.com/poG6ZP3\">calculate</a> how many times their share price could multiply at $200k bitcoin at various PE ratios. Hot tech companies can have PE&#39;s in the 100&#39;s. They&#39;re currently trading around 3-4.</p>\n\n<p>This is the most asymmetric trade I&#39;ve ever seen if you are bullish on bitcoin. With Coinbase around the corner I think these companies are going to get a lot of attention soon and the quiet pre-Nasdaq miners could have quite a run.</p>\n\n<p>Another great way to hold these is the <a href=\"https://amplifyetfs.com/blok.html\">BLOK ETF</a>. It has surprisingly good holdings with all the pre-Nasdaq miners represented in the top 10 and I highly recommend it. It has some good exchanges and straight bitcoin funds as well and they will be <a href=\"https://www.youtube.com/watch?v=xKE1tAyCSyo\">adding</a> COIN.</p>\n\n<p>Some other resources <a href=\"https://seekingalpha.com/article/4417795-sizing-up-12-bitcoin-mining-stocks\">1</a> <a href=\"https://www.youtube.com/channel/UCPJvLknI9JEwW_p4m8xaAow\">2</a> <a href=\"https://www.youtube.com/channel/UCmnlt28-isf3okeyjUVHVhQ\">3</a> <a href=\"https://www.realvision.com/shows/the-interview-crypto/videos/blockstream-the-benefits-of-investing-in-bitcoin-mining\">4</a>.</p>\n</div><!-- SC_ON -->",
  "score": 1127,
  "permalink": "/r/investing/comments/mq3sz8/guide_to_bitcoin_mining_stocks/",
  "subreddit": "investing",
  "id": "mq3sz8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617806
}