{
  "author": "Sjors22-",
  "original_created_utc": 1625125790,
  "title": "Why is taking profits so hard but putting money into crypto so damn easy!",
  "created_utc": 1625165079,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been putting more and more money into crypto for years now, yet i havent cashed out a single time. Everytime my portfolio is at An ATH the greed takes over and i want more and more and in the end IT all drops 50% and i wish i sold some. Yet i make the same mistakes over and over again. For me, taking profits is Just too hard. The feeling of missing out on big money is to big for some reason. But putting money into crypto at any time seems like a good idea in my head. Damn i need to get a strategy next run!</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/obgv90/why_is_taking_profits_so_hard_but_putting_money/",
  "subreddit": "CryptoCurrency",
  "id": "obgv90",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have been putting more and more money into crypto for years now, yet i havent\ncashed out a single time. Everytime my portfolio is at An ATH the greed takes\nover and i want more and more and in the end IT all drops 50% and i wish i sold\nsome. Yet i make the same mistakes over and over again. For…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何年も前から暗号にどんどん資金を投入してきましたが、一度も現金化したことがありません。\n一度も現金化したことがありません。ポートフォリオが頂点に達するたびに欲が出てきて、もっともっと欲しくなります。\nもっともっとと欲が出てきて、最終的には全部で50%下がってしまい、少しでも売っておけばよかったと思います。\n売っておけばよかったと思います。しかし、私は何度も何度も同じ過ちを繰り返しています。それは...",
      "title": "なぜ利益を出すのは難しいのに、暗号にお金を入れるのはとても簡単なのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，我把越来越多的钱投入加密货币，但我还没有\n兑现过一次。每当我的投资组合处于ATH时，贪婪就会占据\n我想要更多更多的钱，最后，所有的钱都下降了50%，我希望我卖掉。\n一些。然而，我却一次又一次地犯同样的错误。对于...",
      "title": "为什么获利这么难，而把钱投入加密货币却如此该死的容易!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，我把越來越多的錢投入加密貨幣，但我還沒有\n兌現過一次。每當我的投資組合處於ATH時，貪婪就會佔據\n我想要更多更多的錢，最後，所有的錢都下降了50%，我希望我賣掉。\n一些。然而，我卻一次又一次地犯同樣的錯誤。對於...",
      "title": "爲什麼獲利這麼難，而把錢投入加密貨幣卻如此該死的容易!"
    }
  ]
}