{
  "author": "clodhopper88",
  "the_new_excerpt": "Was so excited to buy my 1 Ether at $400.\n\nTransferred my .95 Ether into my wallet and watched as the price soared.\nFigured, hey maybe it's a better idea to keep this into an exchange after all.\nNever know if I need to sell if the market takes a turn.\n\nTransferred my .90 Ether to Binance and watched…",
  "original_created_utc": 1614197873,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当时很兴奋，以400美元的价格买下了我的1个以太坊。\n\n把我的0.95美元的以太币转到钱包里，看着价格飞涨。\n心想，嘿嘿，也许还是留着这个成交易所比较好。\n永远不知道如果市场出现转折，我是否需要出售。\n\n把我的0.90以太币转到Binance，看着... ...",
      "title": "我和我的以太...."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當時很興奮，以400美元的價格買下了我的1個以太坊。\n\n把我的0.95美元的以太幣轉到錢包裏，看着價格飛漲。\n心想，嘿嘿，也許還是留着這個成交易所比較好。\n永遠不知道如果市場出現轉折，我是否需要出售。\n\n把我的0.90以太幣轉到Binance，看着... ...",
      "title": "我和我的以太...."
    }
  ],
  "title": "Me and my Ether....",
  "created_utc": 1614218721,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Was so excited to buy my <strong>1</strong> Ether at $400.</p>\n\n<p>Transferred my <strong>.95</strong> Ether into my wallet and watched as the price soared. Figured, hey maybe it&#39;s a better idea to keep this into an exchange after all. Never know if I need to sell if the market takes a turn. </p>\n\n<p>Transferred my <strong>.90</strong> Ether to Binance and watched as the money rolled in, and oh boy, We&#39;re in bull season! </p>\n\n<p>But then I&#39;m seeing posts about how everyone should keep their crypto off of exchanges! So I figured, eh why not just put it back in my wallet, it&#39;ll continue to grow. So I transferred all <strong>.80</strong> Ether back in...</p>\n\n<p>Now the market is starting to correct, and I&#39;m getting scared. Maybe if I put my Ether back on the exchange, I can get out with some sort of profit. Screw it, I send all <strong>.65</strong> Ether back to the exchange.....</p>\n\n<p>Okay that&#39;s enough, no touching.....</p>\n\n<p>But the price is still dropping.... okay, okay, no more looking at the market prices, it&#39;ll come back... it&#39;ll come back...</p>\n\n<p>Shit, Binance is having issues and showing 0 balances to anyone who has money on their exchange. Alright, I&#39;ll transfer my <strong>.50</strong> Ether to my wallet, and that&#39;s it.</p>\n\n<p><em>Hey, the price is starting to pick up again!</em></p>\n</div><!-- SC_ON -->",
  "score": 500,
  "permalink": "/r/CryptoCurrency/comments/lrmd7y/me_and_my_ether/",
  "subreddit": "CryptoCurrency",
  "id": "lrmd7y",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332880692
}