{
  "author": "Youtadrawsart",
  "the_new_excerpt": "When I asked what gender meant, on English-speaking social media, I was always\ntold it's how you feel, your aesthetic, mood, interests etc...''woman'', ''man''\netc, are sex, not gender, and gender is completely unrelated to sex.\n\nI came across genders like catgender, for people with a…",
  "original_created_utc": 1615052609,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当我在英语社交媒体上问到性别是什么意思时，我总是会被\n告诉你，这是你的感觉，你的审美观、心情、兴趣等等......''女人''，''男人''。\n等，是性，不是性别，性别与性完全无关。\n\n我遇到的性别，比如猫性别，对于人与...",
      "title": "我是日本人，英语不是我的母语。我一直被告知''性别''是指你的个性、兴趣和审美。那么，根据这个定义，是不是每个人都是变性人，因为每个人一生都有自己的性格和兴趣爱好在变化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在英語社交媒體上問到性別是什麼意思時，我總是會被\n告訴你，這是你的感覺，你的審美觀、心情、興趣等等......''女人''，''男人''。\n等，是性，不是性別，性別與性完全無關。\n\n我遇到的性別，比如貓性別，對於人與...",
      "title": "我是日本人，英語不是我的母語。我一直被告知''性別''是指你的個性、興趣和審美。那麼，根據這個定義，是不是每個人都是變性人，因爲每個人一生都有自己的性格和興趣愛好在變化？"
    }
  ],
  "title": "I'm Japanese and English is not my first language. I was always told that ''Gender'' means your personality, interests and aeshetic. So, under this definition, is everyone transgender, since everyone has their own personalities and interests that change throughout their lives?",
  "created_utc": 1615111167,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I asked what gender meant, on English-speaking social media, I was always told it&#39;s how you feel, your aesthetic, mood, interests etc...&#39;&#39;woman&#39;&#39;, &#39;&#39;man&#39;&#39; etc, are sex, not gender, and gender is completely unrelated to sex.</p>\n\n<p>I came across genders like catgender, for people with a strong association/interest with cats, and things like wiigender, for people who like the Nintendo Wii a lot. These were not satire; they were being completely serious.. here is an example of a gender called &#39;&#39;Amongusgender&#39;&#39; that gained a lot of popularity, for example ; <a href=\"https://twitter.com/wllburs00t_/status/1305668306616168448?lang=en\">https://twitter.com/wllburs00t_/status/1305668306616168448?lang=en</a></p>\n\n<p>so, in this case, wouldn&#39;t it mean everyone is transgender, because everyone&#39;s moods and interests change all the time?</p>\n\n<p>For example, I am an artist. If I am creating, would I not be &#39;&#39;creativitygender&#39;&#39;, or when I am angry, I am &#39;&#39;angrygender&#39;&#39;? &amp; late at night, I tend to get sleepy. Would that not make me &#39;&#39;sleepygender&#39;&#39;, for example?</p>\n\n<p>There are almost 8 billion people on the planet, all with their own feelings and interests. Thus, are there also at least 8 billion genders as no two people will have the exact same personality or sets of interests?</p>\n\n<p>Note, I am making a sharp distinction between being transgender and transsexual, which is neurological and not a choice (while personality and interests can be choices). A transsexual person changes their sex, but based on what I have read, &#39;&#39;transgender&#39;&#39; is synonymous for &#39;&#39;transmood&#39;&#39;, &#39;&#39;transemotion&#39;&#39;, or &#39;&#39;transinterest&#39;&#39; but everyone&#39;s moods and interests etc transform all the time. I&#39;m sure there are very, very few people who never have changing moods, emotions, or interests.</p>\n\n<p>In other words; being transgender is literally the most normal/common thing to exist in society, and it&#39;d be weird if it didn&#39;t?</p>\n\n<p>That&#39;s my interpretation anyway, Japanese is very different to English language..</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/askphilosophy/comments/lz6t11/im_japanese_and_english_is_not_my_first_language/",
  "subreddit": "askphilosophy",
  "id": "lz6t11",
  "is_self": true,
  "media": null,
  "is_video": false
}