{
  "author": "sinecosx",
  "original_created_utc": 1645145702,
  "title": "(Geology) The \"polar wander hypothesis\" was debunked, but isn't the phenomenon of a wandering pole an actual thing since we've observed that magnetic North moves?",
  "created_utc": 1645180850,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My textbook says&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As paleomagnetists sampled and measured older and older rocks, &lt;strong&gt;their results seemed to show that the north magnetic pole was far from the modern pole and appeared to wander through time&lt;/strong&gt;. This was called the “polar wander hypothesis” at first. But then they ran into a problem. Each continent had a completely different polar wander curve, which only converged on a common magnetic pole today. These data seemed to suggest that the magnetic field had behaved very strangely in the past, with multiple directions of magnetic north that no longer exist. As outrageous as that  idea seemed, the only alternative was just as radical: &lt;strong&gt;the continents had moved through time, so it was not the magnetic pole that was changing but the continents&lt;/strong&gt; &lt;strong&gt;that recorded their directions&lt;/strong&gt;. But when you lined up the polar wander curves for two different continents, like Europe and North America, you found that they matched once you moved  the continents back together as Wegener had suggested. &lt;strong&gt;In other words, the “polar wander curves” were only apparent polar wander curves because it was the continents that moved, not the magnetic poles.&lt;/strong&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What I&amp;#39;m confused about is my book saying, &amp;quot;the continents had moved through time, so it was &lt;em&gt;not the magnetic pole that was changing&lt;/em&gt;&amp;quot; because isn&amp;#39;t that not completely true since magnetic North DOES move? We&amp;#39;ve observed this movement, so isn&amp;#39;t my book completely dismissing the idea of a &amp;quot;wandering pole&amp;quot; incorrect?&lt;/p&gt;\n\n&lt;p&gt;Everything I&amp;#39;ve watched and read online only talks about the effect of continental drift on the apparent wander curves, but they haven&amp;#39;t talked about how the magnetic North pole does, in fact, move. Can&amp;#39;t the movement of the magnetic North pole have had at least a &lt;em&gt;tiny&lt;/em&gt; influence on the polar wandering curves?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/sv4i7e/geology_the_polar_wander_hypothesis_was_debunked/",
  "subreddit": "askscience",
  "id": "sv4i7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "My textbook says\n\n> As paleomagnetists sampled and measured older and older rocks, their results\n> seemed to show that the north magnetic pole was far from the modern pole and\n> appeared to wander through time. This was called the “polar wander hypothesis”\n> at first. But then they ran into a…"
}