{
  "author": "BrownTransGirl",
  "original_created_utc": 1635039338,
  "title": "Look, regardless of how much you hate it, hype/momentum investing in things like Doge or Shib are actually smart moves for maximizing your profits. A REAL unpopular opinion...",
  "created_utc": 1635061032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought into Shib at .00002500 because EVERYONE was talking shit about how the Shib subreddit was dumb for believing it would get to $0.01. And you know what? Those people were right. It is not a likely possibility based purely on how price works with crypto. </p>\n\n<p>That being said, investing in that BELIEF? In the fact that everyone and their grandma would be investing in this coin as soon as BTC hit an ATH? That&#39;s called taking the temperature of the market and capitalizing on it. </p>\n\n<p>If you&#39;re not willing to short term invest in memes, then you are missing out on understanding how to profit off of a zeitgeist. </p>\n\n<p>TL;DR: </p>\n\n<p>Meme investing is something you could stop getting mad about, and start making profits off of with your funds that you&#39;re willing to take big risks with.  </p>\n\n<p>If you&#39;re not willing to take risks, then why tf are you in crypto? How did you decide to buy any? Wow?</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/qei8sq/look_regardless_of_how_much_you_hate_it/",
  "subreddit": "CryptoCurrency",
  "id": "qei8sq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I bought into Shib at .00002500 because EVERYONE was talking shit about how the\nShib subreddit was dumb for believing it would get to $0.01. And you know what?\nThose people were right. It is not a likely possibility based purely on how\nprice works with crypto.\n\nThat being said, investing in that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はShibを0.00002500で購入しました。\nShibのサブレディットが0.01ドルになると信じていたのが馬鹿だったからです。そして、あなたは何を知っていますか？\nその人たちは正しかったのです。純粋に価格がどのように作用するかに基づいて、それは可能性のないものです。\n可能性は低いです。\n\nとはいえ、それに投資するのは...",
      "title": "あなたがどれほど嫌っていようと、DogeやShibのようなハイプ/モメンタム投資は、実際には利益を最大化するための賢い動きなのです。本当に不人気な意見ですが...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在0.00002500买入Shib，因为每个人都在胡说八道。\n我在0.00002500时买进了Shib，因为大家都在谈论Shib是如何相信它能达到0.01美元的，是个蠢货。而你知道吗？\n那些人是对的。这不是一个可能的可能性，纯粹是基于\n价格与加密货币的运作方式。\n\n话虽如此，投资于该...",
      "title": "听着，不管你有多讨厌它，对Doge或Shib这样的东西进行炒作/势头投资实际上是使你的利润最大化的明智之举。一个真正的不受欢迎的观点..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在0.00002500買入Shib，因爲每個人都在胡說八道。\n我在0.00002500時買進了Shib，因爲大家都在談論Shib是如何相信它能達到0.01美元的，是個蠢貨。而你知道嗎？\n那些人是對的。這不是一個可能的可能性，純粹是基於\n價格與加密貨幣的運作方式。\n\n話雖如此，投資於該...",
      "title": "聽着，不管你有多討厭它，對Doge或Shib這樣的東西進行炒作/勢頭投資實際上是使你的利潤最大化的明智之舉。一個真正的不受歡迎的觀點..."
    }
  ]
}