{
  "author": "Kingmaker251",
  "the_new_excerpt": "TLDR: EV in the next 10 years is going to become the biggest industry in the\nworld, not because of it's green energy but because of automation. They're going\nto lead to the largest mass unemployment rise as they make drivers unnecessary\n\nI'd love people's opinions about my take on the future of EV…",
  "original_created_utc": 1614052777,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TLDR：电动车在未来10年将成为全球最大的产业。\n不是因为它的绿色能源而是因为自动化。他们将\n导致最大规模的失业率上升，因为他们使司机没有必要。\n\n我想听听大家对我对电动车未来的看法......",
      "title": "为什么电动汽车不是我们想象中的泡沫？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TLDR：電動車在未來10年將成爲全球最大的產業。\n不是因爲它的綠色能源而是因爲自動化。他們將\n導致最大規模的失業率上升，因爲他們使司機沒有必要。\n\n我想聽聽大家對我對電動車未來的看法......",
      "title": "爲什麼電動汽車不是我們想象中的泡沫？"
    }
  ],
  "title": "Why EV isn't the bubble we think it is",
  "created_utc": 1614064221,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TLDR: EV in the next 10 years is going to become the biggest industry in the world, not because of it&#39;s green energy but because of automation. They&#39;re going to lead to the largest mass unemployment rise as they make drivers unnecessary</p>\n\n<p>I&#39;d love people&#39;s opinions about my take on the future of EV and whether I&#39;m off base or too optimistic</p>\n\n<p>Disclaimer: In NIO for 140 shares @ $22</p>\n\n<p>My main argument: EV companies are currently amazon in their bookshop phase</p>\n\n<p>I would argue that the valuations of both TSLA, NIO and other large EV companies is seriously undervalued - I&#39;m not basing this on the number of cars they manufacture nor the effectiveness of their electric battery potential but on the billions they&#39;re investing in the development of full self driving automation.</p>\n\n<p>In the next 10 years, we are likely to see full automation especially with the advent of quantum computing leading to a huge increase in computational power (<a href=\"https://www.sciencemag.org/news/2020/09/ibm-promises-1000-qubit-quantum-computer-milestone-2023\">https://www.sciencemag.org/news/2020/09/ibm-promises-1000-qubit-quantum-computer-milestone-2023</a>) - The companies that are heavily investing in developing this technology aren&#39;t the classic car manufactures such as GM, Chevrolet or Chrysler but instead the large EV companies that have grown exponentially in the past year. Like many people I&#39;m viewing companies like NIO or TSLA as tech companies and not car manufacturers. They&#39;re main value is in the code they develop for automation.</p>\n\n<p>Once full autonomous driving becomes realistic, these companies can lease their code as a service and basically replace the need for any job which requires drivers i.e. delivery drivers, truck drivers, taxi drivers.</p>\n\n<p>The main example I&#39;ve been using for this is Domino&#39;s Pizza in the UK - They have about 1126 stores in the UK, let&#39;s say they conservatively they hire 5 delivery drivers per store and those drivers on average work about 5 days a week and a total of 6 hours per day (the three hours around lunch and three around dinner) - Let&#39;s also assume they only get paid minimum wage - This comes out to a total expenditure of about £80mill per year ($110 mill) for dominoes just based on paying their drivers wages, not countering in fuel or other expenditures that they do also cover - And that&#39;s only one company in the UK.</p>\n\n<p>If automation occurs, which again these companies are investing heavily in and the underlying infrastructure and technology is beginning to reach basic requirements, these EV companies can create a code as service model along with the profit from actually selling the car and basically make drivers redundant</p>\n\n<p>My argument is that basically at the moment these EV companies are amazon in their bookshop phase, people are betting that they&#39;ll sell lots of books (cars in this case because they&#39;re clean energy) and I think they&#39;re going to end up becoming juggernauts that basically take over our daily lives to the same extent amazon now does</p>\n\n<p>Obvs I might be wrong and in fact I&#39;d love to hear some bearish arguments - I&#39;m not saying we&#39;re not in a bubble but I think these companies in 10 years time will be steals at their current prices</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/investing/comments/lq8liw/why_ev_isnt_the_bubble_we_think_it_is/",
  "subreddit": "investing",
  "id": "lq8liw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883517
}