{
  "author": "PennilessPirate",
  "the_new_excerpt": "I understand that since Annovera lasts for a full year (compared to Nuvaring\nthat only lasts a month) it would have more restrictions, but 2 hours vs 48\nhours is a very drastic difference.\n\nAnnovera does release slightly less estrogen than Nuvaring (13mcg vs 15mcg), but\nit also releases more…",
  "original_created_utc": 1618808394,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アノベラは1年持続するので（ヌバリングは1年しか持続しないのに対し）、私は理解しています。\n1ヶ月しか持たないヌバリングと比べて）より多くの制限があることは理解できますが、2時間と48時間の\n2時間と48時間では、非常に劇的な違いです。\n\nアノベラはヌバリングよりもわずかに少ないエストロゲンを放出します（13mcg対15mcg）。\nそれはまた、より多くのリリース...",
      "title": "避妊具「ヌバリング」は月に48時間まで外しても効果が落ちないのに、「アノベラ」は月に2時間までしか外せないのは、同じホルモンを分泌する膣リングであるにもかかわらず、なぜでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，由于Annovera持续了一整年（与Nuvaring相比）。\n只持续一个月）会有更多的限制，但2小时与48\n小时是一个非常巨大的差异。\n\nAnnovera释放的雌激素确实比Nuvaring略少（13mcg vs 15mcg），但。\n它还会释放更多...",
      "title": "为什么避孕药 \"纽瓦林 \"可以48小时/月取出而药效不减，而 \"安诺华 \"却只能2小时/月取出，尽管它们都是释放相同激素的阴道环？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，由於Annovera持續了一整年（與Nuvaring相比）。\n只持續一個月）會有更多的限制，但2小時與48\n小時是一個非常巨大的差異。\n\nAnnovera釋放的雌激素確實比Nuvaring略少（13mcg vs 15mcg），但。\n它還會釋放更多...",
      "title": "爲什麼避孕藥 \"紐瓦林 \"可以48小時/月取出而藥效不減，而 \"安諾華 \"卻只能2小時/月取出，儘管它們都是釋放相同激素的陰道環？"
    }
  ],
  "title": "Why can the birth control “Nuvaring” be removed for up to 48 hours/month without decreasing efficacy, but “Annovera” can only be removed for 2 hours/month, even though they are both vaginal rings releasing the same hormones?",
  "created_utc": 1618814054,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that since Annovera lasts for a full year (compared to Nuvaring that only lasts a month) it would have more restrictions, but 2 hours vs 48 hours is a very drastic difference. </p>\n\n<p>Annovera does release slightly less estrogen than Nuvaring (13mcg vs 15mcg), but it also releases more progestin (150mcg vs 120mcg), so I don’t feel like those slight variances would make that much of a difference. </p>\n\n<p>Is Annovera just being overly conservative with the adherence guidelines since it’s new? Or is there really that much of a difference between the two of them, and if so, why?</p>\n</div><!-- SC_ON -->",
  "score": 273,
  "permalink": "/r/askscience/comments/mtth7y/why_can_the_birth_control_nuvaring_be_removed_for/",
  "subreddit": "askscience",
  "id": "mtth7y",
  "is_self": true,
  "media": null,
  "is_video": false
}