{
  "author": "PartTimeAnalyst",
  "original_created_utc": 1636430701,
  "title": "If you invested 4 months back in Bitcoin you will be up 100% today",
  "created_utc": 1636454665,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A gentle reminder that you should always buy the dip regardless of how much FUD there are in the market. It is the time where the market is fearful that you should be buying every single dip that you have.</p>\n\n<p>Personally, I’m glad I bought a tiny bag of bitcoin at $45k. And currently up a decent percentage. I believe many of you have bought the dip as well.</p>\n\n<p>I think it is important that we should load up more when it’s dipping compared to when it is rising. However, due to human psychology, we only buy when it’s going up. Hence that it why everyone always buy at the top.</p>\n\n<p>But congrats to those that managed to bought bitcoin at even $28k. And now it has rose to 2x of your money.</p>\n\n<p>TLDR;\nBuy and dollar cost average; if it dips, buy more. Your future self will thank you</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/qpvcl9/if_you_invested_4_months_back_in_bitcoin_you_will/",
  "subreddit": "CryptoCurrency",
  "id": "qpvcl9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A gentle reminder that you should always buy the dip regardless of how much FUD\nthere are in the market. It is the time where the market is fearful that you\nshould be buying every single dip that you have.\n\nPersonally, I’m glad I bought a tiny bag of bitcoin at $45k. And currently up a\ndecent…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "どんなにFUDが多い市場であっても、常にディップを買うべきだということを優しく教えてくれます。\n市場にどれほどの不安があろうとも、常にディップを買うべきだということを 市場が恐怖を感じている時こそ\n市場が恐れている時こそ、あらゆるディップを買うべきです。\n\n個人的には、ビットコインの小さな袋を45kドルで買っておいてよかったと思っています。そして現在の上昇率は\nまともな...",
      "title": "4ヶ月前にビットコインに投資していれば、今日は100％上昇しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "温馨提醒：无论市场上有多少疑虑，你都应该买入跌停板。\n市场上有多少疑虑。现在是市场恐惧的时候，你应该买入每一次下跌。\n你应该买入每一次的跌停板。\n\n就我个人而言，我很高兴我在4.5万美元时买了一小袋比特币。而且目前涨了一\n体面的...",
      "title": "如果你在4个月前投资于比特币，你今天将上涨100%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "溫馨提醒：無論市場上有多少疑慮，你都應該買入跌停板。\n市場上有多少疑慮。現在是市場恐懼的時候，你應該買入每一次下跌。\n你應該買入每一次的跌停板。\n\n就我個人而言，我很高興我在4.5萬美元時買了一小袋比特幣。而且目前漲了一\n體面的...",
      "title": "如果你在4個月前投資於比特幣，你今天將上漲100%。"
    }
  ]
}