{
  "author": "ElectHarambe",
  "original_created_utc": 1644264629,
  "title": "How many people out there pee in the shower?",
  "created_utc": 1644272616,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Peeing in the shower seems to be a bit taboo. There is a variety of reactions from people when it’s discussed. When I’m showering and I have to pee, I do so. I also clean and disinfect my shower pretty regularly. I am just wanting to get others perspective on this subject and see how many shower pee-ers are out there!&lt;/p&gt;\n\n&lt;p&gt;Edit(s) for clarification:\n-I don’t pee in other peoples showers, but interpret the question how ever you wish.\n-I mean being in the shower while showering. Again, interpret the question as you wish.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 237,
  "permalink": "/r/TooAfraidToAsk/comments/smzkj2/how_many_people_out_there_pee_in_the_shower/",
  "subreddit": "TooAfraidToAsk",
  "id": "smzkj2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Peeing in the shower seems to be a bit taboo. There is a variety of reactions\nfrom people when it’s discussed. When I’m showering and I have to pee, I do so.\nI also clean and disinfect my shower pretty regularly. I am just wanting to get\nothers perspective on this subject and see how many shower…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "シャワーでおしっこをするのは、ちょっとタブーなようです。様々な反応があります\nという話になったとき、人々は 私はシャワーを浴びていて、おしっこがしたくなったら、そうしています。\nシャワーの掃除や消毒もかなり定期的にしています。ただ、私は\nこのテーマについて、他の人の視点や、どれくらいの人がシャワーを...",
      "title": "シャワーでおしっこをする人は、世の中にどれくらいいるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在洗澡时撒尿似乎有点禁忌。当人们讨论这个问题时，会有各种不同的反应\n人们在讨论这个问题时有各种反应。当我在洗澡的时候，如果我必须要尿尿，我就会这样做。\n我也很经常地清洁和消毒我的浴室。我只是想了解\n别人对这个问题的看法，看看有多少人在淋浴时...",
      "title": "外面有多少人在淋浴时撒尿？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在洗澡時撒尿似乎有點禁忌。當人們討論這個問題時，會有各種不同的反應\n人們在討論這個問題時有各種反應。當我在洗澡的時候，如果我必須要尿尿，我就會這樣做。\n我也很經常地清潔和消毒我的浴室。我只是想了解\n別人對這個問題的看法，看看有多少人在淋浴時...",
      "title": "外面有多少人在淋浴時撒尿？"
    }
  ]
}