{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Wednesday, April 21, 2021\n\nStocks reversed on Monday, rising on Wednesday for the first day in three\nsessions, with small-caps leading the way after a terrible run of performance in\nApril. Despite Netflix (NFLX) sharply missing earnings expectations in terms of\nnew paid…",
  "original_created_utc": 1619037870,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイコ・マーケット・リカップ - 2021年4月21日（水\n\n株価は月曜日に反転し、水曜日には3日ぶりに上昇した。\n4月にひどい成績を残した小型株がリードしている。\n4月の ネットフリックス(NFLX)は業績予想を大幅に下回ったにもかかわらず\n新規有料会員数が...",
      "title": "本日2021年4月21日（水）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年4月21日，星期三\n\n股市在周一出现逆转，周三在三个交易日中首次上涨。\n涨，小盘股在经历了4月份的糟糕表现之后，在这一过程中处于领先地位。\n4月份。尽管Netflix(NFLX)的盈利大幅低于预期，在\n新的付费...",
      "title": "以下是今天（2021年4月21日，星期三）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年4月21日，星期三\n\n股市在週一出現逆轉，週三在三個交易日中首次上漲。\n漲，小盤股在經歷了4月份的糟糕表現之後，在這一過程中處於領先地位。\n4月份。儘管Netflix(NFLX)的盈利大幅低於預期，在\n新的付費...",
      "title": "以下是今天（2021年4月21日，星期三）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Wednesday, April 21, 2021",
  "created_utc": 1619069578,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Wednesday, April 21, 2021</strong></p>\n\n<p>Stocks reversed on Monday, rising on Wednesday for the first day in three sessions, with small-caps leading the way after a terrible run of performance in April. Despite Netflix (NFLX) sharply missing earnings expectations in terms of new paid subscribers, the tech-heavy Nasdaq (QQQ), while the Dow Jones (DIA) and S&amp;P 500 (SPY) remain near record levels. </p>\n\n<p>After a recent spike this week, the CBOE Volatility Index sank back to near 52-week lows, a sign that investor risk appetite is increasing. The VIX is known as the &quot;investor fear gauge,&quot; because it reflects investors&#39; best predictions of near-term market volatility or risk. In general, the VIX rises during times of financial stress and falls during good economic times. David Kostin, chief US equity strategist at Goldman Sachs said, “The S&amp;P 500 has reached new highs while volatility has sharply declined. Low volatility has outweighed low correlations among stocks, driving return dispersion back below the long-term average. As the U.S. moves beyond key macro events such as the 2020 election, the $1.9 trillion fiscal stimulus package, and peak economic activity, we expect three defining themes for markets will be tax reform, infrastructure, and pricing power.”</p>\n\n<p>While Netflix (NFLX) sharply missed estimates, this earnings season has largely blown consensus estimates out of the water, with more than 81% of companies that have reported so far beating earnings expectations, according to a study by FactSet. However, despite the largely positive earnings, many stocks (apart from today) have failed to react positively to the news. It seems as more positive economic data is released in terms of consumer spending and unemployment, it takes more and more impressive results to convince investors to pile into the stock. This suggests there is froth in the markets given the sky-high valuation of some companies. </p>\n\n<p>White House chief medical advisor Dr. Anthony Fauci said he believes the U.S. will likely resume use of the Johnson &amp; Johnson Covid-19 vaccine as soon as Friday with a warning or restriction attached. The doctor said, “My estimate is that we will continue to use it in some form. I doubt very seriously if they just cancel it. I don’t think that’s going to happen. I do think that there will likely be some sort of warning or restriction or risk assessment. I don’t think it’s just going to go back and say, ‘Okay, everything’s fine. Go right back.’ I think it’ll likely say, ‘Okay, we’re going to use it, but be careful under these certain circumstances.”</p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The White House announced more than 200 million doses of the coronavirus vaccine have been distributed in the US, greatly surpassing original estimates of 100 million doses delivered in the first 100 days of Biden’s presidency. On the back of this robust distribution, all states are beginning to open back up.</li>\n<li>Mortgage applications jumped 8.6% in the week ended April 16, marking the biggest jump since late January as mortgage rates pulled back following a surge, according to the Mortgage Bankers Association (MBA). </li>\n<li>Ford Motor (F) is planning more downtime at five North American factories due to a global semiconductor shortage. </li>\n<li>During yesterday’s virtual event, Apple (AAPL) announced a new slate of products set to include the companies own chip. The offering includes a new iMac, a new iPad, and a new tracking-device called Airtags.</li>\n<li>Gisele Bündchen, supermodel and Tom Brady’s wife was announced as a special advisor for the CEO and board of directors in DraftKings. This is just the latest in a series of high-profile moves by DraftKings to establish itself as the premier sport-betting company. </li>\n<li>After gapping up after earnings, Intuitive Surgical (ISRG) joined the ranks of healthcare companies worth $100 billion or more</li>\n<li>After a series of high profile accidents including small children, the US Consumer Product Safety Commission advised consumer to not buy the treadmill if there are small kids or pets at home.This could affect the company&#39;s product-safety profile, a material category for the household and personal-goods sector. In response, Peloton (PTON) called the statements “inaccurate and misleading” and refused calls to recall their treadmill. The stock has been in freefall this week. </li>\n<li>**<strong>Please note that current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Abbott Labs (ABT) target raised by Morgan Stanley (MS) from $136 to $140 at Overweight. Stock currently around $120</li>\n<li>Allegiant Travel (ALGT) target raised by Barclaays from $237 to $300 at Overweight. Stock currently around $231</li>\n<li>Burlington Stores (BURL) target raised by Loop Capital from $325 to $365 at Buy. Stock currently around $319</li>\n<li>Dell Technologies (DELL) with a host of target raises. Consensus price target $115 at Overweight. Stock currently around $101</li>\n<li>Equinix (EQIX) target raised by Mizuho from $750 to $800 at Buy. Stock currently around $726</li>\n<li>Facebook (FB) target raised by Cowen from $350 to $360 at Outperform. Stock currently around $303</li>\n<li>Forward Air (FWRD) target raised by Raymond James from $95 to $100 at Outperform. Stock currently around $87 </li>\n<li>Alphabet (GOOG,GOOGL) target raised by Cowen from $2400 to $2600 at Outperform. Stock currently around $2293</li>\n<li>Goldman Sachs (GS) with a host of target raises. Consensus price target $410 at Outperform. Stock currently around $332</li>\n<li>Jazz Pharma (JAZZ) target raised by Cantor Fitzgerald from $185 to $198 at Overweight. Stock currently around $168</li>\n<li>JP Morgan (JPM) with three target raises. Stock currently around $150 \n\n<ul>\n<li>DA Davidson from $179 to $182 at Buy</li>\n<li>Royal Bank of Canada from $150 to $160 </li>\n<li>Piper Sandler from $170 to $180</li>\n</ul></li>\n<li>Lam Research (LRCX) target raised by Argus from $625 to $725 at Buy. Stock currently around $613</li>\n<li>NXP Semiconductors (NXPI) target raised by Wells Fargo (WFC) from $193 to $235 at Overweight. Stock currently around $194</li>\n<li>Penn National Gaming (PENN) target raised by Goldman Sachs (GS) from $153 to $158 at Buy. Stock currently around $89</li>\n<li>Royal Caribbean (RCL) target raised by Goldman Sachs (GS) from $76 to $95 at Neutral</li>\n<li>Snap (SNAP) target raised by Cowen from $86 to $88 at Outperform. Stock currently around $58</li>\n<li>UPS with two target raises. Stock currently around $180\n\n<ul>\n<li>Citigroup (C) from $190 to $200 at Neutral</li>\n<li>Raymond James from $195 to $200 at Strong-Buy</li>\n</ul></li>\n</ul>\n\n<p>“In my view, the biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital. Not only is the mere drop in stock prices, not risk, but it is an opportunity.” - Li Lu</p>\n</div><!-- SC_ON -->",
  "score": 57,
  "permalink": "/r/stocks/comments/mvozqy/here_is_a_market_recap_for_today_wednesday_april/",
  "subreddit": "stocks",
  "id": "mvozqy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171527444
}