{
  "author": "SweetPie123",
  "the_new_excerpt": "TL;DR: a story about the last altseason where lots of money could've been made\nbut it ended up in a fiasco. Also discussing the mental toll it takes seeing\nprices plummet and how to avoid that.\n\nAltseason booming.\n\nit's 2018, altseason at full throttle and gains are piling up higher than the\nMount…",
  "original_created_utc": 1613139284,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "TL;DR：一个关于上一个altseason的故事，在那里可以赚很多钱。\n但最后却惨败而归。还讨论了看到的精神损失\n价格暴跌，如何避免。\n\nAltseason蓬勃发展。\n\n现在是2018年，altseason全力以赴，收益堆积得比高。\n山...",
      "title": "获利没有错，该讲讲小故事了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "TL;DR：一個關於上一個altseason的故事，在那裏可以賺很多錢。\n但最後卻慘敗而歸。還討論了看到的精神損失\n價格暴跌，如何避免。\n\nAltseason蓬勃發展。\n\n現在是2018年，altseason全力以赴，收益堆積得比高。\n山...",
      "title": "獲利沒有錯，該講講小故事了。"
    }
  ],
  "title": "There's nothing wrong with taking profits, time for a little story.",
  "created_utc": 1613158238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>TL;DR: a story about the last altseason where lots of money could&#39;ve been made but it ended up in a fiasco. Also discussing the mental toll it takes seeing prices plummet and how to avoid that.</p>\n\n<p><strong>Altseason booming.</strong></p>\n\n<p>it&#39;s 2018, altseason at full throttle and gains are piling up higher than the Mount Everest. I&#39;m watching charts day and night, watching the money pour in. Looking all across the internet to find the next big coin, buying ICO&#39;s that consist out of nothing but a 3 page whitepaper. Next day I would wake up seeing that ICO double overnight, consumed by greed I of course held on to it. Shillers popping up everywhere trying to convince each other Dentacoin, Waltonchain, Verge and whatever shitcoin got released that day were the next big thing in crypto.</p>\n\n<p><strong>The downfall.</strong></p>\n\n<p>This went on for a few weeks or months (can&#39;t remember that period so well because I was celebrating every night), but just like they say nothing good ever lasts. ICO after ICO just disappeared with the funds or couldn&#39;t come up with a working project, most of them never even got released. Of course I never sold anything, I was high on hopium and all the bullish comments here and on other fora fed my bullish bias like a junky craving for the next hit (green candle in this case). Seeing 30% of my investments plummet to zero and others pulling back 85-95% wrecked me mentally even though I didn&#39;t really need that money at the time. Continuous thoughts about &#39;what if I just sold, I could&#39;ve lived my life without ever working again&#39; made me quit the crypto for a long time, just holding on to the major coins in the hope they ever recovered.</p>\n\n<p><strong>Take some profits.</strong></p>\n\n<p>Crypto is a very volatile market that can mentally completely consume you by watching charts and looking for the next &#39;Ethereum/Bitcoin killer&quot;. There&#39;s this saying &#39;Time in the market beats timing the market&quot; which is definitely true, but it comes at a cost lots of you guys haven&#39;t experienced yet, peace of mind. If you&#39;re up 5x or 10x on your initial investment there&#39;s nothing wrong with pulling out at least your initial investment, even if it&#39;s just for the feeling you&#39;re playing &#39;for free&#39; and have nothing to lose. Try to remain realistic and skeptical, critical-thinking isn&#39;t appreciated in a bullmarket because you&#39;re going against the common sentiment. Look past the bullish comments and don&#39;t be scared to pull out some money just because you&#39;re reading exaggerated bullish predictions everywhere. All these people who make continuous bullish predictions just do that out of their own interest, which I must admit I&#39;m guilty of too.</p>\n\n<p>Wish you guys all the best, may the gains be with you.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/libu7g/theres_nothing_wrong_with_taking_profits_time_for/",
  "subreddit": "CryptoCurrency",
  "id": "libu7g",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728615776
}