{
  "author": "iHainoon",
  "original_created_utc": 1626882483,
  "title": "Why dont we finally just tax the rich so we can finally be able to build up a better world?",
  "created_utc": 1626909806,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I am not talking about direct politics, I am talking about the whole world, we live in a society where people in the world have more money than whole countries and states.</p>\n\n<p>One would manage to make whole societies finally capable of action and viable to go to work, etc..</p>\n\n<p>I can not understand that it is possible that people own so much money although it is clear that it can not simply be spent by its owners.</p>\n\n<p>As well as that a life worth living is also with much less money to live.</p>\n\n<p>&#x200B;</p>\n\n<p>Therefore I ask myself for a long time why there is still no solution.</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/ooslvu/why_dont_we_finally_just_tax_the_rich_so_we_can/",
  "subreddit": "TooAfraidToAsk",
  "id": "ooslvu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I am not talking about direct politics, I am talking about the whole world, we\nlive in a society where people in the world have more money than whole countries\nand states.\n\nOne would manage to make whole societies finally capable of action and viable to\ngo to work, etc..\n\nI can not understand that…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私が言っているのは直接的な政治の話ではなく、世界全体の話です。\n世界の人々が国や州よりも多くのお金を持っている社会に住んでいます。\n世界の人々が国や国家全体よりも多くのお金を持っている社会です。\n\n一つは、社会全体を最終的に行動可能な状態にし、仕事に行くことができるようにすることです。\n仕事に行くことができるようになります。\n\n私にはそれが理解できません...。",
      "title": "最終的には、金持ちに税金をかけて、より良い世界を築くことができるようにしてはどうでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的不是直接的政治，我说的是整个世界。\n我们生活在这样一个社会，世界上的人拥有的钱比整个国家的钱还要多\n和国家。\n\n人们将设法使整个社会最终有能力采取行动，并有能力工作。\n去工作，等等。\n\n我无法理解...",
      "title": "为什么我们最终不对富人征税，以便我们最终能够建立一个更好的世界？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的不是直接的政治，我說的是整個世界。\n我們生活在這樣一個社會，世界上的人擁有的錢比整個國家的錢還要多\n和國家。\n\n人們將設法使整個社會最終有能力採取行動，並有能力工作。\n去工作，等等。\n\n我無法理解...",
      "title": "爲什麼我們最終不對富人徵稅，以便我們最終能夠建立一個更好的世界？"
    }
  ]
}