{
  "author": "burgerissues",
  "original_created_utc": 1636614573,
  "title": "Getting rich quick with crypto is harder than you think it is",
  "created_utc": 1636659453,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So let&#39;s say you found a small market cap gem and there is no way this project won&#39;t make x100 . So you put $10k and you will end up with $1M in a year or two. Easy.</p>\n\n<p>Unless you&#39;re coming from money, $10k is a large sum, and putting it on a high risk asset will make you uneasy. </p>\n\n<p>You have basically overinvested in a project and a lot of things could go wrong along the way. You&#39;re sure it will x100 but you don&#39;t have a crystal ball either.</p>\n\n<p>The fact that you have put a sum of money you&#39;re not comfortable to lose will most likely make you panic sell during market fluctuations. It&#39;s easy to say don&#39;t panic sell, but not so easy to do when something you can&#39;t lose is on the line. Since small cap projects have less liquidity they will fluctuate even harder than the market. You will have mini heart attacks each time, you&#39;ll start checking your phone in the middle of the night or first thing in the morning and there is a good chance you will panic sell in one of those moments. Plus you don&#39;t need much reason for volatility here, crypto exchanges doesn&#39;t have most of the market regulations and whales will fluctuate the market even harder to shake those paper hands.</p>\n\n<p>One solution is not to overinvest, but then you need to find x1000 coin to make a $1M. It will make things harder and when things are going well greed will kick in and most likely you will put that extra money.</p>\n\n<p>Or you should cash out your initial investment once you reach x2 and play with the house money. But again, when things are great, there is a good chance greed will kick in and you will end up reinvesting this sum and we&#39;re back to step 1.</p>\n\n<p>Crypto is a great investment tool and will make you much better profits than other assets in the long term, but if you are here to chase pumps, you may end up overstressed and burn out quickly.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/qrfj94/getting_rich_quick_with_crypto_is_harder_than_you/",
  "subreddit": "CryptoCurrency",
  "id": "qrfj94",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So let's say you found a small market cap gem and there is no way this project\nwon't make x100 . So you put $10k and you will end up with $1M in a year or two.\nEasy.\n\nUnless you're coming from money, $10k is a large sum, and putting it on a high\nrisk asset will make you uneasy.\n\nYou have basically…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、時価総額の小さい宝石を見つけたとして、このプロジェクトがx100の利益を上げられないはずがないとします。\nが100倍にならないわけがない。そこで1万ドルを投入すると、1～2年後には100万ドルになる。\n簡単ですね。\n\n金持ちでない限り、1万ドルは大金で、それをリスクの高い資産に投じるのは不安です。\nリスクの高い資産に投資するのは不安ですよね。\n\nあなたは基本的に...",
      "title": "暗号で一攫千金を狙うのは思った以上に難しい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，假设你发现了一个小市值的创业板，而且这个项目不可能赚到x100。\n不可能赚到x100。所以你投入1万美元，在一两年内你就会有100万美元。\n很简单。\n\n除非你是有钱人，否则1万美元是个大数目，把它放在一个高风险的\n高风险的资产会让你感到不安。\n\n你基本上有...",
      "title": "利用加密货币快速致富比你想象的更难"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，假設你發現了一個小市值的創業板，而且這個項目不可能賺到x100。\n不可能賺到x100。所以你投入1萬美元，在一兩年內你就會有100萬美元。\n很簡單。\n\n除非你是有錢人，否則1萬美元是個大數目，把它放在一個高風險的\n高風險的資產會讓你感到不安。\n\n你基本上有...",
      "title": "利用加密貨幣快速致富比你想象的更難"
    }
  ]
}