{
  "author": "SuperBoner6699",
  "original_created_utc": 1634250322,
  "title": "Stop posting how much crypto you own",
  "created_utc": 1634269320,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I know the thrill when you make some big gains after holding something forever and that itch to proudly share it with the world, but just don&#39;t. Especially if you are new to reddit, or you jumped to crypto only recently.</p>\n\n<p>Just because somebody isn’t positing their crypto holdings, doesn’t mean they don’t know what they’re talking about. You don&#39;t need to prove anything to anyone here, be wise and keep if for yourself.</p>\n\n<p>You never know who the person you’re speaking to is and what stake they have or the knowledge and experience they may hold. They might as well be the scammer or hacker, and sharing any information could cost you loosing your investment, which is more often than not MORE than you could afford to lose even dough you see people advising against it every day on this sub.</p>\n\n<p>So with that said, if you’re new here, let’s try to stay true to what this sub  was made for - to discuss crypto currency. If you need visual confirmation of people’s holdings and want to talk shit, wallstreetbets is only a click away. This isn’t the place though</p>\n\n<p>Edit: i forgot to mention maybe the most crucial reason not to share it. YOUR OWN PERSONAL SAFETY. Few days ago someone posted a story how some guy got kidnapped and left to die in the forest after abductors made him unlock his binance and transfer all his holdings to them. You never know who is reading and all it takes is just one wrong person to identify you. Stay smart and stay safe.</p>\n</div><!-- SC_ON -->",
  "score": 164,
  "permalink": "/r/CryptoCurrency/comments/q8a4ws/stop_posting_how_much_crypto_you_own/",
  "subreddit": "CryptoCurrency",
  "id": "q8a4ws",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I know the thrill when you make some big gains after holding something forever\nand that itch to proudly share it with the world, but just don't. Especially if\nyou are new to reddit, or you jumped to crypto only recently.\n\nJust because somebody isn’t positing their crypto holdings, doesn’t mean…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ずっと持っていたものが大きくなったときのワクワク感や\n誇りを持って世界に発信したいという気持ちはわかりますが、それはできません。特にあなたが\n特に、redditに初めて参加する人や、最近になってcryptoに参入した人は要注意です。\n\n誰かが保有している暗号を公開していないからといって、...",
      "title": "所有する暗号の量を投稿するのをやめる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道当你在永远持有某样东西后取得一些大的收益时的兴奋感\n和那种自豪地与世界分享它的瘙痒，但就是不知道。特别是如果\n你是reddit的新成员，或者你最近才跳到加密货币。\n\n仅仅因为有人没有展示他们持有的加密货币，并不意味着...",
      "title": "不要再发布你拥有多少加密货币了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道當你在永遠持有某樣東西后取得一些大的收益時的興奮感\n和那種自豪地與世界分享它的瘙癢，但就是不知道。特別是如果\n你是reddit的新成員，或者你最近才跳到加密貨幣。\n\n僅僅因爲有人沒有展示他們持有的加密貨幣，並不意味着...",
      "title": "不要再發布你擁有多少加密貨幣了"
    }
  ]
}