{
  "author": "bekele024",
  "original_created_utc": 1655500642,
  "title": "We need more regulation - this is nuts",
  "created_utc": 1655537439,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Celsius still hasn&amp;#39;t opened withdrawals, Babel froze withdrawals and stopped paying interest yeilds, finblox capped withdrawals and stopped paying interest yeilds, BlockFi sold three arrows capital and is still trying to raise capital to meet withdrawals and interest payments- even after halving interest rates, crypto.com cut interest earns to almost nothing. &lt;/p&gt;\n\n&lt;p&gt;No matter how decentralized you think crypto is, if almost all major banks and lenders in the industry are at risk of defaulting - and it&amp;#39;s up to them to figure it out, there is no bailouts available - if somebody sneezes too hard were freefalling. If one of these organizations defaults the sell off pressure is bringing the rest down.&lt;/p&gt;\n\n&lt;p&gt;All this is getting magnified everytime the the price of the coins falls.&lt;/p&gt;\n\n&lt;p&gt;If we survive this, we really need to as an industry embrace some level of regulatory obligations.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 309,
  "permalink": "/r/CryptoCurrency/comments/veqcbb/we_need_more_regulation_this_is_nuts/",
  "subreddit": "CryptoCurrency",
  "id": "veqcbb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Celsius still hasn't opened withdrawals, Babel froze withdrawals and stopped\npaying interest yeilds, finblox capped withdrawals and stopped paying interest\nyeilds, BlockFi sold three arrows capital and is still trying to raise capital\nto meet withdrawals and interest payments- even after halving…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Celsiusはまだ引き出しを開いていない、Babelは引き出しを凍結し、停止した。\n出金に上限を設け、利息の支払いも停止しています。\nBlockFiは3本の矢の資本を売却し、まだ資本を集めようとしている。\n出金と利息の支払いを満たすために、BlockFiは3本の矢の資本を売却し、半分になった後でも資本を調達しようとしています...",
      "title": "もっと規制が必要だ - こんなのおかしい"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Celsius仍未开放提款，Babel冻结提款并停止了\n支付利息，Finblox限制提款并停止支付利息\n酵母，BlockFi出售了三支箭的资本，仍在努力筹集资本\n以满足提款和支付利息--即使在减半之后......",
      "title": "我们需要更多的监管--这太疯狂了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Celsius仍未開放提款，Babel凍結提款並停止了\n支付利息，Finblox限制提款並停止支付利息\n酵母，BlockFi出售了三支箭的資本，仍在努力籌集資本\n以滿足提款和支付利息--即使在減半之後......",
      "title": "我們需要更多的監管--這太瘋狂了"
    }
  ]
}