{
  "author": "MasterCookSwag",
  "the_new_excerpt": "Hi all,\n\nDue to a recent surge in this sort of activity I'm putting out in the public a\nstance /r/investing has held for some time. This post will be linked in the\nrules for future clarification needs.\n\nEver since the GME fiasco Reddit has been the site of an unprecedented amount of\ndeliberate…",
  "original_created_utc": 1624039183,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n最近、この種の活動が急増しているため、私は以下のことを公にします。\nr/investingが以前から掲げていたスタンスを公開します。この投稿は将来の明確化の必要性から、ルールにリンクされます。\nルールにリンクされていますので、将来的に明確にする必要があります。\n\nGMEの騒動以来、Redditでは前例のない量の\n意図的に...",
      "title": "Subredditの荒らし行為に対する当社の姿勢についての注意喚起／明確化"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n由于最近这类活动的激增，我在公众面前展示了一个\n态度。这个帖子将被链接在\n规则中的链接，以备将来澄清之需。\n\n自从GME惨败以来，Reddit上出现了大量前所未有的\n故意...",
      "title": "提醒/澄清我们对Subreddit brigading的立场"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n由於最近這類活動的激增，我在公衆面前展示了一個\n態度。這個帖子將被鏈接在\n規則中的鏈接，以備將來澄清之需。\n\n自從GME慘敗以來，Reddit上出現了大量前所未有的\n故意...",
      "title": "提醒/澄清我們對Subreddit brigading的立場"
    }
  ],
  "title": "Reminder/clarification on our stance on Subreddit brigading",
  "created_utc": 1624044649,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all, </p>\n\n<p>Due to a recent surge in this sort of activity I&#39;m putting out in the public a stance <a href=\"/r/investing\">/r/investing</a> has held for some time.  This post will be linked in the rules for future clarification needs.   </p>\n\n<p>Ever since the GME fiasco Reddit has been the site of an unprecedented amount of deliberate manipulation, bad faith interaction, and attempted pumping.  Because we are one of the larger financial subreddits we have had to deal with this front on - and we have stuck to our longstanding policy regarding brigading.  </p>\n\n<p>In the last two weeks we have banned over 300 users tied to at least 7 different subreddits for this behavior.  I don&#39;t know what the fuck is going on but for whatever reason everyone forgot how to interact like an adult on Reddit in the last three months so here we are.  This is an investment sub, we talk about boring shit like stocks, bonds, markets, whatever - none of us have to be dealing with this subredditdrama style nonsense.  It&#39;s fucking childish. </p>\n\n<p><strong>First, a bit of history for the new users</strong></p>\n\n<p>This policy dates back to mid 2013, in the origional Crypto craze there was a concerted effort by bad actors to establish subreddits focused on their new altcoin or cryptocurrency, then organize a brigade of various investment subreddits.  We reached out to the moderators of <a href=\"/r/cryptocurrency\">/r/cryptocurrency</a> and they added our sub to their filters to prevent this sort of behavior from becoming an issue.  The admins also removed a few users and crypto subs that were created for this purpose.  </p>\n\n<p>Hedgefundaspirations, Crasymike, a few older investment mods, and I held a policy way back then (Even before I was a mod here, and prior to this account even) of permanently banning anyone who participated in this activity.  The point here, is this is not a new policy, it&#39;s not reactive to any recent market events, and it&#39;s not going away.  We are not concerned with whether something is accurate, inaccurate, etc, we are not taking a pro/con stance on any given security or investment - we are taking a definitive stance against such bad faith interaction as we always have since the very early days of this sub. </p>\n\n<hr/>\n\n<p><strong>The Policy</strong></p>\n\n<p>The moment we determine that a brigade is occurring we will automatically and permanently ban anyone who participated in that brigade.  No questions asked, and no appeals given outside of very rare circumstances.  We will also remove the topic, lock comments, and potentially examine the idea of preventing any discussion on that topic for some time - regardless of if it may be a good faith question.   </p>\n\n<p><strong>What is a brigade?</strong></p>\n\n<p>Any attempt to gather members of a different subreddit, especially one focused on a specific security, investment, or stance, to come to <a href=\"/r/investing\">/r/investing</a> and do any of the following: </p>\n\n<ul>\n<li><p>Educate the posters</p></li>\n<li><p>Correct &quot;FUD&quot;</p></li>\n<li><p>&quot;Share information&quot; about a given security</p></li>\n<li><p>Correct some perception of bad actors - if you have reason to believe people in our sub are acting in bad faith then contact the moderation team.  DO NOT go post in some sub taking the opposite stance to gather reinforcements. </p></li>\n<li><p>Share your stance/opinion, or information you believe to be true.</p></li>\n</ul>\n\n<p><strong>In short: if you are on a subreddit that is focused on a specific security, investment, or stance and you see someone there reference a post on <a href=\"/r/investing\">/r/investing</a> (link, a screen shot, a comment saying &quot;this is happening over at <a href=\"/r/investing\">/r/investing</a>, whatever), then you go post on <a href=\"/r/investing\">/r/investing</a> to express your stance you are getting a ban.</strong>  If you spend all day in a subreddit focused on a given security, investment, or stance and you happen to &quot;innocently&quot; come across a post here on that subject you had better make absolutely sure nobody in the offending sub has mentioned <a href=\"/r/investing\">/r/investing</a> yet - because you&#39;re getting lumped in with brigaders if not.  </p>\n\n<p>I want to be very transparent about this - we do not care what you posted.  It could be a profane rant or a kind hearted link to a reputable source.  We care that you are participating in a broad bad faith engagement on Reddit.  After we lock/remove the thread we are able to see which users came from the offending sub very easily - and they will all get a ban.  </p>\n\n<p><strong>Just to be clear:</strong> </p>\n\n<p>This is not brigading: a post in <a href=\"/r/valueinvesting\">/r/valueinvesting</a> pointing out an interesting discussion on <a href=\"/r/investing\">/r/investing</a>, and users coming over to participate.  We are happy to facilitate good faith interaction between various communities.</p>\n\n<p>This is brigading: a post on <a href=\"/r/AppleStockLovers\">/r/AppleStockLovers</a> about how someone on <a href=\"/r/investing\">/r/investing</a> talked shit about Apple stock.  And you coming over here to just let that person know you disagree.</p>\n\n<p>I tend to think anyone who can use a computer should be smart enough to understand when they are acting in bad faith.  So this shouldn&#39;t be a surprise to anyone, but here we are.  </p>\n\n<p>Just to reiterate: This is not a change of policy, it is not reactive to anything that has happened in the post GME reddit environment.  We have been operating with this policy since at least 2013, probably before.  We&#39;re just seeing an absurd surge in this sort of shit so a public post was necessary.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/investing/comments/o2w3qk/reminderclarification_on_our_stance_on_subreddit/",
  "subreddit": "investing",
  "id": "o2w3qk",
  "is_self": true,
  "media": null,
  "is_video": false
}