{
  "author": "Fantastic-Ad9218",
  "original_created_utc": 1651712750,
  "title": "If face masks are completely useless, then why haven't I gotten sick since I started wearing one?",
  "created_utc": 1651736295,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Many people today refuse to wear masks because they say it&amp;#39;s completely useless and it doesn&amp;#39;t work. But here&amp;#39;s the funny thing, before the pandemic, I would get sick 1-2 times per year during Fall/Winter. I would get bad colds or the flu. It&amp;#39;s been that way since I was a kid. I just catch sickness so easily and always had to deal with it annually. However, ever since I started wearing masks in 2019, I haven&amp;#39;t gotten sick once- no cold, no flu, no Covid, no sore throat, and no sniffles. It&amp;#39;s been over two years since I&amp;#39;ve gotten sick and I&amp;#39;ve never gone that long without even catching a cold. And I don&amp;#39;t always stay at home. I go to stores, to the mall, go to church and even take the subway sometimes. I just always wear a face mask.&lt;/p&gt;\n\n&lt;p&gt;So, if masks are useless and don&amp;#39;t work, then why haven&amp;#39;t I gotten sick in over two years?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/NoStupidQuestions/comments/uilivy/if_face_masks_are_completely_useless_then_why/",
  "subreddit": "NoStupidQuestions",
  "id": "uilivy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Many people today refuse to wear masks because they say it's completely useless\nand it doesn't work. But here's the funny thing, before the pandemic, I would\nget sick 1-2 times per year during Fall/Winter. I would get bad colds or the\nflu. It's been that way since I was a kid. I just catch sickness…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "現代人の多くは、マスクは全く意味がないと言って拒否しています。\nと言って、マスクの着用を拒む人が多くなっています。しかし、面白いことに、パンデミック以前は、私は年に1-2回、秋から冬にかけて風邪をひいていました。\n秋から冬にかけて、年に1〜2回は風邪をひいていました。ひどい風邪をひいたり、インフルエンザにかかったり。\nインフルエンザにかかったりしていました。子供の頃からずっとそうでした。ただ、病気にかかるだけなんです...。",
      "title": "マスクが全く役に立たないのなら、なぜマスクをするようになってから風邪をひかなくなったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "今天，许多人拒绝戴口罩，因为他们说这是完全无用的\n而且没有作用。但有趣的是，在大流行之前，我每年秋冬季节都会生病1-2次。\n每年秋冬季节都会生病1-2次。我会得严重的感冒或\n流感。从我还是个孩子的时候就一直如此。我就是会生病...",
      "title": "如果口罩完全没有用，那么为什么我开始戴口罩后就没有生病？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天，許多人拒絕戴口罩，因爲他們說這是完全無用的\n而且沒有作用。但有趣的是，在大流行之前，我每年秋冬季節都會生病1-2次。\n每年秋冬季節都會生病1-2次。我會得嚴重的感冒或\n流感。從我還是個孩子的時候就一直如此。我就是會生病...",
      "title": "如果口罩完全沒有用，那麼爲什麼我開始戴口罩後就沒有生病？"
    }
  ]
}