{
  "author": "Ch0mg",
  "original_created_utc": 1636745572,
  "title": "I just lost all my ETH what do I do?",
  "created_utc": 1636767555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I check my MetaMask account nearly everyday just out of habit. Today I opened the app and realized I lost all of it, my account was drained. In the past transactions it said I transferred it to someone’s account at 3am last night. Keep in mind I don’t use any third party app, I don’t trade I was basically just holding onto the money for safe keeping. I’m not even sure how someone could’ve found out my account information unless MetaMask has a serious security issue. Any help would be very appreciated!!</p>\n</div><!-- SC_ON -->",
  "score": 168,
  "permalink": "/r/CryptoCurrency/comments/qsiw85/i_just_lost_all_my_eth_what_do_i_do/",
  "subreddit": "CryptoCurrency",
  "id": "qsiw85",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I check my MetaMask account nearly everyday just out of habit. Today I opened\nthe app and realized I lost all of it, my account was drained. In the past\ntransactions it said I transferred it to someone’s account at 3am last night.\nKeep in mind I don’t use any third party app, I don’t trade I was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は習慣的にほぼ毎日MetaMaskのアカウントをチェックしています。今日、アプリを開くと\n今日、アプリを開いてみると、アカウントが全部なくなっていることに気づきました。過去の取引では\nの取引では、昨夜の3時に誰かのアカウントに移したと書いてありました。\n私はサードパーティのアプリは使っていませんし、トレードもしていません。",
      "title": "ETHをすべて失ってしまいました......どうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我几乎每天都查看我的MetaMask账户，只是出于习惯。今天我打开\n发现我失去了所有的东西，我的账户被耗尽了。在过去的\n交易中，它说我在昨晚凌晨3点把它转到了某人的账户。\n请记住，我没有使用任何第三方应用程序，我不交易，我是...",
      "title": "我刚刚失去了我所有的ETH，我该怎么做？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我幾乎每天都查看我的MetaMask賬戶，只是出於習慣。今天我打開\n發現我失去了所有的東西，我的賬戶被耗盡了。在過去的\n交易中，它說我在昨晚凌晨3點把它轉到了某人的賬戶。\n請記住，我沒有使用任何第三方應用程序，我不交易，我是...",
      "title": "我剛剛失去了我所有的ETH，我該怎麼做？"
    }
  ]
}