{
  "author": "CRAZYATOMDAVE",
  "original_created_utc": 1629672102,
  "title": "Lawyer Just Told Me My Moons Community Property",
  "created_utc": 1629679521,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I apologize in advance. I am on mobile and this is a back up account. So, I am going through a divorce. I got the typical worksheet that the lawyer&#39;s office gives out and I filled it out and turned it in. It asked about bank accounts, land pretty much everything that you could imagine. But nothing about crypto. So, I didn&#39;t fill anything out. Of course, my ex knows all about my crypto. So, after we turned in the inventory my lawyer called and said that I left something out. I told him it wasn&#39;t on the sheet. He actually, didn&#39;t know anything about crypto at all. So, I filled it in this time, including everything except my moons (this is a back up account). My lawyer just called me and said, my ex is asking about something called Moons. He tells me as long as they were accumulated before the divorce she gets half. Of course, I&#39;m going to counter with asking for half of her international Santa collection. But we&#39;ll see where that gets me.</p>\n</div><!-- SC_ON -->",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/p9mpju/lawyer_just_told_me_my_moons_community_property/",
  "subreddit": "CryptoCurrency",
  "id": "p9mpju",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I apologize in advance. I am on mobile and this is a back up account. So, I am\ngoing through a divorce. I got the typical worksheet that the lawyer's office\ngives out and I filled it out and turned it in. It asked about bank accounts,\nland pretty much everything that you could imagine. But nothing…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先に謝っておきます。私は携帯電話を使用しており、これはバックアップ用のアカウントです。さて、私は今\n離婚をしようとしています。弁護士事務所が配布する典型的なワークシートを手に入れて\n記入して提出しました。銀行口座について聞かれました。\n銀行口座や土地など、想像できる限りのことを聞かれました。でも、何も...",
      "title": "弁護士が私の月の共有財産を教えてくれた"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我提前表示歉意。我正在使用手机，这是个备份账户。所以，我是\n正在经历一场离婚。我得到了律师办公室提供的典型工作表。\n的典型工作表，我把它填好并交了上去。它询问了银行账户的情况。\n几乎所有你能想到的东西。但没有什么...",
      "title": "律师刚刚告诉我，我的月亮是共有财产"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我提前表示歉意。我正在使用手機，這是個備份賬戶。所以，我是\n正在經歷一場離婚。我得到了律師辦公室提供的典型工作表。\n的典型工作表，我把它填好並交了上去。它詢問了銀行賬戶的情況。\n幾乎所有你能想到的東西。但沒有什麼...",
      "title": "律師剛剛告訴我，我的月亮是共有財產"
    }
  ]
}