{
  "author": "Notmiefault",
  "original_created_utc": 1643060472,
  "title": "The first Harry Potter movie, with a budget of $125 Million, began production just two years after the first book by a completely unknown British author was first published. How did the Harry Potter series explode in popularity so incredibly quickly compared to other similar book series?",
  "created_utc": 1643075723,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s crazy to me how &lt;em&gt;quickly&lt;/em&gt; Harry Potter caught on, especially given that it wasn&amp;#39;t an established IP or author. To be clear, I&amp;#39;m not looking for a literary analysis (I&amp;#39;m sure the content helped, but great books get missed all the time). Rather, I am curious what external factors allowed such an incredible rise in popularity. Did some media giant pick up the series early and decide &amp;quot;we&amp;#39;re going to market the hell out of this&amp;quot;? Was there a lull in children&amp;#39;s fiction at the time that led to a huge demand? Did the english-speaking world just decide that 1997 was the year to read to their kids a lot more than they used to?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 365,
  "permalink": "/r/AskHistorians/comments/sbxc8t/the_first_harry_potter_movie_with_a_budget_of_125/",
  "subreddit": "AskHistorians",
  "id": "sbxc8t",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It's crazy to me how quickly Harry Potter caught on, especially given that it\nwasn't an established IP or author. To be clear, I'm not looking for a literary\nanalysis (I'm sure the content helped, but great books get missed all the time).\nRather, I am curious what external factors allowed such an…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ハリー・ポッターがこれほど早く普及したことは、私にとって驚くべきことです。\nそのような状況下でも、「この作品には、この作家がいる。はっきり言って、私は文学的なものを求めているわけではありません。\n内容もさることながら、素晴らしい本が見逃されることはよくあることです）。\nむしろ、どのような外的要因によって、このような...",
      "title": "ハリー・ポッターの第1作目は、英国の全く無名の作家による最初の本が出版されてからわずか2年後に、1億2500万ドルの予算で製作が開始されました。ハリー・ポッターシリーズは、他の類似の書籍シリーズと比較して、なぜこれほどまでに急速に人気を博したのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "对我来说，《哈利-波特》如此迅速地流行起来是很疯狂的，特别是考虑到它不是一个成熟的IP或作者。\n特别是考虑到它并不是一个成熟的IP或作者。清楚地说，我不是在寻找文学分析（我相信这些内容帮助了我）。\n分析（我相信内容有帮助，但好书总是被错过的）。\n相反，我很好奇是什么外在因素让这样的书在中国市场上大受欢迎。",
      "title": "第一部《哈利-波特》电影的预算为1.25亿美元，在一位完全不知名的英国作家的第一本书首次出版两年后就开始制作。与其他类似的图书系列相比，《哈利-波特》系列是如何以令人难以置信的速度爆炸性地流行起来的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "對我來說，《哈利-波特》如此迅速地流行起來是很瘋狂的，特別是考慮到它不是一個成熟的IP或作者。\n特別是考慮到它並不是一個成熟的IP或作者。清楚地說，我不是在尋找文學分析（我相信這些內容幫助了我）。\n分析（我相信內容有幫助，但好書總是被錯過的）。\n相反，我很好奇是什麼外在因素讓這樣的書在中國市場上大受歡迎。",
      "title": "第一部《哈利-波特》電影的預算爲1.25億美元，在一位完全不知名的英國作家的第一本書首次出版兩年後就開始製作。與其他類似的圖書系列相比，《哈利-波特》系列是如何以令人難以置信的速度爆炸性地流行起來的？"
    }
  ]
}