{
  "author": "keanu4EvaAKitten",
  "original_created_utc": 1645547963,
  "title": "Be mentally ready.",
  "created_utc": 1645577901,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;With Russia&amp;#39;s ongoing invasion of Ukraine, the U.S and EU are imposing financial sanctions on Russia and will essentially attempt to exclude them from the international economy. I think Russia&amp;#39;s response to this is pretty obvious and telegraphed, they are going to embrace Bitcoin so that their oligarchs and members of government can continue to transact internationally. Hopefully their citizens are also allowed to use it without too much regulation, but not holding my breath. We&amp;#39;ve already seen the draft bill of this, and now more than ever they have a justification to accelerate this. I don&amp;#39;t know whether it happens in the next three weeks or next six month, but it appears to me that the course is set. Putin has been yearning to invade Ukraine ever since 2014, but the financial sanctions that would ensue were probably enough of a deterrent. Up until now. Putin now has an alternative, and he seems to have gained enough confidence in Bitcoin&amp;#39;s decentralized and uncensorable attributes to use it to circumvent the international dollar system.&lt;/p&gt;\n\n&lt;p&gt;The reason for this post is to remind people that if/when Russia does this, you might want to reconsider how open you are in public about being a Bitcoiner.&lt;/p&gt;\n\n&lt;p&gt;If Russia adopts Bitcoin, the legacy media and politicians are going to very quickly shape and pressure public opinion into believing that Bitcoin is to blame for Russia&amp;#39;s sudden immunity to financial sanctions. They will call it a dictator&amp;#39;s weapon and the reason why their financial warfare tactics are no longer effective. It could even get so bad as to a minority of media claiming that Bitcoiners are colluding with the Russian state. Stuff like &amp;quot;The only reason why you own Bitcoin is to transact with the Russian state&amp;quot; or &amp;quot; Anyone promoting Bitcoin is promoting Russia&amp;quot;. (Writing these easy to predict quips makes me feel physically sick).&lt;/p&gt;\n\n&lt;p&gt;I personally have nothing but hatred and disgust for Vladimir Putin. He has shown on countless occasions that he is a psychopathic tyrant who uses force to coerce millions of people in doing things that are beneficial to him and detrimental to them. He is a net negative for humanity.&lt;/p&gt;\n\n&lt;p&gt;However, Bitcoin is a neutral technology that is available to all. To dictators and freedom fighters alike. What each person decides to do with that tool is fully their responsibility and has nothing to do with the tool itself. For example, if it &lt;a href=\"https://www.themoscowtimes.com/2021/02/11/russian-opposition-finds-refuge-in-bitcoin-a72907\"&gt;weren&amp;#39;t for Bitcoin, there would not be any political opposition in Russia in the first place&lt;/a&gt;. Just as Putin can benefit by adopting Bitcoin, he can also be tremendously harmed by it.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin is apolitical. I know that everyone in this sub understands this. But the majority of people do not.   And I&amp;#39;m afraid that the topic of Bitcoin is about to get disgustingly politicized. If this is the case (I really hope I&amp;#39;m wrong), then you might want to reconsider how open you are about being a Bitcoiner.&lt;/p&gt;\n\n&lt;p&gt;The decision will be 100% yours. Some will be defiant and brave enough to take on the senseless criticism heads on. Others will prefer to self-censor to avoid the emotionally draining societal pressure. Every person will know for themselves what the best course of action depending on their unique set of circumstances.&lt;/p&gt;\n\n&lt;p&gt;Be mindful that full scale social and political ostracization can be mentally very, very tough.&lt;/p&gt;\n\n&lt;p&gt;All I&amp;#39;m saying is to that it´s probably a good idea to decide ahead of time how you are going to act in case this likely scenario does indeed play out. This way you can minimize any regret.&lt;/p&gt;\n\n&lt;p&gt;And, I can only hope that this amazing community will continue to be a refuge for divergent and politically alienated people. Whatever you decide to do, I feel confident in saying that Bitcoiners will keep on having each other´s back.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 364,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?auto=webp&amp;s=48ac7420c3cfe90e545dc1f35dc4c3a3baeffd59",
          "width": 1360,
          "height": 766
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=11f1b8237029ab9ab4687b8ea679529a6294f0db",
            "width": 108,
            "height": 60
          },
          {
            "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=3f7cd6b268c84910a4096ad0a520f53a36e0cc2b",
            "width": 216,
            "height": 121
          },
          {
            "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=a97f62f162912a4606d1127e82ada0e301fc3765",
            "width": 320,
            "height": 180
          },
          {
            "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=41f0c4832648c651c2662b05da1653f4af3e2d82",
            "width": 640,
            "height": 360
          },
          {
            "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=b194b4dc5deaf337756b7b3635e1527d2cc76474",
            "width": 960,
            "height": 540
          },
          {
            "url": "https://external-preview.redd.it/QcGbz7BuG1jzUimHJoQCx1x1g0QA5_h6FZ7NBEP7FQ0.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=0de58f7ef762cf979b1d4e61da0cc2fb8baebb54",
            "width": 1080,
            "height": 608
          }
        ],
        "variants": {},
        "id": "JXeBZBIeNaFkGiSlum9aRZzOYXwYJBOMffXSa7XfNxI"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/Bitcoin/comments/syrx06/be_mentally_ready/",
  "subreddit": "Bitcoin",
  "id": "syrx06",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "With Russia's ongoing invasion of Ukraine, the U.S and EU are imposing financial\nsanctions on Russia and will essentially attempt to exclude them from the\ninternational economy. I think Russia's response to this is pretty obvious and\ntelegraphed, they are going to embrace Bitcoin so that their…"
}