{
  "author": "CryptoTaxLawyer",
  "original_created_utc": 1636664476,
  "title": "I am u/CryptoTaxLawyer, AMA.",
  "created_utc": 1636698754,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi <a href=\"/r/Cryptocurrency\">r/Cryptocurrency</a>!</p>\n\n<p><a href=\"/r/Cryptocurrency\">r/Cryptocurrency</a> recently hosted me for one of their <a href=\"https://www.reddit.com/r/CryptoCurrency/comments/qqs293/recording_talk_with_ucryptotaxlawyer_on_taxation/\">Live Q&amp;A sessions</a> and the feedback was overwhelmingly positive. Many of you have reached out to me directly via message or chat and, while I&#39;ve tried to answer as much as I can, I think it would be helpful to the community if I host an ongoing AMA thread that could be a resource for general questions/answers that multiple people in the community might benefit from seeing down the line. </p>\n\n<p>About me: I&#39;m a US-based attorney practicing cryptocurrency tax law. I&#39;ve been in the crypto space as an investor since 2013 and have been along for the ride ever since. I have witnessed the ups and downs of the crypto markets &amp; regulatory confusion along with the rest of you and now have the privilege of practicing law in a field that I am passionate about.</p>\n\n<p>I will try to answer your questions as they come in, but please be patient as I might need a few days before I can respond. I&#39;ll try to circle back regularly though for as long as the questions come in. I can&#39;t provide any specific legal or tax advice, so if you have some complex situation that you need help with, please don&#39;t be offended if I don&#39;t have an answer for you.</p>\n\n<p>Disclaimer: I am not your attorney. Receiving an answer to a question does not create an attorney-client relationship. Cryptocurrency taxation is still a very uncertain area of law and the legal landscape is subject to change quickly as new guidance from Congress, the courts, or the IRS is revealed. With this in mind, nothing in this thread should be relied upon without first consulting your own tax professional about your specific situation.</p>\n\n<p>Edit: Hey everyone, sorry I haven&#39;t been able to answer any questions yet. Something came up, but I promise I&#39;ll circle back tomorrow and throughout this weekend. Thanks for the questions!</p>\n</div><!-- SC_ON -->",
  "score": 152,
  "permalink": "/r/CryptoCurrency/comments/qruxfn/i_am_ucryptotaxlawyer_ama/",
  "subreddit": "CryptoCurrency",
  "id": "qruxfn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi r/Cryptocurrency [/r/Cryptocurrency]!\n\nr/Cryptocurrency [/r/Cryptocurrency] recently hosted me for one of their Live\nQ&A sessions\n[https://www.reddit.com/r/CryptoCurrency/comments/qqs293/recording_talk_with_ucryptotaxlawyer_on_taxation/]\nand the feedback was overwhelmingly positive. Many of you…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、r/Cryptocurrency [/r/Cryptocurrency]!\n\nr/Cryptocurrency [/r/Cryptocurrency]は最近、私をライブの\nQ&Aセッション\n[https://www.reddit.com/r/CryptoCurrency/comments/qqs293/recording_talk_with_ucryptotaxlawyer_on_taxation/]\nそして、そのフィードバックは圧倒的にポジティブなものでした。多くの方が...",
      "title": "私はu/CryptoTaxLawyer, AMAです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，r/Cryptocurrency [/r/Cryptocurrency]!\n\nr/Cryptocurrency [/r/Cryptocurrency]最近邀请我参加他们的一个现场\n问答环节\n[https://www.reddit.com/r/CryptoCurrency/comments/qqs293/recording_talk_with_ucryptotaxlawyer_on_taxation/]\n而反馈是压倒性的积极。你们中的许多人...",
      "title": "我是u/CryptoTaxLawyer，AMA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，r/Cryptocurrency [/r/Cryptocurrency]!\n\nr/Cryptocurrency [/r/Cryptocurrency]最近邀請我參加他們的一個現場\n問答環節\n[https://www.reddit.com/r/CryptoCurrency/comments/qqs293/recording_talk_with_ucryptotaxlawyer_on_taxation/]\n而反饋是壓倒性的積極。你們中的許多人...",
      "title": "我是u/CryptoTaxLawyer，AMA。"
    }
  ]
}