{
  "author": "CryptoSorted",
  "original_created_utc": 1634429088,
  "title": "Shitcoin investing strategy for the born degenerates",
  "created_utc": 1634459443,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If I can&#39;t stop you from playing the shitcoins game, maybe I can teach you how to win...</p>\n\n<p>Here is a shitcoin investing strategy you can adopt and hopefully perfect to work for you.</p>\n\n<ol>\n<li><p>Allocate a fixed amount or percentage of your portfolio size for your shitcoins investing, say $1,000 or 1%.</p></li>\n<li><p>Divide the amount into 10 equal parts. And invest in 10 different shitcoins. Try to invest in the shitcoins as early as possible. If you strongly feel you&#39;re too late to the party I suggest you pass and move into the next new shitcoin.</p></li>\n<li><p>You will only sell the shitcoin once it does a 10X.</p></li>\n<li><p>Invest the shitcoin profit into more solid projects that you believe in like:\nETH\nBTC\nBCH\nBNB\nDOT\nLINK\n.......etc.</p></li>\n<li><p>Never invest in the same shitcoin twice. Once you exit with your 10X never look back, even if it goes to a 100X.</p></li>\n<li><p>Rinse and repeat until you&#39;re too rich to bother.</p></li>\n</ol>\n\n<p>PS: The 10X is my idea. You can set your exit profit target to be 2x, 5x, 10x, or something even higher. The choice is yours but make sure you stick to it, no matter what.</p>\n\n<p>EDIT: To discover new shitcoins early, check the recently listed section of CMC and CoinGecko daily.</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/q9nohi/shitcoin_investing_strategy_for_the_born/",
  "subreddit": "CryptoCurrency",
  "id": "q9nohi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "If I can't stop you from playing the shitcoins game, maybe I can teach you how\nto win...\n\nHere is a shitcoin investing strategy you can adopt and hopefully perfect to\nwork for you.\n\n 1. Allocate a fixed amount or percentage of your portfolio size for your\n    shitcoins investing, say $1,000 or 1%.\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたがクソコインゲームをするのを止められないなら、勝つ方法を教えてあげよう。\n勝つ方法を教えることができるかもしれません...\n\nここでは、あなたが採用できるシットコイン投資戦略を紹介し、できれば完璧に\nあなたのためになることを願っています。\n\n 1. ポートフォリオの一定の金額または割合をシットコイン投資に割り当てます。\n    例えば、1,000ドルまたは1％。\n\n...",
      "title": "生まれながらの退廃者のためのシットコイン投資戦略"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果我不能阻止你玩粪币游戏，也许我可以教你如何\n赢...\n\n这里有一个狗屎币投资策略，你可以采用，并希望能完善到\n为你工作。\n\n 1. 在你的投资组合规模中分配一个固定的金额或百分比，用于你的\n    屎币投资，例如1000美元或1%。\n\n...",
      "title": "天生堕落者的屎币投资策略"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果我不能阻止你玩糞幣遊戲，也許我可以教你如何\n贏...\n\n這裏有一個狗屎幣投資策略，你可以採用，並希望能完善到\n爲你工作。\n\n 1. 在你的投資組合規模中分配一個固定的金額或百分比，用於你的\n    屎幣投資，例如1000美元或1%。\n\n...",
      "title": "天生墮落者的屎幣投資策略"
    }
  ]
}