{
  "author": "Gallantpride",
  "the_new_excerpt": "I've heard that most people historically didn't get married until their 20s.\nBut, it was (and, in many regions, still is) legal for people under 18 to marry.\n\nI often hear people explain stuff like Romeo & Juliet or Catherine Howard's\nrelationship with Henry Mannox as being due to differences in age…",
  "original_created_utc": 1623898292,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "歴史的には20代まで結婚しない人が多かったと聞いています。\nしかし、18歳未満の結婚は合法でした（現在も多くの地域で合法ですが）。\n\nよく「ロミオ＆ジュリエット」や「キャサリン・ハワード」などの説明を聞きますが\nよく、ロミオとジュリエットや、キャサリン・ハワードとヘンリー・マノックスの関係を、年齢の違いから説明する人がいますが...。",
      "title": "チューダー朝時代に13歳が結婚することが本当に許されたのか？10代で結婚した場合は、大人とみなされたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我听说历史上大多数人在20多岁之前都不会结婚。\n但是，18岁以下的人结婚是合法的（而且，在许多地区仍然是合法的）。\n\n我经常听到人们解释像罗密欧与朱丽叶或凯瑟琳-霍华德与亨利-曼诺克斯的关系这样的事情。\n与亨利-曼诺克斯的关系是由于年龄上的差异......",
      "title": "在都铎时代，13岁的人结婚真的可以接受吗？如果你在十几岁的时候就结婚，你被认为是成年人吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我聽說歷史上大多數人在20多歲之前都不會結婚。\n但是，18歲以下的人結婚是合法的（而且，在許多地區仍然是合法的）。\n\n我經常聽到人們解釋像羅密歐與朱麗葉或凱瑟琳-霍華德與亨利-曼諾克斯的關係這樣的事情。\n與亨利-曼諾克斯的關係是由於年齡上的差異......",
      "title": "在都鐸時代，13歲的人結婚真的可以接受嗎？如果你在十幾歲的時候就結婚，你被認爲是成年人嗎？"
    }
  ],
  "title": "Was 13 year olds getting married in Tudor times truly acceptable? If you were married as a teen, were you considered an adult?",
  "created_utc": 1623959994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve heard that most people historically didn&#39;t get married until their 20s. But, it was (and, in many regions, still is) legal for people under 18 to marry.</p>\n\n<p>I often hear people explain stuff like Romeo &amp; Juliet or Catherine Howard&#39;s relationship with Henry Mannox as being due to differences in age of consent. It was &quot;normal&quot; for 13 year olds to get married... Was it really?</p>\n\n<p>I know there&#39;s dialogue in Romeo and Juliet that says the roughly 13-year old Juliet is too young to get married. Her mother was married around the same age, but Juliet should wait a few years. This seems to imply that 13 year olds could <em>legally</em> married but it wasn&#39;t the most acceptable thing in the world.</p>\n\n<p>If a 13 year old was married or even just courted by an adult, what did others think of this? Was it inappropriate? Was the 13 year old seen as a child/adolescent who is married or are they seen more like an adult? Were they expected to get pregnant, though it might be dangerous due to their youth? Did adult women ever marry teenage boys or was it only men and girls?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/o1mlv0/was_13_year_olds_getting_married_in_tudor_times/",
  "subreddit": "AskHistorians",
  "id": "o1mlv0",
  "is_self": true,
  "media": null,
  "is_video": false
}