{
  "author": "RainAlwaysComes",
  "the_new_excerpt": "I've been a longtime lurker in this sub, even before I grew a pair and started\ndipping my toes into the market. The variety of people, the thoroughness of\ntheir research, and the veracity with which they defend it, make this place what\nit is.\n\nI only began trading as a side hustle at the start of…",
  "original_created_utc": 1614776315,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经在这个子里潜伏了很久了，甚至在我长出一双眼睛，并开始\n浸入市场。各种各样的人，彻底的\n他们的研究，以及他们为之辩护的真实性，使这里成为了一个\n它是。\n\n我只是作为副业开始交易，在开始...",
      "title": "我爱这个社区... 但我们需要谈谈。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經在這個子裏潛伏了很久了，甚至在我長出一雙眼睛，並開始\n浸入市場。各種各樣的人，徹底的\n他們的研究，以及他們爲之辯護的真實性，使這裏成爲了一個\n它是。\n\n我只是作爲副業開始交易，在開始...",
      "title": "我愛這個社區... 但我們需要談談。"
    }
  ],
  "title": "I love this community... but we need to talk.",
  "created_utc": 1614814436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been a longtime lurker in this sub, even before I grew a pair and started dipping my toes into the market.  The variety of people, the thoroughness of their research, and the veracity with which they defend it, make this place what it is.  </p>\n\n<p>I only began trading as a side hustle at the start of the pandemic (with modest success).  My biggest wins came from WSB.  When the real push on GME started, I was there.  I was a bag holder of GME after January, but my bag wasn&#39;t too large  and I liked the stock, so I grew some diamond hands and held.  I started really following the day-to-day threads, reading every piece of financial news I could, watched Bruce eat his bagels, and developed a much deeper understanding of the market in general.  </p>\n\n<p>I don&#39;t listen to all the advice I see on here... and I don&#39;t blindly trust DD.  </p>\n\n<p>Why I feel I need to post today:<br/>\nThe mood in this sub has changed drastically over the last 24 hours.  The rift I see between the GME folks and the RKT folks saddens me greatly.  I don&#39;t know exactly how I fee about RKT... something just seems too contrived about it.</p>\n\n<p>I&#39;ve seen some DD that suggests it&#39;s a HF ploy to pull people out of GME.  If that&#39;s the case, I don&#39;t think it will be successful.  GME apes are strong.  You don&#39;t just lose your diamond hands on a whim.</p>\n\n<p>I&#39;ve seen other DD that suggests it&#39;s a HF hedge and their using this to boost their capital in order to better defend their position in GME/AMC.  This seems a bit more plausible to me, but I&#39;m  still not 100% convinced.  A lot of people are posting massive gains (sincere congratulations). </p>\n\n<p>What conclusion I have come to is this.  If I were a HF or a MM who needed WSB to fracture, I would seed disunity and distrust among the community.  I would send every bot or shill I could in every direction.  Some strongly defending RKT, some tearing it down.  Some screaming GME is dead, while others quietly suggest taking gains from RKT and rolling them into UWMC.  I wouldn&#39;t suggest a shit stock that I knew nobody would listen about... I would use my best DD and find something that could tear attention away from GME and tear the community apart.  And unfortunately, I think it&#39;s starting to work.  Just reading the daily discussion thread for today is like watching two 3-year-olds argue about what superhero would win in a fight.  </p>\n\n<p>I love this community.  I hope that some of you may read this and that it may make a small difference.  When it comes to money, it&#39;s easy to manipulate peoples feelings.  I just hope that in the end, Apes Together Strong is the sentiment.</p>\n\n<p>Good luck today everyone, and thank you.</p>\n</div><!-- SC_ON -->",
  "score": 3709,
  "permalink": "/r/wallstreetbets/comments/lwta3q/i_love_this_community_but_we_need_to_talk/",
  "subreddit": "wallstreetbets",
  "id": "lwta3q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937759871
}