{
  "author": "anakanin",
  "original_created_utc": 1628928311,
  "title": "“Investments are for rich” is what I thought before I found crypto",
  "created_utc": 1628969436,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me introduce myself, Im a broke ass millennial with 2 kids and a shitty day job as garbage disposal guy. I also do opportunity jobs here and there for some extra bucks. \nFrom when I was little I was under the impression that investing is not for people like us who barely make it through the month.</p>\n\n<p>My friends back when I was younger were rich and they were always mocking me why I dont wear nicer clothes, cooler shoes, have better bike or whatever bull. When you are little it hurts. Its not pleasant at all. Now I dont give a single fuck about vanity and having designer bullshit clothes or whatever but back then it was a shitty place to be.</p>\n\n<p>Anyway investing in stocks, bonds and such was always somehow out of my reach.\nCrypto really changed that. My first investment was $10 in ADA and that grew nicely over last year. Since then Ive been slowly investing 10-20$ a month depending on how much I can afford to save. Now I have a nice small portfolio of crypto that O believe in. \nI treat crypto as a fund for my kiddos to be able to live a better life and so that they wont need to work at a degrading job like I do. Truly, if you saw how people treat you as a garbage disposal guy, youd cringe. And this is why in my opinion is the winning point in crypto. Anyone, even poor people like myself, can invest whenever and wherever they want. 5$ or $50000, it can be done with a single little click.</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/p440dl/investments_are_for_rich_is_what_i_thought_before/",
  "subreddit": "CryptoCurrency",
  "id": "p440dl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me introduce myself, Im a broke ass millennial with 2 kids and a shitty day\njob as garbage disposal guy. I also do opportunity jobs here and there for some\nextra bucks. From when I was little I was under the impression that investing is\nnot for people like us who barely make it through the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "自己紹介させていただきますと、私は2人の子供を持ち、ゴミ処理係というつまらない日雇い仕事をしている無職のミレニアム世代です。\nゴミ処理係の仕事をしています。私はまた、いくつかの余分なお金のためにあちこちに機会の仕事をします。\n余分なお金を稼いでいます。小さい頃から、投資は自分のような人間には向いていないという印象を持っていました。\n私たちのような生活がやっとの人には向かないと思っていました。",
      "title": "「投資はお金持ちのためのもの」と思っていた私が暗号に出会った理由"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我介绍一下我自己，我是一个破产的千禧一代，有两个孩子，每天做着一份低劣的垃圾处理工作。\n的工作，是个垃圾处理员。我还在这里和那里做一些机会性工作，以获得一些\n额外的钱。在我小的时候，我的印象是投资是\n不适合像我们这样勉强维持生计的人......",
      "title": "\"投资是有钱人的事\"，这是我在发现加密货币之前的想法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我介紹一下我自己，我是一個破產的千禧一代，有兩個孩子，每天做着一份低劣的垃圾處理工作。\n的工作，是個垃圾處理員。我還在這裏和那裏做一些機會性工作，以獲得一些\n額外的錢。在我小的時候，我的印象是投資是\n不適合像我們這樣勉強維持生計的人......",
      "title": "\"投資是有錢人的事\"，這是我在發現加密貨幣之前的想法。"
    }
  ]
}