{
  "author": "President_Wolfe",
  "the_new_excerpt": "Over the last few days, there has been a crazy surge in same day reverse repo\noperations at the NY Fed.\n\nWhat are these Reverse Repos you ask, and I ask too BTW, but according to the NY\nFed:\n\n\" The New York Fed conducts repo and reverse repo operations each day as a means\nto help keep the federal…",
  "original_created_utc": 1617242834,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这几天，当日逆回购疯狂涌动\n纽约联储的业务。\n\n你问的这些逆向回购是什么，我也问了BTW，但根据纽约\n美联储。\n\n\" 纽约联储每天都会进行回购和逆回购操作，以此作为\n以帮助保持联邦...",
      "title": "为什么这两天出现了千亿以上的逆回购操作？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這幾天，當日逆回購瘋狂湧動\n紐約聯儲的業務。\n\n你問的這些逆向回購是什麼，我也問了BTW，但根據紐約\n美聯儲。\n\n\" 紐約聯儲每天都會進行回購和逆回購操作，以此作爲\n以幫助保持聯邦...",
      "title": "爲什麼這兩天出現了千億以上的逆回購操作？"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ここ数日、即日リバースレポが異常に急増しています。\n操作が急増しています。\n\nこのリバース・レポとは何なのか、と皆さんは尋ねるでしょうし、私も同様に尋ねますが、ニューヨーク連銀によると、次のようになっています。\nFRBによると\n\n\" ニューヨーク連銀は、連邦政府の国債を維持するための手段として、毎日レポとリバースレポのオペレーションを行っています。\nレポとリバース・レポ・オペレーションを行っている。",
      "title": "なぜ、2日間で1000億ドル以上のリバースレポオペレーションが行われたのか？"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、即日リバースレポが異常に急増しています。\n操作が急増しています。\n\nこのリバース・レポとは何なのか、と皆さんは尋ねるでしょうし、私も同様に尋ねますが、ニューヨーク連銀によると、次のようになっています。\nFRBによると\n\n\" ニューヨーク連銀は、連邦政府の国債を維持するための手段として、毎日レポとリバースレポのオペレーションを行っています。\nレポとリバース・レポ・オペレーションを行っている。",
      "title": "なぜ、2日間で1000億ドル以上のリバースレポオペレーションが行われたのか？"
    }
  ],
  "title": "Why Has There Been Two Days Of $100+ Billion In Reverse Repo Operations?",
  "created_utc": 1617319098,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Over the last few days, there has been a crazy surge in same day reverse repo operations at the NY Fed.</p>\n\n<p>What are these Reverse Repos you ask, and I ask too BTW, but according to the NY Fed:</p>\n\n<p><em>&quot;  The New York  Fed conducts repo and reverse repo operations each day as  a  means to help keep  the federal funds rate in the target range set  by  the</em> <a href=\"https://www.federalreserve.gov/monetarypolicy/fomc.htm\"><em>Federal Open  Market Committee (FOMC)</em></a><em>.  &quot;</em></p>\n\n<p>So large banks and institutions can exchange with the Fed money to help control the money supply. <strong>Gotcha.</strong></p>\n\n<p>Ok, and to see how much has been traded recently:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/afna91iazgq61.png?width=600&amp;format=png&amp;auto=webp&amp;s=61b40ffbc7ff8a27a2ae2fa1b4dc07311e63a5c6\">https://preview.redd.it/afna91iazgq61.png?width=600&amp;format=png&amp;auto=webp&amp;s=61b40ffbc7ff8a27a2ae2fa1b4dc07311e63a5c6</a></p>\n\n<p>Honestly,  I came across something online citing  and wanted to see what others  thought. Steven Van Metre, Bond King from his videos, comments as it being too much cash in  circulation, though also in the same video cites a tweet about the IMO  saying there is a global shortage of the US dollar?</p>\n\n<p>And  I understand that with the SLR exemption expiring, banks need to lower  their capital, however I don&#39;t think (I don&#39;t think alot actually  regardless) that lending the Fed billions overnight would actually help  banks comply.</p>\n\n<p>Or is this in anyway linked to the shit going down with over leverage?</p>\n\n<p><strong>TLDR:</strong></p>\n\n<ul>\n<li>Wrinkled Brain Apes, why are institutions exchanging CRAZY amounts with the FED to borrow treasury notes overnight?</li>\n<li>And why would Institutions WANT to trade billions for short term loans of treasury notes?</li>\n</ul>\n\n<p><a href=\"https://apps.newyorkfed.org/markets/autorates/tomo-results-display?SHOWMORE=TRUE&amp;startDate=01/01/2000&amp;enddate=01/01/2000\">Link to NY Fed RR Numbers</a></p>\n\n<p>&#x200B;</p>\n\n<p>Edit: <a href=\"https://www.reddit.com/r/SecurityAnalysis/comments/d64tie/eli5_repo_rates_how_they_work_and_what_the_heck/\">ELI5 Thread With Excellent Comments Explaining Why This Can Happen At End of Quarter To Help Banks Pay Taxes</a></p>\n\n<p>- Some comments also seem to imply that when Banks get worried about the market they do this to shift into more secure investments.</p>\n\n<p>- Another possibility I&#39;ve read is that Banks will purchase a shit ton of Bonds before the quarter ends to make their balance sheets look WAY safer than it actually is...</p>\n\n<p>- Finding some stuff on the Overnight Repo Issues of Sept 2019 when the rate spiked up to 10%, but overnight repo rates currently have been flat (0.05 as of last Friday)</p>\n\n<p>- Repo Market depends pretty much on 4 banks (BoA, Citi, JPMorgan,WF) and liquidity issues back in Sept 2019 caused a fuss because of the Liquidity Rule and banks not having enough cash to follow the rule and to lend out, so the repo rate shot up back then.</p>\n\n<p>- Other theory I&#39;ve read, Banks are fighting with FED, as always, and want the Liquidity Rule raised and the FED wants to sell bonds to pay for stimmies and Biden&#39;s infrastructure. Banks use the borrowed T-Notes to keep bond interest down so no one wants to buy government bonds. Not sure if this summation is correct, but it would be similar to Banks shorting the bond market.</p>\n\n<p>-- Yep, this is looking more and more like the case, but even weirder with Banks loaning HF&#39;s money and negative interest rates to get more treasurey notes, still reading more on this one....</p>\n\n<p>--&gt; If Bond interest rates keep going up, then prices for them will go down. If Banks buy up treasuries and then sell them on the treasury market, they can buy them back at a later date after interest rates have risen, AT A LOWER PRICE, banks keep the difference, BUT if there&#39;s a shortage of TNotes, OR if interest rates start falling again, Banks have to buy them back at higher prices, which....  ------&gt; This is gonna need a whole new post, this is getting DEEP.</p>\n\n<p>---&gt; Yea, this is atobitt&#39;s stuff definitely, <a href=\"https://www.reddit.com/r/GME/comments/mgucv2/the_everything_short/\">READ THEIR POST about the shorting of the bond market and the short squeeze for TNotes</a></p>\n</div><!-- SC_ON -->",
  "score": 1033,
  "permalink": "/r/wallstreetbets/comments/mhl9mg/why_has_there_been_two_days_of_100_billion_in/",
  "subreddit": "wallstreetbets",
  "id": "mhl9mg",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961880378
}