{
  "author": "cherry-dream",
  "original_created_utc": 1628773578,
  "title": "Are men just less physically desirable than women?",
  "created_utc": 1628795330,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t know how to formulate it, but I have had the lifelong impression that the only way to be desired and valued as a man is to have a functional value, like a tool in a toolbox.</p>\n\n<p>Except that, we aren&#39;t really that much desirable. Or at least I feel, we have to invest so much effort to make women attracted to us, and again, it always has to do with a performance, instead of being physically desirable. We always have to first prove our worth, because we can&#39;t score on other aspects like physical attractiveness.</p>\n\n<p>Does anyone share these feelings? Feel free to disagree!</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/p2zgan/are_men_just_less_physically_desirable_than_women/",
  "subreddit": "TooAfraidToAsk",
  "id": "p2zgan",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I don't know how to formulate it, but I have had the lifelong impression that\nthe only way to be desired and valued as a man is to have a functional value,\nlike a tool in a toolbox.\n\nExcept that, we aren't really that much desirable. Or at least I feel, we have\nto invest so much effort to make women…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "何と言っていいのかわかりませんが、私には生涯、次のような印象があります。\n男としての価値を求められるには、機能的な価値を持つことが必要です。\n道具箱の中の道具のように。\n\nただし、実際にはそれほど望ましいものではありません。というか、少なくとも私はそう感じています。\n女性のために多くの努力をしなければならないと感じています。",
      "title": "男性は女性よりも肉体的に魅力がないだけなのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道该如何表述，但我一生的印象就是\n作为一个男人，要想被人需要和重视，唯一的办法就是要有功能价值。\n就像工具箱中的一个工具。\n\n只是，我们其实并没有那么多可取之处。或者至少我觉得，我们必须\n投入如此多的努力来使女性...",
      "title": "男人在生理上是否比女人更不受欢迎？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道該如何表述，但我一生的印象就是\n作爲一個男人，要想被人需要和重視，唯一的辦法就是要有功能價值。\n就像工具箱中的一個工具。\n\n只是，我們其實並沒有那麼多可取之處。或者至少我覺得，我們必須\n投入如此多的努力來使女性...",
      "title": "男人在生理上是否比女人更不受歡迎？"
    }
  ]
}