{
  "author": "Public_Mayonnaise672",
  "original_created_utc": 1639320159,
  "title": "Is it common for adults to have no friends?",
  "created_utc": 1639336390,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had a friendship group in school, but after going to different universities we all grew apart. At university I only made one really good friend who I keep in contact with over social media, although she lives a long way away now. &lt;/p&gt;\n\n&lt;p&gt;Currently, I have an amazing fiancé and a great job, however all the other people at work are old and I wouldn’t call them friends. I would say I have no friendship group at all.&lt;/p&gt;\n\n&lt;p&gt;How do people even make friends these days? I find myself very jealous of my fiancé who has a group of friends he games with, and it just hit me, am I just going to live the rest of my life without friends? &lt;/p&gt;\n\n&lt;p&gt;Anyone else struggle with making friends as an adult?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/TooAfraidToAsk/comments/reqclq/is_it_common_for_adults_to_have_no_friends/",
  "subreddit": "TooAfraidToAsk",
  "id": "reqclq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had a friendship group in school, but after going to different universities we\nall grew apart. At university I only made one really good friend who I keep in\ncontact with over social media, although she lives a long way away now.\n\nCurrently, I have an amazing fiancé and a great job, however all…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "学生時代には仲良しグループがありましたが、別々の大学に進学してからは\nということです。大学では、本当に仲の良い友人が一人できただけで、その友人とは今でも交流があります。\n彼女は遠方に住んでいますが、SNSで連絡を取っています。\n\n現在、私は素晴らしい婚約者と素晴らしい仕事に恵まれていますが、すべての...",
      "title": "大人になっても友達がいないというのはよくあることですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在学校有一个友谊小组，但在进入不同的大学后，我们\n都渐渐疏远了。在大学里，我只交了一个真正的好朋友，我通过社交媒体与她保持联系。\n虽然她现在住在很远的地方，但我还是通过社交媒体与她保持联系。\n\n目前，我有一个很好的未婚夫和一份很好的工作，然而，所有这些都是在我的生活中发生的。",
      "title": "成年人没有朋友的情况是否很普遍？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在學校有一個友誼小組，但在進入不同的大學後，我們\n都漸漸疏遠了。在大學裏，我只交了一個真正的好朋友，我通過社交媒體與她保持聯繫。\n雖然她現在住在很遠的地方，但我還是通過社交媒體與她保持聯繫。\n\n目前，我有一個很好的未婚夫和一份很好的工作，然而，所有這些都是在我的生活中發生的。",
      "title": "成年人沒有朋友的情況是否很普遍？"
    }
  ]
}