{
  "author": "soxfoxrox",
  "the_new_excerpt": "I was wondering if anyone had any interesting stories of bag holding. Was it\nworth it to hold on or do you wish you cut your losses?\n\nI was and somewhat still am bullish on a bioplastics company Danimer Scientific\n(DNMR*).\n\nI bought in three different times, but my cost basis is around $38 to date.…",
  "original_created_utc": 1619393413,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "誰かバッグホールドの面白い話を知っている人はいないかな？それは\nそれとも損切りしたほうがよかったと思いますか？\n\n私はバイオプラスチック企業であるDanimer Scientific (DNMR*)に強気であったし、今でもそうである。\n(DNMR*)に強気でいました。\n\n3回に分けて購入したが、私のコストベースは38ドル程度である。....",
      "title": "募集中です。バッグを持った時のエピソード"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在想，如果有人有任何关于持袋的有趣故事。这是否\n是值得坚持下去还是希望减少损失？\n\n我过去和现在都看好一家生物塑料公司Danimer Scientific\n(DNMR*)。\n\n我在三个不同的时间买入，但我的成本基础约为38美元，至今....。",
      "title": "征求意见。持袋的故事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在想，如果有人有任何關於持袋的有趣故事。這是否\n是值得堅持下去還是希望減少損失？\n\n我過去和現在都看好一家生物塑料公司Danimer Scientific\n(DNMR*)。\n\n我在三個不同的時間買入，但我的成本基礎約爲38美元，至今....。",
      "title": "徵求意見。持袋的故事"
    }
  ],
  "title": "Wanted: Stories of bag holding",
  "created_utc": 1619448441,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I was wondering if anyone had any interesting stories of bag holding. Was it worth it to hold on or do you wish you cut your losses?</p>\n\n<p>I was and somewhat still am bullish on a bioplastics company Danimer Scientific (<strong>DNMR</strong>*).</p>\n\n<p>I bought in three different times, but my cost basis is around $38 to date. It ran all the way up to $64, but has plummeted to $23 after bad press (WSJ article) and a short campaign (Spruce Point Capital).</p>\n\n<p>I’m thinking I’ll hopefully make the money “lost” back in the next two years, as I think it’s over sold currently. This has always been a five year min play for me, however, the amount of bad press does worry me. Anyone have any words of wisdom?</p>\n</div><!-- SC_ON -->",
  "score": 56,
  "permalink": "/r/stocks/comments/mykgkq/wanted_stories_of_bag_holding/",
  "subreddit": "stocks",
  "id": "mykgkq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776215990
}