{
  "author": "LonelyAirport8833",
  "original_created_utc": 1654870978,
  "title": "How do I shop for groceries?",
  "created_utc": 1654880965,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;19yo who is moving out and will have to start shopping for herself + roommates, but doesn’t know how to.&lt;/p&gt;\n\n&lt;p&gt;SECOND EDIT: wow, thank you so so much everyone, I really didn’t expect this to blow up! I’m reading through all the comments right now but unfortunately I start a 6+ hour shift in a few minutes and cannot answer them all. I’ve seen so much helpful advice that I genuinely wouldn’t have thought of on my own, my phone is now filled with screenshots haha. You’ve all been a really big help and now I feel less anxious about going grocery shopping :)&lt;/p&gt;\n\n&lt;p&gt;And to the occasional assholes in here… you clearly don’t belong on this sub, and I hope you get removed &amp;lt;3&lt;/p&gt;\n\n&lt;p&gt;EDIT: I came to this subreddit because I assumed everyone answering would be nice, but clearly some of you don’t belong here. It’s called “too afraid to ask” for a reason and some of you really just made a point about why I was afraid to ask.&lt;/p&gt;\n\n&lt;p&gt;Some of us didn’t have parents who taught us how to do things. I’m really happy that some of you did, but others weren’t so lucky. There’s lots of shit I had to learn all on my own and that’s already embarrassing enough, you don’t need to be an asshole and rub salt in the wound.&lt;/p&gt;\n\n&lt;p&gt;To everyone who took the time out of their day to try and help, tysm, I really appreciate it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 537,
  "permalink": "/r/TooAfraidToAsk/comments/v98w74/how_do_i_shop_for_groceries/",
  "subreddit": "TooAfraidToAsk",
  "id": "v98w74",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "19yo who is moving out and will have to start shopping for herself + roommates,\nbut doesn’t know how to.\n\nSECOND EDIT: wow, thank you so so much everyone, I really didn’t expect this to\nblow up! I’m reading through all the comments right now but unfortunately I\nstart a 6+ hour shift in a few…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "引っ越すので、自分の分とルームメイトの分の買い物を始めなければならない19歳。\nでもどうしたらいいかわからない。\n\n2回目の編集：わあ、みなさん本当にありがとうございます！これが爆発的に売れるとは本当に思っていませんでした。\nを読んでいます。今、すべてのコメントに目を通しているのですが、残念ながら私は\nあと少しで6時間以上の勤務が始まるので...。",
      "title": "食料品の買い物はどうすればよいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "19岁的她要搬出去，要开始为自己和室友买东西。\n但不知道该怎么做。\n\n第二次编辑：哇，非常感谢大家，我真的没有想到这个问题会\n炸开了锅! 我现在正在阅读所有的评论，但不幸的是我\n我现在正在阅读所有的评论，但不幸的是，我马上就要开始一个6个多小时的轮班......",
      "title": "我如何购买食品杂货？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "19歲的她要搬出去，要開始爲自己和室友買東西。\n但不知道該怎麼做。\n\n第二次編輯：哇，非常感謝大家，我真的沒有想到這個問題會\n炸開了鍋! 我現在正在閱讀所有的評論，但不幸的是我\n我現在正在閱讀所有的評論，但不幸的是，我馬上就要開始一個6個多小時的輪班......",
      "title": "我如何購買食品雜貨？"
    }
  ]
}