{
  "author": "wists",
  "original_created_utc": 1636580424,
  "title": "Well I just lost 3 hours staring at charts, how's your life going?",
  "created_utc": 1636591401,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I learnt nothing, btw.</p>\n\n<p>I saw things slipping on a couple of alts I was in and thought this was a good time to attempt &#39;day trading&#39;. I sold a couple of times and bought a few more; I watched the trades fill up the screen and the upticks and the downticks diligently. </p>\n\n<p>I checked multiple different sites, and compared their prices; I drew lines and hovered over the long green sticks and the longer red ones. I made and cancelled multiple buy and sell orders, and finally felt comfortable in letting some of them go through...I was a man with a plan, the trading wizard.</p>\n\n<p>I made $5...</p>\n</div><!-- SC_ON -->",
  "score": 259,
  "permalink": "/r/CryptoCurrency/comments/qr4xlw/well_i_just_lost_3_hours_staring_at_charts_hows/",
  "subreddit": "CryptoCurrency",
  "id": "qr4xlw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I learnt nothing, btw.\n\nI saw things slipping on a couple of alts I was in and thought this was a good\ntime to attempt 'day trading'. I sold a couple of times and bought a few more; I\nwatched the trades fill up the screen and the upticks and the downticks\ndiligently.\n\nI checked multiple different…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は何も学びませんでした。\n\n自分がやっていたいくつかのアルトで状況が悪化しているのを見て、これは「デイトレード」に挑戦する良い機会だと思いました。\nデイトレード」を試みるには良い機会だと思いました。何度か売って、何度か買いました。\nトレードが画面いっぱいに表示され、アップティックとダウンティックを熱心に見ました。\n熱心に見ていました。\n\n私は複数の異なる...",
      "title": "私は3時間もチャートを見ていましたが、あなたの人生はどうですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我什么也没学到。\n\n我看到我所在的几个分身的情况在下滑，认为这是个好机会\n试试 \"日间交易 \"的好时机。我卖了几次，又买了几次；我\n我看着交易填满屏幕，看着上升和下降的趋势\n勤奋地观察。\n\n我检查了多个不同的...",
      "title": "我刚刚花了3个小时盯着图表看，你的生活怎么样了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我什麼也沒學到。\n\n我看到我所在的幾個分身的情況在下滑，認爲這是個好機會\n試試 \"日間交易 \"的好時機。我賣了幾次，又買了幾次；我\n我看着交易填滿屏幕，看着上升和下降的趨勢\n勤奮地觀察。\n\n我檢查了多個不同的...",
      "title": "我剛剛花了3個小時盯着圖表看，你的生活怎麼樣了？"
    }
  ]
}