{
  "author": "partymsl",
  "original_created_utc": 1651956922,
  "title": "About one year ago Dogecoin hit 0.70 USD. Now it's about 80% lower. Showing that profit taking is not wrong either sometimes.",
  "created_utc": 1651998760,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Going back one year. Crypto is in it full &amp;quot;mania&amp;quot; stage as the rise of meme coins takes place lead by the godfather of memes, Dogecoin itself. Dogecoin hits about 0.70 crossing the magical 0.69 mark. It&amp;#39;s just complete doge hype all over the internet. Investors are already seeing the 1$ mark in front of their eyes.&lt;/p&gt;\n\n&lt;p&gt;Here we are one year later. Since then DOGE only was in a downtrend from 0.70$ to 0.12$. Reasons are the overall Crypto dump but also fading interest and hype in the crypto itself. Which they are even trying to tackle right now with actual development and a roadmap. But this is not about doge. This is about not being too overconfident with your investment.&lt;/p&gt;\n\n&lt;p&gt;Being to overconfident will lead you to the blinded HODL. While holding may be a very good strategy in crypto its not always. Some cryptos rise others disappear you have to look into the market to know where your investments are heading.&lt;/p&gt;\n\n&lt;p&gt;If your crypto look weak over the longterm you should take the profit or if your crypto has done an unsustainable pump you should take a profit. Taking profit is not bad, it&amp;#39;s smart and wise, also you always have the option to buy low afterwards.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 324,
  "permalink": "/r/CryptoCurrency/comments/ukm6l2/about_one_year_ago_dogecoin_hit_070_usd_now_its/",
  "subreddit": "CryptoCurrency",
  "id": "ukm6l2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Going back one year. Crypto is in it full \"mania\" stage as the rise of meme\ncoins takes place lead by the godfather of memes, Dogecoin itself. Dogecoin hits\nabout 0.70 crossing the magical 0.69 mark. It's just complete doge hype all over\nthe internet. Investors are already seeing the 1$ mark in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "1年前に遡る。ミームコインの台頭により、暗号通貨は完全に「マニア」状態になっています。\nミームコインの名付け親であるDogecoinを筆頭に、ミームコインが台頭してきました。Dogecoinは\n0.69の大台を超え、0.70を記録。ネット上では完全にDogecoinの宣伝が行われています。\nインターネット上で大騒ぎです。投資家はすでに1ドルの大台を目前にしている...",
      "title": "約1年前、Dogecoinは0.70米ドルを記録しました。今は約80％下がっています。利益確定も時には間違っていないことを示しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "回到一年前。随着纪念币的兴起，加密货币正处于全面 \"狂热 \"阶段。\n纪念币的兴起，由纪念币教父Dogecoin本身引领。多格币达到\n0.70左右，超过了神奇的0.69大关。互联网上到处都是对狗币的炒作。\n互联网上的炒作。投资者已经看到了1美元的大关，在...",
      "title": "大约一年前，Dogecoin达到0.70美元。现在它降低了约80%。表明获利回吐有时也是没有错的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "回到一年前。隨着紀念幣的興起，加密貨幣正處於全面 \"狂熱 \"階段。\n紀念幣的興起，由紀念幣教父Dogecoin本身引領。多格幣達到\n0.70左右，超過了神奇的0.69大關。互聯網上到處都是對狗幣的炒作。\n互聯網上的炒作。投資者已經看到了1美元的大關，在...",
      "title": "大約一年前，Dogecoin達到0.70美元。現在它降低了約80%。表明獲利回吐有時也是沒有錯的。"
    }
  ]
}