{
  "author": "milonuttigrain",
  "original_created_utc": 1637446241,
  "title": "I do a full analysis: 03 DCA methods (regular vs 2 F&G index-adjusted plans). Using real data to test theories \"Timing the market vs Time in the market\" & \"Be greedy when others are fearful\". A $10/day plan since Feb 2018 is now $89,522. The verdict? Regular plan: 545%. Plan A: 535%. Plan B: 626%.",
  "created_utc": 1637494399,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I love data and very curious to what extent how the common saying like &quot;Time in the market beats timing in the market&quot; and &quot;Be greedy when others are fearful and vice versa&quot; are true. I also want to see the power of a DCA plan. Imagine just putting $10 a day for a couple of years and see the exponential growth. This analysis will test all of these theories using quite a popular market indicator - Fear &amp; Greed index. Please note that the oldest data for this index I could find is from 01 Feb 2018 - long enough to see how it goes.</p>\n\n<p><strong>1. A regular $10 a day DCA plan into Bitcoin - return 545%</strong></p>\n\n<p>This plan is to purchase $10 worth of Bitcoin daily regardless of market sentiment, spending $13,880 across 3 years and 10 months so far. You can see the growth of the portfolio overtime.</p>\n\n<p><a href=\"https://preview.redd.it/64x4csepnt081.png?width=1000&amp;format=png&amp;auto=webp&amp;s=a6e78d31a84435b2958caf5b7ee0d917417dd3dc\">As we can see, the power of regularity, capital gains and compounding effect have turned a vanilla $10 a day BTC DCA plan into almost $90,000.</a></p>\n\n<p>I have done a similar plan for S&amp;P500 and the portfolio is worth around $20,500.</p>\n\n<p><strong>2. Attempt to time the market using the Fear &amp; Greed index - plan A</strong></p>\n\n<p>This method also runs on the basis of a DCA plan, but adjusts the DCA day. It skips the day when the Fear &amp; Greed index shows &quot;Extreme Greed&quot;, &quot;Greed&quot; or &quot;Neutral&quot;. Underspent amounts are accumulated and purchases resume immediately when the market returns to &quot;Fear&quot;. The daily spending is still $10 and total spending would be the same, $13,880.</p>\n\n<p>For example, consider the following 7 days:</p>\n\n<p><a href=\"https://preview.redd.it/wnbyndt1ot081.png?width=832&amp;format=png&amp;auto=webp&amp;s=99a29b07babfdf76be95fab1d92298795c5d246e\">This is an attempt to time the market, \\&quot;be greedy when others are fearful and be fearful when others are greedy\\&quot;. Sounds legit, right? But does that work like that? Let&#39;s see.</a></p>\n\n<p>Ironically this adjusted plan has lower returns than a vanilla, simple DCA original plan. </p>\n\n<p><a href=\"https://preview.redd.it/48msrdrcot081.png?width=916&amp;format=png&amp;auto=webp&amp;s=8547fd3a3b04830bffa5385be2839b9f212f38f1\">Marked difference could only be visually noticeable since Jan 2021</a></p>\n\n<p>You may ask why? Two things I can think of: (1) the F&amp;G index is not perfect and (2) this method lacks regularity, even though the total sum remains the same. More on that when we draw a conclusion.</p>\n\n<p><strong>3. Attempt to time the market AND maintain regularity - plan B</strong></p>\n\n<p>This method keeps the regularity of a DCA plan by not skipping any day. The amount of daily is directly correlated with the Fear &amp; Greed index. In a nutshell, we buy more when the market is &quot;fearful&quot; and we buy less when the market is &quot;greedy&quot;. If it&#39;s greed (69) we will buy $100 - $69 = $31; if it&#39;s fear (31) we will buy $100 - $31 = $69. Amounts will be adjusted to compare with plan A.</p>\n\n<p>For example, consider the following 7 days:</p>\n\n<p><a href=\"https://preview.redd.it/lrj1nsmkot081.png?width=631&amp;format=png&amp;auto=webp&amp;s=de4b1ff497b8f8da4d4cf43d79ae9e74c4334405\">https://preview.redd.it/lrj1nsmkot081.png?width=631&amp;format=png&amp;auto=webp&amp;s=de4b1ff497b8f8da4d4cf43d79ae9e74c4334405</a></p>\n\n<p>The verdict?</p>\n\n<p><a href=\"https://preview.redd.it/xn52p6loot081.png?width=1066&amp;format=png&amp;auto=webp&amp;s=d569eb09e7763d6b128c6744fdba2cd9d4089ae7\">This duo purpose plan returns higher yields than both the vanilla plan and plan A. This is because it maintains the regularity of DCA, but also take advantage of the market sentiment indicator. This plan could grab more units on the \\&quot;cheaper\\&quot; side.</a></p>\n\n<p><strong>4. Summary</strong></p>\n\n<ul>\n<li>The original vanilla DCA plan represents <em>&quot;time in the market&quot;</em> in a pure sense. Plan A attempts to <em>&quot;time the market&quot;</em>. Plan B is duo purpose, it ensures both <em>&quot;time in the market&quot;</em> and <em>&quot;timing the market&quot;</em> factors.</li>\n<li>Plan B beats the vanilla plan, while plan A ironically returns the lowest. </li>\n<li><strong><em>&quot;Time in the market vs Timing the market&quot;</em></strong>: <strong>Regularity</strong> is the key here, plan A&#39;s flaw is that it skips the purchases when the market is greedy, assuming the market sentiment indicates &quot;overpriced unit&quot;. </li>\n<li>The common saying <strong><em>&quot;Be gready when others are fearful and vice versa&quot;</em></strong> should be actioned with a grain of salt. Say it in a different way, a $12,996 Bitcoin on 26-Jun-2019 would be considered &quot;very expensive&quot;, corresponding to the highest Fear &amp; Greed index ever (95). But $13,000 BTC would be a steal now! Plan A missed this.</li>\n<li>Another reason would be the index itself being imperfect. This index is calculated using a range of factors, but not all of them can react to the market volatility immediately. Intraday movements are wild in crypto market, but this index is only calculated once a day. 15 minutes of browsing the daily would probably be a better indicator.</li>\n<li>Potentially <strong>the best method</strong> would be: <strong>maintain a regular vanilla DCA plan</strong>, but at the same time put aside an <strong>&quot;accumulated funds&quot;</strong> when the flash crash happens.</li>\n<li>This is the classic: <strong>DCA + buy the dip</strong>. Why not both? Time in the market + Timing the market.<br/></li>\n</ul>\n\n<p><strong>Trivia:</strong></p>\n\n<ul>\n<li><em>Bitcoin price data is taken from CoinGecko, whereas the Fear &amp; Greed index is provided by Alternative Me. I run an excel sheet to calculate the unit and accumulated units through out 1,388 days. The portfolio value is dynamic.</em></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/dkkwwchfpt081.png?width=1222&amp;format=png&amp;auto=webp&amp;s=3fc59b0ce9bf0f3b60f5e85bc2e47307518319c8\">https://preview.redd.it/dkkwwchfpt081.png?width=1222&amp;format=png&amp;auto=webp&amp;s=3fc59b0ce9bf0f3b60f5e85bc2e47307518319c8</a></p>\n\n<ul>\n<li><em>Since 01-Feb-2018, the market has been fearful &amp; extremely fearful for 773 days; neutral for 129 days; greedy &amp; extremely greedy for 486 days. You can see the most fearful day and the most greedy days below.</em></li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/4gfy2zsnpt081.png?width=683&amp;format=png&amp;auto=webp&amp;s=3541a3a8b21d7900804c0165369965fbf250cd0e\">https://preview.redd.it/4gfy2zsnpt081.png?width=683&amp;format=png&amp;auto=webp&amp;s=3541a3a8b21d7900804c0165369965fbf250cd0e</a></p>\n\n<p>I tried my best to ensure the results are error free. This doesn&#39;t take into account fee or passive income from 3rd party such as Binance Earn (Bitcoin is a PoW coin). Any suggestions please advise me. Thank you.</p>\n</div><!-- SC_ON -->",
  "score": 158,
  "permalink": "/r/CryptoCurrency/comments/qyg3lq/i_do_a_full_analysis_03_dca_methods_regular_vs_2/",
  "subreddit": "CryptoCurrency",
  "id": "qyg3lq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I love data and very curious to what extent how the common saying like \"Time in\nthe market beats timing in the market\" and \"Be greedy when others are fearful\nand vice versa\" are true. I also want to see the power of a DCA plan. Imagine\njust putting $10 a day for a couple of years and see the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はデータが大好きで、「Time in the market beats timing in the market」や「Be greedy when others fearful」のような一般的な言葉がどの程度有効なのか興味があります。\n市場での時間が市場でのタイミングに勝る」や「他の人が恐れているときに貪欲になれ、その逆もまた然り」といった\nその逆も然りです。また、DCAプランの力を見てみたいと思います。想像してみてください。\n一日10ドルを数年間続けて、その結果を見てみましょう。",
      "title": "私は完全な分析を行います：03 DCA法（通常のプランと2つのF&G指数調整プラン）。実際のデータを使って、「市場のタイミングを計る vs 市場にいる時間」と「他の人が恐れているときに貪欲になる」という理論を検証しています。2018年2月以降の1日10ドルのプランが8万9522ドルに。評決は？通常のプランです。545%. プランA：535％。プランB：626％。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我喜欢数据，并且非常好奇，像 \"时间在哪里 \"这样的俗语在多大程度上被应用到了我们的工作中。\n市场中的时间胜过市场中的时机 \"和 \"在别人恐惧的时候要贪婪，反之亦然 \"这样的俗语是真的吗？\n反之亦然 \"的说法是真的。我还想看看DCA计划的力量。想象一下\n每天投入10美元，持续数年，看看......",
      "title": "我做了一个全面的分析：03个DCA方法（常规与2个F&G指数调整的计划）。用真实的数据来检验 \"把握市场时机与市场中的时间 \"和 \"在别人恐惧的时候要贪婪 \"的理论。自2018年2月以来，一个10美元/天的计划现在是89,522美元。判决结果？普通计划。545%. A计划：535%。B计划：626%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我喜歡數據，並且非常好奇，像 \"時間在哪裏 \"這樣的俗語在多大程度上被應用到了我們的工作中。\n市場中的時間勝過市場中的時機 \"和 \"在別人恐懼的時候要貪婪，反之亦然 \"這樣的俗語是真的嗎？\n反之亦然 \"的說法是真的。我還想看看DCA計劃的力量。想象一下\n每天投入10美元，持續數年，看看......",
      "title": "我做了一個全面的分析：03個DCA方法（常規與2個F&G指數調整的計劃）。用真實的數據來檢驗 \"把握市場時機與市場中的時間 \"和 \"在別人恐懼的時候要貪婪 \"的理論。自2018年2月以來，一個10美元/天的計劃現在是89,522美元。判決結果？普通計劃。545%. A計劃：535%。B計劃：626%。"
    }
  ]
}