{
  "author": "DaddySkates",
  "original_created_utc": 1635020657,
  "title": "I admit that I don't really care for tech in crypto... I just want to get out of poverty",
  "created_utc": 1635064351,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I trust in the technology. I am astonished by what it offers. I look forward to where it will take us. But the real reason that I started to invest into crypto isn&#39;t anything like that.</p>\n\n<p>I simply want to be able to enjoy life instead of working my ass off just to be left with few tenners at the end of month and my kids bugging me to go to a trip somewhere. It&#39;s depressing because I try hard and still cant see myself truly enjoying life regardless of how much hours I put in. I started to invest because I wanted to have fun with my two kids and to see them grow into a good adults. I want to spend all my time I have left on earth with them and not slave at some crappy minimum pay job.</p>\n\n<p>I don&#39;t care for the tech really. I just hope that the decision to invest in crypto will one day pave the way for my kids future and also allow me to spend more time with them.</p>\n\n<p>What about you? Are you in for the technology that crypto offers us or are you here because of different reasons?</p>\n</div><!-- SC_ON -->",
  "score": 157,
  "permalink": "/r/CryptoCurrency/comments/qecr6b/i_admit_that_i_dont_really_care_for_tech_in/",
  "subreddit": "CryptoCurrency",
  "id": "qecr6b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I trust in the technology. I am astonished by what it offers. I look forward to\nwhere it will take us. But the real reason that I started to invest into crypto\nisn't anything like that.\n\nI simply want to be able to enjoy life instead of working my ass off just to be\nleft with few tenners at the end…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "技術を信じています。この技術がもたらすものには驚かされます。どこに連れて行ってくれるのか\n私たちをどこへ連れて行ってくれるのか楽しみです。しかし、私が暗号に投資し始めた本当の理由は、そのようなものではありません。\nそんなことはありません。\n\n私は単に、一生懸命働いて最後に数十ドルしか残らないような人生ではなく、人生を楽しみたいのです。\n人生を楽しみたいのです。",
      "title": "確かに私は暗号の技術には興味がありません...。私はただ、貧困から抜け出したいのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我相信这项技术。我对它所提供的东西感到惊奇。我期待着\n它将把我们带到哪里。但我开始投资加密货币的真正原因是\n并不是这样的。\n\n我只是希望能够享受生活，而不是拼命工作，只是为了\n最后只剩下几分钱......",
      "title": "我承认我并不真正关心加密货币的技术... 我只想摆脱贫困"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信這項技術。我對它所提供的東西感到驚奇。我期待着\n它將把我們帶到哪裏。但我開始投資加密貨幣的真正原因是\n並不是這樣的。\n\n我只是希望能夠享受生活，而不是拼命工作，只是爲了\n最後只剩下幾分錢......",
      "title": "我承認我並不真正關心加密貨幣的技術... 我只想擺脫貧困"
    }
  ]
}