{
  "author": "usmc0428",
  "original_created_utc": 1627992454,
  "title": "Just bought Bitcoin using a Bitcoin ATM",
  "created_utc": 1628080883,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I normally DCA Bitcoin but when I was pumping gas at a Circle K yesterday I saw a Bitcoin of America ATM and had some extra cash and figured I&#39;d give it a try. The only identifying information you had to enter was a phone number and birthday. It texted a confirmation code. So I guess if you had a burner phone and entered a fake birthday you could buy it non-KYC. The fees were really steep. I put in $285 and got $239 worth of Bitcoin.  The way the QR code scanner was angled made it impossible to scan so I had to enter my wallet address manually. Another downside is you don&#39;t get a transaction ID  so you can&#39;t track it on the memory. Bitcoin was in my wallet within 15 mins and of course went home and transferred to my hardware wallet. </p>\n\n<p>All in all it was a cool thing to buy Bitcoin with physical fiat but I won&#39;t be doing it again. Fees are way to high.</p>\n</div><!-- SC_ON -->",
  "score": 272,
  "permalink": "/r/Bitcoin/comments/ox23gf/just_bought_bitcoin_using_a_bitcoin_atm/",
  "subreddit": "Bitcoin",
  "id": "ox23gf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I normally DCA Bitcoin but when I was pumping gas at a Circle K yesterday I saw\na Bitcoin of America ATM and had some extra cash and figured I'd give it a try.\nThe only identifying information you had to enter was a phone number and\nbirthday. It texted a confirmation code. So I guess if you had a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "普段はDCAのビットコインを使っていますが、昨日サークルKでガソリンを入れていた時に、Bitcoin of AmericaのATMを見ました。\nビットコインオブアメリカのATMを見て、現金が余っていたので試してみようと思いました。\n入力しなければならない個人情報は、電話番号と誕生日だけでした。\n誕生日です。確認コードがテキストで送られてきました。つまり、もしあなたが...",
      "title": "ビットコインATMでビットコインを購入したところ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我通常使用DCA比特币，但昨天我在Circle K加油时，看到一个美国比特币自动提款机。\n一个美国比特币自动取款机，有一些额外的现金，我想我要试一试。\n你唯一需要输入的身份信息是电话号码和\n生日。它发了一个确认码。所以我想如果你有一个...",
      "title": "刚刚用比特币ATM机买了比特币"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我通常使用DCA比特幣，但昨天我在Circle K加油時，看到一個美國比特幣自動提款機。\n一個美國比特幣自動取款機，有一些額外的現金，我想我要試一試。\n你唯一需要輸入的身份信息是電話號碼和\n生日。它發了一個確認碼。所以我想如果你有一個...",
      "title": "剛剛用比特幣ATM機買了比特幣"
    }
  ]
}