{
  "author": "MichKOG",
  "the_new_excerpt": "First of all, I want to start by saying that some hedge funds are shady fucks.\nThere are a lot of things they did illegal. Here are a few examples:\n\nhttps://www.investopedia.com/articles/investing/101515/3-biggest-hedge-fund-scandals.asp\n\nNow I want to address some of the misconceptions that new…",
  "original_created_utc": 1612048609,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我想先说，有些对冲基金是黑幕。\n他们做的很多事情都是违法的。下面是几个例子。\n\nhttps://www.investopedia.com/articles/investing/101515/3-biggest-hedge-fund-scandals.asp\n\n现在我想说说一些误区，新...",
      "title": "关于市场的常见误解"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我想先說，有些對沖基金是黑幕。\n他們做的很多事情都是違法的。下面是幾個例子。\n\nhttps://www.investopedia.com/articles/investing/101515/3-biggest-hedge-fund-scandals.asp\n\n現在我想說說一些誤區，新...",
      "title": "關於市場的常見誤解"
    }
  ],
  "title": "Common misconceptions about markets",
  "created_utc": 1612065638,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First of all, I want to start by saying that some hedge funds are shady fucks. There are a lot of things they did illegal. Here are a few examples:</p>\n\n<p><a href=\"https://www.investopedia.com/articles/investing/101515/3-biggest-hedge-fund-scandals.asp\">https://www.investopedia.com/articles/investing/101515/3-biggest-hedge-fund-scandals.asp</a></p>\n\n<p>Now I want to address some of the misconceptions that new traders have about the markets.</p>\n\n<ol>\n<li><strong>I was not allowed to buy shares on RH they wanted to drive the price down!?</strong></li>\n</ol>\n\n<p>DTCC, the clearinghouse for WeBull, RHand other brokerages, recently raised the collateral requirements for GameStop transactions to nearly 100%.</p>\n\n<p>When RH takes a buy order it goes to it&#39;s clearinghouse to exchange it&#39;s clients money for shares. The shares are immediately and conveniently transferred to the client, but the funds aren’t transferred for 2 days. There&#39;s this gap between the broker and the clearinghouse for these unsettled trades that the clearinghouse will require some cash upfront (margin) for but otherwise accepts exposure for the rest.</p>\n\n<p>If the stock being bought is extremely volatile, expensive and has a huge amount of recent volume and therefore unsettled trades, the clearinghouse will eventually realize they are floating quite a lot more to the broker than they are comfortable with on the back of a very risky equity. GME fits all these characteristics. It&#39;s this point in the GME scenario where DTCC sets margin requirements to 100%. They tell their brokers, &quot;Hey if you want to get GME stock from us, we will not accept your word that this trade will settle in two days. Instead we need the money upfront since we are already way too exposed to this one ticker from you.&quot;</p>\n\n<p>Now, if RH wants to continue filling buy orders for it&#39;s clients it needs to come up with ALL the money for each trade. RH does not have nearly enough cash on hand to handle this, hence the recent draw down from of RH&#39;s credit lines as they try to get enough liquidity to keep buying shares for their clients. Eventually the brokers just don&#39;t have enough cash, throw in the towel and stop accepting buy orders until they can settle more trades or the clearinghouses release the margin requirements for these stocks.</p>\n\n<p>The concept that RH would fuck over basically their entire user base on purpose to help a minority investor&#39;s minority investment in a hedge fund that already closed their fucking short position doesn&#39;t stand up to even the smallest amount of scrutiny. It&#39;s just a boring case of the market plumping going wild because it&#39;s not built to handle pumps of this scale.</p>\n\n<p><strong>2. But I was allowed to sell!</strong></p>\n\n<p>Of course you were. Selling is exiting an already created position. The liability that RH would get if you were not able to sell and the price went down would be insane. They can not stop you from selling an asset that you own. They can, however, block the purchasing of new assets through their platform.</p>\n\n<p><strong>3. But Fidelity and ThinkorSwim allowed people to buy and sell.</strong></p>\n\n<p>Thinkorswim and Fidelity own their own clearing houses and have enough shares to satisfy the orders. Also, they do not need to pay collateral since they are a clearing house.</p>\n\n<p><strong>4. Okay, but what about the 120% short interest, Melvin will be closing their position soon, and a short squeeze will happen.</strong></p>\n\n<p>Melvin already closed their position. There was enough volume for them to do so.</p>\n\n<p>The short interest are just estimations. Short interest information gets released on 15th and 30th of each month. Next week we will be able to see the short positions.</p>\n\n<p>Hedge funds keep taking short positions and are much better prepared for now, because there is more money to be made on riding a stock down to 40 from 400, then from 5 to 1.</p>\n\n<p>Many hedge funds are also riding the wave up, and have long positions in GME. Blackrock, one of the biggest money managers already made insane profit, and will probably ride this on a way down.</p>\n\n<p><strong>5. But a short squeeze will happen!</strong></p>\n\n<p>It could, or it could not. The interest in not high to a point were they will go bankrupt or have to buy back the shares to cover. They can comfortably hold for 6-12 month as long as they don’t get margin called, which I don’t expect them too, tbh. The payoff makes sense, think about it this way. The interest is I think 30% yearly. Let’s say you short a billion dollars worth GME. You pay annual interest of 30-40%. Hedge funds definitely have enough money to pay that 300 million a year. Now, let’s say in a year a price goes down from 400 to 40. A fund will make essentially 900 million dollars minus the interest fee and etc. it is a no brainer for some bigger funds to take this position and enjoy their easy 40% profit.</p>\n\n<p>Considering many funds have insane amounts of collateral, they will not get margin called from this.</p>\n\n<p><strong>6. But if options expire in the money they have to sell their shares!</strong></p>\n\n<p>A lot of options expired ITM on Friday, so why did the price not go up?</p>\n\n<p>Well, how many retail investors that were holding their options actually had enough money to buy 100 shares at a strike price? Not too many.</p>\n\n<p><strong>7. Okay, but Hedge funds are still bad and evil!</strong></p>\n\n<p>Sure, I agree. Some are. Some hedge funds get their funding from managing pensions and endowments funds.</p>\n\n<p><strong>8. But Citadel was manipulating the markets!</strong></p>\n\n<p>Citadel and Citadel securities are two separate LLCs. They are only allowed to open long positions, they can not short a stock. One is a market maker that processes option orders and has no say in the markets. In fact, the more volume there is, the more money they make on the spreads. Would jot be surprised if Citadel made a lot of money on market making in the past week.</p>\n\n<p><strong>9. But Hedge funds are insane investors with 50% annual return.</strong></p>\n\n<p>Not necessarily true, an average hedge fund has been underperforming for the past 20 years. You probably had better returns then them just by investing in index funds. Don&#39;t get me wrong, a lot of smart people work in the funds, but their main goal is to hedge, in other words, be safe from market movements in any direction.</p>\n\n<p><strong>TL;DR</strong></p>\n\n<p>Hedge funds are bad, but they are not retarded (except for Melvin, who overextends on a short at $5)</p>\n\n<p>But many of the rules that came in play were written decades ago, they were not take from thin air. Because against hedge funds is good, but throwing different theories that will be easily disapproved once they file 13F will not take them down. Knowing how markets work, and being vigilant is how you make more money than hedge funds.</p>\n</div><!-- SC_ON -->",
  "score": 577,
  "permalink": "/r/investing/comments/l8yi83/common_misconceptions_about_markets/",
  "subreddit": "investing",
  "id": "l8yi83",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534773
}