{
  "author": "JaysReddit33",
  "original_created_utc": 1639404988,
  "title": "Getting vaccinated today?",
  "created_utc": 1639411208,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m getting the Pfizer vaccine today, and my mother is freaking our on me saying I&amp;#39;m going to die, and that I&amp;#39;ll get severe heart problems etc. I know theres a chance that can happen, but nowhere online can I find an actual percentage on the chances of vaccine complications, does anyone have the statistics on those? Just fyi I&amp;#39;m 18 years old and relatively healthy, I was also wondering what effects did you all have afterwards as well, and if any severely or moderately affected you.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/rfgowf/getting_vaccinated_today/",
  "subreddit": "TooAfraidToAsk",
  "id": "rfgowf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm getting the Pfizer vaccine today, and my mother is freaking our on me saying\nI'm going to die, and that I'll get severe heart problems etc. I know theres a\nchance that can happen, but nowhere online can I find an actual percentage on\nthe chances of vaccine complications, does anyone have the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、ファイザー社のワクチンを接種するのですが、母は私にこう言ってビクビクしています。\n私は死んでしまう、ひどい心臓病になるなどと言われています。その可能性があることは知っています。\nしかし、ネットで調べても実際の割合がわからない。\nワクチンの合併症の可能性について、どなたかご存知の方はいらっしゃいますか？",
      "title": "今日、予防接種を受けますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今天要接种辉瑞公司的疫苗，而我的母亲却对我大发雷霆，说我将会死去，并说我将会有严重的心脏病等。\n我快要死了，而且会有严重的心脏问题等等。我知道有可能\n我知道这有可能发生，但我在网上找不到关于疫苗并发症的实际百分比。\n疫苗并发症的几率，有人知道吗？",
      "title": "今天要接种疫苗吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今天要接種輝瑞公司的疫苗，而我的母親卻對我大發雷霆，說我將會死去，並說我將會有嚴重的心臟病等。\n我快要死了，而且會有嚴重的心臟問題等等。我知道有可能\n我知道這有可能發生，但我在網上找不到關於疫苗併發症的實際百分比。\n疫苗併發症的幾率，有人知道嗎？",
      "title": "今天要接種疫苗嗎？"
    }
  ]
}