{
  "author": "based-vent-account",
  "original_created_utc": 1644712146,
  "title": "Do normal people just...not think about suicide as a solution to their problems?",
  "created_utc": 1644723174,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Disclaimer: I am currently not suicidal and am working on getting help for my issues.&lt;/p&gt;\n\n&lt;p&gt;A few weeks ago, I was talking to a friend about my problems and he said something like &amp;quot;the only thing you can do is keep going,&amp;quot; which is objectively false because dead people do not suffer. Is suicide so taboo and unthinkable that people like my friend simply don&amp;#39;t think of it as an option on the table, or do normal people not discuss it because they are afraid of accidentally encouraging suicide?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/sr5h45/do_normal_people_justnot_think_about_suicide_as_a/",
  "subreddit": "TooAfraidToAsk",
  "id": "sr5h45",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Disclaimer: I am currently not suicidal and am working on getting help for my\nissues.\n\nA few weeks ago, I was talking to a friend about my problems and he said\nsomething like \"the only thing you can do is keep going,\" which is objectively\nfalse because dead people do not suffer. Is suicide so taboo…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "免責事項：私は現在、自殺願望はなく、自分のために助けを求めているところです。\nの問題です。\n\n数週間前、友人に自分の問題について話していたところ、彼はこう言いました。\n続けるしかない」というようなことを言っていましたが、これは客観的に見て\n死んだ人は苦しまないので、嘘です。自殺はそんなにタブーなのでしょうか・・・。",
      "title": "普通の人は...悩みの解決に自殺は考えないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "免责声明：我目前没有自杀倾向，正在努力为我的问题寻求帮助。\n问题。\n\n几周前，我和一个朋友谈起我的问题，他说\n他说：\"你唯一能做的就是继续前进。\n这在客观上是错误的，因为死人是不会痛苦的。自杀是如此禁忌...",
      "title": "正常人只是......不考虑把自杀作为解决问题的方法吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "免責聲明：我目前沒有自殺傾向，正在努力爲我的問題尋求幫助。\n問題。\n\n幾周前，我和一個朋友談起我的問題，他說\n他說：\"你唯一能做的就是繼續前進。\n這在客觀上是錯誤的，因爲死人是不會痛苦的。自殺是如此禁忌...",
      "title": "正常人只是......不考慮把自殺作爲解決問題的方法嗎？"
    }
  ]
}