{
  "author": "SweetPie123",
  "the_new_excerpt": "When I got into cryptocurrency late 2014 the community on Reddit/Twitter was\nalways talking about how their coins could change the world for the better. I\nbought my first Bitcoin because I believed their narrative about how crypto\ncould revolutionize the world being anonymous (BTC was anonymous at…",
  "original_created_utc": 1614697539,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "当我在2014年底进入加密货币时，Reddit/Twitter上的社区是\n总是在说他们的钱币如何能让世界变得更好。I\n我买了我的第一个比特币，因为我相信他们的说法，关于加密技术如何\n可以彻底改变世界是匿名的（BTC是匿名的，在...。",
      "title": "还有人真正关心加密货币吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我在2014年底進入加密貨幣時，Reddit/Twitter上的社區是\n總是在說他們的錢幣如何能讓世界變得更好。I\n我買了我的第一個比特幣，因爲我相信他們的說法，關於加密技術如何\n可以徹底改變世界是匿名的（BTC是匿名的，在...。",
      "title": "還有人真正關心加密貨幣嗎？"
    }
  ],
  "title": "Does anyone still actually care about Cryptocurrency?",
  "created_utc": 1614717276,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>When I got into cryptocurrency late 2014 the community on Reddit/Twitter was always talking about how their coins could change the world for the better. I bought my first Bitcoin because I believed their narrative about how crypto could revolutionize the world being  anonymous (BTC was anonymous at that time) and censorship resistant. </p>\n\n<p>Nowadays I almost never see that spirit around anymore, most coin-specific subreddits evolved into circlejerking cults without allowing any form of criticism. Around here it&#39;s almost solely price talk or price related talk, without any actual discussion about how the tech and its implications can change the world for the better.  Just looking at the top posts now; one is about a shitty Youtuber, another about owning more crypto, another one about making sick gains. Where are the heated discussions about why coin &quot;X&quot; is superior to coin &#39;&#39;Y&#39;&#39;? Are we all just here wanting to be rich and sell our coins to the next bagholder wanting to be rich?</p>\n\n<p>I know it&#39;s not just &#39;about the tech&#39; as everyone hopes that their coins appreciates in value, but does anyone actually still care about Cryptocurrency or have we evolved to the &#39;number go up&#39; mindset running for the next coin with good pumpamentals completely?</p>\n</div><!-- SC_ON -->",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/lw40ya/does_anyone_still_actually_care_about/",
  "subreddit": "CryptoCurrency",
  "id": "lw40ya",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738019
}