{
  "author": "Accomplished-Design7",
  "original_created_utc": 1634353107,
  "title": "I am finally almost green, I first entered crypto during 64K BTC and it is one amazing roller coaster",
  "created_utc": 1634373585,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First joined the crypto space during BTC 64K and boy was that a tough ride down, but thanks to this sub and the people here I have learnt to HODL and that my emotions are what will get me in trouble. So I held through my first great fall and it was definitely horrifying. </p>\n\n<p>I am glad I stuck through as my ATH purchases will finally break even. Worry not, I am a sane individual and did DCA in but it is an amazing feeling to see I am finally back where I started. After the experience, my first fall and soldiering through I have come to an understanding of why people absolutely love the bear and the dips. Thinking back, I struck luck to be able to buy some BTC at 28K, 30K and 35K. No one knows if we will be able to see BTC at that price again but I for one am remarkably content to have bought them at that price when we are finally closing in 64K BTC. </p>\n\n<p>For those of you who held like me kudos to you and thanks for HODLing together that made it a lot easier. </p>\n\n<p>Crypto is definitely a great place for an adrenaline junkie like moi.</p>\n</div><!-- SC_ON -->",
  "score": 185,
  "permalink": "/r/CryptoCurrency/comments/q93hn2/i_am_finally_almost_green_i_first_entered_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "q93hn2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First joined the crypto space during BTC 64K and boy was that a tough ride down,\nbut thanks to this sub and the people here I have learnt to HODL and that my\nemotions are what will get me in trouble. So I held through my first great fall\nand it was definitely horrifying.\n\nI am glad I stuck through…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTC 64Kの時に初めて暗号化空間に参加しましたが、その時は大変な思いをしました。\nしかし、このサブサイトとここの人々のおかげで、私はHODLを学びました。\n感情が私を苦しめることを学びました。私は初めての大きな落下を経験しました。\nそれは確かに恐ろしいものでした。\n\nでも、それを乗り越えられたことが嬉しいです。",
      "title": "私は64K BTCの時に初めて暗号化に参入しましたが、それは素晴らしいジェットコースターのようなものです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在BTC 64K期间第一次加入加密货币领域，那是一个艰难的旅程。\n但多亏了这个网站和这里的人们，我学会了HODL和我的\n情绪会让我陷入困境。因此，我坚持了我的第一次大跌\n这绝对是个可怕的过程。\n\n我很高兴我坚持了下来...",
      "title": "我终于快绿了，我第一次进入加密货币是在64K BTC期间，它是一个惊人的过山车。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在BTC 64K期間第一次加入加密貨幣領域，那是一個艱難的旅程。\n但多虧了這個網站和這裏的人們，我學會了HODL和我的\n情緒會讓我陷入困境。因此，我堅持了我的第一次大跌\n這絕對是個可怕的過程。\n\n我很高興我堅持了下來...",
      "title": "我終於快綠了，我第一次進入加密貨幣是在64K BTC期間，它是一個驚人的過山車。"
    }
  ]
}