{
  "author": "Spreizbacken",
  "original_created_utc": 1634659344,
  "title": "Baware of Nexo! I did a research on them and here are some red flags.",
  "created_utc": 1634686715,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A lot of questions came up recently on this sub about Nexo, mostly people having trouble withdrawing their money from Nexo or having their accounts frozen, so I decided to dig up some stuff on them.</p>\n\n<p>I’ll try to keep it short and simple so it’s easier to read. Much more info on Google if anyone is willing to search from here on. Here it goes.</p>\n\n<p>Nexo is a bulgarian crypto ‘’sort of’’ a bank/lender, founded by Trenchev (ex-politician) and Kunchev (co-founder of Credissimo, important later). Nexo, as we know it today is the second company, in 2018 there was ‘’NexoBank’’ which was operating outside regulations of the Bulgarian legislation and was later taken down.</p>\n\n<p>Here&#39;s what I found out on them.</p>\n\n<p>- Unregulated banking operations.<br/>\nNexo pays more than average for the crypto market percentage APY in lending, borrowing, yield farming, etc., also gives out loans in stable coins, making them a bank by operation but not a bank by definition. Nexo doesn’t have a bank license in Bulgaria and is operating in the gray area.</p>\n\n<p>- $0 to $52.2m – to this day nobody know where they got the initial funding. LATER they listed the Nexo security token and claimed that funding came from investors buying the token. Dates suggest otherwise. The Bulgarian Nexo company doesn’t list any annual reports, it’s all on the off-shore Nexo companies in the Caymans.</p>\n\n<p>- ‘’Powered by Credissimo’’, one of the founders – Kunchev is also a co-founder of Credissimo – ‘’quick’’ loans to the poorest people in the county with insanely high % in returns, famous for making it ‘’dumb and easy’’ for a person to take a loan through their phone app directly from home. Operating right on the edge of regulations. Many people lost their homes to them.<br/>\nLater, Nexo removed the Credissimo part and now claim they have nothing to do with them.</p>\n\n<p>- Nexo Inc., AG, OU, LLC and so on. Nexo’s team is in Bulgaria, but their companies are registered in many countries, some in off-shore zones. Nexo Capital Inc. – Caymans, Nexo A.G – Marshall Islands, they also have companies in the UK, Estonia, Lithuania and so on…</p>\n\n<p>All of those are now under the hat of Nexo Inc., registered on the Cayman Islands.</p>\n\n<p>Nexo doesn&#39;t have office addresses and telephone numbers.</p>\n\n<p>- July 2021 – big case against Nexo. The problem - Customers were convinced they were signing a contract with the main Nexo company, but when shit hits the fan it turned out it’s some other company in the Caymans, Nexo claimed that those companies had nothing to do with each other and those people had no reason to sue the Nexo company in Bulgaria, because they haven’t signed with them. Technically they were right, but people still got left on the losing side of this.</p>\n\n<p>- The Estonia job – in 2018 Nexo Services OU (Estonia) offered a service to create crypto wallets for their customers and swap between Fiat and stables. In 2019 Estonian Financial Inspection came out with a report grouping together Nexo and Credissimo for illegal operations in Estonia, taking out both their financial institution licences and basically banning them from operation.</p>\n\n<p>- Change of whitepaper.</p>\n\n<p>At first Nexo claimed that customers that took out loans kept custody of their crypto. This changes right after the 12-13 March Corona crash, when Nexo liquidated a lot of loans which turned out to be ‘’bad’’.<br/>\nIn the old Whitepaper, customers crypto enters Nexo as a ‘’pledge’’ and customers remain their custody on the crypto, but the company can sell it IF there is a breach of contract. In the later change the customers crypto goes directly in custody of Nexo.<br/>\nAccording to former employees this was done so the company can do whatever they want with the customers crypto from day 1.</p>\n\n<p>Old whitepaper: doc droid . net /CD JEM jJ/cred it-fac ility -m aster- agree me nt-nexo io-pdf</p>\n\n<p>New whitepaper: do cd roi d. net /nv za Ts k/ne xo-w hite paper -ori gina l-pdf</p>\n\n<p>- The Chainlink fraud – I’ll link it below. Long story short – July 2020 Nexo signed an agreement to operate with LINK loans. Zeus Capital, created days before the report came out spreaded FUD about Chainlink, mailed directly to people who had relations with Nexo. Under this huge manipulation the price dropped significantly, only to come back up much higher later. Reddit and Twitter users found Nexo links in the report code. The name ‘’Simeon’’, pointing to Simeon Rusanov (Nexo, head of research) came out aswell.</p>\n\n<p>According to former employees Nexo had longs/shorts on LINK at that point in time. (info from capital.bg investigation on Nexo)</p>\n\n<p>Link for the Zeus Capital report: doc d roi d. net/ Q0 SnR0j/ the-c hainli nk-fr aud-expo sed-pdf</p>\n\n<p>- Nexo – XRP Ripple case. This is a long one, so I’ll just link it. Many more articles, google if interested.</p>\n\n<p>Basically they screwed over their customers and are now dodging bullets with the ‘’this Nexo company is not one of our Nexo companies’’.</p>\n\n<p>new s. bit coin. com/ nex o-sued -liqu idati on-x rp-sec -rippl e-laws uit/</p>\n\n<p>- The is -n exo -sa fe .c om  website. Hard to say for sure who is the creator of it, but if you scroll down to the comments it gets reaaaally interesting.</p>\n\n<p>I am not here to say Nexo is a scam, but I would advice people to pick something else for their crypto adventures.</p>\n\n<p>This post took me quite some time and I do think it’s valuable information.<br/>\nSorry for the spacebars in the links, it&#39;s the only way this wont get autodeleted by the reddit bot.</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/CryptoCurrency/comments/qbel5k/baware_of_nexo_i_did_a_research_on_them_and_here/",
  "subreddit": "CryptoCurrency",
  "id": "qbel5k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "A lot of questions came up recently on this sub about Nexo, mostly people having\ntrouble withdrawing their money from Nexo or having their accounts frozen, so I\ndecided to dig up some stuff on them.\n\nI’ll try to keep it short and simple so it’s easier to read. Much more info on\nGoogle if anyone is…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、このサブサイトでNexoについて多くの質問が寄せられています。\nネクソからお金を引き出せなかったり、口座を凍結されたりした人が多かったので、私は\nそこで、Nexoについて調べてみました。\n\n読みやすいように、短くシンプルにまとめてみます。より多くの情報は\nもし誰かが...Google",
      "title": "ネクソのバウェア! 私は彼らについて調べましたが、ここにいくつかの赤旗があります。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近有很多关于Nexo的问题出现在这个子网站上，主要是人们在从Nexo提现时遇到了麻烦，或者是在提现时遇到了困难。\n从Nexo取钱有困难，或者他们的账户被冻结，所以我决定挖掘一些关于他们的信息。\n所以我决定挖出一些关于他们的资料。\n\n我将尽量保持简短，这样更容易阅读。更多的信息在\n谷歌，如果有人想...",
      "title": "Baware of Nexo! 我对他们进行了研究，这里有一些红旗。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近有很多關於Nexo的問題出現在這個子網站上，主要是人們在從Nexo提現時遇到了麻煩，或者是在提現時遇到了困難。\n從Nexo取錢有困難，或者他們的賬戶被凍結，所以我決定挖掘一些關於他們的信息。\n所以我決定挖出一些關於他們的資料。\n\n我將盡量保持簡短，這樣更容易閱讀。更多的信息在\n谷歌，如果有人想...",
      "title": "Baware of Nexo! 我對他們進行了研究，這裏有一些紅旗。"
    }
  ]
}