{
  "author": "Set1Less",
  "original_created_utc": 1645393199,
  "title": "Credit Suisse whistleblower leak: Bank facilitated $80 BN money laundering for Human traffickers, drug dealers and murderers. Actual criminals continue to launder via the largest banks, but you be damned if you earn a little bit of spare income in crypto",
  "created_utc": 1645403751,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A whistleblower has leaked account data from Credit Suisse, which shows that some of the most notorious criminals across the world maintain accounts with the bank, including alleged human traffickers, Venezuela officials who looted the country at the same time the people there faced massive inflation, and a billionaire who ordered girlfriend’s murder. &lt;/p&gt;\n\n&lt;p&gt;The investigation: &lt;a href=\"https://www.occrp.org/en/suisse-secrets/historic-leak-of-swiss-banking-records-reveals-unsavory-clients\"&gt;https://www.occrp.org/en/suisse-secrets/historic-leak-of-swiss-banking-records-reveals-unsavory-clients&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;These are some of the clients of the bank described in the whistleblower article: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A Yemeni spy chief implicated in torture. The sons of an Azerbaijani strongman who rules a mountainous territory as his own private fiefdom. Bureaucrats accused of looting Venezuela’s oil wealth and hastening its descent into humanitarian crisis.&lt;/p&gt;\n\n&lt;p&gt;Credit Suisse’s clients included the family of an Egyptian intelligence chief who oversaw torture of terrorism suspects for the CIA; an Italian accused of laundering criminal funds for the infamous ‘Ndrangheta criminal group; a German executive who bribed Nigerian officials for telecoms contracts; and Jordan’s King Abdullah II, who held a single account worth 230 million Swiss francs ($223 million) at its peak, even as his country raked in billions in foreign aid.&lt;/p&gt;\n\n&lt;p&gt;Venezuelan elites accused of plundering the state oil firm funneled hundreds of millions of dollars into Credit Suisse accounts. The money flowed during a period when widespread looting from government coffers precipitated an economic collapse that has prompted six million people to flee the country and driven others into near starvation. The bank kept its Venezuelan clients’ accounts open even as global media exposed corruption cases against many of them.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;These kind of people have zero problems laundering their ill gotten wealth via the banking system, but damn if you earned more than $600 in staking rewards, you have to start reporting via Form 1099, if you spend $10k in crypto, it will have to be reported directly to the IRS. All these regulations and laws are put in place to track crypto because regulator and central bankers constantly attack crypto as a conduit for money laundering. However the biggest criminal enterprises solely rely on the banking system for laundering their funds.&lt;/p&gt;\n\n&lt;p&gt;Drug cartels or Venezuelan elites who looted their own government have no issues with KYC, but if you make a p2p or anonymous crypto transaction, you can risk your funds being locked!&lt;/p&gt;\n\n&lt;p&gt;The loops you have to go to have your crypto income accounted as a legitimate source of earning, only for those in the government to accuse crypto of facilitating money laundering, crimes and whatnot...&lt;/p&gt;\n\n&lt;p&gt;But when the actual allegations come out its invariably the central banking system that facilitates money transmission operations for some of the largest criminal enterprises in the world, including drug cartels and human rights abusers and corrupt rulers. &lt;/p&gt;\n\n&lt;p&gt;These are quotes from employees of Credit Suisse:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;“When someone wants to engage in money laundering after he loots assets of the country, for example, he needs to transfer the money. So holders of big accounts go directly to the very senior managers,” he said.&lt;/p&gt;\n\n&lt;p&gt;The system was based on plausible deniability, said former employees. Bankers are given strict rules, but the incentives are to ignore them.&lt;/p&gt;\n\n&lt;p&gt;“The bank’s compliance department are masters of plausible deniability,” the former senior manager said. “Never ask a question you do not want to know the answer to.”&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Other articles covering this leak: &lt;a href=\"https://www.nytimes.com/2022/02/20/business/credit-suisse-leak-swiss-bank.html\"&gt;https://www.nytimes.com/2022/02/20/business/credit-suisse-leak-swiss-bank.html&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 379,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?auto=webp&amp;s=2b1fce8e281dd9c1e2d9acca82118f92888c3c21",
          "width": 1920,
          "height": 1280
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=a426b88c049b7b6fbab7b9ede345ca1ec031d153",
            "width": 108,
            "height": 72
          },
          {
            "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=5f1c92093ff25b8e83c66e7c218d1eaac75fa069",
            "width": 216,
            "height": 144
          },
          {
            "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=8ffefa7f4d0fdcc65cbbaa0ea43c078e6bf2f6d8",
            "width": 320,
            "height": 213
          },
          {
            "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=4fee897449121a3ed52f2efe93de63af8d49c148",
            "width": 640,
            "height": 426
          },
          {
            "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=90c1e91b180a504fde1ce61a4993e5b394e215b6",
            "width": 960,
            "height": 640
          },
          {
            "url": "https://external-preview.redd.it/iXTNj6sLnOXCEjlCwimLMVUeSP68ATYhWSZVCADwYUk.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=6288b09a228b5cee1a2faeb8bc4c50821f8325f9",
            "width": 1080,
            "height": 720
          }
        ],
        "variants": {},
        "id": "ttIAxlQJ_5Tutwj702pjXgdSxJ0hqpAneMubgqDVTFc"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/CryptoCurrency/comments/sxc5di/credit_suisse_whistleblower_leak_bank_facilitated/",
  "subreddit": "CryptoCurrency",
  "id": "sxc5di",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A whistleblower has leaked account data from Credit Suisse, which shows that\nsome of the most notorious criminals across the world maintain accounts with the\nbank, including alleged human traffickers, Venezuela officials who looted the\ncountry at the same time the people there faced massive…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある内部告発者がクレディ・スイスの口座データを流出させたが、それによると\n世界で最も悪名高い犯罪者たちが、この銀行に口座を維持している。\n人身売買の容疑者やベネズエラの役人から略奪した人などです。\n国民が大規模な災害に見舞われたのと同じ頃、同国では...",
      "title": "クレディ・スイスの内部告発のリーク。人身売買、麻薬の売人、殺人犯のために800億ドルのマネーロンダリングを促進した銀行。実際の犯罪者は最大手銀行を経由して資金洗浄を続けているが、暗号で少しでも余裕のある収入を得ると呪われる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一名举报人泄露了瑞士信贷银行的账户数据，其中显示\n世界上一些最臭名昭著的犯罪分子在该银行开有账户。\n其中包括被指控的人口贩子、在委内瑞拉人民面临灾难时掠夺该国的官员。\n在委内瑞拉人民面临巨大的经济压力的同时，这些官员还对该国进行掠夺。",
      "title": "瑞士信贷的告密者泄密。银行为人贩子、毒贩子和杀人犯的80 BN洗钱活动提供便利。实际的犯罪分子继续通过最大的银行进行洗钱，但如果你在加密货币中赚取一点闲置收入，你就会被诅咒。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一名舉報人泄露了瑞士信貸銀行的賬戶數據，其中顯示\n世界上一些最臭名昭著的犯罪分子在該銀行開有賬戶。\n其中包括被指控的人口販子、在委內瑞拉人民面臨災難時掠奪該國的官員。\n在委內瑞拉人民面臨巨大的經濟壓力的同時，這些官員還對該國進行掠奪。",
      "title": "瑞士信貸的告密者泄密。銀行爲人販子、毒販子和殺人犯的80 BN洗錢活動提供便利。實際的犯罪分子繼續通過最大的銀行進行洗錢，但如果你在加密貨幣中賺取一點閒置收入，你就會被詛咒。"
    }
  ]
}