{
  "author": "noshirtdude",
  "the_new_excerpt": "Hey all,\n\nAs the after hours are now closed, I can officially say I've made 181.43% gains\nfor about 7.1k in my first year investing. I wanted to thank you all who post on\nthis sub. I've never posted here, but I've been following for about 6-7 months,\nand most of my picks came from the detailed posts…",
  "original_created_utc": 1613182766,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大家好\n\n由于现在下班时间已经结束，我可以正式说我已经赚了181.43%的收益了。\n在我第一年投资的时候，赚了7.1k左右。我想感谢各位在\n这个子。我从来没有在这里发过帖子，但我已经关注了6-7个月了。\n我的大部分选择来自于详细的帖子... ...",
      "title": "第一年的投资回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好\n\n由於現在下班時間已經結束，我可以正式說我已經賺了181.43%的收益了。\n在我第一年投資的時候，賺了7.1k左右。我想感謝各位在\n這個子。我從來沒有在這裏發過帖子，但我已經關注了6-7個月了。\n我的大部分選擇來自於詳細的帖子... ...",
      "title": "第一年的投資回顧"
    }
  ],
  "title": "First year investing review",
  "created_utc": 1613190994,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hey all,</p>\n\n<p>As the after hours are now closed, I can officially say I&#39;ve made 181.43% gains for about 7.1k in my first year investing. I wanted to thank you all who post on this sub. I&#39;ve never posted here, but  I&#39;ve been following for about 6-7 months, and most of my picks came from the detailed posts I came across here. \nI started investing around this time last year as a recent unemployed college graduate (22 years old) putting in some of my Walmart paycheck every other week. Over the spring,I accepted a teaching job and have been able to increase my monthly contributions and have been loving the gains, although small in comparison to what I&#39;ve seen, that I&#39;ve been able to make.\nI know this was an extraordinary year, and I definitely shouldn&#39;t expect these kinds of returns yearly, but I&#39;m eager to see how my portfolio performs in the future!\nSo thanks again everyone for all the thoughtful posts, advice, and DD! And good luck to you all!!</p>\n</div><!-- SC_ON -->",
  "score": 270,
  "permalink": "/r/stocks/comments/liqzks/first_year_investing_review/",
  "subreddit": "stocks",
  "id": "liqzks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728623038
}