{
  "author": "raouldukesaccomplice",
  "the_new_excerpt": "Chilean equities are taking a big hit today after the country's voters\noverwhelmingly chose left-wing and independent candidates for the country's\nupcoming constitutional convention, rather than those favored by the ruling\ncenter-right government.\n\nMajor losers include Sociedad Química y Minera de…",
  "original_created_utc": 1621272353,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今日、チリの株式は大きな打撃を受けています。\nチリの有権者が、次期憲法制定会議の候補者として、与党の支持する候補者ではなく\n中道右派の政府が支持する候補者ではなく、左派や無所属の候補者を選んだことで\n中道右派の政府が支持する候補者ではなく、左派や無党派の候補者を選んだことを受けて、今日の株式は大きな打撃を受けた。\n\n主な下落銘柄は、Sociedad Química y Minera de...",
      "title": "世界最大のリチウム生産者であるソシエダ・キミカ・イ・ミネラ（SQM）は、チリの憲法選挙後に10％近く下落している"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在智利选民以压倒性优势选择左翼和独立候选人参加国家选举后，智利股市今天受到了很大的冲击。\n该国选民以压倒性优势选择了左翼和独立候选人参加该国即将举行的宪法大会。\n宪会议，而不是执政的中右翼政府所青睐的候选人。\n中右翼政府青睐的候选人。\n\n主要输家包括Sociedad Química y Minera de...",
      "title": "世界最大的锂生产商Sociedad Química y Minera (SQM)在智利宪法选举后下跌了近10%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在智利選民以壓倒性優勢選擇左翼和獨立候選人蔘加國家選舉後，智利股市今天受到了很大的衝擊。\n該國選民以壓倒性優勢選擇了左翼和獨立候選人蔘加該國即將舉行的憲法大會。\n憲會議，而不是執政的中右翼政府所青睞的候選人。\n中右翼政府青睞的候選人。\n\n主要輸家包括Sociedad Química y Minera de...",
      "title": "世界最大的鋰生產商Sociedad Química y Minera (SQM)在智利憲法選舉後下跌了近10%。"
    }
  ],
  "title": "The world's largest lithium producer, Sociedad Química y Minera (SQM), is down nearly 10% after Chilean constitutional elections",
  "created_utc": 1621281670,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Chilean equities are taking a big hit today after the country&#39;s voters overwhelmingly chose left-wing and independent candidates for the country&#39;s upcoming constitutional convention, rather than those favored by the ruling center-right government.</p>\n\n<p>Major losers include Sociedad Química y Minera de Chile SA (SQM), the world&#39;s largest producer of lithium; Embotelladora Andina SA (AKO-A; AKO-B), one of South America&#39;s major Coca-Cola bottlers and distributors; electric company Enel (ENIC); and Banco Santander Chile (BSAC).</p>\n\n<p>Any new constitution proposed will have to be approved by voters in a referendum, likely sometime next year. If voters reject it, the present constitution, dating back to the era of dictator Augusto Pinochet, will remain in effect.</p>\n</div><!-- SC_ON -->",
  "score": 349,
  "permalink": "/r/investing/comments/nem9c3/the_worlds_largest_lithium_producer_sociedad/",
  "subreddit": "investing",
  "id": "nem9c3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803264
}