{
  "author": "Tezro128",
  "the_new_excerpt": "You know how you hear all of these reports on things like how we're making\nprogress with \"the first all-black baseball team\" or maybe \"how to help black\nowned businesses\"? Obviously I get that these are steps in the right direction,\nbut the way they're discussed just seems wrong. They talk about…",
  "original_created_utc": 1621018485,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例えば、「初の黒人野球チーム」ができたとか、「黒人支援の方法」がわかったとか......。\n初の黒人野球チーム」や「黒人経営者のビジネスを支援する方法」など、さまざまな報告がなされています。\nとか、「黒人経営者のビジネスを支援する方法」とかね。もちろん、これらが正しい方向へのステップであることは理解しています。\nしかし、それらの議論の仕方は間違っているように思えます。彼らが語るのは...",
      "title": "テレビでの黒人の扱いが人間離れしていると感じる人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你知道你是如何听到所有这些报告的吗？\n在 \"第一个全黑人棒球队 \"或 \"如何帮助黑人企业 \"方面取得进展？\n的企业\"？显然，我知道这些都是朝着正确方向迈出的步伐。\n但讨论这些的方式似乎是错误的。他们谈论的是...",
      "title": "还有人觉得电视上对黑人的处理方式很没有人情味吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你知道你是如何聽到所有這些報告的嗎？\n在 \"第一個全黑人棒球隊 \"或 \"如何幫助黑人企業 \"方面取得進展？\n的企業\"？顯然，我知道這些都是朝着正確方向邁出的步伐。\n但討論這些的方式似乎是錯誤的。他們談論的是...",
      "title": "還有人覺得電視上對黑人的處理方式很沒有人情味嗎？"
    }
  ],
  "title": "Anyone else find the treatment of black people on TV dehumanizing?",
  "created_utc": 1621039309,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>You know how you hear all of these reports on things like how we&#39;re making progress with &quot;the first all-black baseball team&quot; or maybe &quot;how to help black owned businesses&quot;? Obviously I get that these are steps in the right direction, but the way they&#39;re discussed just seems wrong. They talk about these achievements in a really similar way that they do to severely handicapped people (e.g. the special olympics). It&#39;s kinda difficult to describe it.</p>\n\n<p>And a lot of this stuff is being produced by whites, too. When I read some articles written by black people themselves, they tended to focus on what the person did, rather than the person themselves.</p>\n\n<p>In my opinion, it just comes off as racism with a new coat of paint. Can anyone relate?</p>\n</div><!-- SC_ON -->",
  "score": 127,
  "permalink": "/r/TooAfraidToAsk/comments/ncg232/anyone_else_find_the_treatment_of_black_people_on/",
  "subreddit": "TooAfraidToAsk",
  "id": "ncg232",
  "is_self": true,
  "media": null,
  "is_video": false
}