{
  "author": "TheBoyWithAName",
  "original_created_utc": 1632571827,
  "title": "Why the exhaust gas of a rocket engine (or a jet engine) flows faster when the cross section area of the exhaust nozzle increases?",
  "created_utc": 1632593151,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I was doing some personal study on thrust, and while reading about the convergent-divergent nozzle of a rocket engine, I read that when exhaust gas exiting the combustion chamber reaches Mach 1, the exhaust gas becomes compressible, and the velocity of compressible fluid (in this case the &gt;Mach 1 exhaust gas) is directly proportional to the cross section area of the nozzle.</p>\n\n<p>When we talk about the flow rate of a non-compressible fluid body through an pipe, we acknowledge that the velocity of the <strong>non-compressible</strong> fluid <strong>increases</strong> when the cross section area of the pipe <strong>decreases</strong>.</p>\n\n<p>So why, when a fluid turns from non-compressible to compressible, the rule of flow rate changes to the velocity of the <strong>compressible</strong> fluid <strong>increases</strong> when the cross section area of the pipe <strong>increases</strong>?</p>\n\n<p>What makes compressible fluid different than non-compressible fluid for such change in the rule of flow rate to happen?</p>\n</div><!-- SC_ON -->",
  "score": 132,
  "permalink": "/r/askscience/comments/pv5kfv/why_the_exhaust_gas_of_a_rocket_engine_or_a_jet/",
  "subreddit": "askscience",
  "id": "pv5kfv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I was doing some personal study on thrust, and while reading about the\nconvergent-divergent nozzle of a rocket engine, I read that when exhaust gas\nexiting the combustion chamber reaches Mach 1, the exhaust gas becomes\ncompressible, and the velocity of compressible fluid (in this case the >Mach…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "推力について個人的に勉強していたときに、ロケットエンジンの\nロケットエンジンの収束・発散ノズルについて読んでいると、燃焼室を出た排気ガスがマッハ1になると\n燃焼室を出た排気ガスがマッハ1になると、排気ガスは\n圧縮性流体の速度（ここではマッハ...",
      "title": "ロケットエンジン（またはジェットエンジン）の排気ガスは、排気ノズルの断面積が大きくなると、なぜ速く流れるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我正在做一些关于推力的个人研究，在阅读关于火箭发动机的会聚-发散喷嘴的文章时\n在阅读火箭发动机的聚合-发散喷嘴时，我读到，当排出燃烧室的废气达到\n燃烧室排出的废气达到1马赫时，废气就会变得可压缩。\n可压缩的，可压缩流体的速度（在这种情况下，>马赫...）。",
      "title": "为什么火箭发动机（或喷气发动机）的废气在排气管口的横截面积增加时流动更快？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我正在做一些關於推力的個人研究，在閱讀關於火箭發動機的會聚-發散噴嘴的文章時\n在閱讀火箭發動機的聚合-發散噴嘴時，我讀到，當排出燃燒室的廢氣達到\n燃燒室排出的廢氣達到1馬赫時，廢氣就會變得可壓縮。\n可壓縮的，可壓縮流體的速度（在這種情況下，>馬赫...）。",
      "title": "爲什麼火箭發動機（或噴氣發動機）的廢氣在排氣管口的橫截面積增加時流動更快？"
    }
  ]
}