{
  "author": "Origami_psycho",
  "original_created_utc": 1637675435,
  "title": "Is there any merit to the statement \"empires actually only last 250 years\"?",
  "created_utc": 1637693228,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently I&#39;ve seen a quote thrown around a lot that says that empires only last 250 years.  A bit of googling tell me that this is taken from a work published in 1978 called <em>The Fate of Empires and the Search for Survival</em>, by <a href=\"https://en.m.wikipedia.org/wiki/John_Bagot_Glubb\">Sir John Bagot Glubb</a>.  However he&#39;s not a formally educated historian and off hand I&#39;d say he was <em>somewhat</em> biased by the waning of the influence and prestige of the British Empire that he would&#39;ve experienced throughout his career in service to it.</p>\n\n<p>However, a quick flip through any encyclopedia would see me find many empires that lasted many centuries (Russian, Chinese, Roman, Japanese, etc.), so I&#39;m a bit skeptical of his claim holding water.</p>\n\n<p>So  the meat of my question is, is there actually support for the idea that &quot;Empires only last 250 years,&quot; or is it just pop history schlock?</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/AskHistorians/comments/r0dnwv/is_there_any_merit_to_the_statement_empires/",
  "subreddit": "AskHistorians",
  "id": "r0dnwv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently I've seen a quote thrown around a lot that says that empires only last\n250 years. A bit of googling tell me that this is taken from a work published in\n1978 called The Fate of Empires and the Search for Survival, by Sir John Bagot\nGlubb [https://en.m.wikipedia.org/wiki/John_Bagot_Glubb].…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、「帝国は250年しかもたない」という言葉をよく目にするようになりました。\n250年 ちょっとググってみると、これは1978年に出版された\nジョン・バゴット卿が1978年に発表した『帝国の運命と生存のための探求』という著作から引用されています。\nグラブ [https://en.m.wikipedia.org/wiki/John_Bagot_Glubb]....",
      "title": "帝国は実際には250年しか持たない」という言葉には何か意味があるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近，我看到有一句话被经常抛出，说帝国只能持续\n250年。在谷歌上搜索了一下，发现这句话出自1978年出版的一部作品，名为《帝国的命运》。\n1978年出版的《帝国的命运和生存的探索》，作者是约翰-巴戈特爵士。\nGlubb [https://en.m.wikipedia.org/wiki/John_Bagot_Glubb]....",
      "title": "\"帝国实际上只持续250年 \"的说法有什么道理吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近，我看到有一句話被經常拋出，說帝國只能持續\n250年。在谷歌上搜索了一下，發現這句話出自1978年出版的一部作品，名爲《帝國的命運》。\n1978年出版的《帝國的命運和生存的探索》，作者是約翰-巴戈特爵士。\nGlubb [https://en.m.wikipedia.org/wiki/John_Bagot_Glubb]....",
      "title": "\"帝國實際上只持續250年 \"的說法有什麼道理嗎？"
    }
  ]
}