{
  "author": "ORCoast19",
  "the_new_excerpt": "This small regional bank has some nice things going for it. They’ve consistantly\ngrown their business over the years. They’ve benefited in a positive way from\nthe PPP business loans, most of which won’t be paid down early as companies seek\nflexibility. They have a ~3% dividend, and typical issue a…",
  "original_created_utc": 1617851206,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この小さな地方銀行には、いくつかの良い点があります。長年にわたって安定的に\n何年もかけてビジネスを成長させてきました。この銀行は、PPPビジネスローンから良い恩恵を受けています。\nPPPビジネスローンの恩恵を受けていますが、企業が柔軟性を求めているため、そのほとんどが早期に返済されることはありません。\n柔軟性を求めているからです。また、3％程度の配当を行っており、一般的には1株当たり1,000円の配当を行っています。",
      "title": "LARKは良い買い物をしたと思う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这家小型区域性银行有一些不错的地方。他们一直以来\n多年来，他们的业务不断增长。他们从以下方面获得了积极的收益\n的PPP商业贷款，大部分不会提前还清，因为企业要寻求\n灵活性。他们有约3%的股息，典型的发行量为...",
      "title": "拉克似乎是个好买点"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這家小型區域性銀行有一些不錯的地方。他們一直以來\n多年來，他們的業務不斷增長。他們從以下方面獲得了積極的收益\n的PPP商業貸款，大部分不會提前還清，因爲企業要尋求\n靈活性。他們有約3%的股息，典型的發行量爲...",
      "title": "拉克似乎是個好買點"
    }
  ],
  "title": "LARK seems like a good buy",
  "created_utc": 1617876867,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This small regional bank has some nice things going for it. They’ve consistantly grown their business over the years. They’ve benefited in a positive way from the PPP business loans, most of which won’t be paid down early as companies seek flexibility. They have a ~3% dividend, and typical issue a 5% stock dividend each year. They have a price to earnings around 6 right now. They’re around the same stock price they were 3 years ago when they were making half as much annually. Finally, my personal favorite, I contacted their investor relations and the CFO emails me back with answers within 24 hours. I love small businesses where people wear multiple hats, and this place must have hired at least <em>one</em> guy who likes to work.</p>\n</div><!-- SC_ON -->",
  "score": 293,
  "permalink": "/r/investing/comments/mminfh/lark_seems_like_a_good_buy/",
  "subreddit": "investing",
  "id": "mminfh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566616793
}