{
  "author": "UrsanTemplar",
  "original_created_utc": 1633932091,
  "title": "What happened to the Japanese leftist movements of the late 60s/70s? Compared to then, why are Japanese youth today so much more apathetic and apolitical?",
  "created_utc": 1633993901,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Japan in the late 60s/70s had huge leftist protest movements by university students, some devolving into violence. These events left a indelible mark on Japanese culture and media at that time.</p>\n\n<p>But now, it seems Japanese youth are really apolitical and doesn&#39;t seem to have the same passion/energy of the 70s. Why did these leftist movements peter out, when their parents generation seemed so passionately into revolutionary ideals?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/q5ph6j/what_happened_to_the_japanese_leftist_movements/",
  "subreddit": "AskHistorians",
  "id": "q5ph6j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Japan in the late 60s/70s had huge leftist protest movements by university\nstudents, some devolving into violence. These events left a indelible mark on\nJapanese culture and media at that time.\n\nBut now, it seems Japanese youth are really apolitical and doesn't seem to have\nthe same passion/energy…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "日本では60年代後半から70年代にかけて、大学生による大規模な左翼的抗議運動がありました。\n暴力に発展することもありました。これらの出来事は、当時の日本の文化やメディアに忘れがたい足跡を残しました。\n当時の日本の文化やメディアに大きな影響を与えました。\n\nしかし今、日本の若者は本当に無関心で、同じ情熱やエネルギーを持っていないように見えます。\n同じ情熱やエネルギーを持っているようには見えませんが...。",
      "title": "60年代後半から70年代の日本の左翼運動はどうなったのか？当時と比べて、なぜ今の日本の若者は無気力で非政治的なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "日本在60年代末/70年代有大规模的大学生左派抗议运动。\n大学生的左派抗议运动，有些还演变成了暴力事件。这些事件给当时的日本文化和媒体留下了不可磨灭的印记\n在当时的日本文化和媒体上留下了不可磨灭的印记。\n\n但现在，日本的年轻人似乎真的不关心政治，似乎也没有\n同样的激情/活力...",
      "title": "60年代末/70年代的日本左派运动发生了什么？与那时相比，为什么今天的日本青年如此冷漠和不关心政治？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "日本在60年代末/70年代有大規模的大學生左派抗議運動。\n大學生的左派抗議運動，有些還演變成了暴力事件。這些事件給當時的日本文化和媒體留下了不可磨滅的印記\n在當時的日本文化和媒體上留下了不可磨滅的印記。\n\n但現在，日本的年輕人似乎真的不關心政治，似乎也沒有\n同樣的激情/活力...",
      "title": "60年代末/70年代的日本左派運動發生了什麼？與那時相比，爲什麼今天的日本青年如此冷漠和不關心政治？"
    }
  ]
}