{
  "author": "Orangey82",
  "original_created_utc": 1654588966,
  "title": "Arguments against \"back in the day people were tougher and smarter\" and the \"good times create weak men\" viewpoints?",
  "created_utc": 1654645022,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Some time ago i had a &amp;quot;conservative&amp;quot; classmate who used to talk about these types of views a lot and constantly argued that &amp;quot;people nowadays are dumber and weaker than people in the past&amp;quot; and seemed to believe the &amp;quot;weak men create hard times --&amp;gt; hard times create strong men&amp;quot; type view which i feel like is a huge simplification of history and is generally wrong.&lt;/p&gt;\n\n&lt;p&gt;What are some good arguments against and for both of these ideas?&lt;/p&gt;\n\n&lt;p&gt;edit: thanks for all the replies!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/v6puw9/arguments_against_back_in_the_day_people_were/",
  "subreddit": "askphilosophy",
  "id": "v6puw9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Some time ago i had a \"conservative\" classmate who used to talk about these\ntypes of views a lot and constantly argued that \"people nowadays are dumber and\nweaker than people in the past\" and seemed to believe the \"weak men create hard\ntimes --> hard times create strong men\" type view which i feel…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "以前、私の同級生に「保守派」がいて、この手の話をよくしていました。\nをよく話していて、「今の人間は昔の人間より頭が悪くて弱い」と主張し、「弱い人間が苦労をする\nと主張し、「弱者が苦難を生む→苦難が強者を生む」と信じているようでした。\nを信じ、「弱い人間が辛い時代を作る→辛い時代が強い人間を作る」的な考えを持っているようでした。",
      "title": "昔の人はもっとタフでスマートだった」「いい時代は弱い男を生む」という視点に対する反論？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "前段时间，我有一个 \"保守派 \"的同学，他经常谈论这些\n观点，并不断争辩说 \"现在的人比过去的人更笨、更弱\n现在的人比过去的人更笨、更弱\"，似乎相信 \"弱者创造了困难时期\n他似乎相信 \"弱肉强食 \"的观点，而我觉得...",
      "title": "反对 \"当年的人更强硬、更聪明 \"和 \"好时光造就弱者 \"观点的论点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "前段時間，我有一個 \"保守派 \"的同學，他經常談論這些\n觀點，並不斷爭辯說 \"現在的人比過去的人更笨、更弱\n現在的人比過去的人更笨、更弱\"，似乎相信 \"弱者創造了困難時期\n他似乎相信 \"弱肉強食 \"的觀點，而我覺得...",
      "title": "反對 \"當年的人更強硬、更聰明 \"和 \"好時光造就弱者 \"觀點的論點？"
    }
  ]
}