{
  "author": "chaosphoenix440",
  "the_new_excerpt": "Which of the following options are the best way to structure my brokerage\naccounts? I want to keep things simple - I am just starting out with investing.\n\nI was thinking the tax efficiency and ability to avoid wash sales would favor\noption 3, but what do you think? Main drawback is trying to retain…",
  "original_created_utc": 1621737291,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の証券会社の口座を構成するには、次のどのオプションが最適でしょうか？\nのか？私は物事をシンプルにしたいと思っています。私は投資を始めたばかりです。\n\n税務上の効率性とウォッシュセールを避けることができるという点で、選択肢3が有利だと考えていました。\nしかし、あなたはどう思いますか？主な欠点は...",
      "title": "課税口座と税優遇口座をどのように構成するか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "以下哪些选项是构建我的经纪业务的最佳方式\n帐户的最佳方式？我想保持简单的事情--我刚刚开始进行投资。\n\n我在想，税收效率和避免清洗销售的能力将有利于\n选项3，但你怎么看？主要的缺点是试图保留...",
      "title": "如何构建应税和税收优惠的账户？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下哪些選項是構建我的經紀業務的最佳方式\n帳戶的最佳方式？我想保持簡單的事情--我剛剛開始進行投資。\n\n我在想，稅收效率和避免清洗銷售的能力將有利於\n選項3，但你怎麼看？主要的缺點是試圖保留...",
      "title": "如何構建應稅和稅收優惠的賬戶？"
    }
  ],
  "title": "How to structure taxable and tax advantaged accounts?",
  "created_utc": 1621748991,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Which of the following options are the best way to structure my brokerage accounts? I want to keep things simple - I am just starting out with investing.</p>\n\n<p>I was thinking the tax efficiency and ability to avoid wash sales would favor option 3, but what do you think? Main drawback is trying to retain the domestic/international market cap balance, but that isn&#39;t really that hard to do. Hmm...</p>\n\n<p>I also like option 1 a lot (minus potential wash sale issues and loss of foreign tax credit), but if I decide I disagree with the VTWAX philosophy and want to tilt, it seems like it would be hard to re-balance. Then again, many would advise to never tilt! But, I think it is important to retain flexibility in taxable brokerage accounts because restructuring involves the risk of paying capital gains tax.</p>\n\n<p>For option 2, I could roll over my Roth IRA to Fidelity to use their funds (FZROX + FZILX) in the tax advantaged (to remove any potential wash sale issues) but keep VTSAX + VTIAX in the taxable.</p>\n\n<pre><code>Option 1:\nTaxable:         VTWAX\nTax Advantaged:  VTWAX\n\nOption 2:\nTaxable:         VTSAX + VTIAX\nTax Advantaged:  VTSAX + VTIAX (Maybe FZROX + FZILX to avoid wash sale...)\n\nOption 3:\nTaxable:         VTSAX + VTIAX\nTax Advantaged:  VTWAX\n\nOption 4:\nTaxable:         VTWAX\nTax Advantaged:  VTSAX + VTIAX\n</code></pre>\n</div><!-- SC_ON -->",
  "score": 41,
  "permalink": "/r/Bogleheads/comments/niy5gp/how_to_structure_taxable_and_tax_advantaged/",
  "subreddit": "Bogleheads",
  "id": "niy5gp",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387108
}