{
  "author": "002timmy",
  "original_created_utc": 1647480464,
  "title": "My Portfolio Has Gone From -48.6% All-Time to -43.3%. It’s Official, The Bull Run Is Back On",
  "created_utc": 1647491695,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;If you’ve paid attention to the market lately, you’ll notice that in the last day it’s up over 4%!! The is huge as it signifies market sentiment has completely changed. The S&amp;amp;P was up only 2.22% today on news of the fed hike, and since 4 is bigger than 2, I feel confident in saying we have officially decoupled from the stock market. &lt;/p&gt;\n\n&lt;p&gt;I know what you’re thinking- “4% in a day isn’t that big of a change.” And yes, I agree with you, but let’s imagine the market grows 4% everyday for the next year. Because crypto is a 24/7 market, we get 2 days over the stock market. 4% of compounding interest over 365 means $100 investment today could turn into $164,880,329 a year from today. Now that’s wife-changing money!&lt;/p&gt;\n\n&lt;p&gt;Why do I think this? Well, the fed stated will continue to increase rates over the next year. From that, I can deduce the market will increase at the same rate over the next year. &lt;/p&gt;\n\n&lt;p&gt;I can’t believe yesterday my wife was telling I was an idiot for losing half of our child’s college money on “magic internet money.” After I tell her that I’ve only lost 40% of the money, she’ll really be eating crow. &lt;/p&gt;\n\n&lt;p&gt;If you’re like me, you’ll know the bull run is back on. Take out a second mortgage on your home. Get as many personal loans as you can. Max out your credit cards on crypto. Your future self will thank you. &lt;/p&gt;\n\n&lt;p&gt;Do not do any research. This is financial advice.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 489,
  "permalink": "/r/CryptoCurrency/comments/tfylcy/my_portfolio_has_gone_from_486_alltime_to_433_its/",
  "subreddit": "CryptoCurrency",
  "id": "tfylcy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "If you’ve paid attention to the market lately, you’ll notice that in the last\nday it’s up over 4%!! The is huge as it signifies market sentiment has\ncompletely changed. The S&P was up only 2.22% today on news of the fed hike, and\nsince 4 is bigger than 2, I feel confident in saying we have…"
}