{
  "author": "love_is_bees",
  "original_created_utc": 1626079699,
  "title": "Why do animal adoption centers make people jump through hoops to get an animal, when the alternative is to throw less money at a pet store? Isn't making it hard to adopt pushing people towards pet stores?",
  "created_utc": 1626089278,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been trying to adopt a new bunny. I&#39;ve tried several shelters. All of them charge twice as much as a pet store (understandable as most are spade/neutered) require me to show my home, some maintain &quot;ownership&quot;, as legally questionable as that sounds, and one was rude as shit to me because my autistic dumbass said &quot;have&quot; instead of &quot;adopt&quot;. </p>\n\n<p>I have a beautiful home, my two rabbits are healthy and have the entire house, see a vet twice a year and get nothing but fresh vegetables and hey. But both my bunnies are store bought. I walked in with cash, walked out with rabbit, no questions asked.</p>\n\n<p>I&#39;d be a great candidate for adoption, but contacting and trying to set something up with shelters is so hard I am considering just buying another rabbit. I told myself I&#39;d adopt from here on out, but this is so stressful. Maybe it&#39;s stressful because I&#39;m autistic, but buying a pet at the store has never been hard, so there&#39;s something going on.</p>\n\n<p>Don&#39;t adoption shelters want animals to be adopted? Why be so controlling if the alternative is going to a pet store or euthanizing the animal? And if animal shelters need to do these steps by law, then why not apply those same laws to pet stores? </p>\n\n<p>I just want to give a bunny a good home without all the scrutiny and invasiveness. :(</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/TooAfraidToAsk/comments/oind2d/why_do_animal_adoption_centers_make_people_jump/",
  "subreddit": "TooAfraidToAsk",
  "id": "oind2d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been trying to adopt a new bunny. I've tried several shelters. All of them\ncharge twice as much as a pet store (understandable as most are spade/neutered)\nrequire me to show my home, some maintain \"ownership\", as legally questionable\nas that sounds, and one was rude as shit to me because my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "新しいうさぎを飼おうとしています。いくつかのシェルターに行ってみましたが どの施設も\nペットショップの2倍の料金を請求される（ほとんどが避妊・去勢されているので理解できる）。\n家を見せる必要があったり、法的に問題のある「所有権」を維持するところもあります。\nまた、あるシェルターでは、私の...という理由で、とても失礼な態度をとられました。",
      "title": "ペットショップに行けばお金はかからないのに、なぜ動物の里親募集センターでは動物を手に入れるために様々な苦労を強いられるのでしょうか？養子縁組が難しくなると、人々はペットショップに流れてしまうのではないでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直想收养一只新的兔子。我已经尝试了几个收容所。所有的收容所\n收费是宠物店的两倍（可以理解，因为大多数都是铲除/绝育的）。\n要求我展示我的家，有些还保持 \"所有权\"，这在法律上是有问题的。\n而其中一家对我很粗鲁，因为我的...",
      "title": "为什么动物收养中心要让人们跳过重重障碍才能得到一只动物，而另一种选择是在宠物店扔下更少的钱？让人难以领养，不是把人们推向宠物店吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直想收養一隻新的兔子。我已經嘗試了幾個收容所。所有的收容所\n收費是寵物店的兩倍（可以理解，因爲大多數都是剷除/絕育的）。\n要求我展示我的家，有些還保持 \"所有權\"，這在法律上是有問題的。\n而其中一家對我很粗魯，因爲我的...",
      "title": "爲什麼動物收養中心要讓人們跳過重重障礙才能得到一隻動物，而另一種選擇是在寵物店扔下更少的錢？讓人難以領養，不是把人們推向寵物店嗎？"
    }
  ]
}