{
  "author": "stennk",
  "original_created_utc": 1648816524,
  "title": "Why would anyone comply with the new Crypto regulations?",
  "created_utc": 1648845682,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;As an outsider to the EU, Canada, India or wherever else unfair Crypto regulations are trying or have passed already I really don&amp;#39;t get why would anyone abide by these laws. &lt;/p&gt;\n\n&lt;p&gt;Crypto provides many means to stay anonymous, and the whole point is decentralization, why would you not just use this instead of complying. &lt;/p&gt;\n\n&lt;p&gt;I get the rule of law argument, but do we just say A-OK to everything just because politicians said so.&lt;/p&gt;\n\n&lt;p&gt;This is a genuine question, not trying to make a point or anything I just want to see the perspective of people who are actually going to play by the bs rules.&lt;/p&gt;\n\n&lt;p&gt;Edit: Thanks for the awards&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 313,
  "permalink": "/r/CryptoCurrency/comments/ttpm01/why_would_anyone_comply_with_the_new_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "ttpm01",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "As an outsider to the EU, Canada, India or wherever else unfair Crypto\nregulations are trying or have passed already I really don't get why would\nanyone abide by these laws.\n\nCrypto provides many means to stay anonymous, and the whole point is\ndecentralization, why would you not just use this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EU、カナダ、インド、またはどこの不公平なCryptoの部外者として\n規制をしようとしている、あるいは既に通過している。\nこのような法律に従う人はいません。\n\n暗号は匿名性を保つための多くの手段を提供しますし、要は\n分散化、なぜこれを利用しないのか...。",
      "title": "なぜCryptoの新規制を遵守するのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为欧盟、加拿大、印度或其他任何地方不公平的加密货币的局外人。\n的法规，我真的不明白为什么有人会\n有人遵守这些法律。\n\nCrypto提供了许多保持匿名的手段，而整个要点是\n去中心化，你为什么不直接使用这个...",
      "title": "为什么有人会遵守新的加密货币法规？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲歐盟、加拿大、印度或其他任何地方不公平的加密貨幣的局外人。\n的法規，我真的不明白爲什麼有人會\n有人遵守這些法律。\n\nCrypto提供了許多保持匿名的手段，而整個要點是\n去中心化，你爲什麼不直接使用這個...",
      "title": "爲什麼有人會遵守新的加密貨幣法規？"
    }
  ]
}