{
  "author": "frank__costello",
  "the_new_excerpt": "For years, the crypto community has pointed to government control over fiat\nmoney as the reason Bitcoin needs to exist. People need an asset that they know\ncan't be arbitrarily printed or controlled by corrupt governments.\n\nAnd after 12 years, this narrative is taking hold. The financial industry…",
  "original_created_utc": 1611841300,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "多年来，加密社区一直指出政府对法币的控制。\n钱作为比特币需要存在的理由。人们需要一种他们知道的资产\n不能随意印刷，不能被腐败政府控制。\n\n12年后，这种说法已经深入人心。金融业...",
      "title": "华尔街已经决定你没有足够的责任心去买GME。这就是为什么我们需要DeFi。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "多年來，加密社區一直指出政府對法幣的控制。\n錢作爲比特幣需要存在的理由。人們需要一種他們知道的資產\n不能隨意印刷，不能被腐敗政府控制。\n\n12年後，這種說法已經深入人心。金融業...",
      "title": "華爾街已經決定你沒有足夠的責任心去買GME。這就是爲什麼我們需要DeFi。"
    }
  ],
  "title": "Wall Street has decided you're not responsible enough to buy GME. This is why we need DeFi.",
  "created_utc": 1611853050,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>For years, the crypto community has pointed to government control over fiat money as the reason Bitcoin needs to exist. People need an asset that they know can&#39;t be arbitrarily printed or controlled by corrupt governments.</p>\n\n<p>And after 12 years, this narrative is taking hold. The financial industry is starting to take Bitcoin seriously, investors and large corporations are putting Bitcoin on their balance sheet to reduce their dependency on the behavior of the US federal government.</p>\n\n<p><strong>But the next fight is upon us.</strong></p>\n\n<p>This week, the common folk of the internet discovered their power. They discovered that by working together, they can challenge the powerful entities of Wall Street.</p>\n\n<p>And Wall Street hates it.</p>\n\n<p>As of right now, Robinhood and most other trading products are in &quot;reduce only mode&quot;.</p>\n\n<p>Wall Street has decided that you&#39;re not responsible enough to buy the stocks that you like, so they&#39;ve taken away your stock buying privileges.</p>\n\n<p>Of course, hedge funds will still have access to GME and AMC. But not you.</p>\n\n<p><strong>This is why Bitcoin is only the beginning of this revolution.</strong></p>\n\n<p>It&#39;s not simply enough to be able to custody your own assets. You need to be able to trade them, to lend them, to leverage them. You should have access to the same financial instruments that the rich people on Wall Street have access to.</p>\n\n<p><strong>This is why we need DeFi</strong></p>\n\n<p>Nobody can turn off Uniswap. Nobody can turn off Aave. Nobody can turn off Synthetix.</p>\n\n<p>Nobody can tell you that leverage-longing some shitcoin is irresponsible and you&#39;re not allowed to do it.</p>\n\n<p><strong>This can be our moment.</strong></p>\n\n<p>Thousands of people, from WSB to Twitter, have just been deplatformed, just for wanting to invest their money as they see fit.</p>\n\n<p>Let&#39;s show them the future. Let&#39;s show them a world where finance is not owned by any government or hedge fund or billionaire.</p>\n\n<p>A world where, as long as you&#39;re not hurting anyone, you&#39;re free to use your money however you like.</p>\n</div><!-- SC_ON -->",
  "score": 19527,
  "permalink": "/r/CryptoCurrency/comments/l6wv0u/wall_street_has_decided_youre_not_responsible/",
  "subreddit": "CryptoCurrency",
  "id": "l6wv0u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518527071
}