{
  "author": "Aurtach",
  "the_new_excerpt": "With the most recent run up, I just realized that I am now where I was at the\npeak of alt szn back at the beginning of 2018. I held through the crash, and\nover the next couple years saw my portfolio shrink down 93% from my peak.\n\nThose were rough days. But I followed a few of the most important…",
  "original_created_utc": 1612513857,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "随着最近的涨幅，我才发现，我现在的位置是在\n早在2018年初，alt szn的峰值。我在崩盘中坚持了下来，并\n在接下来的几年里，我的投资组合从高峰期缩水了93%。\n\n那是一段艰难的日子。但我遵循了几个最重要的... ...",
      "title": "终于，在坚持了3年之后，我刚刚过去了我之前的ATH。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "隨着最近的漲幅，我才發現，我現在的位置是在\n早在2018年初，alt szn的峯值。我在崩盤中堅持了下來，並\n在接下來的幾年裏，我的投資組合從高峯期縮水了93%。\n\n那是一段艱難的日子。但我遵循了幾個最重要的... ...",
      "title": "終於，在堅持了3年之後，我剛剛過去了我之前的ATH。"
    }
  ],
  "title": "Finally, after 3 years of holding, I just past my previous ATH.",
  "created_utc": 1612539691,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With the most recent run up, I just realized that I am now where I was at the peak of alt szn back at the beginning of 2018. I held through the crash, and over the next couple years saw my portfolio shrink down 93% from my peak. </p>\n\n<p>Those were rough days. But I followed a few of the most important risky investment fundamentals that allowed me to be ok with it and patiently what for the next bull run. </p>\n\n<ol>\n<li><p>Never put in more than you&#39;re willing to see go to zero. If your emotionally attached and your stomach just aches when it drops 20% or more, then you probably have too much in and you should really consider if you are willing to lose that amount, or if losing that money would negatively impact your life or the life of your family for those with partners and kids.</p></li>\n<li><p>Treat it as a long term investment. I told myself that I couldn&#39;t cash out for at least 5 years or more. I new of the bust and boom cycles, I knew it would be volitile but I felt that crypto was so important that eventually it would catch on more and with time it would become more valuable as it was taken more seriously as an emerging asset class. This also helps you to not be so emotionally tied to day to day swings. </p></li>\n<li><p>Quit chasing pumps and quit trying to day trade. This is probably most important, you most likely will lose money doing this.</p></li>\n<li><p>DCA into your positions, and don&#39;t concern yourself with short term prices. If you play the long game and stick to the solid coins, you will most likely be in a better position thee or four years from now.</p></li>\n</ol>\n\n<p>I know everyone wants to make fast gains, but so far in the crypto game the slow and steady turtle is winning the race.</p>\n\n<p>I&#39;m excited for the next couple years. We are maintaining amazing growth and acceptance in this space, and compared to where we were when my portfolio was at this point 3 years ago, we are in a much more stable and overall positive place. </p>\n\n<p>Best of luck to you out there, and I&#39;m excited to see how crypto grows in these next couple years.</p>\n</div><!-- SC_ON -->",
  "score": 251,
  "permalink": "/r/CryptoCurrency/comments/ld2wtb/finally_after_3_years_of_holding_i_just_past_my/",
  "subreddit": "CryptoCurrency",
  "id": "ld2wtb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123193193
}