{
  "author": "kleinfieh",
  "original_created_utc": 1631564751,
  "title": "When big cities like London or Paris first built proper sewerage systems, was that politically controversial?",
  "created_utc": 1631581547,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I know this became a more pressing issue in these cities as population density increased, and that there have been events like the &#39;Great Stink&#39; in London that acted as a trigger, but what I&#39;m curious is how the political discussion was at that time. Who was against it? What were their arguments? Were the consequences of open sewers for public health common knowledge or initially more of a fringe opinion?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/AskHistorians/comments/pnnneu/when_big_cities_like_london_or_paris_first_built/",
  "subreddit": "AskHistorians",
  "id": "pnnneu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I know this became a more pressing issue in these cities as population\ndensity increased, and that there have been events like the 'Great Stink' in\nLondon that acted as a trigger, but what I'm curious is how the political\ndiscussion was at that time. Who was against it? What were their arguments?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "このような都市では、人口減少に伴い、この問題がより深刻になってきたと思います。\nまた、ロンドンの「Great Stink」のような出来事が引き金になったこともあります。\nロンドンの「大悪臭」のような出来事が引き金になったことは知っていますが、興味があるのは当時の政治的議論がどのようなものだったかということです。\nしかし気になるのは、当時の政治的な議論はどうだったのかということです。誰が反対したのか？どんな主張をしていたのか...。",
      "title": "ロンドンやパリのような大都市が最初にきちんとした下水道を作ったとき、それは政治的な論争になりましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以我知道，随着人口密度的增加，这个问题在这些城市变得更加紧迫。\n我知道，随着人口密度的增加，这个问题在这些城市变得更加紧迫，而且还发生了像伦敦的 \"大臭 \"这样的事件。\n但我很好奇的是，当时的政治讨论是如何进行的？\n但我好奇的是当时的政治讨论是怎样的。谁反对它？他们的论点是什么？",
      "title": "当像伦敦或巴黎这样的大城市第一次建立适当的污水处理系统时，这在政治上有争议吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以我知道，隨着人口密度的增加，這個問題在這些城市變得更加緊迫。\n我知道，隨着人口密度的增加，這個問題在這些城市變得更加緊迫，而且還發生了像倫敦的 \"大臭 \"這樣的事件。\n但我很好奇的是，當時的政治討論是如何進行的？\n但我好奇的是當時的政治討論是怎樣的。誰反對它？他們的論點是什麼？",
      "title": "當像倫敦或巴黎這樣的大城市第一次建立適當的污水處理系統時，這在政治上有爭議嗎？"
    }
  ]
}