{
  "author": "Seebeedeee",
  "original_created_utc": 1633005196,
  "title": "Satoshi’s wallet has 1,000,000 Bitcoin but people are afraid their wallet may get targeted and hacked?",
  "created_utc": 1633023044,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There was no air-gapped hardware wallets either.  Satoshi probably stored his Bitcoin access on an old laptop you would be embarrassed to be seen using these days.  His wallet has been sitting in cyberspace for over a decade and nobody has been able to steal a single sat.</p>\n\n<p>The network has never been hacked and if it were to be hacked, there are much bigger wallets to raid than yours.</p>\n\n<p>People scared of their Bitcoin wallet getting hacked fundamentally misunderstand the Bitcoin network.</p>\n</div><!-- SC_ON -->",
  "score": 178,
  "permalink": "/r/Bitcoin/comments/pyits3/satoshis_wallet_has_1000000_bitcoin_but_people/",
  "subreddit": "Bitcoin",
  "id": "pyits3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There was no air-gapped hardware wallets either. Satoshi probably stored his\nBitcoin access on an old laptop you would be embarrassed to be seen using these\ndays. His wallet has been sitting in cyberspace for over a decade and nobody has\nbeen able to steal a single sat.\n\nThe network has never been…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エアギャップのあるハードウェアウォレットもありませんでした。サトシはおそらく\n使っているのを見られるのが恥ずかしいような古いノートパソコンにビットコインのアクセスを保存していたのでしょう。\n使っているのを見られるのは恥ずかしい。彼のウォレットは10年以上もサイバースペースに置かれていますが、誰もそのウォレットを盗むことはできませんでした。\n誰も一枚のシートも盗むことができませんでした。\n\nネットワークはこれまで一度も...",
      "title": "サトシのウォレットには1,000,000ビットコインが入っているが、人々はウォレットが狙われてハッキングされるのではないかと恐れている？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "也没有空气加压的硬件钱包。中本聪可能把他的\n比特币的访问存储在一台旧的笔记本电脑上，你会觉得现在使用它很尴尬。\n现在的人都不好意思使用。他的钱包在网络空间中已经存在了十多年，没有人能够偷走他的钱包。\n没有人能够偷到任何一个比特币。\n\n这个网络从来没有被...",
      "title": "中本聪的钱包里有100万个比特币，但人们担心他们的钱包会被盯上，被黑掉？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "也沒有空氣加壓的硬件錢包。中本聰可能把他的\n比特幣的訪問存儲在一臺舊的筆記本電腦上，你會覺得現在使用它很尷尬。\n現在的人都不好意思使用。他的錢包在網絡空間中已經存在了十多年，沒有人能夠偷走他的錢包。\n沒有人能夠偷到任何一個比特幣。\n\n這個網絡從來沒有被...",
      "title": "中本聰的錢包裏有100萬個比特幣，但人們擔心他們的錢包會被盯上，被黑掉？"
    }
  ]
}