{
  "author": "NunzioL",
  "the_new_excerpt": "Today Friday 2/5, Churchill Capital opened up a new ticker CCV aside from their\nalready known ticker CCIV. What is the big deal you may ask? Well if you haven't\nbeen living under a rock, somewhat likely rumors about a merge between Churchill\nCapital and LUCID Motors may be underway. The reason why…",
  "original_created_utc": 1612571309,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天周五2/5，Churchill Capital开辟了一个新的行情CCV，除了他们的。\n已经知道的股票代码CCIV。你可能会问，这有什么大不了的？好吧，如果你还没有\n一直生活在岩石下，有点可能是关于丘吉尔的合并的传闻。\n资本和LUCID汽车可能正在进行。原因是...",
      "title": "Churchill Capital开辟了新的股票CCV CCIV的重大消息"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天週五2/5，Churchill Capital開闢了一個新的行情CCV，除了他們的。\n已經知道的股票代碼CCIV。你可能會問，這有什麼大不了的？好吧，如果你還沒有\n一直生活在岩石下，有點可能是關於丘吉爾的合併的傳聞。\n資本和LUCID汽車可能正在進行。原因是...",
      "title": "Churchill Capital開闢了新的股票CCV CCIV的重大消息"
    }
  ],
  "title": "Churchill Capital Opened a new stock CCV BIG NEWS FOR CCIV",
  "created_utc": 1612587236,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Today Friday 2/5, Churchill Capital opened up a new ticker CCV aside from their already known ticker CCIV. What is the big deal you may ask? Well if you haven&#39;t been living under a rock, somewhat likely rumors about a merge between Churchill Capital and LUCID Motors may be underway. The reason why CCV being opened is such big news is that there may have been a deal struck between Churchill Capital and LUCID which is why Churchill capital needed to open a new ticker to replace the old one, as their original stock CCIV will be renamed with whatever the LUCID ticker will be. This is massive news and probably the reason why CCIV rose almost 15% today despite there being no confirmed news of a merge. What&#39;s also rumored is a super bowl commercial presented by LUCID Motors that will confirm the merge between the 2 companies. That one may be a stretch because it seems a bit late to reserve space for a commercial but only time will tell.</p>\n\n<p>Keep in mind this is speculation. What I am saying isn&#39;t guaranteed to happen but I am very convinced personally that this will happen. Enjoy everyone.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit*</p>\n\n<p>Seems like this post is picking up a small bit of attention so I&#39;d like to be clear in no way do I consider myself a financial expert, I&#39;m just some college kid sharing some thoughts for some internet points.</p>\n</div><!-- SC_ON -->",
  "score": 146,
  "permalink": "/r/investing/comments/ldlk4v/churchill_capital_opened_a_new_stock_ccv_big_news/",
  "subreddit": "investing",
  "id": "ldlk4v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198820
}