{
  "author": "Nowhere_Man_Forever",
  "original_created_utc": 1657587527,
  "title": "How and when did Gnosticism die out, and why are there no major existing Gnostic belief systems?",
  "created_utc": 1657653512,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been doing a lot of reading and it sounds like gnosticism was a pretty major &amp;quot;competitor&amp;quot; to what became &amp;quot;mainstream&amp;quot; Christianity in the early days of Christianity. There are countless gnostic &amp;quot;gospels&amp;quot; and Gnostic belief systems seem to have survived well into the middle ages. The closest thing I can think of to a significant gnostic religion that exists today is Christian Science, but it lacks a historical bond to ancient gnosticism, and doesn&amp;#39;t include many of the same core concepts. &lt;/p&gt;\n\n&lt;p&gt;Is it just a quirk of history that Constantine adopted what became &amp;quot;mainstream&amp;quot; Christianity and enforced its message across the Roman Empire? Would it have been plausible for him to have adopted a more gnostic form of Christianity, or had gnosticism already fallen out of favor by then among mainstream Church authorities?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/vwy9ha/how_and_when_did_gnosticism_die_out_and_why_are/",
  "subreddit": "AskHistorians",
  "id": "vwy9ha",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I've been doing a lot of reading and it sounds like gnosticism was a pretty\nmajor \"competitor\" to what became \"mainstream\" Christianity in the early days of\nChristianity. There are countless gnostic \"gospels\" and Gnostic belief systems\nseem to have survived well into the middle ages. The closest…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "いろいろ読んでいると、グノーシス主義というのはかなり\nキリスト教の初期に「主流」となったものに対して、グノーシス主義はかなり大きな「競争相手」だったようです。\nキリスト教の初期に「主流」となったものに対して、グノーシス主義はかなり主要な「競争相手」だったようです。グノーシス主義の「福音書」は無数にあり、グノーシス主義の信仰体系も中世まで残っていたようです。\nは中世まで存続していたようです。最も近いのは...",
      "title": "グノーシス主義はいつ、どのようにして消滅したのか。また、現存するグノーシス主義の主要な信仰体系が存在しないのはなぜか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在做大量的阅读，听起来诺斯替主义是一个相当的\n的主要 \"竞争者\"，成为基督教早期的 \"主流\"。\n基督教的早期。有无数的诺斯底 \"福音书 \"和诺斯底信仰体系\n似乎一直存活到中世纪。最接近的是...",
      "title": "诺斯替主义是如何和何时消亡的，为什么没有现存的主要诺斯替信仰体系？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在做大量的閱讀，聽起來諾斯替主義是一個相當的\n的主要 \"競爭者\"，成爲基督教早期的 \"主流\"。\n基督教的早期。有無數的諾斯底 \"福音書 \"和諾斯底信仰體系\n似乎一直存活到中世紀。最接近的是...",
      "title": "諾斯替主義是如何和何時消亡的，爲什麼沒有現存的主要諾斯替信仰體系？"
    }
  ]
}