{
  "author": "LeBateleur1",
  "original_created_utc": 1635573740,
  "title": "WOW. I just posted asking for help. In 5 minutes 5 different users tried to scam me.",
  "created_utc": 1635582979,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Wow. I just did a post asking if I had lost 20$ on a small transaction... 30 seconds later I got a message  offering help and saying I could &quot;re-validate the transaction with the idapps interface&quot;. Quick google showed scam but I let him go on. Sent me a link and instructions that I should link my wallet inserting the seed phrase. A minute later another, then another, than another. There were 3 when I began writing and now there are 5. Some say I have to input my phrase to get a QR code or even a &quot;bar code&quot;! I&#39;m missing 20 bucks here, guys. I can imagine what happens to people who announce problems with bigger amounts...</p>\n\n<p>A word of advice: If someone has something good to say, they will do it in the open, using the comments. Don&#39;t trust people who are trying to help you on the side. Not here.</p>\n\n<p>Should I edit and add their usernames on this post or is it against the community rules?</p>\n</div><!-- SC_ON -->",
  "score": 249,
  "permalink": "/r/CryptoCurrency/comments/qiv96o/wow_i_just_posted_asking_for_help_in_5_minutes_5/",
  "subreddit": "CryptoCurrency",
  "id": "qiv96o",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Wow. I just did a post asking if I had lost 20$ on a small transaction... 30\nseconds later I got a message offering help and saying I could \"re-validate the\ntransaction with the idapps interface\". Quick google showed scam but I let him\ngo on. Sent me a link and instructions that I should link my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "わーい。ちょっとした取引で20ドルも損をしたかどうかを尋ねる投稿をしたばかりなのに...。30\n30秒後に助けを求めるメッセージが来て、「idappsのインターフェイスで取引を再検証」すれば\nidappsのインターフェイスで取引を再検証する」ことができると言っていました。すぐにググると詐欺だとわかりましたが、私は彼に\n続けることにしました。リンクと指示を送ってきたので、私は自分の...",
      "title": "WOW。私は助けを求めて投稿しました。5分後には5人のユーザーが私を騙そうとしました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哇。我刚刚发了一个帖子，问我是否在一个小交易中损失了20美元...... 30\n30秒后，我收到了一条提供帮助的信息，并说我可以 \"用idap重新验证该交易\n交易的idapps界面\"。快速的谷歌显示是骗局，但我让他\n继续说下去。他给我发了一个链接和指示，说我应该把我的...",
      "title": "呜呼哀哉。我刚刚发帖请求帮助。在5分钟内，有5个不同的用户试图诈骗我。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哇。我剛剛發了一個帖子，問我是否在一個小交易中損失了20美元...... 30\n30秒後，我收到了一條提供幫助的信息，並說我可以 \"用idap重新驗證該交易\n交易的idapps界面\"。快速的谷歌顯示是騙局，但我讓他\n繼續說下去。他給我發了一個鏈接和指示，說我應該把我的...",
      "title": "嗚呼哀哉。我剛剛發帖請求幫助。在5分鐘內，有5個不同的用戶試圖詐騙我。"
    }
  ]
}