{
  "author": "StannisLivesOn",
  "original_created_utc": 1644139248,
  "title": "What did the foreigners think of Cromwell's commonwealth?",
  "created_utc": 1644152169,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When I was still in school, we were taught that the european powers were very much disturbed by the french revolution - the ideas of the republic were viewed as dangerous for the current order, and it was one of the reasons for the intervention that eventually occurred. &lt;/p&gt;\n\n&lt;p&gt;However, that wasn&amp;#39;t the first time a king was deposed and a republic was installed - that already happened in England centuries before. Admittedly, I don&amp;#39;t think the changes were as radical, but I still see some similarities. &lt;/p&gt;\n\n&lt;p&gt;So it makes me wonder - what did the contemporaries outside of England think of what happened? Did they view it with the same disturbance? Did they care? Do we even know?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 118,
  "permalink": "/r/AskHistorians/comments/slsof3/what_did_the_foreigners_think_of_cromwells/",
  "subreddit": "AskHistorians",
  "id": "slsof3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When I was still in school, we were taught that the european powers were very\nmuch disturbed by the french revolution - the ideas of the republic were viewed\nas dangerous for the current order, and it was one of the reasons for the\nintervention that eventually occurred.\n\nHowever, that wasn't the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がまだ学生だった頃、ヨーロッパの列強が非常に苦しんでいることを教えられました。\nフランス革命は、共和制の思想に大きな衝撃を与えました。\n現在の秩序にとって危険なものであることが、その理由の一つでした。\n介入を行いました。\n\nしかし、それは......。",
      "title": "外国人はクロムウェルの連邦をどう見ていたのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当我还在上学的时候，我们被教导说，欧洲列强对法国革命非常不满\n法国大革命让我们非常不安--共和国的思想被视为对当前秩序的危险。\n共和国的思想被视为对当前秩序的危险，这也是最终发生的干预的原因之一。\n最终发生的干预的原因之一。\n\n然而，这并不是...",
      "title": "外国人对克伦威尔的联邦有什么看法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當我還在上學的時候，我們被教導說，歐洲列強對法國革命非常不滿\n法國大革命讓我們非常不安--共和國的思想被視爲對當前秩序的危險。\n共和國的思想被視爲對當前秩序的危險，這也是最終發生的干預的原因之一。\n最終發生的干預的原因之一。\n\n然而，這並不是...",
      "title": "外國人對克倫威爾的聯邦有什麼看法？"
    }
  ]
}