{
  "author": "chumbasprinkles",
  "the_new_excerpt": "Get ready for a potential overdue golden age for the nuclear energy industry,\nincluding but not limited to nuclear power plants and you guessed it: uranium.\n\nLet’s dig in deeper\n\nWhy Nuclear?\n\nNuclear reactors generate virtually emissions-free power which means they can\nform a part of getting to net…",
  "original_created_utc": 1610766216,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "准备好迎接核能产业潜在的超期黄金时代吧。\n包括但不限于核电站和你猜到的：铀。\n\n让我们深入了解一下\n\n为什么选择核电？\n\n核反应堆产生的电力几乎是无排放的，这意味着它们可以做到以下几点\n形成一部分，以获得网...",
      "title": "铀和核股票被低估？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "準備好迎接核能產業潛在的超期黃金時代吧。\n包括但不限於核電站和你猜到的：鈾。\n\n讓我們深入瞭解一下\n\n爲什麼選擇核電？\n\n核反應堆產生的電力幾乎是無排放的，這意味着它們可以做到以下幾點\n形成一部分，以獲得網...",
      "title": "鈾和核股票被低估？"
    }
  ],
  "title": "Uranium and Nuclear stocks undervalued?",
  "created_utc": 1610830683,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Get ready for a potential overdue golden age for the nuclear energy industry, including but not limited to nuclear power plants and you guessed it: uranium.</p>\n\n<p><strong>Let’s dig in deeper</strong></p>\n\n<p><strong>Why Nuclear?</strong></p>\n\n<p>Nuclear reactors generate virtually emissions-free power which means they can form a part of getting to net-zero emissions from electricity generation in the fight to tackle global warming.</p>\n\n<p><strong>I thought nuclear equals bad?</strong></p>\n\n<p>Unless you’ve been living under a rock, being green and sustainable is hot. There are currently no safe or clean ways to generate the amount of sustainable energy that nuclear does. Also, as the world population grows, unless there are giant leaps im technology, the only viable way to create enough power will be through a combination of nuclear, solar, wind and water.</p>\n\n<p><strong>Biden’s administration has a $400 billion dollar sustainable energy proposal and it includes nuclear</strong> </p>\n\n<p>This is rare. What’s even more rare is that he’s one of the only presidents to run on a platform <em>supporting advancement in nuclear energy.</em> He is serious about it. </p>\n\n<p><strong>That’s right, there’s a reason EVs mooned last year and will continue to do well for the foreseeable future. It’s the same reason there is potential for it to happen to the nuclear industry:</strong></p>\n\n<p><a href=\"https://www.tdworld.com/utility-business/article/21151832/president-bidens-vision-for-the-power-sector\">https://www.tdworld.com/utility-business/article/21151832/president-bidens-vision-for-the-power-sector</a></p>\n\n<p><strong>”But I’m republican. I can’t agree with Sleepy Joe...”</strong></p>\n\n<p>You’re in luck! This is something so appealing that everyone and their racist grandma can hold hands and sing Kumbaya on. Bipartisan political handoff shows this is an opportunity area that even politicians can agree to. </p>\n\n<p><a href=\"https://www.washingtonexaminer.com/policy/energy/trump-boost-to-nuclear-power-to-live-on-in-biden-administration%3f_amp=true\">https://www.washingtonexaminer.com/policy/energy/trump-boost-to-nuclear-power-to-live-on-in-biden-administration%3f_amp=true</a></p>\n\n<p><strong>Even Nuclear industry folks seem highly positive in their world which has been fear mongered and neglected for decades:</strong></p>\n\n<p><em>&quot;Things we&#39;ve seen out of the Biden campaign and the transition team are very promising for a continuation and even acceleration of programs and policies that will support nuclear energy,&quot; said John Kotek, policy development vice president for the Nuclear Energy Institute</em></p>\n\n<p><a href=\"https://www.eenews.net/stories/1063719675\">https://www.eenews.net/stories/1063719675</a></p>\n\n<p>Make your own decision. Do your own research.\nI know I’ve done mine. I’m long Uranium and Nuclear.</p>\n\n<p><strong>Tickers:</strong></p>\n\n<p>$UEC $CCJ $UUUU $URA</p>\n\n<p><strong>Uranium companies:</strong></p>\n\n<p><a href=\"https://www.theupa.org\">https://www.theupa.org</a></p>\n\n<ul>\n<li>Z</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 42,
  "permalink": "/r/stocks/comments/kyajum/uranium_and_nuclear_stocks_undervalued/",
  "subreddit": "stocks",
  "id": "kyajum",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311218327
}