{
  "author": "SEPE4",
  "original_created_utc": 1640232786,
  "title": "Day One of using Bitcoin in El Salvador",
  "created_utc": 1640273922,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I had just arrived here near the beaches of El Salvador after mustering up the courage to travel to one of the &amp;quot;most dangerous&amp;quot; countries in the world. It&amp;#39;s been a few days so far and I feel pretty much safe walking alone during the daytime as a tourist with limited Spanish speaking skills. This morning, I visited El Zonte to see how easy it was to transact using Bitcoin from my lightning wallet and let me tell you; it was difficult. Most shops advertise &amp;quot;Bitcoin accepted here&amp;quot;, &amp;quot;Strike accepted here&amp;quot; and other shops display a QR code with the BitcoinBeach logo in the middle that when scanned, directs you to the BitcoinBeach invoice setup webpage. &lt;/p&gt;\n\n&lt;p&gt;I asked one of the vendors if I could pay in Bitcoin using a lightning wallet for a bottle of water and the vendor advised me to just scan the QR code to pay. Which I did only to see an alert message stating &amp;quot;Not a proper lightning payment request&amp;quot;, some error stating that it needs a set amount of sats for the transaction to process, or &amp;quot;this is not a BTC address or a lightning invoice&amp;quot;. I don&amp;#39;t remember which error message popped up as I grew frustrated trying to figure it out using the Muun wallet and the BlueWallet (they both theoretically do work). I then gave up and bought the bottle of water with cash.&lt;/p&gt;\n\n&lt;p&gt;The next vendor noticed that I was having issues with trying to pay using either of my wallets and said that I should use the BitcoinBeach wallet, however the BitcoinBeach wallet is only available to those who live in El Salvador or to those who have their Google account/ Apple account registered under El Salvador, not for tourists like myself. Strike was also out of the picture as I was having issues trying to register my number and my personal information. Which only leaves with my Muun wallet and my BlueWallet for lightning transactions. So I gave up and went about my day while brainstorming for solutions.&lt;/p&gt;\n\n&lt;p&gt;Later that day I came across a small restaurant near where I&amp;#39;m staying at that also accepts Bitcoin. I asked the server how would she receive payment before ordering my food as to not waste either of our time and she showed me her own personal Bitcoin wallet. The problem with this one however was the fact that it was a bitcoin public address and not the lightning address. I went with it anyway as I was hungry for some grilled chicken and payed for the meal with bitcoin + the miner fee ($0.61!).&lt;/p&gt;\n\n&lt;p&gt;I headed back to my rental to conduct some more research on the different wallets and the experiences other people have had while trying to use bitcoin as a tourist in El Zonte. It turns out that a youtuber named &amp;#39;Marc Falzon&amp;#39; had a very similar experience to mine in his video titled, &amp;#39;Surviving 72 Hours on Bitcoin at the Bitcoin Beach&amp;#39;. However, at around 33:40, he was told that he should be able to just scan the QR code and proceed from there but I believe this process requires not just one smartphone but 2 smartphones. One acting as a POS terminal while the customer&amp;#39;s smartphone would scan the invoice after the invoice amount has been set on the POS terminal. So tomorrow I plan to head back to El Zonte and ask the vendors if they could assist me in this different approach (maybe ask for their phone or maybe I&amp;#39;ll use 2 of my smartphones). I don&amp;#39;t think they&amp;#39;ll be too comfortable with this idea but it makes sense. Why would the customer setup the invoice amount when it should be the vendor who handles the pricing of their goods?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 166,
  "permalink": "/r/Bitcoin/comments/rmms9q/day_one_of_using_bitcoin_in_el_salvador/",
  "subreddit": "Bitcoin",
  "id": "rmms9q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I had just arrived here near the beaches of El Salvador after mustering up the\ncourage to travel to one of the \"most dangerous\" countries in the world. It's\nbeen a few days so far and I feel pretty much safe walking alone during the\ndaytime as a tourist with limited Spanish speaking skills. This…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、このエルサルバドルの浜辺に到着したところでした。\n世界で最も危険な国」のひとつに、勇気を出して足を運んだ。それは\n数日経ちますが、一人で歩いても大丈夫な感じです。\n日中はスペイン語があまり話せない観光客。これは...",
      "title": "エルサルバドルでビットコインを使い始めて1日目"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在鼓起勇气前往世界上 \"最危险 \"的国家之一后，我刚刚抵达萨尔瓦多的海滩附近。\n我鼓起勇气来到世界上 \"最危险 \"的国家之一。到目前为止，已经过了几天。\n到目前为止，已经过了几天，我觉得作为一个西班牙语能力有限的游客，在白天独自行走是相当安全的。\n白天，作为一个西班牙语能力有限的游客，我感到非常安全。这...",
      "title": "在萨尔瓦多使用比特币的第一天"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在鼓起勇氣前往世界上 \"最危險 \"的國家之一後，我剛剛抵達薩爾瓦多的海灘附近。\n我鼓起勇氣來到世界上 \"最危險 \"的國家之一。到目前爲止，已經過了幾天。\n到目前爲止，已經過了幾天，我覺得作爲一個西班牙語能力有限的遊客，在白天獨自行走是相當安全的。\n白天，作爲一個西班牙語能力有限的遊客，我感到非常安全。這...",
      "title": "在薩爾瓦多使用比特幣的第一天"
    }
  ]
}