{
  "author": "isaac_horstmeier",
  "original_created_utc": 1637023477,
  "title": "Bitcoin it’s holding the line like a champ.",
  "created_utc": 1637033913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We’ve seen so many attempts by the bears to dump the price and shake people out of their investments on the past days. \nBut they are failing harder every single time!\nWe have now a solid ground above 62k and, let me tell you guys, specially for new investors, this kind of tests are so healthy for the market on the long run, if you zoom out you’ll see that with every single dip, crypto and Bitcoin it’s just testing previous highs.</p>\n\n<p>So just zoom out, if you are lucky enough and have fiat, buy some more, make a plan and stick to it.</p>\n\n<p>And enjoy the ride.</p>\n</div><!-- SC_ON -->",
  "score": 212,
  "permalink": "/r/CryptoCurrency/comments/quv2be/bitcoin_its_holding_the_line_like_a_champ/",
  "subreddit": "CryptoCurrency",
  "id": "quv2be",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We’ve seen so many attempts by the bears to dump the price and shake people out\nof their investments on the past days. But they are failing harder every single\ntime! We have now a solid ground above 62k and, let me tell you guys, specially\nfor new investors, this kind of tests are so healthy for the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数日、熊が価格を下げて人々の投資を揺さぶろうとする試みを何度も目にしました。\nここ数日、ベアが価格を下げて投資家を揺さぶろうとする試みを何度も見てきました。しかし、彼らは毎回失敗しています。\nしています。現在、我々は62K以上の強固な地盤を持っており、皆さんにお伝えしたいのですが、特に新規投資家にとって、このようなテストはとても健全なものです。\n特に新規の投資家にとっては、このようなテストは非常に健全です。",
      "title": "Bitcoinは見事にラインを維持している。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们已经看到了熊市的许多尝试，以倾销价格和动摇人们在\n他们在过去几天里的投资。但是他们每一次的失败都更加严重\n次都失败了! 我们现在有一个坚实的基础，超过62K，让我告诉你们，特别是\n对于新的投资者来说，这种测试是非常健康的...",
      "title": "比特币它像一个冠军一样坚守着阵地。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們已經看到了熊市的許多嘗試，以傾銷價格和動搖人們在\n他們在過去幾天裏的投資。但是他們每一次的失敗都更加嚴重\n次都失敗了! 我們現在有一個堅實的基礎，超過62K，讓我告訴你們，特別是\n對於新的投資者來說，這種測試是非常健康的...",
      "title": "比特幣它像一個冠軍一樣堅守着陣地。"
    }
  ]
}