{
  "author": "Floofyboy",
  "the_new_excerpt": "Example: Some dude ask if coinbase is a good stock to buy. Even just replying\nanything with a \"mean\" keyword instantly gets your post removed. I think being\nunable to mention anything crypt related when discussing stocks, especially ones\nlike coinbase, is becoming increasingly impossible.\n\nYea sure,…",
  "original_created_utc": 1621800131,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "例 ある男が「coinbaseは買うべき良い株なのか？返信するだけでも\n返しただけでも、その投稿は即座に削除されます。私が思うに\n特にcoinbaseのような株について議論するときに、暗号に関連することを何も言えないのは\n特にcoinbaseのような銘柄については、ますます不可能になってきています。\n\n確かに、そうですね。",
      "title": "クリプト」のルールはちょっと厳しすぎる"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "例子。有些人问coinbase是不是可以买的好股票。即使只是回复\n任何带有 \"卑鄙 \"关键词的帖子都会立即被删除。我认为\n在讨论股票，尤其是像coinbase这样的股票时，不能提到任何与加密有关的东西\n像coinbase这样的，越来越不可能了。\n\n是的，当然，...",
      "title": "\"加密 \"规则有点太严格了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "例子。有些人問coinbase是不是可以買的好股票。即使只是回覆\n任何帶有 \"卑鄙 \"關鍵詞的帖子都會立即被刪除。我認爲\n在討論股票，尤其是像coinbase這樣的股票時，不能提到任何與加密有關的東西\n像coinbase這樣的，越來越不可能了。\n\n是的，當然，...",
      "title": "\"加密 \"規則有點太嚴格了"
    }
  ],
  "title": "The \"crypt\" rule is a bit too strict",
  "created_utc": 1621803444,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Example: Some dude ask if coinbase is a good stock to buy. Even just replying anything with a &quot;mean&quot; keyword instantly gets your post removed. I think being unable to mention anything crypt related when discussing stocks, especially ones like coinbase, is becoming increasingly impossible.</p>\n\n<p>Yea sure, i don&#39;t want people to start discussing in details every single crypt currency there is, but thinking any discussion related to crypt is completely irrelevant to stocks is delusional.</p>\n\n<p>Its like banning ANY posts related to politics. Sure this isn&#39;t a politics sub, but if Biden wants to put a corporate tax its obviously revelant to stocks discussion.</p>\n\n<p>I&#39;d rather have humans use their judgment and see if a post is relevant to stocks or not, instead of a dumb bot that just removes any posts with the keyword.</p>\n</div><!-- SC_ON -->",
  "score": 88,
  "permalink": "/r/stocks/comments/njfu67/the_crypt_rule_is_a_bit_too_strict/",
  "subreddit": "stocks",
  "id": "njfu67",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197389731
}