{
  "author": "Tularemia",
  "original_created_utc": 1627305685,
  "title": "When and why did home-owning Americans start to care about green, weed-free, well-watered, frequently-mowed lawns? What forces contributed to this?",
  "created_utc": 1627327088,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lawn care is often a hot topic of discussion, given the environmental impact of pesticides and fertilizers, and given looming water shortages. I am curious how the image of the ideal American lawn came to exist in the first place.</p>\n\n<p>Also, what did lawns look like before this ideal image become the standard?</p>\n</div><!-- SC_ON -->",
  "score": 134,
  "permalink": "/r/AskHistorians/comments/oryl45/when_and_why_did_homeowning_americans_start_to/",
  "subreddit": "AskHistorians",
  "id": "oryl45",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Lawn care is often a hot topic of discussion, given the environmental impact of\npesticides and fertilizers, and given looming water shortages. I am curious how\nthe image of the ideal American lawn came to exist in the first place.\n\nAlso, what did lawns look like before this ideal image become the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "芝生の手入れは、農薬や肥料による環境への影響や、迫り来る水不足など、話題に事欠かない。\n農薬や肥料による環境への影響や、迫り来る水不足の問題から、芝生の手入れが話題になることがあります。私は、そもそも\nそもそも、アメリカの理想的な芝生のイメージはどのようにして生まれたのでしょうか。\n\nまた、そのような理想的なイメージが定着する前の芝生はどのようなものだったのでしょうか。",
      "title": "家庭を持つアメリカ人が、緑の芝生、雑草のない芝生、水やりの行き届いた芝生、頻繁に刈られた芝生にこだわるようになったのはいつ、なぜでしょうか？その背景にはどのような力が働いているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "鉴于杀虫剂和化肥对环境的影响，以及迫在眉睫的水资源短缺问题，草坪护理往往是一个热门的讨论话题。\n鉴于杀虫剂和化肥对环境的影响，以及迫在眉睫的水资源短缺。我很好奇\n理想的美国草坪的形象是如何出现的。\n\n另外，在这个理想的形象成为现实之前，草坪是什么样子？",
      "title": "拥有住房的美国人何时以及为何开始关心绿色、无杂草、浇水充足、经常修剪的草坪？是什么力量促成了这一点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "鑑於殺蟲劑和化肥對環境的影響，以及迫在眉睫的水資源短缺問題，草坪護理往往是一個熱門的討論話題。\n鑑於殺蟲劑和化肥對環境的影響，以及迫在眉睫的水資源短缺。我很好奇\n理想的美國草坪的形象是如何出現的。\n\n另外，在這個理想的形象成爲現實之前，草坪是什麼樣子？",
      "title": "擁有住房的美國人何時以及爲何開始關心綠色、無雜草、澆水充足、經常修剪的草坪？是什麼力量促成了這一點？"
    }
  ]
}