{
  "author": "MeisEmYes",
  "original_created_utc": 1631552879,
  "title": "I fell for that dumb Instagram sugar daddy scam",
  "created_utc": 1631562178,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I (19F) fell for that stupid sugar daddy scam. I should have known better but I for some odd reason just ignored the red flags and went straight in. I guess the money blinded my view or something. I will totally accept you all calling me dumb. I accepted a $3,000 check from this man and deposited it. I was in contact with him back and fourth, all I gave him was my first and last name, which bank I used, and my email. I even sent him a screenshot of the check pending. Thankfully my bank saw through the scam and stopped it from going into my account, they also put my account on sort of a lockdown type thing (I forgot what they called it) and they told the police. Totally embarrassing and caused me a minor panic attack. But even with them doing that am I ok? Like am I not gonna go to prison for a forged check? And is he going to be able to do some funky business with my account? \nI wasn’t sure if this should go into asking legal questions or not.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/pnjpvy/i_fell_for_that_dumb_instagram_sugar_daddy_scam/",
  "subreddit": "NoStupidQuestions",
  "id": "pnjpvy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I (19F) fell for that stupid sugar daddy scam. I should have known better but I\nfor some odd reason just ignored the red flags and went straight in. I guess the\nmoney blinded my view or something. I will totally accept you all calling me\ndumb. I accepted a $3,000 check from this man and deposited…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私（19F）はその愚かなシュガーダディの詐欺に引っかかりました。もっとよく知っておくべきだったのですが\n妙な理由で赤旗を無視してそのまま入ってしまいました。お金に目がくらんだのか\nお金に目がくらんでしまったのかな。皆さんが私のことを馬鹿だと言ってくれても全然構いません。\n馬鹿だと言われても仕方ありません。この男から3,000ドルの小切手を受け取り、入金した...",
      "title": "インスタグラムのシュガーダディ詐欺に騙された"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我（19F）上了那个愚蠢的糖爸爸骗局的当。我应该知道的，但我\n由于一些奇怪的原因，我忽略了那些红旗，直接进去了。我猜想\n金钱蒙蔽了我的视线或什么。我完全接受你们说我\n愚蠢。我接受了这个人的3000美元支票，并将其存入...",
      "title": "我上了那个愚蠢的Instagram糖爸爸骗局的当"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我（19F）上了那個愚蠢的糖爸爸騙局的當。我應該知道的，但我\n由於一些奇怪的原因，我忽略了那些紅旗，直接進去了。我猜想\n金錢矇蔽了我的視線或什麼。我完全接受你們說我\n愚蠢。我接受了這個人的3000美元支票，並將其存入...",
      "title": "我上了那個愚蠢的Instagram糖爸爸騙局的當"
    }
  ]
}