{
  "author": "DoomedKiblets",
  "original_created_utc": 1644241576,
  "title": "Why do people like to watch sports? Like, really. I want to know. I don’t get it.",
  "created_utc": 1644251855,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I legit do not get the appeal of watching sports AT ALL. There is a massive disconnect, most games go a long time, and there is just extreme levels of fandom and nationalism that freaks me out, I know how  baseball is played, but only know the basics of most other sports. I love video games, and have even played competitively with tabletop games like Magic The Gathering. Yet, sports… confound me completely.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not trying to say they are bad, or troll anyone here (it’s just that I personally don’t like it but want to understand too), but I would legit like to know what the appeal is, why you watch, and what you find so enthralling. Am I missing something? Maybe it is just me, but I would still like to know why OTHERS enjoy it so much,&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 119,
  "permalink": "/r/TooAfraidToAsk/comments/smqm19/why_do_people_like_to_watch_sports_like_really_i/",
  "subreddit": "TooAfraidToAsk",
  "id": "smqm19",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I legit do not get the appeal of watching sports AT ALL. There is a massive\ndisconnect, most games go a long time, and there is just extreme levels of\nfandom and nationalism that freaks me out, I know how baseball is played, but\nonly know the basics of most other sports. I love video games, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "スポーツ観戦の魅力がまったくわからない。そこには大きな\nほとんどの試合は長丁場だし、極端なレベルもある。\n野球がどのように行われるかは知っているが、野球がどのように行われるかは知らない。\n他のスポーツは基本的なことしか知らない。テレビゲームが好きで...",
      "title": "人はなぜスポーツを見るのが好きなのだろうか。みたいな、本当に。知りたいんです。理解できないわ"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我完全不明白观看体育比赛的吸引力。有一个巨大的\n我知道棒球是怎么玩的，但我不知道该怎么做。\n我知道棒球是怎么玩的，但只知道其他大多数运动的基本原理。\n我知道棒球是怎么玩的，但只知道大多数其他运动的基础知识。我喜欢视频游戏，而...",
      "title": "为什么人们喜欢看体育节目？就像，真的。我想知道。我不明白。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我完全不明白觀看體育比賽的吸引力。有一個巨大的\n我知道棒球是怎麼玩的，但我不知道該怎麼做。\n我知道棒球是怎麼玩的，但只知道其他大多數運動的基本原理。\n我知道棒球是怎麼玩的，但只知道大多數其他運動的基礎知識。我喜歡視頻遊戲，而...",
      "title": "爲什麼人們喜歡看體育節目？就像，真的。我想知道。我不明白。"
    }
  ]
}