{
  "author": "davpleb",
  "the_new_excerpt": "I have seen a few posts lately of the \"year in review\" crypto investor sharing\nmassive profits from March 2020. Although the numbers are real and I am happy\nfor those who were smart enough to invest during the depths of the crypto bear\nmarket last year, the reality for most in crypto at that time is…",
  "original_created_utc": 1616341540,
  "localize": [
    {
      "locale": "zh",
      "title": "一个2017/2018年投资者的投资组合--Alt-Coin投资的现实与教训。",
      "the_new_excerpt": "最近看到几篇 \"一年回顾 \"加密投资者分享的帖子\n从2020年3月开始大量盈利。虽然这些数字是真实的，我很高兴\n对于那些足够聪明，在加密熊的深渊中投资的人来说。\n去年的市场，对于当时大多数在加密领域的人来说，现实是..."
    },
    {
      "locale": "zh-Hant",
      "title": "一個2017/2018年投資者的投資組合--Alt-Coin投資的現實與教訓。",
      "the_new_excerpt": "最近看到幾篇 \"一年回顧 \"加密投資者分享的帖子\n從2020年3月開始大量盈利。雖然這些數字是真實的，我很高興\n對於那些足夠聰明，在加密熊的深淵中投資的人來說。\n去年的市場，對於當時大多數在加密領域的人來說，現實是..."
    }
  ],
  "title": "A Portfolio of a 2017/2018 Investor - The Reality & Lessons Alt-Coin investing",
  "created_utc": 1616358850,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have seen a few posts lately of the &quot;year in review&quot; crypto investor sharing massive profits from March 2020. Although the numbers are real and I am happy for those who were smart enough to invest during the depths of the crypto bear market last year, the reality for most in crypto at that time is that we were part of the 2017/2018 frenzy/bubble. Unless you invested in Bitcoin, Ethereum, or a very, very few others, you are more than likely nowhere near getting back to what you originally invested.</p>\n\n<p>I wanted to share what the reality looks like for me and my guess many others who invested before the latest bull market.</p>\n\n<p><strong>My Crypto Investing Journey</strong></p>\n\n<p>I purchased my first crypto back in June 2017. I believed in blockchain technology and the future benefit it can (and will) bring to the world. This made me really focus on more altcoins than Bitcoin. </p>\n\n<p>I always tried and researched what problem the altcoin was trying to solve before I invested in it. Although I truly tried to spend the necessary time researching every altcoin before I invested, I will tell you that when you are in the middle of a frenzy like the 2017/2018 bubble (and even today), it is hard not to get caught up in FOMO of it all.</p>\n\n<p><strong>The Reality</strong></p>\n\n<p>Below is my current portfolio of the crypto that I bought and continue to hodl from 2017/2018. I did not want to share how much I hold but more what I purchased each crypto for back in 2017/2018, and where the current price stands today.</p>\n\n<p>As you can see, the reality of altcoin investing then is still far from seeing anywhere close to breakeven returns 3+ years later. I share this because the current altcoin action happening today is eerily similar to 2017/2018. </p>\n\n<p>Back then, I  thought lambos and mansions were right around the corner and my portfolio was up 400%.....until it wasn&#39;t.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gyknnqhvgeo61.png?width=371&amp;format=png&amp;auto=webp&amp;s=2f70482ec5b00688d72d99ed38e8786e9959a416\">My Altcoin Portfolio - 3.21.2021</a></p>\n\n<p><strong>The Lessons</strong></p>\n\n<p>Everyone is different and is in crypto for different reasons. Most of the lessons I share have been said before.</p>\n\n<p><strong>1) If you are truly buying an altcoin just for the profits, do not get greedy - Just sell it.</strong> Most, if not all altcoins will crash to levels that leave you holding the bag. Decide your sell price beforehand and stick to it. Sell it when it hits that price - no matter what. Remember, most of these coins are unfinished projects and will probably stay that way.</p>\n\n<p><strong>2) Altcoin investing is not a &quot;sit it and forget it&quot; strategy.</strong> Again - nearly every altcoin is an unfinished project meaning if you think you can just buy and then come back 5 years later to collect your profits, you are wrong. Altcoin projects change direction, team leadership. and even blockchains. </p>\n\n<p>A prime example of this is ENG (Enigma) and ICX (Icon). Both awesome projects I believed (and still do)  solve a problem. I bought both in late 2017 &amp; early 2018. After the crash, I thought I would be fine just forgetting about them for a while - WRONG. ENG had a coin swap to Secret(SCRT) and I missed the swap timeline basically leaving me and I am sure others holding coins that no longer have value. Icon(ICX) moved to another blockchain. Luckily, the ICX team recently provided a way for those like me a way to swap (Thanks ICX team!)</p>\n\n<p>I am giving you these example because so many people think of altcoins the same as holding stock. This is not like holding Microsoft stock from 1990 where is just keep multiplying for you. You have to stay engaged in these projects otherwise you will lose everything.</p>\n\n<p>Just to be clear - me being left behind is 100% on me. Both the SCRT and ICX projects are great and I would recommend anyone interested in altcoin investing to look into both. Just understand that these altcoins are under no obligation to keep you whole as they move their projects forward.</p>\n\n<p><strong>3) Recognize &amp; get comfortable in taking losses. Don&#39;t get stuck holding a bag you can&#39;t get out of.</strong> If you FOMO&#39;d in and got caught in a pump &amp; dump scheme. Unless you truly believe the project and value will get back to where it was (most won&#39;t), then tip your cap to getting caught and sell/learn for next time. Sitting on dead money hoping you will break even will leave you missing out on other projects in the quickly changing crypto landscape. Take it from me - I have sat on a portfolio that is over half what I invested. </p>\n\n<p>Even though I could have just taken my losses I didn&#39;t because I was so focused on the &quot;if you do sell, you do lose money&quot; mentality. I should have understood that I do not have to be right on all my altcoin investments - I just need to be right on one of them.</p>\n\n<p><strong>Final Thoughts</strong></p>\n\n<p>Look - if you believe in and are excited about a project, then profits do not matter anyway. Get engaged with the team, join their discord and reddit subs, and do your part to help move the project forward.</p>\n\n<p>Good Luck with your altcoin investing strategy and I hope everyone reaches their personal moons - whatever that may be!</p>\n</div><!-- SC_ON -->",
  "score": 475,
  "permalink": "/r/CryptoCurrency/comments/m9zcm7/a_portfolio_of_a_20172018_investor_the_reality/",
  "subreddit": "CryptoCurrency",
  "id": "m9zcm7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816905
}