{
  "author": "marchdk2016",
  "the_new_excerpt": "I’ll be completely honest. For long chunks of my life I’ve lived with tunnel\nvision. As long as I was okay, I didn’t care too much about what was going on in\nthe world outside of that. I lived in a bubble, and I was happy with that.\n\nThe past year has been too painful to ignore. Even though I’ve…",
  "original_created_utc": 1615202140,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我完全坦白。在我生命的很长一段时间里，我一直生活在隧道里。\n视觉。只要我没事，我就不会太在意发生在我身上的事情。\n外面的世界。我生活在一个泡沫中，我对此很满意。\n\n过去的一年太痛苦了，我无法忽视。尽管我已经...",
      "title": "我很快就会变成一个社会主义者"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我完全坦白。在我生命的很長一段時間裏，我一直生活在隧道里。\n視覺。只要我沒事，我就不會太在意發生在我身上的事情。\n外面的世界。我生活在一個泡沫中，我對此很滿意。\n\n過去的一年太痛苦了，我無法忽視。儘管我已經...",
      "title": "我很快就會變成一個社會主義者"
    }
  ],
  "title": "I’m quickly turning into a socialist",
  "created_utc": 1615226020,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ll be completely honest. For long chunks of my life I’ve lived with tunnel vision. As long as I was okay, I didn’t care too much about what was going on in the world outside of that. I lived in a bubble, and I was happy with that.</p>\n\n<p>The past year has been too painful to ignore. Even though I’ve been fortunate, I’m more aware of how others are not. While your average person might be suffering, the rich continue to get richer. The company I work for netted billions of dollars this year and had the nerve to complain that they were beneath their goal numbers. </p>\n\n<p>For me this past year was a turning point, and I think it may have been for a lot of others as well. Last Fall I voted for the first time in ten years. If we were going to spend another 4 years with Trump as our president then I needed to at least be able to tell my little girls I did my part to try and stop it. </p>\n\n<p>I joined the crypto world not too long ago as well. If I’m being honest, I joined for the investment opportunity as many of us have. Years in the corporate world sucks the life out of you and this seemed like it may offer me a way out. The bullshitting and brown nosing quickly grows old and I’m not sure I can last as long as I need to.</p>\n\n<p>The reason I’m staying in the crypto world isn’t because of the investment opportunity, but because I believe in the DeFi future. We cannot continue to rely on the government and big banks to protect us and continue to be let down by them, we cannot continue to let them rob us of our money by forcing us to pay for their unnecessary services, and we need to give second and third world countries better opportunities to succeed. </p>\n\n<p>There’s too many people with too much money and too many people with not enough. I want to see that changed.</p>\n\n<p>Moons are the next step on my socialist journey. The last couple months has been eye-opening in terms of the power of moons. People are paying utility bills with their moons, people are able to pay rent in some countries with their moons. We now have this special power granted to us. Just by giving someone an upvote we can essentially donate a small amount of money at no cost to ourselves. I think that’s amazing and I hope others enjoy the beauty in that just by clicking a button we can help make someone else’s life a little better.</p>\n\n<p>I never thought I would be this kind of person. I’m not talking about the sharing the wealth aspect of being a socialist. I’ve always enjoyed spreading the love. I’m talking about turning into a radical who wants to change the world. Screw the banks, Fuck the system, let’s make the world a better place.</p>\n</div><!-- SC_ON -->",
  "score": 359,
  "permalink": "/r/CryptoCurrency/comments/m0dl22/im_quickly_turning_into_a_socialist/",
  "subreddit": "CryptoCurrency",
  "id": "m0dl22",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542573499
}