{
  "author": "foodfighter",
  "original_created_utc": 1631201560,
  "title": "Is the life-arc of a star determined 100% by its starting mass, or are there other factors involved?",
  "created_utc": 1631219842,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I understand that there are varying types and sizes of stars (red giants, blue dwarfs, etc.) and that a star can take on multiple &quot;forms&quot; as it ages and the composition of its fuel changes.  </p>\n\n<p>I understand that the mass of a star defines many of its key attributes, but is a star&#39;s lifespan and other features <strong>solely</strong> based upon its starting mass?  Or are there other considerations that determine when and how it changes form?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askscience/comments/pl03tq/is_the_lifearc_of_a_star_determined_100_by_its/",
  "subreddit": "askscience",
  "id": "pl03tq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I understand that there are varying types and sizes of stars (red giants, blue\ndwarfs, etc.) and that a star can take on multiple \"forms\" as it ages and the\ncomposition of its fuel changes.\n\nI understand that the mass of a star defines many of its key attributes, but is\na star's lifespan and other…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "星には様々な種類と大きさ（赤色巨星、青色矮星など）があり、星は複数の形態をとることができると理解しています。\n矮星など）があり、星は年齢や燃料の組成の変化に伴って、さまざまな「形」になることは理解しています。\n燃料の組成が変わると、星は複数の「形」になることを理解している。\n\n星の質量が、その星の重要な属性の多くを決定することは理解していますが、星の質量はどのようなものでしょうか？\n星の寿命やその他の...",
      "title": "星の寿命は出発質量で100％決まるのでしょうか、それとも他の要因があるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道，恒星有不同的类型和大小（红巨星、蓝\n等），而且随着年龄的增长和燃料成分的变化，一颗恒星可以呈现出多种 \"形态\"。\n一个恒星随着年龄的增长和其燃料成分的变化，会呈现出多种 \"形态\"。\n\n我知道，一颗恒星的质量决定了它的许多关键属性，但它的寿命是否也是如此？\n一颗恒星的寿命和其他...",
      "title": "一颗恒星的寿命弧度是100%由其起始质量决定的，还是有其他因素的参与？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道，恆星有不同的類型和大小（紅巨星、藍\n等），而且隨着年齡的增長和燃料成分的變化，一顆恆星可以呈現出多種 \"形態\"。\n一個恆星隨着年齡的增長和其燃料成分的變化，會呈現出多種 \"形態\"。\n\n我知道，一顆恆星的質量決定了它的許多關鍵屬性，但它的壽命是否也是如此？\n一顆恆星的壽命和其他...",
      "title": "一顆恆星的壽命弧度是100%由其起始質量決定的，還是有其他因素的參與？"
    }
  ]
}