{
  "author": "Quaker16",
  "original_created_utc": 1630982024,
  "title": "Zoroastrianism was probably the most followed monotheistic religion for at least a thousand years. Yet to my knowledge, the Christian Bible and Jewish Talmud is silent on its existence. Why?",
  "created_utc": 1630988935,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There were many Zoroastrian communities living under Roman rule during the time of Paul. Why didn’t early Christians focus on converting them?  Was their political ramifications for Christians challenging Zoroastrianism?  </p>\n\n<p>Did early Jews view Zoroastrians as believers in the same god?  They must have had contact with Zoroastrian believers during their exile to Persia.</p>\n\n<p>Did either the Jews or the early Christians recognize the similarities between their religions and Zoroastrian beliefs?</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/AskHistorians/comments/pje30i/zoroastrianism_was_probably_the_most_followed/",
  "subreddit": "AskHistorians",
  "id": "pje30i",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There were many Zoroastrian communities living under Roman rule during the time\nof Paul. Why didn’t early Christians focus on converting them? Was their\npolitical ramifications for Christians challenging Zoroastrianism?\n\nDid early Jews view Zoroastrians as believers in the same god? They must…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "パウロの時代には、ローマの支配下に多くのゾロアスター教のコミュニティが存在していました。\nパウロの時代 なぜ初期のクリスチャンは彼らの改宗に力を入れなかったのでしょうか？それは、彼らの\nキリスト教徒がゾロアスター教に挑戦することは、政治的に問題があったのでしょうか？\n\n初期のユダヤ人は、ゾロアスター教徒を同じ神を信じる者として見ていたのですか？彼らはきっと...",
      "title": "ゾロアスター教は、少なくとも1000年の間、最も信奉されていた一神教でしょう。しかし、私の知る限り、キリスト教の聖書やユダヤ教のタルムードは、その存在について沈黙しています。なぜだろう？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在保罗时代，有许多拜火教团体生活在罗马的统治之下。\n保罗的时候。为什么早期的基督徒不把重点放在皈依他们上？是他们的\n基督徒挑战琐罗亚斯德教的政治后果？\n\n早期犹太人是否将拜火教视为同一神的信徒？他们必须...",
      "title": "琐罗亚斯德教可能是最受关注的一神论宗教，至少有一千年的时间。然而据我所知，基督教的《圣经》和犹太教的《塔木德》都没有提到它的存在。为什么呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在保羅時代，有許多拜火教團體生活在羅馬的統治之下。\n保羅的時候。爲什麼早期的基督徒不把重點放在皈依他們上？是他們的\n基督徒挑戰瑣羅亞斯德教的政治後果？\n\n早期猶太人是否將拜火教視爲同一神的信徒？他們必須...",
      "title": "瑣羅亞斯德教可能是最受關注的一神論宗教，至少有一千年的時間。然而據我所知，基督教的《聖經》和猶太教的《塔木德》都沒有提到它的存在。爲什麼呢？"
    }
  ]
}