{
  "author": "Estri_Grobbulus",
  "the_new_excerpt": "Bottom Line Up Front (BLUF) or TL;DR for the non-military types:\n\nLMT is a good target if you want to literally go to the moon, and my PT is\n$690.26 in two years (more than 2x from current levels). Justification and some\npossible trade ideas are listed below, just CTRL-F “Trade Ideas”. I hope…",
  "original_created_utc": 1612197578,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "底线上阵(BLUF)或TL;DR为非军事型。\n\nLMT是一个很好的目标，如果你想从字面上去月球， 和我的PT是：\n两年690.26美元（比目前的水平高出2倍多）。理由和一些\n下面列出了可能的交易思路，只要CTRL-F \"交易思路\"。我希望...",
      "title": "LMT：深度挖掘"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "底線上陣(BLUF)或TL;DR爲非軍事型。\n\nLMT是一個很好的目標，如果你想從字面上去月球， 和我的PT是：\n兩年690.26美元（比目前的水平高出2倍多）。理由和一些\n下面列出了可能的交易思路，只要CTRL-F \"交易思路\"。我希望...",
      "title": "LMT：深度挖掘"
    }
  ],
  "title": "LMT: A Deep Dive",
  "created_utc": 1612205852,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bottom Line Up Front (BLUF) or TL;DR for the non-military types:</p>\n\n<p>LMT is a good target if you want to literally go to the moon, and my PT is $690.26 in two years (more than 2x from current levels). Justification and some possible trade ideas are listed below, just CTRL-F “Trade Ideas”. I hope you guys enjoy this work and would appreciate any discussion or feedback. I hope to catch you in the comments.</p>\n\n<p>Team,</p>\n\n<p>We interrupt today’s regularly scheduled short squeeze coverage to discuss a traditionally boring stock, LMT (Lockheed Martin), with significant upside potential. To be clear, this is NOT a short squeeze target like many reddit posts are keying on. I hope that this piece sparks discussion, but if you are just looking for short squeeze content, all I have to say is BUY, HOLD, and GODSPEED.</p>\n\n<p>The source of inspiration for me writing this piece is threefold; first, retail investors are winning, and I believe that we will continue to win if we continue to identify opportunities in the market. In my view, the stock market has always been a place for the public to shine a light on areas of innovation that real Americans are excited about and proud to be a part of. Online communities have stolen the loudspeaker from hedge fund managers and returned it to decentralized online democracies that quickly and proudly shift their weight behind ideas they believe in. In GME’s case, it was a blatant smear campaign to destroy a struggling business. I think that we should continue this campaign by identifying opportunities in the market and running with them. It may sound overly idealistic, but if reddit can take on the hedge funds, I non-ironically believe that we can quite literally take good companies researching space technology to the moon. I think LMT may be one of several stocks to help get us there.</p>\n\n<p>Second, a video where the Secretary of State of Massachusetts argues that internet boards are full of a bunch of unsophisticated, thoughtless traders really ticked me off. This piece is designed to show that ‘the little guy’ is ready to get into the weeds, understand business plans, and outpace analysts that think companies like Tesla are overvalued by comparing them to Toyota. That is a big reason that I settled on an old, large, slow growth company to do a deep-dive on, and try my best to show some of the abysmal predictive analysis major ‘research firms’ do on even some of the most heavily covered stocks. LMT is making moves, and the suits on wall street are 10 steps behind. At the time of writing this piece, Analyst Estimates range from 330-460 (what an insane range).</p>\n\n<p>Third, and most importantly, I am in the US military, and I think that it is fun to go deep into the financials of the defense sector. I think that it helps me understand the long-term growth plans of the DoD, and I think that I attack these deep-dives with a perspective that a lot of these finance-from-day-one cats do not understand. Even if no one ever looks at this work, I think that taking the time to write pieces like this makes me a better Soldier, and I will continue to do it in my spare time when I am feeling inspired. I wrote a piece on Raytheon Technologies (Ticker: RTX) 6 months ago, and I think it was well-received. I was most convicted about RTX in the defense sector, but I have since shifted to believing LMT is the leader in the defense space. I am long both, though. If this inspires anyone else to do similar research on other companies, or sparks discussion in the community, that is just a bonus. Special shout-out to the folks that read more than just the TL;DR, but if you do just read the TL;DR, I love you too!</p>\n\n<p>Now let us get into it:</p>\n\n<p><strong>Leadership</strong></p>\n\n<p>I generally like to invest in companies that are led by people that seem to have integrity. Jim Taiclet took the reins at LMT in June of last year. While on active duty, he served as a C-141B Starlifter pilot (a retired LMT Aircraft). After getting out he went to work for the American Tower Corporation (Ticker: AMT). His first day at American Tower was September 10, 2001. The following day, AMT lost 13 employees in the World Trade Center attack. He stayed with the company, despite it being decimated by market uncertainty in the wake of 9/11. He was appointed CEO of the very same company in 2004. Over a 16 year tenure as CEO of AMT the company market cap 20x’d. He left his position as CEO of AMT in March of last year, and the stock stagnated since his departure, currently trading at roughly the same market cap as to when he left.</p>\n\n<p>Jim Taiclet was also appointed to be the chairman of the board this week, replacing the previous CEO. Why is it relevant that the CEO came from a massive telecommunications company?</p>\n\n<p>Rightfully, Taiclet’s focus for LMT is bringing military technology into the modern era. He wants LMT to be a first mover in the military 5G space, military application of AI space, the… space space, and the hypersonic glide vehicle (HGV) space. These areas are revolutionary for the boomer defense sector. We will discuss this in more detail later when we cover the company’s P/E multiple and why it is absolute nonsense.</p>\n\n<p>It is not a surprise to me that they brought Taiclet on during the pandemic. He led AMT through adversity before, and LMT’s positioning during the pandemic is tremendous relative to the rest of the sector, thanks in large part to some strong strategic moves and good investments by current and past leadership. I think that Taiclet is the right CEO for the job.</p>\n\n<p>In addition to the new CEO, the new Secretary of Defense, Secretary Lloyd Austin, has strong ties to the defense sector. He was formerly a board member for RTX. He is absolutely above reproach, and a true leader of character, but I bring this up not to suggest that he will inappropriately serve in the best interest of defense contractors, but to suggest that he speaks the language of these companies effectively. I do not anticipate that the current administration poses as significant of a risk to the defense sector as many analysts seem to believe. This will be expanded in the headwinds section below.</p>\n\n<p><strong>SPACE</strong></p>\n\n<p>Cathie Wood and the ARK Invest team brought a lot of attention to the space sector when the ARKX, The ARK Space Exploration ETF, Form N-1A was officially filed through the SEC. More recently, ARK Invest published their Big Ideas 2021 Annual Report and dedicated an entire 7-page chapter to Orbital Aerospace, a new disruptive innovation platform that the ARK Team is investigating. This may have helped energize wall street to re-look their portfolios and their investments in space technology, but it was certainly not the first catalyst that pushed the defense industry in the direction of winning the <em>new</em> space race.</p>\n\n<p>In June 2018, then President Trump announced at the annual National Space Council that “it is not enough to merely have an American presence in space, we must have American dominance in space. So important. Therefore, I am hereby directing the Department of Defense (DoD) and Pentagon to immediately begin the process necessary to establish a Space Force as the sixth branch of the Armed Forces&quot;. Historically, Department of Defense space assets were under the control of the Air Force. By creating a separate branch of service for the United States Space Force (USSF), the DoD would allocate a Chairman of Space Operations on the Joint Chiefs of Staff and clearly define the budget for space operations dedicated directly to the USSF. At present, this budget is funneled from the USAF’s budget. The process was formalized in December of 2019, and the DoD has appropriated ~$15B to the USSF in their first full year of existence according to the FY21 budget.</p>\n\n<p>Among the 77 spacecraft that are controlled by the USSF, 29 of them are Lockheed Martin GPS satellites, 6 of them are Lockheed Martin Space-Based Infrared Systems (SBIRS), and LMT had a hand in creating and/or manufacturing for several of the other USSF efforts. The Next Generation Overhead Persistent Infrared Missile Warning Satellites (also known as Next-Gen OPIR) were contracted out to both Northrup Grumman (Ticker: NOC) and LMT. LMT’s contract is currently set at $4.9B, NOC’s contract is set at $2.37B.</p>\n\n<p>Tangentially related to the discussion of space is the discussion of hypersonic glide vehicles (HGVs). HGVs have exoatmospheric and atmospheric implications, but I think that their technology is extremely important to driving margins down for both space exploration and terrestrial point-to-point travel. LMT is leading the charge for military HGV research. They hold contracts with the Navy, Air Force, and Army to develop HGVs and hypersonic precision fires. The priority for HGV technology accelerated significantly when Russia launched their Avangard HGV in December of 2019. Improving the technology for HGVs is a critical next-step in maintaining US hegemony, but also maintaining leadership in both terrestrial and exoatmospheric travel.</p>\n\n<p><strong>LARGE SCALE COMBAT OPERATIONS (LSCO)</strong></p>\n\n<p>The DoD transitioning to Large-Scale Combat Operations (LSCO) as the military’s strategic focus. This is a move away from an emphasis on Counter-Insurgency operations. LSCO requires effective multi-domain operations (MDO), which means effective and integrated strategies regarding land, sea, air, space, and cyberspace. To have effective MDO, the DoD is seeking systems that both expand capabilities against peer threats and increase the ability to track enemy units and communicate internally. This requires a modernizing military strategy that relies heavily on air, missile, and sensor modernization. Put simply, the DoD has decided to start preparing for peer or near-peer adversaries (China, Russia, Iran, North Korea) rather than insurgencies. For this reason, I believe that increased Chinese and Russian tensions are, unfortunate as it may be, a boon to the defense industry. This is particularly true in the missiles/fires and space industry, as peer-to-peer conflicts are won by leveraging technological advantages.</p>\n\n<p>There are too many projects to cover in detail, but some important military technologies that LMT is focusing on to support LSCO include directed energy weapons (lasers) to address enemy drone technology, machine learning / artificial intelligence (most applications fall under LMT’s classified budget, but it is easy to imagine the applications of AI in a military context), and 5G to increase battlefield connectivity. These projects are all nested within the DoD’s LSCO strategy, and position LMT as the leader in emergent military tech. NOC is the other major contractor making a heavy push in the modernization direction, but winners win, and I think a better CEO, balance sheet, and larger market cap make LMT the clear winner for aiding the DoD in a transition toward LSCO.</p>\n\n<p><strong>SECTOR COMPARISON (BACKLOG)</strong></p>\n\n<p>The discussion of LSCO transitions well into the discussion of defense contractor backlogs. Massive defense contracts are not filled overnight, so examining order backlogs is a relatively reliable way to gauge the interest of the DoD in a defense contractor’s existing or emerging products. For my sector comparison, I am using the top 6 holdings of the iShares U.S. Aerospace &amp; Defense ETF (Ticker: ITA). I hate this ETF, and ETFs like it (DFEN) because of their massively outsized exposure to aerospace, and undersized allocation to companies like LMT. LMT is only 18% smaller than Boeing (Ticker: BA) but is only 30.4% of the exposure of BA (18.46% of the fund is BA, only 5.62% of the fund is LMT). Funds of this category are just BA / RTX hacks. I suggest building your own pie on a site like M1 Finance (although they are implicated in the trade restriction BS… please be advised of that… hoping other brokerages that are above board will offer similar UIs like the pie design… just wanted to be clear there) if you are interested in the defense sector.</p>\n\n<p>The top 6 holdings of ITA are:</p>\n\n<p>Boeing Company (Ticker: BA, MKT CAP $110B) at 18.46%</p>\n\n<p>Raytheon Technologies (Ticker: RTX, MKT CAP $101B) at 17.84%</p>\n\n<p>Lockheed Martin (Ticker: LMT, MKT CAP $90B) at 5.62%</p>\n\n<p>General Dynamics Corporation (Ticker: GD, MKT CAP $42B) 4.78%</p>\n\n<p>Teledyne Technologies Incorporated (Ticker: TDY, MKT CAP $13B) at 4.74%</p>\n\n<p>Northrop Grumman Corporation (Ticker: NOC, MKT CAP $48B) at 4.64%</p>\n\n<p>As a brief aside, please look at the breakdowns of ETFs before buying them. The fact that ITA has more exposure to TDY than NOC and L3Harris is wild. Make sector ETFs balanced how you want them to be balanced and it will be more engaging, and you will likely outperform. I digress.</p>\n\n<p>Backlogs for defense companies can easily be pulled from their quarterly reports. Here are the current backlogs in the same order as before, followed by a percentage of their backlog to their current market cap. All numbers are pulled from January earning reports unless otherwise noted with an * because they are still pending.</p>\n\n<p><strong>Boeing Company</strong> backlog (Commercial: $282B, Defense: $61B, Foreign Military Sales (FMS, categorized by BA as ‘Global’): 21B, Total Backlog 364B): BA’s backlog to market cap is a ratio of 3.32, which is strong, but most of that backlog comes from the commercial, not the defense side. Airlines have been getting decimated, I am personally not interested in having much of my backlog exposed to commercial pressures when trying to invest in a defense play. Without commercial exposure, their defense only backlog ratio is .748. This is extremely low. I understand that this does not do BA justice, but I am keying in on defense exposure, and I am left thoroughly unsatisfied by that ratio. Also, we have seen several canceled contracts already on the commercial side.</p>\n\n<p><strong>Raytheon Technologies</strong> backlog (Defense backlog for all 4 subdivisions: 67.3B): Raytheon only published a defense backlog in this quarter’s report. That is further evidence to me that the commercial aerospace side of the house is getting hammered. They have a relatively week backlog to market cap as well, putting them at a ratio of .664, worse off than the BA defense backlog.</p>\n\n<p><strong>Lockheed Martin</strong> backlog (Total Backlog: $147B): This backlog blows our first two defense backlogs out of the water with a current market cap to backlog ratio of 1.63.</p>\n\n<p><strong>General Dynamics Corporation</strong> backlog (Total Backlog: $89.5B, $11.6B is primarily business jets, but it is difficult to determine how much of their aerospace business is commercial): Solid 2.13 ratio, still great 1.85 if you do not consider their aerospace business. The curveball here for me is that GD published a consolidated operating profit of $4.1B including commercial aerospace, whereas LMT published a consolidated operating profit of $9.1B. This makes the LMT ratio of profit/market cap slightly in favor of LMT without accounting for the GD commercial aerospace exposure. This research surprised me; I may like GD more than I originally assumed I would. Still prefer LMT.</p>\n\n<p><strong>Teledyne Technologies Incorporated</strong> backlog (Found in the earnings transcript, $1.7B): This stock is not quite in the same league as the other major contractors. This is an odd curveball that a lot of the defense ETFs seem to have too much exposure to. They have a weak backlog, but they are a smaller growing company. I am not interested in this at all. It has a backlog ratio of .129.</p>\n\n<p><strong>Northrop Grumman Corporation</strong> backlog ($81B): Strong numbers here. I see NOC and LMT as the two front-runners in the defense sector. I like LMT more because I like their exposure to AI, 5G, and HGVs more than NOC, but I think this is a great alternative to LMT if you like the defense sector. Has a ratio of 1.69, slightly edging out LMT on this metric. LMT edges out NOC on margins by ~.9%, though, which has significant implications when considering the depth of the LMT backlog.</p>\n\n<p>The winners here are LMT, GD, and NOC. BA is attractive if you think anyone will have enough money to buy new planes. BA and RTX are both getting hammered by commercial aerospace exposure right now and are much more positioned as recovery plays. That said, LMT and NOC both make money now, and will regardless of the impact of the pandemic. LMT is growing at a slightly faster rate than NOC. Both are profit machines, but I like LMT’s product portfolio and leadership a lot more.</p>\n\n<p><strong>FREE CASH FLOW</strong></p>\n\n<p>Despite the pandemic, LMT had the free cash flow to be able to pay a $2.60 per share dividend. This maintains their ~3% yearly dividend rate. They had a free cash flow of $6.4B. They spent $3.9 of that in share repurchases and dividend payouts. That leaves 40% of that cash to continue to strengthen one of the most stalwart balance sheets outside of big tech on the street. Having this free cash flow allowed them to purchase Aerojet Rocketdyne for $4.4B in December. They seem flexible and willing to expand and take advantage of their relative position during the pandemic. This is a stock that has little downside risk and significant upside potential. It is always reassuring to me to know that at the end of the day, a company is using its profit to continue to grow.</p>\n\n<p><strong>HEADWINDS</strong></p>\n\n<p><strong>New Administration</strong> – This is more of an unknown than a headwind. The Obama Administration was not light on military spending, and the newly appointed SecDef is unlikely to shy away from modernizing the force. Military defense budgets may get lost in the political shuffle, but nothing right now suggests that defense budgets are on the chopping block.</p>\n\n<p><strong>Macroeconomic pressure</strong> – The markets are tumultuous in the wake of GME. Hedgies are shaking in their boots, and scared money weighed on markets the past week. If scared money continues to exert pressure on the broader equity markets, all boomer stocks are likely weighed down by slumping markets.</p>\n\n<p><strong>Non-meme Status</strong> – The stocks that are impervious to macroeconomic pressures in the above paragraph are the stonks that we, the people, have decided to support. From GME to IPOE, there is a slew of stonks that are watching and laughing from the green zone as the broader markets slip deeper into the red zone. Unless sentiment about LMT changes, I see no evidence that LMT will remain unaffected by a broader economic downturn (despite showing growth YoY during a pandemic).</p>\n\n<p><strong>TAILWINDS</strong></p>\n\n<p><strong>Aerojet Rocketdyne to the Moon</strong> – Cathie Wood opened up a $39mil position in LMT a few weeks ago, and this was near the announcement of ARKX. The big ideas 2021 article focuses heavily on satellite technology, deep learning, and HGVs. I think that the AR acquisition suggests that vertical integration is a priority for LMT. They even fielded a question in their earnings call about whether they were concerned about being perceived as a monopoly. Their answer was spot on—the USFG and DoD have a vested interest in the success of defense companies. Why would they discourage a defense contractor from vertical integration to optimize margins?</p>\n\n<p><strong>International Tensions</strong> – SolarWinds has escalated US-Russia tensions. President Biden wants to look tough on China. LSCO is a DoD-wide priority.</p>\n\n<p><strong>5G.Mil</strong> – We still do not have a lot of fidelity on what this looks like, but the military would benefit in a lot of ways if we had world-wide access to the rapid transfer of encrypted data. Many units still rely on Vietnam-era technology signal technology with abysmal data rates. There are a lot of implications if the code can be cracked to win a DoD 5G contract.</p>\n\n<p><strong>TRADE IDEAS</strong></p>\n\n<p><strong>Price Target:</strong> LMT is currently at a P/E of ~14. Verizon has roughly the same. LMT’s 5-year P/E ratio average is ~17. NOC is currently at a P/E of ~20. TSLA has a P/E Ratio of 1339 (disappointingly not 1337). P/E is a useless metric because no one seems to care about it. My point is that LMT makes a lot of money, and other companies that are valued at much higher multiples do not make any money at all. LMT’s P/E ratio is that of a boomer stock that has no growth potential. LMT’s P/E is exactly in line with the Aerospace and Defense Industry P/E ratio standard. LMT’s new CEO is pushing the industry in a new direction. I will arbitrarily choose a P/E ratio of 30, because it is half of the software industry average, and it is a nice round number. Plus, stock values are speculative and nonsense anyway.</p>\n\n<p>Share price today: $321.82</p>\n\n<p>Share price based on LMT average 5-year P/E: $384.08 (I see this as a short term PT, reversion to the mean)</p>\n\n<p>Share price with a P/E of 30: $690.26</p>\n\n<p><strong>Buy and Hold:</strong> Simple. Doesn’t take much thought. Come back in a year or two and be happy with your tendies (and a few dividends to boot).</p>\n\n<p><strong>LEAPS Call Debit Spread (Based on last trade prices):</strong> Buy $375 C 20 JAN 23 for $26.5, Sell $450 C 20 JAN 23 for $12. Total Cost $14.5 for a spread width of $75. Max gain 517% per spread. Higher risk strategy.</p>\n\n<p><strong>LEAPS</strong>: Buy $500 C 20 JAN 23 for $7.20. Very high-risk strat. If the price target is hit within two years, these would be in the money $183 per contract for a gain of 2500%. This is the casino strat.</p>\n\n<p><strong>SOURCES</strong></p>\n\n<p><a href=\"https://www.lockheedmartin.com/en-us/news/features/2020/james-taiclet-from-military-pilot-to-successful-ceo.html\">https://www.lockheedmartin.com/en-us/news/features/2020/james-taiclet-from-military-pilot-to-successful-ceo.html</a></p>\n\n<p><a href=\"https://www.warren.senate.gov/newsroom/press-releases/in-response-to-senator-warrens-questions-secretary-of-defense-nominee-general-lloyd-austin-commits-to-recusing-himself-from-raytheon-decisions-for-four-years\">https://www.warren.senate.gov/newsroom/press-releases/in-response-to-senator-warrens-questions-secretary-of-defense-nominee-general-lloyd-austin-commits-to-recusing-himself-from-raytheon-decisions-for-four-years</a></p>\n\n<p><a href=\"https://news.lockheedmartin.com/2019-08-30-Lockheed-Martins-Expertise-in-Hypersonic-Flight-Wins-New-Army-Work\">https://news.lockheedmartin.com/2019-08-30-Lockheed-Martins-Expertise-in-Hypersonic-Flight-Wins-New-Army-Work</a></p>\n\n<p><a href=\"https://www.lockheedmartin.com/en-us/capabilities/hypersonics.html\">https://www.lockheedmartin.com/en-us/capabilities/hypersonics.html</a></p>\n\n<p><a href=\"https://research.ark-invest.com/hubfs/1_Download_Files_ARK-Invest/White_Papers/ARK%E2%80%93Invest_BigIdeas_2021.pdf?hsCtaTracking=4e1a031b-7ed7-4fb2-929c-072267eda5fc%7Cee55057a-bc7b-441e-8b96-452ec1efe34c\">https://research.ark-invest.com/hubfs/1_Download_Files_ARK-Invest/White_Papers/ARK%E2%80%93Invest_BigIdeas_2021.pdf?hsCtaTracking=4e1a031b-7ed7-4fb2-929c-072267eda5fc%7Cee55057a-bc7b-441e-8b96-452ec1efe34c</a></p>\n\n<p><a href=\"https://www.deseret.com/2018/6/19/20647309/twitter-reacts-to-trump-s-call-for-a-space-force\">https://www.deseret.com/2018/6/19/20647309/twitter-reacts-to-trump-s-call-for-a-space-force</a></p>\n\n<p><a href=\"https://comptroller.defense.gov/Portals/45/Documents/defbudget/fy2021/fy2021_Budget_Request_Overview_Book.pdf\">https://comptroller.defense.gov/Portals/45/Documents/defbudget/fy2021/fy2021_Budget_Request_Overview_Book.pdf</a></p>\n\n<p><a href=\"https://www.airforcemag.com/lockheed-receives-up-to-4-9-billion-for-next-gen-opir-satellites/\">https://www.airforcemag.com/lockheed-receives-up-to-4-9-billion-for-next-gen-opir-satellites/</a></p>\n\n<p><a href=\"https://spacenews.com/northrop-grumman-gets-2-3-billion-space-force-contract-to-develop-missile-warning-satellites/\">https://spacenews.com/northrop-grumman-gets-2-3-billion-space-force-contract-to-develop-missile-warning-satellites/</a></p>\n\n<p><a href=\"https://www.lockheedmartin.com/en-us/capabilities/directed-energy/laser-weapon-systems.html\">https://www.lockheedmartin.com/en-us/capabilities/directed-energy/laser-weapon-systems.html</a></p>\n\n<p><a href=\"https://emerj.com/ai-sector-overviews/lockheed-martins-ai-applications-for-the-military/\">https://emerj.com/ai-sector-overviews/lockheed-martins-ai-applications-for-the-military/</a></p>\n\n<p><a href=\"https://www.defenseone.com/business/2020/07/new-ceo-wants-lockheed-become-5g-player/167072/\">https://www.defenseone.com/business/2020/07/new-ceo-wants-lockheed-become-5g-player/167072/</a></p>\n\n<p><a href=\"https://www.wsj.com/articles/defense-firms-expect-higher-spending-11548783988\">https://www.wsj.com/articles/defense-firms-expect-higher-spending-11548783988</a></p>\n\n<p><a href=\"https://www.etf.com/ITA#efficiency\">https://www.etf.com/ITA#efficiency</a></p>\n\n<p><a href=\"https://s2.q4cdn.com/661678649/files/doc_financials/2020/q4/4Q20-Presentation.pdf\">https://s2.q4cdn.com/661678649/files/doc_financials/2020/q4/4Q20-Presentation.pdf</a></p>\n\n<p><a href=\"https://investors.rtx.com/static-files/dfd94ff7-4cca-4540-bc4b-4e3ba92fc646\">https://investors.rtx.com/static-files/dfd94ff7-4cca-4540-bc4b-4e3ba92fc646</a></p>\n\n<p><a href=\"https://investors.lockheedmartin.com/static-files/64e5aa03-9023-423a-8908-2aae8c7015ac\">https://investors.lockheedmartin.com/static-files/64e5aa03-9023-423a-8908-2aae8c7015ac</a></p>\n\n<p><a href=\"https://s22.q4cdn.com/891946778/files/doc_financials/2020/q4/GD_4Q20_Earnings_Highlights-Outlook-Final.pdf\">https://s22.q4cdn.com/891946778/files/doc_financials/2020/q4/GD_4Q20_Earnings_Highlights-Outlook-Final.pdf</a></p>\n\n<p><a href=\"https://www.fool.com/earnings/call-transcripts/2021/01/27/teledyne-technologies-inc-tdy-q4-2020-earnings-cal/\">https://www.fool.com/earnings/call-transcripts/2021/01/27/teledyne-technologies-inc-tdy-q4-2020-earnings-cal/</a></p>\n\n<p><a href=\"https://investor.northropgrumman.com/static-files/6e6e117f-f656-4c68-ba7f-3dc53c2dd13a\">https://investor.northropgrumman.com/static-files/6e6e117f-f656-4c68-ba7f-3dc53c2dd13a</a></p>\n</div><!-- SC_ON -->",
  "score": 342,
  "permalink": "/r/investing/comments/la7g07/lmt_a_deep_dive/",
  "subreddit": "investing",
  "id": "la7g07",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518534784
}