{
  "author": "48323979853562951413",
  "original_created_utc": 1625630502,
  "title": "I love you just for being a part of this. Nobody knows what cryptocurrency will become, but it's been a wild ride.",
  "created_utc": 1625661244,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From 10,000 Bitcoin pizza purchases and cryptographic Lambos to the billion dollar donations for the India Covid relief fund, Cryptocurrency has changed the world already.</p>\n\n<p>Maybe tomorrow it will go kaput. Maybe next week it will take over the world and free us from the Fiat chains of our oppressers.</p>\n\n<p>Whatever happens, the past 10 years have been the most exciting years of my life thanks to the Blockchain and I&#39;m just one of millions.</p>\n\n<p>No matter who you are, you&#39;re interested in Cryptocurrency this early and that makes you special. </p>\n\n<p>Thanks for everything you do!</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/ofbbb3/i_love_you_just_for_being_a_part_of_this_nobody/",
  "subreddit": "CryptoCurrency",
  "id": "ofbbb3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "From 10,000 Bitcoin pizza purchases and cryptographic Lambos to the billion\ndollar donations for the India Covid relief fund, Cryptocurrency has changed the\nworld already.\n\nMaybe tomorrow it will go kaput. Maybe next week it will take over the world and\nfree us from the Fiat chains of our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "10,000ビットコインのピザの購入や暗号ランボから、インドのCovid救済基金への10億ドルの寄付まで\nインド・コヴィッド救済基金への10億ドルの寄付など、暗号通貨は世界を変えてきました。\nすでに世界を変えています。\n\nもしかしたら明日には消えてしまうかもしれません。来週には世界を支配し、我々をフィアットの鎖から解放してくれるかもしれません。\n私たちはフィアットの鎖から解放されるでしょう。",
      "title": "私は、あなたがこの一部であるというだけで愛しています。暗号通貨がどのようになるかは誰にもわかりませんが、これまではワイルドな旅でした。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "从10,000个比特币比萨饼的购买和加密的兰博斯到为印度Covid救济基金提供的10亿美元捐款。\n为印度Covid救灾基金捐款，加密货币已经改变了\n已经改变了世界。\n\n也许明天它就会消亡。也许下周它将接管世界，并\n将我们从法币的枷锁中解放出来。",
      "title": "我爱你，只因你是其中的一员。没有人知道加密货币会变成什么，但这是一次疯狂的旅程。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "從10,000個比特幣比薩餅的購買和加密的蘭博斯到爲印度Covid救濟基金提供的10億美元捐款。\n爲印度Covid救災基金捐款，加密貨幣已經改變了\n已經改變了世界。\n\n也許明天它就會消亡。也許下週它將接管世界，並\n將我們從法幣的枷鎖中解放出來。",
      "title": "我愛你，只因你是其中的一員。沒有人知道加密貨幣會變成什麼，但這是一次瘋狂的旅程。"
    }
  ]
}