{
  "author": "GimmeThatIOTA",
  "original_created_utc": 1643182526,
  "title": "In pc games like Civilization, technology is portrayed as linear and progressive, i.e., once something is invented, it stays invented. In light of history, is that a generally correct representation? Or should technology rather need to be \"maintained\" by ongoing effort?",
  "created_utc": 1643195498,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In many strategy games like Civilization, Europa Universalis, etc. technology is linear and progressive: once the tech for e.g. chariots is invented, it stays available.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m often wondering if this approach to technology in games is fundamentally right or wrong. Certainly, often it does seem to fit historic reality well, e.g., writing was invented and pretty much stayed.&lt;/p&gt;\n\n&lt;p&gt;Other times it doesn&amp;#39;t seem to fit at all, e.g., aqueducts in ancient Rome.&lt;/p&gt;\n\n&lt;p&gt;I guess my question comes down to the permanence of ideas. Is it a valid abstraction to assume that once an idea has been established , it stays? E.g., get some &amp;quot;researcher points&amp;quot; and invent &amp;quot;chariots&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;Or is it much more historically accurate to abstract to a maintenance model, e.g., we need to produce at least 5 &amp;quot;research points&amp;quot; to keep &amp;quot;chariots&amp;quot; after inventing it or else we&amp;#39;ll lose it after X rounds/years?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/sd0f30/in_pc_games_like_civilization_technology_is/",
  "subreddit": "AskHistorians",
  "id": "sd0f30",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In many strategy games like Civilization, Europa Universalis, etc. technology is\nlinear and progressive: once the tech for e.g. chariots is invented, it stays\navailable.\n\nI'm often wondering if this approach to technology in games is fundamentally\nright or wrong. Certainly, often it does seem to…"
}