{
  "author": "cheeseburger_daddy",
  "original_created_utc": 1638547512,
  "title": "[Mod approved] Participate in a scientific research study on cognitive biases in cryptocurrency investors.",
  "created_utc": 1638563596,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;Edit: This study and post has been mod approved. A 100 moons will be awarded to one user who completes the study and will be drawn from the comment section of this post. Keep in mind that since no data identifying you will be collected, I urge you to please be honest and only comment that you have participated if you really have participated.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Dear &lt;a href=\"https://www.reddit.com/r/cc/\"&gt;r/&lt;/a&gt;cc family,&lt;/p&gt;\n\n&lt;p&gt;For my master thesis in behavioural finance, I am conducting a &lt;strong&gt;study on cognitive biases in cryptocurrency investors, with the moderating role of Reddit in mind.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;In order to test my hypothesis and research questions, I need data, and &lt;a href=\"https://maastrichtuniversity.eu.qualtrics.com/jfe/form/SV_9BSSloaBTcqhlc2\"&gt;I have designed this short survey for that purpose.&lt;/a&gt; It will take you approximately 10 minutes to fill in.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;NO personal identity data will be asked for, nor collected (no names, email address etc).&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;The topic of cognitive biases in retail cryptocurrency investors and the moderating role of social media in driving these biases remains a vastly under-researched topic (unfortunately). I believe this topic to be extremely relevant today, especially in such a high frequency market as cryptocurrencies. This is your chance to help participate in filling this crucial research gap.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://maastrichtuniversity.eu.qualtrics.com/jfe/form/SV_9BSSloaBTcqhlc2\"&gt;You can find the survey here.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Please feel free to share it in your circles: the more respondents, the more data, and the more accurate the statistical results will be.&lt;/p&gt;\n\n&lt;p&gt;I will of course be posting my concluded thesis once it is completed, so that anyone interested in the results can read it.&lt;/p&gt;\n\n&lt;p&gt;If you do decide to participate in the survey, please carefully read the indications, questions, and please answer as accurately as possible.&lt;/p&gt;\n\n&lt;p&gt;Thank you all very much in advance for helping advance scientific research in cryptocurrencies and investor behaviour!!!&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Let me know in the comments if you have participated in the survey to enter the raffle for 100 moon reward (and please be honest)&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;-Cheeseburger&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Edit 1: thank you so much everyone for the feedback, participation, kind words, awards and encouragement! It warms my heart! I am taking a small break from reddit to enjoy dinner, and will keep on replying to everyone later tonight. For anyone wondering - i will be posting the results along with my finished research paper around January, once I have completed my defence of my thesis! Thank you all again!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 172,
  "permalink": "/r/CryptoCurrency/comments/r82fsd/mod_approved_participate_in_a_scientific_research/",
  "subreddit": "CryptoCurrency",
  "id": "r82fsd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Edit: This study and post has been mod approved. A 100 moons will be awarded to\none user who completes the study and will be drawn from the comment section of\nthis post. Keep in mind that since no data identifying you will be collected, I\nurge you to please be honest and only comment that you have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "編集：この研究と投稿はModの承認を得ています。100ムーンが贈られます。\nのコメント欄から抽選で1名様にプレゼントします。\nこの投稿をご覧ください。個人を特定するデータは収集されませんので、ご注意ください。\nぜひ、正直に、自分が持っているものだけをコメントしてください。",
      "title": "[Mod approved] 暗号通貨投資家の認知バイアスに関する科学的調査研究に参加する。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：这项研究和帖子已经得到MOD的批准。100个月亮将被奖励给\n完成这项研究的用户将获得100个月亮，并将从本帖的评论部分抽出。\n这个帖子的评论区中抽取。请记住，由于不会收集识别你的数据，我\n恳请您诚实，只评论您有...",
      "title": "[Mod approved] 参与一项关于加密货币投资者认知偏差的科学研究。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：這項研究和帖子已經得到MOD的批准。100個月亮將被獎勵給\n完成這項研究的用戶將獲得100個月亮，並將從本帖的評論部分抽出。\n這個帖子的評論區中抽取。請記住，由於不會收集識別你的數據，我\n懇請您誠實，只評論您有...",
      "title": "[Mod approved] 參與一項關於加密貨幣投資者認知偏差的科學研究。"
    }
  ]
}