{
  "author": "lumaleelumabop",
  "original_created_utc": 1645367965,
  "title": "What could cause my light bulbs to burn out so quickly?",
  "created_utc": 1645390141,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I recently (last year) bought a house, and I&amp;#39;ve noticed my light bulbs burn out super fast.&lt;/p&gt;\n\n&lt;p&gt;When I moved in, maybe 70% of the bulbs were out. We got them all sorted eventually but I feel like I&amp;#39;ve been changing them about once every 3 months. I&amp;#39;m referring to every light in my house- ceiling fans, fixed light fixtures, even the light inside my dryer went out. It&amp;#39;s been a little nuts. I&amp;#39;ve checked that all of the bulbs are rated at or below recommended wattage so I don&amp;#39;t think it&amp;#39;s that either.&lt;/p&gt;\n\n&lt;p&gt;I bought the nicer &amp;quot;eco&amp;quot; bulbs rated to last 10 years, I bought LEDs, I tried regular incandescent... they all seem to burn out super fast. By contrast, I lived in my previous apartment for 3 years and only ever replaced 2 or 3 light bulbs.&lt;/p&gt;\n\n&lt;p&gt;Am I nuts? Is this a sign of a bigger problem?&lt;/p&gt;\n\n&lt;p&gt;I also had an issue where the dryer stopped working completely the day the light went out, but now it randomly works again (with no light) and has been fine for months. When I called the electrician out, he shrugged at me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 109,
  "permalink": "/r/NoStupidQuestions/comments/sx2mti/what_could_cause_my_light_bulbs_to_burn_out_so/",
  "subreddit": "NoStupidQuestions",
  "id": "sx2mti",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I recently (last year) bought a house, and I've noticed my light bulbs burn out\nsuper fast.\n\nWhen I moved in, maybe 70% of the bulbs were out. We got them all sorted\neventually but I feel like I've been changing them about once every 3 months.\nI'm referring to every light in my house- ceiling fans,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近（昨年）家を買ったのですが、電球が切れてしまうことに気がつきました。\n超高速です。\n\n引っ越してきたとき、70％くらいの電球が切れていました。全部整理しました。\n結局、3ヶ月に1回くらいは交換しているような気がします。\n家の中のすべての照明に言及しているのですが、シーリングファンや...",
      "title": "電球がすぐに切れてしまう原因は何でしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近（去年）买了一栋房子，我注意到我的灯泡烧坏了\n超级快。\n\n当我搬进去的时候，可能70%的灯泡都坏了。我们把它们都整理好了\n但我觉得我大约每三个月就换一次。\n我指的是我房子里的每一盏灯--吊扇，...",
      "title": "是什么原因导致我的灯泡这么快就烧坏了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近（去年）買了一棟房子，我注意到我的燈泡燒壞了\n超級快。\n\n當我搬進去的時候，可能70%的燈泡都壞了。我們把它們都整理好了\n但我覺得我大約每三個月就換一次。\n我指的是我房子裏的每一盞燈--吊扇，...",
      "title": "是什麼原因導致我的燈泡這麼快就燒壞了？"
    }
  ]
}