{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Thursday, May 13, 2021\n\nThe wild swings in the market continue, with three indexes bouncing back after\nyesterday’s selloff. With the market fluctuating so wildly, it is difficult to\npinpoint the reasons behind this price action, but I think there are two main,\ncompeting factors…",
  "original_created_utc": 1620937483,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "サイコ・マーケット・リカップ - 2021年5月13日（木\n\n相場の乱高下は続いており、昨日の暴落の後、3つの指数が反発している。\n昨日の暴落の後、3つの指数が反発している。相場がこれほど乱高下していると、この値動きの理由を特定するのは難しいですが\n理由を特定するのは難しいですが、私は主に2つの要因があると思います。\n競合する要因があると思います...。",
      "title": "本日、2021年5月13日(木)のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾 - 2021年5月13日，星期四\n\n市场的疯狂波动仍在继续，三个指数在昨天的大跌之后出现反弹。\n昨日的大跌后反弹。由于市场波动如此剧烈，很难确定这种价格行为背后的原因。\n的原因，但我认为有两个主要。\n竞争的因素...",
      "title": "以下是今天的市场回顾，2021年5月13日，星期四"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧 - 2021年5月13日，星期四\n\n市場的瘋狂波動仍在繼續，三個指數在昨天的大跌之後出現反彈。\n昨日的大跌後反彈。由於市場波動如此劇烈，很難確定這種價格行爲背後的原因。\n的原因，但我認爲有兩個主要。\n競爭的因素...",
      "title": "以下是今天的市場回顧，2021年5月13日，星期四"
    }
  ],
  "title": "Here is a Market Recap for today Thursday, May 13, 2021",
  "created_utc": 1620950138,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Thursday, May 13, 2021</strong></p>\n\n<p>The wild swings in the market continue, with three indexes bouncing back after yesterday’s selloff. With the market fluctuating so wildly, it is difficult to pinpoint the reasons behind this price action, but I think there are two main, competing factors contributing to the volatility the market has seen in the last two weeks or so. It seems that fears inflation, marked by high prints in the consumer price index yesterday, are causing concern that the Federal Reserve will tighten monetary policy sooner than expected and is pushing the market down while the April Job Report, which missed analyst estimates and marked a sharp declaration in job growth compared to March, bolsters confidence in the Fed’s claim that it will not consider tightening monetary policy until it sees a “string” of strong labor reports. Again though, with so many factors revolving around the market, it is difficult to see the clear picture.</p>\n\n<p>The S&amp;P 500 (SPY) closed the day 1.17% up after closing 2.09% down yesterday. The tech-heavy Nasdaq (QQQ) closed 0.77% up after closing 2.54% down yesterday. The Dow Jones (DIA) closed 1.26% up after closing 2% down yesterday. </p>\n\n<p>Yesterday, the Bureau of Labor Statistics reported that the consumer price index (CPI), which measures a basket of goods as well as energy and housing costs, rose 4.2% from a year ago, compared to the Dow Jones estimate for a 3.6% increase. The monthly gain was 0.8%, against the expected 0.2%. Excluding the volatile food and energy prices, the core CPI (this is the main measure of inflation) increased 3% compared to the same period in 2020 and 0.9% on a monthly basis. The respective estimates were 2.3% and 0.3%. </p>\n\n<p>Today, the producer price index (PPI), which measures the average changes in prices received by domestic producers for their output, rose 6.2% compared to April 2020 and 0.6% monthly increase. The core PPI, which excludes volatile items like food and energy rose 4.6% year over year and 0.7% in April. Economists polled by FactSet were expecting a 0.3% monthly increase in April and 3.8% year over year. This is the biggest jump since 2014. In tandem with the CPI report, this shows prices for both consumers and producers has increased more than expected. </p>\n\n<p>However, while the readings in inflation definitely are not good, it is important to note that Federal Reserve Chair Jerome Powell has consistently reiterated he expects any rise in inflation to be “transitory” as the economy continues to recover from the March and bottom and want to see a “string” of strong labor reports totaling 1 million before. In an April 28 meeting Powell said, “Amid progress on vaccinations and strong policy support, indicators of economic activity and employment have strengthened. Inflation has risen, largely reflecting transitory factors. Overall financial conditions remain accommodative, in part reflecting policy measures to support the economy and the flow of credit to U.S. households and businesses.”</p>\n\n<p>Moreover, the April Job Report, released last Friday, showed the US economy only added 266,000 new jobs last month, missing estimates of more than 1 million jobs gained and marking a sharp deceleration from March’s total of 916,000 new jobs added. As said earlier, members of the Federal Reserve, including Powell, have consistently reiterated they want to see a<br/>\n“String” of strong labor reports before considering any changes to the current policy. Talking about the March Job report, Powell said, “We want to see a string of months like that [like in March] so we can really begin to show progress toward our goals. We just need to keep reminding ourselves that even though some parts of the economy are starting just great, there’s a very large group of people who are not.” The April Job Report bolsters Powell’s argument that large segments that the Federal Reserve will move slowly in changing policy. </p>\n\n<p>In addition, at a separate event in April, Powell said that quantitative easing would likely taper “well before” the interest rate is increased. He said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.” In short, while the inflationary readings are not great, I’m fairly confident fears that the Federal Reserve will tighten policy sooner than expected are overblown. Looking ahead though, I expect the kangaroo market to continue in the near term. Just my two cents. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>The Labor Department Released its Weekly Unemployment Report\n\n<ul>\n<li><strong>Initial jobless claims:</strong> 473,000 vs. 490,000 expected and 507,000 the previous week</li>\n<li><strong>Continuing claims:</strong> 3.655 million vs. 3.650 million expected and 3.7 million the previous week</li>\n</ul></li>\n<li>AMC has raised about $428 million from a share sale, capitalizing on the retail-trading driven surge in its stock earlier this year. The company said it sold 43 million shares at an average price of $9.94 apiece in the at-the-market offering, sending its stock nearly 19% higher.</li>\n<li>United Airlines and two other major U.S. carriers said on Thursday they will quickly repair more than 60 Boeing 737 MAX planes grounded early last month over an electrical problem that could have interfered with some critical systems.</li>\n<li>Executive Chairman of Ford (F) Bill Ford signaled that automaker plans to reinstate the dividend it suspended last year, though he gave no timeline. &quot;We will do it as soon as possible, but we also want to make sure that when we do it, that we can sustain it.”</li>\n<li>**<strong>Please note that current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Aptiv (APTV) target raised by Morgan Stanley from $200 to $205 at Overweight. Stock currently around $134</li>\n<li>Avalara (AVLR) target raised by Morgan Stanley from $170 to $175 at Overweight. Stock currently around $122</li>\n<li>AutoZone (AZO) target raised by Wells Fargo from $1600 to $1700 at Overweight. Stock currently around $1495</li>\n<li>Builders First Source (BLDR) target raised by BTIG Research from $57 to $67 at Buy. Stock currently around $46.60</li>\n<li>Bumble (BMBL) target raised by Susquehanna from $70 to $78 at Positive. Stock currently around $47. The company beat earnings estimates today but still fell roughly 14%.</li>\n<li>CommScope (COMM) target raised by Goldman Schs from $21 to $24 at Buy. Stock currently around $17.5</li>\n<li>Costco (COST) target raised by Raymond James from $375 to $410 at Outperform. Stock currently around $372</li>\n<li>Datadog (DDOG) with two target raises. Stock currently around $77\n\n<ul>\n<li>Moness Crespi &amp; Hardt from $100 to $103 at Buy</li>\n<li>Needham &amp; Co from $141 to $150 at Buy</li>\n</ul></li>\n<li>John Deere (DE) target raised by Robert W Baird from $375 to $425 at Outperform. Stock currently around $373</li>\n<li>Domino&#39;s Pizza (DPZ) target raised by Robert W Baird from $455 to $485 at Outperform. Stock currently around $425</li>\n<li>Floor &amp; Decor (FND) target raised by Goldman Sachs from $118 to $133 at Buy. Stock currently around $101</li>\n<li>Guardant Health (GH) target raised by BTIG Research from $145 to $160 at Buy. Stock currently around $114</li>\n<li>Health Catalyst (HCAT) with three target raises. Stock currently around $48\n\n<ul>\n<li>Raymond James from $56 to $63 </li>\n<li>SVB Leerink from $53 to $59</li>\n<li>Goldman Sachs from $54 to $60</li>\n</ul></li>\n<li>McKesson (MCK) target raised by Goldman Sachs from $231 to $257 at Buy. Stock currently around $197</li>\n<li>Moderna (MRNA) with two target raises. Stock currently around $153\n\n<ul>\n<li>Goldman Sachs from $206 to $228 at Buy</li>\n<li>Chardan Capital from $182 to $188 at Buy</li>\n</ul></li>\n<li>Sonos (SONO) target raised by Morgan Stanley from $45 to $47 at Overweight. Stock currently around $31.50</li>\n<li>Square (SQ) with two target raises. Stock currently around $207\n\n<ul>\n<li>Morgan Stanley from $245 to $254 at Equal-Weight</li>\n<li>Rosenblatt Securities from $320 to $330 at Buy</li>\n</ul></li>\n</ul>\n\n<p>“It is in your moments of decision that your destiny is shaped.” - Tony Robbins</p>\n</div><!-- SC_ON -->",
  "score": 69,
  "permalink": "/r/stocks/comments/nbqhfy/here_is_a_market_recap_for_today_thursday_may_13/",
  "subreddit": "stocks",
  "id": "nbqhfy",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590803292
}