{
  "author": "hnnng_booba",
  "original_created_utc": 1650071502,
  "title": "As far as I am aware, the Bible is not just one book, but is actually a collection of many different books and manuscripts from many different time periods. How was it decided which books were included in the Bible, and what was behind the decision?",
  "created_utc": 1650131300,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To add on to this, I learned earlier today that the Ethiopian Bible has 84 books, whereas the Bible we use in the West only has 66. Did they just have access to documents that the early Church did not? Or were those books excluded for a reason?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/u4mjr9/as_far_as_i_am_aware_the_bible_is_not_just_one/",
  "subreddit": "AskHistorians",
  "id": "u4mjr9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "To add on to this, I learned earlier today that the Ethiopian Bible has 84\nbooks, whereas the Bible we use in the West only has 66. Did they just have\naccess to documents that the early Church did not? Or were those books excluded\nfor a reason?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "エチオピアの聖書は84冊あるそうです。\n欧米で使われている聖書は66冊しかないのです。彼らは\n初代教会にはなかった文書にアクセスできるのでしょうか？それとも、それらの書物は\n理由があってのことなのでしょうか？",
      "title": "私の知る限り、聖書は1冊の本ではなく、実際には多くの異なる時代の本や写本の集合体である。どの本を聖書に含めるかは、どのように決められ、その背景には何があったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "除此之外，我今天早些时候了解到，埃塞俄比亚的《圣经》有84本\n书，而我们在西方使用的圣经只有66本。难道他们只是有\n获得早期教会所没有的文件？还是这些书被排除在外\n是有原因的？",
      "title": "据我所知，《圣经》不仅仅是一本书，实际上是许多不同时期的书籍和手稿的集合。如何决定哪些书被列入《圣经》，决定的背后是什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "除此之外，我今天早些時候瞭解到，埃塞俄比亞的《聖經》有84本\n書，而我們在西方使用的聖經只有66本。難道他們只是有\n獲得早期教會所沒有的文件？還是這些書被排除在外\n是有原因的？",
      "title": "據我所知，《聖經》不僅僅是一本書，實際上是許多不同時期的書籍和手稿的集合。如何決定哪些書被列入《聖經》，決定的背後是什麼？"
    }
  ]
}