{
  "author": "vitmeatavegimin",
  "original_created_utc": 1653205671,
  "title": "why do vegetarian/vegan restaurants have to be so pretentious?",
  "created_utc": 1653249385,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have always considered myself a &amp;quot;meat and potatoes&amp;quot; person.&lt;/p&gt;\n\n&lt;p&gt;About a year ago, I wanted to try incorporating veggie-only dishes into my diet once a week. For funsies.&lt;/p&gt;\n\n&lt;p&gt;The recipes that I have tried have been absolutely amazing, and FILLING. I&amp;#39;m shocked, but loving it.&lt;/p&gt;\n\n&lt;p&gt;I am to the point now that I think I have enough recipes that I could, quite possibly, go to full-time veggies. Not fully convinced that I can get rid of my hamburgers and bacon, but I have significantly cut down my meat intake, and I could definitely try fulltime veggies, even if it isn&amp;#39;t forever. &lt;/p&gt;\n\n&lt;p&gt;I have been looking at places to eat out that only offer vegetable-based meals, because my husband and I enjoy eating out. And I don&amp;#39;t always want to cook!&lt;/p&gt;\n\n&lt;p&gt;A sample of the menu at a restauraunt near me that I would like to try has the following on their menu:&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;self-affirming dish names like I Am Fulfilled and I Am Magical&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Wtf does that even mean? What am I even ordering? Do people that eat only veggies go to sit down for a meal and just roll the dice on what they get? &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Yes, ma&amp;#39;am, thank you so much, I will have the I Am Fulfilled. With a side of Fulfillment. And, could I get Magic on the side, please? Yes, you can upcharge.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I need the menu to say &amp;quot;sweet potato tacos served with fajita veggies and black beans.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Is there a special lingo of veggie eaters that I have no idea about? And if so...perhaps try just telling us what we are ordering instead. I&amp;#39;m no specialist, but I think more people would try the food if it didn&amp;#39;t sound so &amp;quot;better than thou&amp;quot;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/uv66pf/why_do_vegetarianvegan_restaurants_have_to_be_so/",
  "subreddit": "TooAfraidToAsk",
  "id": "uv66pf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have always considered myself a \"meat and potatoes\" person.\n\nAbout a year ago, I wanted to try incorporating veggie-only dishes into my diet\nonce a week. For funsies.\n\nThe recipes that I have tried have been absolutely amazing, and FILLING. I'm\nshocked, but loving it.\n\nI am to the point now that…"
}