{
  "author": "CooCooCabana",
  "original_created_utc": 1625200745,
  "title": "Am I supposed to tell a potential romantic interest I have a small wiener?",
  "created_utc": 1625222621,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m in my early 20&#39;s and admittedly I&#39;ve never dated or had sex before, partly because I was never really hot property, and then I was also quite self conscious.</p>\n\n<p>Frankly my wiener is on the smaller side, maybe 3 or 3.5 inches fully erect. Obviously this wouldn&#39;t matter if I was paying for sex but if I was dating someone when would I make it known? </p>\n\n<p>I&#39;d hate for things to progress and then I&#39;d disappoint her once she actually sees it, rather let her know asap but I&#39;m afraid that&#39;d be inappropriate.</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/NoStupidQuestions/comments/oc2wia/am_i_supposed_to_tell_a_potential_romantic/",
  "subreddit": "NoStupidQuestions",
  "id": "oc2wia",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm in my early 20's and admittedly I've never dated or had sex before, partly\nbecause I was never really hot property, and then I was also quite self\nconscious.\n\nFrankly my wiener is on the smaller side, maybe 3 or 3.5 inches fully erect.\nObviously this wouldn't matter if I was paying for sex but…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は20代前半ですが、正直なところ、これまで一度もデートやセックスをしたことがありません。\nこれまでにデートやセックスをしたことがありませんでした。それは、私が本当に魅力的な人ではなかったからです。\n意識が高いからです。\n\n正直なところ、僕のウィンナーは小さい方で、完全に勃起した状態で3インチか3.5インチくらいです。\nもちろん、お金を払ってセックスをするのであれば問題ないのですが...。",
      "title": "恋愛対象になりそうな人に、ウィンナーが小さいと言えばいいの？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我现在20岁出头，我承认我以前从未约会过或发生过性关系，部分原因是我从来都不是真正的热门人物，然后我也很自我。\n部分原因是我从来都不是真正的热门人物，然后我也很自觉。\n觉。\n\n坦率地说，我的小弟弟偏小，完全勃起时可能只有3或3.5英寸。\n很明显，如果我为性行为付钱，这并不重要，但是......",
      "title": "我应该告诉一个潜在的恋爱对象我有一个小维纳吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我現在20歲出頭，我承認我以前從未約會過或發生過性關係，部分原因是我從來都不是真正的熱門人物，然後我也很自我。\n部分原因是我從來都不是真正的熱門人物，然後我也很自覺。\n覺。\n\n坦率地說，我的小弟弟偏小，完全勃起時可能只有3或3.5英寸。\n很明顯，如果我爲性行爲付錢，這並不重要，但是......",
      "title": "我應該告訴一個潛在的戀愛對象我有一個小維納嗎？"
    }
  ]
}