{
  "author": "UnderstandingNo2575",
  "the_new_excerpt": "CLOV has a very interesting setup right now but way too many people seem to only\ncare about the short float debate that has been unfolding over the last few\ndays. To sum that up: FactSet (top financial data provider) had the CLOV float\nlisted as 23.5M and short interest at 39M - putting the…",
  "original_created_utc": 1618778361,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "CLOVは今、非常に興味深い設定をしていますが、あまりにも多くの人々が、過去に展開されたショートフロートの議論にのみ関心を持っているようです。\nここ数日で展開されているショートフロートの議論にしか関心がない人が多すぎる。\nを気にしている人が多いようです。それを要約すると。FactSet（トップ金融データプロバイダー）は、CLOVの浮動株を23.5M、ショートインタレストを\n浮動株は2350万株、空売りは3900万株となっています。",
      "title": "CLOV DD - No Bullshit"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "CLOV现在有一个非常有趣的设置，但太多的人似乎只关注于\n关心过去几年展开的空头浮动争论\n天。综上所述。FactSet（顶级金融数据提供商）的CLOV浮动值\n列为2350万，空头利息为3900万--把...",
      "title": "CLOV DD - No Bullshit"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "CLOV現在有一個非常有趣的設置，但太多的人似乎只關注於\n關心過去幾年展開的空頭浮動爭論\n天。綜上所述。FactSet（頂級金融數據提供商）的CLOV浮動值\n列爲2350萬，空頭利息爲3900萬--把...",
      "title": "CLOV DD - No Bullshit"
    }
  ],
  "title": "CLOV DD - No Bullshit",
  "created_utc": 1618817303,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>CLOV has a very interesting setup right now but way too many people seem to only care about the short float debate that has been unfolding over the last few days. To sum that up: FactSet (top financial data provider) had the CLOV float listed as 23.5M and short interest at 39M - putting the percentage of the float shorted at 146.6%. This circulated online and has been argued on twitter and reddit starting Friday. Factset has since updated the float to 109.8M making the 39M short interest account for 36% of the float. They previously had deducted the CEO’s class B shares from the total class A shares, and although his shares are “non-tradeable” and shouldn&#39;t be included in the public float, they were only using the class A shares to determine the float as all class B shares are already non-tradeable unless converted - so shouldn’t have been part of the equation to begin with. Now I could get more into the &quot;Hindenberg said this” and “S3 said this” bullshit that people have been arguing about...</p>\n\n<p>But heres why NONE OF THAT EVEN FUCKING MATTERS</p>\n\n<p>Shorts and those who have been bashing CLOV and arguing against the original short float number are taking a victory lap, like Factset updating the short float to 36% destroys the entire bullish case for CLOV and now it will tank. BULLSHIT, here’s why:</p>\n\n<p>The 39M short interest number being used in the short float calculation is from 3/31. Over two weeks ago. When the two highest volume and highest short volume days in CLOV history have occurred within the last two weeks. With ~30M short volume on 4/8 and ~90M short volume on Friday (according to Fintel). We don’t know at this time how much of the short volume is covered and would be included in the current short interest; but given all this, you could logically conclude the short float on CLOV right now could be pretty damn high. For context, 36% short float - based on outdated short interest from 3/31 - is in the ballpark of double what we&#39;re currently seeing in GME or AMC, and would still make CLOV one of the highest short float stocks in the entire market right now.</p>\n\n<p><a href=\"https://preview.redd.it/rvr4bslwszt61.png?width=1242&amp;format=png&amp;auto=webp&amp;s=801f7c4f339e3573272d280586c7a9bd54d8343d\">https://preview.redd.it/rvr4bslwszt61.png?width=1242&amp;format=png&amp;auto=webp&amp;s=801f7c4f339e3573272d280586c7a9bd54d8343d</a></p>\n\n<p><a href=\"https://preview.redd.it/l4ssab8yszt61.png?width=2010&amp;format=png&amp;auto=webp&amp;s=10de1da2465f375d84f5d28bdf9689936cf5af48\">https://preview.redd.it/l4ssab8yszt61.png?width=2010&amp;format=png&amp;auto=webp&amp;s=10de1da2465f375d84f5d28bdf9689936cf5af48</a></p>\n\n<p>The short float is only a small piece of the puzzle, and it’s without a doubt high enough to trigger a short squeeze if price continues to rise, end of story. Now let’s get into the shit that really matters.</p>\n\n<p>First off, from a technical perspective, there are some good signs. (if you hate technical analysis or think you&#39;re so good at it that you&#39;ll find a way to disagree with whatever I say then skip to the next section)</p>\n\n<p><a href=\"https://preview.redd.it/06weuky6tzt61.png?width=1125&amp;format=png&amp;auto=webp&amp;s=64b8a0b9d28d85d079627746c4e1832aec8f153e\">https://preview.redd.it/06weuky6tzt61.png?width=1125&amp;format=png&amp;auto=webp&amp;s=64b8a0b9d28d85d079627746c4e1832aec8f153e</a></p>\n\n<ul>\n<li>MACD bullish</li>\n<li>RSI only starting to warm up</li>\n<li>Decent support built between $7-$7.30</li>\n<li>But what’s really screaming on this chart are these two recent MASSIVE buying volume days coming after about a month of consolidation with a double bottom pattern making higher lows.</li>\n</ul>\n\n<p><strong>Now let’s get into call volume</strong></p>\n\n<p><a href=\"https://preview.redd.it/ksveumt0tzt61.png?width=1108&amp;format=png&amp;auto=webp&amp;s=2577d77bf9ab0d6f3180c955e9af5b861f859f3b\">Some of the order that came through Friday</a></p>\n\n<p><a href=\"https://preview.redd.it/a7e1pes3tzt61.png?width=730&amp;format=png&amp;auto=webp&amp;s=83c9ea5a0d92808cfd65626f792fa1078443b1ed\">https://preview.redd.it/a7e1pes3tzt61.png?width=730&amp;format=png&amp;auto=webp&amp;s=83c9ea5a0d92808cfd65626f792fa1078443b1ed</a></p>\n\n<p>Fridays call flow and the sheer volume and open interest on some of these call options speak for themselves. This is where I should break down the mechanics of a gamma squeeze, but really all you need to know is that heavy call volume is important for two reasons: 1) it can be a good indicator of where money is flowing in the market and 2) the people who write the call options need to buy shares to hedge against their position. The more the price rises the more shares they need to buy, helping to push price higher just like we see in a short squeeze.</p>\n\n<p>&#x200B;</p>\n\n<p>Next, CLOV is down over 50% from Dec/Jan highs. Some of the main reasons for the drop would be:</p>\n\n<ul>\n<li>Money flowing out of growth stocks and SPACS</li>\n<li>Hindenberg short report</li>\n<li>Short seller price manipulation</li>\n</ul>\n\n<p>The Hindenburg short attack really did a number on CLOV. The stock was trading at about $14 prior to the release of their short report and dropped over 50% in the weeks following its release.</p>\n\n<p>Hindenburg attacked CLOV from many different angles. One of their main arguments being that Clover Health uses misleading and unethical marketing practices to boost sales, as evidence stating that in 2016: “Clover was fined for misleading marketing practices by the Centers for Medicare &amp; Medicaid Services (CMS)”</p>\n\n<p>Well, just this month (April 8th), the Centers for Medicare and Medicaid Services granted Clover heath approval in 10 new states. CLOV has yet to release a PR on this but it has been updated on the CMS website (see picture below). The stock price jumped with huge volume on this news but short sellers were able to manipulate it back down until the spike we just saw on Friday.</p>\n\n<p><a href=\"https://preview.redd.it/sc2w81eatzt61.png?width=1170&amp;format=png&amp;auto=webp&amp;s=7eb791918794ff6a425e42fffa397e409788b782\">https://preview.redd.it/sc2w81eatzt61.png?width=1170&amp;format=png&amp;auto=webp&amp;s=7eb791918794ff6a425e42fffa397e409788b782</a></p>\n\n<p>It seems that Hindenbergs argument doesn’t hold up as the same federal agency (CMS) they were using to support claims against Clover Health is currently supporting Clovers expansion into 10 new states. Which is huge news for CLOV by the way.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>Wrapping this up</strong></p>\n\n<p>Now say what you will about Chamath, but he had retail investors back during the GME squeeze. He promoted it, posted his personal positions, and while Wall Street, CNBC, and others attacked Gamestop, Chamath defended retail traders and the movement as a whole. It may be a total coincidence that his SPAC’s were the target of short attacks shortly after, but his support of the GME squeeze may have made him a bigger target.</p>\n\n<p>&#x200B;</p>\n\n<p>No one knows what will happen in the market, I sure as hell don’t, but given all that&#39;s been laid out here, I like the stock.</p>\n\n<p>$CLOV to $100</p>\n\n<p>&#x200B;</p>\n\n<p>EDIT: anyone who thinks this is part of a conspiracy to distract from GME, it&#39;s not. Holding GME, love the setup going into this week.</p>\n\n<p>Also: this is not financial advice, do your own DD blah blah blah</p>\n\n<p>And for those asking about my position. I&#39;m looking to add shares and calls Monday and/or throughout the week based on the price action and within my own personal risk tolerance. </p>\n</div><!-- SC_ON -->",
  "score": 1933,
  "permalink": "/r/wallstreetbets/comments/mtkyw2/clov_dd_no_bullshit/",
  "subreddit": "wallstreetbets",
  "id": "mtkyw2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171532800
}