{
  "author": "geschtonkenflappd",
  "the_new_excerpt": "Market is not paying attention to recurring revenue potential of Covid-19\nvaccines. Given the scare of pandemic, for next few years, everyone will likely\nbe forced to take annual jab (or at the very least travellers should need\nvaccination proof for quite sometime)\n\nWhen it comes to next jab, people…",
  "original_created_utc": 1612509025,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "市场不重视科维德-19的经常性收入潜力。\n疫苗。鉴于疫情的恐慌，在未来几年，大家可能会\n被迫每年注射疫苗(或至少旅行者应该需要每年注射疫苗)。\n疫苗接种证明)\n\n当谈到下一拳时，人们... ...",
      "title": "NVAX--4倍潜力--市场忽视经常性收入"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "市場不重視科維德-19的經常性收入潛力。\n疫苗。鑑於疫情的恐慌，在未來幾年，大家可能會\n被迫每年注射疫苗(或至少旅行者應該需要每年注射疫苗)。\n疫苗接種證明)\n\n當談到下一拳時，人們... ...",
      "title": "NVAX--4倍潛力--市場忽視經常性收入"
    }
  ],
  "title": "NVAX - 4x potential - Market ignoring recurring revenue",
  "created_utc": 1612526094,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Market is not paying attention to recurring revenue potential of Covid-19 vaccines. Given the scare of pandemic, for next few years, everyone will likely be forced to take annual jab (or at the very least travellers should need vaccination proof for quite sometime)</p>\n\n<p>When it comes to next jab, people are most likely to go for Novavax because:</p>\n\n<ol>\n<li>Much lower side effects as compared to Moderna/Pfizer</li>\n<li>Cheaper (&lt;= $16 per dose)</li>\n<li>Virus variants are becoming bigger problem. <a href=\"https://twitter.com/PeterKolchinsky/status/1354929047797706756\">Protein subunit vaccines are better placed for covering variants than MRNA</a></li>\n<li>They plan to make a <strong>Combo vaccine with their Nanoflu</strong> - so instead of annual flu vaccine, people can simply go for combo</li>\n<li>And obviously highest efficacy (95.6% original, 86% UK, 60% SA strain)</li>\n</ol>\n\n<p>It seems incredible that <code>NVAX market cap is just $17B when Moderna is valued at $65B</code>. To reach $65B, NVAX shares will need to shoot to <strong>$1070</strong></p>\n\n<p>It can be argued that lower price than Moderna means lower revenue. But lower price coupled with no deep freeze requirement will translate to much higher market share. On top of that, they already have another very successful vaccine (Nanoflu - influenza) which completed phase 3 trial in March 2020.</p>\n\n<p>Disclosure: I am long Nvax March 19 calls</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/investing/comments/ld1u00/nvax_4x_potential_market_ignoring_recurring/",
  "subreddit": "investing",
  "id": "ld1u00",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198809
}