{
  "author": "hungronto",
  "the_new_excerpt": "I don't buy into drug propaganda, I went to school in America and was taught of\nDARE and how smoking one joint of cannabis will ruin your life and lead to\nharder drugs. Many people in my class eventually grew up and saw how that was\nclearly false (though it can cause psychosis).\n\n\n\nThe thing is…",
  "original_created_utc": 1611754059,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不相信毒品的宣传，我在美国上学，被教导的是\n大胆，吸食一根大麻会毁掉你的生活，并导致\n更难的药物。我们班的很多人最终都长大了，看到了那是怎样的情景\n明显是错误的（虽然会导致精神病）。\n\n\n\n问题是...",
      "title": "为什么与其他毒瘾相比，吸毒似乎是经常导致无家可归/入狱的毒瘾？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不相信毒品的宣傳，我在美國上學，被教導的是\n大膽，吸食一根大麻會毀掉你的生活，並導致\n更難的藥物。我們班的很多人最終都長大了，看到了那是怎樣的情景\n明顯是錯誤的（雖然會導致精神病）。\n\n\n\n問題是...",
      "title": "爲什麼與其他毒癮相比，吸毒似乎是經常導致無家可歸/入獄的毒癮？"
    }
  ],
  "title": "Why does it seem that drug addiction is the addiction that often leads to homelessness/imprisonment at a much greater level compared to other addiction?",
  "created_utc": 1611789355,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don&#39;t buy into drug propaganda, I went to school in America and was taught of DARE and how smoking one joint of cannabis will ruin your life and lead to harder drugs. Many people in my class eventually grew up and saw how that was clearly false (though it can cause psychosis).</p>\n\n<p>&#x200B;</p>\n\n<p>The thing is however, there are genuinely drugs that one shouldn&#39;t mess around with. I&#39;d say unless prescribed by a doctor  Things like opiates, benzos, amphetamines, etc... can cause serious problems.</p>\n\n<p>&#x200B;</p>\n\n<p>I know many family members/friends with all sorts of addictions. Food addiction, gambling addiction, porn and drug addictions. I can say without hesitation that those with drug addictions have gone through the most devastation in their lifes from it. </p>\n\n<p>I&#39;m not minimizing the effect of something like gambling or porn addiction but why does it seem so uncommon for it to lead to people losing their houses, going to jail, robbing. The slippery slope with drug use seems to be much bigger than with any other addiction</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/TrueAskReddit/comments/l64ggl/why_does_it_seem_that_drug_addiction_is_the/",
  "subreddit": "TrueAskReddit",
  "id": "l64ggl",
  "is_self": true,
  "media": null,
  "is_video": false
}