{
  "author": "SlappySpankBank",
  "original_created_utc": 1628747582,
  "title": "There are 3 Million members here. There is more than enough money in the crypto future to make everyone that's here right now a millionaire.",
  "created_utc": 1628764247,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are still in the beginning phases boys. There will be billions of dollars pumped into this over the coming decades. Most people still don&#39;t even realize or even care about this stuff yet. </p>\n\n<p>Everyone is saying it can&#39;t be done. Everyone laughed at Mr. Lamborghini when you decided to go from making tractors to Super Cars, now look at what he has built. </p>\n\n<p>20 years ago people were freaking about &quot;texting&quot; from their $400 flip phones. Now look how fast time have changed. You can make HD video calls with 100 people in 100 different countries, at the same time. </p>\n\n<p>Only 3 million members here, and probably half of them aren&#39;t even active. We are so early boys it doesn&#39;t even feel real.</p>\n</div><!-- SC_ON -->",
  "score": 290,
  "permalink": "/r/CryptoCurrency/comments/p2ts4x/there_are_3_million_members_here_there_is_more/",
  "subreddit": "CryptoCurrency",
  "id": "p2ts4x",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "We are still in the beginning phases boys. There will be billions of dollars\npumped into this over the coming decades. Most people still don't even realize\nor even care about this stuff yet.\n\nEveryone is saying it can't be done. Everyone laughed at Mr. Lamborghini when\nyou decided to go from making…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私たちはまだ、少年たちの始まりの段階にいます。これから数十年の間に、何十億ドルもの\n今後数十年の間に何十億ドルもの資金が投入されるでしょう。ほとんどの人は、まだこのことに気づいていないし\n気にもしていません。\n\n誰もが「できない」と言っています。みんながランボルギーニさんを笑ったのは\n誰もがランボルギーニ氏を笑っていましたが...",
      "title": "ここには300万人のメンバーがいます。暗号の未来には、今ここにいる全員が億万長者になれるだけのお金があるのです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们仍然处于起步阶段，男孩。将有数十亿美元的资金\n在未来的几十年里，将有数十亿美元被投入到这个领域。大多数人甚至还没有意识到\n甚至还不关心这些东西。\n\n每个人都在说这是不可能的事。每个人都嘲笑兰博基尼先生，当你决定从制造...\n你决定从制造...",
      "title": "这里有300万会员。在加密货币的未来，有足够多的钱让现在在这里的每个人成为百万富翁。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們仍然處於起步階段，男孩。將有數十億美元的資金\n在未來的幾十年裏，將有數十億美元被投入到這個領域。大多數人甚至還沒有意識到\n甚至還不關心這些東西。\n\n每個人都在說這是不可能的事。每個人都嘲笑蘭博基尼先生，當你決定從製造...\n你決定從製造...",
      "title": "這裏有300萬會員。在加密貨幣的未來，有足夠多的錢讓現在在這裏的每個人成爲百萬富翁。"
    }
  ]
}