{
  "author": "digitalbiz",
  "the_new_excerpt": "Like seriously. WTF is wrong with this guy?\n\nI like him and stuff for all the work he is doing. Hell. I have read his\nbiography and admire him deeply for all the work he is doing. He is my man crush\ntoo.\n\nHowever, I fucking hate him for all the DOGE shit he has been doing lately. So\nmany people…",
  "original_created_utc": 1612738750,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "像严重。什么是错的这个家伙？\n\n我喜欢他和东西的所有工作，他正在做。该死的。我读过他的\n传记，并对他所做的一切工作深表敬佩。他是我暗恋的男人\n也是。\n\n然而，我他妈的恨他所有的DOGE狗屎，他最近一直在做。所以\n很多人...",
      "title": "ELON MUSK会让数以百万计的人REKT！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "像嚴重。什麼是錯的這個傢伙？\n\n我喜歡他和東西的所有工作，他正在做。該死的。我讀過他的\n傳記，並對他所做的一切工作深表敬佩。他是我暗戀的男人\n也是。\n\n然而，我他媽的恨他所有的DOGE狗屎，他最近一直在做。所以\n很多人...",
      "title": "ELON MUSK會讓數以百萬計的人REKT！"
    }
  ],
  "title": "ELON MUSK is gonna get millions of people REKT!",
  "created_utc": 1612749372,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like seriously. WTF is wrong with this guy?</p>\n\n<p>I like him and stuff for all the work he is doing. Hell. I have read his biography and admire him deeply for all the work he is doing. He is my man crush too.</p>\n\n<p>However, I fucking hate him for all the DOGE shit he has been doing lately. So many people gonna get trapped and end up wasting their life savings in that crap.</p>\n\n<p>I checked top ownership wallet and more than 40% off stack is owned by one single wallet and 20% by top 10 wallets.</p>\n\n<p>Once these guys dump their load, it&#39;s gonna come massively down. Honestly, DOGE bubble is gonna burst heavily than GME bubble. That&#39;s what I and one of buddy who have been in crypto space for 9 years think.</p>\n\n<p>I think all of this is planned and highly doubt the top wallet owner is Elon himself. Guy has done many crazy shit in his life and I won&#39;t be surprised if he owns millions/billions worth DOGEcoins. Also, doubt top wallet owners are paying celebrities for pumps.</p>\n\n<p>Don&#39;t play with fire guys! Be safe with your money.</p>\n\n<p>PS: I went in during the pump a week ago and came out with 30%. Went again a couple of times because of greed and came out with -5% twice. Removed DOGE from my favorites in Binance and never looked back as it seems highly and heavily manipulated.</p>\n</div><!-- SC_ON -->",
  "score": 1218,
  "permalink": "/r/CryptoCurrency/comments/lexyh6/elon_musk_is_gonna_get_millions_of_people_rekt/",
  "subreddit": "CryptoCurrency",
  "id": "lexyh6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123195577
}