{
  "author": "joeroganthumbhead",
  "the_new_excerpt": "Often times I hear about people who reach a $1 million net worth yet they don’t\nfeel wealthy or satisfied at all when I believe that this should be viewed as a\ntremendous accomplishment. Getting to $5 million is impossible if you never\nreach $1 million.\n\nI view $1 million as the ticket to true…",
  "original_created_utc": 1620786679,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "純資産が100万ドルに達しても、豊かさや満足感を感じられないという話をよく耳にします。\n豊かさや満足感を感じられないという話をよく耳にしますが、私はこれは非常に大きな達成感であると考えています。\nとてつもない達成感と捉えるべきだと思います。100万ドルに到達しなければ、500万ドルに到達することは不可能です。\n500万ドルに到達することは不可能です。\n\n私は、100万ドルを真の意味での富裕層へのチケットと考えています。",
      "title": "投資家の億万長者に質問です。あなたはどのくらいの金額で満足しましたか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多时候，我听到有人达到了100万美元的净资产，但他们并不感到富裕或满意。\n而我认为这应该被看作是一个巨大的成就。\n巨大的成就。如果你从未达到100万美元，那么达到500万美元是不可能的\n达到100万美元。\n\n我认为100万美元是通向真正财富的门票。",
      "title": "向投资者的百万富翁提问。你在哪一百万时感到满意？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多時候，我聽到有人達到了100萬美元的淨資產，但他們並不感到富裕或滿意。\n而我認爲這應該被看作是一個巨大的成就。\n巨大的成就。如果你從未達到100萬美元，那麼達到500萬美元是不可能的\n達到100萬美元。\n\n我認爲100萬美元是通向真正財富的門票。",
      "title": "向投資者的百萬富翁提問。你在哪一百萬時感到滿意？"
    }
  ],
  "title": "Question for the investor millionaires: At which million were you satisfied?",
  "created_utc": 1620810834,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Often times I hear about people who reach a $1 million net worth yet they don’t feel wealthy or satisfied at all when I believe that this should be viewed as a tremendous accomplishment. Getting to $5 million is impossible if you never reach $1 million. </p>\n\n<p>I view $1 million as the ticket to true wealth yet many people down play the idea of $1 million. So my question is, at which million did you feel wealthy enough and how did you get there (stocks - what was your strategy, real estate, crypto)?</p>\n</div><!-- SC_ON -->",
  "score": 120,
  "permalink": "/r/investing/comments/naecz6/question_for_the_investor_millionaires_at_which/",
  "subreddit": "investing",
  "id": "naecz6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985994601
}