{
  "author": "Odlavso",
  "original_created_utc": 1639233614,
  "title": "Hypothetically speaking, if I made millions with crypto where should I go?",
  "created_utc": 1639244031,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So Hypothetically if I got lucky with a random coin that turned my $1,000 investment into a couple of millions and I had nothing tying me down where a currently live.    &lt;/p&gt;\n\n&lt;p&gt;Let&amp;#39;s also say that I hypothetically currently live in the United States of America and speak Spanish and English&lt;/p&gt;\n\n&lt;p&gt;What country would be the best place to move to?    &lt;/p&gt;\n\n&lt;p&gt;What would be the benefits of moving to said location?    &lt;/p&gt;\n\n&lt;p&gt;And bounus question, what would be the requirements of moving to this country?&lt;/p&gt;\n\n&lt;p&gt;Again, this is only a thought expirement to get an idea of what everybody thinks is the best location to move to if I hypothetically became a &amp;quot;insert coin name here&amp;quot; millionaire.  &lt;/p&gt;\n\n&lt;p&gt;Tldr: pretending, wen moon? Where I go?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 180,
  "permalink": "/r/CryptoCurrency/comments/re141u/hypothetically_speaking_if_i_made_millions_with/",
  "subreddit": "CryptoCurrency",
  "id": "re141u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So Hypothetically if I got lucky with a random coin that turned my $1,000\ninvestment into a couple of millions and I had nothing tying me down where a\ncurrently live.\n\nLet's also say that I hypothetically currently live in the United States of\nAmerica and speak Spanish and English\n\nWhat country…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "つまり、仮に私がランダムなコインで幸運に恵まれ、1000ドルを手に入れたとしたら\nを数百万に増やすことができ、かつ、自分の住んでいる場所に何も縛られることなく\n現在住んでいるところです。\n\nまた、私が現在アメリカ合衆国に住んでいると仮定してみましょう。\nアメリカ、スペイン語と英語を話す\n\nどこの国の...",
      "title": "仮定の話ですが、もし私が暗号で何百万ドルも稼いだとしたら、どこに行けばいいでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，假设我幸运地得到了一个随机的硬币，把我的1000美元变成了几百万美元。\n的投资变成了几百万美元，而我没有任何束缚，在一个\n目前居住的地方。\n\n我们还假设我目前住在美国，会说西班牙语和英语。\n美国，会说西班牙语和英语\n\n什么国家...",
      "title": "假设一下，如果我用加密货币赚了几百万，我应该去哪里？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，假設我幸運地得到了一個隨機的硬幣，把我的1000美元變成了幾百萬美元。\n的投資變成了幾百萬美元，而我沒有任何束縛，在一個\n目前居住的地方。\n\n我們還假設我目前住在美國，會說西班牙語和英語。\n美國，會說西班牙語和英語\n\n什麼國家...",
      "title": "假設一下，如果我用加密貨幣賺了幾百萬，我應該去哪裏？"
    }
  ]
}