{
  "author": "redditish",
  "the_new_excerpt": "FINRA just reported officially there were 21.4 million short shares at the end\nof January, representing 46% of float, which is fairly high... But the true\ncount today could be much higher and closer to 129% based on my estimates as\ndescribed below, virtually unchanged from a month ago.\n\n---\n\nThe SEC…",
  "original_created_utc": 1612953728,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "美国金融业协会刚刚正式报道，在年底有2140万股空头股\n的1月，占浮动的46%，相当高... 但真正的\n根据我的估计，今天的计数可能会更高，接近129%。\n以下所述，与一个月前几乎没有变化。\n\n---\n\n证监会...",
      "title": "证据GME空头未被覆盖，估计截至2021年2月10日，总空头占比可能仍在129%左右。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "美國金融業協會剛剛正式報道，在年底有2140萬股空頭股\n的1月，佔浮動的46%，相當高... 但真正的\n根據我的估計，今天的計數可能會更高，接近129%。\n以下所述，與一個月前幾乎沒有變化。\n\n---\n\n證監會...",
      "title": "證據GME空頭未被覆蓋，估計截至2021年2月10日，總空頭佔比可能仍在129%左右。"
    }
  ],
  "title": "Evidence GME Shorts not covered and estimated total short share likely around 129% of float still as of February 10, 2021",
  "created_utc": 1612970951,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>FINRA just reported officially there were <strong>21.4 million short shares at the end of January, representing 46% of float</strong>, which is fairly high... But the true count today could be much higher and closer to 129% based on my estimates as described below, virtually unchanged from a month ago.</p>\n\n<p>---</p>\n\n<p>The SEC has previously warned that short sellers can hide their shorts through some trickery with the help of market makers. Well we have data reported by FINRA showing how much naked short selling was done by market makers through the end of January too, there was an explosion of 4.6 million shares of Short Exempt Volume by market makers, which could have been used to help short sellers hide their positions. (FINRA notes they don’t capture all data, and their total trading volume seems to be  a little less than half that shown on Yahoo Finance. Thus presumably to account for the full trading volume of activity we need to more than double the sample FINRA publishes. In other words <strong>10.2 million shares could have been hidden by market makers given the high Short Exempt Volume through the end of January</strong>.)</p>\n\n<p>More background info on this approach used by market makers to hide short positions.</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/leorks/evidence_points_to_gme_shorts_not_having_covered/\">https://www.reddit.com/r/wallstreetbets/comments/leorks/evidence_points_to_gme_shorts_not_having_covered/</a> </p>\n\n<p>Link to FINRA Short Exempt Volume data.</p>\n\n<p><a href=\"http://regsho.finra.org/regsho-Index.html\">http://regsho.finra.org/regsho-Index.html</a></p>\n\n<p>----</p>\n\n<p>Combining the official short shares and the potentially hidden short shares, we get to 31.6 million shares, representing 67% of float at the end of January.</p>\n\n<p>----</p>\n\n<p>Furthermore, the month of February saw a large increase of new short sales. FINRA data shows short sales represented more than half of FINRA trading volume throughout February, leading to the conclusion shorts have been increasing their stake against the company again opportunistically at higher prices this month. Some of the shorting likely was done by high frequency algos that typically close their position by day end, but the short volumes were so high it would be impossible to close all the shorts out given the limited volume. If there were no other buyers, and only short sellers opening and closing their positions throughout February, conservatively there would be a net 11.8 million new shorts that went unclose based on FINRA data, and if that is inflated to account for the trading volume FINRA is not capturing, then there may have been a total of <strong>29.1 million new shares shorted in February</strong>.</p>\n\n<p>---</p>\n\n<p>Bringing it all together.</p>\n\n<p>21.4 million short shares officially reported by FINRA for end of January.</p>\n\n<p>+10.2 million shares potentially hidden by market makers through Short Exempt Volume in January.</p>\n\n<p>+29.1 million new shares shorted through February 9th.</p>\n\n<p>---------------<br/>\n <strong>60.7 million shares short in total through February 9th by my estimates, representing 129% of float presently.</strong></p>\n\n<p><strong>-----</strong><br/>\n What does all this mean? There is still squeezing potential left, but with higher price thresholds than before. I estimate market makers could be holding the bag with approximately 20 million shares, while 20 million shares remain on the books of those short from January and earlier, and with 20 million new short positions taken during the month of February at higher price points.  </p>\n\n<p>The table below shows a rough estimate of the cumulative portion of shorts that would be underwater with losses at each price point. This was roughly estimated using the price ranges and short volumes by trading day. A<strong>t a $50 share price around 40% of the shorts are underwater by my estimates, and at a $100 share price around 75% would be underwater, and by a price of $150 more than 80% of shorts would be underwater.</strong> In other words, going above those price points would put pressure on an increasingly larger portion of the shorts to close out their positions.</p>\n\n<p>$450 = 98%</p>\n\n<p>$400 = 96%</p>\n\n<p>$350 = 94%</p>\n\n<p>$300 = 92%</p>\n\n<p>$250 = 88%</p>\n\n<p>$200 = 84%</p>\n\n<p>$150 = 81%</p>\n\n<p>$100 = 74%</p>\n\n<p>$50 = 42%</p>\n\n<p>This analysis can be improved upon with more detailed trading volume data by the minute, but this was based on day end volumes and price ranges. It also assumes the official short shares reports by FINRA at the end of January only represent about a third of all the shorts that actually exist today. Despite being very rough estimates, these are intended to  illustrate the prices that may potentially be key pain point prices for short sellers.</p>\n\n<p>----</p>\n\n<p>Regardless of a short squeeze possibility, I like the stock. GME can do well because of the company’s underlying fundamental merits and growth prospects from my perspective. I own a bunch of shares of GameStop.</p>\n\n<p>-----</p>\n\n<p>I am not a financial advisor, these are just my own opinions based on my research and estimates, using the limited data I have accessible to me, which may not capture the whole picture. My figures could have errors and may not be complete, and should not blindly be relied upon for your investment decisions. Do your own due diligence before making any investments.</p>\n</div><!-- SC_ON -->",
  "score": 197,
  "permalink": "/r/stocks/comments/lgr3aq/evidence_gme_shorts_not_covered_and_estimated/",
  "subreddit": "stocks",
  "id": "lgr3aq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123204979
}