{
  "author": "duurkl",
  "original_created_utc": 1631697347,
  "title": "RANT: whole crypto space feels just as corrupt as the system we are supposed to be fighting against.",
  "created_utc": 1631710696,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let me start by saying that there was a lot of times when greed got better of me too. Blinded by $$$, everyone loves a bit of cheap shills from time to time.</p>\n\n<p>But even at this point, on the fundamental level, I feel like I am personally still invested in this space based on technology and the ideals of a better, decentralized, transparent economy - driven by the wealth transfer to the people capable of these things, actually capable of running the world financial and data systems in a tranparent, decent, uncorruptable way - fair for everyone, with no preference on their backgrounds or the amount of wealth they own.</p>\n\n<p>But instead, what I see majority of this space has become, and what kind of people it has attracted due to the possible gains - scares me. We talk mostly about potential profit, ignore the basics, ignore the flaws, praise the corrupt and golden-mouthed, and do not care as far as we gain something from it.</p>\n\n<p>To be fair there is still a lot of very interesting threads about the technicals - but even then 90% of these are basically just a way to make some profit, or reasons to invest to make gains, not actually how this usecase could evolve the current system we live in and in what way it could be used to make things better as they are.</p>\n\n<p>And sorry - being able to swap between random speculative assets with zero intrinsic value on some random defi network - and brainless too-good-to-be-true yield farming is not a usecase that should be praised as our endgame.</p>\n\n<p>I thought we were supposed to be biased against this, but instead we are becoming the same kind of corrupt greedy ecosystem, full of people that care more about their personal gains, just equipped with &quot;cooler&quot; tech. We hate banks and goverments, but at the same time put money into all these shady projects, rug-pulls and obvious scams, run by even worse kind of people. The majority in here wants to realize their dreams of financial independence by ANY means necessary, while hating on their leaders, hedgefund managers, banksters and realtors - who are practically doing the same. It is hypocrisy at its best.</p>\n\n<p>So when I actually think about it, this space is pretty much very similar to the system and people who run the world now - soothed by empty promises, heavy lobbing, ignoring of the base level issues, and nonstop effort to patch these faulty holes with our favourite &quot;evernicesmelling&quot; papers..</p>\n\n<p>And I truly hope we can do better than that. Rant over.</p>\n\n<p><em>(PS: The current issues around SOL just prove this point, and the reaction from the fanboys triggers me a lot. Even though it is being in BETA - which 80% of retail investors actually have no idea about - managing tens of billions of dollars and saying funds are safu while the network is halted is definitely not okay, and it shines really bad light on the whole industry - SOL being top 10 coin.I guess SOL have invested much more of their profits to the marketing and satisfaction of early investors, than they had put into making sure their network - hovewer fast it is - is actually secure and decentralized. Top 7 coin being DDOSed and forced to stop is embarrasing at least. So people who put their faith, money and businesses on the network - got left behind once again. And anyone who says it is just FUD, please leave this space and never come back. I do not say SOL won&#39;t recover, it is okay to make mistakes and become stronger in the long run - but honey-talking the issue is definitely not the solution. Taking the responsibility and admiting of our own faults should be part of the game. And questioning the centralization of certain protocols is okay too. Some people might even prefer it it seems.</em></p>\n\n<p><em>But if anyone asks me why BTC/ETH are valued as high as they are, compared to &quot;faster cooler&quot; chains like SOL - it is due to the fact that I can sleep safely sure that my money are actually safe and accessible to me 24/7.)</em></p>\n</div><!-- SC_ON -->",
  "score": 491,
  "permalink": "/r/CryptoCurrency/comments/pomlcq/rant_whole_crypto_space_feels_just_as_corrupt_as/",
  "subreddit": "CryptoCurrency",
  "id": "pomlcq",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Let me start by saying that there was a lot of times when greed got better of me\ntoo. Blinded by $$$, everyone loves a bit of cheap shills from time to time.\n\nBut even at this point, on the fundamental level, I feel like I am personally\nstill invested in this space based on technology and the ideals…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初に断っておきますが、私も欲に負けたことが多々ありました。\nもありました。お金に目がくらんで、誰もがたまには安い嘘をつきたくなるものです。\n\nしかし、この時点でも、基本的なレベルでは、私は個人的にこの分野に投資していると感じています。\nしかし、この時点でも、基本的なレベルでは、個人的には、技術と理想に基づいて、この空間にまだ投資していると感じています...",
      "title": "RANT: 暗号空間全体が、我々が戦っているはずのシステムと同じように腐敗しているように感じます。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我先说，有很多时候，贪婪使我变得更好\n也是如此。被美元蒙蔽了双眼，每个人都喜欢时不时来点廉价的骗局。\n\n但即使在这一点上，在基本层面上，我觉得我个人\n依然基于技术和理想投资于这个空间......",
      "title": "咆哮：整个加密货币空间感觉就像我们应该反对的系统一样腐败。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我先說，有很多時候，貪婪使我變得更好\n也是如此。被美元矇蔽了雙眼，每個人都喜歡時不時來點廉價的騙局。\n\n但即使在這一點上，在基本層面上，我覺得我個人\n依然基於技術和理想投資於這個空間......",
      "title": "咆哮：整個加密貨幣空間感覺就像我們應該反對的系統一樣腐敗。"
    }
  ]
}