{
  "author": "bny192677",
  "original_created_utc": 1633603885,
  "title": "I'm so crypto addicted to the point I started using crypto terms in my day to day life",
  "created_utc": 1633638792,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I reached a new time level of crypto addiction and people around me started to notice ، I keep using crypto terms on everything in my life.</p>\n\n<p>for example I never use the word hold anymore all I keep saying is hodl , I never say double check I say 2x it , I get payed 300$ , in my mind it&#39;s 0.025 ETH , when I see fraud  all i think about is Tether</p>\n\n<p>Yesterday I bought some clothes on a sale , when my wife asked me how much I got those , I told her I bought them on a dip.</p>\n\n<p>I feel like I reached a new legendary level of crypto addiction and there&#39;s no cure for that ,so what are your suggestions for me to change</p>\n</div><!-- SC_ON -->",
  "score": 179,
  "permalink": "/r/CryptoCurrency/comments/q36gma/im_so_crypto_addicted_to_the_point_i_started/",
  "subreddit": "CryptoCurrency",
  "id": "q36gma",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I reached a new time level of crypto addiction and people around me started to\nnotice ، I keep using crypto terms on everything in my life.\n\nfor example I never use the word hold anymore all I keep saying is hodl , I\nnever say double check I say 2x it , I get payed 300$ , in my mind it's 0.025\nETH ,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は暗号中毒の新しいレベルに達し、周りの人々が\n周りの人が気付き始めました。私は生活のあらゆる場面で暗号用語を使い続けています。\n\n例えば、ホールドという言葉はもう使っていないし、ホッドルとしか言っていない。\nダブルチェックとは言わずに、2倍と言っています。私は300ドルをもらったのですが、心の中では0.025\nETH,...",
      "title": "日常生活の中で暗号用語を使い始めるほど暗号中毒になってしまった"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对加密货币的沉迷达到了一个新的时间水平，我周围的人开始注意到\n我在生活中的所有事情上都使用加密货币术语。\n\n例如，我不再使用 \"持有 \"这个词，我一直在说 \"HODL\"，我从不说 \"双重检查\"，而是说 \"2倍\"，我得到了300美元的报酬。\n我从来不说双倍检查，我说2倍，我得到了300美元的报酬，在我的脑海中，这是0.025\nETH ，...",
      "title": "我对加密货币如此上瘾，以至于我开始在日常生活中使用加密货币术语。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對加密貨幣的沉迷達到了一個新的時間水平，我周圍的人開始注意到\n我在生活中的所有事情上都使用加密貨幣術語。\n\n例如，我不再使用 \"持有 \"這個詞，我一直在說 \"HODL\"，我從不說 \"雙重檢查\"，而是說 \"2倍\"，我得到了300美元的報酬。\n我從來不說雙倍檢查，我說2倍，我得到了300美元的報酬，在我的腦海中，這是0.025\nETH ，...",
      "title": "我對加密貨幣如此上癮，以至於我開始在日常生活中使用加密貨幣術語。"
    }
  ]
}