{
  "author": "OnlyZuul666",
  "original_created_utc": 1625939731,
  "title": "Does anyone else feel like it’s almost impossible to have any completely original thoughts these days?",
  "created_utc": 1625984140,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I sometimes find myself in conversations with other people where they find something I say as clever and they ask if I came up with it. Obviously sometimes I’m making a reference to something but there are quite a few genuine moments that I am not sure. When I find myself in those situations, I always say “I probably just picked it up somewhere”. These days we ingest so much information from different sources that I feel I have no idea the extent of what I have experienced subliminally affects my ability to have original ideas. It’s kind of infuriating to always feel like this and I’m wondering if other people feel the same way?</p>\n</div><!-- SC_ON -->",
  "score": 104,
  "permalink": "/r/TooAfraidToAsk/comments/ohng73/does_anyone_else_feel_like_its_almost_impossible/",
  "subreddit": "TooAfraidToAsk",
  "id": "ohng73",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I sometimes find myself in conversations with other people where they find\nsomething I say as clever and they ask if I came up with it. Obviously sometimes\nI’m making a reference to something but there are quite a few genuine moments\nthat I am not sure. When I find myself in those situations, I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "他の人との会話の中で、私が言ったことが気になって、「君が考えたの？\nと聞かれることがあります。もちろん、時には\n明らかに何かを参考にしている場合もありますが、本音ではよくわからない瞬間が結構あります。\n確信が持てないことが結構あります。そんなとき、私は...。",
      "title": "最近、完全に独創的な考えを持つことはほとんど不可能だと感じている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有时会发现自己在与其他人的谈话中，他们发现我说的一些话很聪明，他们会问我是否想出来的。\n我说的一些话很聪明，他们问我是否想出了这个办法。显然，有时\n显然，有时我是在参考某些东西，但也有相当多的真实时刻\n我不确定。当我发现自己处于这些情况时，我...",
      "title": "是否有其他人觉得这些天几乎不可能有任何完全原创的想法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有時會發現自己在與其他人的談話中，他們發現我說的一些話很聰明，他們會問我是否想出來的。\n我說的一些話很聰明，他們問我是否想出了這個辦法。顯然，有時\n顯然，有時我是在參考某些東西，但也有相當多的真實時刻\n我不確定。當我發現自己處於這些情況時，我...",
      "title": "是否有其他人覺得這些天幾乎不可能有任何完全原創的想法？"
    }
  ]
}