{
  "author": "jakekick1999",
  "original_created_utc": 1639684614,
  "title": "How to use ETH and BTC to become wealthy",
  "created_utc": 1639697783,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Yes, you read that title right. I&amp;#39;m going to share with you what it takes to become wealthy using just the top two large cap crypto. This might seem absurd compared to the 100x magic bullet micro cap coins that everyone else digs up.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Niceee. Finally someone made a go to guide that is gonna get us lambos.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Uhh.. Not quite. You see lets define &lt;strong&gt;WEALTHY&lt;/strong&gt; and see how it is different from the word &lt;strong&gt;Rich.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/wn29xvvhby581.png?width=821&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=53ad7fbddde9764030f33de95f24f292a3611854\"&gt;Ahem, yeah we know how to google and english man, stop messing with us&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/4eru9i3lby581.png?width=840&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8c6b46501864bce6bbf225e78d294ff48c861508\"&gt;https://preview.redd.it/4eru9i3lby581.png?width=840&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=8c6b46501864bce6bbf225e78d294ff48c861508&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Alright lets just compare rich versus wealthy. Then you might be enlightened:&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/8pf36i0lcy581.png?width=1016&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=b777b34aa5147772aa7f0f7042f4eb2cefef93cf\"&gt;Assorted collection of article headings from countless websites explaining the difference&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Basically, the &lt;strong&gt;rich have a large sum of money while the wealthy are able to generate enough money to always be rich.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;My goal with this method of investment is to ensure that following it, we end up with enough investment that we are able to generate wealth passively that is enough to aid or even sustain living comfortably.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Okay... Spill the beans, what do we need to do ?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;This stratergy requires you to put in three things:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;Time&lt;/li&gt;\n&lt;li&gt;Money&lt;/li&gt;\n&lt;li&gt;Effort and Perseverance&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;&lt;em&gt;-ROLLS EYES- Yeah if we had money to throw around we would have been rich in the first place. What troll is this ?&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Not quite. What I am proposing is a simple yet effective stratergy that we have heard a bazillion times on this subreddit. And that is &lt;strong&gt;DCA !!!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Oh F Off man, downvote, report. Ban this guy from this sub&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;Wait wait, let me explain it in detail. This is worth your time.&lt;/p&gt;\n\n&lt;p&gt;Consider getting a 10 percent average year on year growth in the price of an asset. This means if it costs 100$ to buy today, then next year it will cost 110$, and the year after that it will cost 121$ and so on. So what we are going to do is invest in a periodic manner into this asset so that over the course of multiple years our investments grows substantially. How substantially ? It might blow your mind&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/v14fcuztey581.png?width=885&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=1a88304dd2cffadef7d299668dbdce2038fac94f\"&gt;Ignore the Indian Rupee, the calculation is independent of the currency and only dependent on the amount&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Imagine putting in 500$ a month for the next 10 years&lt;/p&gt;\n\n&lt;p&gt;When the 10 years have come, you would have invested i.e spent out of your pocket &lt;strong&gt;60,000$&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;But when you are going to cash out, you have over &lt;strong&gt;100,00$&lt;/strong&gt; at your disposal. So you have made a profit of &lt;strong&gt;43,000$&lt;/strong&gt; which is a 71 percent profit&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;Pffftt... 71 percent. Those are rookie numbers.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;But wait a minute, we considered a 10 percent year on year growth right ? That means that if ETH today costs 4000$ then it must cost no more than 4400$ next year to be 10 percent growth.... LOL you think thats the potential of ETH or BTC ? We have seen so much movement within the last few months that over the course of multiple years or a bear and bull cycle, we can easily have a positive outlook. Thats the beauty of this method. Lets just put in a quick 15 percent optimistic rise. A little dirty mind math says we can expect to double the price of ETH within 6 or 7 years. Then.....&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/wsh0ko0xgy581.png?width=885&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=36b929fc5efbb41abbc59c6ebcc470a848c745f7\"&gt;Interesting isn&amp;#39;t it ?&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your investment amount for 10 years still is the same at 60,000$ but your profits went from ~43,000$ to ~&lt;strong&gt;80,000$ which is almost doubling.&lt;/strong&gt; Again a 15 percent year on year growth might still be conservative. Punching a 20 percent just to see the madness unfold&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/fysnp63ahy581.png?width=885&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=401a475920cfd357c68ed29359683e6f942c26f5\"&gt;Voila&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Your profits are &lt;strong&gt;200 percent of your investment. ie you have tripled the amount of money you have put into crypto.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Now of course, there is one more thing that I haven&amp;#39;t told you guys and that is &lt;strong&gt;step up&lt;/strong&gt; in investment as well. Over the course of ten years, it is likely that your fiat paying job will progress and you can afford to invest more as the years go by. This is the &amp;quot;stepping up&amp;quot; of your monthly investment. Lets say for the first 12 months you do 500$ a month and then then next 12 months at 550$ dollars a month which means every year, you are increasing your monthly investment amount by 10 percent. Adding that into the calculation we can have the hopium overdose of...&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/xns4em44iy581.png?width=885&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=86967afe6d00c0e9ce8b2c28aef5951a35a2bef2\"&gt;2.5X your intial investment by just blindly throwing money at the top 2 crytpo with no other plans or chart looking or anything&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;This also ignores other key aspects where you can further increase the returns. Buying ETH means you can stake them for even more returns &lt;strong&gt;BUT those returns are in ETH itself which increases in price. This compounds things so much that I am unable to find an online calculator (LOL)&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So I hope I have convinced you on why DCA or SIP (Systematic Investment Plan) is a much more easy and much less risky than the concept of just chasing the next micro cap shilling and scams.&lt;/p&gt;\n\n&lt;p&gt;BUT, as with the case, there are caveats. My recommendation for ETH and BTC are the follows:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;BTC is the OG and will always be a part of institutional investment.&lt;/li&gt;\n&lt;li&gt;ETH is the largest platform as a crypto that exists today. Years of development and countless projects have made it the largest to the point where we can safely assume it will be the baseline standard for years to come.&lt;/li&gt;\n&lt;li&gt;Compared to a lot of cyrpto celebrity, Vitalik Buterin, the co founder of ETH is much more of a good person who has a good track record of being on the morally right side. Yes their track record of delivering updates has been sub par to put it mildly. But the team are working hard led by a man who is as much a nerd as we are and I genuinely believe he wants ETH to succeed to make the world a better place.&lt;/li&gt;\n&lt;li&gt;Competition for ETH in the form of other coins have been growing and is ever present. But they also are facing their fair share of troubles and issues. Apart from marketing, nothing can claim to be an ETH killer.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;And more importantly about the things that we put in:&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;The MONEY part. Yes there is no beating around the bush with it. Invest what you can. Rather than dreaming of what you could put in, put in what you have right now.&lt;/li&gt;\n&lt;li&gt;The TIME part. Yes this is a long term plan that indeed makes you wealthy. You&amp;#39;ll have a decent chunk of money by the end of the SIP that you can use to it buy a house, buy something that makes you happy&lt;/li&gt;\n&lt;li&gt;The EFFORT and PERSEVERANCE part. You need to be patient for this to pay off. Unless you definitely need the money, try sticking to investing the amount you planned. Persevere and it will pay off definitely.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;This is just my own 2 cents about how I plan to try and retire in the next 15 years. I wanted to share with you guys to show that it really is possible. Thank you if you read till here and gave this idea a thought. But, if you scrolled till here, then TLDR is &lt;strong&gt;DCA FOR TEN YEARS !!!!!!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll be making a follow up post on what I plan to do when I cash into the DCA. If there is anything I missed or is wrong, let me know in the comments and I&amp;#39;ll put those into the post and the next one. Share your thoughts too :)&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 202,
  "permalink": "/r/CryptoCurrency/comments/rhypzc/how_to_use_eth_and_btc_to_become_wealthy/",
  "subreddit": "CryptoCurrency",
  "id": "rhypzc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yes, you read that title right. I'm going to share with you what it takes to\nbecome wealthy using just the top two large cap crypto. This might seem absurd\ncompared to the 100x magic bullet micro cap coins that everyone else digs up.\n\nNiceee. Finally someone made a go to guide that is gonna get us…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そう、このタイトルはちゃんと読んでいるのです。これから紹介するのは、そのために必要なことです。\n大型暗号の上位2つだけを使って裕福になる。ばかばかしいと思うかもしれませんが\nみんなが掘り起こす100倍の魔法の弾丸マイクロキャプテンコインに比べれば。\n\nいいねぇ。やっと、誰かが私たちを捕まえるためのガイドを作った...",
      "title": "ETHとBTCを利用して富裕層になる方法"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "是的，你没看错，这个标题。我将与你分享只用前两个大市值加密货币就能致富的方法。\n只用前两个大市值的加密货币就能致富。这可能看起来很荒谬\n与其他人挖出的100倍魔弹式微市值硬币相比。\n\nNiceee。终于有人做了一个去的指南，要让我们...",
      "title": "如何利用ETH和BTC发家致富"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "是的，你沒看錯，這個標題。我將與你分享只用前兩個大市值加密貨幣就能致富的方法。\n只用前兩個大市值的加密貨幣就能致富。這可能看起來很荒謬\n與其他人挖出的100倍魔彈式微市值硬幣相比。\n\nNiceee。終於有人做了一個去的指南，要讓我們...",
      "title": "如何利用ETH和BTC發家致富"
    }
  ]
}