{
  "author": "ipetgoat1984",
  "original_created_utc": 1646785527,
  "title": "The “it’s solid team and project” argument doesn’t work anymore.",
  "created_utc": 1646815168,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I used to think it did, it has been the reason I’ve invested in specific projects, but you know what, it doesn’t work. Not in an unregulated space where you can just develop a coin out of thin air and list it on random exchanges.&lt;/p&gt;\n\n&lt;p&gt;You can have all the roadmaps and genius developers in the world, but the second you don’t deliver on those promises or the second your lead dev quits; the project tanks so far into the depths it could take years to recover, if ever. &lt;/p&gt;\n\n&lt;p&gt;Look at ADA, such high hopes for Cardano, so many promises, institutional backing, hype, devs..... trees in Africa. And now, the face of the company is accused of lying about his degree, among other questionable activities.&lt;/p&gt;\n\n&lt;p&gt;Look at FTM, Andre, and Anton just deciding to peace out, closing 25 apps and services, dragging some of its projects down over 64%. &lt;/p&gt;\n\n&lt;p&gt;Just to name a few.&lt;/p&gt;\n\n&lt;p&gt;I know we all tout “DYOR, make sure it’s a good team, and they have a solid roadmap,” but in the end, we’re all still just gambling.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 333,
  "permalink": "/r/CryptoCurrency/comments/t9v25p/the_its_solid_team_and_project_argument_doesnt/",
  "subreddit": "CryptoCurrency",
  "id": "t9v25p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I used to think it did, it has been the reason I’ve invested in specific\nprojects, but you know what, it doesn’t work. Not in an unregulated space where\nyou can just develop a coin out of thin air and list it on random exchanges.\n\nYou can have all the roadmaps and genius developers in the world,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前はそう思っていましたし、それが具体的な投資をする理由でした。\nでもね、うまくいかないんですよ。規制のない空間では\n何もないところからコインを開発し、無作為の取引所に上場することができるのです。\n\n世界中のロードマップや天才的な開発者がいても...",
      "title": "強固なチームとプロジェクトだから」という言い分はもう通用しない。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我曾经认为它是这样的，它一直是我投资于特定项目的原因。\n项目，但你知道吗，它不起作用。在一个不受管制的空间里，你不能\n你可以凭空开发一个硬币，然后在随机交易所上市。\n\n你可以拥有世界上所有的路线图和天才开发者，...",
      "title": "\"这是坚实的团队和项目 \"的论点不再起作用了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我曾經認爲它是這樣的，它一直是我投資於特定項目的原因。\n項目，但你知道嗎，它不起作用。在一個不受管制的空間裏，你不能\n你可以憑空開發一個硬幣，然後在隨機交易所上市。\n\n你可以擁有世界上所有的路線圖和天才開發者，...",
      "title": "\"這是堅實的團隊和項目 \"的論點不再起作用了。"
    }
  ]
}