{
  "author": "rhetorical_twix",
  "the_new_excerpt": "Last week and earlier this week, I've been posting warnings about watching out\nfor increased volatility leading into March, and particularly toward the end of\nMarch, which is the end of Q1. We're going to see unwinding of massive positions\nin the pandemic and tech stocks that were successful in 2020…",
  "original_created_utc": 1614348619,
  "localize": [
    {
      "locale": "zh",
      "title": "是什么原因导致了昨日股市的抛售：价值500亿债券的解禁。",
      "the_new_excerpt": "上周和本周早些时候，我一直在发布警告，提醒大家注意\n进入3月，特别是3月底，也就是第一季度结束的时候，要注意波动性的增加。\n3月，也就是第一季度的末尾。我们将看到大量头寸的平仓\n在2020年成功的大流行病和科技股中的大量仓位......。"
    },
    {
      "locale": "zh-Hant",
      "title": "是什麼原因導致了昨日股市的拋售：價值500億債券的解禁。",
      "the_new_excerpt": "上週和本週早些時候，我一直在發佈警告，提醒大家注意\n進入3月，特別是3月底，也就是第一季度結束的時候，要注意波動性的增加。\n3月，也就是第一季度的末尾。我們將看到大量頭寸的平倉\n在2020年成功的大流行病和科技股中的大量倉位......。"
    }
  ],
  "title": "What caused stocks to dump yesterday: the unwinding of $50B worth of bonds",
  "created_utc": 1614357879,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Last week and earlier this week, I&#39;ve been posting warnings about watching out for increased volatility leading into March, and particularly toward the end of March, which is the end of Q1. We&#39;re going to see unwinding of massive positions in the pandemic and tech stocks that were successful in 2020 as institutions and professionals will be forced to change their portfolios to more value oriented stocks that will perform better in high interest rate conditions: commodities, energy, high free cash flow businesses, industrials and financials. I refer to this as &quot;rotation&quot; where portfolios evolve from being focused on one sector or asset class to another over time. This Spring, these rotations may not occur in a slow, calm and orderly way. </p>\n\n<p>Monday, as I said in an earlier post this week, I liquidated most of my positions in the hot stocks of 2020, including EVs, and began focusing on interest-rate proof businesses. These are businesses with lower long term debt, good free cash flow, actual positive profit margins, and good balance sheets. I&#39;m just holding long positions in outright cash purchases of stock, so I don&#39;t have complicated positions to &quot;unwind&quot; (I just sell a stock to get out of a position). However, institutional and professional investors, and hedge funds, have more complicated and leveraged portfolios. </p>\n\n<p>We can&#39;t expect the unwinding of positions of so-called &quot;whales&quot; (big players) in the market to always be orderly or calm as the end of Q1 approaches. </p>\n\n<p>Yesterday&#39;s market dump appears to have been triggered by one or more whales forcefully selling $50B of bonds into a reluctant buyer&#39;s market. The below is a good article from Bloomberg but it&#39;s premium content so I&#39;ll summarize it below because it answers the question, <em>Why are bond yields spiking despite the Federal Reserve setting its interest rates to banks so low and WTF is going on in the bond market?</em></p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2021-02-26/chaotic-treasury-selloff-fueled-by-50-billion-position-unwind\">Chaotic Treasury Selloff Fueled by $50 Billion of Unwinding</a>(Paywall)</p>\n\n<ul>\n<li><strong>A massive dump of $50B in bonds suggest one (or a few) positions were unwound by one or more whales</strong><br/></li>\n</ul>\n\n<blockquote>\n<p>“It wasn’t an orderly selloff and certainly didn’t appear to be driven by any obvious fundamental continuation or extension of the reflation thesis,” wrote NatWest Markets strategist Blake Gwinn in a note to clients. </p>\n</blockquote>\n\n<ul>\n<li><strong>&quot;Fundamental decoupling&quot; between low interest rates and a heating economy</strong></li>\n</ul>\n\n<p>Bond and lending pros are rejecting the Federal Reserve&#39;s low-interest view, which is at odds with 6-7% growth projected due to stimulus plans and rebound from the pandemic and Powell&#39;s talk of &quot;maximum employment&quot; plans</p>\n\n<blockquote>\n<p>The bond market’s divergence from a fundamental backdrop was most evident at the shorter-end of the curve. Eurodollar contracts -- which are priced off Libor -- collapsed in record volumes as traders repriced their expectations for the path of Fed rates with few obvious catalysts.</p>\n</blockquote>\n\n<ul>\n<li><strong>What exactly happened?  5-year Treasury notes jumped 22 points, and spreads associated with those notes jumped 24 points</strong></li>\n</ul>\n\n<blockquote>\n<p>The main protagonist in the bond market was the five-year Treasury note, a maturity often associated with long-term Fed rate expectations, where yields closed 22 basis point higher on the day. The so-called butterfly-spread index -- a measure of how the note is performing against its two- and 10-year peers -- jumped 24 basis points, the worst daily performance for the sector since 2002.</p>\n\n<p>Markets now see a Fed hike by March 2023 compared to mid-2023 previously, and have priced in rates over 50 basis points higher by 2024.</p>\n\n<p>But in remarks this week, Fed Chairman Jerome Powell offered reassurance that policy would continue to be supportive and look beyond a temporary pick-up in inflation, especially from a low base. While Fed Vice Chair Richard Clarida expressed cautious optimism on the outlook, he said it would “take some time” to restore the economy to pre-pandemic levels.</p>\n</blockquote>\n\n<ul>\n<li><strong>Bond buyers who disagree with the Fed were &quot;on strike&quot; yesterday and created a &quot;liquidity drought&quot;</strong> </li>\n</ul>\n\n<blockquote>\n<p>A number of more “technical-style” factors were in the mix, against a backdrop of a good-old-fashioned buyers strike...</p>\n\n<p>A lack of bond market liquidity, just when traders needed it most [i.e. during a big dump of $50B in bonds]</p>\n</blockquote>\n\n<ul>\n<li><strong>Also high frequency trading exists in the bond market too, apparently, and they suddenly disappeared yesterday in a market that was used to their presence, at the same time buyers thinned out</strong></li>\n</ul>\n\n<blockquote>\n<p>“We think that a steep decline in market depth contributed to the outsized moves in yields today,” wrote JPMorgan Chase &amp; Co. strategist Jay Barry in a note to clients. Barry showed how the share of high-frequency traders in the Treasury market -- which has been on an increasing trend -- tends to retreat rapidly as volatility spikes.</p>\n</blockquote>\n\n<p>I expect to see more volatility as positions from 2020 unwind and people create whole new portfolios for post-pandemic 2021. This is a good time to look at which stocks are the ones doing well each day and why. </p>\n\n<p>Disclaimer: Not a financial professional</p>\n\n<p>Edit: I plan to reenter tech stocks hardcore once these whales are done with whatever BS they do at the end of every quarter whenever there are big changes.</p>\n</div><!-- SC_ON -->",
  "score": 5596,
  "permalink": "/r/stocks/comments/lsyfcs/what_caused_stocks_to_dump_yesterday_the/",
  "subreddit": "stocks",
  "id": "lsyfcs",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937742107
}