{
  "author": "rockinoutwith2",
  "the_new_excerpt": "There was some \"weird\" speculation on this sub a few days ago that Warren\nperhaps bought into Tesla...it ended up being Verizon and Chevron (lol)\n\n--------------------------------------------------------------------------------\n\nWarren Buffett’s Berkshire Hathaway Inc. cut its Apple Inc. holding…",
  "original_created_utc": 1613520734,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "几天前，在这个子上有一些 \"奇怪 \"的猜测，华伦?\n或许买下了特斯拉......最后变成了Verizon和雪佛龙（呵呵）。\n\n--------------------------------------------------------------------------------\n\n巴菲特旗下的伯克希尔哈撒韦公司减持苹果公司...",
      "title": "伯克希尔下调苹果押注，透露雪佛龙、威瑞森持股。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾天前，在這個子上有一些 \"奇怪 \"的猜測，華倫?\n或許買下了特斯拉......最後變成了Verizon和雪佛龍（呵呵）。\n\n--------------------------------------------------------------------------------\n\n巴菲特旗下的伯克希爾哈撒韋公司減持蘋果公司...",
      "title": "伯克希爾下調蘋果押注，透露雪佛龍、威瑞森持股。"
    }
  ],
  "title": "Berkshire trims Apple bet, reveals Chevron, Verizon holdings",
  "created_utc": 1613528918,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There was some &quot;weird&quot; speculation on this sub a few days ago that Warren perhaps bought into Tesla...it ended up being Verizon and Chevron (lol)</p>\n\n<hr/>\n\n<p>Warren Buffett’s Berkshire Hathaway Inc. cut its Apple Inc. holding during the last few months of the year.</p>\n\n<p>The conglomerate also revealed three new buys that it snapped up in secret. Berkshire bought stock in Verizon Communications Inc., insurance broker Marsh &amp; McLennan Cos. and Chevron Corp., bets that were granted confidential status and not revealed in a third-quarter regulatory filing, according to an updated document released Tuesday. The Apple stake reduction left Berkshire with a holding valued at US$120 billion at the end of 2020, according to another filing.</p>\n\n<p>Berkshire spent the last three months of the year revamping its bets on some other sectors. Buffett’s conglomerate cut a few bank holdings, exiting JPMorgan Chase &amp; Co., PNC Financial Services Group Inc. and M&amp;T Bank Corp. while slashing its Wells Fargo &amp; Co. stake by 59 per cent. The company also shifted a recent bet on drugmakers by increasing a stake in Merck &amp; Co Inc., Abbvie Inc. and Bristol-Myers Squibb Co., while exiting a recent investment in Pfizer Inc.</p>\n\n<p>Berkshire also exited a bet on Barrick Gold Corp. The investment was a surprise when it was revealed last year, given Buffett’s years of chiding the precious metal.</p>\n\n<p><a href=\"https://www.bnnbloomberg.ca/berkshire-trims-apple-bet-reveals-chevron-verizon-holdings-1.1564415\">https://www.bnnbloomberg.ca/berkshire-trims-apple-bet-reveals-chevron-verizon-holdings-1.1564415</a></p>\n</div><!-- SC_ON -->",
  "score": 329,
  "permalink": "/r/investing/comments/llhfdj/berkshire_trims_apple_bet_reveals_chevron_verizon/",
  "subreddit": "investing",
  "id": "llhfdj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613728622065
}