{
  "author": "ManInBlack829",
  "original_created_utc": 1624414228,
  "title": "What would be a good place to start for a person who is wanting to learn about Native American artifacts, culture and lifestyle?",
  "created_utc": 1624463906,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently visited some Mississippian mounds and also have a visit planned to Mesa Verde.  It made me realize that not only is learning about these places fascinating, but I don&#39;t know very much either.</p>\n\n<p>I really don&#39;t need to learn anything specific, just looking for preferably a documentary or book that gives me a look into their culture.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/o638j7/what_would_be_a_good_place_to_start_for_a_person/",
  "subreddit": "AskHistorians",
  "id": "o638j7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently visited some Mississippian mounds and also have a visit planned to\nMesa Verde. It made me realize that not only is learning about these places\nfascinating, but I don't know very much either.\n\nI really don't need to learn anything specific, just looking for preferably a\ndocumentary or book…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、ミシシッピアン墳墓群を訪れましたし、メサベルデにも行く予定です。\nメサベルデを訪れる予定です。これらの場所について学ぶことは魅力的であるだけでなく、自分自身もあまり知らないことがあると気づかされました。\n興味深いだけでなく、私もあまり知らないことに気づかされました。\n\n具体的に何かを学ぶ必要はなく、できればドキュメンタリーや写真集を探しています。\nできればドキュメンタリーか本を探しています...。",
      "title": "ネイティブ・アメリカンの工芸品や文化、ライフスタイルについて学びたいと考えている人にとって、何から始めるのが良いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近参观了一些密西西比人的土丘，还计划去参观\nMesa Verde。这让我意识到，不仅对这些地方的了解\n吸引人，而且我也知道得不多。\n\n我真的不需要学习任何具体的东西，只是希望最好能有一部\n纪录片或书籍...",
      "title": "对于一个想了解美国原住民文物、文化和生活方式的人来说，什么地方是一个好的开始？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近參觀了一些密西西比人的土丘，還計劃去參觀\nMesa Verde。這讓我意識到，不僅對這些地方的瞭解\n吸引人，而且我也知道得不多。\n\n我真的不需要學習任何具體的東西，只是希望最好能有一部\n紀錄片或書籍...",
      "title": "對於一個想了解美國原住民文物、文化和生活方式的人來說，什麼地方是一個好的開始？"
    }
  ]
}