{
  "author": "Layneeeee",
  "the_new_excerpt": "I tried summing up the top 50 altcoins in 1 or 2 sentences. It is not perfect\nand you obviously shouldn't make any decision based on this list, but hopefully\nit will help newcomers find some projects they're interested in and\nunderstanding a little bit better this technology.\n\nIf something is wrong…",
  "original_created_utc": 1612872205,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我试着用1、2句话总结了前50个altcoins。它并不完美\n很明显，你不应该根据这份名单做出任何决定，但是希望\n它将帮助新人找到一些他们感兴趣的项目，并。\n对这项技术的理解更深一点。\n\n如果有什么问题...",
      "title": "给新人：50大加密货币，每一种都用一句话解释。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我試着用1、2句話總結了前50個altcoins。它並不完美\n很明顯，你不應該根據這份名單做出任何決定，但是希望\n它將幫助新人找到一些他們感興趣的項目，並。\n對這項技術的理解更深一點。\n\n如果有什麼問題...",
      "title": "給新人：50大加密貨幣，每一種都用一句話解釋。"
    }
  ],
  "title": "For the newcomers: the top 50 Cryptocurrencies, each explained with one sentence.",
  "created_utc": 1612877919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I tried summing up the top 50 altcoins in 1 or 2 sentences. It is not perfect and you obviously shouldn&#39;t make any decision based on this list, but hopefully it will help newcomers find some projects they&#39;re interested in and understanding a little bit better this technology.</p>\n\n<p>If something is wrong or misleading, feel free to comment and I&#39;ll edit the post. Obviously in 2 sentences is hard to describe the whole project idea, but I tried my best.</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><strong>Bitcoin (BTC):</strong> the original. According to the creator (or creators?) Satoshi Nakamoto, it was created to allow “online payments to be sent directly from one party to another without going through a financial institution.”</li>\n<li><strong>Ethereum (ETH):</strong> Ethereum is the wonder child of crypto, acts as an infrastructure for most decentralized applications. Introduces smart contracts, which are like programs with specific procedures that, once deployed, no one can change.</li>\n<li><strong>Tether (USDT):</strong> a centralized stablecoin tied to the dollar (so Elon, please don’t try to pump it)</li>\n<li><strong>Polkadot (DOT):</strong> open-source protocol aimed at connecting all different blockchains and allowing them to work together, allowing transfers of any data.</li>\n<li><strong>Cardano (ADA):</strong> Another blockchain, trying to improve scalability, interoperability and sustainability of cryptocurrencies. Those who hold the cryptocurrency have the right to vote on any proposed changes in the software.</li>\n<li><strong>Ripple (XRP):</strong> centralized coin, most people don’t see a future for it after SEC went after it.</li>\n<li><strong>Binance Coin (BNB)</strong>: coin associated with the Binance exchange, so valuable since it is the most popular centralized exchange.</li>\n<li><strong>Litecoin (LTC):</strong> Bitcoin’s cousin, with faster transactions and lower fees.</li>\n<li><strong>Chainlink (LINK):</strong> the main idea is to LINK smart contracts with real-world data, verifying that this data is correct.</li>\n<li><strong>Dogecoin (DOGE):</strong> Wow, such high ranking! (Okay, now please let’s get Stellar back in the top 10).</li>\n<li><strong>Bitcoin Cash (BCH):</strong> fork of Bitcoin (so a copy with some differences), which tries to lower transaction fees and increase scalability but has been surpassed technology-wise by many other coins aiming to do just the same.</li>\n<li><strong>Stellar (XLM):</strong> talking about currencies, XLM is one of the coins aiming to do just that, with fast processing times and low fees. It has also already become a stablecoin! (I’m kidding).</li>\n<li><strong>USD Coin (USDC):</strong> another centralized stablecoin tied to the dollar, like USDT.</li>\n<li><strong>Aave (AAVE):</strong> take a bank and make it decentralized, where the liquidity comes from the users and they earn fees from borrows. This is Aave.</li>\n<li><strong>Uniswap (UNI):</strong> Another DeFi like Aave, but this time it’s an exchange like Binance, just decentralized.</li>\n<li><strong>Wrapped Bitcoin (WBTC):</strong> It’s just bitcoin wrapped in ethereum to be used in DeFi applications.</li>\n<li><strong>Bitcoin SV (BSV)*:</strong> Bitcoin Scam Variant</li>\n<li><strong>EOS (EOS):</strong> another blockchain, aimed at being highly scalable for commercial use. It aims to make it as straightforward as possible for programmers to embrace the blockchain technology.</li>\n<li><strong>Elrond (EGLD):</strong> Blockchain architecture focused on scalability and high throughput, achieving this by partitioning the chain state and an improved Proof of Stake mechanism</li>\n<li><strong>TRON (TRX):</strong> have you seen Silicon Valley, when they try to create a decentralized internet? Yeah, Tron’s founder is Richard Hendricks. It is also one of the most popular blockchain to build decentralized applications on.</li>\n<li><strong>Cosmos (ATOM):</strong> several independent blockchains trying to create an “internet of blockchains”.</li>\n<li><strong>NEM (XEM):</strong> instead of controlling just money, you can control stock ownership, contracts, medical records, and stuff like that</li>\n<li><strong>Monero (XMR)*:</strong> if you need drugs</li>\n<li><strong>THETA (THETA):</strong> decentralized video delivery network (peer-to-peer streaming). The token performs various governance tasks within the network.</li>\n<li><strong>Tezos (XTZ):</strong> another blockchain for smart contracts, but more eco-friendly and overall trying to encompass different advancements introduced by different blockchains in a single protocol.</li>\n<li><strong>Terra (LUNA):</strong> aiming to support a global payment network, it tries to create a decentralized stablecoin with an elastic money supply, enabled by stable mining incentives. Its related stablecoin is TerraUSD</li>\n<li><strong>Maker (MKR):</strong> MakerDAO is the organization behind DAI, one of the most famous stablecoins. MKR is a token that allows you to receive dividends and vote in governing the system.</li>\n<li><strong>Synthetix (SNX):</strong> protocol on the ethereum blockchain aiming to allow trading of derivatives (shorting or going long on a certain asset).</li>\n<li><strong>Avalanche (AVAX):</strong> open-source platform aiming to become a global asset exchange, where anyone can launch any form of asset and control it in a decentralized way with smart contracts. It claims to be lightweight, with high throughput and scalable.</li>\n<li><strong>VeChain (VET):</strong> a blockchain focusing on business use-cases more than on technology, bringing this technology to the masses without them even knowing they’re using it.</li>\n<li><strong>Compound (COMP):</strong> It’s the Bitcoin of DeFi. It was the first-mover and without him many other projects wouldn’t be around today.</li>\n<li><strong>IOTA (MIOTA):</strong> open-source decentralized cryptocurrency engineered for the Internet of Things, with zero transaction fees and high scalability since it uses a blockless blockchain where users and verifiers of transactions are the same (it may sound wrong but it’s actually a genius concept, impossible to sum up in a single sentence).</li>\n<li><strong>Neo (NEO):</strong> Blockchain application platform and cryptocurrency for digitized identities and assets, aiming to create a smart economy. It was one of the coins that suffered most after the 2018 bull run.</li>\n<li><strong>Solana (SOL):</strong> another blockchain aimed at providing super-high-speed transactions. It claims to be able to process 50k transactions per second and be perfect to deploy scalable crypto applications.</li>\n<li><strong>Dai (DAI):</strong> the decentralized stablecoin of MakerDAO, tied to the dollar.</li>\n<li><strong>Huobi Token (HT):</strong> it’s the official token of Huobi (a centralized exchange), providing advantages similar to BNB (Binance’s), for example fees discounts.</li>\n<li><strong>SushiSwap (SUSHI):</strong> a clone of UniSwap (so a decentralized exchange), where there’s a token (SUSHI) given as an additional reward for liquidity providers and farmers.</li>\n<li><strong>Binance USD (BUSD):</strong> Stablecoin issued by Binance, tied to USD.</li>\n<li><strong>FTX Token (FTT):</strong> It’s a token related to FTX, a platform allowing you to trade leveraged tokens based on the Ethereum blockchain. The token allows for lower fees and socialized gains.</li>\n<li><strong>Crypto.com Coin (CRO):</strong> the token of Crypto.com public blockchain, that tries to enable transaction worldwide between people and businesses.</li>\n<li><strong>Filecoin (FIL):</strong> a decentralized storage system, trying to decentralize cloud storage services.</li>\n<li><strong>UMA (UMA):</strong> it builds open-source infrastructure in order to create synthetic tokens on the Ethereum blockchain</li>\n<li><strong>UNUS SED LEO (LEO):</strong> another token, this time related to the iFinex ecosystem which allows you to save money on trading fees in Bitfinex.</li>\n<li><strong>BitTorrent (BTT):</strong> BitTorrent is a famous peer-to-peer file sharing platform. It is trying to get more decentralized by introducing its token, which grants you some benefits such as increased download speeds.</li>\n<li><strong>Celsius (CEL):</strong> Celsius is one of the first banking platforms for cryptocurrency users, where you can earn interest, borrow cash and make payments/transfers. The CEL token grants you some benefits such as increased payouts.</li>\n<li><strong>Algorand (ALGO):</strong> Algorand is a blockchain network aiming to improve scalability and security. ALGO is the native cryptocurrency of the network, used for a borderless economy and to secure stability in the blockchain.</li>\n<li><strong>Dash (DASH):</strong> It is a fork of Litecoin launched in 2014, focused on improving the transaction times of the blockchain and become a cheap, decentralized payments network.</li>\n<li><strong>Decred (DCR):</strong> it is a blockchain-based cryptocurrency aimed at facilitating open governance and community interaction. It achieves this by avoiding monopoly over voting status in the project itself, giving to all DCR holders the same amount of decision-making power.</li>\n<li><strong>The Graph (GRT):</strong> Trying to become the decentralized Google, it is an indexing protocol for querying networks like Ethereum. It allows everyone to publish open APIs that applications can query to retrieve blockchain data.</li>\n<li><strong>yearn.finance (YFI):</strong> part of the DeFi ecosystem, it is an aggregator that tries to simplify the DeFi space for investors, automatic the process of maximizing the profits from yield farming.</li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>*EDIT:</p>\n\n<p>A couple of coin descriptions were just jokes, here are the actual explanations:</p>\n\n<ul>\n<li><strong>Bitcoin SV (BSV):</strong> It is a fork of Bitcoin Cash (which is also a fork of Bitcoin). Once again, the reason behind this is to &quot;stay true to Satoshi vision&quot;, trying to improve scalability and stability.</li>\n<li><strong>Monero (XMR):</strong> Monero&#39;s goal is simple: to allow transactions to take place privately and with anonymity. Even though it’s commonly thought that BTC can conceal a person’s identity, it’s often easy to trace payments back to their original source because blockchains are transparent. On the other hand, XMR is designed to obscure senders and recipients alike through the use of advanced cryptography. Obviously this made this coin the go-to on the dark web.</li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 13211,
  "permalink": "/r/CryptoCurrency/comments/lg1yhv/for_the_newcomers_the_top_50_cryptocurrencies/",
  "subreddit": "CryptoCurrency",
  "id": "lg1yhv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123197353
}