{
  "author": "anakanin",
  "original_created_utc": 1628508443,
  "title": "Beginners don't be afraid just start from HERE",
  "created_utc": 1628537731,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Are you just starting out in crypto and you are completely overwhelmed by a ton of info that is coming from every direction? Don&#39;t worry!</p>\n\n<p>I compiled several guides to help you out in a beginners friendly way. If you have any questions that bug you or something you don&#39;t understand feel free to send me a DM and I&#39;ll try to help a fellow cryptoguy or a girl out.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>1. First guide to read is imperative before you even start. Know who the predators are and how to be safe</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/p0x3dx/complete_list_of_most_common_scams_in_crypto/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">List of most common scams in crypto</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>2.  Learn everything you need to know about wallets</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/og5ifi/updated_complete_beginners_guide_to/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Complete beginners guide to wallets</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>3. And of course learn how to secure your wallet in the best way possible</strong></p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/owyr9h/complete_guide_to_securing_your_wallet/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Guide on how to secure your crypto wallet</a></p>\n\n<p>&#x200B;</p>\n\n<p><strong>4. How about earning some FREE crypto? My experiences in a handy list</strong> </p>\n\n<p><a href=\"https://www.reddit.com/r/CryptoCurrency/comments/ow7lsp/free_crypto_tier_list/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Tier list of completely FREE crypto</a></p>\n\n<p>&#x200B;</p>\n\n<p>&#x200B;</p>\n\n<p>I started dabbling with crypto about a year ago after seeing that my financial life is completely stalled and that my families future is pitch dark the ways are going. As a millennial, crypto is my beacon in the dark. I don&#39;t have much financial freedom to invest but in time I hope that this tiny beacon grows into a sun that will outshine every light and bring people brighter future.</p>\n\n<p>&#x200B;</p>\n\n<p>Welcome aboard newbies and let me know if there is anything I can help you with.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/p0zkkr/beginners_dont_be_afraid_just_start_from_here/",
  "subreddit": "CryptoCurrency",
  "id": "p0zkkr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Are you just starting out in crypto and you are completely overwhelmed by a ton\nof info that is coming from every direction? Don't worry!\n\nI compiled several guides to help you out in a beginners friendly way. If you\nhave any questions that bug you or something you don't understand feel free to\nsend…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "あなたは暗号化を始めたばかりで、あらゆる方向から来る大量の情報に完全に圧倒されています。\nあらゆる方向からの情報に圧倒されていませんか？心配しないでください。\n\n私は、初心者に優しい方法であなたを助けるためにいくつかのガイドをまとめました。もし、あなたが\n疑問点や理解できないことがあれば、お気軽に\nお寄せください。",
      "title": "初心者の方も安心してここから始めてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你是否刚开始接触加密货币，而你完全被大量的\n的信息，你是否被来自各个方向的大量信息所淹没？别担心！我汇编了几份指南，以帮助你解决这个问题。\n\n我汇编了几份指南，以一种对初学者友好的方式帮助你。如果你\n有任何问题或不明白的地方，请随时联系我。\n发送...",
      "title": "初学者不要害怕，从这里开始。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你是否剛開始接觸加密貨幣，而你完全被大量的\n的信息，你是否被來自各個方向的大量信息所淹沒？別擔心！我彙編了幾份指南，以幫助你解決這個問題。\n\n我彙編了幾份指南，以一種對初學者友好的方式幫助你。如果你\n有任何問題或不明白的地方，請隨時聯繫我。\n發送...",
      "title": "初學者不要害怕，從這裏開始。"
    }
  ]
}