{
  "author": "Username-Not-A-Bot",
  "original_created_utc": 1628256918,
  "title": "''Give a man a steak and he'll eat for a day. Teach a man to stake he eats forever'' - I earned 5600 TIMES MORE interest staking than when my money was on a savings account!",
  "created_utc": 1628281840,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before you start accusing me of being a Moon Farmer; <em>&#39;Yeah u have seen this title before&#39;!</em>                              I like it, it`s catchy, shout out to who ever came up with it!</p>\n\n<p>Now let`s move on to my story and why I use this title and explain why if you HODL crypto, you should really look into staking.</p>\n\n<p>I don`t want to shill the crypto I am staking and I know it`s not so smart to share amounts of money here. So I will keep it short and simple!</p>\n\n<h1>Staking my crypto made me 5600 times more money than I got from interest over my money while at a bank and the current worth of the crypto</h1>\n\n<p>Yeah u read that correctly, the same amount of money over the same period of time, made me <strong><em>5600</em></strong> <strong><em>times</em></strong> more interest!</p>\n\n<p>For the love of god, look into staking!</p>\n\n<p><em>Cheers!</em></p>\n</div><!-- SC_ON -->",
  "score": 170,
  "permalink": "/r/CryptoCurrency/comments/oz6rfc/give_a_man_a_steak_and_hell_eat_for_a_day_teach_a/",
  "subreddit": "CryptoCurrency",
  "id": "oz6rfc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Before you start accusing me of being a Moon Farmer; 'Yeah u have seen this\ntitle before'! I like it, it`s catchy, shout out to who ever came up with it!\n\nNow let`s move on to my story and why I use this title and explain why if you\nHODL crypto, you should really look into staking.\n\nI don`t want to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がムーン・ファーマーだと非難する前に、「あなたはこのタイトルを見たことがあります。\nタイトルを見たことがある」と言われます。私はこのタイトルが好きですし、キャッチーで、このタイトルを考えた人にエールを送りたいと思います。\n\nでは、私の話に移り、なぜこのタイトルを使っているのか、そして、もしあなたが暗号をHODLするのであれば\n暗号をHODLする場合、ステーキングを検討する必要があります。\n\n私は...したくありません。",
      "title": "''Give a steak and he'll eat for a day''である。ステーキを与えれば一日食べられるが、賭け方を教えれば永遠に食べられる」 - 私は、普通預金に預けていたときよりも、賭けたほうが5600倍も多くの利息を得ました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在你开始指责我是一个月球农民之前；\"是的，你已经看到了这个标题\n标题！\"。我喜欢它，它朗朗上口，向想出它的人致敬!\n\n现在让我们继续讨论我的故事，以及为什么我使用这个标题，并解释为什么如果你\nHODL加密货币，你真的应该研究一下赌注。\n\n我不想...",
      "title": "''给一个人一块牛排，他就能吃一天。教一个人赌钱，他就能吃一辈子'' - 我赌钱赚的利息比我的钱放在储蓄账户上的时候多了5600倍!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在你開始指責我是一個月球農民之前；\"是的，你已經看到了這個標題\n標題！\"。我喜歡它，它朗朗上口，向想出它的人致敬!\n\n現在讓我們繼續討論我的故事，以及爲什麼我使用這個標題，並解釋爲什麼如果你\nHODL加密貨幣，你真的應該研究一下賭注。\n\n我不想...",
      "title": "''給一個人一塊牛排，他就能喫一天。教一個人賭錢，他就能喫一輩子'' - 我賭錢賺的利息比我的錢放在儲蓄賬戶上的時候多了5600倍!"
    }
  ]
}