{
  "author": "HV51",
  "original_created_utc": 1628939960,
  "title": "How did people stand to wear so much clothing in the summer in the 19th century and early 20th.",
  "created_utc": 1628965555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People seem to have worn a lot of clothing in the 19th century. Regardless of the climate, you frequently see people wearing a jacket, vest, and undershirt. Even in the desert. Military uniforms frequently seem to have high collars and have many layers even in the summer. </p>\n\n<p>How did anyone stand this? People today dress much lighter, and in richer nations you are likely to be air conditioned quite often whenever you are inside or in a car.</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/p467sk/how_did_people_stand_to_wear_so_much_clothing_in/",
  "subreddit": "AskHistorians",
  "id": "p467sk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "People seem to have worn a lot of clothing in the 19th century. Regardless of\nthe climate, you frequently see people wearing a jacket, vest, and undershirt.\nEven in the desert. Military uniforms frequently seem to have high collars and\nhave many layers even in the summer.\n\nHow did anyone stand this?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "19世紀の人々は、たくさんの服を着ていたようです。気候に左右されることなく\n気候に関わらず、ジャケット、ベスト、アンダーシャツを着ている人をよく見かけます。\n砂漠でも。軍服は襟が高く、夏でも重ね着をしていることが多いようです。\n夏でも何枚も重ね着をしています。\n\nこれに耐えられる人はいるのだろうか...。",
      "title": "19世紀から20世紀初頭にかけて、人々はどのようにして夏にたくさんの服を着ることができたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在19世纪，人们似乎穿了很多的衣服。不管是什么\n气候，你经常看到人们穿着夹克、背心和衬衣。\n即使是在沙漠中。军装似乎经常有高领和\n即使在夏天也有很多层。\n\n有人怎么能忍受这些呢？",
      "title": "在19世纪和20世纪初，人们怎么能忍受在夏天穿这么多衣服。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在19世紀，人們似乎穿了很多的衣服。不管是什麼\n氣候，你經常看到人們穿着夾克、背心和襯衣。\n即使是在沙漠中。軍裝似乎經常有高領和\n即使在夏天也有很多層。\n\n有人怎麼能忍受這些呢？",
      "title": "在19世紀和20世紀初，人們怎麼能忍受在夏天穿這麼多衣服。"
    }
  ]
}