{
  "author": "godisgeyyy",
  "original_created_utc": 1631936060,
  "title": "On which coin youre extremely confident that it will be huge in next 5-10 years ?",
  "created_utc": 1631997555,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Im bullish on literally every good project on short term but for long term im quite bullish on ALGO, ONE, VET, TEZOS, MINA and quite a few but the coin im most bullish on is CRO. CRO is token of crypto.com (a growing exchange)</p>\n\n<p>I judge coins for its survival chances in bear cycle rather than the pump it gets in bull cycle. </p>\n\n<p>And CRO is going to stay for long because i dont think a crypto exchange wont collapse in a bear cycle. Currently crypto.com is small in comparison to binance or CB but its the fastest growing exchange and it has been doing some next level of marketing and partnership with UFC and F1 etc.</p>\n\n<p>CRO market cap is just under 5B right now and i expect it to grow slow and steadily in next 5-10 years.</p>\n\n<p>Whats your coin where youre damn sure it will succeed?</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/pqf01u/on_which_coin_youre_extremely_confident_that_it/",
  "subreddit": "CryptoCurrency",
  "id": "pqf01u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Im bullish on literally every good project on short term but for long term im\nquite bullish on ALGO, ONE, VET, TEZOS, MINA and quite a few but the coin im\nmost bullish on is CRO. CRO is token of crypto.com (a growing exchange)\n\nI judge coins for its survival chances in bear cycle rather than the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "短期的には良いプロジェクトには全て強気で臨みますが、長期的には無理です。\nALGO、ONE、VET、TEZOS、MINAなどにはかなり強気ですが、最も強気なコインはCROです。\n最も強気なコインはCROです。CROはcrypto.com（成長中の取引所）のトークンです。\n\n私がコインを判断するのは、ベアサイクルの中で生き残るチャンスがあるかどうかではなく、...",
      "title": "5年後、10年後に巨大化すると確信しているのはどのコインですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我看好几乎所有短期的好项目，但从长期来看，我相当看好ALGO、VET、TEZOS、MINA和其他一些项目。\n我相当看好ALGO、ONE、VET、TEZOS、MINA和许多其他项目，但我最看好的币种是CRO。\n但我最看好的是CRO。CRO是crypto.com（一个成长中的交易所）的代币。\n\n我判断硬币在熊市周期中的生存机会，而不是它的价格。",
      "title": "你对哪种硬币非常有信心，认为它将在未来5-10年内变得巨大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我看好幾乎所有短期的好項目，但從長期來看，我相當看好ALGO、VET、TEZOS、MINA和其他一些項目。\n我相當看好ALGO、ONE、VET、TEZOS、MINA和許多其他項目，但我最看好的幣種是CRO。\n但我最看好的是CRO。CRO是crypto.com（一個成長中的交易所）的代幣。\n\n我判斷硬幣在熊市週期中的生存機會，而不是它的價格。",
      "title": "你對哪種硬幣非常有信心，認爲它將在未來5-10年內變得巨大？"
    }
  ]
}