{
  "author": "luciagrace",
  "original_created_utc": 1625315892,
  "title": "Why are overweight women always so unnecessarily hateful when someone slim speaks about their diet/weight?",
  "created_utc": 1625322087,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This is the third time I’ve had this happen in the span of a month! I don’t understand this mentality, I guess this is the safest place to ask…</p>\n\n<p>I’m a slim woman, I’m also tall (6ft) I always thought that there is absolutely no reason for someone to comment on other people’s bodies, but clearly this doesn’t ring true for everyone.</p>\n\n<p>I was out with my dog today, and met an old school friend, we had a chat and caught up. Eventually she started saying how she’s getting out more as she wants to lose weight, I said something along the lines of ‘yeah, my stomach has become pudgier over quarantine, I’m with you.’ And she looked as if I just slapped her in the face!</p>\n\n<p>Asked me if I was trying to be spiteful and walked off.</p>\n\n<p>I’ve also had an issue with a previous coworker, I was feeling a little weak that day since I didn’t eat yet, and in passing mentioned I will probably have a feast on break. She went on to say ‘wow I bet it’s so nice being able to eat so much and not worry about your weight.’ I tried saying this isn’t true, If I eat badly I will gain weight, but she wasn’t having any if it.</p>\n\n<p>Then with another coworker, who asked me how much I weigh, I didn’t feel comfortable but she practically forced me to answer, I said 58kilos, she then went on a tirade saying ‘wow shouldn’t you be in the hospital?’ And ‘I bet you eat like a rabbit.’</p>\n\n<p>I don’t know, but this is really starting to agitate me, why are they like this? Especially since I have PCOS, endo and hashimotos, it was the hardest thing I did, losing weight. But it’s like people don’t care, because you’re skinny now. I know what it’s like, I’ve been on both ends of the spectrum, it’s hard to explain that to someone though, because they don’t listen, they don’t care, because I’m ‘skinny now.’</p>\n</div><!-- SC_ON -->",
  "score": 126,
  "permalink": "/r/TooAfraidToAsk/comments/ocxa31/why_are_overweight_women_always_so_unnecessarily/",
  "subreddit": "TooAfraidToAsk",
  "id": "ocxa31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "This is the third time I’ve had this happen in the span of a month! I don’t\nunderstand this mentality, I guess this is the safest place to ask…\n\nI’m a slim woman, I’m also tall (6ft) I always thought that there is absolutely\nno reason for someone to comment on other people’s bodies, but clearly…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これは1ヶ月の間に3回目の出来事でした。私には理解できません。\nこの心理が理解できないので、ここで聞くのが一番安全だと思いますが...。\n\n私は細身の女性で、身長も高いです（6フィート）私はいつも、他人のことをコメントする理由は全くないと思っています。\n他人の体についてコメントする理由は全くないと思っていましたが、明らかに...。",
      "title": "太った女性は、スリムな人が自分のダイエットや体重について話すと、なぜいつも不必要なほど憎悪を抱くのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这是我在一个月内第三次遇到这种情况了! 我不\n我不明白这种心态，我想这是最安全的地方了......\n\n我是一个苗条的女人，我也很高（6英尺）。\n我一直认为没有理由对别人的身体进行评论，但显然...",
      "title": "为什么当一个苗条的人谈到他们的饮食/体重时，超重的女性总是那么不必要地憎恨？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這是我在一個月內第三次遇到這種情況了! 我不\n我不明白這種心態，我想這是最安全的地方了......\n\n我是一個苗條的女人，我也很高（6英尺）。\n我一直認爲沒有理由對別人的身體進行評論，但顯然...",
      "title": "爲什麼當一個苗條的人談到他們的飲食/體重時，超重的女性總是那麼不必要地憎恨？"
    }
  ]
}