{
  "author": "xavierwest888",
  "original_created_utc": 1642255011,
  "title": "Who else is ignoring the FUD and feeling really bullish on crypto for 2022?",
  "created_utc": 1642272343,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Title covers it in a sentence, I&amp;#39;ve been in crypto for a few years and I&amp;#39;m hearing the same tired excuses this January that are repeated every time the market dips/corrects/crashes.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;This time it&amp;#39;s over&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The experts are saying that the stock markets are going to crash any day now&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;BTC was funded by printed money is the only reason it pumped, it will never pump again&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Blah, blah blah. Every time these lines of reason are rolled out and every time crypto pumps back up again. You wouldn&amp;#39;t get this in the regular stock market, people don&amp;#39;t see a recession and be all like &amp;quot;well that&amp;#39;s it for stocks, it&amp;#39;s been all pump for 100 years but it&amp;#39;s over forever now&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Well I&amp;#39;ve read it all before and I don&amp;#39;t see anything to worry me. The markets already down almost 50% from ATH and has been stable for 9 days and counting meaning huge gains when we set a new ATH and despite the painting the FUD want&amp;#39;s to share I see that ATH hitting in this year with no issue.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/s4kuct/who_else_is_ignoring_the_fud_and_feeling_really/",
  "subreddit": "CryptoCurrency",
  "id": "s4kuct",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Title covers it in a sentence, I've been in crypto for a few years and I'm\nhearing the same tired excuses this January that are repeated every time the\nmarket dips/corrects/crashes.\n\n\"This time it's over\"\n\n\"The experts are saying that the stock markets are going to crash any day now\"\n\n\"BTC was…"
}