{
  "author": "hyperinflationUSA",
  "the_new_excerpt": "We are bigger and stronger than tesla. Bitcoin is the new world reserve\ncurrency. It replaces the US dollar. Now that QE-infinite has beguan, everyone\nand every company in the world needs Bitcoin. This is why companies started\nbuying bitcoin in the first place. Don't let the noise distract you.…",
  "original_created_utc": 1622779784,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "我々はテスラよりも大きくて強い。ビットコインは新しい世界の基軸通貨\n通貨になります。それは米ドルに取って代わる。QE-infiniteが始まった今、世界中のすべての人、すべての企業がビットコインを必要としています。\n世界中のあらゆる企業がビットコインを必要としています。そもそも企業がビットコインを買い始めたのはこのためです。\nそもそも企業がビットコインを買い始めた理由です。雑音に惑わされないように....",
      "title": "reminder BitcoinはTeslaよりもはるかに大きい。ビットコインの方が時価総額が大きく、一日の出来高も多く、世界での重要性も大きい。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们比特斯拉更大、更强。比特币是新的世界储备\n货币。它取代了美元。现在QE-infinite已经开始了，世界上每个人\n和世界上的每个公司都需要比特币。这就是为什么公司开始\n购买比特币的初衷。不要让噪音分散你的注意力....",
      "title": "提醒 比特币比特斯拉大得多。比特币的市值更大，每天的交易量更大，在世界上的重要性也更大。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們比特斯拉更大、更強。比特幣是新的世界儲備\n貨幣。它取代了美元。現在QE-infinite已經開始了，世界上每個人\n和世界上的每個公司都需要比特幣。這就是爲什麼公司開始\n購買比特幣的初衷。不要讓噪音分散你的注意力....",
      "title": "提醒 比特幣比特斯拉大得多。比特幣的市值更大，每天的交易量更大，在世界上的重要性也更大。"
    }
  ],
  "title": "reminder Bitcoin is wayyy bigger than Tesla. Bitcoin has a bigger market cap, more daily volume, and bigger importance in the world.",
  "created_utc": 1622811719,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We are bigger and stronger than tesla. Bitcoin is the new world reserve currency. It replaces the US dollar. Now that QE-infinite has beguan, everyone and every company in the world needs Bitcoin. This is why companies started buying bitcoin in the first place. Don&#39;t let the noise distract you. Bitcoin will become the single most valuable asset in the world.   </p>\n\n<p>New coiners don&#39;t realize bitcoin&#39;s true power. They laugh, they joke, they shitpost.<br/>\nAn electric car aint gonna do you much good once hyperinflation starts.</p>\n</div><!-- SC_ON -->",
  "score": 250,
  "permalink": "/r/Bitcoin/comments/nrw7zw/reminder_bitcoin_is_wayyy_bigger_than_tesla/",
  "subreddit": "Bitcoin",
  "id": "nrw7zw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404877357
}