{
  "author": "Nostalg33k",
  "original_created_utc": 1643452840,
  "title": "Crypto is teaching a lot of young people how to invest and manage their money.",
  "created_utc": 1643470545,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;A lot of people discovered the world of personal finance through Crypto. This may be a big generational change. In the US a lot of people were already invested in the stock market and in their 401K. But in a lot of European countries people are not invested in the world of Finance (for example in France the retirement is nationalized so people have less incentive to make their own portfolios)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;One of the underestimated aspect of crypto is the education provided to people about financial products, markets, and many other aspects of money management. DeFi and Crypto are often described as the democratization of Finance and it may very well be true. &lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;This change will radially modify how people think about money !&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 343,
  "permalink": "/r/CryptoCurrency/comments/sffkhm/crypto_is_teaching_a_lot_of_young_people_how_to/",
  "subreddit": "CryptoCurrency",
  "id": "sffkhm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "A lot of people discovered the world of personal finance through Crypto. This\nmay be a big generational change. In the US a lot of people were already\ninvested in the stock market and in their 401K. But in a lot of European\ncountries people are not invested in the world of Finance (for example in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cryptoを通じてパーソナルファイナンスの世界を知った人は多い。これは\nは、大きな世代交代かもしれません。アメリカでは、多くの人がすでに\n株式市場や401Kに投資しています。しかし、ヨーロッパの多くの国々では\n金融の世界に投資していない国（例えば、...",
      "title": "クリプトは、多くの若者に投資や資金管理の方法を教えています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "很多人通过加密货币发现了个人金融的世界。这\n这可能是一个很大的代际变化。在美国，很多人已经\n投资于股票市场和他们的401K。但在很多欧洲\n但在很多欧洲国家，人们并没有投资于金融世界（例如，在美国）。",
      "title": "Crypto正在教很多年轻人如何投资和管理他们的钱。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很多人通過加密貨幣發現了個人金融的世界。這\n這可能是一個很大的代際變化。在美國，很多人已經\n投資於股票市場和他們的401K。但在很多歐洲\n但在很多歐洲國家，人們並沒有投資於金融世界（例如，在美國）。",
      "title": "Crypto正在教很多年輕人如何投資和管理他們的錢。"
    }
  ]
}