{
  "author": "InevitableSoundOf",
  "original_created_utc": 1658318116,
  "title": "Terra Luna and Celsius have really opened my eyes to just how much money people have put into crypto",
  "created_utc": 1658363650,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m talking percentage of their overall wealth.&lt;/p&gt;\n\n&lt;p&gt;When Terra Luna collapsed and then subsequently Celsius went bankrupt the sheer amount of posts and comments talking about losing all their savings was startling. People putting hundreds of thousands of dollars in one project because they somehow trusted a commercial entity with everything they&amp;#39;ve saved.&lt;/p&gt;\n\n&lt;p&gt;The shear amount of risk that is involved with crypto just cannot be understated.....there just is absolutely no guarantee here, and really a high probability of not even breaking even.&lt;/p&gt;\n\n&lt;p&gt;Really having any amount in crypto that will negatively impact your quality of life if lost should be carefully considered. At the end of the day it&amp;#39;s the individuals choice, but dam is it tragic seeing so much hurt from these failed projects months later.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 378,
  "permalink": "/r/CryptoCurrency/comments/w3kfzu/terra_luna_and_celsius_have_really_opened_my_eyes/",
  "subreddit": "CryptoCurrency",
  "id": "w3kfzu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm talking percentage of their overall wealth.\n\nWhen Terra Luna collapsed and then subsequently Celsius went bankrupt the sheer\namount of posts and comments talking about losing all their savings was\nstartling. People putting hundreds of thousands of dollars in one project\nbecause they somehow…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らの全財産に占める割合の話です。\n\nテラルーナが破綻し、その後セルシオが破綻したとき、その膨大な量の\n貯蓄をすべて失ったという書き込みやコメントの多さには驚かされました。\n驚くほどでした。一つのプロジェクトに何十万ドルもつぎ込んでいる人たちがいる。\nというのも、なんとなく...",
      "title": "Terra LunaとCelsiusは、人々が暗号にどれだけのお金をつぎ込んでいるか、私の目を開かせてくれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我说的是他们整体财富的百分比。\n\n当Terra Luna公司倒闭，随后Celsius公司破产的时候，大量的\n谈论失去所有积蓄的帖子和评论的数量令人吃惊。\n令人震惊。人们在一个项目中投入几十万美元\n因为他们以某种方式...",
      "title": "Terra Luna和Celsius真的让我大开眼界，了解到人们在加密货币上投入了多少资金。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我說的是他們整體財富的百分比。\n\n當Terra Luna公司倒閉，隨後Celsius公司破產的時候，大量的\n談論失去所有積蓄的帖子和評論的數量令人喫驚。\n令人震驚。人們在一個項目中投入幾十萬美元\n因爲他們以某種方式...",
      "title": "Terra Luna和Celsius真的讓我大開眼界，瞭解到人們在加密貨幣上投入了多少資金。"
    }
  ]
}