{
  "author": "goonerh2o9",
  "original_created_utc": 1626363339,
  "title": "I am new to this sub and cryto and can i just say wow.",
  "created_utc": 1626377572,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>First off i just want to thank everyone for being so informitive and helpful and give a special thanks to the mods who are doing a great job. I just started buying crypto about 2 months ago and ive had a blast interacting with this community since! Ive learned so much about my favorit coins and maybe about some i shouldnt own hahah.I just think its awsome u guys have your own currency (that i now have!) and how u can earn it by helping people out and entertaining others its just awsome! I just wanted to drop a kind of hello/apreciation post now that i have 500+ karma.</p>\n\n<p>Edit: wow thank you guys so much for all the awards and upvotes! im so exited to be part of the community!</p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/CryptoCurrency/comments/okvavn/i_am_new_to_this_sub_and_cryto_and_can_i_just_say/",
  "subreddit": "CryptoCurrency",
  "id": "okvavn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "First off i just want to thank everyone for being so informitive and helpful and\ngive a special thanks to the mods who are doing a great job. I just started\nbuying crypto about 2 months ago and ive had a blast interacting with this\ncommunity since! Ive learned so much about my favorit coins and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "まず最初に、情報を提供してくれた皆さんに感謝したいと思います。\nまた、素晴らしい仕事をしてくれているモデレーターにも感謝しています。私は約2ヶ月前にcryptoを買い始めました。\n2ヶ月ほど前に暗号を買い始めたばかりですが、それ以来、このコミュニティとの交流はとても楽しかったです。\nコミュニティとの交流はとても楽しかったです。私は自分の好きなコインについて多くのことを学びましたし、...",
      "title": "私はこのサブ機とCrytoの初心者ですが、一言で言えば「すごい」です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "首先，我只想感谢每个人的信息量和帮助。\n特别感谢那些做得很好的管理员。我刚刚开始\n大约2个月前开始购买加密货币，并与这个社区进行了愉快的互动。\n社区进行互动。我学到了很多关于我喜欢的硬币的知识。",
      "title": "我是第一次接触这个子和Cryto，我只能说，哇。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "首先，我只想感謝每個人的信息量和幫助。\n特別感謝那些做得很好的管理員。我剛剛開始\n大約2個月前開始購買加密貨幣，並與這個社區進行了愉快的互動。\n社區進行互動。我學到了很多關於我喜歡的硬幣的知識。",
      "title": "我是第一次接觸這個子和Cryto，我只能說，哇。"
    }
  ]
}