{
  "author": "DDelphinus",
  "the_new_excerpt": "Most people are aware off dollar-cost averaging and other strategies of buying\ninto Cryptocurrency. DCA means buying in over time, instead of at once, to\nreduce the impact of volatility.\n\nI'm one of the people who had a lot of money in 2017, but lost it all by FOMO\nchasing into shit coins which went…",
  "original_created_utc": 1612553874,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "大多数人都知道关闭美元成本平均法和其他策略的购买。\n成加密货币。DCA是指在一段时间内买入，而不是一次买入，以达到\n减少波动的影响。\n\n我就是一个在2017年有很多钱，但被FOMO赔了个精光的人。\n追到狗屎币，这去... ...",
      "title": "计划你的退出策略。在FOMO来袭之前，聪明点。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大多數人都知道關閉美元成本平均法和其他策略的購買。\n成加密貨幣。DCA是指在一段時間內買入，而不是一次買入，以達到\n減少波動的影響。\n\n我就是一個在2017年有很多錢，但被FOMO賠了個精光的人。\n追到狗屎幣，這去... ...",
      "title": "計劃你的退出策略。在FOMO來襲之前，聰明點。"
    }
  ],
  "title": "Plan your exit strategy. Be smart before FOMO hits.",
  "created_utc": 1612586376,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Most people are aware off dollar-cost averaging and other strategies of buying into Cryptocurrency. DCA means buying in over time, instead of at once, to reduce the impact of volatility.</p>\n\n<p>I&#39;m one of the people who had a lot of money in 2017, but lost it all by FOMO chasing into shit coins which went -95% </p>\n\n<p>My advice is therefore to start thinking about your exit strategy and your expectations, even if you have no intend of (ever) selling. </p>\n\n<p>My strategy is to DCA out of crypto. I have set target amounts for all my large holdings and will take out a % whenever these are reached. I&#39;ve planned it out untill BTC is 2.5 million and Ether 100.000.</p>\n\n<p>Today I sold my first 5% of Ethereum. The FOMO is big and I would never have sold it without the plan I made 2 years ago. However, it feels good to know I have taken some profit and still have 95% left to enjoy the ride.</p>\n\n<p>If everything does go -95% again, at least I know I&#39;ve taken profits at prices which 2 years ago seemed like unimaginable targets.</p>\n\n<p>Curious to hear if others have thought about their exit strategies.</p>\n</div><!-- SC_ON -->",
  "score": 198,
  "permalink": "/r/CryptoCurrency/comments/ldfatd/plan_your_exit_strategy_be_smart_before_fomo_hits/",
  "subreddit": "CryptoCurrency",
  "id": "ldfatd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123194324
}