{
  "author": "RonianoCristaldo",
  "original_created_utc": 1651582549,
  "title": "Why is all porn with people of colour relegated to their own categories?",
  "created_utc": 1651594588,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Any time you&amp;#39;re on a porn site different ethnicities have their own category, like &amp;#39;Asian&amp;#39;, &amp;#39;ebony&amp;#39;, &amp;#39;Indian&amp;#39; etc., but porn with white performers doesn&amp;#39;t have to be searched for under &amp;#39;white&amp;#39; even though the category does exist. But it&amp;#39;s almost like they push the other races to their own categories. I&amp;#39;m not trying to push something political or anything, this is just something I&amp;#39;ve noticed and had me curious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 164,
  "permalink": "/r/TooAfraidToAsk/comments/uhfhhf/why_is_all_porn_with_people_of_colour_relegated/",
  "subreddit": "TooAfraidToAsk",
  "id": "uhfhhf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": true,
  "the_new_excerpt": "Any time you're on a porn site different ethnicities have their own category,\nlike 'Asian', 'ebony', 'Indian' etc., but porn with white performers doesn't\nhave to be searched for under 'white' even though the category does exist. But\nit's almost like they push the other races to their own…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ポルノサイトではいつでも、さまざまな民族がそれぞれのカテゴリーを持っています。\nアジア系」「黒髪」「インド系」などなど。\n白人の出演するポルノは、そのカテゴリーがあっても「白人」で検索する必要はない。でも\n他の人種を自分たちの人種に押し付けているような気がしてならない...。",
      "title": "なぜ有色人種が登場するポルノはすべて独自のカテゴリーに追いやられているのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "任何时候你在色情网站上，不同的民族都有自己的分类。\n比如 \"亚洲人\"、\"黑种人\"、\"印度人 \"等，但有白人表演者的色情片并不\n但有白人表演者的色情片却不需要在 \"白人 \"类别下搜索，尽管这个类别确实存在。但是\n这几乎就像他们把其他种族推到自己的类别中一样......",
      "title": "为什么所有与有色人种有关的色情片都被归入他们自己的类别？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "任何時候你在色情網站上，不同的民族都有自己的分類。\n比如 \"亞洲人\"、\"黑種人\"、\"印度人 \"等，但有白人表演者的色情片並不\n但有白人表演者的色情片卻不需要在 \"白人 \"類別下搜索，儘管這個類別確實存在。但是\n這幾乎就像他們把其他種族推到自己的類別中一樣......",
      "title": "爲什麼所有與有色人種有關的色情片都被歸入他們自己的類別？"
    }
  ]
}