{
  "author": "calvintheidiot",
  "the_new_excerpt": "Now, believe me when I say - I know what it's like to get caught up in the hype.\nI'm bullish on the future of crypto, and think huge gains are likely in the\ncoming years.\n\nWith that said, seeing the things that have been posted lately is frankly quite\nalarming. It seems like the bull run has warped…",
  "original_created_utc": 1614587832,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "现在，当我说--我知道被炒作所迷惑的滋味，请相信我。\n我看好加密技术的未来，认为巨大的收益很可能会在\n未来几年。\n\n说到这里，看到最近发的东西，坦率地说是相当的。\n惊人的。看来牛市运行已经扭曲了...",
      "title": "加密技术正在制造不健康的投资预期"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，當我說--我知道被炒作所迷惑的滋味，請相信我。\n我看好加密技術的未來，認爲巨大的收益很可能會在\n未來幾年。\n\n說到這裏，看到最近發的東西，坦率地說是相當的。\n驚人的。看來牛市運行已經扭曲了...",
      "title": "加密技術正在製造不健康的投資預期"
    }
  ],
  "title": "Crypto Is Creating Unhealthy Investing Expectations",
  "created_utc": 1614623495,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Now, believe me when I say - I know what it&#39;s like to get caught up in the hype. I&#39;m bullish on the future of crypto, and think huge gains are likely in the coming years. </p>\n\n<p>With that said, seeing the things that have been posted lately is frankly quite alarming. It seems like the bull run has warped people&#39;s expectations of what investing is, and what normal returns should be. </p>\n\n<p>I&#39;ve seen posts that start with: &quot;Ok, here&#39;s how you take profits. Let&#39;s say you invest in a coin, and assume it then goes up 300% ...&quot;</p>\n\n<p>Assume it goes up 300%?? Yeah I get it ... it&#39;s a bull run, and things have been mooning. But people are talking like this is normal, and you can just assume 300% gains? </p>\n\n<p>Or another recent post ... &quot;Nano is growing so slowly, it was $1 earlier this year, and it&#39;s only $5 now ... what&#39;s stopping its growth?&quot; </p>\n\n<p>People are going to be in for a rude awakening if they ever invest in anything else. </p>\n\n<p>&quot;I just bought this house last year, why has the price not doubled?&quot; </p>\n\n<p>&quot;I invested in Amazon, why is the price only 20% higher this year?&quot; </p>\n\n<p>Reality check guys ... if you can invest in the market and get 10-15% returns year after year, that&#39;s AMAZING. </p>\n\n<p>Crypto may very well continue to moon, but it won&#39;t be like this forever. And I hope you don&#39;t venture elsewhere with a distorted view of expected returns in investments. Just my two cents.</p>\n</div><!-- SC_ON -->",
  "score": 233,
  "permalink": "/r/CryptoCurrency/comments/lv42nt/crypto_is_creating_unhealthy_investing/",
  "subreddit": "CryptoCurrency",
  "id": "lv42nt",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937738000
}