{
  "author": "ini0n",
  "the_new_excerpt": "There's been a lot of chatter here about PE ratios and Great Depression levels\nof overvalue. If we map PE10 below on a graph you can see the historic trend.\n\nhttps://imgur.com/a/kgaQCY3\n\nAre we about to have another Great Depression?\n\nProbably not.\n\nWe can see strong multiple growth since the 80s,…",
  "original_created_utc": 1614659941,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这里有很多关于PE比率和大萧条水平的讨论。\n的高估。如果我们把下面的PE10绘制成图，就可以看到历史趋势。\n\nhttps://imgur.com/a/kgaQCY3\n\n我们是不是要再来一次大萧条？\n\n也许不会。\n\n我们可以看到80年代以来强劲的倍数增长，...",
      "title": "市场被高估了，但并不像有些人说的那么糟糕。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這裏有很多關於PE比率和大蕭條水平的討論。\n的高估。如果我們把下面的PE10繪製成圖，就可以看到歷史趨勢。\n\nhttps://imgur.com/a/kgaQCY3\n\n我們是不是要再來一次大蕭條？\n\n也許不會。\n\n我們可以看到80年代以來強勁的倍數增長，...",
      "title": "市場被高估了，但並不像有些人說的那麼糟糕。"
    }
  ],
  "title": "The market is overvalued but not as bad as some say",
  "created_utc": 1614728936,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There&#39;s been a lot of chatter here about PE ratios and Great Depression levels of overvalue. If we map PE10 below on a graph you can see the historic trend.</p>\n\n<p><a href=\"https://imgur.com/a/kgaQCY3\">https://imgur.com/a/kgaQCY3</a></p>\n\n<p><strong>Are we about to have another Great Depression?</strong></p>\n\n<p>Probably not.</p>\n\n<p>We can see strong multiple growth since the 80s, which if we believe is representative of the new norm and will continue, suggests that we&#39;re actually not drastically far off the trend. Mapping trends during a peak is risky, this graph would look a lot different after a major correction.</p>\n\n<p>In general we&#39;re still a ways off the insanity of the dotcom boom. With only good news coming out short term with stimulus and countries opening back up post covid I don&#39;t see a crash soon.</p>\n\n<p><strong>Can you time the market to buy low sell high?</strong></p>\n\n<p><a href=\"https://imgur.com/a/DksC60V\">https://imgur.com/a/DksC60V</a></p>\n\n<p>Not easily.</p>\n\n<p>The above graph (orange line) represents selling stocks when PE multiples are 3 above the trend and buying back in when PE multiples are below 3. You can see you massively underperform, that&#39;s before we even count missed dividends. You can find very specific numbers that give you a greater return, but they only work on one specific crash and ofter have you sitting out huge periods that&#39;d cost too much in lost dividends.</p>\n\n<p>I think it&#39;s possible to reduce losses during downturns through adjustments, but it&#39;s not as easy as looking at one number.</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/investing/comments/lvtzj4/the_market_is_overvalued_but_not_as_bad_as_some/",
  "subreddit": "investing",
  "id": "lvtzj4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937740759
}