{
  "author": "ShawnOttery",
  "the_new_excerpt": "So first off I want to preface this with I'm new to investing, so if I'm just\nhorribly wrong in what I've thought through, please tell me and I'll be on my\nmerry way, but to me Netflix feels like like a ticking time bomb.\n\nIt feels like a lot of articles about Netflix being either a steady stock or…",
  "original_created_utc": 1623715277,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最初にお断りしておきますが、私は投資の初心者なので、もし私が考えたことがひどく間違っていたら\n私が考えたことがひどく間違っていたら、教えてください。\nしかし、私にとってNetflixは時限爆弾のようなものです。\n\n多くの記事では、Netflixは安定した株であるか、あるいは...と書かれているように感じます。",
      "title": "Netflixが時限爆弾のように感じている人はいませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "所以首先我想先说一下，我是投资新手，所以如果我的想法错得很离谱，请告诉我，我会继续努力。\n如果我的想法错得离谱，请告诉我，我就会走我的路。\n但对我来说，Netflix就像一个定时炸弹。\n\n感觉很多关于Netflix的文章要么是稳定的股票，要么是...",
      "title": "还有人觉得Netflix像一颗定时炸弹吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "所以首先我想先說一下，我是投資新手，所以如果我的想法錯得很離譜，請告訴我，我會繼續努力。\n如果我的想法錯得離譜，請告訴我，我就會走我的路。\n但對我來說，Netflix就像一個定時炸彈。\n\n感覺很多關於Netflix的文章要麼是穩定的股票，要麼是...",
      "title": "還有人覺得Netflix像一顆定時炸彈嗎？"
    }
  ],
  "title": "Does Netflix feel like a ticking time bomb to anyone else?",
  "created_utc": 1623726021,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So first off I want to preface this with I&#39;m new to investing, so if I&#39;m just horribly wrong in what I&#39;ve thought through, please tell me and I&#39;ll be on my merry way, but to me Netflix feels like like a ticking time bomb.</p>\n\n<p>It feels like a lot of articles about Netflix being either a steady stock or a stock that will increase pretty well in the next few years, practically taking it from other companies, mostly cable as people are &quot;cutting the cord&quot;. I feel like that was the right way to think about it a few years ago, but not now.</p>\n\n<p>Practically any company that has things to watch is making a streaming service, and thats where netflix fails. They don&#39;t own any of FOX, Disney, and streaming services like Amazon Prime has practically an infinite windfall behind them to keep them ahead, as we saw with their recent MGM purchase.</p>\n\n<p>And now that everyone has a streaming service, Netflix is losing a lot of their shows it feels. They&#39;ve lost their most popular one to Peacock, and their own originals don&#39;t seem to be blowing up consistently like they did in the Stranger Things era when they had The Office along with many other shows.</p>\n\n<p>So with all this, is it a time bomb? Would it be good to short it in the near or somewhat near future? Or even would it be good to buy now and then sell before the it crashes if it will?</p>\n</div><!-- SC_ON -->",
  "score": 375,
  "permalink": "/r/stocks/comments/o00pa3/does_netflix_feel_like_a_ticking_time_bomb_to/",
  "subreddit": "stocks",
  "id": "o00pa3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009743480
}