{
  "author": "SadandConfused_idiot",
  "original_created_utc": 1637958005,
  "title": "Is it normal to ask your teenage employee to dinner?",
  "created_utc": 1637966264,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Well this is a throwaway account! </p>\n\n<p>So I(F17) recently got a new job at a large chain store and my Boss(M38) is great. He’s pretty extroverted and when we talk it’s never awkward or boring. He’s always been especially friendly with me,  we have breaks together, he’s walked me home and Although I work at the back of the store and it’s not my job to work floor he likes to come and get me and we work together chatting along the whole time. I didn’t think this was anything more than us being friends but now I have a little voice in the back of my head telling me something is up. </p>\n\n<p>When we talk a common theme that comes up is dating which I have little experience in when I told him this he looked very surprised as to why no boys are into me (to be honest I’m confused too lol) he likes telling me his stories though and humble brags about how girls were really into him when he was around my age. A few days later he asks me if I like Greek and if I wanna grab dinner with him sometime. Since then he’s asked me the same thing about 4 other times I answer him with an ambiguous yes every time but we’ve never set a date. I once mentioned how I want to go to a certain coffee place (a popular date place) and he said “we should go!... when’s your birthday?” And I’m born later in the year and  he gave a disappointed “oh” and that was that. But even despite him knowing my age and birthday he keeps asking me to hang out with him. </p>\n\n<p>I asked my coworker what she thinks and she says she thinks he might have a crush on me but she’s younger than me and I doubt she knows any better than me but what do you think, Reddit? Is my manager just unaware of our age difference or is this something different?</p>\n\n<p>EDIT: getting a lot of responses saying he’s a predator but I’d like to make it clear he’s also asked to hang out with me and his OTHER work friend before, so maybe this really could just be a friendship. He also encourages me to talk to the other employees; would a predator also do this?</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/NoStupidQuestions/comments/r2vw0b/is_it_normal_to_ask_your_teenage_employee_to/",
  "subreddit": "NoStupidQuestions",
  "id": "r2vw0b",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Well this is a throwaway account!\n\nSo I(F17) recently got a new job at a large chain store and my Boss(M38) is\ngreat. He’s pretty extroverted and when we talk it’s never awkward or boring.\nHe’s always been especially friendly with me, we have breaks together, he’s\nwalked me home and Although I work…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "捨てアカウントです。\n\n私(F17)は最近、大手チェーン店に転職したのですが、上司(M38)が素晴らしい人で\nとても良い人です。彼はとても外向的で、話していても気まずくなったり退屈したりすることはありません。\n彼はいつも私と仲良くしてくれて、一緒に休憩したり、家まで送ってくれたりします。\n家まで送ってくれたり、仕事をしているのに...。",
      "title": "10代の社員を食事に誘うのは普通のことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，这是个抛砖引玉的账户!\n\n我（F17）最近在一家大型连锁店找到一份新工作，我的老板（M38）是\n很好。他很外向，当我们交谈时，从不感到尴尬或无聊。\n他总是对我特别友好，我们一起休息，他曾\n他送我回家，虽然我在工作...",
      "title": "请你的青少年员工吃饭是正常的吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，這是個拋磚引玉的賬戶!\n\n我（F17）最近在一家大型連鎖店找到一份新工作，我的老闆（M38）是\n很好。他很外向，當我們交談時，從不感到尷尬或無聊。\n他總是對我特別友好，我們一起休息，他曾\n他送我回家，雖然我在工作...",
      "title": "請你的青少年員工喫飯是正常的嗎？"
    }
  ]
}