{
  "author": "Go48memes",
  "the_new_excerpt": "The only reason this even gets so much attention is because there was a large\ngroup of retail traders gaining from the momentum. It wasn't 'us' who made the\nstock go from 18$ to 38$ in a day, it wasn't us who made it go from 40$ to 70$\nin 1 day, we were just along for the ride.\n\nDon't let them put…",
  "original_created_utc": 1613683695,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这事之所以能引起这么多关注，是因为有一个大的\n一群散户乘势而上。这不是 \"我们 \"做的。\n股票从18美元到38美元的一天，它不是我们谁使它从40美元到70元\n在1天内，我们只是随行就市。\n\n不要让他们把...",
      "title": "提醒一下，这些政客不是我们的朋友，无论制定什么法规，都不会让我们受益。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這事之所以能引起這麼多關注，是因爲有一個大的\n一羣散戶乘勢而上。這不是 \"我們 \"做的。\n股票從18美元到38美元的一天，它不是我們誰使它從40美元到70元\n在1天內，我們只是隨行就市。\n\n不要讓他們把...",
      "title": "提醒一下，這些政客不是我們的朋友，無論制定什麼法規，都不會讓我們受益。"
    }
  ],
  "title": "Just a reminder, these politicians are NOT our friends and whatever regulations that get made will NOT benefit us",
  "created_utc": 1613770371,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The only reason this even gets so much attention is because there was a large group of retail traders gaining from the momentum. It wasn&#39;t &#39;us&#39; who made the stock go from 18$ to 38$ in a day, it wasn&#39;t us who made it go from 40$ to 70$ in 1 day, we were just along for the ride.</p>\n\n<p>Don&#39;t let them put the blame on us, fight against any regulation! Why ban stocks from being shorted &gt;100%? Maybe Gamestop can happen again then?</p>\n\n<p>&#x200B;</p>\n\n<p>Yes, maybe good regulations could be made (like banning the sale of order flow like robinhood does) but in the small text they will always put a clause that lets your wife&#39;s boyfriend fuck you in the ass.Just leave robinhood and join a real broker.</p>\n\n<p>&#x200B;</p>\n\n<p>Elizabeth Warren doesn&#39;t want the stock market to behave like a casino, which means she doesn&#39;t like the entire point of WSB.</p>\n\n<p>&quot;These wild fluctuations are just the latest indication that many private equity firms, hedge funds, and other investors, big and small, are treating the stock market like a casino, giving little consideration to the companies, communities, workers, and consumers that may be affected by these risky bets,&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>anyway just venting, peace</p>\n</div><!-- SC_ON -->",
  "score": 3261,
  "permalink": "/r/wallstreetbets/comments/lmxrxx/just_a_reminder_these_politicians_are_not_our/",
  "subreddit": "wallstreetbets",
  "id": "lmxrxx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332889974
}