{
  "author": "BushyOreo",
  "original_created_utc": 1635058252,
  "title": "Shib hit a new ATH 99.9% of holders are in profit",
  "created_utc": 1635071618,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So with the latest pump in shib it hit a new ath just now. How far is this meme coin going to go? Do you think it has the potential to surpass dogecoin? </p>\n\n<p>It is currently up roughly 40% today as dogecoin still has not moved at all in months as most coins have recovered and reached new ath. </p>\n\n<p>I don&#39;t hold any shib but I can&#39;t say I&#39;m not interested to see where this goes and I&#39;m interested to see if a crazy pump like dogecoin did earlier this year will happen again which would make it take the #1 memecoin spot</p>\n\n<p>Congrats to anyone who took a gamble with shib</p>\n\n<p>EDIT: As expected the downvotes come in when you mention shib and don&#39;t say something negative about it</p>\n</div><!-- SC_ON -->",
  "score": 267,
  "permalink": "/r/CryptoCurrency/comments/qemtla/shib_hit_a_new_ath_999_of_holders_are_in_profit/",
  "subreddit": "CryptoCurrency",
  "id": "qemtla",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So with the latest pump in shib it hit a new ath just now. How far is this meme\ncoin going to go? Do you think it has the potential to surpass dogecoin?\n\nIt is currently up roughly 40% today as dogecoin still has not moved at all in\nmonths as most coins have recovered and reached new ath.\n\nI don't…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そのため、最新のポンプインシブでは、先ほどまで新たなアスリートが登場しました。このミームコインはどこまで行くのか？\nコインはどこまで行くのでしょうか？dogecoinを超える可能性はあると思いますか？\n\n今日は約40％上昇していますが、dogecoinはまだ数ヶ月間全く動いていません。\nほとんどのコインが回復して新記録を達成する中、dogecoinはここ数ヶ月全く動いていません。\n\n私は...",
      "title": "Shibは新しいATHをヒットさせた 99.9%のホルダーは利益を得ている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，随着shib的最新泵的出现，它在刚才创下了一个新高度。这枚纪念币会走多远呢？\n币要走多远？你认为它有可能超过dogecoin吗？\n\n目前，它今天大约上涨了40%，因为dogecoin在几个月内仍然没有任何变化。\n几个月来，大多数币都在恢复并达到新的高度。\n\n我不...",
      "title": "Shib创下新的ATH，99.9%的持有人处于盈利状态"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，隨着shib的最新泵的出現，它在剛纔創下了一個新高度。這枚紀念幣會走多遠呢？\n幣要走多遠？你認爲它有可能超過dogecoin嗎？\n\n目前，它今天大約上漲了40%，因爲dogecoin在幾個月內仍然沒有任何變化。\n幾個月來，大多數幣都在恢復並達到新的高度。\n\n我不...",
      "title": "Shib創下新的ATH，99.9%的持有人處於盈利狀態"
    }
  ]
}