{
  "author": "HarambeTownley",
  "the_new_excerpt": "Lightning Network has improved SO much. My experience with LN has been so good\nand easy.\n\nWallets like Phoenix are so simple, users doesn't have to care about any\ntechnical details.\n\nThere was barely any LN back in 2017. If there's a surge in bitcoin price, LN\nand community around it is the only…",
  "original_created_utc": 1612381023,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "闪电网络的进步太大。我对LN的体验非常好\n和简单。\n\n像Phoenix这样的钱包是如此的简单，用户不必在意任何的\n技术细节。\n\n2017年的时候，几乎没有LN。如果比特币价格暴涨，LN\n和周围的社区是唯一...",
      "title": "闪电网络怎么不是比特币的中心焦点？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "閃電網絡的進步太大。我對LN的體驗非常好\n和簡單。\n\n像Phoenix這樣的錢包是如此的簡單，用戶不必在意任何的\n技術細節。\n\n2017年的時候，幾乎沒有LN。如果比特幣價格暴漲，LN\n和周圍的社區是唯一...",
      "title": "閃電網絡怎麼不是比特幣的中心焦點？"
    }
  ],
  "title": "How isn't Lightning Network not the center focus of bitcoin?",
  "created_utc": 1612442530,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Lightning Network has improved SO much. My experience with LN has been so good and easy.</p>\n\n<p>Wallets like Phoenix are so simple, users doesn&#39;t have to care about any technical details.</p>\n\n<p>There was barely any LN back in 2017. If there&#39;s a surge in bitcoin price, LN and community around it is the only thing I can assign this value to.</p>\n\n<p>How are we not talking about it?</p>\n\n<p>EDIT: I&#39;ll add some advantages that makes LN special</p>\n\n<ul>\n<li><p>Improved privacy. Onchain level suffers a lot from privacy leakage.</p></li>\n<li><p>Scalability</p></li>\n<li><p>Low fees</p></li>\n<li><p>Great community: Many merchants and businesses involved with an excellent bunch of open source builders.</p></li>\n<li><p>Staggering amount of innovation and ideas in mailing lists and forums.</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/Bitcoin/comments/lbw3b6/how_isnt_lightning_network_not_the_center_focus/",
  "subreddit": "Bitcoin",
  "id": "lbw3b6",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123189679
}