{
  "author": "RCnoob69",
  "the_new_excerpt": "Just at a glance several airline and cruise stocks are still basically half of\nwhat they were pre covid crash. Few random examples CCL/CUK (Both Carnival), AAL\n(american airlines), NCL (norway cruise line), UAL (United).\n\nNow I know when the pandemic hit sure investing in these companies was a…",
  "original_created_utc": 1611168676,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "只是一眼看去，几家航空公司和邮轮股票基本还是半壁江山\n他们是什么前covid崩溃。一些随机的例子CCL/CUK（都是嘉年华），AAL。\n(美国航空公司)、NCL(挪威邮轮公司)、UAL(美国联合航空)。\n\n现在我知道，当流行病袭击肯定投资这些公司是一个......",
      "title": "航空公司和邮轮股票，仍然是流行前价格的50％，不是没有大脑的权利吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是一眼看去，幾家航空公司和郵輪股票基本還是半壁江山\n他們是什麼前covid崩潰。一些隨機的例子CCL/CUK（都是嘉年華），AAL。\n(美國航空公司)、NCL(挪威郵輪公司)、UAL(美國聯合航空)。\n\n現在我知道，當流行病襲擊肯定投資這些公司是一個......",
      "title": "航空公司和郵輪股票，仍然是流行前價格的50％，不是沒有大腦的權利嗎？"
    }
  ],
  "title": "Are airline and cruise stocks that are still 50% of pre pandemic prices not no brainers right now?",
  "created_utc": 1611241177,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just at a glance several airline and cruise stocks are still basically half of what they were pre covid crash. Few random examples CCL/CUK (Both Carnival), AAL (american airlines), NCL (norway cruise line),  UAL (United). </p>\n\n<p>Now I know when the pandemic hit sure investing in these companies was a risky proposition. Who knew how long it would be before these industries would be viable again? These stocks dropped like 80%, reasonably so. At the time vaccines seemed potentially 5 years away. How would these companies all survive?</p>\n\n<p>However that is a far cry from the situation we are in today. We have the vaccine. Production is going strong and the rollout is happening. A year (or hopefully less) from now everyone will be vaccinated.</p>\n\n<p>Why would people not go back to using airlines at the same levels they were using them prior to the pandemic again? There is really no more unknown factors here. Things will return to normal for these industry in the somewhat near future. Is there some new alternative form of long range travel then no one told me about? These still being half off pre pandemic prices just makes no sense to me.</p>\n\n<p>These seem like no brainer winners to me. Hit me with your bear takes.</p>\n</div><!-- SC_ON -->",
  "score": 48,
  "permalink": "/r/investing/comments/l1fn7v/are_airline_and_cruise_stocks_that_are_still_50/",
  "subreddit": "investing",
  "id": "l1fn7v",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311217234
}