{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "WarnerMedia was recently spun into Discovery Inc, creating the world's second largest media company and possibly the most profitable. Instead of generating enthusiasm, it entered into a declining market that is particularly skeptical of media stocks, and the combined companies are now trading at one of their lowest valuations in decades.\n\n&amp;#x200B;\n\n**Media stock slump**\n\nDisney, Netflix, Paramount, Lionsgate, WBD, and AMC have all slumped recently, with some of them (including WBD) trading for P/E's below ten and P/S's below one.\n\nIt seems to be largely due to speculation that consumers will cut down on their steaming services and/or cable due to inflation. A possible recession (with -1.4% GDP growth in Q1) may also harm ad sales. Personally, I don't think the change will be too drastic, since cable TV and box office sales have historically been inflation resistant. Both HBO Max and Discovery+ had subscriber growth in Q1, and in their recent earnings call Discovery increased ad revenues in Q1 and say they have continued to grow into Q2.\n\nThe Netflix situation has also created pessimism around the streaming business model. They have forecasted a 1.3% decline in subscribers over the first half of the year. 700k of the 2.7m loss were subscribers from Russia. They also had a significant price increase and did terribly on content, increasing spending on Netflix originals by billions but failing to produce breakout hits besides Squid Game. I don't see how this particular situation should affect views on streaming overall.\n\n&amp;#x200B;\n\n**WBD Highlights**\n\n\\-WarnerMedia had $35.6b revenue in 2021, and Discovery had $12.2b, for a total of $47.8b. This could go up this year due to rebounding box office revenues.\n\n\\-Current market cap is $43.9b. $55b debt means they have an enterprise value in the $90b range. Fortunately Discovery issued $30b in bonds earlier in the year when interest rates were lower.\n\n\\-WarnerMedia had about $8b operating income each year over the past 2 years. In the 2 years before the AT&amp;T merger, they had $3.9b and $5.2b net income.  Discovery had $1.1b net income last year.\n\n\\-They have estimated $3b+ in cost savings, which a BOA analyst called \"conservative\". This produces a bull case of over $10b in annual profits (which should be the case if media spending doesn't fall dramatically and if they have more hits than misses with their content).\n\n\\-Own multiple large studios\n\n\\-Produce over 100 shows, more than half for third parties\n\n\\-Top 2 at the box office 11 of the past 12 years\n\n\\-Number one media company in the US in terms of hours viewed. Having such a large reach across a variety of niches should give them an advantage in ad sales.\n\n&amp;#x200B;\n\n**Management**\n\nAT&amp;T management is not well regarded. They are seen as having completed multiple ill-conceived acquisitions.  CNN+ and the decision to release movies simultaneously on HBO Max in 2020/21 and a 45-day window in 2022 have generally been seen as failures. However, they did invest heavily in assembling a strong content lineup.\n\nDavid Zaslav and the Discovery management team have completed numerous successful acquisitions, maintaining consistent profitability while quadrupling revenue.\n\n&amp;#x200B;\n\n**Content**\n\nWith over 100 shows in production and over 1000 other movies/shows in their library, there's way to much to list but here are some of the highlights.\n\nDiscovery: TLC, HGTV, Food Network, etc. While not really producing \"prestige content\", they have a lot of stuff that is highly bingeable. This is is why Discovery+ generates more revenue on it's $4.99 ad-supported tier than it's $6.99 premium tier, and also has one of the lowest churns in streaming.\n\nCombining Discovery+, HBO Max, Cartoon Network, Turner Sports, and CNN (which will be focused on solidifying its reputation as the world's leading fact-based journalism organization) can create the most varied streaming platform on the market.\n\nDC: They have an upcoming lineup of films that they have put more time and money into than most of their previous releases: League of Super Pets, Black Adam, Shazam 2, Aquaman 2, and the Flash are all coming in the next 13 months. They also have upcoming series such as Peacemaker Season 2, Justice League Dark (directed by JJ Abrams), Green Lantern Corps, Penguin &amp; Arkham series, and Michael B. Jordan's Superman series.\n\nHarry Potter: More films planned\n\nLord of the Rings: They say they still have exclusive film rights and have an upcoming animated movie (War of the Rohirrim) in pre-production. I'm guessing they'll start making live action films after that, although they're still in mediation with the Saul Zaentz company.\n\nGame of Thrones: House of the Dragon prequel series coming in August. They also have a big-budget The Last of Us series coming.\n\n&amp;#x200B;\n\nOne of the world's leading TV show studios, including being the kings of the sitcom genre. Even for shows that air on different networks, they usually retain significant rights. Shows include: Friends, Sienfeld, Full House, Fresh Prince, Family Mattes, Murphy Brown, Ted Lasso, Two and a Half Men, Big Bang Theory, Young Sheldon, The Batchelor, Fringe, ER, Person of Interest, etc.\n\nOwn the classic MGM &amp; RKO pictures libraries: The Wizard of Oz (remake planned), Casablanca, Gone With The Wind, Citizen Kane, etc.\n\nLooney Tunes &amp; Hanna Barbara (Scooby Doo, The Flinstones, The Jetsons, etc.)\n\n&amp;#x200B;\n\nFilm series in their library include: Dune (part 2 coming), Rush Hour, Lethal Weapon, Austin Powers, Friday the 13th, Mortal Kombat (sequel planned), Gremlins, Nightmare on Elm Street, Bullit (sequel coming, directed by Steven Spielberg), Mad Max (Furiosa prequel coming), The Conjuring, Godzilla/King Kong, Lego movies, Ocean's, and The Matrix.  They plan to have multiple mid-budget remakes/reboots each year on HBO Max.\n\n&amp;#x200B;\n\nUpcoming Games: Hogwarts Legacy, Gotham Knights, Justice League: Kill the Suicide Squad, and Harry Potter: Magic Awakened (mobile game in partnership with NetEase, has already grossed over $200m in Asia and awaiting global release)\n\n&amp;#x200B;\n\n**Big Tech, Antitrust, and the Steaming Wars**\n\nRight now it seems like there are too many competitors in streaming, with Apple and Amazon increasing their spending in addition to Netflix and the legacy media companies. When asked, the leaders at NBC Universal, Paramount, WBD, and Lionsgate have left the door open to merging or at least partnering.\n\nThere's also talk of increasing antitrust. If this materializes they may be prevented from merging, but big tech will also probably be prevented from increasing their presence in streaming (FTC head Lina Khan is a big critic of Amazon Prime and big tech in general).\n\nIn the most recent earnings call, Zaslav repeatedly emphasized that WBD was the world's greatest \"content production factory\" and the world's \"leader in IP\". He even referred to WBD as \"arms dealers\". He talked about diversified revenue streams but never gave a long-term forecast for HBO max subscribers or boasted about them becoming a leader in streaming. It seemed like he was implying that if the spending wars intensified (presumably if Apple and Amazon continue to increase spending), WBD will focus more on licensing rather than growing their subscriber numbers (in this scenario HBO and Discovery+ will go back to being niche services).",
  "author_fullname": "t2_11gna6",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Warner Bros. Discovery: A bargain?",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "tickerdiscussion",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_uoz8os",
  "quarantine": false,
  "link_flair_text_color": "dark",
  "upvote_ratio": 0.9,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 41,
  "total_awards_received": 0,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Company Discussion",
  "can_mod_post": false,
  "score": 41,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1652469765,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;WarnerMedia was recently spun into Discovery Inc, creating the world&amp;#39;s second largest media company and possibly the most profitable. Instead of generating enthusiasm, it entered into a declining market that is particularly skeptical of media stocks, and the combined companies are now trading at one of their lowest valuations in decades.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Media stock slump&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Disney, Netflix, Paramount, Lionsgate, WBD, and AMC have all slumped recently, with some of them (including WBD) trading for P/E&amp;#39;s below ten and P/S&amp;#39;s below one.&lt;/p&gt;\n\n&lt;p&gt;It seems to be largely due to speculation that consumers will cut down on their steaming services and/or cable due to inflation. A possible recession (with -1.4% GDP growth in Q1) may also harm ad sales. Personally, I don&amp;#39;t think the change will be too drastic, since cable TV and box office sales have historically been inflation resistant. Both HBO Max and Discovery+ had subscriber growth in Q1, and in their recent earnings call Discovery increased ad revenues in Q1 and say they have continued to grow into Q2.&lt;/p&gt;\n\n&lt;p&gt;The Netflix situation has also created pessimism around the streaming business model. They have forecasted a 1.3% decline in subscribers over the first half of the year. 700k of the 2.7m loss were subscribers from Russia. They also had a significant price increase and did terribly on content, increasing spending on Netflix originals by billions but failing to produce breakout hits besides Squid Game. I don&amp;#39;t see how this particular situation should affect views on streaming overall.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;WBD Highlights&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;-WarnerMedia had $35.6b revenue in 2021, and Discovery had $12.2b, for a total of $47.8b. This could go up this year due to rebounding box office revenues.&lt;/p&gt;\n\n&lt;p&gt;-Current market cap is $43.9b. $55b debt means they have an enterprise value in the $90b range. Fortunately Discovery issued $30b in bonds earlier in the year when interest rates were lower.&lt;/p&gt;\n\n&lt;p&gt;-WarnerMedia had about $8b operating income each year over the past 2 years. In the 2 years before the AT&amp;amp;T merger, they had $3.9b and $5.2b net income.  Discovery had $1.1b net income last year.&lt;/p&gt;\n\n&lt;p&gt;-They have estimated $3b+ in cost savings, which a BOA analyst called &amp;quot;conservative&amp;quot;. This produces a bull case of over $10b in annual profits (which should be the case if media spending doesn&amp;#39;t fall dramatically and if they have more hits than misses with their content).&lt;/p&gt;\n\n&lt;p&gt;-Own multiple large studios&lt;/p&gt;\n\n&lt;p&gt;-Produce over 100 shows, more than half for third parties&lt;/p&gt;\n\n&lt;p&gt;-Top 2 at the box office 11 of the past 12 years&lt;/p&gt;\n\n&lt;p&gt;-Number one media company in the US in terms of hours viewed. Having such a large reach across a variety of niches should give them an advantage in ad sales.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Management&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;AT&amp;amp;T management is not well regarded. They are seen as having completed multiple ill-conceived acquisitions.  CNN+ and the decision to release movies simultaneously on HBO Max in 2020/21 and a 45-day window in 2022 have generally been seen as failures. However, they did invest heavily in assembling a strong content lineup.&lt;/p&gt;\n\n&lt;p&gt;David Zaslav and the Discovery management team have completed numerous successful acquisitions, maintaining consistent profitability while quadrupling revenue.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Content&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;With over 100 shows in production and over 1000 other movies/shows in their library, there&amp;#39;s way to much to list but here are some of the highlights.&lt;/p&gt;\n\n&lt;p&gt;Discovery: TLC, HGTV, Food Network, etc. While not really producing &amp;quot;prestige content&amp;quot;, they have a lot of stuff that is highly bingeable. This is is why Discovery+ generates more revenue on it&amp;#39;s $4.99 ad-supported tier than it&amp;#39;s $6.99 premium tier, and also has one of the lowest churns in streaming.&lt;/p&gt;\n\n&lt;p&gt;Combining Discovery+, HBO Max, Cartoon Network, Turner Sports, and CNN (which will be focused on solidifying its reputation as the world&amp;#39;s leading fact-based journalism organization) can create the most varied streaming platform on the market.&lt;/p&gt;\n\n&lt;p&gt;DC: They have an upcoming lineup of films that they have put more time and money into than most of their previous releases: League of Super Pets, Black Adam, Shazam 2, Aquaman 2, and the Flash are all coming in the next 13 months. They also have upcoming series such as Peacemaker Season 2, Justice League Dark (directed by JJ Abrams), Green Lantern Corps, Penguin &amp;amp; Arkham series, and Michael B. Jordan&amp;#39;s Superman series.&lt;/p&gt;\n\n&lt;p&gt;Harry Potter: More films planned&lt;/p&gt;\n\n&lt;p&gt;Lord of the Rings: They say they still have exclusive film rights and have an upcoming animated movie (War of the Rohirrim) in pre-production. I&amp;#39;m guessing they&amp;#39;ll start making live action films after that, although they&amp;#39;re still in mediation with the Saul Zaentz company.&lt;/p&gt;\n\n&lt;p&gt;Game of Thrones: House of the Dragon prequel series coming in August. They also have a big-budget The Last of Us series coming.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;One of the world&amp;#39;s leading TV show studios, including being the kings of the sitcom genre. Even for shows that air on different networks, they usually retain significant rights. Shows include: Friends, Sienfeld, Full House, Fresh Prince, Family Mattes, Murphy Brown, Ted Lasso, Two and a Half Men, Big Bang Theory, Young Sheldon, The Batchelor, Fringe, ER, Person of Interest, etc.&lt;/p&gt;\n\n&lt;p&gt;Own the classic MGM &amp;amp; RKO pictures libraries: The Wizard of Oz (remake planned), Casablanca, Gone With The Wind, Citizen Kane, etc.&lt;/p&gt;\n\n&lt;p&gt;Looney Tunes &amp;amp; Hanna Barbara (Scooby Doo, The Flinstones, The Jetsons, etc.)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Film series in their library include: Dune (part 2 coming), Rush Hour, Lethal Weapon, Austin Powers, Friday the 13th, Mortal Kombat (sequel planned), Gremlins, Nightmare on Elm Street, Bullit (sequel coming, directed by Steven Spielberg), Mad Max (Furiosa prequel coming), The Conjuring, Godzilla/King Kong, Lego movies, Ocean&amp;#39;s, and The Matrix.  They plan to have multiple mid-budget remakes/reboots each year on HBO Max.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Upcoming Games: Hogwarts Legacy, Gotham Knights, Justice League: Kill the Suicide Squad, and Harry Potter: Magic Awakened (mobile game in partnership with NetEase, has already grossed over $200m in Asia and awaiting global release)&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Big Tech, Antitrust, and the Steaming Wars&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Right now it seems like there are too many competitors in streaming, with Apple and Amazon increasing their spending in addition to Netflix and the legacy media companies. When asked, the leaders at NBC Universal, Paramount, WBD, and Lionsgate have left the door open to merging or at least partnering.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s also talk of increasing antitrust. If this materializes they may be prevented from merging, but big tech will also probably be prevented from increasing their presence in streaming (FTC head Lina Khan is a big critic of Amazon Prime and big tech in general).&lt;/p&gt;\n\n&lt;p&gt;In the most recent earnings call, Zaslav repeatedly emphasized that WBD was the world&amp;#39;s greatest &amp;quot;content production factory&amp;quot; and the world&amp;#39;s &amp;quot;leader in IP&amp;quot;. He even referred to WBD as &amp;quot;arms dealers&amp;quot;. He talked about diversified revenue streams but never gave a long-term forecast for HBO max subscribers or boasted about them becoming a leader in streaming. It seemed like he was implying that if the spending wars intensified (presumably if Apple and Amazon continue to increase spending), WBD will focus more on licensing rather than growing their subscriber numbers (in this scenario HBO and Discovery+ will go back to being niche services).&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "612ee368-65e6-11e5-b53f-129e4297eb59",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#f7b84f",
  "id": "uoz8os",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "Destructo11",
  "discussion_type": null,
  "num_comments": 18,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/uoz8os/warner_bros_discovery_a_bargain/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/uoz8os/warner_bros_discovery_a_bargain/",
  "subreddit_subscribers": 4033808,
  "created_utc": 1652484095,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1652469765,
  "the_new_excerpt": "WarnerMedia was recently spun into Discovery Inc, creating the world's second\nlargest media company and possibly the most profitable. Instead of generating\nenthusiasm, it entered into a declining market that is particularly skeptical of\nmedia stocks, and the combined companies are now trading at…"
}