{
  "author": "NrdRage",
  "the_new_excerpt": "Hello, \"Apes\". it is I...also....ape. Yes, ape. Here to bless you with lots of\nrocket emojis and bananas as I am clearly one of you. Or something. We still say\non fleek, right? I mean, I totally know, but I'm not sure if you, too, are...you\nknow, fellow ape....\n\n\n\nHmm, it seems as though my emoji…",
  "original_created_utc": 1623715418,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Hello, \"Ape\". it is I...also....ape. そう、エイプです。たくさんのロケット絵文字とバナナで皆さんを祝福します。\nロケットの絵文字とバナナで皆さんを祝福します。それとも何か？私たちはまだ\non fleek、でしょ？つまり、私は完全に知っていますが、あなたも......あなたは\nほら、猿の仲間....\n\n\n\nうーん、まるで私の絵文字のようだ...。",
      "title": "ベゾス、牛の屁、そしてあなた。$AMZNの$CLNEとの取引は、少なくとも30秒で最も混乱するものです。それを解き明かすことで、人々はこの取引について無知であることをやめるでしょう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好，\"人猿\"。是我......也是....ape。是的，猿人。在这里，我将用大量的\n火箭表情符号和香蕉，因为我显然是你们中的一员。或者其他什么。我们仍然说\non fleek, right? 我的意思是，我完全知道，但我不确定你是否也是...你\n你知道的，猿人同伴....\n\n\n\n嗯，似乎我的表情符号...",
      "title": "贝索斯，牛屁，和你。至少在30秒内，AMZN与CLNE的交易是最令人困惑的；解开它，人们就不会对它如此无知了。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好，\"人猿\"。是我......也是....ape。是的，猿人。在這裏，我將用大量的\n火箭表情符號和香蕉，因爲我顯然是你們中的一員。或者其他什麼。我們仍然說\non fleek, right? 我的意思是，我完全知道，但我不確定你是否也是...你\n你知道的，猿人同伴....\n\n\n\n嗯，似乎我的表情符號...",
      "title": "貝索斯，牛屁，和你。至少在30秒內，AMZN與CLNE的交易是最令人困惑的；解開它，人們就不會對它如此無知了。"
    }
  ],
  "title": "Bezos, Cow Farts, and You: How $AMZN's deal w/ $CLNE is the most confusing in at least 30 seconds; unwinding it so people will stop being so ignorant about it.",
  "created_utc": 1623727919,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello, &quot;Apes&quot;.  it is I...also....ape.  Yes, ape.  Here to bless you with lots of rocket emojis and bananas as I am clearly one of you.  Or something.  We still say on fleek, right? I mean, I totally know, but I&#39;m not sure if you, too, are...you know, fellow ape....</p>\n\n<p>&#x200B;</p>\n\n<p>Hmm, it seems as though my emoji keyboard has been replaced with a regular Boomer keyboard.  This makes fellow ape very angry, and I will certainly go out in seek of a real keyboard after this, ape honor.</p>\n\n<p>&#x200B;</p>\n\n<p>Anyhow, I&#39;ve seen an enormous amount of confusion from the, you know, &quot;non-apes&quot;, about what $CLNE&#39;s contract with $AMZN is.  So this will all be review to you because you guys CLEARLY are savvy and intelligent investors who don&#39;t get led by the nose by bots, but for the non-apes, this will be good information.  So let&#39;s talk about it:</p>\n\n<p>&#x200B;</p>\n\n<h1>What&#39;s the deal:</h1>\n\n<p>&#x200B;</p>\n\n<p>In late April, $CLNE entered into an agreement with $AMZN to provide their carbon-negative RNG fuel to $AMZN trucks nationwide.  This deal called for $CLNE to construct an additional 19 Clean Energy fueling stations in addition to the 27 stations $CLNE had astutely built right next to $AMZN&#39;s warehouse as part of the long game to get out of the friend zone with them.  In exchange for this consideration, $AMZN will be buying a fleet of RNG capable vehicles and purchasing, at a minimum to complete the arrangement, over 200 million gallons of RNG as part of their goal to become carbon neutral by 2025 - and as the most green fuel in the world, RNG represents a big chunk of being able to fudge some carbon footprint in other areas by overcompensating in fuel.  To make this deal attractive to Bezos, ape-in-training Andrew Littlefair worked a deal to issue up to 53,141,755 shares of $CLNE stock via warrants at a cost basis of $13.49,  to be executed at various gates over the next 10 years.  That represents about 27% of the company.  But you smart and intellectual apes already knew that.  I mean, obviously.</p>\n\n<p>&#x200B;</p>\n\n<p>The first 13,283,445 shares are fully vested upon the execution of the agreement and an affirmative vote by the shareholders, many of which are you apes because you were so smart as to buy $CLNE without having to be beaten over the head with picking a decent company for once.  That happened today.  The remaining 39,858,310 are only able to be executed by Amazon if they buy fuel - a lot of it.  Half a billion dollars of it by today&#39;s value, which most people estimate will be worth 1.5 billion over the next 10 years as prices rise.   Again, you smart apes already knew this and know that, with a present market cap of only 2.23 billion dollars, this 1.5 billion represents almost the entire value of the company as it sits today.  I don&#39;t know why I keep telling you things you clearly already know.  It must be because I am not a smart ape like you.  Amazon, of course, only signed this deal because they figure that 13.49 they&#39;ll pay per share is a bargain compared to what the company will be worth as they stepdaughter swap $CLNE out to all their buddies for corporate porn.</p>\n\n<p>&#x200B;</p>\n\n<h1>Now, the part the less intelligent &quot;non-apes&quot; don&#39;t seem to grasp, but the most important part:</h1>\n\n<p>&#x200B;</p>\n\n<p>Less discussed is the fact that $AMZN, under terms of the deal, will never be permitted to own more than 5% of the company at any given point.  If they ever go over, they&#39;ve got to give up some shares of the company.  This is the most important part of that entire deal, and it&#39;s the part most people don&#39;t seem to understand or one they disregard as irrelevant.  Basically, no more situations like CLNE is in with $TOT right now where that company owned 20% of $CLNE at one-fucking-penny per share, and has been fucking the stock price for almost 2 months as they de-leveraged with their 800 baggers.  Obviously, $AMZN is going to want more than the $13.49 a share they&#39;re paying, which means it&#39;s in their best interests to see to it that $CLNE is worth as much as possible.  Which very likely means buying more fuel than required as well as &quot;gently nudging&quot; their distribution partners to go RNG, as well.  And by gently nudging, obviously I mean &quot;waterboarding until they comply&quot;.  You&#39;re already starting to see some of the results of this, with a deal being worked out between $UPS and $CLNE, completely of their own free will of course, to partner up for RNG contracts.</p>\n\n<p>&#x200B;</p>\n\n<h1>Why does any of this matter?</h1>\n\n<p>&#x200B;</p>\n\n<p>Again, all you apes that are clearly more smart than me, &quot;fellow ape&quot;, but clearly not as clever as the ape collective, you know this, but it&#39;s this:  If $AMZN&#39;s &quot;win&quot; in this deal is acquisition of diluted shares which they will not be able to actually keep, then in order for $AMZN to &quot;win&quot;, they have to be able to sell those shares for more than $13.49 as they keep at their 5% ownership ceiling.  The floor on $CLNE&#39;s price should not be 13.49 because that&#39;s what $AMZN is paying, that&#39;s wrong, and everybody who&#39;s been saying that has had it backwards.  The floor should be 13.49 because that&#39;s what $AMZN&#39;s cost basis for compulsory  SELLING is.  And I guarantee you $AMZN didn&#39;t agree to pay $13.49 a share on top of 3-something a gallon for cow farts to break even or lose money.  Confusing, I know.  I mean, my 6 year old would probably figure it out if she had an extra chromosome, but I failed as a genetic donor and she only has the standard 46.</p>\n\n<p>&#x200B;</p>\n\n<p>So there the &quot;non apes&quot; have it, because I know all you real apes not only already had this figured out, but definitely didn&#39;t get suckered into buying $WOOF because a botnet told you to today or paperhanded shares in $CLNE when it dipped 10 cents rather than shooting straight up during the investor meeting after all the non-apes got distracted and FOMO&#39;d into some losses and started creating confusion about what this $AMZN deal actually was by displaying they didn&#39;t understand it.  Damn non-apes, am I right, um...fellow...ape?</p>\n\n<p>&#x200B;</p>\n\n<p>TL:DR:  Bezos is smart ape.  And you are clearly smart ape.  Smart apes hang out with each other.  This is just like being Bezos.  Except better than Bezos, because you smart apes can keep buying more shares.  Poor Jeff can&#39;t.  Jeff&#39;s not as wise an ape as a WSB ape.</p>\n\n<p>&#x200B;</p>\n\n<p>Fear and Loathing,</p>\n\n<p>&#x200B;</p>\n\n<p>-CD</p>\n</div><!-- SC_ON -->",
  "score": 2726,
  "permalink": "/r/wallstreetbets/comments/o00qva/bezos_cow_farts_and_you_how_amzns_deal_w_clne_is/",
  "subreddit": "wallstreetbets",
  "id": "o00qva",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1624009750277
}