{
  "author": "Biono03",
  "the_new_excerpt": "I'll start off by saying that, yes, I got pulled into the GME hype. I knew about\nall that since it was at around 40$, but only got in around 300$. I haven't sold\nanything yet, since I believe I can at least cut my losses if I hold into the\nlong term due the big changes the company will do moving…",
  "original_created_utc": 1612464880,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我先说一下，是的，我被拉进了GME的炒作中。我知道\n所有，因为它是在40元左右，但只进了300元左右。我还没有卖\n因为我相信，如果我持有进\n长期来看，由于公司将做大的改变，移...",
      "title": "我想学习如何在赌掉1500元后建立一个多元化的投资组合。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我先說一下，是的，我被拉進了GME的炒作中。我知道\n所有，因爲它是在40元左右，但只進了300元左右。我還沒有賣\n因爲我相信，如果我持有進\n長期來看，由於公司將做大的改變，移...",
      "title": "我想學習如何在賭掉1500元后建立一個多元化的投資組合。"
    }
  ],
  "title": "I'm looking to learn about how to create a diversified portfolio after having gambled away 1500$",
  "created_utc": 1612486011,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ll start off by saying that, yes, I got pulled into the GME hype. I knew about all that since it was at around 40$, but only got in around 300$. I haven&#39;t sold anything yet, since I believe I can at least cut my losses if I hold into the long term due the big changes the company will do moving forward. I only put in money I didn&#39;t care if I lost and am not angry about what I could lose if I sell.</p>\n\n<p>I recently bought a couple books about investing and I&#39;m currently reading The Little Book of Common Sense Investing. From what I&#39;ve read so far - and it makes a lot of sense - I should look into buying low-cost ETF&#39;s. </p>\n\n<p>Now, what I still don&#39;t know is how to choose a good ETF, how many to buy, etc. Since I&#39;m really young, I could pick sum more risky ETF&#39;s, but I don&#39;t know if it&#39;s still important to hold bonds and low risk stocks or ETF&#39;s. Also, I would still like to allocate a percentage of my portfolio to individual stocks, where I would do research about the company and decide what to buy specifically. From what I&#39;ve read here so far 80% ETF&#39;S/20% stock would be good?</p>\n</div><!-- SC_ON -->",
  "score": 199,
  "permalink": "/r/investing/comments/lcmxym/im_looking_to_learn_about_how_to_create_a/",
  "subreddit": "investing",
  "id": "lcmxym",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123198803
}