{
  "author": "decaying_dots",
  "original_created_utc": 1649936045,
  "title": "why don't adults talk about how surreal aging is &amp; how depressing being an adult is.",
  "created_utc": 1649955775,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m 23, 24 this year and thinking about how it&amp;#39;s literally been six years since I finished school &amp;amp; I&amp;#39;ve done nothing really notable (no one to blame but myself) \nBut it just happened so quick, I don&amp;#39;t even remember anything important that&amp;#39;s happened in this time and it&amp;#39;s just sad.. I&amp;#39;m aging and it&amp;#39;s happening so quickly I don&amp;#39;t realize it. \nI&amp;#39;m in a loop of working, hobbies, bills, working, hobbies, bills it&amp;#39;s never ending.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/u3feis/why_dont_adults_talk_about_how_surreal_aging_is/",
  "subreddit": "NoStupidQuestions",
  "id": "u3feis",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm 23, 24 this year and thinking about how it's literally been six years since\nI finished school & I've done nothing really notable (no one to blame but\nmyself) But it just happened so quick, I don't even remember anything important\nthat's happened in this time and it's just sad.. I'm aging and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今年で23、24歳になりますが、文字通り6年ぶりということで、考えてみました。\n学校を卒業して、特に目立ったことはしていない（誰のせいでもない）。\nでも、あっという間のことで、大事なことは何も覚えていません。\nこの間に起こったことは、ただ悲しいだけです。歳をとってしまったし...。",
      "title": "大人は、いかにシュールな老後を送るか、いかに大人であることが憂鬱かを語らないのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我今年23岁，24岁了，想到我从学校毕业到现在已经有6年了，我没有做什么真正意义上的事情。\n我完成学业已经六年了，我没有做什么真正值得注意的事情（这不能怪任何人，只能怪自己）。\n但这一切发生得太快了，我甚至不记得这段时间发生的任何重要事情。\n在这段时间里发生的事情，这让我很难过。我正在衰老，而且...",
      "title": "为什么成年人不谈论衰老是如何超现实的&amp；作为一个成年人是如何压抑。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我今年23歲，24歲了，想到我從學校畢業到現在已經有6年了，我沒有做什麼真正意義上的事情。\n我完成學業已經六年了，我沒有做什麼真正值得注意的事情（這不能怪任何人，只能怪自己）。\n但這一切發生得太快了，我甚至不記得這段時間發生的任何重要事情。\n在這段時間裏發生的事情，這讓我很難過。我正在衰老，而且...",
      "title": "爲什麼成年人不談論衰老是如何超現實的&amp；作爲一個成年人是如何壓抑。"
    }
  ]
}