{
  "author": "fuzzypexches",
  "original_created_utc": 1658611994,
  "title": "Do other conventionally unattractive people have this problem?",
  "created_utc": 1658634404,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m 18F, I’m basically on the brink of being obese and I have pretty bad skin. So you could imagine I’ve never had any sort of romantic experience in my life. (And Im definitely not the prettiest) &lt;/p&gt;\n\n&lt;p&gt;So I’m pretty lonely, so any interaction I have with another person I find attractive, stays in my mind for days. &lt;/p&gt;\n\n&lt;p&gt;I find myself looking at people that I think are pretty all of the time. (I often find myself staring) And often times I exchange glances with these people. I never want to come off as creepy or weird, I just like appreciating other peoples beauty. I never want to make anyone uncomfortable, that’s never my intention. &lt;/p&gt;\n\n&lt;p&gt;And when I find myself exchanging glances with these people, there’s a tiny part of me that thinks that they may think I’m pretty too. But then the reality sets in, I’m not pretty, I’ll never be perceived as pretty. (Especially from the kind of people I find attractive) But this tiny part of my brain makes me want to think that they may think I’m pretty too. And I cant get it out of my head. &lt;/p&gt;\n\n&lt;p&gt;I really just need a reality check. Because these people who I am exchanging glances with, most likely think I am being creepy. But  the immature and unrealistic part of my brain just thinks that they think I’m attractive too (Even though they definitely dont) &lt;/p&gt;\n\n&lt;p&gt;I really need to take the time to think realistically. Because I never want to make anyone uncomfortable. And I also don’t want to set unrealistic expectations for myself.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/NoStupidQuestions/comments/w6eqx7/do_other_conventionally_unattractive_people_have/",
  "subreddit": "NoStupidQuestions",
  "id": "w6eqx7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I’m 18F, I’m basically on the brink of being obese and I have pretty bad skin.\nSo you could imagine I’ve never had any sort of romantic experience in my life.\n(And Im definitely not the prettiest)\n\nSo I’m pretty lonely, so any interaction I have with another person I find\nattractive, stays in my…"
}