{
  "author": "J_S_M_K",
  "original_created_utc": 1625775774,
  "title": "Why is it in women's beach volleyball players during the Olympics compete in bikinis but men's players don't play shirtless?",
  "created_utc": 1625796956,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Okay I don&#39;t have much problem with attractive women playing volleyball in bikinis. That&#39;s standard for volleyball and being a straight dude, I have a little problem with that in general. I just am curious as to why men&#39;s beach volleyball players aren&#39;t playing in just trunks because, in my experience (which, admittedly, is fairly limited since I haven&#39;t lived near beach at any point), men who play volleyball on the beach do so in just their trunks. Is there a reason for this? Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 118,
  "permalink": "/r/NoStupidQuestions/comments/ogfljz/why_is_it_in_womens_beach_volleyball_players/",
  "subreddit": "NoStupidQuestions",
  "id": "ogfljz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Okay I don't have much problem with attractive women playing volleyball in\nbikinis. That's standard for volleyball and being a straight dude, I have a\nlittle problem with that in general. I just am curious as to why men's beach\nvolleyball players aren't playing in just trunks because, in my…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "魅力的な女性がビキニを着てバレーボールをすることに問題はありません。\nビキニを着てバレーボールをしていても問題ありません。それはバレーボールの標準であり、ストレートの男性である私は、一般的には少し問題があります。\n私はストレートの男性ですが、一般的には少し問題があると思います。ただ、なぜ男性のビーチバレー選手がビキニでプレーしないのか、ということに興味があります。\nなぜ男子ビーチバレー選手がトランクスでプレーしないのか不思議です。",
      "title": "オリンピックのビーチバレーの女子選手はビキニで出場するのに、男子選手はシャツを着ずにプレーするのはなぜですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "好吧，我对有吸引力的女性穿着比基尼打排球没有什么异议。\n比基尼。这是排球运动的标准，作为一个直男，我有一个小问题。\n作为一个直男，我对这一点普遍有意见。我只是很好奇，为什么男子沙滩\n我只是好奇为什么男子沙滩排球运动员不穿短裤打球，因为，在我看来...",
      "title": "为什么在奥运会期间女子沙滩排球运动员穿着比基尼比赛，而男子运动员却不穿衣服比赛？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好吧，我對有吸引力的女性穿着比基尼打排球沒有什麼異議。\n比基尼。這是排球運動的標準，作爲一個直男，我有一個小問題。\n作爲一個直男，我對這一點普遍有意見。我只是很好奇，爲什麼男子沙灘\n我只是好奇爲什麼男子沙灘排球運動員不穿短褲打球，因爲，在我看來...",
      "title": "爲什麼在奧運會期間女子沙灘排球運動員穿着比基尼比賽，而男子運動員卻不穿衣服比賽？"
    }
  ]
}