{
  "author": "sadbitchdecade",
  "original_created_utc": 1636741165,
  "title": "Do most office jobs pay people to do nothing?",
  "created_utc": 1636751467,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I started my first office job a few months ago and I feel like I’m getting paid to do nothing. I just have to appear to be online to answer a few emails and slack messages per day. Of course sometimes I have more time consuming projects but the majority of the time I only have like an hour of work to do in an 8 hour workday. </p>\n\n<p>I used to work 10x harder at my retail job and get paid minimum wage for it. Is this just how the corporate world is for entry level jobs or is it just my company? Do y’all not stress about getting fired or laid off?</p>\n</div><!-- SC_ON -->",
  "score": 161,
  "permalink": "/r/TooAfraidToAsk/comments/qshbyu/do_most_office_jobs_pay_people_to_do_nothing/",
  "subreddit": "TooAfraidToAsk",
  "id": "qshbyu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "So I started my first office job a few months ago and I feel like I’m getting\npaid to do nothing. I just have to appear to be online to answer a few emails\nand slack messages per day. Of course sometimes I have more time consuming\nprojects but the majority of the time I only have like an hour of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数ヶ月前に初めて事務職に就いたのですが、何もしないで給料をもらっているような気がします。\n何もしないでお金をもらっているような気分です。1日に数通のメールやslackのメッセージに答えるために、オンラインになっているように見せなければならないのです。\n一日に数通のメールとslackメッセージに答えるために、オンラインにいるように見せなければなりません。もちろん、もっと時間のかかるプロジェクトがあるときは\nもちろん、もっと時間のかかるプロジェクトがある場合もありますが、ほとんどの場合は1時間程度しか...",
      "title": "事務職は、何もしなくても給料がもらえる仕事が多いのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "几个月前，我开始了我的第一份办公室工作，我觉得我得到的是\n我觉得我得到的报酬是什么都不做。我只需要每天出现在网上，回答几封邮件\n和slack信息。当然，有时我有更多耗时的项目\n但大多数时候，我只有一个小时的时间。",
      "title": "大多数办公室工作都是付给人们无所事事的报酬吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "幾個月前，我開始了我的第一份辦公室工作，我覺得我得到的是\n我覺得我得到的報酬是什麼都不做。我只需要每天出現在網上，回答幾封郵件\n和slack信息。當然，有時我有更多耗時的項目\n但大多數時候，我只有一個小時的時間。",
      "title": "大多數辦公室工作都是付給人們無所事事的報酬嗎？"
    }
  ]
}