{
  "author": "Lopsided-Signature87",
  "original_created_utc": 1637919790,
  "title": "Those who all asked for the dip , well now you have it but are you buying the dip?",
  "created_utc": 1637937321,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Btc at 54K , Eth at 4070 , Ada at 1.54 and many more falling today especially on black friday which is great if you stashing for the long term.\nEverytime when a high forms people ask for the dip saying they&#39;ll go in more when there&#39;s a dip well here it is but have you really bought the dip?</p>\n\n<p>Everytime we have a dip either few sell them because of panic or argue because they bought the high without even thinking about the investment.\nIf you are here for the long run these are some of the great opportunities to buy them. Remember be greedy when the street is fearful. I can&#39;t say this as a major dip as we&#39;ve seen much worse during this year but if history repeats itself like last year , this could be the lowest point like 18K we had last year which was never breached again.</p>\n\n<p>TLDR :- buy the dip and Hodl them</p>\n</div><!-- SC_ON -->",
  "score": 615,
  "permalink": "/r/CryptoCurrency/comments/r2jnra/those_who_all_asked_for_the_dip_well_now_you_have/",
  "subreddit": "CryptoCurrency",
  "id": "r2jnra",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Btc at 54K , Eth at 4070 , Ada at 1.54 and many more falling today especially on\nblack friday which is great if you stashing for the long term. Everytime when a\nhigh forms people ask for the dip saying they'll go in more when there's a dip\nwell here it is but have you really bought the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ビットコインは54K、イーサは4070、エイダは1.54など、特にブラックフライデーの今日は多くのものが下落しています。\n特にブラックフライデーは、長期的に蓄えている人にとっては素晴らしいことです。高値が形成されるときはいつも\n高値が形成されるたびに、人々はディップを求め、ディップがあればもっと入るだろうと言います。\nさて、ここからが本番ですが、あなたは本当に買ったのでしょうか...",
      "title": "ディップを求めていた人たちは、これでディップを手に入れたわけだが、あなたはディップを買っているだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "Btc在54K，Eth在4070，Ada在1.54，还有很多今天都在下跌，尤其是在黑色星期五。\n特别是在黑色星期五，如果你想长期储存，这很好。每次当一个\n人们都会要求下跌，并说他们会在下跌的时候买进更多的股票。\n现在就是这样，但你是否真的买了...",
      "title": "那些希望得到 \"浸渍 \"的人，现在你们已经得到了，但你们是否购买 \"浸渍\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "Btc在54K，Eth在4070，Ada在1.54，還有很多今天都在下跌，尤其是在黑色星期五。\n特別是在黑色星期五，如果你想長期儲存，這很好。每次當一個\n人們都會要求下跌，並說他們會在下跌的時候買進更多的股票。\n現在就是這樣，但你是否真的買了...",
      "title": "那些希望得到 \"浸漬 \"的人，現在你們已經得到了，但你們是否購買 \"浸漬\"？"
    }
  ]
}