{
  "author": "PampEeet",
  "original_created_utc": 1643577321,
  "title": "What is the difference between a shitcoin and an altcoin? If my shitcoin becomes popular does it become an altcoin?",
  "created_utc": 1643633109,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hey guys,&lt;/p&gt;\n\n&lt;p&gt;Happy Sunday by the way! &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m pretty new to everything and googled my question and most, if not all articles tell me it&amp;#39;s because they are meme based and don&amp;#39;t have any functionality other than making money. &lt;/p&gt;\n\n&lt;p&gt;At first I though fair enough, but after googling some of the top 20 &amp;quot;alt coins&amp;quot; ADA for instance, I can&amp;#39;t seem to see any use case function for this at all? If it was called a funny name, would it be a shitcoin or is it because it&amp;#39;s not meme based it&amp;#39;s an alt? &lt;/p&gt;\n\n&lt;p&gt;Monero for instance, I can see why this is popular due to its privacy and as far as I can see I&amp;#39;d the only coin that has this feature, however quite a few alt coins I&amp;#39;ve checked out don&amp;#39;t seem to be any different than shitcoins. &lt;/p&gt;\n\n&lt;p&gt;Very confusing. Or is it all just a matter of opinon?&lt;/p&gt;\n\n&lt;p&gt;EDIT: 6 people have told me I&amp;#39;m an idiot because of my ADA comment, yet not one ahs explained to me it&amp;#39;s use case. Calling me an idiot or a troll isn&amp;#39;t helping your case is it? I read their website and it&amp;#39;s nothing but vague roadmaps.&lt;/p&gt;\n\n&lt;p&gt;It wasn&amp;#39;t a dig just a mere observation, please teach me if I&amp;#39;m wrong.&lt;/p&gt;\n\n&lt;p&gt;EDIT 2: Wow some of you are so angry and bitchy, are y&amp;#39;all ok in here?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 305,
  "permalink": "/r/CryptoCurrency/comments/sgj68s/what_is_the_difference_between_a_shitcoin_and_an/",
  "subreddit": "CryptoCurrency",
  "id": "sgj68s",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hey guys,\n\nHappy Sunday by the way!\n\nI'm pretty new to everything and googled my question and most, if not all\narticles tell me it's because they are meme based and don't have any\nfunctionality other than making money.\n\nAt first I though fair enough, but after googling some of the top 20 \"alt…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "やあ、みんな。\n\nところで、ハッピーサンデー!\n\n私は何もかもが初めてで、質問をググってみたのですが、全てではないにしても、ほとんど\nミームベースで、何も持っていないことが原因だと書かれています。\nお金を稼ぐ以外の機能\n\n最初は十分公平だと思ったが、上位20の「alt...」をググってみた。",
      "title": "クソコインとアルトコインの違いは何ですか？自分の作ったクソコインが人気になったらアルトコインになるんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嘿，伙计们。\n\n顺便说一下，周日快乐\n\n我对一切都很陌生，在网上搜索了我的问题，大多数，如果不是所有的\n文章告诉我，这是因为他们是基于备忘录的，没有任何\n赚钱以外的功能。\n\n起初我觉得很公平，但在谷歌上搜索了一些前20名的 \"替代者 \"后，我发现他们都是以 \"回忆 \"为基础。",
      "title": "屎币和替代币之间的区别是什么？如果我的屎币变得流行，它是否会成为一个altcoin？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嘿，夥計們。\n\n順便說一下，週日快樂\n\n我對一切都很陌生，在網上搜索了我的問題，大多數，如果不是所有的\n文章告訴我，這是因爲他們是基於備忘錄的，沒有任何\n賺錢以外的功能。\n\n起初我覺得很公平，但在谷歌上搜索了一些前20名的 \"替代者 \"後，我發現他們都是以 \"回憶 \"爲基礎。",
      "title": "屎幣和替代幣之間的區別是什麼？如果我的屎幣變得流行，它是否會成爲一個altcoin？"
    }
  ]
}