{
  "author": "Doctor-Of-Laws",
  "original_created_utc": 1652056091,
  "title": "Do you also forget nearly everything about the plot in movies, games and books after a while?",
  "created_utc": 1652070984,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I can get completely absorbed by the plot in a movie, series, videogame or book - only to forget it completely some time later. I don&amp;#39;t mean forgetting specific details - I mean I can rewatch/replay/re-read the same thing some months later and be surprised (again) by major plot twists or simply enjoy the story as if I was experiencing it for the first time. It does not happen all the time, but it has been this way for my whole life and happens often enough - the most I can remember is some very basic details. Is there a name for this condition?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 112,
  "permalink": "/r/TooAfraidToAsk/comments/ulf2vw/do_you_also_forget_nearly_everything_about_the/",
  "subreddit": "TooAfraidToAsk",
  "id": "ulf2vw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I can get completely absorbed by the plot in a movie, series, videogame or book\n- only to forget it completely some time later. I don't mean forgetting specific\ndetails - I mean I can rewatch/replay/re-read the same thing some months later\nand be surprised (again) by major plot twists or simply…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "映画、シリーズ物、ビデオゲーム、本などの筋書きに完全にのめり込んでしまうことがある\n- すっかり忘れてしまうことがあります。具体的な内容を忘れているわけではありません。\n数ヶ月後に同じものを見たり、再生したり、読み直したりして、びっくりすることがある。\n数ヶ月後に同じものを再見／再生／再読して、プロットの大きなひねりに（再び）驚いたり、単に...",
      "title": "また、映画やゲーム、本などのプロットは、しばらくするとほぼすべて忘れてしまうのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我可以完全沉浸在一部电影、电视剧、电子游戏或书的情节中\n- 但在一段时间后却完全忘记了它。我并不是说忘记具体的\n我的意思是我可以在几个月后重新观看/重放/重读同样的东西\n并对主要的情节转折感到惊讶（再次），或者只是......",
      "title": "你是否也会在一段时间后忘记电影、游戏和书籍中的几乎所有情节？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我可以完全沉浸在一部電影、電視劇、電子遊戲或書的情節中\n- 但在一段時間後卻完全忘記了它。我並不是說忘記具體的\n我的意思是我可以在幾個月後重新觀看/重放/重讀同樣的東西\n並對主要的情節轉折感到驚訝（再次），或者只是......",
      "title": "你是否也會在一段時間後忘記電影、遊戲和書籍中的幾乎所有情節？"
    }
  ]
}