{
  "author": "Muted-Celery3459",
  "original_created_utc": 1658218837,
  "title": "Is it weird for a 19F to hang out with a 50M?",
  "created_utc": 1658233279,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I (19F) have known a man, &amp;quot;Tom&amp;quot; (anywhere from 50-60), who was a frequent substitute teacher at my middle school. I have known his three children who are around my age as my friends and have interacted his family fairly often growing up. I was frequently invited to dinner over at their house, to church, to housesit, etc. Now I am in college and I do not interact with any of them as often, though I was closest with his son who is my age.&lt;/p&gt;\n\n&lt;p&gt;However, Tom will contact me sometimes (infrequently) and buy me dinner, to hangout, etc. Today he suggested we go somewhere fun this week. All of this is just him and I alone although it would make much more sense to me for at least one of his kids to be there as well. Hanging out alone without any of his family has been a new development. &lt;/p&gt;\n\n&lt;p&gt;Today he said something along the lines of &amp;quot;does it feel weird?/does it feel like we are dating?&amp;quot; (In regards to buying me dinner). Often when I come over the house is empty as his son is at work, family is on a trip, etc. so it ends up being just us. He texted me, &amp;quot;I hope to see you this week&amp;quot; when I said I was not in town to be there for dinner with him. I will not lie it is a little off putting sometimes but I am not sure what to think. While it seems like a weird situation to be in, I do not think he is a bad person who would do anything weird. I have always seen Tom as a father figure type, but I can&amp;#39;t help but wonder if this is a normal thing to do. &lt;/p&gt;\n\n&lt;p&gt;Am I thinking too deep into this? Or is it weird to hang out alone like this?&lt;/p&gt;\n\n&lt;p&gt;Edit: Just to add, he does have a wife in case that changes anything. I know her the least out of his family as I never saw her much but they seem to have a normal family image.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 189,
  "permalink": "/r/TooAfraidToAsk/comments/w2ngd3/is_it_weird_for_a_19f_to_hang_out_with_a_50m/",
  "subreddit": "TooAfraidToAsk",
  "id": "w2ngd3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I (19F) have known a man, \"Tom\" (anywhere from 50-60), who was a frequent\nsubstitute teacher at my middle school. I have known his three children who are\naround my age as my friends and have interacted his family fairly often growing\nup. I was frequently invited to dinner over at their house, to…"
}