{
  "author": "__-_____-_-__---_",
  "original_created_utc": 1641209613,
  "title": "Is there a point in reading criticism of capitalism or modern society if there isn't much I can do to change it or even my individual conditions?",
  "created_utc": 1641250349,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Now obviously there literally are things I can do such as vote, treat people better, limit my usage of certain things but I hope you can understand what I&amp;#39;m saying here. I can&amp;#39;t really see a way to fundamentally change the human condition I live under&lt;/p&gt;\n\n&lt;p&gt;It worries me that many theorists such as Fisher or Debord have met untimely ends.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/ruzpvj/is_there_a_point_in_reading_criticism_of/",
  "subreddit": "askphilosophy",
  "id": "ruzpvj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Now obviously there literally are things I can do such as vote, treat people\nbetter, limit my usage of certain things but I hope you can understand what I'm\nsaying here. I can't really see a way to fundamentally change the human\ncondition I live under\n\nIt worries me that many theorists such as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今、私ができることは、文字通り、投票すること、人と接すること、などです。\nしかし、私が言っていることを理解していただければと思います。\nここで言っているのは この人間性を根本的に変える方法は、私には見いだせません。\n私が生きている条件\n\n多くの理論家が...",
      "title": "資本主義や現代社会の批判を読んでも、それを変えたり、個人の状況を変えたりすることができないのであれば、意味がないのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在很明显，我可以做一些事情，比如投票、待人接物、限制使用某些东西。\n态度更好，限制我对某些东西的使用，但我希望你能理解我在这里说的话。\n我在这里说的。我真的看不出有什么办法可以从根本上改变我所处的人类状况。\n我所处的条件\n\n让我担心的是，许多理论家，如",
      "title": "如果我无法改变资本主义或现代社会，甚至无法改变我的个人状况，那么阅读对资本主义或现代社会的批评是否有意义？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在很明顯，我可以做一些事情，比如投票、待人接物、限制使用某些東西。\n態度更好，限制我對某些東西的使用，但我希望你能理解我在這裏說的話。\n我在這裏說的。我真的看不出有什麼辦法可以從根本上改變我所處的人類狀況。\n我所處的條件\n\n讓我擔心的是，許多理論家，如",
      "title": "如果我無法改變資本主義或現代社會，甚至無法改變我的個人狀況，那麼閱讀對資本主義或現代社會的批評是否有意義？"
    }
  ]
}