{
  "author": "Take_Notice_Walk",
  "the_new_excerpt": "Why are people always complaining how Blackberry is misunderstood? Why do they\nthink their \"misunderstood\" technology isn't valued in? There's a chip shortage\nand $BB needs chips to make money. As far as I know, they don't actually\nmanufacturer the chips. And other companies will get priority in…",
  "original_created_utc": 1617200130,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "为什么人们总是抱怨黑莓如何被误解？为什么他们\n以为自己 \"被误解 \"的技术不被重视，在? 芯片短缺\n和$BB需要筹码来赚钱。据我所知，他们实际上并没有...\n制造芯片。而其他公司将获得优先权，在...",
      "title": "PSA：黑莓/$BB全年上涨100%，YTD上涨30%，诺基亚（$NOK）全年上涨30%。人们到底在抱怨什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "爲什麼人們總是抱怨黑莓如何被誤解？爲什麼他們\n以爲自己 \"被誤解 \"的技術不被重視，在? 芯片短缺\n和$BB需要籌碼來賺錢。據我所知，他們實際上並沒有...\n製造芯片。而其他公司將獲得優先權，在...",
      "title": "PSA：黑莓/$BB全年上漲100%，YTD上漲30%，諾基亞（$NOK）全年上漲30%。人們到底在抱怨什麼？"
    }
  ],
  "title": "PSA: Blackberry / $BB is up 100% for the year, 30% YTD, Nokia ($NOK) is up 30% for the year. What the heck are people complaining about?",
  "created_utc": 1617210396,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Why are people always complaining how Blackberry is misunderstood? Why do they think their &quot;misunderstood&quot; technology isn&#39;t valued in? There&#39;s a chip shortage and $BB needs chips to make money. As far as I know, they don&#39;t actually manufacturer the chips. And other companies will get priority in chips before Blackberry.</p>\n\n<p>Even with the recent dips, it&#39;s already up 100% for the year. That&#39;s pretty good for a stock that always misses out on revenue. And since they need chips to be successful during a chip shortage, I think this stock stays flat or even dips further for the year. But to finish 50-100% for the year is still a nice year. And I think their software is already valued in.</p>\n\n<p>Even $NOK isn&#39;t too bad unless you bought at the year high. </p>\n\n<p>I just don&#39;t understand what people expect. Not every ticker can be <em>&quot;you know what stock&quot;.</em></p>\n\n<p>Disclosure: I&#39;m a moron who has a $12/share cost basis, and just think I only have myself to blame. Shouldn&#39;t go chasing.</p>\n</div><!-- SC_ON -->",
  "score": 619,
  "permalink": "/r/stocks/comments/mh71l1/psa_blackberry_bb_is_up_100_for_the_year_30_ytd/",
  "subreddit": "stocks",
  "id": "mh71l1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357142682
}