{
  "approved_at_utc": null,
  "subreddit": "stocks",
  "selftext": "So I spend a lot of time reading up on financial news because it's something that interests me. Sometimes I feel fomo when I miss out; sometimes I feel like a moron when I take a risk and invest in something and it blows up; sometimes I feel boring for just buying spy every month and thinking it's not enough. Whatever the case- I know I'm not alone when I feel like I'm not doing enough to DCA or I feel like shit when I'm not instantly rich or something. I always somehow think I'm behind.\n\nAnd then I talk to the people in my life.\n\nMy boyfriend has absolutely no clue how stocks works and thinks it's just a hobby.\n\nMy roommate doesn't like to talk about investing with me because he says \"finance people are insufferable\" and so he sworn off ever learning about investing...ever.\n\nMy Dad is always fearful the market's going to \"collapse any day now\" and that I need to buy gold.\n\nMy friends don't even know what a 401k or Roth IRA or Brokerage Account even are. \n\nAnd strangers I meet often jokingly dismiss the stock market as \"horoscopes but for men.\"\n\nThis is who most people are. This is what most people think when you talk to them about the stock market. They don't know what DCA is. They don't know what an ETF is. They don't know what Cost Basis is. Or EPS or Growth or Value or Small/Large Cap or Diversification. When they see the stock market they see a bunch of random letters, a number that changes every second, and a scary line that goes up and down. It doesn't matter if you even have just 5$ in the market...just knowing even one of the previous terms I mentioned above means 99% of those you see around aren't at your level. At best, they are opting for some broad market index fund that they put money into every month that a financial advisor told them to do and if you were to ask them why they do it they really don't even know.\n\nYou are ahead of the curve. Take risks where you can if that's your thing; preserve most of what you have intelligently through the passed down wisdom we have all heard before such as diversification and steady inputs every month. In this regard, you are the 1%.",
  "author_fullname": "t2_k306ouui",
  "saved": false,
  "mod_reason_title": null,
  "gilded": 0,
  "clicked": false,
  "title": "Friendly PSA: Whether you have lost or won this year - the fact you are even investing puts you ahead of 99% of most other people.",
  "link_flair_richtext": [],
  "subreddit_name_prefixed": "r/stocks",
  "hidden": false,
  "pwls": 6,
  "link_flair_css_class": "advice",
  "downs": 0,
  "top_awarded_type": null,
  "hide_score": false,
  "name": "t3_us1k6m",
  "quarantine": false,
  "link_flair_text_color": "light",
  "upvote_ratio": 0.73,
  "author_flair_background_color": null,
  "subreddit_type": "public",
  "ups": 643,
  "total_awards_received": 1,
  "media_embed": {},
  "author_flair_template_id": null,
  "is_original_content": false,
  "user_reports": [],
  "secure_media": null,
  "is_reddit_media_domain": false,
  "is_meta": false,
  "category": null,
  "secure_media_embed": {},
  "link_flair_text": "Advice",
  "can_mod_post": false,
  "score": 643,
  "approved_by": null,
  "is_created_from_ads_ui": false,
  "author_premium": false,
  "thumbnail": "",
  "edited": false,
  "author_flair_css_class": null,
  "author_flair_richtext": [],
  "gildings": {},
  "content_categories": null,
  "is_self": true,
  "mod_note": null,
  "created": 1652837163,
  "link_flair_type": "text",
  "wls": 6,
  "removed_by_category": null,
  "banned_by": null,
  "author_flair_type": "text",
  "domain": "self.stocks",
  "allow_live_comments": false,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So I spend a lot of time reading up on financial news because it&amp;#39;s something that interests me. Sometimes I feel fomo when I miss out; sometimes I feel like a moron when I take a risk and invest in something and it blows up; sometimes I feel boring for just buying spy every month and thinking it&amp;#39;s not enough. Whatever the case- I know I&amp;#39;m not alone when I feel like I&amp;#39;m not doing enough to DCA or I feel like shit when I&amp;#39;m not instantly rich or something. I always somehow think I&amp;#39;m behind.&lt;/p&gt;\n\n&lt;p&gt;And then I talk to the people in my life.&lt;/p&gt;\n\n&lt;p&gt;My boyfriend has absolutely no clue how stocks works and thinks it&amp;#39;s just a hobby.&lt;/p&gt;\n\n&lt;p&gt;My roommate doesn&amp;#39;t like to talk about investing with me because he says &amp;quot;finance people are insufferable&amp;quot; and so he sworn off ever learning about investing...ever.&lt;/p&gt;\n\n&lt;p&gt;My Dad is always fearful the market&amp;#39;s going to &amp;quot;collapse any day now&amp;quot; and that I need to buy gold.&lt;/p&gt;\n\n&lt;p&gt;My friends don&amp;#39;t even know what a 401k or Roth IRA or Brokerage Account even are. &lt;/p&gt;\n\n&lt;p&gt;And strangers I meet often jokingly dismiss the stock market as &amp;quot;horoscopes but for men.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;This is who most people are. This is what most people think when you talk to them about the stock market. They don&amp;#39;t know what DCA is. They don&amp;#39;t know what an ETF is. They don&amp;#39;t know what Cost Basis is. Or EPS or Growth or Value or Small/Large Cap or Diversification. When they see the stock market they see a bunch of random letters, a number that changes every second, and a scary line that goes up and down. It doesn&amp;#39;t matter if you even have just 5$ in the market...just knowing even one of the previous terms I mentioned above means 99% of those you see around aren&amp;#39;t at your level. At best, they are opting for some broad market index fund that they put money into every month that a financial advisor told them to do and if you were to ask them why they do it they really don&amp;#39;t even know.&lt;/p&gt;\n\n&lt;p&gt;You are ahead of the curve. Take risks where you can if that&amp;#39;s your thing; preserve most of what you have intelligently through the passed down wisdom we have all heard before such as diversification and steady inputs every month. In this regard, you are the 1%.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "likes": null,
  "suggested_sort": "confidence",
  "banned_at_utc": null,
  "view_count": null,
  "archived": false,
  "no_follow": false,
  "is_crosspostable": false,
  "pinned": false,
  "over_18": false,
  "awarders": [],
  "media_only": false,
  "link_flair_template_id": "823be0a6-65e6-11e5-9784-125ee764bc01",
  "can_gild": false,
  "spoiler": false,
  "locked": false,
  "author_flair_text": null,
  "treatment_tags": [],
  "visited": false,
  "removed_by": null,
  "num_reports": null,
  "distinguished": null,
  "subreddit_id": "t5_2qjfk",
  "author_is_blocked": false,
  "mod_reason_by": null,
  "removal_reason": null,
  "link_flair_background_color": "#646d73",
  "id": "us1k6m",
  "is_robot_indexable": true,
  "report_reasons": null,
  "author": "_RetroDigital_",
  "discussion_type": null,
  "num_comments": 34,
  "send_replies": true,
  "whitelist_status": "all_ads",
  "contest_mode": false,
  "mod_reports": [],
  "author_patreon_flair": false,
  "author_flair_text_color": null,
  "permalink": "/r/stocks/comments/us1k6m/friendly_psa_whether_you_have_lost_or_won_this/",
  "parent_whitelist_status": "all_ads",
  "stickied": false,
  "url": "https://www.reddit.com/r/stocks/comments/us1k6m/friendly_psa_whether_you_have_lost_or_won_this/",
  "subreddit_subscribers": 4062190,
  "created_utc": 1652845170,
  "num_crossposts": 0,
  "media": null,
  "is_video": false,
  "original_created_utc": 1652837163,
  "the_new_excerpt": "So I spend a lot of time reading up on financial news because it's something\nthat interests me. Sometimes I feel fomo when I miss out; sometimes I feel like\na moron when I take a risk and invest in something and it blows up; sometimes I\nfeel boring for just buying spy every month and thinking it's…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "だから、私は金融関連のニュースを読むことに多くの時間を費やしています。\nを読んでいます。時々、失敗したときにフォモだと感じたり、リスクを取って投資したときにモロだと感じたり\nリスクをとって投資したものが大暴落したときはバカだと思うし、今までスパイを買っ\n毎月スパイを買うだけで、つまらないと思うこともあります。",
      "title": "親愛なるPSA：今年負けたにせよ勝ったにせよ、あなたが投資をしているという事実は、他の多くの人々の99％を凌駕しています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，我花了很多时间阅读金融新闻，因为这是我的事情。\n我很感兴趣。有时，当我错失良机时，我会觉得自己是个傻瓜；有时，当我冒着风险投资某个东西，但它却爆炸了，我会觉得自己是个白痴。\n有时我觉得自己像个白痴，因为我冒着风险投资了一些东西，但它爆炸了；有时我觉得自己很无聊，因为我每个月都买间谍，认为它是......。\n有时我觉得很无聊，因为我每个月都在买间谍，并认为它是......",
      "title": "友情提示：无论你今年是输了还是赢了--你甚至在投资的事实使你领先于其他大多数人的99%。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，我花了很多時間閱讀金融新聞，因爲這是我的事情。\n我很感興趣。有時，當我錯失良機時，我會覺得自己是個傻瓜；有時，當我冒着風險投資某個東西，但它卻爆炸了，我會覺得自己是個白癡。\n有時我覺得自己像個白癡，因爲我冒着風險投資了一些東西，但它爆炸了；有時我覺得自己很無聊，因爲我每個月都買間諜，認爲它是......。\n有時我覺得很無聊，因爲我每個月都在買間諜，並認爲它是......",
      "title": "友情提示：無論你今年是輸了還是贏了--你甚至在投資的事實使你領先於其他大多數人的99%。"
    }
  ],
  "source_updated_at": 1653039958460
}