{
  "author": "redmitchM",
  "the_new_excerpt": "This post will be pretty long, comparing a few financial figures and other\nthings like that. Free to have any discussion on a few of the points I make,\nfeel free to call out my logic or anything like that out! Skip to the end where\nit says \"Final Discussion\" if you don't want to read all my…",
  "original_created_utc": 1608093677,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这篇帖子会很长，比较几个财务数字和其他\n诸如此类的事情。我可以自由讨论我提出的几个观点，\n尽管说出我的逻辑或诸如此类的东西吧！跳到以下位置的末尾\n如果你不想看我所有的…，上面写着“最后讨论”",
      "title": "海盗号，罗技，还是.？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這篇帖子會很長，比較幾個財務數字和其他\n諸如此類的事情。我可以自由討論我提出的幾個觀點，\n儘管說出我的邏輯或諸如此類的東西吧！跳到以下位置的末尾\n如果你不想看我所有的…，上面寫着“最後討論”",
      "title": "海盜號，羅技，還是.？"
    }
  ],
  "title": "Corsair, Logitech, or...?",
  "created_utc": 1608151033,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This post will be pretty long, comparing a few financial figures and other things like that. Free to have any discussion on a few of the points I make, feel free to call out my logic or anything like that out! Skip to the end where it says &quot;<strong>Final Discussion&quot;</strong> if you don&#39;t want to read all my breakdown. </p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><p>Corsair Gaming (CRSR)</p></li>\n<li><p>Logitech International (LOGI)</p></li>\n<li><p>Turtle Beach Corporation (HEAR)</p></li>\n<li><p>Razer Inc. (RAZFF)</p></li>\n<li><p>Plantronics (PLT)</p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>All numbers I post will be off of Yahoo Finance, so excuse me if some of the numbers are wrong. This is purely for discussion, hopefully it creates a good one!</p>\n\n<p><strong>Revenue/Earnings/Growth</strong></p>\n\n<p>Obviously a huge part of investing (at least for most people - haha), is to know if the company makes money or is on their way to making money; let us take a look. </p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><p>Corsair Gaming (CRSR); <em>Revenue</em> <em>= 1.1B, Earnings = -8M, QoQ Rev. Growth = 61%, QoQ Earnings Growth = 2294%</em></p></li>\n<li><p>Logitech International (LOGI); <em>Revenue</em> <em>= 2.98B, Earnings = +450M, QoQ Rev. Growth = 75%, QoQ Earnings Growth = 266%</em></p></li>\n<li><p>Turtle Beach Corporation (HEAR); <em>Revenue</em> <em>= 235M, Earnings = +18M, QoQ Rev. Growth = 141%, QoQ Earnings Growth = N/A%</em></p></li>\n<li><p>Razer Inc. (RAZFF); <em>Revenue</em> <em>= 821M, Earnings = -84M, QoQ Rev. Growth = 25%, QoQ Earnings Growth = N/A%</em></p></li>\n<li><p>Plantronics (PLT); <em>Revenue</em> <em>= 1.7B, Earnings = -827M, QoQ Rev. Growth = -11%, QoQ Earnings Growth = N/A%</em></p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>So a few things are clear from a fundamental revenue/earnings standpoint. The first being that CRSR, LOGI and HEAR are probably the best out of the five. Corsair has insane Earnings Growth, and are almost into positive earnings (remember I&#39;m just using 2019 numbers). Logitech seem to be solid, with High Revenue and High Earnings Growth. Turtle Beach also seems to be growing at a quick pace. Razers small revenue growth QoQ scares me being paired with the negative earnings; unattractive. Plantonics  is losing a lot of money and their business seems to be slowing down. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Institutional/Insiders Ownership</strong></p>\n\n<p>I am always a big fan of insider ownership (up to a certain point), and even more so when there is high institutional ownership. I think big money always knows whats up, and maybe thats just being a sheep but lets take a look:</p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><p>Corsair Gaming (CRSR); <em>Insider Ownership = 5.6%, Institutional Ownership = 91%</em></p></li>\n<li><p>Logitech International (LOGI); <em>Insider Ownership = 1%, Institutional Ownership = 58%</em></p></li>\n<li><p>Turtle Beach Corporation (HEAR); <em>Insider Ownership = 7%, Institutional Ownership = 66%</em></p></li>\n<li><p>Razer Inc. (RAZFF); <em>Insider Ownership = 59%, Institutional Ownership = 3%</em></p></li>\n<li><p>Plantronics (PLT); <em>Insider Ownership = 2.3%, Institutional Ownership = 96%</em></p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>So like I said above, I personally am a fan of both insider and institutional ownership. I like when Insider ownership is in the high single digits or low double digits (5%-12%?). This is because I feel like it gives companies leaders an incentive to work hard (as they own a considerable amount), while also not being able to override every decision a company makes, and instead allow external institutions and investors to have a voice as well. Obviously institutional ownership is good, big money generally means big things. So in terms of the statistics above; Corsair Gaming (in my opinion) has that great mix of insider ownership and lots of institutional ownership. The free float is very small (which may be why it is a very volatile stock). Razers high insider ownership and low institutional ownership scares me a lot, I would stay away from this company (to me thats alarming). </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Market Caps/PEG Ratios</strong></p>\n\n<p>Market Caps just for reference on &quot;how big&quot; they are, along with the PEG Ratios. PEG Ratio is a metric thats not always used but it relates the price of the stock, the earnings-per-share (EPS) and EXPECTED growth. For anyone that doesn&#39;t know; 1 is assumed to be a fair value, between 0-1 is &quot;undervalued&quot; and above 1 is &quot;overvalued&quot;. I am using PEG because we are comparing companies of significantly different sizes and earnings so it allows us to see if the individual companies are trading at a discount as per the earnings they are making. </p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><p>Corsair Gaming (CRSR); <em>Market Cap: 3.23B, PEG Ratio: 0.4</em></p></li>\n<li><p>Logitech International (LOGI); <em>Market Cap: 15.36B, PEG Ratio: 0.94</em></p></li>\n<li><p>Turtle Beach Corporation (HEAR); <em>Market Cap: 376M, PEG Ratio: 0.66</em></p></li>\n<li><p>Razer Inc. (RAZFF); <em>Market Cap: 2.6B, PEG Ratio: N/A</em></p></li>\n<li><p>Plantronics (PLT); <em>Market Cap: 1.02B, PEG Ratio: 0.58</em></p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>As we can see, Logitech is the largest one by far, with Turtle Beach being the smallest one. All of them appear &quot;undervalued&quot;, perhaps this is the sector? From what I have seen in the Tech Industry it is pretty uncommon to have a PEG ratio between 0-1. As we can see this ratio is not to be taken too seriously, a company like Corsair Gaming has the best one, while Plantronics (despite the large losses in 2020) has the second best PEG Ratio. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Cash/Debt/Current Ratio</strong></p>\n\n<p>Shows the position the companies are in, the last metric we will look at. </p>\n\n<p>&#x200B;</p>\n\n<ol>\n<li><p>Corsair Gaming (CRSR); <em>Cash = 116M, Debt = 396M, Current Ratio = 1.41</em></p></li>\n<li><p>Logitech International (LOGI); <em>Cash = 917M, Debt = 35.9M, Current Ratio = 1.79</em></p></li>\n<li><p>Turtle Beach Corporation (HEAR); <em>Cash = 27.3M, Debt = 5.5M, Current Ratio = 1.72</em></p></li>\n<li><p>Razer Inc. (RAZFF); <em>Cash = 594M, Debt = 11.8M, Current Ratio = 1.82</em></p></li>\n<li><p>Plantronics (PLT); <em>Cash = 228M, Debt = 1.7B, Current Ratio = 1.38</em></p></li>\n</ol>\n\n<p>&#x200B;</p>\n\n<p>As we can see, all of the companies are positioned well to pay their short-term debt. Logitech, Turtle Beach and Razer are in fantastic cash positions, while Corsair is in a decent one; and Plantronics seems to be in a bad one. </p>\n\n<p>&#x200B;</p>\n\n<p><strong>Final Discussion</strong></p>\n\n<p>For anyone that is still here, I&#39;ll discuss some of the main points, along with my opinions. My bottom pick is Plantronics. The main reason is due to their negative growth, negative earnings &amp; piling debt. My second least favourite is Razer. Although a great cash-to-debt position, Razers institutional ownership terrifies me; with a much lower growth rate compared to its peers I would say it explains the downwards slip since going public. </p>\n\n<p>&#x200B;</p>\n\n<p>With the last 3 left to pick; HEAR? CRSR? LOGI? I think this is where I dive into more than just numbers. </p>\n\n<p>&#x200B;</p>\n\n<p>Turtle Beach had an insanely high run-up back in 2013, but has struggled since. It is also the smallest of these three, and therefore I am personally the least interested. Turtle Beach is famous for their headsets, but the reality is they don&#39;t have much going on outside of that. Rocccat will boost their sales. Roccat have mice &amp; keyboards, but in a crowded space that is very competitive they are definitely not the forerunners. Their business is, from a fundamentals stand point, not bad right now. But based on the scalability, Corsair and Logitech are my forerunners for this space (specifically peripherals) as I feel they have something more special. </p>\n\n<p>&#x200B;</p>\n\n<p>Logitech has been on the market for over 20+ years, and has a pretty impressive growth story over the last 5 or so (~600% return). Logitech is a household name; walk into an office and the mice are all Logitech. Keyboards, accessories, speakers; they do it all. Their growth has been very impressive, decent institutional ownership. Have a great cash-to-debt position, can pay short term debt. Logitech seems like a fairly sound investment. </p>\n\n<p>&#x200B;</p>\n\n<p>Corsair Gaming has just recently IPO&#39;d. It had a massive run-up and became a &#39;meme&#39; stock. It has fallen 40% since then, and to me it seems pretty attractive right now. Corsair Gaming is a notorious brand in the true GAMING industry. Almost every single custom PC built for gaming will have Corsair parts in it. They have insane Earnings growth, are nearly profitable, have an excellent PEG ratio (explained above), and have excellent institutional ownership, paired with the good amount of insider ownership (explained above) as well. They can pay their short-term debt, and their cash-to-debt position doesn&#39;t scare me as they make over a billion in revenue per year now. </p>\n\n<p>&#x200B;</p>\n\n<p>Now the MONEY - GOLDEN, question is : CRSR or LOGI? For me, I don&#39;t know. Corsair Gaming is 1/5 the Market Cap, and are making 1/3 the revenue. Logitech seems to be growing revenue at a slightly quicker rate than Corsair Gaming, but Corsair Gaming is growing earnings at a much quicker rate; and from a business and investor standpoint, earnings are more important. Logitech edges in peripherals, Corsair edges in custom computer parts. Corsair seems to be the Apple of this sector, while Logitech more like a budget product. The reason I say this is because PC Parts are more expensive than your average computer mouse. For me, a young investor, willing to take on a little more risk &amp; volatility; a smaller company with higher earnings GROWTH is more attractive than a larger company with a slightly smaller one. The higher institutional ownership at the moment of IPO also makes me feel like many people are betting on their growth story. I feel like the possibility for stock price appreciation is higher with Corsair as opposed to Logitech, but maybe you have something to argue?</p>\n\n<p>&#x200B;</p>\n\n<p>I am open to any discussion, and I&#39;m sorry for writing an absolute essay. I&#39;m a gamer, I&#39;m passionate about this sector. I think regardless of if you choose Logitech or Corsair, some money is to be made in the next few years. Thanks for reading everyone! Always do your own DD, as my findings are not to be responsible for anything you choose to do. </p>\n\n<p>&#x200B;</p>\n\n<p>Good luck everyone, and heres to a better year!</p>\n</div><!-- SC_ON -->",
  "score": 59,
  "permalink": "/r/stocks/comments/ke2goj/corsair_logitech_or/",
  "subreddit": "stocks",
  "id": "ke2goj",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1609260495586
}