{
  "author": "freshgreenbeans7",
  "original_created_utc": 1625946349,
  "title": "Normies criticize crypto for being too risky, but crypto has “gamified” savings for me like no other mechanism.",
  "created_utc": 1625975172,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’ve never been a great saver, but I have  done really well with stocks. Once I started dynamic DCA-ing into crypto, my whole outlook on savings changed. It’s an instant positive feedback loop, because there’s always a new way to increase my savings (DEFI, CEFI, or just tried and true blue chip cryptos + HODL over the years). </p>\n\n<p>When I stopped feeling slightly ashamed for the “risk” I was taking on for my crypto investments, and instead realized how much crypto has helped me save* I started seeing things differently. The game of crypto has helped me stop overspending and focus on slow savings.</p>\n\n<p>*Thankfully I’m still fairly green in this current market, maybe I’ll feel differently if BTC tanks down to $15-20k.</p>\n\n<p>Has anyone else had a similar journey?</p>\n</div><!-- SC_ON -->",
  "score": 167,
  "permalink": "/r/CryptoCurrency/comments/ohph8q/normies_criticize_crypto_for_being_too_risky_but/",
  "subreddit": "CryptoCurrency",
  "id": "ohph8q",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’ve never been a great saver, but I have done really well with stocks. Once I\nstarted dynamic DCA-ing into crypto, my whole outlook on savings changed. It’s\nan instant positive feedback loop, because there’s always a new way to increase\nmy savings (DEFI, CEFI, or just tried and true blue chip…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "貯金は苦手ですが、株はとても上手にできました。しかし\n貯蓄に対する考え方が変わったのです。これは\n貯蓄を増やすための新しい方法が常にあるので、すぐに正のフィードバックループができます。\n貯蓄を増やすための新しい方法が常にあるからです（DEFI、CEFI、または単に試行錯誤したブルーチップ...）。",
      "title": "普通の人は、暗号はリスクが高すぎると批判しますが、暗号は他のメカニズムとは異なり、私の貯蓄を「ゲーム化」してくれました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从来不是一个伟大的储蓄者，但我在股票方面做得非常好。一旦我\n开始动态DCA-ing进入加密货币，我的整个储蓄观就改变了。它是\n这是一个即时的正反馈循环，因为总是有新的方法来增加我的储蓄（DEFI、CEFI）。\n我的储蓄（DEFI，CEFI，或只是尝试和真正的蓝筹......",
      "title": "正常人批评加密货币风险太大，但加密货币对我来说，将储蓄 \"游戏化 \"了，这是其他机制无法比拟的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從來不是一個偉大的儲蓄者，但我在股票方面做得非常好。一旦我\n開始動態DCA-ing進入加密貨幣，我的整個儲蓄觀就改變了。它是\n這是一個即時的正反饋循環，因爲總是有新的方法來增加我的儲蓄（DEFI、CEFI）。\n我的儲蓄（DEFI，CEFI，或只是嘗試和真正的藍籌......",
      "title": "正常人批評加密貨幣風險太大，但加密貨幣對我來說，將儲蓄 \"遊戲化 \"了，這是其他機制無法比擬的。"
    }
  ]
}