{
  "author": "bitbuggs",
  "the_new_excerpt": "There are only 21 Million Bitcoin that will ever exist. Currently there are only\n18.5 Mil in circulation. Of this, 4 million bitcoin are considered unrecoverable\nbringing the supply down to 14.5 Mil. Of the bitcoin that is mined everyday,\nthat entire supply is bought by Greyscale alone. With other…",
  "original_created_utc": 1610253880,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "只有2100万比特币会存在。目前只有\n流通中的1850万美元。其中，400万比特币被认为是无法追回的。\n使供应量降至1450万。每天开采的比特币，\n所有的供应都是由Greyscale一家购买的。使用其他…",
      "title": "任何想要出售比特币的人：先读这篇文章吧！"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只有2100萬比特幣會存在。目前只有\n流通中的1850萬美元。其中，400萬比特幣被認爲是無法追回的。\n使供應量降至1450萬。每天開採的比特幣，\n所有的供應都是由Greyscale一家購買的。使用其他…",
      "title": "任何想要出售比特幣的人：先讀這篇文章吧！"
    }
  ],
  "title": "Anyone Looking to Sell Bitcoin: READ THIS FIRST!!",
  "created_utc": 1610279332,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are only 21 Million Bitcoin that will ever exist. Currently there are only 18.5 Mil in circulation. Of this, 4 million bitcoin are considered unrecoverable bringing the supply down to 14.5 Mil. Of the bitcoin that is mined everyday, that entire supply is bought by Greyscale alone. With other companies adding bitcoin to their balance sheet, thousands of bitcoins are being accumulated by the day lowering the amount in circulation even more. In the coming months and years we will start to see financial institutions buying bitcoin to provide financial serves such as ETFs and derivative products. </p>\n\n<p>There is literally not enough bitcoin for everyone to go around. It is an asset in high demand and very little supply. The days of being able to afford 1 bitcoin is already over for the middle class. The days for the middle class not being able to afford 0.1 Bitcoin is coming. </p>\n\n<p>If you have the privilege of owning 1 BTC, you are blessed. If you have ANY amount of BTC you are blessed. Anyone that is considering selling their bitcoin to take some profits then think again. Big institutions are sitting there WAITING to steal it from you. This currency was made for us little guys, not them. If you sell your bitcoin then you don&#39;t deserve to be apart of this market. You are taking a gift and giving it to the people who want to control you. Whether Bitcoin goes to 1Mil a coin or zero, keeping control of this currency is all that matters. Bitcoin is not just about money, its a movement. It allows us to have a voice in an unfair system where we are controlled by the elite few. It allows us to say that we choose to NOT participate in your game. Bitcoin is power, and to give up the power you have to the powerful is sad. Remember the reason you originally bought, and no matter how high bitcoin goes, remember the reason we HODL. This will be a bumpy ride and I wish you all the best.</p>\n</div><!-- SC_ON -->",
  "score": 461,
  "permalink": "/r/Bitcoin/comments/ku7msr/anyone_looking_to_sell_bitcoin_read_this_first/",
  "subreddit": "Bitcoin",
  "id": "ku7msr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706371557
}