{
  "author": "SpecialSpread4",
  "original_created_utc": 1625867966,
  "title": "Do video games have the potential to be meaningful art?",
  "created_utc": 1625918103,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve long been of the opinion that video games have as much artistic potential as film and literature. This possibly extends to more analog games with less ability to include narrative content, but that&#39;s a different concern. But recently I came across <a href=\"https://www.gamasutra.com/view/news/123860/Opinion_Brian_Moriartys_Apology_For_Roger_Ebert.php\">this article</a>, which draws upon Arthur Schopenhaur&#39;s work and the trappings of &quot;kitsch&quot; to describe why games inherently have a lower capacity for becoming art. Furthermore, I&#39;ve begun to reexamine Roger Ebert&#39;s arguments on the subject. While I think he had many misconceptions about gaming, I can&#39;t get some of his points out of my head. That the player essentially takes the role of co-author, that even if the game has a very linear and defined story the player can still choose to dissociate the gameplay from the story by frolicking around in place in such a way that their character would not if they were presented in another medium. These points give me pause. It&#39;s the same with death or fail states. Ultimately, the point comes across that while games may possess pieces of art, great music, great art, or even great stories, that they are games will always make them lesser. There&#39;s a lot more to this, especially in that article, which details how games being fundamental exercises of one&#39;s will precludes them from being sublime vis a vis Schopenhaur&#39;s description of art, how art should be judged solely on the artistic vision of its creator and nothing else, and that we shouldn&#39;t disregard &quot;the wisdom of the ages&quot; to start including games in the category of art, but that&#39;s a bit too complicated for me to fully capture.</p>\n\n<p>I&#39;m aware that not every game will be high, meaningful, or sublime art, whatever you want to call it. A lot of my favorite games are just games I find fun mechanically, and I&#39;m perfectly at peace with that. But there are also a lot that I think use their interactive elements alongside their narrative elements in ways that make them more effective joined than apart, making an experience that can&#39;t be replicated elsewhere. But when I think of those dissonant elements I brought up earlier, death, standing around, etc. that almost all games, even the most ludonarratively cohesive, are subject to, I get a little concerned. It&#39;s the same with the kitsch angle. I think say, Final Fantasy VII is a great and meaningful story, but some would argue that its design sense is too focused on looking &quot;cool&quot; rather than meaningful to be truly considered sublime. I would disagree on certain specifics, but I do appreciate pleasing aesthetics even if those aesthetics aren&#39;t themselves meaningful, and I feel as if I&#39;ve been looking at art wrong. After all, Sublime art must be meaningful in all respects. I don&#39;t think the argument that no one can name a game on par with any of the great novels or films is a particularly fair thing to ask, because I&#39;ve yet to see an expert well-versed both at once step up to that plate. But at the same time, that no game is yet considered that great makes me feel as if there never will be a game considered that great.</p>\n\n<p>All in all, I guess I have a few questions that synthesize into the title question:</p>\n\n<ol>\n<li>Is Schopenhaur&#39;s definition of art the best way to conceive of art?</li>\n<li>Do elements of ludonarrative dissonance common to almost all games preclude those games from being high art?</li>\n<li>Do &quot;kitsch&quot; sensibilities or aesthetics preclude something from being high art?</li>\n<li>What does it mean that there is no commonly acknowledged game that one can point to as being the artistic equal of, say, <em>Hamlet</em>, <em>War and Peace</em>, or <em>Citizen Kane</em>?</li>\n<li>All of this considered, are games as a medium equally valid mediums for storytelling as those that have come before it?</li>\n</ol>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/oh5pqx/do_video_games_have_the_potential_to_be/",
  "subreddit": "askphilosophy",
  "id": "oh5pqx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've long been of the opinion that video games have as much artistic potential\nas film and literature. This possibly extends to more analog games with less\nability to include narrative content, but that's a different concern. But\nrecently I came across this…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は以前から、ビデオゲームは映画や文学と同じくらい芸術的な可能性を秘めていると考えています。\n映画や文学と同じくらい芸術的な可能性を秘めていると考えています。それは、物語性を持たないアナログゲームにも言えることかもしれません。\n物語性を持たないアナログゲームにも言えることですが、それはまた別の問題です。しかし\n最近、こんなものを見つけました。",
      "title": "ビデオゲームは、意味のあるアートになる可能性を秘めているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "长期以来，我一直认为电子游戏与电影和文学一样，具有很大的艺术潜力。\n和电影、文学一样具有艺术潜力。这可能会延伸到更多的模拟游戏，其包含的叙事内容较少。\n但这是另一个问题。但是\n最近我看到了这个...",
      "title": "电子游戏有可能成为有意义的艺术吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "長期以來，我一直認爲電子遊戲與電影和文學一樣，具有很大的藝術潛力。\n和電影、文學一樣具有藝術潛力。這可能會延伸到更多的模擬遊戲，其包含的敘事內容較少。\n但這是另一個問題。但是\n最近我看到了這個...",
      "title": "電子遊戲有可能成爲有意義的藝術嗎？"
    }
  ]
}