{
  "author": "Justzodiac",
  "the_new_excerpt": "Disclaimer: Not investment advice, I'm just someone looking at a few companies\nand am unqualified\n\n\nTHE CRITERIA\n\n1. general selection\n\nI invested some of my capital in companies operating in the hydrogen sector in\n2017. Now that most positions here have increased tenfold, I'm looking at\nsectors…",
  "original_created_utc": 1612877563,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "声明：不是投资建议，我只是一个看中几家公司的人。\n不胜任\n\n\n准则\n\n1. 一般选择\n\n我将我的部分资本投资于在氢领域运营的公司。\n2017. 现在这里的大部分仓位已经增加了十倍，我看一下\n各部门...",
      "title": "我看了一下140家生物技术公司。这是我喜欢的五家。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "聲明：不是投資建議，我只是一個看中幾家公司的人。\n不勝任\n\n\n準則\n\n1. 一般選擇\n\n我將我的部分資本投資於在氫領域運營的公司。\n2017. 現在這裏的大部分倉位已經增加了十倍，我看一下\n各部門...",
      "title": "我看了一下140家生物技術公司。這是我喜歡的五家。"
    }
  ],
  "title": "I took a look at 140 biotech companies. These are the five I like:",
  "created_utc": 1612883960,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Disclaimer: Not investment advice, I&#39;m just someone looking at a few companies and am unqualified</strong></p>\n\n<h1>The criteria</h1>\n\n<p><strong>1. general selection</strong></p>\n\n<p>I invested some of my capital in companies operating in the hydrogen sector in 2017. Now that most positions here have increased tenfold, I&#39;m looking at sectors that have the same potential. Besides EVs, there is really only one sector that impresses me similarly: biotech and nanotech. \nI have taken a closer look at 140 companies operating under the biotech and nanotech category. Here I would like to summarise which ones are particularly interesting and why. I have also focused on favouring unknown companies in order to fully exploit their potential. Conversely, this means that I do not include BioNTech or CureVac in this DD, even though they are certainly very solid companies. </p>\n\n<p><strong>2. penny stocks</strong></p>\n\n<p>During my research I also came across some very interesting pennystocks, but due to the rules of the subreddit they cannot be included.</p>\n\n<p><strong>3. the evaluation criteria</strong></p>\n\n<p>As evaluation criteria of the companies, I then added the field in which the company is active and the techniques used by the company. </p>\n\n<p>Of course, personal impressions should not be the deciding factor. (But it must always be taken into account. A pure assessment based on the figures would be value investing, and we don&#39;t want to do value investing here, but look at the real opportunities.) But the numbers still play a role. Many of the companies in research have outlays before patents on drugs or therapies can be applied for and money can be earned. So I have also looked at the financial reports of every company I present here. According to the sector, my focus was not on whether the company is in the black or not, but whether losses have been reduced compared to the previous year&#39;s figures or not. </p>\n\n<h1>These are the stocks I like</h1>\n\n<p>Out of the 140 companies, I ended up buying shares in eight companies. Of these, two are a penny stock and one has a market cap of only 718M. (I can&#39;t shed more light on these because of this subs rules).</p>\n\n<p>However, five interesting companies remain that I would like to present in more detail. (Sorted by their market cap)</p>\n\n<p><strong>1. Wuxi Biologics</strong></p>\n\n<p>WXIBF </p>\n\n<p>Market Cap: 66.763B</p>\n\n<p>Wuxi Biologics is a Chinese headquartered CDMO that provides open-access, integrated technology platforms for biologics drug development. This company is not really active in one area of application, but is in some ways an all-rounder. It develops software that is used for research and cooperates with many companies to market this software but also to produce drugs for countless areas of application. In the process, the company has seven subsidiaries in China, three in the USA, two in Germany and one in Ireland. </p>\n\n<p>About the numbers:</p>\n\n<p>Wuxi Biologics had revenues of $1,607B in the first half of 2019. In the first half of 2020, that increased by 21% to 1,944B USD. While profit was 671M USD in the first half of 2019 and 787.3M USD in the first half of 2020. Wuxi Biologics has made a revenue increase of 64.4% and a profit increase of 68.2% since 2014.</p>\n\n<p>Conclusion:</p>\n\n<p>Judging by its broad-based operations, big-name collaborations with companies worldwide and good numbers, Wuxi Biologics is a profitable company, which is very rare to find in the biotech segment. Accordingly, it is also by far the most highly valued. However, because it is such a large company that has its own software for developing new solutions in medicine, sells this software and is also involved in the production of drugs, it is difficult for me not to see growth potential here. You have a company that covers all the desirable sectors itself and is so very unique.</p>\n\n<p><strong>2. Denali Therapeutics</strong></p>\n\n<p>DNLI</p>\n\n<p>Market Cap: 9.229B</p>\n\n<p>The company focuses on the discovery and development of therapies for patients with neurodegenerative diseases such as Alzheimer&#39;s, Parkinson&#39;s, ALS and others. Denali&#39;s approach here is to find a way to solve these diseases via genetics, pathology and cell biology. In the process, the company has found 22 drugs, four of which are currently in clinical trials. </p>\n\n<p>About the numbers:</p>\n\n<p>DNLI had revenue of $8.41M in the first half of 2019, rising slightly to $9.45M in the first half of 2020. The loss per share remains steadily at a similar level. It will remain that way for the time being. Until the first therapies complete clinical trials and are approved. -$0.51 USD EPS is not unusual in the biotech sector precisely because of the horrendous research costs.</p>\n\n<p>Conclusion:</p>\n\n<p>DNLI has had incredible success in discovering therapeutic approaches and drugs. Even if the approval rate is only one quarter, there will be a huge potential over the years if the research success remains the same. And all of this in fields in which there are currently only partially successful therapeutic approaches.</p>\n\n<p><strong>3. Exelixis</strong></p>\n\n<p>EXEL</p>\n\n<p>Market Cap: 7.387B</p>\n\n<p>Exelixis is a company that makes genomics-based drugs for cancer. They already have an approved anti-cancer drug, Cometriq. The company is currently involved in 50 clinical trials and currently has four other anti-cancer therapies in the pipeline. The company has years of experience in the field and is listed on the S&amp;P 400. If research in genetic engineering increases in the coming years, you have a company that is well positioned in this field. </p>\n\n<p>About the numbers: </p>\n\n<p>In the first half of 2019, revenue was $455.77M. In the first half of 2020, it was 486.38M USD. So, the company shows a small growth. What is noteworthy here is that Exelixis is in the black because of the drugs they have already approved. They were able to turn losses into profits in 2016 and have been cash flow positive ever since. </p>\n\n<p>Conclusion:</p>\n\n<p>Exelixis reinvests a lot of their money back into research and still remains profitable despite large reinvestments. From the list, this company is probably the most conservative with the least risk of loss. An already profitable company that is listed on the S&amp;P 400, but still has huge growth potential as it has a wide head start with genomics expertise.</p>\n\n<p><strong>4. MorphoSys</strong></p>\n\n<p>MOR</p>\n\n<p>Market Cap: 3.759B</p>\n\n<p>MorphoSys develops biopharmaceutical drugs. The company focuses on cancer as well as inflammatory diseases. However, the Company focuses not only on drug discovery itself, but also on the technologies and intelligent development strategies themselves. MorphoSys already has two approved products on the market and three proprietary antibodies. The company is broadly positioned with their technology platforms in the market and also licenses them out to academic institutions and biopharmaceutical companies for research. Similar to the former candidate on this list, MorphoSys is therefore a multi-talented company that is both a software and a research company. In addition, MorphoSys already has approved compounds that provide the company with a financial cushion. </p>\n\n<p>About the numbers:</p>\n\n<p>MorphoSys was able to show revenues of EUR 48.2M in the first half of 2019. However, this multiplied to EUR 269.7M in the first half of 2020. (These figures are in euros, as I took them from MorphoSys&#39;s German balance sheets). Losses turned from EUR -28.5M in the first half of 2019 to profits of EUR 179.8M in the first half of 2020. </p>\n\n<p>Conclusion:</p>\n\n<p>If this trend continues, MorphoSys is currently an undervalued company. The approaches the company is taking are similar to those of Wuxi Biologics. MorphoSys has proprietary software that it combines with research and development while contracting it out to others. In doing so, the company is one of very few others that is working on autoimmune diseases in addition to cancer. From the list of companies I selected, this is definitely my favorite, along with a penny stock that is not mentioned in this subreddit.</p>\n\n<p><strong>5. NantKwest</strong></p>\n\n<p>NK</p>\n\n<p>Market Cap: 2.914B</p>\n\n<p>NantKwest is a company that focuses on the treatment of cancer and a few other diseases. Of note here is that NantKwest is taking a unique approach that I have not seen in any other of the 140 biotech companies. NantKwest has built its own cell-based platform through which they can introduce genetic material into cancer cells or cells affected by infections. The company itself calls it &quot;Natural killer cells: the quest toward a cure.&quot; It&#39;s an approach that is so impressive and, according to the clinical studies, works well. So we are talking about vaccines. Of the 13 therapeutic approaches the company has in the pipeline, 5 are in clinical trials. The cancer vaccine approach is just too interesting for me to pass over this company.</p>\n\n<p>About the numbers:</p>\n\n<p>NantKwest, as mentioned several times now, has negative EPS common in biotech. However, since 2016, EPS has improved from -1.47 USD to -0.7 USD in 2019. Revenue increased from $12K in the first half of 2019 to $30K in the first half of 2020. These are by far the smallest numbers and this is certainly where hope for the company&#39;s approach lies behind the large market cap.</p>\n\n<p>Conclusion:</p>\n\n<p>A vaccine against cancer would be incredible. NantKwest&#39;s cells are already being tested and the potential seems to be there. The company could have a promising future, but remains (at least of the companies on the list with a market cap over $1B) the riskiest investment method. Which, however, is in a company with a really great approach that I just like.</p>\n\n<h1>Final words</h1>\n\n<p>Now that was some text. But I thought it&#39;s quite nice to read a different DD here than just posts about GME.</p>\n</div><!-- SC_ON -->",
  "score": 748,
  "permalink": "/r/stocks/comments/lg3ea5/i_took_a_look_at_140_biotech_companies_these_are/",
  "subreddit": "stocks",
  "id": "lg3ea5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1613123203796
}