{
  "author": "gnarley_quinn",
  "original_created_utc": 1652014232,
  "title": "Five months ago, I combed through all the posts here to find the subs most despised coins. I combined into a single awful folio. This is an update on the FOLIO OF HATE. How much do you want it to fail? Does it still make you angry?",
  "created_utc": 1652028181,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Good morning all,&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re in a bear market. Shit sucks. But that doesn&amp;#39;t mean we can&amp;#39;t still have some fun right?&lt;/p&gt;\n\n&lt;p&gt;For those that were around at the beginning of the year, you might remember that I created this. The FOLIO OF HATE. I invested (yolo&amp;#39;d?) $100 into this subs most hated coins. Some coins are hated because of utility, some because of corruption, some because of the the shills. Whatever the reason, I decided to act on the theory that this sub can actually pick winners by investing into the ones that we all hate the most.&lt;/p&gt;\n\n&lt;p&gt;So, $100 was invested on the same day to each of the ten coins/tokens. Here is how it fared.&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/nfz7ezwmz8y81.png?width=991&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=d0ac739a8375280fe14e47eb7564c5a1d6d7fc0e\"&gt;Folio of Hate&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Down 46% or $460 in five months.&lt;/p&gt;\n\n&lt;p&gt;What about the individual results? Surely they&amp;#39;re not all bad? Right?&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Best performer:&lt;/strong&gt; USDT -0.01 %&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Worst performer:&lt;/strong&gt; LRC -70.13 %&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Surprise Performer:&lt;/strong&gt; DOGE -31.01%&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://preview.redd.it/mbx8ck2j09y81.png?width=1007&amp;amp;format=png&amp;amp;auto=webp&amp;amp;s=87d85fccc2bb402f75ac9b570a37b9cd73b866ec\"&gt;Folio of Hate Individual Performance&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Personal points of interest:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Investing in Dogecoin - yes Dogecoin - was a better investment than Solana, Cardano, Ripple and Binance.&lt;/li&gt;\n&lt;li&gt;Safemoon was not the predicted worst performer ...yet.&lt;/li&gt;\n&lt;li&gt;Tether - FUCKING TETHER - was the folios best performer. Props to &lt;a href=\"/u/entschida\"&gt;u/entschida&lt;/a&gt; for getting that one right.&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;I am aware that perceptions and opinions shift over time, so it is of course possible that we hate these coins more than ever. Oh, and fuck you Crypto.com&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;p&gt;Original post from &lt;a href=\"https://np.reddit.com/r/CryptoCurrency/comments/rng996/here_it_is_the_subs_most_despised_coins_combined/\"&gt;five months ago&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Well after a long and exhaustive battle of coins being shilled in just a couple of hours, I have found the list of the subs most hated coins. There was definitely a lot of hate out there. I put $100 into each and stored it on a seperate group of wallets to my real bags. To make it easier to track, I create the folio of hate using coinmarketcap to track them more easily. I&amp;#39;ll post the updates every month and hope to see some big gains going against us all (even my most hated coin is in this group).  &lt;/p&gt;\n\n&lt;p&gt;There was a lot of hate from users, towards some coins more so than others. The two most hated were the most hated by a very long way. Merry Christmas everyone!  &lt;/p&gt;\n\n&lt;p&gt;The final list in order of most votes and comments is listed in the comment below because the filter won&amp;#39;t let me create a post with that many coin names in it.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/CryptoCurrency/comments/ul10rr/five_months_ago_i_combed_through_all_the_posts/",
  "subreddit": "CryptoCurrency",
  "id": "ul10rr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Good morning all,\n\nWe're in a bear market. Shit sucks. But that doesn't mean we can't still have\nsome fun right?\n\nFor those that were around at the beginning of the year, you might remember that\nI created this. The FOLIO OF HATE. I invested (yolo'd?) $100 into this subs most\nhated coins. Some coins…",
  "localize": [
    {
      "locale": "ja",
      "title": "5ヶ月前、私はここに投稿されたすべての記事を調べ、最も軽蔑されるコインのサブを探しました。私はそれを1つのひどいフォリオにまとめました。これは「憎しみのフォリオ」の更新版です。どれだけ失敗してほしいですか？あなたはまだ怒っていますか？",
      "the_new_excerpt": "皆さん、おはようございます。\n\n我々は弱気市場にいる。最悪です。しかし、それは我々がまだ持っていないことを意味するものではありません。\n楽しみがないわけではありません。\n\n今年の始めにいた人は覚えているかもしれませんが\n私はこれを作りました。FOLIO OF HATE（憎悪のポートフォリオ）」です。私は100ドルをこの最も嫌われているコインに投資しました（ヨロシク）。\nを投資しました。いくつかのコインは..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家早上好。\n\n我们正处于熊市。糟透了。但这并不意味着我们不能仍然有\n一些乐趣，对吗？\n\n对于那些在今年年初的人，你可能记得\n我创建了这个。憎恨的文件夹。我投资了（Yolo'd？）100美元到这个子的最\n讨厌的硬币。有些钱币...",
      "title": "五个月前，我梳理了这里的所有帖子，以找到最被人看不起的次品硬币。我将其合并为一个可怕的对开本。这是对 \"憎恨的对开本 \"的更新。你有多想让它失败？它还会让你生气吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家早上好。\n\n我們正處於熊市。糟透了。但這並不意味着我們不能仍然有\n一些樂趣，對嗎？\n\n對於那些在今年年初的人，你可能記得\n我創建了這個。憎恨的文件夾。我投資了（Yolo'd？）100美元到這個子的最\n討厭的硬幣。有些錢幣...",
      "title": "五個月前，我梳理了這裏的所有帖子，以找到最被人看不起的次品硬幣。我將其合併爲一個可怕的對開本。這是對 \"憎恨的對開本 \"的更新。你有多想讓它失敗？它還會讓你生氣嗎？"
    }
  ]
}