{
  "author": "gnarley_quinn",
  "original_created_utc": 1627278576,
  "title": "Yesterday, I bought BTC. Today it climbed 10% meaning I can manipulate the market. Ask me anything.",
  "created_utc": 1627288391,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Yesterday, I bought BTC. Today it climbed 10%. </p>\n\n<p>Was it a fluke? No, I felt it. It was coming. Everybody here told me so. I believed you. And I believed the other guy who knew what he was talking about. I know a little bit of shit about a lot of fuck. Except there was that one time? The time I manipulated the market in the opposite direction. Does this make me a whale? I do like whales. </p>\n\n<p>I didn&#39;t realise I had this power until now. What should I do with this power?  What would you do with it?</p>\n</div><!-- SC_ON -->",
  "score": 355,
  "permalink": "/r/CryptoCurrency/comments/orsj8c/yesterday_i_bought_btc_today_it_climbed_10/",
  "subreddit": "CryptoCurrency",
  "id": "orsj8c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Yesterday, I bought BTC. Today it climbed 10%.\n\nWas it a fluke? No, I felt it. It was coming. Everybody here told me so. I\nbelieved you. And I believed the other guy who knew what he was talking about. I\nknow a little bit of shit about a lot of fuck. Except there was that one time?\nThe time I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "昨日、BTCを買いました。今日は10％上昇しました。\n\nこれはまぐれだったのか？いや、感じたのだ。それは来ていた。ここにいる誰もがそう言っていました。I\nあなたを信じていました。そして、自分の言っていることを理解しているもう一人の男を信じた。I\n沢山のクソについて少しは知っている。一度だけを除いて？\nあの時は...",
      "title": "昨日、BTCを買いました。今日は10％上昇したので、市場を操作することができます。何でも聞いてください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "昨天，我买了BTC。今天它攀升了10%。\n\n这是个侥幸吗？不，我感觉到了。它即将到来。这里的每个人都这么告诉我。I\n相信你。我也相信另一个知道自己在说什么的人。I\n我对很多事情都知道得一清二楚。除了有那么一次？\n那次我...",
      "title": "昨天，我买了BTC。今天它攀升了10%，意味着我可以操纵市场。问我任何事情。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "昨天，我買了BTC。今天它攀升了10%。\n\n這是個僥倖嗎？不，我感覺到了。它即將到來。這裏的每個人都這麼告訴我。I\n相信你。我也相信另一個知道自己在說什麼的人。I\n我對很多事情都知道得一清二楚。除了有那麼一次？\n那次我...",
      "title": "昨天，我買了BTC。今天它攀升了10%，意味着我可以操縱市場。問我任何事情。"
    }
  ]
}