{
  "author": "NonSecwitter",
  "original_created_utc": 1657770726,
  "title": "Did ancient people have a concept that while it was dark \"here\" it was light \"somewhere else\", or was everything uniformly light and dark?",
  "created_utc": 1657807076,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sitting in my back yard staring at the stars and moon and started thinking about light shining on the other side of the world, and how people are awake there.&lt;/p&gt;\n\n&lt;p&gt;Is this concept new to the modern era, or have people somehow imagined different people experiencing night and day at different times, even without the concept of a spherical, spinning planet?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 114,
  "permalink": "/r/AskHistorians/comments/vyme5n/did_ancient_people_have_a_concept_that_while_it/",
  "subreddit": "AskHistorians",
  "id": "vyme5n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm sitting in my back yard staring at the stars and moon and started thinking\nabout light shining on the other side of the world, and how people are awake\nthere.\n\nIs this concept new to the modern era, or have people somehow imagined different\npeople experiencing night and day at different times,…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は自宅の裏庭で星と月を見つめていて、こう思い始めたんです。\n地球の裏側で輝いている光について、そして人々がそこでどのように目覚めているのか、考え始めた。\nと考えるようになりました。\n\nこの概念は現代に始まったことなのか、それとも、人々はいつの間にか別の世界を想像していたのか。\n昼と夜の時間帯が異なることを想像していたのだろうか。",
      "title": "古代の人々は、「ここ」は暗いが「どこか」は明るいという概念を持っていたのでしょうか。それとも、すべてが一様に明暗を分けていたのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我坐在我的后院里盯着星星和月亮，开始思考\n想到世界另一端的光亮，以及那里的人们是如何觉醒的。\n在那里。\n\n这个概念对现代人来说是新的，还是人们以某种方式想象出不同的\n人们在不同的时间经历黑夜和白天，...",
      "title": "古代人是否有这样的概念：当 \"这里 \"是黑暗的时候，\"其他地方 \"是光明的，还是一切都统一为光明和黑暗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我坐在我的後院裏盯着星星和月亮，開始思考\n想到世界另一端的光亮，以及那裏的人們是如何覺醒的。\n在那裏。\n\n這個概念對現代人來說是新的，還是人們以某種方式想象出不同的\n人們在不同的時間經歷黑夜和白天，...",
      "title": "古代人是否有這樣的概念：當 \"這裏 \"是黑暗的時候，\"其他地方 \"是光明的，還是一切都統一爲光明和黑暗？"
    }
  ]
}