{
  "author": "Set1Less",
  "the_new_excerpt": "At $215 per Filecoin, its current fully diluted market cap is greater than\nseveral established companies that provide services to millions of people. OTOH\nno one seems to be using filecoin for anything substantial. Its value seems to\nbe skyrocketing from speculation and momentum, but devoid of…",
  "original_created_utc": 1617258603,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "以每枚Filecoin215美元计算，其目前全面摊薄的市值大于\n几个成熟的公司，为数百万人提供服务。另一方面\n似乎没有人使用filecoin做任何实质性的事情. 它的价值似乎\n因炒作和势头而暴涨，但缺乏... ...",
      "title": "Filecoin的完全摊薄市值是4170亿美元，比沃尔玛、迪士尼、万事达卡还大。对于一个似乎没有人使用的产品。所有Filecoin代币的归属都将进入流通供应。在跳上这趟列车之前，请三思而行"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以每枚Filecoin215美元計算，其目前全面攤薄的市值大於\n幾個成熟的公司，爲數百萬人提供服務。另一方面\n似乎沒有人使用filecoin做任何實質性的事情. 它的價值似乎\n因炒作和勢頭而暴漲，但缺乏... ...",
      "title": "Filecoin的完全攤薄市值是4170億美元，比沃爾瑪、迪士尼、萬事達卡還大。對於一個似乎沒有人使用的產品。所有Filecoin代幣的歸屬都將進入流通供應。在跳上這趟列車之前，請三思而行"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "ファイルコイン1個あたり215ドルで、現在の完全に希釈された時価総額は、いくつかの既存の企業よりも大きいです。\n何百万人もの人々にサービスを提供している既存の企業数社よりも大きい。一方で\n誰もファイルコインを実質的なものに使っていないようです。その価値は\nその価値は、推測と勢いで急上昇しているように見えますが、何もありません...。",
      "title": "ファイルコインの完全希薄化後のマーケットキャップは417億ドルで、ウォルマート、ディズニー、マスターカードよりも大きい。誰も使っていないような製品のために。すべてのファイルコイン・トークンは固定されており、流通しています。この列車に飛び乗る前によく考えてください"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "ファイルコイン1個あたり215ドルで、現在の完全に希釈された時価総額は、いくつかの既存の企業よりも大きいです。\n何百万人もの人々にサービスを提供している既存の企業数社よりも大きい。一方で\n誰もファイルコインを実質的なものに使っていないようです。その価値は\nその価値は、推測と勢いで急上昇しているように見えますが、何もありません...。",
      "title": "ファイルコインの完全希薄化後のマーケットキャップは417億ドルで、ウォルマート、ディズニー、マスターカードよりも大きい。誰も使っていないような製品のために。すべてのファイルコイン・トークンは固定されており、流通しています。この列車に飛び乗る前によく考えてください"
    }
  ],
  "title": "Filecoin's fully diluted marketcap is $417 Billion, greater than Walmart, Disney, Mastercard. For a product that no one seems to be using. All the Filecoin tokens are vesting will enter circulating supply. Think twice before jumping onto this train",
  "created_utc": 1617273032,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>At $215 per Filecoin, its current fully diluted market cap is greater than several established companies that provide services to millions of people. OTOH no one seems to be using filecoin for anything substantial. Its value seems to be skyrocketing from speculation and momentum, but devoid of fundamentals, the narrative can change quickly. </p>\n\n<p>Filecoin&#39;s Fully diluted marketcap at $417 Bn  is twice of Ethereum&#39;s marketcap.  </p>\n\n<p>Most of FIL&#39;s supply is vested and being slowly released to early participants, ICO investors etc. </p>\n\n<p>If you are thinking about investing in FIL at this elevated level, you should consider all the aspects before jumping in.</p>\n</div><!-- SC_ON -->",
  "score": 2986,
  "permalink": "/r/CryptoCurrency/comments/mhpaar/filecoins_fully_diluted_marketcap_is_417_billion/",
  "subreddit": "CryptoCurrency",
  "id": "mhpaar",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617961873804
}