{
  "author": "cwm9",
  "original_created_utc": 1646956552,
  "title": "Explain to me how Terra/Luna is not a scam",
  "created_utc": 1646987992,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was interested in investing in Terra after heading about it, but after doing basic early research, I now have big qualms. Help me understand why I&amp;#39;m wrong... Or confirm my concerns.&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s the problem I have with Terra:&lt;/p&gt;\n\n&lt;p&gt;Assume I own the entirety of Terra at the start and there are only UST Terra.&lt;/p&gt;\n\n&lt;p&gt;Suppose 1 Luna = 1 USD and there are 2 Luna in existence.&lt;/p&gt;\n\n&lt;p&gt;Suppose 1 UST = 1.01 USD and there is 1 UST in existence.&lt;/p&gt;\n\n&lt;p&gt;My Terra+Luna+usd universe is worth $3.01.&lt;/p&gt;\n\n&lt;p&gt;Now suppose to peg UST, I burn 1 Luna and mint 1 UST and sell it.&lt;/p&gt;\n\n&lt;p&gt;I get:&lt;/p&gt;\n\n&lt;p&gt;1 Luna &amp;gt; 1 USD (it&amp;#39;s claimed, since supply went down)&lt;/p&gt;\n\n&lt;p&gt;1 UST = 1 USD&lt;/p&gt;\n\n&lt;p&gt;1.01 USD&lt;/p&gt;\n\n&lt;p&gt;The total value of my universe must now be worth &amp;gt;$3.01, if the claim that the value of Luna rises is true.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;All I did was sell a token for the price it was worth, and suddenly it&amp;#39;s claimed that the net worth of my universe is now  greater than it was.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;It makes no sense to me that minting a UST token by moving value from one pool to another should yield created value in the pool that had value &lt;em&gt;taken from it&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;This smells to me of a complicated, well obsfucated, ponzi scheme.&lt;/p&gt;\n\n&lt;p&gt;The more UST you mint, the less Luna there is. The drop in total minted Luna makes people *think* Luna should be worth more, so they buy it.  In reality the total network includes both Luna AND Terra and the value of Luna shouldn&amp;#39;t have changed at all.&lt;/p&gt;\n\n&lt;p&gt;But go the other way: when people start selling their UST because they want to go back to bitcoin, they mint Luna and sell it. Now the price of Luna goes down. The fact that the price is going down and total coins minted is rising encourages the selling of Luna making the price drop farther. If the price drops too far, it can no longer support the burning of UST to get a dollar by selling Luna.&lt;/p&gt;\n\n&lt;p&gt;As far as I can tell, buyers of Luna are basically the pansies that are paying for the exit of UST bag holders.  Once people don&amp;#39;t want to buy Luna, any remaining Luna and UST holders are screwed.&lt;/p&gt;\n\n&lt;p&gt;It seems to be that as fast as Luna is rising, that&amp;#39;s how fast it can fall.&lt;/p&gt;\n\n&lt;p&gt;Explain to me how this isn&amp;#39;t true.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 322,
  "permalink": "/r/CryptoCurrency/comments/tbcrkh/explain_to_me_how_terraluna_is_not_a_scam/",
  "subreddit": "CryptoCurrency",
  "id": "tbcrkh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was interested in investing in Terra after heading about it, but after doing\nbasic early research, I now have big qualms. Help me understand why I'm wrong...\nOr confirm my concerns.\n\nHere's the problem I have with Terra:\n\nAssume I own the entirety of Terra at the start and there are only UST…"
}