{
  "author": "seansy5000",
  "the_new_excerpt": "Something I’ve learned over the past few years dealing with crypto is to pull\nyour profits and keep them in stable coin or whatever currency you’re buying\nwith in order to take advantage of big dips like we’ve seen over the last few\ndays.\n\nI’m not a big investor but my one full ETH was made possible…",
  "original_created_utc": 1619193615,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去数年間、暗号を扱ってきて学んだことは、利益を引き出して、安定したコインや購入した通貨に保管することです。\n利益を安定したコインや購入している通貨で維持することです。\nここ数日のような大きなディップを利用するために、利益を引き出して、安定したコインや購入している通貨に保管することです。\nです。\n\n私は大した投資家ではありませんが、私の満額のETHは実現しました...",
      "title": "ディップを利用して、1ETHに必要な残りの0.18をようやく手に入れました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几年里，我在处理加密货币方面学到的东西是，把你的利润拉出来，放在稳定的硬币或你购买的任何货币中。\n你的利润，并将其保留在稳定的硬币或任何你购买的货币中\n以便利用像我们在过去几天看到的大跌的机会。\n天所看到的那种大跌。\n\n我不是一个大的投资者，但我的一个完整的ETH是可能...",
      "title": "趁着下跌的机会，我终于得到了1个ETH所需的剩余0.18美元。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾年裏，我在處理加密貨幣方面學到的東西是，把你的利潤拉出來，放在穩定的硬幣或你購買的任何貨幣中。\n你的利潤，並將其保留在穩定的硬幣或任何你購買的貨幣中\n以便利用像我們在過去幾天看到的大跌的機會。\n天所看到的那種大跌。\n\n我不是一個大的投資者，但我的一個完整的ETH是可能...",
      "title": "趁着下跌的機會，我終於得到了1個ETH所需的剩餘0.18美元。"
    }
  ],
  "title": "Took advantage of the dip to finally get the remaining .18 I needed for 1 ETH",
  "created_utc": 1619204170,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Something I’ve learned over the past few years dealing with crypto is to pull your profits and keep them in stable coin or whatever currency you’re buying with in order to take advantage of big dips like we’ve seen over the last few days.</p>\n\n<p>I’m not a big investor but my one full ETH was made possible by doing this. When you’re pulling $20 here and $50 there it doesn’t seem like a lot, but when we’re bullish like we have been for the last year or so it really adds up. It’s always good to have some sort of stable crypto/fiat to use when the market tanks. </p>\n\n<p>The people who make the most off this buy when everyone else is selling. Something to think about.</p>\n</div><!-- SC_ON -->",
  "score": 1372,
  "permalink": "/r/CryptoCurrency/comments/mwyid1/took_advantage_of_the_dip_to_finally_get_the/",
  "subreddit": "CryptoCurrency",
  "id": "mwyid1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776208803
}