{
  "author": "Anci3ntMarin3r",
  "original_created_utc": 1655583846,
  "title": "The crash scares me.",
  "created_utc": 1655614158,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I entered the crypto market last summer during the crash. I invested in projects that I researched or those that I believed in. So no shit coins and vaporwaves in my portfolio except may be ADA but we’ll see how that turns out.&lt;/p&gt;\n\n&lt;p&gt;I’ve not invested a sum that I cannot afford to lose and it’s not like my livelihood will come under risk because of this crash.&lt;/p&gt;\n\n&lt;p&gt;But I do feel scared being in my first crypto bear market. I do not plan on selling and have moved my coins from exchanges. Yet I feel scared. For the first time seeing those price drops literally scares me.&lt;/p&gt;\n\n&lt;p&gt;I’m not planning on getting out but I’ve learned some hard lessons like take profits on your alts and don’t get greedy. And also never be married to a position.&lt;/p&gt;\n\n&lt;p&gt;Previous bear market survivors did you feel the same during your first bear market?&lt;/p&gt;\n\n&lt;p&gt;Also other people in a similar position to me keep strong.&lt;/p&gt;\n\n&lt;p&gt;Edit: Thanks to the person who referred to to suicide watch. However, I’m definitely not in that state of mind. So no worries. Just felt bad looking at all that value just straight up decrease day after day.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 310,
  "permalink": "/r/CryptoCurrency/comments/vfeits/the_crash_scares_me/",
  "subreddit": "CryptoCurrency",
  "id": "vfeits",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I entered the crypto market last summer during the crash. I invested in projects\nthat I researched or those that I believed in. So no shit coins and vaporwaves\nin my portfolio except may be ADA but we’ll see how that turns out.\n\nI’ve not invested a sum that I cannot afford to lose and it’s not like…"
}