{
  "author": "anieee1188",
  "the_new_excerpt": "My First Stock Due Diligence Research (Facebook)\n\nHey all! I'm pretty new to the investing community and finally had the\nmotivation to actually do my own due diligence. I'm aware I'm a newbie so I\nstarted with an easy company to research, Facebook. Please feel free to leave\nany kind of feedback and…",
  "original_created_utc": 1618705613,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "はじめての株式デューデリジェンス調査（Facebook編\n\n皆さん、こんにちは。私は投資の世界ではかなりの新参者で、ようやく自分でデューデリジェンスをする気になりました。\n実際に自分でデューデリジェンスをする気になりました。私は自分が初心者であることを自覚しています。\nフェイスブックという簡単な会社から始めました。ご意見、ご感想などございましたら、お気軽にお寄せください。\nご意見・ご感想をお聞かせください。",
      "title": "初めての銘柄デューデリジェンスリサーチ（Facebook"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的第一只股票尽职调查(Facebook)\n\n大家好！我是投资界的新手，终于有了。\n的动力，真正做到自己的尽职调查。我知道我是个新手，所以我。\n从一个容易研究的公司--Facebook开始。请随时留下\n任何形式的反馈和...",
      "title": "我的第一只股票尽职调查(Facebook)"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的第一隻股票盡職調查(Facebook)\n\n大家好！我是投資界的新手，終於有了。\n的動力，真正做到自己的盡職調查。我知道我是個新手，所以我。\n從一個容易研究的公司--Facebook開始。請隨時留下\n任何形式的反饋和...",
      "title": "我的第一隻股票盡職調查(Facebook)"
    }
  ],
  "title": "My first stock Due Diligence Research (Facebook)",
  "created_utc": 1618742955,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My First Stock Due Diligence Research (Facebook)</p>\n\n<p>Hey all! I&#39;m pretty new to the investing community and finally had the motivation to actually do my own due diligence. I&#39;m aware I&#39;m a newbie so I started with an easy company to research, Facebook. Please feel free to leave any kind of feedback and suggestions for how I can improve my DD, any feedback will be much appreciated! (I am NOT a financial advisor).</p>\n\n<p><strong>What is Facebook?</strong></p>\n\n<ul>\n<li>Mark Zuckerberg, current CEO launched FB in 2004 and first went into IPO at roughly $38 per share on May 2012.</li>\n<li>Facebook&#39;s Mission: &quot;Our mission is to give people the power to built community and bring the world closer together.&quot;</li>\n<li>Facebook wants to built engaging products to enable people to connect and share with friends, family, and groups through personal devices. They want to help people discover new interests and learn about the world around them through people&#39;s opinions, ideas, photos, videos, and activities with their audience from their friends to the open public. </li>\n</ul>\n\n<p><strong>What are their products?</strong></p>\n\n<ul>\n<li>Facebook\n\n<ul>\n<li>social networking site that allows people to connect, share, discover, and communicate with friends and family online.</li>\n</ul></li>\n<li>Instagram\n\n<ul>\n<li>Social media network used as a photo sharing platform allows people to share photos, videos, and go live with their followers as a community and to discover new interests.</li>\n</ul></li>\n<li>Messenger\n\n<ul>\n<li>instant messaging application built on top of Facebook for people to connect to send messages to friends, family, and groups.</li>\n</ul></li>\n<li>WhatsApp\n\n<ul>\n<li>private messaging application used by people globally to text messages, voice messages, make voice and video calls and share a wide range of media.</li>\n</ul></li>\n<li>Oculus\n\n<ul>\n<li>Hardware, software, and developer brand centered around making products for consumers to experience virtual and mixed reality experiences to bring people together around the world to connect through virtual reality.</li>\n</ul></li>\n</ul>\n\n<p><strong>How does Facebook make money?</strong></p>\n\n<ul>\n<li>revenue comes from selling advertising to marketers.</li>\n<li>advertisements enable marketers to reach out to individuals based on age, gender, location, interests, and user behavior.</li>\n<li>other revenue comes from Facebook&#39;s hardware and software products, such as Oculus.</li>\n</ul>\n\n<p><strong>Pros?</strong></p>\n\n<ul>\n<li>leading social media platforms</li>\n<li>strong brand name</li>\n<li>strong advertising business</li>\n<li>effective marketing</li>\n<li>diversified business </li>\n</ul>\n\n<p><strong>Cons?</strong></p>\n\n<ul>\n<li>user privacy concerns</li>\n<li>most of revenue comes from advertising</li>\n<li>highly competitive environment</li>\n<li>FB banned in China, Iran, and other countries which could potentially increase FB&#39;s revenue</li>\n</ul>\n\n<p><strong>Competitors? (based on the most recent info.)</strong></p>\n\n<ul>\n<li>Apple\n\n<ul>\n<li>According to Zuckerberg, apple is Facebook&#39;s biggest competitor.</li>\n<li>apple will implement option for its users whether they want to share their information for ad-tracking</li>\n<li>restricting facebook&#39;s ability to track data may impact their advertising revenues.</li>\n<li>iMessage vs facebook messaging platforms</li>\n</ul></li>\n<li>Google\n\n<ul>\n<li>YouTube is leading second after Facebook for active social media users.</li>\n<li>YouTube generated $6885 million of advertising revenue worldwide in Q4&#39;20 compared to $3605 in Q4&#39;18.</li>\n<li>currently 1.78 billion YouTube users in 2019 and forecasted global users of 1.86 billion in 2021.</li>\n</ul></li>\n<li>Sony\n\n<ul>\n<li>competition in VR headsets with Oculus </li>\n</ul></li>\n</ul>\n\n<p><strong>Market Stats.</strong></p>\n\n<ul>\n<li>Roughly 65% daily active users</li>\n<li>2.7 billion monthly users</li>\n<li>$28,072 million revenue generated in Q4&#39;20</li>\n<li>$855 million revenue generated NOT from advertising</li>\n<li>Q4 Net income of $11,219 million</li>\n</ul>\n\n<p><strong>Social Media Users Comparison (Jan. 2021)</strong></p>\n\n<ul>\n<li>Facebook (2740 Million)</li>\n<li>YouTUbe (2291)</li>\n<li>WhatsApp (2000)</li>\n</ul>\n\n<p><strong>Why and it experiencing growth?</strong></p>\n\n<ul>\n<li>Continuing growth from users using social media platforms and monetization from ad revenues</li>\n<li>social media is a popular digital activity globally to connect with people and increasings its presence through mobile device usage.</li>\n</ul>\n\n<p><strong>What will the business look in the next few years?</strong></p>\n\n<ul>\n<li>I think facebook will continue to experience growth in their social media platforms as increasing number of people are accessing the internet and increasing usage of mobile phones across the world.</li>\n<li>I also think Oculus with their VR products could possibly expand in the near future as the video game industry is worth $60.4 billion in the US, Oculus may have the potential to expand to provide capabilities in training learnings and sharing in the healthcare business and other industries.<br/></li>\n</ul>\n\n<p><strong>Does the business maintain a healthy balance sheet, and maintain enough cashflow?</strong></p>\n\n<ul>\n<li>FCF of $3,318 million in Q4&#39;20 compared to FCF of $9,222 of Q4&#39;20.</li>\n<li>Shares outstanding are at an average of 2.8 billion shares from 2019 to present. In the past its higher shares outstanding reached a high of 2.9 billion in September 2017.  The decreasing of shares shows that each share of stock is worth more than it was in sept. 2017 and the company is possibly buying back its share to reduce the outstanding shares.</li>\n<li>FCF looks strong, increasingly more FCF over the last few years.</li>\n</ul>\n\n<p><strong>How does management allocate capital?</strong></p>\n\n<ul>\n<li>The management seems to do well to allocate its capital to generate a net income of $11,219 million in Q4&#39;2020 when comparing to $6,882 in Q4&#39;18.</li>\n<li>Their operating margin is at 46% in Q4&#39;20 and also 46% in Q4&#39;18 shows the management is maintaining a good level to utilize their cash to generate profit through their daily operations and at the same time increasing more of their net income was the same operating margin levels in Q4&#39;18.</li>\n<li>Management has been consistently owned more assets than liabilities even during their early days in the market, shows that the management play it safe with their capital.</li>\n</ul>\n\n<p><strong>Does the business trade at a premium or a discount?</strong></p>\n\n<ul>\n<li>Facebook&#39;s current valuation is at a PE of 30.97 compared to the average of NASDAQ PE of 34.83.</li>\n<li>Past PE went to a high of 90.64 and went down in 2017 and stayed consistent at PE of 20-30 range</li>\n<li><p>when comparing Facebook&#39;s PC to the past, it looks more overvalued in the past than it is today, it think today it is a relatively fair price.</p></li>\n<li><p>Summary</p></li>\n<li><p>I think with Facebook&#39;s high growth it is experiencing right now is very good since I believe social media platforms will always be around as long as the internet is here to stay. I believe Facebook has a very strong brand as they are the the biggest leader in social media platforms to create certain algorithms for users to keep them using their products. This really shows their strong-marketing skills and getting those ad revenues.  With facebook acquiring Oculus a few years ago, they can definitely expand that brand into something more than just VR but to also use it for training in business and healthcare industry. However, they do face competition with Sony&#39;s playstation VR headset but the gaming industry is definitely going to grow in the next few years. At Facebook&#39;s current valuation PE of 30.97 I think it is sustainable and its forward PE is even lower which makes me feel a little more optimistic. However, some downsides of Facebook is the highly competitive environment they are in. According to Zuckerberg, Apple is Facebook&#39;s biggest competitor as Apple will be allowing users an option whether they want to share their information for ad-tracking. This could be a problem for Facebook if they are getting less information for ad-tracking which may impact their revenues, and most of their revenues do come from ads.</p></li>\n</ul>\n</div><!-- SC_ON -->",
  "score": 47,
  "permalink": "/r/stocks/comments/mt2jj5/my_first_stock_due_diligence_research_facebook/",
  "subreddit": "stocks",
  "id": "mt2jj5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171526206
}