{
  "author": "Trevigol",
  "original_created_utc": 1645771724,
  "title": "If you think Bitcoin needs government control, you're getting brainwashed",
  "created_utc": 1645804000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the last weeks I&amp;#39;m seeing a lot of people saying Bitcoin should be somehow controlled by the US government, because thanks to crypto, Putin could evade sanctions. Same things were said about the convoy protest in Canada. &lt;/p&gt;\n\n&lt;p&gt;I know most users joined crypto just to make some money, but Bitcoin was created for something greater than make you wish a lambo.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin was created in order to give freedom to the whole world.&lt;/p&gt;\n\n&lt;p&gt;Most of you are Americans and you think your government should control Bitcoin, but btc is not American, it&amp;#39;s not yours. Bitcoin is for everyone. Bitcoin is for the people all around the world.&lt;/p&gt;\n\n&lt;p&gt;If the US wants to really sanction Russia, they have better and easier ways. Just look at what they did to the Chinese Huawei. It was the 3rd biggest smartphone seller in Europe and now it basically disappeared after it got sanctioned.&lt;/p&gt;\n\n&lt;p&gt;Do you think the west should kick Russia out from swift? Great idea. Do you know who will suffer more about it? Regular people in Russia who maybe are saving money because they hate their government and they want to leave their country, but now they won&amp;#39;t be able because they can&amp;#39;t transfer their money from their Russian bank account to another country.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin fixes this.&lt;/p&gt;\n\n&lt;p&gt;Governments can fight, can give each other sanctions, can do a lot of things, but they shouldn&amp;#39;t be able to touch people&amp;#39;s money, and that&amp;#39;s why Bitcoin was created.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/t0xf7k/if_you_think_bitcoin_needs_government_control/",
  "subreddit": "CryptoCurrency",
  "id": "t0xf7k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the last weeks I'm seeing a lot of people saying Bitcoin should be somehow\ncontrolled by the US government, because thanks to crypto, Putin could evade\nsanctions. Same things were said about the convoy protest in Canada.\n\nI know most users joined crypto just to make some money, but Bitcoin was…"
}