{
  "author": "Trevigol",
  "original_created_utc": 1645771724,
  "title": "If you think Bitcoin needs government control, you're getting brainwashed",
  "created_utc": 1645804000,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;In the last weeks I&amp;#39;m seeing a lot of people saying Bitcoin should be somehow controlled by the US government, because thanks to crypto, Putin could evade sanctions. Same things were said about the convoy protest in Canada. &lt;/p&gt;\n\n&lt;p&gt;I know most users joined crypto just to make some money, but Bitcoin was created for something greater than make you wish a lambo.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin was created in order to give freedom to the whole world.&lt;/p&gt;\n\n&lt;p&gt;Most of you are Americans and you think your government should control Bitcoin, but btc is not American, it&amp;#39;s not yours. Bitcoin is for everyone. Bitcoin is for the people all around the world.&lt;/p&gt;\n\n&lt;p&gt;If the US wants to really sanction Russia, they have better and easier ways. Just look at what they did to the Chinese Huawei. It was the 3rd biggest smartphone seller in Europe and now it basically disappeared after it got sanctioned.&lt;/p&gt;\n\n&lt;p&gt;Do you think the west should kick Russia out from swift? Great idea. Do you know who will suffer more about it? Regular people in Russia who maybe are saving money because they hate their government and they want to leave their country, but now they won&amp;#39;t be able because they can&amp;#39;t transfer their money from their Russian bank account to another country.&lt;/p&gt;\n\n&lt;p&gt;Bitcoin fixes this.&lt;/p&gt;\n\n&lt;p&gt;Governments can fight, can give each other sanctions, can do a lot of things, but they shouldn&amp;#39;t be able to touch people&amp;#39;s money, and that&amp;#39;s why Bitcoin was created.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 338,
  "permalink": "/r/CryptoCurrency/comments/t0xf7k/if_you_think_bitcoin_needs_government_control/",
  "subreddit": "CryptoCurrency",
  "id": "t0xf7k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "In the last weeks I'm seeing a lot of people saying Bitcoin should be somehow\ncontrolled by the US government, because thanks to crypto, Putin could evade\nsanctions. Same things were said about the convoy protest in Canada.\n\nI know most users joined crypto just to make some money, but Bitcoin was…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここ数週間、ビットコインは何らかの形で管理されるべきという意見を多く目にするようになりました。\nなぜなら、暗号のおかげでプーチンは逃げ出すことができたからです。\n制裁 カナダでの護送船団抗議の際にも同じことが言われました。\n\nほとんどのユーザーがお金を稼ぐために暗号に参加したことは知っていますが、Bitcoinは...",
      "title": "ビットコインに政府の管理が必要だと思うなら、あなたは洗脳されている"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在过去的几周里，我看到很多人说比特币应该以某种方式被\n美国政府控制，因为由于加密货币，普京可以躲避\n制裁。关于加拿大的车队抗议活动也有同样的说法。\n\n我知道大多数用户加入加密货币只是为了赚点钱，但比特币是...",
      "title": "如果你认为比特币需要政府控制，你就被洗脑了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在過去的幾周裏，我看到很多人說比特幣應該以某種方式被\n美國政府控制，因爲由於加密貨幣，普京可以躲避\n制裁。關於加拿大的車隊抗議活動也有同樣的說法。\n\n我知道大多數用戶加入加密貨幣只是爲了賺點錢，但比特幣是...",
      "title": "如果你認爲比特幣需要政府控制，你就被洗腦了"
    }
  ]
}