{
  "author": "Stevetrov",
  "original_created_utc": 1654856653,
  "title": "How did complex systems like our circulation system evolve?",
  "created_utc": 1654865155,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a scientific background mainly in math and computer science and some parts of evolution make sense to me like birds evolving better suited beaks or viruses evolving to spread faster. These things evolve in small changes each of which has a benefit.&lt;/p&gt;\n\n&lt;p&gt;But a circulation system needs a number of different parts to work, you need a heart at least 1 lung, blood vessels and blood to carry the oxygen around. Each of these very complex and has multicellular structure (except blood).&lt;/p&gt;\n\n&lt;p&gt;I see how having a circulation system gives an organism an advantage but not how we got here.&lt;/p&gt;\n\n&lt;p&gt;The only explanation I have found on the Internet is that we can see genetic similarities between us and organisms without a circulation system but that feels very weak evidence.&lt;/p&gt;\n\n&lt;p&gt;To my computer science brain evolution feels like making a series of small tweaks to a computer program, changing a variable or adding a line of code. Adding a circulation system feels a lot more than a tweak and would be the equivalent of adding a new features that required multiple changes across many files and probably the introduction whole new components and those changes need to be done to work together to achieve the overall goal. &lt;/p&gt;\n\n&lt;p&gt;Many thx&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 150,
  "permalink": "/r/askscience/comments/v94nzm/how_did_complex_systems_like_our_circulation/",
  "subreddit": "askscience",
  "id": "v94nzm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have a scientific background mainly in math and computer science and some\nparts of evolution make sense to me like birds evolving better suited beaks or\nviruses evolving to spread faster. These things evolve in small changes each of\nwhich has a benefit.\n\nBut a circulation system needs a number of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は、主に数学とコンピュータサイエンスの分野で科学的なバックグラウンドを持っており、いくつかの\n鳥がより適したくちばしに進化したとか、ウイルスが進化したとか。\nウイルスはより速く拡散するように進化しています。これらの進化は、小さな変化の積み重ねであり、その一つひとつが\n進化していきます。\n\nしかし、循環システムには、多くの...",
      "title": "私たちの循環システムのような複雑なシステムは、どのように進化してきたのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的科学背景主要在数学和计算机科学方面，还有一些\n进化的某些部分对我来说是有意义的，比如鸟类进化出更适合的喙或\n病毒演化得更快。这些东西在小的变化中进化，每一个\n都有好处。\n\n但是一个循环系统需要一些...",
      "title": "像我们的循环系统这样的复杂系统是如何演变的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的科學背景主要在數學和計算機科學方面，還有一些\n進化的某些部分對我來說是有意義的，比如鳥類進化出更適合的喙或\n病毒演化得更快。這些東西在小的變化中進化，每一個\n都有好處。\n\n但是一個循環系統需要一些...",
      "title": "像我們的循環系統這樣的複雜系統是如何演變的？"
    }
  ]
}