{
  "author": "Stevetrov",
  "original_created_utc": 1654856653,
  "title": "How did complex systems like our circulation system evolve?",
  "created_utc": 1654865155,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have a scientific background mainly in math and computer science and some parts of evolution make sense to me like birds evolving better suited beaks or viruses evolving to spread faster. These things evolve in small changes each of which has a benefit.&lt;/p&gt;\n\n&lt;p&gt;But a circulation system needs a number of different parts to work, you need a heart at least 1 lung, blood vessels and blood to carry the oxygen around. Each of these very complex and has multicellular structure (except blood).&lt;/p&gt;\n\n&lt;p&gt;I see how having a circulation system gives an organism an advantage but not how we got here.&lt;/p&gt;\n\n&lt;p&gt;The only explanation I have found on the Internet is that we can see genetic similarities between us and organisms without a circulation system but that feels very weak evidence.&lt;/p&gt;\n\n&lt;p&gt;To my computer science brain evolution feels like making a series of small tweaks to a computer program, changing a variable or adding a line of code. Adding a circulation system feels a lot more than a tweak and would be the equivalent of adding a new features that required multiple changes across many files and probably the introduction whole new components and those changes need to be done to work together to achieve the overall goal. &lt;/p&gt;\n\n&lt;p&gt;Many thx&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 150,
  "permalink": "/r/askscience/comments/v94nzm/how_did_complex_systems_like_our_circulation/",
  "subreddit": "askscience",
  "id": "v94nzm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have a scientific background mainly in math and computer science and some\nparts of evolution make sense to me like birds evolving better suited beaks or\nviruses evolving to spread faster. These things evolve in small changes each of\nwhich has a benefit.\n\nBut a circulation system needs a number of…"
}