{
  "author": "LeJokeRuiner",
  "the_new_excerpt": "Do you think it's natural to notice \"oh no... their kid is ugly\" or is it a\nsense someone develops on their own?\n\nNot to be disrespectful, but I think it's normal to see an ugly couple and go\n\"oh that's why your kid looks like an Ewok\" or something like that. Seeing ugly\nkids makes you feel bad…",
  "original_created_utc": 1617840472,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この人の子供は不細工だな」と気づくのは自然なことだと思いますか？\n誰かが独自に開発した感覚なのでしょうか？\n\n失礼な言い方かもしれませんが、不細工なカップルを見て「ああ、だから子供がイウォークみたいなのね」とか思うのは普通だと思います。\n\"醜いカップルを見て、「ああ、だからお前の子供はイウォークみたいなんだな」とか思うのは普通だと思います。醜い子供を見ると\n醜い子供を見ると嫌な気分になる...。",
      "title": "誰かの子供を見て、「いまいましい子供だな」と思うことはありませんか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你认为这是自然而然地注意到 \"哦，不... ... 他们的孩子很丑\"，或者是一个。\n感有人自己发展？\n\n不是不尊重你，但我觉得看到一对丑陋的情侣，很正常的事。\n\"哦，这就是为什么你的孩子看起来像一个Ewok \"或类似的东西。看到丑陋的\n孩子们让你感觉不好...",
      "title": "你有没有看过别人的孩子，然后去 \"该死的那些是一些丑陋的屁股的孩子\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你認爲這是自然而然地注意到 \"哦，不... ... 他們的孩子很醜\"，或者是一個。\n感有人自己發展？\n\n不是不尊重你，但我覺得看到一對醜陋的情侶，很正常的事。\n\"哦，這就是爲什麼你的孩子看起來像一個Ewok \"或類似的東西。看到醜陋的\n孩子們讓你感覺不好...",
      "title": "你有沒有看過別人的孩子，然後去 \"該死的那些是一些醜陋的屁股的孩子\"？"
    }
  ],
  "title": "Do you ever look at someone's kids and go \"damn those are some ugly ass kids\"?",
  "created_utc": 1617849072,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Do you think it&#39;s natural to notice &quot;oh no... their kid is ugly&quot; or is it a sense someone develops on their own?</p>\n\n<p>Not to be disrespectful, but I think it&#39;s normal to see an ugly couple and go &quot;oh that&#39;s why your kid looks like an Ewok&quot; or something like that. Seeing ugly kids makes you feel bad because you know things aren&#39;t going to go well for them growing up... There&#39;s no chance. They would be outcast babies if we were Spartans. So that&#39;s why we notice these things... In caveman times we would probably eat them.</p>\n</div><!-- SC_ON -->",
  "score": 365,
  "permalink": "/r/TooAfraidToAsk/comments/mmfiuc/do_you_ever_look_at_someones_kids_and_go_damn/",
  "subreddit": "TooAfraidToAsk",
  "id": "mmfiuc",
  "is_self": true,
  "media": null,
  "is_video": false
}