{
  "author": "Doshizle",
  "original_created_utc": 1626742709,
  "title": "Once upon a time in a village, a man appeared and announced to the villagers that he would buy monkeys for $10 each...",
  "created_utc": 1626755507,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The villagers, seeing that there were many monkeys around, went out to the forest and started catching them.</p>\n\n<p>The man bought thousands at $10 and as supply started to diminish, the villagers stopped their effort. He further announced that he would now buy at $20. This renewed the efforts of the villagers and they started catching monkeys again.</p>\n\n<p>Soon the supply diminished even further and people started going back to their farms. The offer increased to $25 each and the supply of monkeys became so little that it was an effort to even see a monkey, let alone catch it!</p>\n\n<p>The man now announced that he would buy monkeys at $50! However, since he had to go to the city on some business, his assistant would now buy on behalf of him.</p>\n\n<p>In the absence of the man, the assistant told the villagers; &quot;Look at all these monkeys in the big cage that the man has collected. I will sell them to you at $35 and when the man returns from the city, you can sell them to him for $50 each.&quot;</p>\n\n<p>The villagers rounded up with all their savings and bought all the monkeys.</p>\n\n<p>They never saw the man nor his assistant, only monkeys everywhere!</p>\n\n<p>Now you have a better understanding of how the cryptocurrency market works.</p>\n</div><!-- SC_ON -->",
  "score": 162,
  "permalink": "/r/CryptoCurrency/comments/onri31/once_upon_a_time_in_a_village_a_man_appeared_and/",
  "subreddit": "CryptoCurrency",
  "id": "onri31",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The villagers, seeing that there were many monkeys around, went out to the\nforest and started catching them.\n\nThe man bought thousands at $10 and as supply started to diminish, the villagers\nstopped their effort. He further announced that he would now buy at $20. This\nrenewed the efforts of the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "村人たちは、たくさんの猿がいることを知り、森に出かけていって\n森に出て猿を捕まえ始めました。\n\n男は10ドルで何千匹も買ったが、供給が少なくなってくると、村人たちは\n努力をやめてしまいました。さらに、これからは20ドルで買うと宣言した。これで\n村人たちの努力は再び...",
      "title": "むかしむかし、ある村に一人の男が現れ、村人たちに「一匹10ドルで猿を買います」と宣言しました...。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "村民们看到周围有很多猴子，就走到森林里，开始捕捉猴子。\n森林，开始捕捉它们。\n\n这个人以10美元的价格买了几千只，随着供应开始减少，村民们\n停止了他们的努力。他进一步宣布，他现在将以20美元的价格购买。这\n这使村民们的努力重新开始。",
      "title": "很久以前，在一个村子里，出现了一个人，向村民宣布，他将以每只10美元的价格购买猴子..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "村民們看到周圍有很多猴子，就走到森林裏，開始捕捉猴子。\n森林，開始捕捉它們。\n\n這個人以10美元的價格買了幾千只，隨着供應開始減少，村民們\n停止了他們的努力。他進一步宣佈，他現在將以20美元的價格購買。這\n這使村民們的努力重新開始。",
      "title": "很久以前，在一個村子裏，出現了一個人，向村民宣佈，他將以每隻10美元的價格購買猴子..."
    }
  ]
}