{
  "author": "Sitchico",
  "the_new_excerpt": "Hi all,\n\nI'm 25 and I have recently managed to clear up all of the debt that I occurred\nthrough my 18-21 so I am looking to start investing some money in different\nplaces so I don't have to work a 9-5 job for the rest of my life.\n\nAt the moment I am using Kraken for Cryptocurrencies and I am doing…",
  "original_created_utc": 1621514769,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "皆さん、こんにちは。\n\n私は25歳で、最近、18歳から21歳までの間に発生した借金をすべて清算することができました。\n18歳から21歳までの間に発生した借金をすべて清算したので、これからの人生で9時から5時まで働かなくてもいいように\n残りの人生で9時から5時まで仕事をする必要がないように、いろいろな場所にお金を投資したいと思っています。\n\n現在、私は暗号通貨のためにKrakenを使用しており、私はやっている...",
      "title": "25歳-参加してボーグルヘッドになりたいと思っています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "大家好。\n\n我今年25岁，最近设法清理了我在18-21岁期间发生的所有债务。\n所以我想开始在不同的地方投资一些钱。\n这样我就不必在余生中朝九晚五地工作了。\n\n目前，我正在使用Kraken进行加密货币投资，我正在做...",
      "title": "25岁--希望参与并成为一名Boglehead!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "大家好。\n\n我今年25歲，最近設法清理了我在18-21歲期間發生的所有債務。\n所以我想開始在不同的地方投資一些錢。\n這樣我就不必在餘生中朝九晚五地工作了。\n\n目前，我正在使用Kraken進行加密貨幣投資，我正在做...",
      "title": "25歲--希望參與併成爲一名Boglehead!"
    }
  ],
  "title": "25 year old - looking to get involved and become a Boglehead!",
  "created_utc": 1621526875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi all,</p>\n\n<p>I&#39;m 25 and I have recently managed to clear up all of the debt that I occurred through my 18-21 so I am looking to start investing some money in different places so I don&#39;t have to work a 9-5 job for the rest of my life.</p>\n\n<p>At the moment I am using Kraken for Cryptocurrencies and I am doing rather well in it tbf however I need some assistance on the Stock Markets rather than just Crypto.</p>\n\n<p>I am based in the UK so i&#39;m looking to find an app that is like T212 as they are not going through the verification process at the moment.</p>\n\n<p>If anyone can share some insight to a beginner and their recommendations then that would be great.</p>\n\n<p>Happy to go into further detail if required.</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/Bogleheads/comments/ngz9az/25_year_old_looking_to_get_involved_and_become_a/",
  "subreddit": "Bogleheads",
  "id": "ngz9az",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197387105
}