{
  "author": "comedian213",
  "the_new_excerpt": "I have been looking for a long term hold and I think I found it: Sunpower (SPWR)\n\nSunpower is one of the leading Solar installation/manufacturing/battery storage\ncompanies in the hugely growing industry. Thank old Joe!\n\nJust google “top solar companies” and tell me which have the best product…",
  "original_created_utc": 1612401918,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在寻找长期持有的机会，我想我找到了。Sunpower (SPWR)\n\nSunpower是一家领先的太阳能安装/制造/电池储能公司。\n公司在巨大发展的行业中。感谢老乔!\n\n只要谷歌 \"顶级太阳能公司\"，并告诉我哪家的产品最好... ...",
      "title": "让我们来谈谈SUNPOWER（SPWR）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在尋找長期持有的機會，我想我找到了。Sunpower (SPWR)\n\nSunpower是一家領先的太陽能安裝/製造/電池儲能公司。\n公司在巨大發展的行業中。感謝老喬!\n\n只要谷歌 \"頂級太陽能公司\"，並告訴我哪家的產品最好... ...",
      "title": "讓我們來談談SUNPOWER（SPWR）。"
    }
  ],
  "title": "Let’s talk about SUNPOWER (SPWR)",
  "created_utc": 1612419882,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have been looking for a long term hold and I think I found it: Sunpower (SPWR)</p>\n\n<p>Sunpower is one of the leading Solar installation/manufacturing/battery storage companies in the \nhugely growing industry. Thank old Joe!</p>\n\n<p>Just google “top solar companies” and tell me which have the best product and best customer ratings.</p>\n\n<p>Sunpower is currently at a peak of a year long run up and now is nearly 60% available shares shorted. </p>\n\n<p>What most people don’t know, is, that Sunpower has started to roll out a new product that will consume market share from everyone’s favorite, Tesla. The product is called SunVault. SunVault is an energy storage battery that very well competes and rivals the Tesla power wall. I believe that SunVault will sell extremely well and could bring Sunpower up to Tesla levels in terms of solar and energy storage. The product is capable of powering your home for nearly 3 days. And when combined with the high efficiency panels that Sunpower offers, it’s game changing. </p>\n\n<p>SunVault only started rolling out last summer and Solar doesn’t really pick up till the summer. So getting in now before the busy season may be advantageous.</p>\n\n<p>If you are looking for a company that is fundamentally strong and has a high upside in a huge market, SPWR really could be something to consider.</p>\n\n<p>this is not investment advice. It is my opinion. I am not a financial advisor.</p>\n</div><!-- SC_ON -->",
  "score": 92,
  "permalink": "/r/stocks/comments/lc3xwz/lets_talk_about_sunpower_spwr/",
  "subreddit": "stocks",
  "id": "lc3xwz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518543325
}