{
  "author": "Nikomaru14",
  "the_new_excerpt": "I wrote this originally for the Coinbase subreddit since I saw so many people\ngetting their account hacked. If you have over $10k on an exchange or any amount\nyou can't afford to lose, do ALL of these steps. To be honest, all of this is\njust the bare minimum. I've been trading and using…",
  "original_created_utc": 1620661599,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "この記事はもともとCoinbase subredditのために書いたものです。\nアカウントがハッキングされているのを見たからです。もしあなたが取引所に1万ドル以上のお金を預けていたり、失ってはいけない金額を持っているのであれば\n失うことができない金額を持っている場合は、これらの手順をすべて実行してください。正直に言うと、これらのすべては\n最低限のことしかしていません。私は今まで取引をしてきましたし、使用してきました...",
      "title": "取引所のアカウントをハッキングされないための方法。noobがこれを読む"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最初是为Coinbase分论坛写的这篇文章，因为我看到有很多人\n他们的账户被黑了。如果你在交易所有超过1万美元或任何金额\n你无法承受的损失，请完成所有这些步骤。说实话，所有这些都是\n只是最低限度。我一直在交易和使用...",
      "title": "如何不使你的交易所账户被黑掉。傻瓜才看这个"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最初是爲Coinbase分論壇寫的這篇文章，因爲我看到有很多人\n他們的賬戶被黑了。如果你在交易所有超過1萬美元或任何金額\n你無法承受的損失，請完成所有這些步驟。說實話，所有這些都是\n只是最低限度。我一直在交易和使用...",
      "title": "如何不使你的交易所賬戶被黑掉。傻瓜纔看這個"
    }
  ],
  "title": "How to not get your exchange account hacked. NOOBS READ THIS",
  "created_utc": 1620678727,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I wrote this originally for the Coinbase subreddit since I saw so many people getting their account hacked. If you have over $10k on an exchange or any amount you can&#39;t afford to lose, do ALL of these steps. To be honest, all of this is just the bare minimum. I&#39;ve been trading and using cryptocurrency since 2017, I work in IT and have taken classes in cybersecurity. I am nowhere near an expert but I feel that I know a lot about this. Feel free to add anything I missed below.</p>\n\n<h1>How to not get hacked:</h1>\n\n<p><strong>1. Have a strong unique password, don&#39;t keep it out in the open.</strong></p>\n\n<p>-More than 16 characters, containing numbers, symbols, and capitals.</p>\n\n<p>-If you use a password manager, secure it as well. I recommend Bitwarden.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>2. Have google authenticator as your 2FA.</strong></p>\n\n<p>-Store your backup seed on a thumb drive or on paper in a secure location (in case your phone gets lost). DON&#39;T STORE IT ANYWHERE ELSE.</p>\n\n<p>-Don&#39;t use your phone number, and don&#39;t use Authy. It can be hacked if someone swaps your sim card.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>3. Secure your email with a strong password and 2FA (google auth) as well.</strong></p>\n\n<p>-Use all these rules for it too.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>4. Have a separate email that you use for only crypto and banking.</strong></p>\n\n<p>-One for everything else.</p>\n\n<p>-If your info gets leaked in a data breach for Facebook for instance, the email you used for it is known to hackers but the one you use for your exchange is not.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>5. Install Phishfort on your browser.</strong></p>\n\n<p>-It will help protect you against fake websites that steal your info.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>6. Use anti-virus software on  your pc and scan your phone for malicious apps.</strong></p>\n\n<p>-Do a quick scan at least once a week and a full scan once a month.</p>\n\n<p>-Malwarebytes has a great free virus scan but it does not run automatically.</p>\n\n<p>&#x200B;</p>\n\n<p><strong>7. Do not give your password or any code sent to your device to ANYONE.</strong></p>\n\n<p>-No one from the exchange will ask you for it.</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks for reading, hope this valuable info serves you well.</p>\n</div><!-- SC_ON -->",
  "score": 434,
  "permalink": "/r/CryptoCurrency/comments/n9882d/how_to_not_get_your_exchange_account_hacked_noobs/",
  "subreddit": "CryptoCurrency",
  "id": "n9882d",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985992421
}