{
  "author": "yadayadayadarv",
  "original_created_utc": 1657912305,
  "title": "Why do people care about cultural appropriation? Is it not counter-productive?",
  "created_utc": 1657930151,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;For context, I was born in and live in the U.K. but to Middle Eastern parents and so grew up with a lot of that culture. I&amp;#39;m first generation, and bilingual. I&amp;#39;ve been back over a dozen times and seen everything first hand, including my relatives who largely still reside there, so I &lt;em&gt;feel&lt;/em&gt; well-placed to ask this.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s impossible to deny that cultures have merged throughout urbanised areas around the world, particularly Western societies in North America and Europe. I actually &lt;em&gt;am&lt;/em&gt; one of those examples. You can also buy just about any cuisine from your phone, people can listen to music from any country they want with streaming apps. People &lt;em&gt;do&lt;/em&gt; eat Chinese food and Indian food, no one cares who makes it. It&amp;#39;s &lt;em&gt;not&lt;/em&gt; uncommon to listen to Latin music, no one cares if an American Jazz musician wrote Bossa Nova. We call it &lt;em&gt;beautiful&lt;/em&gt;.&lt;/p&gt;\n\n&lt;p&gt;When the world still feels so much racial tension, and when we put so much emphasis on the importance of education and cultural immersion in the role of &amp;#39;healing&amp;#39; that over future generations, why do people so fiercely protect and gate-keep parts of their own culture from use by &amp;#39;others&amp;#39;, when some of us even &lt;em&gt;live&lt;/em&gt; in the land of &amp;#39;others&amp;#39;? Why can someone not complain about a foreigner &amp;#39;stealing&amp;#39; jobs and homes that they believe belong to their people, and yet I could complain that someone stole the intellectual property of mine?&lt;/p&gt;\n\n&lt;p&gt;Is it not hypocritical to the point that we should all live as one and share what we have and know?&lt;br/&gt;\nDoes it not &lt;em&gt;inherently&lt;/em&gt; hold back acceptance and unification in a way that is counter-productive to the idea of living without boundaries when we put boundaries on what is &amp;#39;ours&amp;#39;, and yet expect others to put theirs down?&lt;/p&gt;\n\n&lt;p&gt;I understand cultures have their unique values. I agree people should understand what they&amp;#39;re using, to use it respectfully and not forego being educated, but that is rarely the argument, and no one ever highlights the importance of that if cultural appropriation &lt;em&gt;must&lt;/em&gt; be a thing.&lt;/p&gt;\n\n&lt;p&gt;If you want proof of that, ask yourself how often you have seen someone calmly educated on what they used, and not inundated with threats before being forced to &lt;em&gt;apologise,&lt;/em&gt; and/or remove it. It seems like a culture war in a world that supposedly prides itself on ending them, but one that we accept, even support, because it is made by non-natives like myself. Why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/vzwn88/why_do_people_care_about_cultural_appropriation/",
  "subreddit": "TooAfraidToAsk",
  "id": "vzwn88",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "For context, I was born in and live in the U.K. but to Middle Eastern parents\nand so grew up with a lot of that culture. I'm first generation, and bilingual.\nI've been back over a dozen times and seen everything first hand, including my\nrelatives who largely still reside there, so I feel well…"
}