{
  "author": "chopperdrawlion4",
  "the_new_excerpt": "Been seeing a lot of comments in the past few days, “What’re the chances this is\nactually going to work?”-esq questions. Look, I’m not going to make you wrong\nfor asking these types of questions because they are rational questions - but\nWSB wasn’t founded on rationality - it was founded on YOLOing…",
  "original_created_utc": 1614462205,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "这几天一直看到很多评论，\"这是多大的机率啊？\n实际上是要去工作？\"的问题。听着，我不会让你犯错的\n因为这些问题都是理性的问题--------------------------------。\nWSB不是建立在理性上的--它是建立在YOLOing上的......。",
      "title": "不要放弃悲观主义 -> 我们太深了，无法拿出我们的象征性的家伙。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這幾天一直看到很多評論，\"這是多大的機率啊？\n實際上是要去工作？\"的問題。聽着，我不會讓你犯錯的\n因爲這些問題都是理性的問題--------------------------------。\nWSB不是建立在理性上的--它是建立在YOLOing上的......。",
      "title": "不要放棄悲觀主義 -> 我們太深了，無法拿出我們的象徵性的傢伙。"
    }
  ],
  "title": "Do NOT give into pessimism -> we’re too DEEP to pull our figurative dick out",
  "created_utc": 1614515833,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Been seeing a lot of comments in the past few days, “What’re the chances this is actually going to work?”-esq questions. Look, I’m not going to make you wrong for asking these types of questions because they are rational questions - but WSB wasn’t founded on rationality - it was founded on YOLOing our children’s college funds away and making memes about it. This is a MOONSHOT; not a sure bet - if you can’t handle the fire get out of the kitchen (aka sub to <a href=\"/r/investing\">r/investing</a> and get a nice safe index fund).</p>\n\n<p>Here are the facts -&gt; They NEED our shares. We are seeing them BLATANTLY use every trick in the book (naked shorts, keeping prices artificially low, blocking trading, etc) - in fact, they’re not even pretending or hiding it anymore. It’s out in the public - anyone who cares to see it can see it. But here’s the thing: despite all their tricks, at the end of the day - they still NEED our shares. At this point, it is a battle of attrition; they can only keep up their charade for so long before they literally have nothing left to short and they have to buy back their shorted positions (side note: I’m a retard and this prob isn’t exactly how it works but close enough so just fucking go with it for now). By holding (think Articuno chilling in cave [Seafoam Island] status) we lose NOTHING. If people keep buying/selling back and forth, it is playing into their hand. They want us to get bored and sell - behind all their dirty tricks, it sums up to them just trying to get us to sell - either through fear or boredom. Do what you got to do - but I am holding until the bitter fucking end.</p>\n\n<p>Tldr; don’t get fatigue/boredom/fear from this - that’s what they want. Take time away and come back fresh. And most importantly - HOLD</p>\n\n<p>Edit: Include specific location of Articuno’s YOLO spot</p>\n\n<p>Edit 2: change “short ladder attack” to “keep prices artificially low” herp derp</p>\n</div><!-- SC_ON -->",
  "score": 2497,
  "permalink": "/r/wallstreetbets/comments/lty1na/do_not_give_into_pessimism_were_too_deep_to_pull/",
  "subreddit": "wallstreetbets",
  "id": "lty1na",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937752774
}