{
  "author": "Kaizenmz",
  "the_new_excerpt": "If you have been following India's Covid nightmare you would know that hundreds\nof thousands are struggling both mentally and physically.\n\nSimply breathing is a difficulty for thousands of people, something we all take\nfor granted. Thousands of deaths everyday in hospitals, on the streets and…",
  "original_created_utc": 1620909539,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "インドのCovidの悪夢を見てきた人なら、何十万人もの人々が精神的にも肉体的にも苦しんでいることを知っているだろう。\n何十万人もの人々が精神的にも肉体的にも苦しんでいます。\n\n私たちが当たり前のようにしている呼吸をすることも、何千人もの人々にとっては困難です。\n当たり前のことです。毎日、病院や街中で何千人もの人が亡くなっています。",
      "title": "ヴィタリクスの10億ドルがインドに与える影響は、ほとんどの人が理解していないと思う"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "如果你一直在关注印度的Covid梦魇，你就会知道，成千上万的人在精神和身体上都在挣扎。\n成千上万的人在精神上和身体上都在挣扎。\n\n对成千上万的人来说，仅仅是呼吸就成了困难，而这是我们都认为理所当然的事情。\n理所当然。每天都有数以千计的人在医院、街道和其他地方死亡。",
      "title": "我认为大多数人不了解维塔利克的10亿美元对印度的影响"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你一直在關注印度的Covid夢魘，你就會知道，成千上萬的人在精神和身體上都在掙扎。\n成千上萬的人在精神上和身體上都在掙扎。\n\n對成千上萬的人來說，僅僅是呼吸就成了困難，而這是我們都認爲理所當然的事情。\n理所當然。每天都有數以千計的人在醫院、街道和其他地方死亡。",
      "title": "我認爲大多數人不瞭解維塔利克的10億美元對印度的影響"
    }
  ],
  "title": "I don't think most people understand the impact Vitaliks $1 billion has on India",
  "created_utc": 1620934633,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>If you have been following India&#39;s Covid nightmare you would know that hundreds of thousands are struggling both mentally and physically. </p>\n\n<p>Simply breathing is a difficulty for thousands of people, something we all take for granted. Thousands of deaths everyday in hospitals, on the streets and at home and the hopelessness of being able to get family members the help they need. </p>\n\n<p>Vitalik donated not just millions but $1 billion. Literally thousands of lives will be saved because of this. Thousands less heartbreak and thousands less familys being ripped apart. </p>\n\n<p>The Indian government has screwed the people and sometimes we need heroes like Vitalik to step up in the midst of chaos. </p>\n\n<p>Thise who have been fortunate and benefited from crypto and have made 10x or 100x please consider giving back. Life ain&#39;t all about lambos and private jets, we are humans and every life is precious.</p>\n</div><!-- SC_ON -->",
  "score": 618,
  "permalink": "/r/CryptoCurrency/comments/nbfo8m/i_dont_think_most_people_understand_the_impact/",
  "subreddit": "CryptoCurrency",
  "id": "nbfo8m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590796939
}