{
  "author": "isaac_horstmeier",
  "original_created_utc": 1633902065,
  "title": "I just sold all my ADA today.",
  "created_utc": 1633909040,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I bought Ada back on 1,00 and DCA along the way during dips, don’t get me wrong I made quite a profit with the project, I was addicted to the charles hoskinson speeches and all the promising upcoming beautiful things with the alonzo hardfork, the hundreds of developers working already with cardano and that they were ready to jump into Cardando just right when the smartcontracts went live on the live net.</p>\n\n<p>But being weeks now from the launch of the smart contracts and the alonzo hardfork, and seeing no movement at all, not from the price, again, don’t get me wrong, it’s not about the money here, at least on my decision to opt out., but no movement from developers… It’s just the feeling of being lied about certain things on the ecosystem from Charles himself. </p>\n\n<p>I know I’m getting downvoted to hell but, maybe I’m not alone with this feeling here on the crypto community.</p>\n</div><!-- SC_ON -->",
  "score": 175,
  "permalink": "/r/CryptoCurrency/comments/q5hfld/i_just_sold_all_my_ada_today/",
  "subreddit": "CryptoCurrency",
  "id": "q5hfld",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I bought Ada back on 1,00 and DCA along the way during dips, don’t get me wrong\nI made quite a profit with the project, I was addicted to the charles hoskinson\nspeeches and all the promising upcoming beautiful things with the alonzo\nhardfork, the hundreds of developers working already with cardano…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はエイダを1,00で買い戻しましたが、ディップ時には途中でDCAを購入しました、誤解しないでください。\n私はこのプロジェクトでかなりの利益を得ましたが、Charles Hoskinsonのスピーチや\ncharles hoskinsonのスピーチや、alonzo hardforkや何百人もの開発者による\ncharles hoskinsonのスピーチや、alonzoのハードフォーク、何百人もの開発者がすでに働いているcardano...",
      "title": "今日はADAを全部売りました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在1,00美元和DCA一路下跌时买回了Ada，不要误会我的意思。\n我在这个项目上赚了不少钱，我沉迷于查尔斯-霍斯金森的演讲和阿隆佐即将推出的所有美好事物。\n的演讲和所有有前途的即将到来的美好事物，以及数百名开发者的努力。\n硬分叉，数以百计的开发人员已经在为Cardano工作......",
      "title": "我今天刚刚卖掉了我所有的ADA。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在1,00美元和DCA一路下跌時買回了Ada，不要誤會我的意思。\n我在這個項目上賺了不少錢，我沉迷於查爾斯-霍斯金森的演講和阿隆佐即將推出的所有美好事物。\n的演講和所有有前途的即將到來的美好事物，以及數百名開發者的努力。\n硬分叉，數以百計的開發人員已經在爲Cardano工作......",
      "title": "我今天剛剛賣掉了我所有的ADA。"
    }
  ]
}