{
  "author": "pugglepants",
  "the_new_excerpt": "From my understand, incest (besides being gross) is wrong because there is an\nincreased risk of the offspring having developmental problems or diseases.\n\nHowever, people who have all kinds of hereditary diseases are congratulated when\nthey have children. Why is it considered ok, or even good, for…",
  "original_created_utc": 1619047828,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、近親相姦は（気持ち悪いだけでなく）、子供が発達障害や病気になるリスクが高くなるのでいけません。\n近親相姦は（気持ち悪いだけでなく）、子供が発達上の問題や病気になるリスクが高くなるので、いけないことだと思います。\n\nしかし、あらゆる種類の遺伝性疾患を持つ人々は、子供を持つと祝福されます。\n祝福されます。なぜ、近親相姦をしても良い、あるいは良いとされるのでしょうか？",
      "title": "近親相姦がいけないのであれば、なぜ遺伝性の病気を知りながら子孫に伝えることが許されるのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "根据我的理解，乱伦（除了恶心）是错误的，因为有一个\n后代有发育问题或疾病的风险增加。\n\n然而，那些患有各种遗传性疾病的人在有了孩子后却得到了祝贺。\n他们有了孩子。为什么它被认为是可以的，甚至是好的，对于...",
      "title": "如果乱伦是错误的，为什么人们在知情的情况下将遗传性疾病传给他们的后代就可以呢？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "根據我的理解，亂倫（除了噁心）是錯誤的，因爲有一個\n後代有發育問題或疾病的風險增加。\n\n然而，那些患有各種遺傳性疾病的人在有了孩子後卻得到了祝賀。\n他們有了孩子。爲什麼它被認爲是可以的，甚至是好的，對於...",
      "title": "如果亂倫是錯誤的，爲什麼人們在知情的情況下將遺傳性疾病傳給他們的後代就可以呢？"
    }
  ],
  "title": "If incest is wrong, why is it ok for people to knowingly pass hereditary diseases to their offspring?",
  "created_utc": 1619069570,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>From my understand, incest (besides being gross) is wrong because there is an increased risk of the offspring having developmental problems or diseases.</p>\n\n<p>However, people who have all kinds of hereditary diseases are congratulated when they have children. Why is it considered ok, or even good, for them to have children? </p>\n\n<p>There is the chance that they won&#39;t pass the hereditary diseases to their offspring, but there is also the chance that two cousins would have normal offspring. </p>\n\n<p>I am sorry that I don&#39;t have a background in philosophy. I am also not trying to offend anyone...just trying to understand.</p>\n\n<p>Edit: if this post offends you and you are down voting, please tell me why.</p>\n</div><!-- SC_ON -->",
  "score": 110,
  "permalink": "/r/askphilosophy/comments/mvsbbc/if_incest_is_wrong_why_is_it_ok_for_people_to/",
  "subreddit": "askphilosophy",
  "id": "mvsbbc",
  "is_self": true,
  "media": null,
  "is_video": false
}