{
  "author": "mikitacurve",
  "the_new_excerpt": "Alternate phrasing: have West Africans ever agitated for or supported the return\nof freed slaves or their descendants to West Africa? Or has Back-to-Africa\nsentiment only been present in Black American and white abolitionist\ncommunities?\n\nI hope the use of \"West Africans\" isn't too broad — I'm…",
  "original_created_utc": 1612304527,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "备选措辞：西非人曾否鼓动或支持回归？\n奴隶或其后裔到西非的情况？或者说，\"重返非洲 \"计划是否已经\n美国黑人和白人废奴主义者才有的情绪。\n社区？\n\n我希望 \"西非人 \"的使用不要太宽泛--我... ...",
      "title": "历史上西非人对 \"重返非洲 \"运动有什么看法？他们是支持它，还是觉得它很愚蠢？或者更糟糕的是，是侮辱性的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "備選措辭：西非人曾否鼓動或支持迴歸？\n奴隸或其後裔到西非的情況？或者說，\"重返非洲 \"計劃是否已經\n美國黑人和白人廢奴主義者纔有的情緒。\n社區？\n\n我希望 \"西非人 \"的使用不要太寬泛--我... ...",
      "title": "歷史上西非人對 \"重返非洲 \"運動有什麼看法？他們是支持它，還是覺得它很愚蠢？或者更糟糕的是，是侮辱性的？"
    }
  ],
  "title": "What have West Africans historically had to say about Back-to-Africa movements? Have they supported it, or did they find it silly? Or worse, insulting?",
  "created_utc": 1612315811,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alternate phrasing: have West Africans ever agitated for or supported the return of freed slaves or their descendants to West Africa? Or has Back-to-Africa sentiment only been present in Black American and white abolitionist communities?</p>\n\n<p>I hope the use of &quot;West Africans&quot; isn&#39;t too broad — I&#39;m trying to avoid falling into the portrayal of Africa as a single monolith, but, because European slave traders were active all across the West African coast, I feel this is the best I can do in this context.</p>\n\n<p>I also want to say, I&#39;m aware of Ghana&#39;s recent Year of Return 2019 and Right of Return policy, but for one, that&#39;s well on the near side of the 20 year rule, and for another, I want to know more about the rhetorical history in addition to the political, I suppose.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/AskHistorians/comments/lb8c9p/what_have_west_africans_historically_had_to_say/",
  "subreddit": "AskHistorians",
  "id": "lb8c9p",
  "is_self": true,
  "media": null,
  "is_video": false
}