{
  "author": "AvidasOfficial",
  "the_new_excerpt": "I’m sorry for the long wall of text but this NEEDS more exposure!\n\nAscendEX previously known as Bitmax opened as a new exchange a few years ago. As\npart of their fund raising, they did an ICO for their native BTMX token.\n\nAs with most ICO’s the terms of the release were changed slightly prior…",
  "original_created_utc": 1616507886,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "很抱歉长长的文字墙，但这需要更多的曝光率！AscendEX的前身是Bitmax，几年前开了一家新交易所。\n\nAscendEX前身为Bitmax，几年前作为一个新的交易所开业。作为\n筹集资金的一部分，他们为他们的原生BTMX代币做了一次ICO。\n\n与大多数ICO一样，发布的条款在发布前稍有改动... ...",
      "title": "这就是Bitmax/AscendEX交易所如何骗取早期投资者的钱财--请上票曝光!"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "很抱歉長長的文字牆，但這需要更多的曝光率！AscendEX的前身是Bitmax，幾年前開了一家新交易所。\n\nAscendEX前身爲Bitmax，幾年前作爲一個新的交易所開業。作爲\n籌集資金的一部分，他們爲他們的原生BTMX代幣做了一次ICO。\n\n與大多數ICO一樣，發佈的條款在發佈前稍有改動... ...",
      "title": "這就是Bitmax/AscendEX交易所如何騙取早期投資者的錢財--請上票曝光!"
    }
  ],
  "title": "This is how Bitmax / AscendEX exchange scammed their early investors- please upvote for exposure!",
  "created_utc": 1616522171,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sorry for the long wall of text but this NEEDS more exposure! </p>\n\n<p>AscendEX previously known as Bitmax opened as a new exchange a few years ago. As part of their fund raising, they did an ICO for their native BTMX token. </p>\n\n<p>As with most ICO’s the terms of the release were changed slightly prior to release but nothing that wasn’t expected. </p>\n\n<p>For a while all was happy; early investors were given around 10% of their tokens and the exchange saw relative success in its early months. One thing that stood out at that time was the high level of communication from their CEO George Cao. </p>\n\n<p>One concern early investors had was the fact that their ICO tokens were locked up for such a long period of time compared to the original terms. Bitmax addressed this by creating BTMXP (BTMX Private token), this new token allowed the sale of early investor tokens to the public at a lower price than BTMX. Early investors that wanted to cash out at break-even could unlock BTMXP then sell whilst new investors could buy into BTMXP and lock it up as a long-term investment (at that time it would take about 2-3 years for the BTMXP to convert into BTMX). </p>\n\n<p>BTMX at the time was trading at around $0.20 whilst BTMXP was around $0.02. A very attractive 10x for anyone patient enough, and that was not factoring in future growth. </p>\n\n<p>Bitmax then made BTMXP even more attractive by implementing an accelerated release scheme that could increase the conversion rate of BTMXP to BTMX by up to 10x. </p>\n\n<p>Naturally people flocked to BTMXP and invested vast amounts of money. The early ICO investors also didn’t sell their tokens as well … why would they? </p>\n\n<p>This is when things changed. One month after introducing it George suddenly announced that they were stopping the accelerated scheme and would instead link BTMXP conversion directly to their reverse mining rate. This slowed the release of the token down from 2-3 years to 50+ </p>\n\n<p>On the downlow they also changed the unlock fee from a percentage of BTMXP to a percentage of BTMX (essentially increasing the unlock fee by 10X). </p>\n\n<p>These changes essentially trapped anyone who had bought BTMXP and locked it up. </p>\n\n<p>The Bitmax leadership team promised that they would sort this out but over a year later everyone who bought BTMXP is still trapped with less than 1% of their BTMXP having converted in the last year. On top of this the leadership team has gone completely silent with any mention of the issue resulting in users being banned or silenced. </p>\n\n<p>To make matters worse the price of regular BTMX has mooned in recent months growing by over 4000%. This has slowed the unlock rate to hundreds of years and irritated those trapped even more because the funds they should have had released at this point are life changing sums of money. </p>\n\n<p>This whole process is a blatant scam by the exchange. They enticed people into investing in their BTMXP token with incredible terms and then changed them once they had locked up enough money. On top of this a lot of the BTMXP tokens originally created sat with those inside the company. I have absolutely no doubt that it was these tokens that were dumped onto the retail investors buying in. </p>\n\n<p>The fact that BTMX is currently trading at $1.80 yet BTMXP (a token that converts into BTMX) is at $0.03 says it all.</p>\n\n<p><strong>Bitmax rebranded as AscendEX yesterday. The new name distances them from their native token. Do not let this be forgotten. AscendEX directly scammed those who invested in them as an exchange!</strong></p>\n</div><!-- SC_ON -->",
  "score": 531,
  "permalink": "/r/CryptoCurrency/comments/mbfawi/this_is_how_bitmax_ascendex_exchange_scammed/",
  "subreddit": "CryptoCurrency",
  "id": "mbfawi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752816922
}