{
  "author": "TappetTappetTappet",
  "the_new_excerpt": "I have a totally different reaction to an ad popping up on Brave than I do, say,\na commercial on television.\n\nOn Brave I'm getting BAT for that.\n\nI'm presenting myself to be advertised to and it was consensual. I didn't just\nhave to take it.\n\nI would be happy to get a cut of, say, the RH payment for…",
  "original_created_utc": 1619072221,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Braveで広告が表示されるのと、例えばテレビのCMが表示されるのとでは、反応が全く違います。\nテレビのコマーシャルとは全く違う反応です。\n\nBraveではBATを取得しています。\n\n私は広告を受けるために自分自身を提示しているのですが、それは合意の上でのことでした。ただ受けただけではありません。\n私はそれを受けなければならなかったわけではありません。\n\n例えば、RHの支払いをカットしてもらえれば嬉しいのですが...。",
      "title": "私がBATを好きなのは、消費者が製品になったときにお金をもらえるという考え方が好きだからです。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我对Brave上弹出的广告的反应与我对电视上的广告的反应完全不同，例如。\n电视上的广告。\n\n在Brave上，我得到了BAT的支持。\n\n我在展示自己，让别人给我做广告，而且是在自愿的情况下。我并不只是\n必须接受它。\n\n我很乐意从RH付款中抽成，比如说，为......。",
      "title": "我喜欢BAT，因为我喜欢消费者在成为产品时得到报酬的想法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我對Brave上彈出的廣告的反應與我對電視上的廣告的反應完全不同，例如。\n電視上的廣告。\n\n在Brave上，我得到了BAT的支持。\n\n我在展示自己，讓別人給我做廣告，而且是在自願的情況下。我並不只是\n必須接受它。\n\n我很樂意從RH付款中抽成，比如說，爲......。",
      "title": "我喜歡BAT，因爲我喜歡消費者在成爲產品時得到報酬的想法。"
    }
  ],
  "title": "I like BAT because I like the idea of the consumer being paid when they are the product",
  "created_utc": 1619096238,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a totally different reaction to an ad popping up on Brave than I do, say, a commercial on television.</p>\n\n<p>On Brave I&#39;m getting BAT for that.</p>\n\n<p>I&#39;m presenting myself to be advertised to and it was consensual. I didn&#39;t just have to take it.</p>\n\n<p>I would be happy to get a cut of, say, the RH payment for order flow as well but we&#39;re talking about crypto here baby</p>\n</div><!-- SC_ON -->",
  "score": 1034,
  "permalink": "/r/CryptoCurrency/comments/mvyoyu/i_like_bat_because_i_like_the_idea_of_the/",
  "subreddit": "CryptoCurrency",
  "id": "mvyoyu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619776207014
}