{
  "author": "MarbleMimic",
  "the_new_excerpt": "We're in a rented home with poor circulation, and I am going crazy trying to\nkeep everything clean. Dust settles quickly, we get spiders every spring, and if\nI keep up with my job and have some semblance of sanity then my house is a\ndisaster within one week.\n\nHow do people keep their homes clean on…",
  "original_created_utc": 1621713268,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "血行の悪い賃貸住宅に住んでいるので、私は気が狂いそうなほどの努力をしています。\nすべてを清潔に保とうと気が狂いそうです。ホコリはすぐにたまるし、毎年春にはクモが出てくるし、もし\nもし私が仕事を続けて正気を保っていたとしても、1週間以内に家は大惨事になってしまいます。\n1週間もしないうちに大惨事になってしまいます。\n\n皆さんはどのようにして家の中をきれいに保っているのでしょうか？",
      "title": "仕事を持っている大人は、どのようにして家をきれいに保っているのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我们住在租来的房子里，空气流通不畅，而我为了保持所有东西的清洁，都快疯了。\n保持一切清洁。灰尘很快就会沉淀下来，我们每年春天都会遇到蜘蛛。\n如果我继续工作并保持一定的理智，那么我的房子在一周内就是一场灾难。\n我的房子在一个星期内就会变成一场灾难。\n\n人们如何保持家里的清洁？",
      "title": "有工作的成年人如何保持家里的清洁？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我們住在租來的房子裏，空氣流通不暢，而我爲了保持所有東西的清潔，都快瘋了。\n保持一切清潔。灰塵很快就會沉澱下來，我們每年春天都會遇到蜘蛛。\n如果我繼續工作並保持一定的理智，那麼我的房子在一週內就是一場災難。\n我的房子在一個星期內就會變成一場災難。\n\n人們如何保持家裏的清潔？",
      "title": "有工作的成年人如何保持家裏的清潔？"
    }
  ],
  "title": "How do adults with jobs keep their homes clean?",
  "created_utc": 1621735913,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>We&#39;re in a rented home with poor circulation, and I am going crazy trying to keep everything clean. Dust settles quickly, we get spiders every spring, and if I keep up with my job and have some semblance of sanity then my house is a disaster within one week.</p>\n\n<p>How do people keep their homes clean on a weekly basis, much less so the big semi-regular stuff like polish floors? I need to know the secrets of people who have clean homes and functional lives.</p>\n</div><!-- SC_ON -->",
  "score": 147,
  "permalink": "/r/TooAfraidToAsk/comments/niqmw7/how_do_adults_with_jobs_keep_their_homes_clean/",
  "subreddit": "TooAfraidToAsk",
  "id": "niqmw7",
  "is_self": true,
  "media": null,
  "is_video": false
}