{
  "author": "BlahBlahNyborg",
  "original_created_utc": 1628046778,
  "title": "Were there any sacrifices or battles lost intentionally to conceal information that would have won the greater war? Example: the (false) story about the British knowing that Coventry was going to be bombed in WW2",
  "created_utc": 1628084031,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently heard a story about how the British government decrypted German radio transmissions that indicated Coventry would be attacked, but Churchill ordered that they do not evacuate or defend the city, out of fear that the Germans would realize the British were capable of cracking the Enigma code. It turns out the story is not true. More details: <a href=\"https://en.wikipedia.org/wiki/Coventry_Blitz#Coventry_and_Ultra\">https://en.wikipedia.org/wiki/Coventry_Blitz#Coventry_and_Ultra</a></p>\n\n<p>But now I&#39;m wondering if there is another situation similar to this... where something substantial was intentionally sacrificed to conceal intelligence, or just to sustain an enemy&#39;s false sense of confidence.</p>\n\n<p>I can think of a few military tactics that are similar, like a feint, where the enemy thinks the attack is happening in one location while the <em>real</em> invasion is coming elsewhere that day. But I&#39;m interested in something on a larger time scale.</p>\n\n<p>Thank you!</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/oxjpom/were_there_any_sacrifices_or_battles_lost/",
  "subreddit": "AskHistorians",
  "id": "oxjpom",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently heard a story about how the British government decrypted German radio\ntransmissions that indicated Coventry would be attacked, but Churchill ordered\nthat they do not evacuate or defend the city, out of fear that the Germans would\nrealize the British were capable of cracking the Enigma…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近聞いた話では、英国政府はコベントリーが攻撃されるというドイツの無線を解読したが\n英国政府は、コベントリーが攻撃されることを示すドイツのラジオ放送を解読しましたが、チャーチルは、コベントリーから避難しないようにと命令しました。\nチャーチルは、エニグマを解読していたことをドイツに悟られることを恐れて、避難も防衛もしないように命じたそうです。\nそれは、イギリス人がエニグマを解読できることをドイツ人に悟られることを恐れてのことだった...。",
      "title": "より大きな戦争に勝つための情報を隠すために、意図的に犠牲になったり、戦いを失ったりしたことはありませんでしたか？例：第二次世界大戦で、イギリスはコベントリーが爆撃されることを知っていたという（嘘の）話"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近听到一个关于英国政府如何解密德国无线电广播的故事\n丘吉尔命令他们不要撤离或防守。\n但丘吉尔命令他们不撤离或保卫城市，因为担心德国人会\n因为担心德国人会意识到英国人有能力破解英格玛......",
      "title": "是否有为了隐瞒可以赢得更大战争的信息而故意做出的牺牲或失去的战斗？例如：关于英国人知道考文垂将在二战中被轰炸的（假）故事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近聽到一個關於英國政府如何解密德國無線電廣播的故事\n丘吉爾命令他們不要撤離或防守。\n但丘吉爾命令他們不撤離或保衛城市，因爲擔心德國人會\n因爲擔心德國人會意識到英國人有能力破解英格瑪......",
      "title": "是否有爲了隱瞞可以贏得更大戰爭的信息而故意做出的犧牲或失去的戰鬥？例如：關於英國人知道考文垂將在二戰中被轟炸的（假）故事"
    }
  ]
}