{
  "author": "jellypolitics",
  "original_created_utc": 1627303480,
  "title": "If people should continue living because states of depression and anxiety are temporary, can't it also be said that it's okay to stop living because happiness and relief are also temporary?",
  "created_utc": 1627362748,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Everytime my mental health spirals, people remind me that my state is only temporary and that I won&#39;t feel this way forever. I do feel there&#39;s truth to this because sometimes, I&#39;ll feel good about life and my episodes are almost like an embarrassing outburst in the past. That being said, I feel like I always go back to being depressed and the times I&#39;m happy feel like brief distractions from my perceived reality.</p>\n\n<p>I know my current state will pass, but I&#39;m too scared to ask this to the people that tell me this because I don&#39;t want to worry them. Everyone knows you can&#39;t always be happy and that most forms and sources of happiness don&#39;t last forever, but why are we so focused on negative emotions being temporary, rather than the happy ones?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/TooAfraidToAsk/comments/orxxy7/if_people_should_continue_living_because_states/",
  "subreddit": "TooAfraidToAsk",
  "id": "orxxy7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Everytime my mental health spirals, people remind me that my state is only\ntemporary and that I won't feel this way forever. I do feel there's truth to\nthis because sometimes, I'll feel good about life and my episodes are almost\nlike an embarrassing outburst in the past. That being said, I feel like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の精神状態が悪化するたびに、人々は私の状態が一時的なものであることを思い出させてくれます。\n一生このような状態が続くわけではありません。この言葉には真実味があると感じています。\n時々、私は人生に満足していて、私のエピソードはほとんど\n過去の恥ずかしい出来事のように感じます。とはいえ、私が感じるのは...。",
      "title": "憂鬱や不安の状態が一時的なものだから生き続けなければならないというのであれば、幸福や安堵の状態も一時的なものだから生きなくてもいいとは言えないだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "每当我的心理健康状况恶化时，人们都会提醒我，我的状态只是\n暂时的，我不会永远有这种感觉。我确实觉得这是有道理的\n因为有时候，我对生活感觉良好，而我的发作几乎是\n就像过去的一次尴尬的爆发。话虽如此，我觉得...",
      "title": "如果人们应该继续生活，因为抑郁和焦虑的状态是暂时的，难道不能说停止生活也是可以的，因为幸福和解脱也是暂时的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "每當我的心理健康狀況惡化時，人們都會提醒我，我的狀態只是\n暫時的，我不會永遠有這種感覺。我確實覺得這是有道理的\n因爲有時候，我對生活感覺良好，而我的發作幾乎是\n就像過去的一次尷尬的爆發。話雖如此，我覺得...",
      "title": "如果人們應該繼續生活，因爲抑鬱和焦慮的狀態是暫時的，難道不能說停止生活也是可以的，因爲幸福和解脫也是暫時的？"
    }
  ]
}