{
  "author": "psychotrader00",
  "the_new_excerpt": "PsychoMarket Recap - Tuesday, June 1, 2021\n\nStocks traded mixed today, with the S&P 500 (SPY) and Nasdaq (QQQ) modestly\ndeclining while the Dow Jones (DIA) gained roughly 0.1%. After a volatile\nbeginning to the May, it seems over the past several weeks fears of fast rising\ninflation causing the…",
  "original_created_utc": 1622578739,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "PsychoMarket Recap - 2021年6月1日(火)\n\n今日の株価はまちまちで、S&P500(SPY)とNasdaq(QQQ)は小幅に下落し、Dow Jones(DIA)は約0.1%上昇した。\nダウ・ジョーンズ(DIA)は約0.1%上昇しました。5月の初めは不安定な動きでしたが\n5月に入ってからは一進一退の攻防が続いていましたが、ここ数週間は急激なインフ レの上昇を懸念する声が高まっていたようです。\nこの数週間は、インフレ率の急上昇を懸念して、...",
      "title": "本日2021年6月1日（火）のマーケット・リカップをご紹介します。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "心理市场回顾--2021年6月1日，星期二\n\n今天股市涨跌互现，标准普尔500指数（SPY）和纳斯达克指数（QQQ）小幅下跌，而道琼斯指数（DIA）上涨约0.1%。\n下跌，而道琼斯指数(DIA)大约上涨了0.1%。在经历了动荡的\n在5月份开始的时候，似乎在过去的几周里，人们对快速上升的通货膨胀的担忧导致了通货膨胀。\n通货膨胀导致的...",
      "title": "以下是今天（2021年6月1日，星期二）的市场回顾"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "心理市場回顧--2021年6月1日，星期二\n\n今天股市漲跌互現，標準普爾500指數（SPY）和納斯達克指數（QQQ）小幅下跌，而道瓊斯指數（DIA）上漲約0.1%。\n下跌，而道瓊斯指數(DIA)大約上漲了0.1%。在經歷了動盪的\n在5月份開始的時候，似乎在過去的幾周裏，人們對快速上升的通貨膨脹的擔憂導致了通貨膨脹。\n通貨膨脹導致的...",
      "title": "以下是今天（2021年6月1日，星期二）的市場回顧"
    }
  ],
  "title": "Here is a Market Recap for today Tuesday, June 1, 2021",
  "created_utc": 1622589780,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>PsychoMarket Recap - Tuesday, June 1, 2021</strong></p>\n\n<p>Stocks traded mixed today, with the S&amp;P 500 (SPY) and Nasdaq (QQQ) modestly declining while the Dow Jones (DIA) gained roughly 0.1%. After a volatile beginning to the May, it seems over the past several weeks fears of fast rising inflation causing the Federal Reserve to prematurely tighten monetary policy have tempered. As I have said for weeks, I thought the selloff in the first two weeks of May, that saw the SPY lose 4% in a few days, was overdone, and am very encouraged by the price action in the market recently.</p>\n\n<p>Last week, members of the Federal Open Market Committee once again reassured market participants that they see inflationary pressures as “transitory” and do not think a shift in monetary policy in the near-term is warranted. St. Louis Federal Reserve President James Bullard said he believed increases in inflation would be “mostly temporary” and that the Fed was “not quite there yet” when it came to discussing tapering its asset purchase program. In separate comments, Kansas City Federal Reserve President Esther George said she did not want the Fed to be “overly reliant on historical relationships and dynamics in judging the outlook for inflation.” </p>\n\n<p>Richard Clarida, Vice Chairman of the Federal Reserve, also said “there will come a time in upcoming meetings” when the Fed would consider tapering the asset purchase program but that “it is going to depend on the flow of data”. The Fed is currently buying $120 billion a month in government-issued and government-backed securities, and has pledged to continue doing that until the economy is more fully recovered.</p>\n\n<p>This reaffirms the market that the Fed is not on a set timeline when it comes to rolling back current accommodative policies and will, as they have said time and again, wait for concrete data before any considerations are made. This follows a similar statement from Jerome Powell back in April 14, which proves market participants shouldn’t worry about quantitative easing tapering, in my opinion. Powell said, “We will reach the time at which we will taper asset purchases when we have made substantial further progress towards our goals from last December. That would in all likelihood be before, well before, the time we would consider raising interest rates. We have not voted on that order but that is the sense of the guidance.”</p>\n\n<p>Looking ahead, market participants are anxiously waiting for the May Jobs Report, which will be released this Friday. This report will highlight the state of economic recovery, showing whether the labor market has managed to further recover following the extremely disappointing April Job Report. Importantly, the job reports are also used by the Federal Reserve to ascertain if the economy is getting closer to its employment goal, at which point monetary support will begin to taper. </p>\n\n<p><strong>Highlights</strong></p>\n\n<ul>\n<li>Late last week, President Joe Biden unveiled a $6 trillion budget proposal for fiscal 2022, which would include a number of proposals around improving the country&#39;s infrastructure, educational resources and health care system and which would be funded in part by higher taxes. </li>\n<li>Construction spending rose only 0.2% in April over March, a sharp deceleration compared to March over February. Spending rose only 0.2% compared to 1% in March.</li>\n<li>“Meme stocks” continue their strong performance from last week, with AMC gapping up more than 20% again today. Crazy stuff!</li>\n<li>Coinbase (COIN) announced customers would be able to fund their account using Apple and Google wallets </li>\n<li>The price of Tesla vehicles is increasing due to supply chain pressures across the auto industry, particularly for raw materials, Elon Musk said on Monday via Twitter.</li>\n<li><strong>**Please note that current stock price was written premarket and does not reflect intraday changes*\\</strong>*</li>\n<li>Dollar General (DG) target raised by Deutsche Bank from $226 to $231 at Buy. Stock currently around $203</li>\n<li>Goldman Sachs (GS) target raised by Piper Sandler from $385 to $420 at Overweight. Stock currently around $372</li>\n<li>Hess (HESS) target raised by Wells Fargo from $86 to $98 at Overweight. Stock currently around $84</li>\n<li>UnitedHealth Group (UNH) target raised by Bank of America from $450 to $522 at Buy. Stock currently around $412</li>\n<li>UPS target raised by Citigroup from $220 to $235 at Neutral. Stock currently around $215</li>\n<li>The Gap (GPS) target raised by Deutsche Bank from $36 to $38 at Hold. Stock currently around $33.4</li>\n</ul>\n\n<p>“Someone&#39;s sitting in the shade today because someone planted a <strong>tree</strong> a long time ago.” - Warren Buffet</p>\n</div><!-- SC_ON -->",
  "score": 431,
  "permalink": "/r/stocks/comments/nq3ic1/here_is_a_market_recap_for_today_tuesday_june_1/",
  "subreddit": "stocks",
  "id": "nq3ic1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804300264
}