{
  "author": "SpicenNiceCookie",
  "the_new_excerpt": "It seems as though too many anime I've encountered features these in some way.\nFrom the constant oversaturation of harems and issekais, underaged girls being\nseen as viable sexual partners and everyone's waifu seemingly being a 12 year\nold child, all the way to the main character freely going around…",
  "original_created_utc": 1616503743,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "好像我遇到的太多动漫都有这些方面的特点。\n从不断过度饱和的后宫和伊斯卡伊，未成年少女被。\n被视为可行的性伴侣，每个人的waifu似乎都是一个12岁的孩子。\n老小孩，一直到主人公自由自在地到处...",
      "title": "恋童癖和性骚扰怎么会在动漫中如此正常化？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "好像我遇到的太多動漫都有這些方面的特點。\n從不斷過度飽和的後宮和伊斯卡伊，未成年少女被。\n被視爲可行的性伴侶，每個人的waifu似乎都是一個12歲的孩子。\n老小孩，一直到主人公自由自在地到處...",
      "title": "戀童癖和性騷擾怎麼會在動漫中如此正常化？"
    }
  ],
  "title": "How has pedophilia and sexual harassment become so normalised in anime?",
  "created_utc": 1616512390,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems as though too many anime I&#39;ve encountered features these in some way. From the constant oversaturation of harems and issekais, underaged girls being seen as viable sexual partners and everyone&#39;s waifu seemingly being a 12 year old child, all the way to the main character freely going around molesting others without any consequences  because everyone gives him a pass, or everyone tolerates it with phrases such as &#39;he&#39;s not a bad guy, just a perv&quot;, &#39;he&#39;s realistic&#39; or even that it&#39;s just his character flaws. There&#39;s even been incidences of rape and sexual assault being quickly brushed over.</p>\n\n<p>And what&#39;s worse is that these same issues are continually defended or their severity is even sidestepped with phrases of  &#39;it&#39;s not that bad&quot;, &quot;it&#39;s just an anime bro, it&#39;s not real&#39;, &#39;if you don&#39;t like it, don&#39;t watch it&#39;, &#39;she&#39;s 1000 years old&#39;, &#39;he has the body of a child so it&#39;s ok&#39; or whatever seeming justification one can make up.</p>\n\n<p>And it genuinely scares me. I&#39;ll probably get downvoted to all hell for this but I&#39;m honestly quite scared by a lot of the things I&#39;m seeing and how quickly fans go to defend all of it.</p>\n</div><!-- SC_ON -->",
  "score": 245,
  "permalink": "/r/TooAfraidToAsk/comments/mbdzcy/how_has_pedophilia_and_sexual_harassment_become/",
  "subreddit": "TooAfraidToAsk",
  "id": "mbdzcy",
  "is_self": true,
  "media": null,
  "is_video": false
}