{
  "author": "Wididy",
  "the_new_excerpt": "“What if I told you that both the Gates and Bezos Divorces are nothing more than\ncovers to allow each to liquidate large amounts of stock at the peak of a\nmulti-decade asset market top without raising suspicion?”\n\nConspiracy? Yes. Possible? Yes.\n\nLou Pai (CEO of Enron) divorced his wife and the…",
  "original_created_utc": 1620395176,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "\"ゲイツ離婚もベゾス離婚も、何もないと言ったら？\nゲイツとベゾスの離婚は、それぞれが数十年に一度の資産市場のピーク時に、疑われずに大量の株式を清算するためのカバーに過ぎないと言ったらどうだろう？\n疑われないように大量の株を清算するための偽装に過ぎないと言ったら？\"\n\n陰謀？そうです。可能性は？はい。\n\nルー・パイ（エンロンのCEO）は妻と離婚し、...",
      "title": "ビル・ゲイツ氏、離婚という形で株式を清算する"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "\"如果我告诉你，盖茨和贝佐斯的离婚案只不过是\n盖茨和贝索斯的离婚都不过是为了让他们在几十年的资产市场高峰期清算大量的股票而不引起怀疑。\n在数十年的资产市场顶峰时清算大量股票而不引起怀疑呢？\"\n\n阴谋？是的。有可能吗？是的。\n\nLou Pai（安然公司的首席执行官）与他的妻子和...",
      "title": "比尔-盖茨以离婚的形式清算股票"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "\"如果我告訴你，蓋茨和貝佐斯的離婚案只不過是\n蓋茨和貝索斯的離婚都不過是爲了讓他們在幾十年的資產市場高峯期清算大量的股票而不引起懷疑。\n在數十年的資產市場頂峯時清算大量股票而不引起懷疑呢？\"\n\n陰謀？是的。有可能嗎？是的。\n\nLou Pai（安然公司的首席執行官）與他的妻子和...",
      "title": "比爾-蓋茨以離婚的形式清算股票"
    }
  ],
  "title": "Bill Gates liquidating stock in the form of divorce",
  "created_utc": 1620423181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>“What if I told you that both the Gates and Bezos Divorces are nothing more than covers to allow each to liquidate large amounts of stock at the peak of a multi-decade asset market top without raising suspicion?” </p>\n\n<p>Conspiracy? Yes. Possible? Yes.</p>\n\n<p>Lou Pai (CEO of Enron) divorced his wife and the court made him sell his stock so he made out with over 250m unlike his buddies. </p>\n\n<p>What do you think this signals for the stock market?</p>\n\n<p>Edit: To fuel the conspiracy (as said in the comments) <em>It’s not insider trading if it’s court ordered.</em></p>\n\n<p>Positions: pltr 2022/23 leaps \nWatching UVXY leaps</p>\n</div><!-- SC_ON -->",
  "score": 3041,
  "permalink": "/r/wallstreetbets/comments/n6yv3h/bill_gates_liquidating_stock_in_the_form_of/",
  "subreddit": "wallstreetbets",
  "id": "n6yv3h",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620985998946
}