{
  "author": "siebren014",
  "the_new_excerpt": "This morning I read the following article:\nhttps://finance.yahoo.com/news/royal-dutch-shell-plc-fourth-070000026.html\n\nFor those who don’t want to read the whole article: Royal Dutch Shell plc (RDS)\nwill pay its shareholders a quarterly dividend of €0.1396 per A Share. Although\nit’s approximately…",
  "original_created_utc": 1615800675,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "今天上午，我看到了以下文章。\nhttps://finance.yahoo.com/news/royal-dutch-shell-plc-fourth-070000026.html\n\n对于不想看完整篇文章的人来说。荷兰皇家壳牌公司（RDS）\n将向其股东支付每股A股0.1396欧元的季度股息。虽然\n大约",
      "title": "为什么石油公司仍未达到Covid前的估值？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "今天上午，我看到了以下文章。\nhttps://finance.yahoo.com/news/royal-dutch-shell-plc-fourth-070000026.html\n\n對於不想看完整篇文章的人來說。荷蘭皇家殼牌公司（RDS）\n將向其股東支付每股A股0.1396歐元的季度股息。雖然\n大約",
      "title": "爲什麼石油公司仍未達到Covid前的估值？"
    }
  ],
  "title": "Why oil companies are still not at pre- covid valuations",
  "created_utc": 1615814875,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>This morning I read the following article: <a href=\"https://finance.yahoo.com/news/royal-dutch-shell-plc-fourth-070000026.html\">https://finance.yahoo.com/news/royal-dutch-shell-plc-fourth-070000026.html</a></p>\n\n<p>For those who don’t want to read the whole article: Royal Dutch Shell plc (RDS) will pay its shareholders a quarterly dividend of €0.1396 per A Share. Although it’s approximately only 33% of the pre-covid dividend, they have been paying dividends throughout the entirety of 2020, meaning that they were still profitable. A quick look in their figures (<a href=\"https://www.shell.com/investors/investor-presentations/2021-investor-presentations/fourth-quarter-2020-interim-results-presentations.html\">https://www.shell.com/investors/investor-presentations/2021-investor-presentations/fourth-quarter-2020-interim-results-presentations.html</a>)  shows that although their free cash flow and earning decreased, they still made a net profit of $5 billion in 2020. And they have decreased their debt from $79 billion to $75 billion.</p>\n\n<p>Where in the recent months the prices of many stocks have skyrocketed, the oil stocks only have seen small price rises, following the price of crude oil. Royal Dutch Shell is still 30% down in price compared to pre-covid times. These companies seem to have barely, if all have profited from the influx. Why is this? </p>\n\n<p><strong>My opinion:</strong> </p>\n\n<p>The investors that have joined the market in the last year, are mostly idealists. Investing in futuristic, clean companies that “will improve the world”. Besides that, the aircraft industry is still no where near what it used to be, but once covid-restrictions start to be lifted, the aircraft industry will return inevitably. I feel like it’s mostly an image problem of these companies, they’re seen as old-fashioned, not hip and as oil companies. That last part couldn’t be less true. The example I have used Royal Dutch Shell, as well as many other companies that have their origins in oil, have been focussing on cleaner energy for a long while now. Royal Dutch Shell is working on hydrogen, solar power, wind energy and many other forms of clean energy. When the time comes that oil will be used less, they can smoothly transition into clean energy and use their advantage of the market position and experience they possess.  Let me know what you guys think!</p>\n\n<p>Disclaimer: I am in the position of some Royal Dutch Shell, so my opinion may not be completely unbiased, but I bought the stock based on some of the opinions/facts I have expressed in this piece.</p>\n</div><!-- SC_ON -->",
  "score": 119,
  "permalink": "/r/stocks/comments/m5gxkd/why_oil_companies_are_still_not_at_pre_covid/",
  "subreddit": "stocks",
  "id": "m5gxkd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616147382530
}