{
  "author": "nutbuck",
  "original_created_utc": 1642045806,
  "title": "Is it bad to say I would never want a child w special needs?",
  "created_utc": 1642064625,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Ok so I have an older brother who grew up having autism but high functioning and I am the younger sibling. He has always had massive meltdowns in public when I was a child and even literally right now at 23 yrs. During these meltdowns he has had police called on him for coming after my mom multiple times and left a scar on my face when I was 8. Everytime I have fun he has a meltdown and we have to leave. he has taken over my moms life and she works full time as well. She has been yelled and screamed at for years by him. There’s been so many times she’s been so sleep deprived bc she has to stay up till 2 am talking him down and wake up at 6am for work. I’ve always wanted children when I grow up, but am I wrong for believing I never want a child w special needs.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/TooAfraidToAsk/comments/s2poxw/is_it_bad_to_say_i_would_never_want_a_child_w/",
  "subreddit": "TooAfraidToAsk",
  "id": "s2poxw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Ok so I have an older brother who grew up having autism but high functioning and\nI am the younger sibling. He has always had massive meltdowns in public when I\nwas a child and even literally right now at 23 yrs. During these meltdowns he\nhas had police called on him for coming after my mom multiple…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私には自閉症で育った兄がいますが、兄は高機能です。\n私は弟妹です。彼はいつも人前で大暴れしていました。\n子供の頃も、23歳になった今も、文字どおりです。このメルトダウンの間、彼は\n母を追いかけて警察を呼ばれたことも何度か...。",
      "title": "特別なニーズを持つ子供を欲しがらないというのは悪いことでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有一个哥哥，他从小就有自闭症，但功能很强，我是弟弟。\n我是弟弟妹妹。当我还是个孩子时，他总是在公共场合大发雷霆。\n当我还是个孩子的时候，他总是在公共场合大发雷霆，甚至现在已经23岁了。在这些崩溃的过程中，他\n他曾因追打我妈妈而被警察叫去处理......。",
      "title": "说我永远不想要一个有特殊需要的孩子，这不好吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有一個哥哥，他從小就有自閉症，但功能很強，我是弟弟。\n我是弟弟妹妹。當我還是個孩子時，他總是在公共場合大發雷霆。\n當我還是個孩子的時候，他總是在公共場合大發雷霆，甚至現在已經23歲了。在這些崩潰的過程中，他\n他曾因追打我媽媽而被警察叫去處理......。",
      "title": "說我永遠不想要一個有特殊需要的孩子，這不好嗎？"
    }
  ]
}