{
  "author": "keyflusher",
  "original_created_utc": 1656972111,
  "title": "What is the likelihood that Catherine the Great ever ate a banana?",
  "created_utc": 1657029205,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was coming back from the store, eating some delicious frozen dark chocolate covered banana chunks, and thinking about watching some more of &amp;quot;The Great&amp;quot; this evening. I realize that show is not a close friend of real history.&lt;/p&gt;\n\n&lt;p&gt;Still, it got me thinking about what Catherine the Great would have thought of my snack and whether it was likely that she would have ever even eaten a banana at all?&lt;/p&gt;\n\n&lt;p&gt;No clue who else to ask.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 115,
  "permalink": "/r/AskHistorians/comments/vrijnh/what_is_the_likelihood_that_catherine_the_great/",
  "subreddit": "AskHistorians",
  "id": "vrijnh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I was coming back from the store, eating some delicious frozen dark chocolate\ncovered banana chunks, and thinking about watching some more of \"The Great\" this\nevening. I realize that show is not a close friend of real history.\n\nStill, it got me thinking about what Catherine the Great would have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "お店から帰ってきて、おいしい冷凍ダークチョコレートを食べながら、この「ザ・グレート」の続きを見ようと思っていました。\nバナナチャンクを食べながら、「ザ・グレート」の続きを見ようと思っていた。\n今晩も「ザ・グレート」を見ようと思っていた。あの番組は、現実の歴史と密接な関係があるわけではないことは承知している。\n\nそれでも、キャサリン・ザ・グレートならどうしただろうかと考えさせられた。",
      "title": "エカテリーナ大帝がバナナを食べた可能性は？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我从商店回来，正在吃一些美味的冷冻黑巧克力\n覆盖的香蕉块，并想着今晚再看一些 \"伟大 \"的节目。\n晚上。我意识到这个节目不是真实历史的亲密朋友。\n\n不过，它还是让我想到了凯瑟琳大帝会有什么...",
      "title": "凯瑟琳大帝吃过香蕉的可能性有多大？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我從商店回來，正在喫一些美味的冷凍黑巧克力\n覆蓋的香蕉塊，並想着今晚再看一些 \"偉大 \"的節目。\n晚上。我意識到這個節目不是真實歷史的親密朋友。\n\n不過，它還是讓我想到了凱瑟琳大帝會有什麼...",
      "title": "凱瑟琳大帝喫過香蕉的可能性有多大？"
    }
  ]
}