{
  "author": "UnexperiencedIT",
  "original_created_utc": 1634294252,
  "title": "Every coin I sell goes up afterwards. So, by holding them I am preventing them to go up. I am so sorry people.",
  "created_utc": 1634326292,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I feel sorry for anyone who bought the coin after I bought it. </p>\n\n<p>Trust me, the project you chose is great, but it will jump when I sell it, and I will probably sell it in minus. Buy high sell low.</p>\n\n<p>I look at the sea of ​​green last night, only “my” coins were in red, and believe me they are great projects. They are actually still in red. </p>\n\n<p>I was contacted by a couple of whales who were offering me decent sums of money to sell my coins, and I will probably accept that offer. Better something than nothing.  </p>\n\n<p>I&#39;m sorry one more time, maybe I&#39;ll &quot;take one for the team&quot; and sell them right now just so you can get some gains.</p>\n</div><!-- SC_ON -->",
  "score": 176,
  "permalink": "/r/CryptoCurrency/comments/q8lpyo/every_coin_i_sell_goes_up_afterwards_so_by/",
  "subreddit": "CryptoCurrency",
  "id": "q8lpyo",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I feel sorry for anyone who bought the coin after I bought it.\n\nTrust me, the project you chose is great, but it will jump when I sell it, and I\nwill probably sell it in minus. Buy high sell low.\n\nI look at the sea of green last night, only “my” coins were in red, and believe\nme they are great…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私がコインを買った後に買った人には申し訳ないですね。\n\n信じてください、あなたが選んだプロジェクトは素晴らしいものですが、私がそれを売るときにはジャンプします。\nマイナスで売ることになるでしょう。バイ・ハイ・セル・ロー。\n\n昨晩の緑の海を見ると、「私の」コインだけが赤になっていて、信じて\n私のコインだけが赤く染まっていましたが、それは素晴らしいものでした。",
      "title": "私が売ったコインは、その後、すべて上昇します。だから、持っていることで上がるのを防いでいるのです。皆さん、本当に申し訳ありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我为那些在我买下这枚硬币后买下它的人感到遗憾。\n\n相信我，你选择的项目是伟大的，但当我卖掉它时，它就会跳水，而且我可能会以负数出售。\n可能会以减价出售。买高卖低。\n\n我看了看昨晚的绿色海洋，只有 \"我的 \"硬币是红色的，相信我，它们是伟大的。\n相信我，它们是伟大的...",
      "title": "我卖出的每枚硬币都会在之后上涨。因此，通过持有它们，我在阻止它们上涨。我很抱歉，人们。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我爲那些在我買下這枚硬幣後買下它的人感到遺憾。\n\n相信我，你選擇的項目是偉大的，但當我賣掉它時，它就會跳水，而且我可能會以負數出售。\n可能會以減價出售。買高賣低。\n\n我看了看昨晚的綠色海洋，只有 \"我的 \"硬幣是紅色的，相信我，它們是偉大的。\n相信我，它們是偉大的...",
      "title": "我賣出的每枚硬幣都會在之後上漲。因此，通過持有它們，我在阻止它們上漲。我很抱歉，人們。"
    }
  ]
}