{
  "author": "Mammoth-Cream9737",
  "original_created_utc": 1627463772,
  "title": "How do you learn how to have sex?",
  "created_utc": 1627479400,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m a 17M and always decline sexual advances for two reasons.\n1. I’m yet to find anyone I’m attracted to sexually (I find very few people attractive in any fashion)\n2. I have no idea how to have sex. Ok I know the basic theory of having sex with a female, but nothing about how to optimise the experience for my partner. And when boys ask about having sex, I don’t even know where to start and so just politely decline.</p>\n\n<p>So how do I learn the basics of having sex in theory so that if I want to do it some time I’m not totally oblivious?</p>\n</div><!-- SC_ON -->",
  "score": 107,
  "permalink": "/r/TooAfraidToAsk/comments/ot6bpr/how_do_you_learn_how_to_have_sex/",
  "subreddit": "TooAfraidToAsk",
  "id": "ot6bpr",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a 17M and always decline sexual advances for two reasons. 1. I’m yet to find\nanyone I’m attracted to sexually (I find very few people attractive in any\nfashion) 2. I have no idea how to have sex. Ok I know the basic theory of having\nsex with a female, but nothing about how to optimise the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は17Mですが、2つの理由でいつも性的な誘いを断っています。1. まだ、性的に惹かれる人がいない\n1.まだ性的に惹かれる人がいない（どんな形であれ、魅力的な人はほとんどいない\n2.どうやってセックスをすればいいのかわからない。女性とセックスするための基本的な理論は知っていますが\n女性とセックスするための基本的な理論は知っていますが、どのように最適化すればいいのかについては何も知りません...",
      "title": "どのようにしてセックスを学ぶのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个17岁的人，总是拒绝性要求，原因有二。1. 1.我还没有找到\n1.我还没有找到在性方面吸引我的人（我发现很少有人以任何方式吸引我）。\n2.我不知道如何做爱。好吧，我知道与女性发生性关系的基本理论，但对与女性发生性关系一无所知。\n我知道与女性发生性关系的基本理论，但对如何优化性关系一无所知。",
      "title": "你如何学习如何做爱？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個17歲的人，總是拒絕性要求，原因有二。1. 1.我還沒有找到\n1.我還沒有找到在性方面吸引我的人（我發現很少有人以任何方式吸引我）。\n2.我不知道如何做愛。好吧，我知道與女性發生性關係的基本理論，但對與女性發生性關係一無所知。\n我知道與女性發生性關係的基本理論，但對如何優化性關係一無所知。",
      "title": "你如何學習如何做愛？"
    }
  ]
}