{
  "author": "BlessMyBeard",
  "the_new_excerpt": "IRL I have quite thick skin and can take a lot of verbal punishment, owed partly\nbecause of my job. But for some reason I take a lot of things that people say on\nreddit to heart, it can even make me avoid interacting with the website to avoid\ngetting the odd nasty comment. If I do post something,…",
  "original_created_utc": 1611611434,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我的脸皮很厚，可以承受很多言语上的惩罚，部分原因在于\n因为我的工作。但出于某种原因，我把很多事情，人们说在\nreddit的心，它甚至可以让我避免与网站互动，以避免\n获得奇特的讨厌的评论。如果我真的发了东西，...",
      "title": "当其他红人在评论中对你无礼或下流时，还有人感到相当不爽吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的臉皮很厚，可以承受很多言語上的懲罰，部分原因在於\n因爲我的工作。但出於某種原因，我把很多事情，人們說在\nreddit的心，它甚至可以讓我避免與網站互動，以避免\n獲得奇特的討厭的評論。如果我真的發了東西，...",
      "title": "當其他紅人在評論中對你無禮或下流時，還有人感到相當不爽嗎？"
    }
  ],
  "title": "Does anybody else get quite upset when other redditors are rude or nasty to you in the comments?",
  "created_utc": 1611655268,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>IRL I have quite thick skin and can take a lot of verbal punishment, owed partly because of my job. But for some reason I take a lot of things that people say on reddit to heart, it can even make me avoid interacting with the website to avoid getting the odd nasty comment. If I do post something, then I stress over the post for about half an hour before pressing submit so that I don’t get abuse for my grammer or punctuation, or if I thought something that turned out to not be factually true.</p>\n\n<p>Its not something that happens a lot. I mean most of the time 99% of the comments will be lovely and answer the question in the post, if it was a question. But that 1% comment that comes from a troll can really get to me and it ruins the interactive side of reddit.</p>\n\n<p>Personally I try to conduct myself online the same as how I do in person. So I try to be polite, courteous and aware of other peoples situations. I know not everyone does this and they’re not obliged too but I get annoyed when people are horrible online because they feel they can get away with it. I really think this is a case of good morals and ethics... it’s like would you commit a petty crime if you knew you would get away with it.</p>\n\n<p>Do I need to man up and stop being sensitive or do other people sometimes feel like this?</p>\n</div><!-- SC_ON -->",
  "score": 136,
  "permalink": "/r/NoStupidQuestions/comments/l4yj3s/does_anybody_else_get_quite_upset_when_other/",
  "subreddit": "NoStupidQuestions",
  "id": "l4yj3s",
  "is_self": true,
  "media": null,
  "is_video": false
}