{
  "author": "Intelligent-Grade-63",
  "the_new_excerpt": "In the aftermath of the Archegos blow up, the biggest nightmare on Wall Street -\nwhere there is never just one cockroach - is that (many) more Archegos-style,\nhighly levered \"family office\" blow ups are waiting just around the corner.\nWell, in a transaction after the close that is sure to spark much…",
  "original_created_utc": 1617867403,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アルケゴス・ブロウの余波で、ウォール・ストリートでは最大の悪夢となっている。\nゴキブリが一匹だけではないウォールストリートでの最大の悪夢は、高レバレッジの「ファミリー・オフィス」によるアルケゴス・スタイルの爆発が（何度も）すぐ近くに控えていることだ。\nそれは、Archegosのような高レバレッジの \"ファミリーオフィス \"の破綻が、すぐそこまで来ているということです。\nさて、閉店後の取引では、多くの人に刺激を与えることになるでしょう...",
      "title": "Is Another Family Office Blowing Up: JPM、Academy Sportsの9百万株ブロックを売却"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在Archegos炸毁后，华尔街最大的噩梦--。\n在那里，永远不会只有一只蟑螂--那是（许多）更阿基哥斯式的。\n高杠杆的 \"家族办公室 \"爆仓就在眼前等待。\n那么，在交易结束后，肯定会引发很多... ...",
      "title": "又是一个家族办公室炸开了锅。摩根大通甩出9MM股的学府体育块"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在Archegos炸燬後，華爾街最大的噩夢--。\n在那裏，永遠不會只有一隻蟑螂--那是（許多）更阿基哥斯式的。\n高槓杆的 \"家族辦公室 \"爆倉就在眼前等待。\n那麼，在交易結束後，肯定會引發很多... ...",
      "title": "又是一個家族辦公室炸開了鍋。摩根大通甩出9MM股的學府體育塊"
    }
  ],
  "title": "Is Another Family Office Blowing Up: JPM Dumps 9MM Share Block Of Academy Sports",
  "created_utc": 1617875614,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In the aftermath of the Archegos blow up, the biggest nightmare on Wall Street - where there is never just one cockroach - is that (many) more Archegos-style, highly levered &quot;family office&quot; blow ups are waiting just around the corner. Well, in a transaction after the close that is sure to spark much heated controversy tonight and tomorrow morning, Bloomberg announced that JPMorgan was offering a 9 million block of Academy Sports and Outdoors (ASO) stock. Since this is virtually identical to what happened two Fridays ago when similar public BWICs by Goldman and other banks proceeded to unwind the Archegos portfolio, the immediate question on everyone&#39;s lips is whether a second highly levered family office has blown up. There are more similarities: the block offered by JPM is massive: the 9MM shares represents almost a quarter of ASO&#39;s float and roughly 10% of ASO&#39;s total outstanding shares. Furthermore, in what may have been an Archegos-style levered attempt to squeeze the shorts using billions in TRS leverage, ASO stock - whose market cap is $2.8 billion - had surged 25% in the past month... only to tumble 6% after hours. While there are no clear catalysts that could have forced a margin call on the yet-unknown fund (if indeed this is another Archegos), on Tuesday, the stock did drop sharply at the open from $34 to $31, although if that modest drop alone was enough to force margin calls we dread to imagine just how much leverage this fund was using...</p>\n</div><!-- SC_ON -->",
  "score": 1014,
  "permalink": "/r/stocks/comments/mmmlhm/is_another_family_office_blowing_up_jpm_dumps_9mm/",
  "subreddit": "stocks",
  "id": "mmmlhm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617813
}