{
  "author": "arpitagrawal131",
  "original_created_utc": 1630442565,
  "title": "Has your side project ever become your main project?",
  "created_utc": 1630447438,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Just wondering if side projects make it to the main project? We all know a number of companies that started as a side project but became the main product/project somewhere.</p>\n\n<p>I tried 2-3 side projects which are either closed or continue to be side projects. Just wondering if people here started with a side project/hustle and converted it into main projects? How was your journey if you would like to share?</p>\n\n<p>What made you decide to take it up as your main project?</p>\n</div><!-- SC_ON -->",
  "score": 5,
  "permalink": "/r/SideProject/comments/pfef84/has_your_side_project_ever_become_your_main/",
  "subreddit": "SideProject",
  "id": "pfef84",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Just wondering if side projects make it to the main project? We all know a\nnumber of companies that started as a side project but became the main\nproduct/project somewhere.\n\nI tried 2-3 side projects which are either closed or continue to be side\nprojects. Just wondering if people here started with…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ただ、サイドプロジェクトがメインプロジェクトになるかどうかは疑問です。私たちはみんな\nサイドプロジェクトから始まった会社がメインプロジェクトになった例はたくさんあります。\n製品やプロジェクトになった会社をいくつか知っています。\n\n私は2-3のサイドプロジェクトを試しましたが、それらは閉鎖されているか、サイドプロジェクトのままです。\nしています。ただ、ここにいる人たちは、最初は...",
      "title": "サイドプロジェクトがメインプロジェクトになったことはありますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "只是想知道副项目是否能进入主项目？我们都知道\n一些公司开始时是副业，但后来成为主要的\n产品/项目的地方。\n\n我试过2-3个副业项目，它们要么已经关闭，要么继续做副业\n项目。只是想知道这里的人是否从...",
      "title": "你的副业曾经成为你的主要项目吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "只是想知道副項目是否能進入主項目？我們都知道\n一些公司開始時是副業，但後來成爲主要的\n產品/項目的地方。\n\n我試過2-3個副業項目，它們要麼已經關閉，要麼繼續做副業\n項目。只是想知道這裏的人是否從...",
      "title": "你的副業曾經成爲你的主要項目嗎？"
    }
  ]
}