{
  "author": "Independent-Falcon38",
  "the_new_excerpt": "HItbtc is a scam exchange. Period. Let me explain how the scam works. HitBTC\nscams by creating endless obstacles to people trying to access their funds. They\nmake deposits incredibly simple. They make withdrawals incredibly hard. And they\ndo this very opaquely. Crypto deposits NEVER require KYC.…",
  "original_created_utc": 1615021493,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "HItbtc是个骗子交易所。句号。让我解释一下这个骗局是如何运作的。HitBTC\n骗局，给试图获取资金的人制造无尽的障碍。他们\n让存款变得非常简单。他们让取款变得非常困难。而他们\n做到这一点非常不透明。加密存款从来不需要KYC....。",
      "title": "HitBTC是个骗局--他们的骗局究竟是如何运作的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "HItbtc是個騙子交易所。句號。讓我解釋一下這個騙局是如何運作的。HitBTC\n騙局，給試圖獲取資金的人制造無盡的障礙。他們\n讓存款變得非常簡單。他們讓取款變得非常困難。而他們\n做到這一點非常不透明。加密存款從來不需要KYC....。",
      "title": "HitBTC是個騙局--他們的騙局究竟是如何運作的？"
    }
  ],
  "title": "HitBTC is a Scam - Here is Exactly How their Scam Works",
  "created_utc": 1615049268,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>HItbtc is a scam exchange. Period. Let me explain how the scam works.\nHitBTC scams by creating endless obstacles to people trying to access their funds. They make deposits incredibly simple. They make withdrawals incredibly hard. And they do this very opaquely. Crypto deposits NEVER require KYC.\nWhen you sign into HitBTC, there is no indication that KYC is required for withdrawals. In fact, their platform says you can withdraw certain amounts with no KYC. In their ToS though, they make sure to add a clause which says they MIGHT require KYC in certain circumstances. Most users assume that they will be able to withdraw crypto funds without KYC. That is what HitBTC wants you to believe.\nThere are regulated cryptocurrency exchanges around the world which allow you to withdraw your crypto without KYC. Most of them are much larger than HitBTC. There is no international law, or any type of rule, which requires exchanges to KYC a customer before they withdraw their crypto balance. Especially if they are not involved with fiat trading.\nWhat HitBTC did to me was delete my 2 FA code. They do this often. They delete your 2 FA code (of course, with funds on your account), requiring you to go through 2FA recovery process. This takes ages, and they require a bunch of personal and transaction info. They act as if you lost your 2FA device, but actually, they just manually remove it on their end.\nThey expect a good amount of people will never be able to complete 2 FA recovery. It&#39;s a lengthy process, and their support is slow to answer. They know that for small amounts, a lot of people give up right here. They&#39;ll act like they&#39;re trying to help you, but really their entire business model revolves around wearing you out. They get a good amount of crypto to keep just from people not being able to complete the 2 FA recovery.\nNow, 2 FA recovery can eventually be completed. It&#39;ll take a few weeks, maybe months at this point. The customer will think they&#39;re getting somewhere. They&#39;ll get back into their account, see their crypto balance, they&#39;ll feel fairly confident at this point. The support will say there&#39;s a 4 day freezing period on your funds, for safety, after which you&#39;ll be back to normal.\nSo you wait the 4 days, and most people will then try to withdraw their funds. 100% of the time, I guarantee, the withdrawal will fail. Even though it&#39;s well within the stated withdrawal limits, HitBTC will fail your withdrawal. They won&#39;t even tell you why. You&#39;ll need to follow up with support.\nSupport is going to eventually tell you that you need to KYC. They&#39;ll quote some bullshit vague legal reason and say hey, we&#39;re just following the rules. What rules, HitBTC? You&#39;re a sketchy crypto exchange in the fucking Seychelles. You&#39;re a faceless organization. There&#39;s much larger, much more trusted exchanges who don&#39;t have any similar requirement. They are not legally required to KYC you, but they say they must.\nSo now you&#39;re back at their mercy. They&#39;ll ask for photo ID, proof of residence, they&#39;ll ask about what the coins are for. But not all at once. They&#39;ll ask for these things 1-2 at a time, with incredibly slow response times. They&#39;ll ask for new versions of the same thing, higher resolution, higher quality, better lighting. They&#39;ll wear you down. They will do whatever they can for you to just give up.\nThat is how they make their money. They make their money by putting endless obstacles between you and your funds, so that eventually you give up. They ask for personal information like photo ID, proof of residence, etc. which can be resold on the dark web, especially when it&#39;s a crypto user&#39;s documents. These documents can be used to obtain access to your other crypto platforms.\nWho does HitBTC think they are? They&#39;re a sketchy, faceless, reputation-less shitty crypto exchange in Seychelles. Is it reasonable for them to request your personal information, without the reputation to securely store such information? Surely their requests would be illegal in most jurisdictions. Good luck doing anything about it though. You won&#39;t find any real people linked to the HitBTC platform. You gonna go sue their shell company in Seychelles?\nSo here you are, a year into the process, you&#39;ve handed over a mountain of your personal information to a scamming, faceless organization who is holding your funds hostage. If you make a big enough stink on social media, and you&#39;ve completed all of the obstacles, they might in certain cases decide to release your funds. You&#39;ll finally withdraw, pay an exorbitant withdrawal fee (USDT was $65 USD last I checked). You&#39;ll get your funds out, you&#39;ll say, HitBTC wasn&#39;t a scam, they&#39;re just annoying!\nNo, HitBTC absolutely is a scam. The scam is to wear down 95% of people. If you&#39;re one of the 5% that handed every personal document you have to get back your funds, and attacked them on social, after spending dozens of hours on just getting your funds back, you are just a small cost of doing business. The scam doesn&#39;t need to hit 100% of users. It just needs to hit most of them. HitBTC is a scam.</p>\n</div><!-- SC_ON -->",
  "score": 291,
  "permalink": "/r/Bitcoin/comments/lyxuup/hitbtc_is_a_scam_here_is_exactly_how_their_scam/",
  "subreddit": "Bitcoin",
  "id": "lyxuup",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542567861
}