{
  "author": "deburin",
  "the_new_excerpt": "Someone told me that a US long term T bond ETF may be an inferior investment to\na T bond actually bought from the US Treasury.\n\nI want bonds as a bear market reserve; I plan to hold 12% bonds during\nretirement for that purpose. If a bond fund drops in value, but bonds do not, as\nthe poster stated,…",
  "original_created_utc": 1623157258,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ある人から、米国の長期T字債ETFは、実際に米国財務省から買ったT字債に比べて投資効果が劣るのではないかと言われました。\n実際に米国財務省から購入したT字債よりも劣るのではないかと言われました。\n\n債券はベアマーケットに備えて欲しいので、リタイア後は12％の債券を保有する予定です。\nそのために退職後は12％の債券を保有するつもりだ。債券ファンドが値下がりしても債券が値下がりしなければ、投稿者が言うように\n債券ファンドが値下がりしても債券が値下がりしなければ、投稿者が言うように",
      "title": "債券と債券ファンドのどちらを購入すべきか"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有人告诉我，美国长期国债ETF的投资可能不如\n从美国财政部实际购买的T型债券。\n\n我想把债券作为熊市储备；我计划在退休期间持有12%的债券。\n我计划在退休期间持有12%的债券，以达到这个目的。如果债券基金贬值，而债券不贬值，就像\n发帖人所说的那样，...",
      "title": "我应该购买债券还是债券基金"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有人告訴我，美國長期國債ETF的投資可能不如\n從美國財政部實際購買的T型債券。\n\n我想把債券作爲熊市儲備；我計劃在退休期間持有12%的債券。\n我計劃在退休期間持有12%的債券，以達到這個目的。如果債券基金貶值，而債券不貶值，就像\n發帖人所說的那樣，...",
      "title": "我應該購買債券還是債券基金"
    }
  ],
  "title": "Should i buy bonds or bond funds",
  "created_utc": 1623178762,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Someone told me that a US long term T bond ETF may be an inferior investment to a T bond actually bought from the US Treasury.</p>\n\n<p>I want bonds as a bear market reserve; I plan to hold 12% bonds during retirement for that purpose. If a bond fund drops in value, but bonds do not, as the poster stated, the bond would be the better fit.</p>\n\n<p>Have bond funds historically dropped during recessions? Does anyone buy T bonds directly to mitigate this potential concern?</p>\n</div><!-- SC_ON -->",
  "score": 19,
  "permalink": "/r/Bogleheads/comments/nv3hww/should_i_buy_bonds_or_bond_funds/",
  "subreddit": "Bogleheads",
  "id": "nv3hww",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404885449
}