{
  "author": "hoverboardfaq",
  "the_new_excerpt": "So Shopify today removed Donald Trump's stores from the Shopify platform. As\nsomeone who uses Shopify for my business as well as an investor in Shopify I'm\nnot a huge fan of this move.\n\nThis is also a change in the companies stance as previously the Shopify CEO said\nit's not his place to make moral…",
  "original_created_utc": 1610056442,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "因此，Shopify今天将唐纳德·特朗普的商店从Shopify平台上撤下。作为\n为我的业务使用Shopify的人，同时也是Shopify的投资者\n我不太喜欢这一举动。\n\n这也是公司立场的改变，就像之前Shopify首席执行官说的那样\n这不是他的职责让道德…",
      "title": "Shopify撤下唐纳德·特朗普商店，投资者如何看待这一举措？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，Shopify今天將唐納德·特朗普的商店從Shopify平臺上撤下。作爲\n爲我的業務使用Shopify的人，同時也是Shopify的投資者\n我不太喜歡這一舉動。\n\n這也是公司立場的改變，就像之前Shopify首席執行官說的那樣\n這不是他的職責讓道德…",
      "title": "Shopify撤下唐納德·特朗普商店，投資者如何看待這一舉措？"
    }
  ],
  "title": "Shopify Removes Donald Trumps Stores, What Do Investors Think of This Move?",
  "created_utc": 1610110415,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So Shopify today removed Donald Trump&#39;s stores from the Shopify platform. As someone who uses Shopify for my business as well as an investor in Shopify I&#39;m not a huge fan of this move.</p>\n\n<p>This is also a change in the companies stance as previously the Shopify CEO said it&#39;s not his place to make moral judgements about who can and can&#39;t have a store. It&#39;s also important to point out Trump love him or hate him didn&#39;t violate Shopify TOS.</p>\n\n<p>A big discussion in the world of eCommerce ie Shopify users and customers is owning your platform ie building your own website vs leasing ie something like Shopify or BigCommerce. While the movement is to a leased model hence Shopify&#39;s success, there is something to be said for not being reliant on a third parties rules or decisions which is exactly what happenned here.</p>\n\n<p>Anyone running a business which is in the very least controversial will find this troubling that Shopify if they disagree with your politics, your niche, your products, your actions could take you down.</p>\n\n<p>Generally speaking I think this will go over pretty smoothly as everyone hates Trump and the media isn&#39;t gonna take up on this issue but as a Shopify user and investor I find this troubling.</p>\n</div><!-- SC_ON -->",
  "score": 45,
  "permalink": "/r/stocks/comments/ksnskv/shopify_removes_donald_trumps_stores_what_do/",
  "subreddit": "stocks",
  "id": "ksnskv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706379526
}