{
  "author": "DoItYrselfLiberation",
  "original_created_utc": 1655561926,
  "title": "This is not capitulation. Not even close.",
  "created_utc": 1655581114,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;When posts titled &amp;quot;Now is when money is made&amp;quot; are getting hundreds of upvotes, now is not when money is made.  When people still recognize the promise of crypto the price will continue to drop.  Dca has no place in a true call of the bottom.&lt;/p&gt;\n\n&lt;p&gt;When crypto is declared dead and nobody argues, that&amp;#39;s a good time to buy.  Sounds crazy but that&amp;#39;s what capitulation is.  Wait until you have resigned yourself to looking at your stupid boss&amp;#39;s face for the rest of your life.  Wait until you haven&amp;#39;t checked this sub or charts for months.  Wait until your friends brag about the 3% returns they&amp;#39;re getting from their savings accounts at the bank.  That&amp;#39;s what a bottom looks like.  That&amp;#39;s when you pick yourself up and start rebuilding.&lt;/p&gt;\n\n&lt;p&gt;My head is bloodied, but unbowed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 444,
  "permalink": "/r/CryptoCurrency/comments/vf77e2/this_is_not_capitulation_not_even_close/",
  "subreddit": "CryptoCurrency",
  "id": "vf77e2",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "When posts titled \"Now is when money is made\" are getting hundreds of upvotes,\nnow is not when money is made. When people still recognize the promise of crypto\nthe price will continue to drop. Dca has no place in a true call of the bottom.\n\nWhen crypto is declared dead and nobody argues, that's a…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今が儲かるとき」というタイトルの投稿が数百のアップヴォートを獲得しているとき。\n今が儲かる時ではありません。人々がまだ暗号の可能性を認識しているとき\n価格は下がり続けるでしょう。Dcaは、底値の真の呼び出しのための場所を持っていません。\n\n暗号は死んだと宣言され、誰も反論しない場合、それは...",
      "title": "これは屈服ではない。全く違う。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "当标题为 \"现在是赚钱的时候 \"的帖子得到数百次的支持时。\n现在不是赚钱的时候。当人们仍然认可加密货币的前景时\n价格就会继续下跌。DCA在真正的底部召唤中没有地位。\n\n当加密货币被宣布死亡而没有人争论时，这就是一个...",
      "title": "这不是屈服。还差得远呢。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "當標題爲 \"現在是賺錢的時候 \"的帖子得到數百次的支持時。\n現在不是賺錢的時候。當人們仍然認可加密貨幣的前景時\n價格就會繼續下跌。DCA在真正的底部召喚中沒有地位。\n\n當加密貨幣被宣佈死亡而沒有人爭論時，這就是一個...",
      "title": "這不是屈服。還差得遠呢。"
    }
  ]
}