{
  "author": "Big_carrot_69",
  "original_created_utc": 1660317763,
  "title": "I was on a date yesterday and this girl was talking about her ex bf about 90% of the time. I told her that I'm sick of it (once i drunk my beer) and left. Did I do the right thing?",
  "created_utc": 1660321906,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;She texted me to apologize but she also said &amp;quot;you could have said  something if you were annoyed&amp;quot;,\nEven though i was throwing a few hints like &amp;quot;yeah, let&amp;#39;s not talk about exes&amp;quot; type stuff she kept going and i just stopped paying attention and i was just drinking my beer/s and then left.&lt;/p&gt;\n\n&lt;p&gt;Edit : What annoyed me the most, was when she started comparing me with her ex.\nLike : &amp;quot;oh yeah,  X had a BMW on your age&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Edit 2: i forgot to add : she showed me a few pics of them... Together... Hugging \n lol&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 121,
  "permalink": "/r/NoStupidQuestions/comments/wmnyeb/i_was_on_a_date_yesterday_and_this_girl_was/",
  "subreddit": "NoStupidQuestions",
  "id": "wmnyeb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "She texted me to apologize but she also said \"you could have said something if\nyou were annoyed\", Even though i was throwing a few hints like \"yeah, let's not\ntalk about exes\" type stuff she kept going and i just stopped paying attention\nand i was just drinking my beer/s and then left.\n\nEdit : What…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼女からは謝罪のメールが来たのですが、「イライラしているなら何か言ってくれればよかったのに」とも言われました。\nとか、「ああ、もうやめよう」とか、そういうヒントを出していたのに、「イライラしてたんでしょ？\n元彼の話はやめよう」みたいなことを言ったのに、彼女はそのまま続けていて、僕は注意するのをやめた。\nと言って、ビールを飲んで帰りました。\n\n編集部：えっ...",
      "title": "昨日デートしたんだけど、その子は9割方元カレの話をしてた。僕はもううんざりだと言って（ビールを飲み干した後）、その場を離れた。僕は正しいことをしたのだろうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "她给我发短信道歉，但她也说：\"如果你恼火的话，你可以说点什么。\n尽管我给了她一些暗示，比如 \"是的，我们不谈这个了\"。\n谈论前任 \"之类的话，她还是继续说下去，我就不再注意了。\n我只是在喝我的啤酒，然后就离开了。\n\n编辑：什么...",
      "title": "昨天我在约会，这个女孩大约90%的时间都在谈论她的前男友。我告诉她我已经厌倦了（一旦我喝了啤酒），然后离开了。我做得对吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "她給我發短信道歉，但她也說：\"如果你惱火的話，你可以說點什麼。\n儘管我給了她一些暗示，比如 \"是的，我們不談這個了\"。\n談論前任 \"之類的話，她還是繼續說下去，我就不再注意了。\n我只是在喝我的啤酒，然後就離開了。\n\n編輯：什麼...",
      "title": "昨天我在約會，這個女孩大約90%的時間都在談論她的前男友。我告訴她我已經厭倦了（一旦我喝了啤酒），然後離開了。我做得對嗎？"
    }
  ]
}