{
  "author": "twentyonemillion",
  "the_new_excerpt": "As a GME shareholder, i felt financially abused or even r*ped today. I really\nfelt powerless, as my hard earned money went down the drain, because of a\ncurrupt system, while the media (especially CNBC) is pointing at us as the bad\nguys.\n\nOur democracy is fine as long as the people at the top get the…",
  "original_created_utc": 1611889835,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "作为GME的股东，我今天感觉到了经济上的虐待，甚至是被强奸。我真的\n感到无能为力，因为我辛辛苦苦赚来的钱就这样付诸东流了。\n腐败系统，而媒体（尤其是CNBC）却指责我们是坏的。\n伙计们。\n\n我们的民主很好，只要上层的人得到... ...",
      "title": "分散型财政是唯一的出路"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲GME的股東，我今天感覺到了經濟上的虐待，甚至是被強姦。我真的\n感到無能爲力，因爲我辛辛苦苦賺來的錢就這樣付諸東流了。\n腐敗系統，而媒體（尤其是CNBC）卻指責我們是壞的。\n夥計們。\n\n我們的民主很好，只要上層的人得到... ...",
      "title": "分散型財政是唯一的出路"
    }
  ],
  "title": "decentralized finance is the only way",
  "created_utc": 1611981335,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a GME shareholder, i felt financially abused or even r*ped today. I really felt powerless, as my hard earned money went down the drain, because of a currupt system, while the media (especially CNBC) is pointing at us as the bad guys.</p>\n\n<p><strong>Our democracy is fine as long as the people at the top get the biggest share of the cake.</strong> There are more and more cases, where we can truly see the problems we are dealing with (Snowden, bank bailouts, robinhood selling stop losses and buyorder information to hedge funds so they can outplay the retail investor,..)</p>\n\n<p>Till today, I owned Bitcoin mainly because of price speculation. (A little bit because I&#39;m kind of a nerd and want to be part of this digital innovation.) I thought that the censorship aspect of Bitcoin is needed for people in China or Africa. Jokes on me. It&#39;s not. It&#39;s needed for all of us. Today i realized that there is <strong>nothing as true as Bitcoin.</strong></p>\n\n<p>NOTHING IS EVEN CLOSE AS WORTH AS BITCOIN. I will convert 75% of my income directly into Bitcoin from now on - no matter what price it will be. I do not trust my bank or any big institution anymore. A promise is worth nothing today.</p>\n\n<p>See you in a better future - for our kids and grandchildren - in a <strong>decentralized</strong> <strong>world</strong>.</p>\n\n<p>&#x200B;</p>\n\n<p>Thanks.</p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/Bitcoin/comments/l7hh63/decentralized_finance_is_the_only_way/",
  "subreddit": "Bitcoin",
  "id": "l7hh63",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1612518521774
}