{
  "author": "SerCrumb",
  "original_created_utc": 1644778883,
  "title": "Why did the vikings (and generally norwegians) build everything in wood?",
  "created_utc": 1644798256,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So,  I am not sure this is the right place to ask this but I am a baffled italian that has travelled North to discover that absolutely nothing in Norway is actually old because their cities kept burning too the ground. In my homeland roman-era structures have withstood earthquakes and volcano eruptions and 2000 years of wars and history. Whilst in Bergen, the rainiest city in Europe so not the most flammable I assume, there has been an average of a fire every 20 years that burnt the city to the ground, the last big one in 1955. Similar stories are found in many norwegian cities I have been to and traces of their past have been entirely destroyed by fires, but in the little I have seen of swedish and danish cities this is not always the case, I&amp;#39;ve seen castles and housing from at least the renaissance. Instead in Norway, cities that would be as old as many french, british and german cities look modern-ish because of the choice of materials their past erased entirely. I thought it could be poverty, but Bergen was a center of trade and a fairly large city for the time I seem to understand, it was even the capital at some point and they say even then that the main stone structure (Haakon&amp;#39;s Hallen) was built on initiative of a danish princess. Guides say that working with stones was expensive, but most of these cities are close to mountains, I&amp;#39;m no geologist but rocks don&amp;#39;t appear to be scarce. What crucial resource was missing?  Or is it just a matter of preference? Because I imagine that having a whole city burn down to be quite a hassle, especially 2-3 times in a lifetime.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/srq3on/why_did_the_vikings_and_generally_norwegians/",
  "subreddit": "AskHistorians",
  "id": "srq3on",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, I am not sure this is the right place to ask this but I am a baffled italian\nthat has travelled North to discover that absolutely nothing in Norway is\nactually old because their cities kept burning too the ground. In my homeland\nroman-era structures have withstood earthquakes and volcano…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ここで質問していいのかわかりませんが、私は困惑しているイタリア人です。\nノルウェーには何もないことを発見しました。\nというのも、彼らの都市は焼き尽くされ続けているからです。私の故郷では\nローマ時代の建造物は、地震や火山に耐えてきました。",
      "title": "なぜバイキングは（そしてノルウェー人は）、すべてを木で作ったのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我不确定在这里问这个问题是否合适，但我是一个困惑的意大利人。\n我是一个困惑的意大利人，我去北方旅行，发现挪威绝对没有什么东西是古老的。\n因为他们的城市不断被烧毁。在我的祖国\n罗马时代的建筑经受住了地震和火山的考验......",
      "title": "为什么维京人（和一般挪威人）要用木头建造一切？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不確定在這裏問這個問題是否合適，但我是一個困惑的意大利人。\n我是一個困惑的意大利人，我去北方旅行，發現挪威絕對沒有什麼東西是古老的。\n因爲他們的城市不斷被燒燬。在我的祖國\n羅馬時代的建築經受住了地震和火山的考驗......",
      "title": "爲什麼維京人（和一般挪威人）要用木頭建造一切？"
    }
  ]
}