{
  "author": "BrownTransGirl",
  "original_created_utc": 1626959619,
  "title": "I hate being poor. I've done all this research, and all the money I have to put in crypto is going into crypto. It's not much, but I hope crypto can give me the leg up to do things I've dreamed of like...",
  "created_utc": 1626996781,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>-Having a house</p>\n\n<p>-Getting a car that can actually handle my new england dirt road</p>\n\n<p>-Getting decent insurance that can actually cover the things I need (especially tooth work)</p>\n\n<p>-Making my full 6k contributions to my IRA </p>\n\n<p>-pay off my student loans (they&#39;re only 15k, but that&#39;s still out of reach)</p>\n\n<p>-Only work part time and still get ahead</p>\n\n<p>That&#39;s my crypto dream. I&#39;m don&#39;t have a large enough investment to get retirement money in one go, but I might be able to move towards a more sustainable life.</p>\n\n<p>What&#39;s your crypto dream?</p>\n\n<p>I&#39;m especially curious if, like me, you make less than 30k/yr, and if you make more, like, please acknowledge that you do. It&#39;s hard for me to remember that some of you make a LOT more than I currently can. </p>\n\n<p>Not asking you to doxx yourself, but to find language that says clearly that you&#39;re not forced to choose between investing and housing/meals/emergency savings.</p>\n</div><!-- SC_ON -->",
  "score": 155,
  "permalink": "/r/CryptoCurrency/comments/opdkij/i_hate_being_poor_ive_done_all_this_research_and/",
  "subreddit": "CryptoCurrency",
  "id": "opdkij",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "-Having a house\n\n-Getting a car that can actually handle my new england dirt road\n\n-Getting decent insurance that can actually cover the things I need (especially\ntooth work)\n\n-Making my full 6k contributions to my IRA\n\n-pay off my student loans (they're only 15k, but that's still out of reach)\n\n…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "-家を持つこと\n\n-ニューイングランドのダートロードを走れる車を手に入れる。\n\n-必要なものをカバーする適切な保険に加入する（特に歯の治療）。\n歯の治療）。)\n\n-IRAに6,000ドルを全額拠出する。\n\n-学生ローンを完済する（1万5千円しかないが、まだ手が届かない）。\n\n...",
      "title": "貧乏は嫌だ。これだけの調査をして、私が持っているお金はすべてcryptoに入れています。大した額ではありませんが、暗号が私に夢見ていたことをするための足掛かりになればと思っています..."
    },
    {
      "locale": "zh",
      "the_new_excerpt": "-拥有一栋房子\n\n-有一辆能真正应付我的新英格兰土路的汽车\n\n-获得体面的保险，能够真正涵盖我需要的东西（特别是\n牙科工作）。)\n\n-为我的IRA缴纳足额的6千美元。\n\n-还清我的学生贷款（虽然只有1.5万，但还是遥不可及）。\n\n...",
      "title": "我讨厌贫穷。我已经做了所有这些研究，我所有的钱都要投入到加密货币中。虽然不多，但我希望加密货币能给我一个台阶，让我做我梦寐以求的事情，比如..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "-擁有一棟房子\n\n-有一輛能真正應付我的新英格蘭土路的汽車\n\n-獲得體面的保險，能夠真正涵蓋我需要的東西（特別是\n牙科工作）。)\n\n-爲我的IRA繳納足額的6千美元。\n\n-還清我的學生貸款（雖然只有1.5萬，但還是遙不可及）。\n\n...",
      "title": "我討厭貧窮。我已經做了所有這些研究，我所有的錢都要投入到加密貨幣中。雖然不多，但我希望加密貨幣能給我一個臺階，讓我做我夢寐以求的事情，比如..."
    }
  ]
}