{
  "author": "theepicone111",
  "the_new_excerpt": "I’m sure many of us are in a position where we are 5,10,20,30% down on some of\nour positions but we want to buy the dip. You know if you buy the dip, you’ll\nhave no free cash for another month.\n\nI’ve got my eyes on Tesla which I don’t own any of, although there are many\nother stocks I want to get in…",
  "original_created_utc": 1616674422,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我相信我们很多人都处于这样的境地，我们在一些人的身上降了5、10、20、30%。\n但我们想买入跌停板。你知道，如果你买了跌停板，你就会。\n又有一个月没有闲钱了。\n\n我盯上了特斯拉，我没有任何的，虽然有很多的。\n其他的股票，我想进入... ...",
      "title": "买完了蘸料，没钱了"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我相信我們很多人都處於這樣的境地，我們在一些人的身上降了5、10、20、30%。\n但我們想買入跌停板。你知道，如果你買了跌停板，你就會。\n又有一個月沒有閒錢了。\n\n我盯上了特斯拉，我沒有任何的，雖然有很多的。\n其他的股票，我想進入... ...",
      "title": "買完了蘸料，沒錢了"
    }
  ],
  "title": "Buying the dip, no money left",
  "created_utc": 1616682304,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I’m sure many of us are in a position where we are 5,10,20,30% down on some of our positions but we want to buy the dip. You know if you buy the dip, you’ll have no free cash for another month. </p>\n\n<p>I’ve got my eyes on Tesla which I don’t own any of, although there are many other stocks I want to get in on. Are you holding out until this volatility passes? It seems very possible we could plunge deeper, or equally as likely to shoot back up 20% in a day. </p>\n\n<p>I’m in the edge of deciding whether to hoard cash for a few months or keep buying in until I’m broke. Indices like the NASDAQ are making moves above 1% daily yet the VIX somehow is going down. What are your plays? Any really cheap stocks that have been beaten down more than they deserve? </p>\n\n<p>I currently own AAPL, PLTR, NIO, XPENG, VACQ, ARKF, ARKG and am down significantly. Sure the recovery stocks may have a 10% upside at the moment but long term, they are stagnant and can’t expect much growth from them if they don’t drastically change their business plans.</p>\n</div><!-- SC_ON -->",
  "score": 398,
  "permalink": "/r/stocks/comments/mcwtgi/buying_the_dip_no_money_left/",
  "subreddit": "stocks",
  "id": "mcwtgi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357141507
}