{
  "author": "ICanChangeTheWorld",
  "the_new_excerpt": "People don't see the full idea behind Michael Burry's TSLA short. Every single\narticle is about how he tweeted at papa Musk and how he thinks that the company\nis the worst thing since he dropped his glass eye into his cat's litter box.\n\nHe doesn't think that Tesla will implode. He doesn't think it's…",
  "original_created_utc": 1622433718,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "人々はMichael BurryのTSLAショートの完全なアイデアを見ていない。どの記事も\n彼がパパ・マスクにツイートしたことや、彼が猫のトイレにガラスの目を落として以来、この会社は最悪だと考えていることについての記事です。\n眼鏡を猫のトイレに落として以来の最悪の事態だと考えていることが書かれています。\n\n彼はTeslaが崩壊するとは思っていません。彼はそれが...",
      "title": "Burry社の534万ドルのTeslaショートについて、人々は的外れなことを言っている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "人们没有看到Michael Burry做空TSLA背后的全部想法。每一篇\n文章都是关于他如何在推特上抨击马斯克爸爸，以及他如何认为该公司\n是他把玻璃眼睛掉进猫砂盆后最糟糕的事情。\n\n他不认为特斯拉会内爆。他不认为它是...",
      "title": "人们对伯利的5.34亿美元特斯拉空头的看法是错误的"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "人們沒有看到Michael Burry做空TSLA背後的全部想法。每一篇\n文章都是關於他如何在推特上抨擊馬斯克爸爸，以及他如何認爲該公司\n是他把玻璃眼睛掉進貓砂盆後最糟糕的事情。\n\n他不認爲特斯拉會內爆。他不認爲它是...",
      "title": "人們對伯利的5.34億美元特斯拉空頭的看法是錯誤的"
    }
  ],
  "title": "People are missing the point on Burry's $534m Tesla short",
  "created_utc": 1622457181,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>People don&#39;t see the full idea behind Michael Burry&#39;s TSLA short. Every single article is about how he tweeted at papa Musk and how he thinks that the company is the worst thing since he dropped his glass eye into his cat&#39;s litter box.</p>\n\n<p>He doesn&#39;t think that Tesla will implode. He doesn&#39;t think it&#39;s a failing company. He just sees the reality, which is that all of their profits/revenues are way in the future.</p>\n\n<p>Let&#39;s just say you win a time-delayed lottery and get $1,000,000 in 15 years. Not bad! Now let&#39;s say you won the same lottery in Venezuela in 2005. It&#39;s not even worth cashing the ticket.</p>\n\n<p>It&#39;s the same deal with companies. Growth companies, however promising, have most of their expected profits in the future. Those profits have to be discounted by the <strong>interest rate</strong> to be turned into todays dollars. In other words, it doesn&#39;t matter how much money Tesla is going to make in the future if interest rates surge today. Well... it does matter... it&#39;s just worth a lot less.</p>\n\n<p>So how does this relate to the Burry bet? You just have to scroll down a few lines on his 13F filing.</p>\n\n<p>Burry has almost as many GOOG/FB calls as he does TSLA puts. Around ~$330MM of them. Why does this matter? These are big tech companies that are actually printing out metric shit-tons of profit today.</p>\n\n<p>Interest rates stay the same but big tech goes up? Break even. Big tech goes down? Break even. Interest rates rise? Burry makes more money in a year than all of your wives boyfriends combined.</p>\n\n<p>TL;DR:</p>\n\n<p>The Burry TSLA short isn&#39;t a bet against Tesla, it&#39;s a bet on interest rates rising (AKA inflation).</p>\n</div><!-- SC_ON -->",
  "score": 10315,
  "permalink": "/r/wallstreetbets/comments/nosznl/people_are_missing_the_point_on_burrys_534m_tesla/",
  "subreddit": "wallstreetbets",
  "id": "nosznl",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622804304075
}