{
  "author": "theoakmike",
  "the_new_excerpt": "In case you're wondering ..NO, I am not here to shill Monero. I don't even hold\nany Monero. In fact, I didn't even do any research into Monero until today.\nPlease, don't buy Monero just because I am writing this.\n\nIf you look at my history, I am completely against shitcoins and the shilling of\ncoins…",
  "original_created_utc": 1616237623,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "如果你想知道......不，我不是来推销Monero的。我甚至不持有\n任何Monero。事实上，在今天之前，我甚至没有对Monero做任何研究。\n请不要因为我写这篇文章就买Monero。\n\n如果你看看我的历史，我是完全反对屎币和shilling的。\n币...",
      "title": "让我们来谈谈Monero..."
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "如果你想知道......不，我不是來推銷Monero的。我甚至不持有\n任何Monero。事實上，在今天之前，我甚至沒有對Monero做任何研究。\n請不要因爲我寫這篇文章就買Monero。\n\n如果你看看我的歷史，我是完全反對屎幣和shilling的。\n幣...",
      "title": "讓我們來談談Monero..."
    }
  ],
  "title": "Let's talk about Monero..",
  "created_utc": 1616262722,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>In case you&#39;re wondering ..NO, <strong>I am not here to shill Monero</strong>. I don&#39;t even hold any Monero. In fact, I didn&#39;t even do any research into Monero until today. Please, don&#39;t buy Monero just because I am writing this.</p>\n\n<p>If you look at my history, I am completely against shitcoins and the shilling of coins in general. But I have seen an increased number of posts about Monero here in the past few days, some of which do seem like shilling.</p>\n\n<p>For me personally, a project needs to <strong>have a purpose</strong> and it needs to <strong>solve a problem</strong>. Even better if it cannot easily be replicated by another project. I am still amazed that people are putting money into coins that have absolutely no purpose other than getting more people to buy it to push up the price. Bitcoin has a purpose, so does Cardano, Cosmos, Ethereum, Chiliz, etc.</p>\n\n<p>Monero (besides having a memorable name), seems to have a purpose like that and seems to solve a problem as well: PRIVACY. From what I understand, people cannot see how much you hold in your Monero wallet and they cannot see who is sending money to who, or receiving money from where. Correct me if I am wrong. I am surprised this isn&#39;t a big issue yet with cryptocurrencies. Besides that, it has been around since 2014, so it&#39;s unlikely to perform a rugpull anytime soon.</p>\n\n<p>Looking at the charts, I have no idea what happened with Monero after 2018. Why did crash so low and is only now recovering? Does anyone know?</p>\n\n<p>Let&#39;s talk more about it. I am interested to hear your thoughts and learn something new. Again, I don&#39;t hold any Monero. And please don&#39;t buy just because of this post.</p>\n</div><!-- SC_ON -->",
  "score": 229,
  "permalink": "/r/CryptoCurrency/comments/m94oj5/lets_talk_about_monero/",
  "subreddit": "CryptoCurrency",
  "id": "m94oj5",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1616752815289
}