{
  "author": "novastar11",
  "original_created_utc": 1652272278,
  "title": "Crypto Market Manipulation by Citadel",
  "created_utc": 1652280118,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;By now you&amp;#39;ve likely seen the theory that Citadel is to blame for the depegging of UST. Most will likely chalk this up to a conspiracy theory but after having seen the manipulation Citadel is capable of from a certain stonk over the last year and a half I honestly personally 100% believe the theory. In the last couple months Ken Griffin was already in the news talking about essentially becoming a market maker for the crypto markets. &lt;/p&gt;\n\n&lt;p&gt;They are already experts at profiting off of destroying companies on the US market through criminal means even in a regulated market so if you don&amp;#39;t think they could do so in an unregulated crypto market you are naive. Heed my words, they are looking to be top dogs in the crypto markets to make manipulation even easier for them, this is just the beginning. If they become &amp;quot;market makers&amp;quot; in the crypto markets then anyone who&amp;#39;s long on their coins should be worried. If you personally don&amp;#39;t believe the theory that&amp;#39;s fine but you can&amp;#39;t argue that&amp;#39;s it&amp;#39;s not certainly plausible if you&amp;#39;ve done any DD on Citadel.   &lt;/p&gt;\n\n&lt;p&gt;For those who are not familiar with the theory yet here&amp;#39;s a quick ELI5&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Citadel borrows 100k BTC&lt;/li&gt;\n&lt;li&gt;Trades 25k BTC for UST&lt;/li&gt;\n&lt;li&gt;Opens a short&lt;/li&gt;\n&lt;li&gt;Starts dumping 75k BTC aggressively&lt;/li&gt;\n&lt;li&gt;Once BTC reached 30k they started dumping UST to make it lose its peg&lt;/li&gt;\n&lt;li&gt;Now Kwon is forced to sell 25k BTC at a major loss to recover the peg, further dumping the price of BTC&lt;/li&gt;\n&lt;li&gt;Meanwhile Citadel is shorting all the way&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 546,
  "permalink": "/r/CryptoCurrency/comments/un8rch/crypto_market_manipulation_by_citadel/",
  "subreddit": "CryptoCurrency",
  "id": "un8rch",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "By now you've likely seen the theory that Citadel is to blame for the depegging\nof UST. Most will likely chalk this up to a conspiracy theory but after having\nseen the manipulation Citadel is capable of from a certain stonk over the last\nyear and a half I honestly personally 100% believe the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今までに、USTの脱退はシタデルのせいだという説を見たことがあると思います。\n説を目にしたことがあると思います。多くの人は、これを陰謀論と決めつけるかもしれませんが、私たちは\nこの1年半、シタデルがある石からできる操作を見た後では、正直、個人的には100％信じている。\nこの1年半、ある石からシタデルが操作できるのを見た後では、正直、個人的には100％そう信じている...。",
      "title": "シタデルによる暗号化市場の操作"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "现在，你可能已经看到了这样的理论，即Citadel应该被指责为剥夺了UST的权利\n的理论。大多数人可能会把这归结为阴谋论，但在过去的一段时间里，他们看到了Citadel能够从某个人身上操纵的情况。\n在过去一年半的时间里，我亲眼目睹了Citadel在某一领域的操纵能力。\n在过去一年半的时间里，我真的个人100%相信...",
      "title": "Citadel的加密货币市场操纵行为"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "現在，你可能已經看到了這樣的理論，即Citadel應該被指責爲剝奪了UST的權利\n的理論。大多數人可能會把這歸結爲陰謀論，但在過去的一段時間裏，他們看到了Citadel能夠從某個人身上操縱的情況。\n在過去一年半的時間裏，我親眼目睹了Citadel在某一領域的操縱能力。\n在過去一年半的時間裏，我真的個人100%相信...",
      "title": "Citadel的加密貨幣市場操縱行爲"
    }
  ]
}