{
  "author": "yosimba2000",
  "original_created_utc": 1660629355,
  "title": "Why can't objects be seen if they are smaller than the wavelength you are using?",
  "created_utc": 1660658707,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is there a physical visualization that can help reinforce this? I&amp;#39;m not seeing the relationship between the wavelength and physical object size.&lt;/p&gt;\n\n&lt;p&gt;The wavelength of light is continuous, and describes the E/M vector at a point. So if we have an atom at some position X, and we shoot an infinitely thin beam of visible light (wavelength larger than atom&amp;#39;s size), the light must travel and hit the atom at position X because the light is continuous. It&amp;#39;s not like the lightwave just skips over position X. So the atom should interact with the visible light, somehow. If it were to reflect the visible light back to us, then why can&amp;#39;t we see the atom?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 127,
  "permalink": "/r/askscience/comments/wpmb50/why_cant_objects_be_seen_if_they_are_smaller_than/",
  "subreddit": "askscience",
  "id": "wpmb50",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is there a physical visualization that can help reinforce this? I'm not seeing\nthe relationship between the wavelength and physical object size.\n\nThe wavelength of light is continuous, and describes the E/M vector at a point.\nSo if we have an atom at some position X, and we shoot an infinitely thin…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これを強化するための物理的なビジュアライゼーションはあるのでしょうか？波長と物理的な大きさの関係が\n波長と物理的な物体の大きさの関係がわからない。\n\n光の波長は連続的であり、ある点でのE/Mベクトルを記述します。\n原子の位置がXで 無限に薄い光線を...",
      "title": "使っている波長より小さい物体は、なぜ見えないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有没有一种物理上的可视化，可以帮助加强这一点？我没有看到\n波长和物理物体大小之间的关系。\n\n光的波长是连续的，它描述了一个点的E/M矢量。\n因此，如果我们有一个原子在某个位置X，而我们射出一个无限细的...",
      "title": "如果物体比你所使用的波长小，为什么不能被看到？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有沒有一種物理上的可視化，可以幫助加強這一點？我沒有看到\n波長和物理物體大小之間的關係。\n\n光的波長是連續的，它描述了一個點的E/M矢量。\n因此，如果我們有一個原子在某個位置X，而我們射出一個無限細的...",
      "title": "如果物體比你所使用的波長小，爲什麼不能被看到？"
    }
  ]
}