{
  "author": "HuskerNatChamps2020",
  "original_created_utc": 1634750955,
  "title": "The 7 Do's and Don't of trading in a bull market.",
  "created_utc": 1634766049,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Recently (as in the last 48 hours) there have been some strong indicators that we are heading straight into a historic bull run. Whether that&#39;s true or not is yet to be discovered so I think now would be the best time to give some new or old investors some tips on trading in a bull market. I have been active in this sub since 2017 and have been on the winning end and losing end of 2 bull markets and maybe now, 3. Through my years I have accumulated a wealth of knowledge that I should have allocated to my studies, but college does not give me 300% gainz in 6 months… so fuck that i’ll slide by with C’s. </p>\n\n<p>Let&#39;s get into it. </p>\n\n<p><strong>The 7 DO’s and DONT’s of trading crypto in a bull market.</strong> </p>\n\n<p><strong>DO</strong></p>\n\n<ol>\n<li><strong>Your own god damn research.</strong>\n\n<ol>\n<li>Read WHOLE articles, read whitepapers, check in on their community involvement, read the roadmap, etc</li>\n</ol></li>\n<li><strong>Continue your DCA plan.</strong>\n\n<ol>\n<li>This is not the time to refinance your house, that was in May. That ship has sailed. Just stick to your normal DCA even though you will be getting less crypto for your dollar. Trust me. </li>\n</ol></li>\n<li><strong>Stick to quality projects that will last this market.</strong>\n\n<ol>\n<li>Yes I know, that shitcoin is going to do a 100x and then when we hit a bear market it will do a -100x. Are you smart enough to get out when it&#39;s time? Probably not. </li>\n</ol></li>\n<li><strong>Phase your buys and sells to minimize/maximize potential losses/gains</strong>\n\n<ol>\n<li>Don&#39;t sell or buy everything at once. You are not god, you do not know what is going to happen tomorrow. If you sell everything at once and it skyrockets, you&#39;ll be wishing you only sold half.</li>\n</ol></li>\n<li><strong>Stick to market momentum.</strong>\n\n<ol>\n<li>If Defi is blowing up, hop in that. If exchange tokens are popping off, get in that. If privacy is on fire, get in that.</li>\n</ol></li>\n<li><strong>Set limit sell/buy orders.</strong>\n\n<ol>\n<li>Again, you&#39;re not god. You have to sleep. The market doesn&#39;t. If that coin crashes your limit sell could save you. If that coin goes parabolic, that limit buy could save you. </li>\n</ol></li>\n<li><strong>Enjoy the gains and remember this feeling tio get you through the inevitable bear market.</strong> \n\n<ol>\n<li>The first bear market I got out completely. The second bear market I just remembered the times when everything was green and I was certain the market would get back there. </li>\n<li>This is the best time to set limit orders and enjoy time with your family and friends, and get back into hobbies you left to stare at charts chasing 5% gains. </li>\n</ol></li>\n</ol>\n\n<p><strong>DONT</strong></p>\n\n<ol>\n<li><strong>FUCKING BRAG TO YOUR FAMILY/FRIENDS/COWORKERS/PETS/STRANGERS ABOUT YOUR FUCKING GAINS. NOBODY NEEDS TO KNOW THAT</strong>\n\n<ol>\n<li>I can assure you with 100% certainty nobody here wants to hear about it and 200% certainty nobody outside of here wants to hear about it. They are either gonna ask you for advice and then get rekt and hate you. OR they are gonna call you a dumbass the moment the market turns.</li>\n</ol></li>\n<li><strong>Trade futures.</strong>\n\n<ol>\n<li>You are not Warren Buffet and you&#39;re not god. You may get lucky a couple times but while you are sweating over a keyboard everyone else will be out having fun seeing nearly the same gains. Let the idiots dabble in futures gambling. </li>\n</ol></li>\n<li><strong>Get stuck in an echo chamber.</strong>\n\n<ol>\n<li>Your coin is not god. Don&#39;t get stuck in the coins subreddit thinking it&#39;ll surpass BTC mcap and stay there for 100 years. It wont. If you have 100 people telling you outlandish things, don&#39;t fucking believe them. I got trapped in the nano vortex in 2017 and watched my portfolio go from 3 college educations to 1. Dont be me. </li>\n</ol></li>\n<li><strong>FOMO</strong> \n\n<ol>\n<li>Havently we told you this enough. Don&#39;t buy the top of a coin because you think you&#39;re gonna miss out. Either wait for a good entry point, or wait for a bear market to buy low. You aren&#39;t gonna die between now and the next bear market, so just chill the fuck out. </li>\n</ol></li>\n<li><strong>Buy into ICO’s</strong>\n\n<ol>\n<li>I don&#39;t even know if these are still happening but 99% of them are scams and .5% of the survivors will fail. You like those odds go ahead? I sure don&#39;t.</li>\n</ol></li>\n<li><strong>Refinance your fucking house to buy more crypto</strong>\n\n<ol>\n<li>How dumb are you to think that&#39;ll work? Just don’t. Don&#39;t take out any sort of cash advance or loan to buy more. Again, we are playing a game of odds here and we want to minimize things that lower our odds of gainz and maximize our odds of higher gains. </li>\n<li>This also means dont put in what you can&#39;t afford to lose. </li>\n</ol></li>\n<li><strong>Let a bad trade or a massive loss get to you</strong>\n\n<ol>\n<li>Every trader has that white whale they missed out on. Or has a story about a 90k loss. Please do not let it have a negative impact on your mental state or ruin your relationships. Talk to anyone, talk to me, you’re not alone.</li>\n</ol></li>\n</ol>\n\n<p><strong>TL;DR</strong></p>\n\n<p>You are not god, and you&#39;re not an oracle. You can predict a bull market by throwing a dart at a board just as well as sweaty TA. In a bull market we want to maximize profit opportunities and minimize loss opportunities. BE SMART AND USE CRITICAL THINKING. IF IT’S TOO GOOD TO BE TRUE IT IS.</p>\n</div><!-- SC_ON -->",
  "score": 236,
  "permalink": "/r/CryptoCurrency/comments/qc65nh/the_7_dos_and_dont_of_trading_in_a_bull_market/",
  "subreddit": "CryptoCurrency",
  "id": "qc65nh",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Recently (as in the last 48 hours) there have been some strong indicators that\nwe are heading straight into a historic bull run. Whether that's true or not is\nyet to be discovered so I think now would be the best time to give some new or\nold investors some tips on trading in a bull market. I have…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近（48時間以内）、歴史的な強気相場に突入することを示すいくつかの強い指標がありました。\n歴史的なブルランに突入しているという強い指標があります。それが本当かどうかは\n今こそ、新旧の投資家に強気相場での取引のコツをお伝えする絶好の機会だと思います。\n強気の市場で取引をするためのヒントを、新旧の投資家に提供する絶好の機会だと思います。私は...",
      "title": "強気の相場でトレードするための7つのDo's and Don't。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "最近（如过去48小时），有一些强烈的迹象表明\n我们正在直接进入一个历史性的牛市运行。这是否是真的呢？\n所以我认为现在是给一些新的或老的投资者的最好时机。\n老投资者一些关于在牛市中交易的提示。我已经...",
      "title": "牛市中交易的7个该做的和不该做的。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "最近（如過去48小時），有一些強烈的跡象表明\n我們正在直接進入一個歷史性的牛市運行。這是否是真的呢？\n所以我認爲現在是給一些新的或老的投資者的最好時機。\n老投資者一些關於在牛市中交易的提示。我已經...",
      "title": "牛市中交易的7個該做的和不該做的。"
    }
  ]
}