{
  "author": "Mattelambo",
  "original_created_utc": 1636280377,
  "title": "What would you have? 1 Bitcoin or around 13.4 Ethereum (that’s one btc based at time of writing this)",
  "created_utc": 1636310790,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have had this question in mind and thought of engaging with you guys with this question and connect. I look forward to listening your opinions and thoughts!</p>\n\n<p>And Please in the comments section, why you would choose what you chose!</p>\n\n<p>I hope thought provoking questions like this can bring our community closer and show us different points of views and expose us to different opinions. Anyway, thanks for reading and engaging!</p>\n\n<p>Looking forward to hear and I wish all of you a lot of success in all your investments !</p>\n</div><!-- SC_ON -->",
  "score": 151,
  "permalink": "/r/CryptoCurrency/comments/qolqw1/what_would_you_have_1_bitcoin_or_around_134/",
  "subreddit": "CryptoCurrency",
  "id": "qolqw1",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have had this question in mind and thought of engaging with you guys with this\nquestion and connect. I look forward to listening your opinions and thoughts!\n\nAnd Please in the comments section, why you would choose what you chose!\n\nI hope thought provoking questions like this can bring our…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこの質問を念頭に置き、この質問で皆さんと関わりを持とうと考えました。\n質問をして繋げます。皆さんのご意見、ご感想をお待ちしています。\n\nまた、コメント欄には、なぜ自分が選んだものを選んだのかを書いてくださいね。\n\nこのような刺激的な質問が、私たちの生活を豊かにしてくれることを願っています...",
      "title": "あなたは何を持っていますか？1ビットコインまたは約13.4イーサリアム（この記事を書いている時点では1ビットコインベースです。）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直在想这个问题，并想用这个问题与你们接触\n问题，并联系起来。我期待着倾听你们的意见和想法!\n\n并请在评论区说明你为什么会选择你所选择的!\n\n我希望像这样发人深省的问题能给我们的生活带来更多乐趣。",
      "title": "你会有什么？1个比特币或大约13.4个以太坊（在写这篇文章时是以1个比特币为基础的）。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直在想這個問題，並想用這個問題與你們接觸\n問題，並聯系起來。我期待着傾聽你們的意見和想法!\n\n並請在評論區說明你爲什麼會選擇你所選擇的!\n\n我希望像這樣發人深省的問題能給我們的生活帶來更多樂趣。",
      "title": "你會有什麼？1個比特幣或大約13.4個以太坊（在寫這篇文章時是以1個比特幣爲基礎的）。"
    }
  ]
}