{
  "author": "CreatorOfUsernames",
  "original_created_utc": 1639525964,
  "title": "Does Reddit function differently for liberals vs conservatives?",
  "created_utc": 1639537862,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I’m a left leaning Canadian. I’ve noticed that in “neutral” subreddits like &lt;a href=\"/r/politics\"&gt;r/politics&lt;/a&gt; and &lt;a href=\"/r/news\"&gt;r/news&lt;/a&gt;, I ONLY see posts condemning conservative actions and praising liberal actions. I have quite literally never seen a post in &lt;a href=\"/r/politics\"&gt;r/politics&lt;/a&gt; that paints conservatives as anything but evil. I don’t agree with a lot of their policies and beliefs, but I REALLY don’t like only consuming one side/opinion of every story. Conservatives are not wrong on every single issue and liberals are not right on every single issue. In fact there are plenty of liberals that are just as much of corrupt POS’s as the worst conservatives. I really don’t like that I’m seeing nothing but good news about them. Just makes it feel like I’m being fed propaganda… So my question is: do conservative redditors see a different newsfeed than a liberal redditor would?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/rgkwqx/does_reddit_function_differently_for_liberals_vs/",
  "subreddit": "NoStupidQuestions",
  "id": "rgkwqx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I’m a left leaning Canadian. I’ve noticed that in “neutral” subreddits like\nr/politics [/r/politics] and r/news [/r/news], I ONLY see posts condemning\nconservative actions and praising liberal actions. I have quite literally never\nseen a post in r/politics [/r/politics] that paints conservatives as…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は左寄りのカナダ人です。のような「中立的」なサブレディットでは、左寄りの人が多いことに気がつきました。\nr/politics [/r/politics]やr/news [/r/news]では、非難する投稿ばかりが目につきます。\n保守的な行動を賞賛し、リベラルな行動を賞賛する。私は文字通り一度も\nr/politics [/r/politics]で、保守派を...と描く投稿を見たことがあります。",
      "title": "Redditはリベラル派と保守派で機能が違うのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我是一个左倾的加拿大人。我注意到，在 \"中立 \"的子版块，如\nr/politics [/r/politics] 和 r/news [/r/news]，我只看到谴责\n保守派的行为和赞扬自由派的行为。我从来没有在\n在r/politics [/r/politics]中，我从来没有见过一个帖子把保守派描绘成......",
      "title": "Reddit对自由派与保守派的功能是否不同？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我是一個左傾的加拿大人。我注意到，在 \"中立 \"的子版塊，如\nr/politics [/r/politics] 和 r/news [/r/news]，我只看到譴責\n保守派的行爲和讚揚自由派的行爲。我從來沒有在\n在r/politics [/r/politics]中，我從來沒有見過一個帖子把保守派描繪成......",
      "title": "Reddit對自由派與保守派的功能是否不同？"
    }
  ]
}