{
  "author": "KiProFarm",
  "original_created_utc": 1628671349,
  "title": "What happen when an infected cell replicate itself ?",
  "created_utc": 1628708220,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi, </p>\n\n<p>So what i&#39;d like to know is this, if a cell is infected by a virus or &quot;&quot;infected&quot;&quot; with mRNA from vaccine for example. What would happen if the cell replicate ? Would the new cells contain the virus or mRNA ? </p>\n\n<p>I&#39;m thinking about this cause when you do workout you accelerate the replication process (I suppose since cells have to repair the part that you broke in your muscle during the workout). And since the vaccine is injected in the muscle I was questioning myself about that. </p>\n\n<p>Like, if it was the case, could it cause chain reaction, cells replicating with the virus again and again ? Maybe it&#39;s totally stupid tbh.</p>\n</div><!-- SC_ON -->",
  "score": 109,
  "permalink": "/r/askscience/comments/p292wb/what_happen_when_an_infected_cell_replicate_itself/",
  "subreddit": "askscience",
  "id": "p292wb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hi,\n\nSo what i'd like to know is this, if a cell is infected by a virus or\n\"\"infected\"\" with mRNA from vaccine for example. What would happen if the cell\nreplicate ? Would the new cells contain the virus or mRNA ?\n\nI'm thinking about this cause when you do workout you accelerate the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは。\n\n私が知りたいのは、もしある細胞がウイルスに感染したり\n「例えば、ワクチンからのmRNAに感染したとします。もし、その細胞が\n複製されたらどうなりますか？新しい細胞には、ウイルスやmRNAが含まれているのでしょうか？\n\n私がこのことを考えているのは、運動をすると加速して...",
      "title": "感染した細胞が自己複製するとどうなりますか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你好。\n\n我想知道的是，如果一个细胞被病毒感染或\n\"感染 \"了疫苗的mRNA，比如说。如果该细胞\n复制会发生什么？新细胞是否含有病毒或mRNA？\n\n我正在考虑这个问题，因为当你做锻炼时，你会加速你的身体。",
      "title": "当受感染的细胞自我复制时会发生什么？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你好。\n\n我想知道的是，如果一個細胞被病毒感染或\n\"感染 \"了疫苗的mRNA，比如說。如果該細胞\n複製會發生什麼？新細胞是否含有病毒或mRNA？\n\n我正在考慮這個問題，因爲當你做鍛鍊時，你會加速你的身體。",
      "title": "當受感染的細胞自我複製時會發生什麼？"
    }
  ]
}