{
  "author": "FinanceSorry2530",
  "the_new_excerpt": "I don’t care if Bitcoin goes up or down. I don’t care if the market is\nmanipulated. I don’t care about anything to be honest.\n\n2019 was horrible and 2020 was the worst year of my life. I have been suffering\ndepression without being able to do anything, even simpler tasks, and left alone\njust because…",
  "original_created_utc": 1610240198,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不在乎比特币是涨是跌。我不在乎市场是不是\n被操纵了。老实说，我什么都不在乎。\n\n2019年是可怕的，2020年是我一生中最糟糕的一年。我一直在受苦\n抑郁，不能做任何事情，甚至更简单的任务，独自一人\n就因为…",
      "title": "你猜怎么着？我不在乎"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不在乎比特幣是漲是跌。我不在乎市場是不是\n被操縱了。老實說，我什麼都不在乎。\n\n2019年是可怕的，2020年是我一生中最糟糕的一年。我一直在受苦\n抑鬱，不能做任何事情，甚至更簡單的任務，獨自一人\n就因爲…",
      "title": "你猜怎麼着？我不在乎"
    }
  ],
  "title": "You know what? I don’t care",
  "created_utc": 1610261851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t care if Bitcoin goes up or down. I don’t care if the market is manipulated. I don’t care about anything to be honest.</p>\n\n<p>2019 was horrible and 2020 was the worst year of my life. I have been suffering depression without being able to do anything, even simpler tasks, and left alone just because I didn’t figure out I wasn’t pursuing what I really wanted.</p>\n\n<p>I was that depressed yes man that nobody cared of, not even me. I wasn’t realizing that I had to stop being scared about work, girls, and to start enjoying it whatever it happens.</p>\n\n<p>This project keeps me awake at night, I can’t stop doing research, from both financial and technical sides. I literally can’t stop and I fucking love it and more than that it is also giving us hope!</p>\n\n<p>I honestly don’t care if it crashes to 1$, it makes me feel alive just by knowing such free technology exists. I wasn’t experiencing this passion from years and it’s the only important thing to me.</p>\n\n<p>Bitcoin, ironically, taught me life is precious the way it is.</p>\n\n<p>Thank you</p>\n</div><!-- SC_ON -->",
  "score": 415,
  "permalink": "/r/Bitcoin/comments/ku3r8l/you_know_what_i_dont_care/",
  "subreddit": "Bitcoin",
  "id": "ku3r8l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706371556
}