{
  "author": "masterredmage",
  "original_created_utc": 1624622587,
  "title": "Being a man complimenting women, how can I make sure I don't come off creepy?",
  "created_utc": 1624649075,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have a lot of female friends and I often see pictures they post on Facebook and whatnot and I want to compliment them on how beautiful they look in their pictures. As a man I worry that I&#39;ll come off as creepy when I really just want to compliment them so they can feel good about themselves. How can I make sure I&#39;m not coming off creepy when I compliment them, or should I just like the picture and move on?</p>\n</div><!-- SC_ON -->",
  "score": 108,
  "permalink": "/r/TooAfraidToAsk/comments/o7mbho/being_a_man_complimenting_women_how_can_i_make/",
  "subreddit": "TooAfraidToAsk",
  "id": "o7mbho",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I have a lot of female friends and I often see pictures they post on Facebook\nand whatnot and I want to compliment them on how beautiful they look in their\npictures. As a man I worry that I'll come off as creepy when I really just want\nto compliment them so they can feel good about themselves. How…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私には女性の友人が多いのですが、彼女たちがFacebookなどにアップしている写真を見ると\n女性の友人が多いのですが、彼女たちがFacebookなどに投稿している写真を見ると、その写真の美しさを褒めたくなります。\n褒めてあげたい。男性としては、気持ち悪いと思われるのではないかと心配になりますが、本当は彼女たちが自分のことを良く思えるように褒めてあげたいのです。\n褒めてあげたいだけなのに、気持ち悪いと思われないか心配です。どのように...",
      "title": "男性が女性を褒める場合、気持ち悪いと思われないようにするにはどうしたらいいですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我有很多女性朋友，我经常看到她们在Facebook上发布的照片\n和其他什么东西，我想赞美她们，说她们在照片上看起来有多漂亮。\n照片。作为一个男人，我担心我会表现得很猥琐，而我真的只是想\n夸奖他们，让他们对自己感觉良好。如何...",
      "title": "作为一个赞美女性的男人，我怎样才能确保我不会让人感到毛骨悚然？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我有很多女性朋友，我經常看到她們在Facebook上發佈的照片\n和其他什麼東西，我想讚美她們，說她們在照片上看起來有多漂亮。\n照片。作爲一個男人，我擔心我會表現得很猥瑣，而我真的只是想\n誇獎他們，讓他們對自己感覺良好。如何...",
      "title": "作爲一個讚美女性的男人，我怎樣才能確保我不會讓人感到毛骨悚然？"
    }
  ]
}