{
  "author": "i_am_sososo_sorry",
  "original_created_utc": 1643786557,
  "title": "Doctors swear an oath to \"Do No Harm.\" Why does devastating financial harm not fall under that oath?",
  "created_utc": 1643794406,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is mostly a USA question I suppose. The financial fallout from hospitalization has the ability to financially decimate nearly any lower to middle class person or family in this country. Such a financial hit can ruin people, making them unable to live reasonably, forget financial comfort, struggle to even work and feed and clothe and shelter themselves. This is direct harm. Maybe it&amp;#39;s my frustration talking, but it seems hugely hypocritical.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 108,
  "permalink": "/r/NoStupidQuestions/comments/siihu3/doctors_swear_an_oath_to_do_no_harm_why_does/",
  "subreddit": "NoStupidQuestions",
  "id": "siihu3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "This is mostly a USA question I suppose. The financial fallout from\nhospitalization has the ability to financially decimate nearly any lower to\nmiddle class person or family in this country. Such a financial hit can ruin\npeople, making them unable to live reasonably, forget financial…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "これはほとんどアメリカの質問だと思います。経済的な損失は\n入院すると、低所得者から高所得者までのほとんどの人が経済的に破綻します。\nこの国の中流階級の人々や家庭は このような経済的な打撃は\n経済的なことを忘れて、合理的な生活ができなくなる。",
      "title": "医師は \"Do No Harm \"を誓います。なぜ壊滅的な経済的損害はその誓いに該当しないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想这主要是一个美国问题。住院治疗带来的经济损失\n住院治疗有能力在经济上摧毁这个国家几乎所有的中低阶层人士或家庭。\n中产阶级的人或家庭。这样的经济打击可以毁掉\n人，使他们无法合理地生活，忘记了财务...",
      "title": "医生们宣誓 \"不伤害\"。为什么破坏性的经济伤害不属于该誓言的范畴？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想這主要是一個美國問題。住院治療帶來的經濟損失\n住院治療有能力在經濟上摧毀這個國家幾乎所有的中低階層人士或家庭。\n中產階級的人或家庭。這樣的經濟打擊可以毀掉\n人，使他們無法合理地生活，忘記了財務...",
      "title": "醫生們宣誓 \"不傷害\"。爲什麼破壞性的經濟傷害不屬於該誓言的範疇？"
    }
  ]
}