{
  "author": "12jonboy12",
  "original_created_utc": 1639132966,
  "title": "Was this restaurant reasonable for telling me I couldn't sit at a table after seating me and taking my drink order? Was I reasonable just for walking out.",
  "created_utc": 1639146366,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m finally graduating I think,&lt;/p&gt;\n\n&lt;p&gt;To celebrate I went to the restaurant that shares a building with my apartment complex, kind of semi-fancy Mediterranean place but it doesn&amp;#39;t seem to have a dress code &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know if it was about dares code, their website says &amp;quot;casual upscale&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I walk in and ask for seating for one and ask me if I want to be at the bar or at the table I said table if that&amp;#39;s available, I was seated and got my drink order, I was wearing jeans and a t-shirt but I figured if there was a dress code, I would have been asked or warned before sitting down.&lt;/p&gt;\n\n&lt;p&gt;Male employee comes by and asks if I&amp;#39;d rather sit at the bar looking somewhat put out, I told him I&amp;#39;d rather stay at the table if that&amp;#39;s okay but if I&amp;#39;m not allowed to let me know.&lt;/p&gt;\n\n&lt;p&gt;He goes off and talks to a manager and comes back and says he&amp;#39;s going to move me to the bar, I think him and leave the restaurant.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not going to celebratory mood anymore, so I figure I&amp;#39;ll have a celebration meal some other time when I&amp;#39;m not annoyed and someplace where I&amp;#39;m not giving that particular restaurant money&lt;/p&gt;\n\n&lt;p&gt;Was I unreasonable for walking out? Were they unreasonable for forcing me to move?&lt;/p&gt;\n\n&lt;p&gt;It was a Thursday night most of the place was empty so they weren&amp;#39;t preparing for a party&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 145,
  "permalink": "/r/NoStupidQuestions/comments/rd5zub/was_this_restaurant_reasonable_for_telling_me_i/",
  "subreddit": "NoStupidQuestions",
  "id": "rd5zub",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I'm finally graduating I think,\n\nTo celebrate I went to the restaurant that shares a building with my apartment\ncomplex, kind of semi-fancy Mediterranean place but it doesn't seem to have a\ndress code\n\nI don't know if it was about dares code, their website says \"casual upscale\"\n\nI walk in and ask…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "やっと卒業できそうです。\n\nお祝いに、私のアパートと同じ建物のレストランに行きました。\n地中海のちょっとおしゃれなお店なんですが、特に決まりはないようです。\nドレスコード\n\nホームページには \"Casual upscale \"と書かれています。\n\n店に入って尋ねると...",
      "title": "この店では、席に座って飲み物の注文を受けた後に、テーブルに座れないと言ったことは妥当だったのでしょうか？私が出て行ったことは妥当だったのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我想我终于要毕业了。\n\n为了庆祝，我去了与我的公寓大楼合用的餐厅。\n我去了与我的公寓共用一栋楼的餐厅，那是一个半花哨的地中海餐厅，但它似乎没有着装要求。\n着装规范\n\n我不知道这是否是关于着装的规定，他们的网站上说 \"休闲高档\"。\n\n我走了进去，问...",
      "title": "这家餐厅在为我安排好座位并为我点了饮料后告诉我不能坐在一个桌子上，这样做合理吗？我走出去是否合理。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我想我終於要畢業了。\n\n爲了慶祝，我去了與我的公寓大樓合用的餐廳。\n我去了與我的公寓共用一棟樓的餐廳，那是一個半花哨的地中海餐廳，但它似乎沒有着裝要求。\n着裝規範\n\n我不知道這是否是關於着裝的規定，他們的網站上說 \"休閒高檔\"。\n\n我走了進去，問...",
      "title": "這家餐廳在爲我安排好座位併爲我點了飲料後告訴我不能坐在一個桌子上，這樣做合理嗎？我走出去是否合理。"
    }
  ]
}