{
  "author": "cuprumcaius",
  "original_created_utc": 1632195212,
  "title": "The Shanghai Stock Exchange is currently on holiday, the real Evergrande's impact on the market will happen in aprox 22 hours",
  "created_utc": 1632213851,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Shanghai Stock Exchange is currently on holiday, celebrating the Mid-Autumn Festival, they will reopen on Wednesday at 9:30 China time.</p>\n\n<p>When it reopens, we will see the real impact of Evergrande both on stock and crypto markets.</p>\n\n<p>You can track the time until opening here: <a href=\"https://www.tradinghours.com/markets/sse/hours\">https://www.tradinghours.com/markets/sse/hours</a></p>\n\n<p>Hope for the best, but be ready for the worst. If you believe the dip will stop soon, you have aprox 22 hours to make your buys, else, better wait that time, gather your fiat and prepare for whatever will happen.</p>\n</div><!-- SC_ON -->",
  "score": 194,
  "permalink": "/r/CryptoCurrency/comments/psakxx/the_shanghai_stock_exchange_is_currently_on/",
  "subreddit": "CryptoCurrency",
  "id": "psakxx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Shanghai Stock Exchange is currently on holiday, celebrating the Mid-Autumn\nFestival, they will reopen on Wednesday at 9:30 China time.\n\nWhen it reopens, we will see the real impact of Evergrande both on stock and\ncrypto markets.\n\nYou can track the time until opening…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "上海証券取引所は現在、中秋節のため休日となっています。\n中国時間の水曜日9時30分に再開します。\n\n上海証券取引所が再開されると、Evergrandeが株式市場と暗号市場の両方に与える実際の影響が見られます。\n再開されたときには、株式市場と暗号市場の両方にEvergrandeの本当の影響が見られます。\n\n開業までの時間を追跡することができます...",
      "title": "上海証券取引所は現在休暇中であり、Evergrandeが市場に与える本当の影響は約22時間後に起こるだろう。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "上海证券交易所目前正在休假，庆祝中秋节。\n他们将于中国时间周三9:30重新开放。\n\n当它重新开放时，我们将看到恒大对股票和加密货币市场的真正影响。\n加密货币市场的真正影响。\n\n你可以追踪到开盘前的时间...",
      "title": "上海证券交易所目前正在休假，恒大对市场的真正影响将在大约22小时后发生。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "上海證券交易所目前正在休假，慶祝中秋節。\n他們將於中國時間週三9:30重新開放。\n\n當它重新開放時，我們將看到恆大對股票和加密貨幣市場的真正影響。\n加密貨幣市場的真正影響。\n\n你可以追蹤到開盤前的時間...",
      "title": "上海證券交易所目前正在休假，恆大對市場的真正影響將在大約22小時後發生。"
    }
  ]
}