{
  "author": "Rdick_Lvagina",
  "the_new_excerpt": "Background: I'm still pretty convinced that western philosophy (with the\nexception of the Greeks) is heavily rooted in the Judeo/Christian belief system.\nHence the unresolved question \"Is God real?\". I would assume that if an all\npowerful, all knowing God was the creator of the universe that this…",
  "original_created_utc": 1615218183,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "的背景。我仍然非常相信西方哲学（与此同时\n希腊人除外）都深深扎根于犹太/基督教信仰体系。\n因此，\"上帝是真实存在的吗？\"这个问题尚未解决。我认为，如果一个全\n强大的，全知全能的上帝是宇宙的创造者，这... ...",
      "title": "有没有来自非犹太教/基督教背景的亚洲哲学家试图证明或否定一个全能的上帝？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "的背景。我仍然非常相信西方哲學（與此同時\n希臘人除外）都深深紮根於猶太/基督教信仰體系。\n因此，\"上帝是真實存在的嗎？\"這個問題尚未解決。我認爲，如果一個全\n強大的，全知全能的上帝是宇宙的創造者，這... ...",
      "title": "有沒有來自非猶太教/基督教背景的亞洲哲學家試圖證明或否定一個全能的上帝？"
    }
  ],
  "title": "Have any Asian philosophers from a non-Judeo/Christian background attempted to prove or disprove an all powerful God?",
  "created_utc": 1615258698,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Background:</strong> I&#39;m still pretty convinced that western philosophy (with the exception of the Greeks) is heavily rooted in the Judeo/Christian belief system. Hence the unresolved question &quot;Is God real?&quot;. I would assume that if an all powerful, all knowing God was the creator of the universe that this question would also have occurred to philosophers from other cultures. </p>\n\n<p><strong>Questions:</strong> Are you guys aware of any historic or modern Asian philosophers who independently came up with the concept, and attempted to prove or disprove the existence of God? If so, how did they fare in comparison to western philosophers?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/askphilosophy/comments/m0iecs/have_any_asian_philosophers_from_a/",
  "subreddit": "askphilosophy",
  "id": "m0iecs",
  "is_self": true,
  "media": null,
  "is_video": false
}