{
  "author": "pineapplepiebrownie",
  "the_new_excerpt": "Using CNBC as I'm not seeing a better source at the moment.\n\nhttps://www.cnbc.com/2021/06/07/deutsche-bank-warns-of-global-time-bomb-coming-due-to-rising-inflation.html\n\nInflation may look like a problem that will go away, but is more likely to\npersist and lead to a crisis in the years ahead,…",
  "original_created_utc": 1623129569,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今のところ他に良い情報源がないため、CNBCを使用しています。\n\nhttps://www.cnbc.com/2021/06/07/deutsche-bank-warns-of-global-time-bomb-coming-due-to-rising-inflation.html\n\nインフレは消えてなくなる問題のように見えるかもしれないが、今後数年間は持続して危機につながる可能性が高い。\n今後数年間は持続して危機につながる可能性が高いと...",
      "title": "ドイツ銀行、インフレの進行による世界的な「時限爆弾」の到来を警告"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "使用CNBC，因为我目前没有看到一个更好的来源。\n\nhttps://www.cnbc.com/2021/06/07/deutsche-bank-warns-of-global-time-bomb-coming-due-to-rising-inflation.html\n\n通货膨胀可能看起来是一个会消失的问题，但更有可能在未来几年持续存在并导致危机。\n持续下去，并在未来几年导致危机，...",
      "title": "德意志银行警告说，由于通胀上升，全球 \"定时炸弹 \"即将到来"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "使用CNBC，因爲我目前沒有看到一個更好的來源。\n\nhttps://www.cnbc.com/2021/06/07/deutsche-bank-warns-of-global-time-bomb-coming-due-to-rising-inflation.html\n\n通貨膨脹可能看起來是一個會消失的問題，但更有可能在未來幾年持續存在並導致危機。\n持續下去，並在未來幾年導致危機，...",
      "title": "德意志銀行警告說，由於通脹上升，全球 \"定時炸彈 \"即將到來"
    }
  ],
  "title": "Deutsche Bank warns of global ‘time bomb’ coming due to rising inflation",
  "created_utc": 1623135252,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Using CNBC as I&#39;m not seeing a better source at the moment.</p>\n\n<p><a href=\"https://www.cnbc.com/2021/06/07/deutsche-bank-warns-of-global-time-bomb-coming-due-to-rising-inflation.html\">https://www.cnbc.com/2021/06/07/deutsche-bank-warns-of-global-time-bomb-coming-due-to-rising-inflation.html</a></p>\n\n<p>Inflation may look like a problem that will go away, but is more likely to persist and lead to a crisis in the years ahead, according to a warning from Deutsche Bank economists.</p>\n\n<p>In a forecast that is well outside the consensus from policymakers and Wall Street, Deutsche issued a dire warning that focusing on stimulus while dismissing inflation fears will prove to be a mistake if not in the near term then in 2023 and beyond.</p>\n\n<p>The analysis especially points the finger at the Federal Reserve and its new framework in which it will tolerate higher inflation for the sake of a full and inclusive recovery. The firm contends that the Fed’s intention not to tighten policy until inflation shows a sustained rise will have dire impacts.</p>\n\n<p>“The consequence of delay will be greater disruption of economic and financial activity than would be otherwise be the case when the Fed does finally act,” Deutsche’s chief economist, David Folkerts-Landau, and others wrote. “In turn, this could create a significant recession and set off a chain of financial distress around the world, particularly in emerging markets.”</p>\n\n<p>As part of its approach to inflation, the Fed won’t raise interest rates or curtail its asset purchase program until it sees “substantial further progress” toward its inclusive goals. Multiple central bank officials have said they are not near those objectives.</p>\n\n<p>In the meantime, indicators such as the consumer price and personal consumption expenditures price indices are well above the Fed’s 2% inflation goal. Policymakers say the current rise in inflation is temporary and will abate once supply disruptions and base effects from the early months of the coronavirus pandemic crisis wear off.</p>\n\n<p>The Deutsche team disagrees, saying that aggressive stimulus and fundamental economic changes will present inflation ahead that the Fed will be ill-prepared to address.</p>\n\n<p>“It may take a year longer until 2023 but inflation will re-emerge. And while it is admirable that this\npatience is due to the fact that the Fed’s priorities are shifting towards social goals, neglecting inflation leaves global economies sitting on a time bomb,” Folkerts-Landau said. “The effects could be devastating, particularly for the most vulnerable in society.”</p>\n\n<p>Most on the Street see tame inflation\nTo be sure, the Deutsche position is not widely held by economists.</p>\n\n<p>Most on Wall Street agree with the Fed’s view that current inflation pressures are transitory, and they doubt there will be any policy changes soon.</p>\n\n<p>Jan Hatzius, chief economist at Goldman Sachs, said there are “strong reasons” to support the position. One he cites is the likelihood that the expiration of enhanced unemployment benefits will send workers back to their jobs in the coming months, easing wage pressures.</p>\n\n<p>On price pressures in general, Hatzius said that much of current spike is being driven by “the unprecedented role of outliers” that will ebb and bring levels back closer to normal.</p>\n\n<p>“All this suggests that Fed officials can stick with their plan to exit only very gradually from the easy current policy stance,” Hatzius wrote.</p>\n\n<p>That will be a mistake, according to the Deutsche view.</p>\n\n<p>Congress has approved more than $5 trillion in pandemic-related stimulus so far, and the Fed has nearly doubled its balance sheet, through monthly asset purchases, to just shy of $8 trillion. The stimulus continues to come through even with an economy that is expected to grow at about a 10% pace in the second quarter and an employment picture that has added an average 478,000 jobs a month in 2021.</p>\n\n<p>“Never before have we seen such coordinated expansionary fiscal and monetary policy. This will continue as output moves above potential,” Folkers-Landau said. “This is why this time is different for inflation.”</p>\n\n<p>The Deutsche team said the coming inflation could resemble the 1970s experience, a decade during which inflation averaged nearly 7% and was well into double digits at various times. Soaring food and energy prices along with the end of price controls helped push that era’s soaring inflation.</p>\n\n<p>Then-Fed Chairman Paul Volcker led the effort to squash inflation then, but needed to use dramatic interest rate hikes that triggered a recession. The Deutsche team worries that such a scenario could play out again.</p>\n\n<p>“Already, many sources of rising prices are filtering through into the US economy. Even if they are transitory on paper, they may feed into expectations just as they did in the 1970s,” they said. “The risk then, is that even if they are only embedded for a few months they may be difficult to contain, especially with stimulus so high.”</p>\n\n<p>The firm said interest rate hikes could “cause havoc in a debt-heavy world,” with financial crises likely particularly in emerging economies where growth won’t be able to overcome higher financing costs.</p>\n</div><!-- SC_ON -->",
  "score": 381,
  "permalink": "/r/investing/comments/nux450/deutsche_bank_warns_of_global_time_bomb_coming/",
  "subreddit": "investing",
  "id": "nux450",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1623404886626
}