{
  "author": "TheEmperorOfJenks",
  "the_new_excerpt": "I have lost everything, and I'm not sure how to continue. This summer I invested\n$17,500 (six months salary and my entire life savings) into ornamental gourd\nfutures, hoping to capitalize on this lucrative emerging industry. After\nwatching a video about Vincent Kosuga and his monopoly on onions, I…",
  "original_created_utc": 1610949234,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我已经失去了一切，我不知道该如何继续。这个夏天，我投资了\n一万七千五百元（半年工资和我一生的积蓄）投入观赏葫芦\n期货，希望能抓住这个利润丰厚的新兴行业。在\n看了一段关于Vincent Kosuga和他的洋葱垄断的视频，我... ...",
      "title": "我的财务被毁了（农产品期货"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我已經失去了一切，我不知道該如何繼續。這個夏天，我投資了\n一萬七千五百元（半年工資和我一生的積蓄）投入觀賞葫蘆\n期貨，希望能抓住這個利潤豐厚的新興行業。在\n看了一段關於Vincent Kosuga和他的洋蔥壟斷的視頻，我... ...",
      "title": "我的財務被毀了（農產品期貨"
    }
  ],
  "title": "I am financially ruined (agricultural futures)",
  "created_utc": 1610970821,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I have lost everything, and I&#39;m not sure how to continue. This summer I invested $17,500 (six months salary and my entire life savings) into ornamental gourd futures, hoping to capitalize on this lucrative emerging industry. After watching a video about Vincent Kosuga and his monopoly on onions, I decided I&#39;d try to do something similar with another vegetable. I did some research and found out many agricultural forecasters expected this year&#39;s gourd yield would be far smaller than the past, due to deteriorating soil conditions in central Mexico and a warmer-than-average spring. At first, demand soared around Halloween and prices skyrocketed, but the gourd bubble burst on November 12th. Unfortunately, the coronavirus caused a massive drop-off in demand due to fewer families decorating their tables for thanksgiving, and prices plummeted. I had invested early enough that I thought I would still be fine, but then on the morning of December 2nd, a new email in my inbox caused my stomach to turn into a pretzel. The massive gourd shipment from Argentina, scheduled for early March, had arrived. I was planning on selling off my futures right before this, in February, but this ruined everything. To top it off, the gourds in this shipment were absolutely gargantuan, some topping 4 pounds each, causing the price-per-pound to drop like an anchor into the range of 6 cents per pound. I am ruined.</p>\n</div><!-- SC_ON -->",
  "score": 10861,
  "permalink": "/r/wallstreetbets/comments/kzoh1c/i_am_financially_ruined_agricultural_futures/",
  "subreddit": "wallstreetbets",
  "id": "kzoh1c",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1611311224168
}