{
  "author": "DaddySkates",
  "original_created_utc": 1635697935,
  "title": "Best “lifehacks” in crypto that everyone should know from the start?",
  "created_utc": 1635708660,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been in cryptoverse for a while now and I keep seeing newbies ask for tips in crypto, all from how to buy on DeFi to smaller things. I was wondering, what is the best life hack for you in cryptocurrencies? Anything is fine, from trading, storing, buying, selling, securing, whatever comes to your mind that you&#39;d want newbies to know about. There is a lot of new people here everyday now and I thought that sharing such small life hacks would be nice for them.</p>\n\n<p>For me the biggest life hack in crypto I found is using XLM (Stellar Lumens) to move funds around. When I first started trading I used BTC to move funds around and ...that wasn&#39;t really smart. Then I heard someone talking about using XLM to move because it&#39;s ultra fast and ultra cheap. Best hint I got :)</p>\n\n<p>What are your lifehacks in crypto?</p>\n</div><!-- SC_ON -->",
  "score": 265,
  "permalink": "/r/CryptoCurrency/comments/qjt5ut/best_lifehacks_in_crypto_that_everyone_should/",
  "subreddit": "CryptoCurrency",
  "id": "qjt5ut",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been in cryptoverse for a while now and I keep seeing newbies ask for tips\nin crypto, all from how to buy on DeFi to smaller things. I was wondering, what\nis the best life hack for you in cryptocurrencies? Anything is fine, from\ntrading, storing, buying, selling, securing, whatever comes to…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "Cryptoverseに入ってしばらく経ちますが、初心者が暗号のヒントを求めているのをよく見かけます。\nDeFiでの買い方から細かいことまで、暗号のコツを聞いてくる人が後を絶ちません。疑問に思ったんだ。\n疑問に思ったのですが、あなたにとって暗号通貨での最高のライフハックは何ですか？何でも構いません。\n取引、保管、購入、販売、確保、何でも構いません...",
      "title": "誰もが最初から知っておくべき、暗号における最高の「ライフハック」とは？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在cryptoverse已经有一段时间了，我一直看到新手们在问一些提示\n从如何在DeFi上购买到小东西。我在想，什么\n是你在加密货币方面最好的生活黑客？什么都可以，从\n交易、储存、购买、出售、保障，任何涉及到的都可以。",
      "title": "每个人从一开始就应该知道的加密货币中的最佳 \"生活窍门\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在cryptoverse已經有一段時間了，我一直看到新手們在問一些提示\n從如何在DeFi上購買到小東西。我在想，什麼\n是你在加密貨幣方面最好的生活黑客？什麼都可以，從\n交易、儲存、購買、出售、保障，任何涉及到的都可以。",
      "title": "每個人從一開始就應該知道的加密貨幣中的最佳 \"生活竅門\"？"
    }
  ]
}