{
  "author": "shortyafter",
  "the_new_excerpt": "I've been investing in a target retirement fund for a few years now. Shamelessly\nI took a more active approach to investing right after the GME affair, about 2\nmonths ago.\n\nI don't have a lot of cash, and it was clear that we were coming off of a huge\nbull run after the Covid crash last year. I…",
  "original_created_utc": 1617920804,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "数年前からターゲット・リタイヤメント・ファンドに投資しています。恥ずかしながら\nGME事件の直後、約2ヶ月前から投資に積極的になった。\nヶ月ほど前です。\n\n私はあまり現金を持っていませんし、昨年のCovidの暴落の後、大規模な強気の動きから外れていることは明らかでした。\n去年のCovidの暴落の後、巨大な強気の動きから抜け出したことは明らかでした。I...",
      "title": "FOMOが始まっている。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我投资目标退休基金已经有几年了。无耻地\n在GME事件后，我就采取了比较积极的投资方式，大约2\n几个月前。\n\n我没有太多的现金，而且很明显，我们正在从一个巨大的。\n去年科维德崩盘后的牛市行情。I…",
      "title": "FOMO开始发作。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我投資目標退休基金已經有幾年了。無恥地\n在GME事件後，我就採取了比較積極的投資方式，大約2\n幾個月前。\n\n我沒有太多的現金，而且很明顯，我們正在從一個巨大的。\n去年科維德崩盤後的牛市行情。I…",
      "title": "FOMO開始發作。"
    }
  ],
  "title": "FOMO starting to hit.",
  "created_utc": 1617952224,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve been investing in a target retirement fund for a few years now.  Shamelessly I took a more active approach to investing right after the GME affair, about 2 months ago.</p>\n\n<p>I don&#39;t have a lot of cash, and it was clear that we were coming off of a huge bull run after the Covid crash last year.  I didn&#39;t want to throw a whole lot of money into highly-valued stocks or ETFs, like ARKK.  In the end it looks like that was the right decision, at least at that moment.  Now might be a better entry point, not sure, it&#39;s also not one that&#39;s on my radar.</p>\n\n<p>So I ended up doing some pretty defensive investments that have done pretty well for me these last 2 months. In fairness, what hasn&#39;t done well?  I had limited tech exposure and even those are racing upwards after the little pullback last month.</p>\n\n<p>The idea, again, was to not pour a lot of money into stocks which were potentially at ATH (sorry, I tried timing the market) and also investing in things that would do alright in the event of a correction, since I don&#39;t want to lose this money in the short-to-mid term.  Once again, so far so good.</p>\n\n<p>But man, it looks like stonks always go up!  Kidding, but this bull run looks like it has no end. Monetary policy is loose.  Economy set to reopen.  Massive stimulus.  What could go wrong? (somewhat kidding)</p>\n\n<p>What I&#39;m trying to say is that I was pretty bearish when I bought in 2 months ago, and now it looks like that prediction could have been wrong, and I&#39;m experiencing FOMO. Can anyone relate?  </p>\n\n<p>I was supposed to hold some dry powder in reserve, and a little bit of an extra cushion in savings, but man right now I just wanna buy buy buy.  Thoughts?</p>\n\n<p><em>(I know I will probably be criticized for my investment decisions, have at it, but the point was to see if anyone else is experiencing this feeling of FOMO right now and how you&#39;re dealing with it.)</em></p>\n</div><!-- SC_ON -->",
  "score": 55,
  "permalink": "/r/stocks/comments/mn374f/fomo_starting_to_hit/",
  "subreddit": "stocks",
  "id": "mn374f",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1618566617817
}