{
  "author": "CommunicationNo3845",
  "original_created_utc": 1645371159,
  "title": "Don’t get too pressed on ETH2.0. Vitalik himself admitted on the Bankless podcast that it may take 6 years for it to full be completed.",
  "created_utc": 1645389117,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Chill out and take your time cause its most probable that ETH2.0 in its final form will take years to be completed.&lt;/p&gt;\n\n&lt;p&gt;This doesn’t mean that we’ll have to wait 6 years to have a highly performing Ethereum network.&lt;/p&gt;\n\n&lt;p&gt;The main focus, as Vitalik stated, should be 2 things:&lt;/p&gt;\n\n&lt;p&gt;• The move to PoS&lt;/p&gt;\n\n&lt;p&gt;• Sharding&lt;/p&gt;\n\n&lt;p&gt;Any additional features are just polishing the network to make it as perfect as possible.&lt;/p&gt;\n\n&lt;p&gt;In the meantime, Vitalik is solely focused on Zk rollups as the future of scalability for Ethereum.&lt;/p&gt;\n\n&lt;p&gt;This decision to build around rollups came back in 2020 when Vitalik wrote an article titled “A roll-up-centric ethereum roadmap” where he explained how Ethereum would be all in on rollup tech (Give it a read its very interesting).&lt;/p&gt;\n\n&lt;p&gt;I guess this is why he’s so fond of MATIC recently considering they’ve invested into every single ZK rollup tech available on the market and have proven to be top dogs when it comes to scalability.&lt;/p&gt;\n\n&lt;p&gt;So while the final stage or ETH2.0 might take a while, we should soon start seeing a lot more improvement from both Ethereum and side chains like Polygon.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 472,
  "permalink": "/r/CryptoCurrency/comments/sx3qhn/dont_get_too_pressed_on_eth20_vitalik_himself/",
  "subreddit": "CryptoCurrency",
  "id": "sx3qhn",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Chill out and take your time cause its most probable that ETH2.0 in its final\nform will take years to be completed.\n\nThis doesn’t mean that we’ll have to wait 6 years to have a highly performing\nEthereum network.\n\nThe main focus, as Vitalik stated, should be 2 things:\n\n• The move to PoS\n\n•…"
}