{
  "author": "premeddit",
  "original_created_utc": 1654113136,
  "title": "The ancient Indian epic Mahabharata mentions a yellow-skinned race called the \"Chinas\" taking part in major battles. Is this actually a reference to China, as some believe? If so why would China send armies to India in 1000 BCE; and if not, then why did the authors insert them into the story?",
  "created_utc": 1654146968,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;&lt;strong&gt;EDIT: I’ve been now told that only 1% of threads here even get a response, and even then it’s very Eurocentric - usually threads about Hitler or Ancient Rome. Can someone direct me to a sub about Asian history so I might contact some people who are motivated to answer? Thank you.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;So for those who don&amp;#39;t know, &lt;em&gt;Mahabharata&lt;/em&gt; is an ancient Indian epic that&amp;#39;s sometimes called the eastern equivalent of &lt;em&gt;The Iliad&lt;/em&gt;. It tells of a great war fought thousands of years ago (scholars estimate around 1000 BCE) which would shape Indian religion, culture and history forever.&lt;/p&gt;\n\n&lt;p&gt;One very interesting tidbit I came across, but which doesn&amp;#39;t seem to get much discussion anywhere online or offline, &lt;a href=\"https://en.wikipedia.org/wiki/Chinas\"&gt;is the inclusion of a tribe called the Chinas.&lt;/a&gt; According to the writer of the epic, the Chinas were a nation whose territory is very far away and &amp;quot;can be reached by a land-route across the country of the Kiratas in the mountain regions of the north&amp;quot;. They are shown as sending large armies to fight in various battles during the story. But not much more is known about them.&lt;/p&gt;\n\n&lt;p&gt;The wikipedia link, as well as other articles I&amp;#39;ve seen, believes this represents a Chinese dynasty. Can any historian here weigh in on whether there is any basis to this? It would be really interesting if Chinese militaries were invading India as far back as 1000 BCE, but that also raises the question of why - and in that case why don&amp;#39;t we hear more about Chinese-Indian political relations in ancient literature. And if China wasn&amp;#39;t a part of this at all, what reason would the author have to randomly include them among the nations listed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 106,
  "permalink": "/r/AskHistorians/comments/v2pplv/the_ancient_indian_epic_mahabharata_mentions_a/",
  "subreddit": "AskHistorians",
  "id": "v2pplv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "EDIT: I’ve been now told that only 1% of threads here even get a response, and\neven then it’s very Eurocentric - usually threads about Hitler or Ancient Rome.\nCan someone direct me to a sub about Asian history so I might contact some\npeople who are motivated to answer? Thank you.\n\nSo for those who…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "EDIT: ここのスレッドのうち、レスがつくのは1％だけだと聞きました。\nヒトラーや古代ローマに関するスレッドが多いそうです。\n誰かアジアの歴史についてのサブを案内してくれませんか。\nを連絡することができます。ありがとうございます。\n\nでは、そのような方のために...",
      "title": "古代インドの叙事詩『マハーバーラタ』には、「チャイナ」と呼ばれる肌の黄色い民族が大きな戦いに参加したことが書かれている。これは中国を指しているのだろうか？もしそうなら、なぜ中国は紀元前1000年にインドに軍隊を送ったのだろうか。もしそうでないなら、作者はなぜ彼らを物語の中に挿入したのだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "编辑：现在有人告诉我，这里只有1%的主题能得到回应，而且\n即使如此，也是非常以欧洲为中心的--通常是关于希特勒或古罗马的主题。\n谁能把我引到一个关于亚洲历史的子目录，这样我就能联系到一些\n愿意回答的人？谢谢你。\n\n所以对于那些...",
      "title": "古代印度史诗《摩诃婆罗多》中提到一个被称为 \"中国人 \"的黄皮肤种族参加了重大的战斗。这是否像有些人认为的那样，实际上是指中国？如果是，为什么中国会在公元前1000年派军队到印度；如果不是，那么作者为什么要把他们插入故事中？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "編輯：現在有人告訴我，這裏只有1%的主題能得到回應，而且\n即使如此，也是非常以歐洲爲中心的--通常是關於希特勒或古羅馬的主題。\n誰能把我引到一個關於亞洲歷史的子目錄，這樣我就能聯繫到一些\n願意回答的人？謝謝你。\n\n所以對於那些...",
      "title": "古代印度史詩《摩訶婆羅多》中提到一個被稱爲 \"中國人 \"的黃皮膚種族參加了重大的戰鬥。這是否像有些人認爲的那樣，實際上是指中國？如果是，爲什麼中國會在公元前1000年派軍隊到印度；如果不是，那麼作者爲什麼要把他們插入故事中？"
    }
  ]
}