{
  "author": "Scwolves10",
  "original_created_utc": 1627186144,
  "title": "Honest question for people that hold thousands of moons",
  "created_utc": 1627205441,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve  been in this sub a long time so I&#39;ve been thinking about this for quite a while.</p>\n\n<p>How do you guys actively hold $100+ or $1000+ worth of moons? Maybe it&#39;s just me but I would be ecstatic if I had that and would be spending them.</p>\n\n<p>Do you guys have enough invested that it&#39;s just not needed? Or are you guys just holding until the price increases?</p>\n\n<p>Edit: holy shit I expected I&#39;ve 5 - 10 replies. Not over 100 lol.</p>\n\n<p>Edit 2: I&#39;m trying to reply to as many people as I can. And I appreciate all of you guys, amd girls, for replying! This had way more attention than I thought it would.</p>\n</div><!-- SC_ON -->",
  "score": 173,
  "permalink": "/r/CryptoCurrency/comments/or4ox7/honest_question_for_people_that_hold_thousands_of/",
  "subreddit": "CryptoCurrency",
  "id": "or4ox7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've been in this sub a long time so I've been thinking about this for quite a\nwhile.\n\nHow do you guys actively hold $100+ or $1000+ worth of moons? Maybe it's just me\nbut I would be ecstatic if I had that and would be spending them.\n\nDo you guys have enough invested that it's just not needed? Or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私はこのサブ機を長く使っているので、かなり前から考えていました。\nしています。\n\nみなさんは、100ドル以上、1000ドル以上の価値のあるムーンをどのように積極的に保持していますか？私だけかもしれませんが\n私だけかもしれませんが、それを持っていたら有頂天になって使ってしまいそうです。\n\n皆さんは、必要ないくらいの投資をしているのでしょうか？それとも...",
      "title": "何千個もの月を持っている人への率直な質問"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我在这一领域工作了很长时间，所以我已经考虑了很久。\n一段时间了。\n\n你们是如何积极持有价值100多美元或1000多美元的月球的？也许这只是我的问题\n但如果我有这些钱，我会欣喜若狂，并且会花掉它们。\n\n你们是否有足够的投资，以至于不需要它？或者...",
      "title": "对持有成千上万个月亮的人的诚实的问题"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我在這一領域工作了很長時間，所以我已經考慮了很久。\n一段時間了。\n\n你們是如何積極持有價值100多美元或1000多美元的月球的？也許這只是我的問題\n但如果我有這些錢，我會欣喜若狂，並且會花掉它們。\n\n你們是否有足夠的投資，以至於不需要它？或者...",
      "title": "對持有成千上萬個月亮的人的誠實的問題"
    }
  ]
}