{
  "author": "KerbyKing",
  "original_created_utc": 1630242824,
  "title": "Should I give money to panhandlers/homeless people?",
  "created_utc": 1630276637,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I do empathize with their plight, but I don&#39;t have much money to give as I work at a gas station. I see the same people asking for money on the same corners for two years. Would it not be preferable for them to try and find a job rather than sit out under the Texas sun every day? I understand mental health issues are prevalent among this community, but what else would be stopping them from getting a job? I&#39;m just trying to understand.</p>\n</div><!-- SC_ON -->",
  "score": 106,
  "permalink": "/r/TooAfraidToAsk/comments/pdv07l/should_i_give_money_to_panhandlershomeless_people/",
  "subreddit": "TooAfraidToAsk",
  "id": "pdv07l",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I do empathize with their plight, but I don't have much money to give as I work\nat a gas station. I see the same people asking for money on the same corners for\ntwo years. Would it not be preferable for them to try and find a job rather than\nsit out under the Texas sun every day? I understand mental…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "彼らの窮状には共感しますが、私はガソリンスタンドで働いているので、あまりお金を出すことができません。\nガソリンスタンドで働いているので、あまりお金はありません。私はガソリンスタンドで働いているので、あまりお金はありませんが、2年前から同じ人が同じ場所でお金を要求しています。\n2年前から同じ場所でお金を要求しています。彼らにとっては、テキサスの夏の暑さの中でじっとしているよりも、仕事を探した方がいいのではないでしょうか。\n毎日、テキサスの太陽の下で座っているよりも、仕事を探した方がいいのでは？私は精神的なものを理解しています。",
      "title": "パンチラやホームレスの人にお金を渡すべきでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我很同情他们的困境，但我没有太多的钱，因为我在加油站工作。\n在一个加油站工作。我看到同样的人在同样的角落里向我要钱，已经两年了。\n两年了。对他们来说，试图找到一份工作而不是\n而不是每天坐在德克萨斯的阳光下？我理解精神...",
      "title": "我应该给乞丐/无家可归者送钱吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我很同情他們的困境，但我沒有太多的錢，因爲我在加油站工作。\n在一個加油站工作。我看到同樣的人在同樣的角落裏向我要錢，已經兩年了。\n兩年了。對他們來說，試圖找到一份工作而不是\n而不是每天坐在德克薩斯的陽光下？我理解精神...",
      "title": "我應該給乞丐/無家可歸者送錢嗎？"
    }
  ]
}