{
  "author": "extrasa",
  "original_created_utc": 1652829627,
  "title": "Am I a douchebag for stealing food that would’ve otherwise been thrown out?",
  "created_utc": 1652854585,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi peoples of reddit. I’m currently living out of my car and have been for a few months. There’s a Panera in my area and a few nights a week (I’m talking two or three MAX), I’ll go in there and silently take an online order from the shelf if I see it has been sitting for a few hours (I check the time stamps on the receipt, so whoever ordered it is obviously not coming for it). The staff don’t seem to check the shelf and there’s always an old order or two still sitting there, and honestly it’s a good way to get myself fed, because I can’t really afford otherwise. I feel bad doing this, but I mean, the orders would’ve been thrown out anyways at the end of the night. Does this make me a bad person?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 110,
  "permalink": "/r/TooAfraidToAsk/comments/urz7rb/am_i_a_douchebag_for_stealing_food_that_wouldve/",
  "subreddit": "TooAfraidToAsk",
  "id": "urz7rb",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Hi peoples of reddit. I’m currently living out of my car and have been for a few\nmonths. There’s a Panera in my area and a few nights a week (I’m talking two or\nthree MAX), I’ll go in there and silently take an online order from the shelf if\nI see it has been sitting for a few hours (I check the…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "こんにちは、redditの皆さん。私は現在、車の中で生活しており、数ヶ月間しています。\nしています。私の住んでいる地域にはパネラがあり、週に2、3日の夜（MAXで2、3日です。\nを、黙って棚から取ってくる。\n数時間放置されてるのを見ると...。",
      "title": "捨てられるはずの食べ物を盗むなんて、私は嫌な奴なのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "嗨，reddit的人们。我目前住在我的车里，已经有几个月了。\n几个月了。我所在的地区有一家帕内拉餐厅，每周有几个晚上（我说的是两到三个晚上），我会去那里默默地吃一顿饭。\n我每周有几个晚上（我说的是两到三个MAX），我会去那里，默默地从货架上拿一个在线订单，如果我看到它已经被放置了一段时间。\n我看到它已经被放置了几个小时（我检查了...",
      "title": "我偷吃了本来会被扔掉的食物，是个恶棍吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "嗨，reddit的人們。我目前住在我的車裏，已經有幾個月了。\n幾個月了。我所在的地區有一家帕內拉餐廳，每週有幾個晚上（我說的是兩到三個晚上），我會去那裏默默地喫一頓飯。\n我每週有幾個晚上（我說的是兩到三個MAX），我會去那裏，默默地從貨架上拿一個在線訂單，如果我看到它已經被放置了一段時間。\n我看到它已經被放置了幾個小時（我檢查了...",
      "title": "我偷吃了本來會被扔掉的食物，是個惡棍嗎？"
    }
  ]
}