{
  "author": "Charming-Station",
  "original_created_utc": 1636425733,
  "title": "American mega church pastors look like the worst kind of con men. Do people that attend those churches feel the same?",
  "created_utc": 1636435271,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I cannot imagine looking at any of the mega church type pastors with anything other than distrust, they look like horrible people living lavish lives under the protection of religion. Do people in those churches feel the same way but think it&#39;s an acceptable situation for potential eternal heaven or are they blind to it?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/qptw0n/american_mega_church_pastors_look_like_the_worst/",
  "subreddit": "NoStupidQuestions",
  "id": "qptw0n",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I cannot imagine looking at any of the mega church type pastors with anything\nother than distrust, they look like horrible people living lavish lives under\nthe protection of religion. Do people in those churches feel the same way but\nthink it's an acceptable situation for potential eternal heaven or…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "メガチャーチ系の牧師を見ていると、不信感以外の何物でもありません。\n宗教に守られて贅沢な生活をしている恐ろしい人たちにしか見えません。\n宗教の保護の下で贅沢な生活をしている恐ろしい人たちに見えます。そのような教会の人々も同じように感じているのでしょうか？\nそのような教会の人たちは、同じように感じていても、永遠の天国に行く可能性のある状況を受け入れられると思っているのでしょうか...。",
      "title": "アメリカのメガチャーチの牧師は、最悪の詐欺師のように見えます。そのような教会に通う人々は、同じように感じているのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我无法想象，在看到任何一个大型教会类型的牧师时，除了不信任之外，还能有什么反应？\n除了不信任之外，他们看起来就像可怕的人，在宗教的保护下过着奢华的生活。\n在宗教的保护下过着奢侈的生活。这些教会中的人是否也有同样的感觉，但是\n认为这是一个可以接受的潜在永恒的天堂的情况，还是......",
      "title": "美国大型教会的牧师看起来像最糟糕的骗子。参加这些教会的人也有同样的感觉吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我無法想象，在看到任何一個大型教會類型的牧師時，除了不信任之外，還能有什麼反應？\n除了不信任之外，他們看起來就像可怕的人，在宗教的保護下過着奢華的生活。\n在宗教的保護下過着奢侈的生活。這些教會中的人是否也有同樣的感覺，但是\n認爲這是一個可以接受的潛在永恆的天堂的情況，還是......",
      "title": "美國大型教會的牧師看起來像最糟糕的騙子。參加這些教會的人也有同樣的感覺嗎？"
    }
  ]
}