{
  "author": "DerHungerleider",
  "original_created_utc": 1634910368,
  "title": "Are (or were) german historians pressured to avoid using the term \"fascism\" when talking about the Nazis?",
  "created_utc": 1634973329,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;ve recently read a german article<sup>1</sup>  in which the author at one point states that among german historians there is an informal rule that they have to use the term &quot;Nationalsozialismus&quot; (National Socialism) when talking about the Nazis and that those who break that rule by using other terms, like &quot;Faschismus&quot; (Fascism), often face major disadvantages (like certain publishers and papers refusing to publish their works, getting worse grades in dissertations etc.). </p>\n\n<p>Now I&#39;m wondering if this is (or atleast was when the article was published) actually the case in germany (and a known phenomenon) and if this can also be found in other countries aswell. </p>\n\n<p>&#x200B;</p>\n\n<p>1 Roth, Karl Heinz (2004). &quot;Faschismus oder Nationalsozialismus? Kontroversen im Spannungsfeld zwischen Geschichtspolitik, Gefühl und Wissenschaft&quot;. In: Sozial.Geschichte : Zeitschrift für historische Analyse des 20. und 21. Jahrhunderts, 19, 2. (<a href=\"https://www.digizeitschriften.de/dms/img/?PID=PPN519763432_0019%7CLOG_0035\">https://www.digizeitschriften.de/dms/img/?PID=PPN519763432_0019%7CLOG_0035</a>)</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/qdhahk/are_or_were_german_historians_pressured_to_avoid/",
  "subreddit": "AskHistorians",
  "id": "qdhahk",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I've recently read a german article1 in which the author at one point states\nthat among german historians there is an informal rule that they have to use the\nterm \"Nationalsozialismus\" (National Socialism) when talking about the Nazis and\nthat those who break that rule by using other terms, like…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近読んだドイツの記事1では、著者が次のように述べています。\nドイツの歴史家の間では、「」という言葉を使わなければならないという非公式なルールがあると述べています。\nドイツの歴史家の間では、ナチスについて語るときには「Nationalsozialismus」（国家社会主義）という言葉を使わなければならないという非公式なルールがあり、そのルールを破って\nそのルールを破って他の用語を使う者は...",
      "title": "ドイツの歴史家は、ナチスについて語るときに「ファシズム」という言葉を使わないように圧力をかけられている（いた）のでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近读了一篇德国的文章1，作者在其中有一点指出\n在德国的历史学家中，有一个非正式的规则，他们必须使用\n术语 \"Nationalsozialismus\"（国家社会主义）。\n而那些违反规则使用其他术语的人，如...",
      "title": "德国历史学家是否（或曾经）受到压力，在谈论纳粹时避免使用 \"法西斯主义 \"一词？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近讀了一篇德國的文章1，作者在其中有一點指出\n在德國的歷史學家中，有一個非正式的規則，他們必須使用\n術語 \"Nationalsozialismus\"（國家社會主義）。\n而那些違反規則使用其他術語的人，如...",
      "title": "德國曆史學家是否（或曾經）受到壓力，在談論納粹時避免使用 \"法西斯主義 \"一詞？"
    }
  ]
}