{
  "author": "Fiveby21",
  "original_created_utc": 1642096440,
  "title": "Why did widowed Medieval Queens often \"retire\" to a convent? And did they actually become/live as nuns? What was their life like there?",
  "created_utc": 1642140567,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It seems strange to me that someone who was once a king&amp;#39;s wife, and who no doubt has a healthy income from dower estates, would choose to retire to a convent and live a life of poverty. Why was this so common? Is there something I&amp;#39;m misunderstanding about life in a medieval nunnery?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/s359nm/why_did_widowed_medieval_queens_often_retire_to_a/",
  "subreddit": "AskHistorians",
  "id": "s359nm",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "It seems strange to me that someone who was once a king's wife, and who no doubt\nhas a healthy income from dower estates, would choose to retire to a convent and\nlive a life of poverty. Why was this so common? Is there something I'm\nmisunderstanding about life in a medieval nunnery?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "かつて王の妻であった人が、そのようなことをするのは不思議です。\nを持ちながら、修道院で隠居することを選択したのです。\n清貧の生活を送る。なぜ、こんなにも一般的だったのでしょうか。何か私が\n中世の修道院の生活について誤解していませんか？",
      "title": "なぜ、未亡人となった中世の女王は、しばしば修道院に「隠居」したのでしょうか。また、実際に修道女になったのか、生活したのか？そこでの生活はどのようなものだったのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我觉得很奇怪，一个曾经是国王妻子的人，而且毫无疑问，她从嫁妆中获得了丰厚的收入。\n财产的健康收入，会选择退休到修道院，过着贫穷的生活。\n过着贫穷的生活。为什么这种情况如此普遍？我是不是对中世纪的生活有什么\n对中世纪尼姑庵的生活有什么误解吗？",
      "title": "为什么中世纪的寡妇皇后经常 \"退休 \"到修道院？她们是否真的成为/过着修女的生活？她们在那里的生活是怎样的？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我覺得很奇怪，一個曾經是國王妻子的人，而且毫無疑問，她從嫁妝中獲得了豐厚的收入。\n財產的健康收入，會選擇退休到修道院，過着貧窮的生活。\n過着貧窮的生活。爲什麼這種情況如此普遍？我是不是對中世紀的生活有什麼\n對中世紀尼姑庵的生活有什麼誤解嗎？",
      "title": "爲什麼中世紀的寡婦皇后經常 \"退休 \"到修道院？她們是否真的成爲/過着修女的生活？她們在那裏的生活是怎樣的？"
    }
  ]
}