{
  "author": "Sikander-The-Great",
  "original_created_utc": 1658407766,
  "title": "Is it wrong to pay on the first date?",
  "created_utc": 1658421306,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Growing up, I was taught that a male should always pay for the first date (whether it had gone well or not). &lt;/p&gt;\n\n&lt;p&gt;I was recently on a dinner date with my crush, and at the end I took out my card to pay the whole bill (my dad had given me some money as well). &lt;/p&gt;\n\n&lt;p&gt;The girl I was with, insisted that I split the bill with her 50/50. Her reasoning was that a boy paying the bill was a practice from a bygone era.&lt;/p&gt;\n\n&lt;p&gt;I respected her wishes, although I had an uneasy feeling in my chest. I also felt very judged, by the waiting staff. I also got told off by my mom when I went home.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/TooAfraidToAsk/comments/w4fw0j/is_it_wrong_to_pay_on_the_first_date/",
  "subreddit": "TooAfraidToAsk",
  "id": "w4fw0j",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Growing up, I was taught that a male should always pay for the first date\n(whether it had gone well or not).\n\nI was recently on a dinner date with my crush, and at the end I took out my card\nto pay the whole bill (my dad had given me some money as well).\n\nThe girl I was with, insisted that I split…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私は幼い頃から、最初のデートは（うまくいかなくても）必ず男性がお金を払うものだと教えられてきました。\n(と教えられてきました。）\n\n最近、片思いの相手とディナーデートをして、最後に自分のカードで会計を済ませました。\nを出し、全額を支払いました（父もいくらかお金をくれました）。\n\n一緒にいた女の子は、私が割り勘にするよう主張し...",
      "title": "初デートでお金を払うのは悪いことですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "在我的成长过程中，我被教导说，男性应该总是为第一次约会付钱。\n(无论它是否顺利）。\n\n最近我和我的暗恋对象约会吃饭，最后我拿出了我的卡\n付了整个账单（我爸爸也给了我一些钱）。\n\n和我在一起的那个女孩，坚持要我分...",
      "title": "第一次约会就付钱有错吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "在我的成長過程中，我被教導說，男性應該總是爲第一次約會付錢。\n(無論它是否順利）。\n\n最近我和我的暗戀對象約會喫飯，最後我拿出了我的卡\n付了整個賬單（我爸爸也給了我一些錢）。\n\n和我在一起的那個女孩，堅持要我分...",
      "title": "第一次約會就付錢有錯嗎？"
    }
  ]
}