{
  "author": "ilikethetech_100",
  "the_new_excerpt": "It seems when BTC is hitting ATHs or Alts are tearing up the charts only my\n\"Crypto friends\" are talking about it. As soon as a big correction (not a crash)\ncomes along people are coming out of the woodwork to ask me how much I'm down!\nTo top it off when I let them know the %% I am up for the last…",
  "original_created_utc": 1621531384,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "BTCがATHを達成したり、アルトがチャートを引き裂いたりしているときには、私の「暗号化された友人」だけが話題にしているようです。\n私の \"Crypto friends \"だけがその話をしているようです。大きな調整（暴落ではない）があるとすぐに\n大きな調整（クラッシュではありません）が入ると、人々はどれくらい下がったのかを尋ねるために出てきます。\n挙げ句の果てには、私が過去に上昇した割合を知らせると...。",
      "title": "どうして市場が調整局面に入ったときだけ、友人や家族が私のポートフォリオについて話してくれるのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "似乎当BTC触及ATH或Alts在图表上撕毁时，只有我的\n\"加密货币朋友 \"在谈论它。一旦出现大的调整（不是崩溃），人们就会出来问我，我有多少钱？\n人们就会跑出来问我跌了多少!\n最重要的是，当我让他们知道我在过去几年里上涨了多少%时，他们就会问我。",
      "title": "为什么朋友/家人只在市场处于调整期时才会主动谈及我的投资组合？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "似乎當BTC觸及ATH或Alts在圖表上撕毀時，只有我的\n\"加密貨幣朋友 \"在談論它。一旦出現大的調整（不是崩潰），人們就會出來問我，我有多少錢？\n人們就會跑出來問我跌了多少!\n最重要的是，當我讓他們知道我在過去幾年裏上漲了多少%時，他們就會問我。",
      "title": "爲什麼朋友/家人只在市場處於調整期時纔會主動談及我的投資組合？"
    }
  ],
  "title": "How come friends/family only reach out to talk about my portfolio when the market is in a correction?",
  "created_utc": 1621564582,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It seems when BTC is hitting ATHs or Alts are tearing up the charts only my &quot;Crypto friends&quot; are talking about it. As soon as a big correction (not a crash) comes along people are coming out of the woodwork to ask me how much I&#39;m down! To top it off when I let them know the %% I am up for the last year they seem to lose interest. Freaking people man! </p>\n\n<p>Rant over</p>\n</div><!-- SC_ON -->",
  "score": 446,
  "permalink": "/r/CryptoCurrency/comments/nh63ks/how_come_friendsfamily_only_reach_out_to_talk/",
  "subreddit": "CryptoCurrency",
  "id": "nh63ks",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1622197381657
}