{
  "author": "The_Pamphlet",
  "original_created_utc": 1645103505,
  "title": "\"Does philosophy need to be difficult to read?\": What literature exists discussing philosophy, and how it is written? Specifically, does formal discourse exist about whether philosophy needs to be written in certain ways, generally, as a discipline?",
  "created_utc": 1645173401,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Philosophers and philosophy students, as well as fans beyond the academy have plenty of hot takes about &amp;#39;good&amp;#39; and &amp;#39;bad&amp;#39; writing in philosophy. I am familiar with informal debates over whether Derrida needed to be so convoluted in his writing, or allegations about Foucault &amp;#39;intentionally&amp;#39; putting &amp;#39;nonsense&amp;#39; in his writing.&lt;/p&gt;\n\n&lt;p&gt;Are there philosophical justifications for certain types of prose, any articles, books, or chapters?&lt;/p&gt;\n\n&lt;p&gt;I am otherwise only familiar with Leo Strauss on &amp;#39;Persecution and the Art of Writing&amp;#39; and esotericism&amp;#39;s role in protecting people from persecution.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askphilosophy/comments/suohsi/does_philosophy_need_to_be_difficult_to_read_what/",
  "subreddit": "askphilosophy",
  "id": "suohsi",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Philosophers and philosophy students, as well as fans beyond the academy have\nplenty of hot takes about 'good' and 'bad' writing in philosophy. I am familiar\nwith informal debates over whether Derrida needed to be so convoluted in his\nwriting, or allegations about Foucault 'intentionally' putting…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "哲学者や哲学を学ぶ学生、そしてアカデミーを超えたファンたちが\n哲学の「良い」文章と「悪い」文章について、たくさんの熱い議論が交わされています。私は\nデリダがこれほどまでに複雑な表現をする必要があったのか、という非公式な議論に\nまた、フーコーが「意図的な」文章を書いたという疑惑もあるようです...。",
      "title": "\"哲学に読みにくさは必要なのか\"。哲学について、またその書き方について論じた文献はどのようなものがあるのでしょうか。具体的には、哲学は学問として一般的にある種の書き方をする必要があるのかどうかということについて、正式な言説は存在するのでしょうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "哲学家和哲学系学生，以及学术界以外的爱好者对哲学中的 \"好 \"和 \"坏 \"写作有很多热议。\n关于哲学中的 \"好 \"和 \"坏 \"的写作，有很多热议。我很熟悉\n我熟悉关于德里达是否需要在他的写作中如此曲折的非正式辩论。\n写作，或者关于福柯 \"故意 \"把......的指控。",
      "title": "\"哲学需要难读吗？\"。存在哪些讨论哲学的文献，以及它是如何书写的？具体来说，是否存在关于哲学作为一门学科是否需要以某种方式书写的正式论述？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "哲學家和哲學系學生，以及學術界以外的愛好者對哲學中的 \"好 \"和 \"壞 \"寫作有很多熱議。\n關於哲學中的 \"好 \"和 \"壞 \"的寫作，有很多熱議。我很熟悉\n我熟悉關於德里達是否需要在他的寫作中如此曲折的非正式辯論。\n寫作，或者關於福柯 \"故意 \"把......的指控。",
      "title": "\"哲學需要難讀嗎？\"。存在哪些討論哲學的文獻，以及它是如何書寫的？具體來說，是否存在關於哲學作爲一門學科是否需要以某種方式書寫的正式論述？"
    }
  ]
}