{
  "author": "seafoodboiler",
  "original_created_utc": 1641823836,
  "title": "Why do Western historians use 'dynasty' to refer to political phases in certain regions (China especially), but not as often when referring to European or other regional history?",
  "created_utc": 1641839862,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I know that there ARE European dynasties that are referred to as such, but more often than not they are referred to as &amp;#39;houses&amp;#39;. To make things more inconsistent, Mongol political factions are often also called &amp;#39;houses&amp;#39;, i.e. &amp;#39;House of Ogedai&amp;#39;, so I&amp;#39;m confused as to what historians had in mind when using these terms.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/s0kvq4/why_do_western_historians_use_dynasty_to_refer_to/",
  "subreddit": "AskHistorians",
  "id": "s0kvq4",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I know that there ARE European dynasties that are referred to as such, but more\noften than not they are referred to as 'houses'. To make things more\ninconsistent, Mongol political factions are often also called 'houses', i.e.\n'House of Ogedai', so I'm confused as to what historians had in mind when…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "ヨーロッパの王朝で、そのように呼ばれるものがあることは知っていますが、それ以上です。\n家」と呼ばれることが多いですね。さらに言えば\nモンゴルの政治的な派閥も「家」と呼ばれることが多く、矛盾しています。\nモンゴルの政治的な派閥も「家」と呼ばれることが多く、例えば「オゲダイの家」などは、歴史家が何を考えていたのか混乱します。",
      "title": "なぜ西洋の歴史家は、ある地域（特に中国）の政治的段階を指すのに「王朝」を使い、ヨーロッパや他の地域の歴史に言及するときにはあまり使わないのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我知道有一些欧洲王朝是这样称呼的，但更多的时候它们被称为 \"家族\"。\n但更多时候，他们被称为 \"家族\"。为了使事情更加\n不一致，蒙古族的政治派别也经常被称为 \"家族\"，即\nOgedai家族\"，所以我很困惑，历史学家们是怎么想的，当...",
      "title": "为什么西方历史学家用 \"王朝 \"来指称某些地区（尤其是中国）的政治阶段，而在提及欧洲或其他地区的历史时却不那么经常？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我知道有一些歐洲王朝是這樣稱呼的，但更多的時候它們被稱爲 \"家族\"。\n但更多時候，他們被稱爲 \"家族\"。爲了使事情更加\n不一致，蒙古族的政治派別也經常被稱爲 \"家族\"，即\nOgedai家族\"，所以我很困惑，歷史學家們是怎麼想的，當...",
      "title": "爲什麼西方歷史學家用 \"王朝 \"來指稱某些地區（尤其是中國）的政治階段，而在提及歐洲或其他地區的歷史時卻不那麼經常？"
    }
  ]
}