{
  "author": "LisHere321",
  "original_created_utc": 1629401736,
  "title": "Unpopular popular opinion: You all just want one thing...lots of **FIAT**",
  "created_utc": 1629441046,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are countless posts asking what we desired most or what we want to get when selling our precious crypto.</p>\n\n<p>Many people say paying off debt, mortages, getting a house, financial freedom.</p>\n\n<p>So in the end we all just want</p>\n\n<h1>FIAT</h1>\n\n<p>plain said, but it is the truth. We talk about mass adoption of crypto, but even our mind (yes, I mean you! Us crypto lovers) says we need that fiat to make stuff possible. Crypto is just a way to get to fiat or boost fiat income. We are still too fiat focused, how can mass adoption work, if crypto enthusiasts are still mainly fiat focused.</p>\n\n<p><em>Bye Loyalty to crypto...fiat still king having its iron fist grapping us</em></p>\n</div><!-- SC_ON -->",
  "score": 153,
  "permalink": "/r/CryptoCurrency/comments/p7lx54/unpopular_popular_opinion_you_all_just_want_one/",
  "subreddit": "CryptoCurrency",
  "id": "p7lx54",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "There are countless posts asking what we desired most or what we want to get\nwhen selling our precious crypto.\n\nMany people say paying off debt, mortages, getting a house, financial freedom.\n\nSo in the end we all just want\n\n\nFIAT\n\nplain said, but it is the truth. We talk about mass adoption of…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "大切な暗号を売るときに、何を一番望んでいるか、何を手に入れたいかを尋ねる投稿は数え切れないほどあります。\n貴重な暗号を売るときに何を手に入れたいかという質問は数え切れないほどあります。\n\n多くの人が、借金の返済、住宅ローン、家の購入、経済的自由などと答えています。\n\nしかし、結局のところ、私たちが欲しいのは\n\n\nFIAT\n\n地味な言葉ですが、これが真実です。私たちは、大量導入の話をしています...",
      "title": "人気のない人気のある意見 皆さんの望みはただ一つ...たくさんの**FIAT**です。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "有无数的帖子问我们最想要的是什么，或者我们想得到什么？\n我们卖掉宝贵的加密货币时想得到什么。\n\n很多人说还债，抵押贷款，买房子，财务自由。\n\n所以最后我们都只想要\n\n\nFIAT\n\n说来简单，但这是事实。我们谈论的是大规模采用...",
      "title": "不受欢迎的大众意见。你们都只想要一样东西......大量的**屁**。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有無數的帖子問我們最想要的是什麼，或者我們想得到什麼？\n我們賣掉寶貴的加密貨幣時想得到什麼。\n\n很多人說還債，抵押貸款，買房子，財務自由。\n\n所以最後我們都只想要\n\n\nFIAT\n\n說來簡單，但這是事實。我們談論的是大規模採用...",
      "title": "不受歡迎的大衆意見。你們都只想要一樣東西......大量的**屁**。"
    }
  ]
}