{
  "author": "youanus",
  "original_created_utc": 1653737245,
  "title": "The new project from Do Kwon just dropped and it's already down 70% and counting",
  "created_utc": 1653745402,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So the new LUNA just dropped and surprisingly price is already crashing, as we speak LUNA v2 is trading at $6.10 from a high of $17.&lt;/p&gt;\n\n&lt;p&gt;This was kind of expected as people who lost money on the previous LUNA are trying to recoup some of their losses through the airdrop, so expect more volatility in the coming hours.&lt;/p&gt;\n\n&lt;p&gt;Do Kwon is already celebrating the launch of his new project on Twitter but who knows how long this one will take to collapse like the previous two.&lt;/p&gt;\n\n&lt;p&gt;What i can tell you is to avoid FOMOing into his new scam project and let the market decide his fate again, this guy deserves to be humiliated again for his excessive hubris.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 507,
  "permalink": "/r/CryptoCurrency/comments/uzld6k/the_new_project_from_do_kwon_just_dropped_and_its/",
  "subreddit": "CryptoCurrency",
  "id": "uzld6k",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So the new LUNA just dropped and surprisingly price is already crashing, as we\nspeak LUNA v2 is trading at $6.10 from a high of $17.\n\nThis was kind of expected as people who lost money on the previous LUNA are\ntrying to recoup some of their losses through the airdrop, so expect more\nvolatility in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "で、新型LUNAは落としたばかりなのに、意外にももう価格が暴落しているのは、私たちのように\nLUNA v2は17ドルの高値から6.10ドルで取引されています。\n\nこれは、以前のLUNAで損をした人たちが、その損失を取り戻そうとしているためで\nこのエアドロップで損失を取り戻そうとしているのですから。\nのボラティリティを期待しています。",
      "title": "ドゥ・クォン氏の新プロジェクトは、発売されたばかりですが、すでに70％ダウンとカウントされています。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "因此，新的LUNA刚刚下降，令人惊讶的是价格已经崩溃了，因为我们\nLUNA v2从17美元的高价交易到6.10美元。\n\n这是预料之中的事，因为在以前的LUNA上亏损的人正试图通过空投收回一些损失。\n试图通过空投挽回一些损失，所以期待更多的\n波动...",
      "title": "权志龙的新项目刚刚发布，就已经下降了70%，而且还在不断增加。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "因此，新的LUNA剛剛下降，令人驚訝的是價格已經崩潰了，因爲我們\nLUNA v2從17美元的高價交易到6.10美元。\n\n這是預料之中的事，因爲在以前的LUNA上虧損的人正試圖通過空投收回一些損失。\n試圖通過空投挽回一些損失，所以期待更多的\n波動...",
      "title": "權志龍的新項目剛剛發佈，就已經下降了70%，而且還在不斷增加。"
    }
  ]
}