{
  "author": "DawudM",
  "the_new_excerpt": "Below is my advice to anyone looking to invest long term in stocks. I’ve added a\nlink for a recent BBC article on Tesla’s stock performance that should provide\nsome motivation.\n\n1) Understand how stocks work, (dividends, stock splits, realised/unrealised\ngain or loss) 2) Find a platform that works…",
  "original_created_utc": 1609545856,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "以下是我对任何想要长期投资股票的人的建议。我添加了一个\nBBC最近一篇关于特斯拉股票表现的文章的链接，应该提供\n一些动力。\n\n1)了解股票如何工作，(分红、股票拆分、已实现/未实现\n得或失)2)找到可以运行…的平台",
      "title": "已证实的买入和持有的力量"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "以下是我對任何想要長期投資股票的人的建議。我添加了一個\nBBC最近一篇關於特斯拉股票表現的文章的鏈接，應該提供\n一些動力。\n\n1)瞭解股票如何工作，(分紅、股票拆分、已實現/未實現\n得或失)2)找到可以運行…的平臺",
      "title": "已證實的買入和持有的力量"
    }
  ],
  "title": "The proven power of buying and holding",
  "created_utc": 1609554640,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Below is my advice to anyone looking to invest long term in stocks. I’ve added a link for a recent BBC article on Tesla’s stock performance that should provide some motivation. </p>\n\n<p>1) Understand how stocks work, (dividends, stock splits, realised/unrealised gain or loss) \n2) Find a platform that works well for you (simplicity, commission free). Some investment accounts are also tax free. \n3) Invest in shares. Stay away from any form of derivative products (ie. options, CFDs). \n4) Pick a stock by seeing what people are talking about and do research into the company, to a level where you would be comfortable delivering a presentation about it. \n5) Ask yourself if you believe in the company’s vision (is it working towards future innovation, is it creating value that is being recognised?) - Maybe avoid buying Coca Cola or IBM stocks as these are not growth stocks. You want the capital to work to its best efficiency. \n6) Be committed - you must have the temperament to withstand volatility along the way. It’s a rollercoaster ride. \n7) Buy up any dips (price declines). Only invest the money you’re willing to tie up and not use in the next 5+ years. \n8) “Diversification is a protection from ignorance” - Warren Buffett.</p>\n\n<p>Position: 100% in Palantir. </p>\n\n<p><a href=\"https://www.google.co.uk/amp/s/www.bbc.com/news/amp/business-55391571\">Teslanaires</a></p>\n</div><!-- SC_ON -->",
  "score": 235,
  "permalink": "/r/investing/comments/komdbd/the_proven_power_of_buying_and_holding/",
  "subreddit": "investing",
  "id": "komdbd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610100747516
}