{
  "author": "seasideshanti",
  "original_created_utc": 1654307147,
  "title": "Does anyone else replay conversations they've had throughout the day and feel like they made a fool of themselves?",
  "created_utc": 1654314977,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Talked to my boss earlier. Decent conversation. After getting back to my desk I start to think, &amp;quot;why did I say that one thing I said? She probably thinks I&amp;#39;m so weird.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Had a conversation with my landlord earlier. Seemed fine. Got home and started thinking, &amp;quot;I probably sounded stupid when I said...&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Anyone else?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 116,
  "permalink": "/r/NoStupidQuestions/comments/v4eduw/does_anyone_else_replay_conversations_theyve_had/",
  "subreddit": "NoStupidQuestions",
  "id": "v4eduw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Talked to my boss earlier. Decent conversation. After getting back to my desk I\nstart to think, \"why did I say that one thing I said? She probably thinks I'm so\nweird.\"\n\nHad a conversation with my landlord earlier. Seemed fine. Got home and started\nthinking, \"I probably sounded stupid when I…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "先ほど上司に相談しました。まともな会話だった。自分のデスクに戻った後、私は\nなんであんなこと言っちゃったんだろう？きっと彼女は私のことを変だと思ってるんだ。\n変な人だと思われてるんだろうな\"\n\nさっきは大家さんと会話したんだ。問題ないようだ。家に帰ってから\n\"バカにされたかな \"と思って...",
      "title": "一日中交わした会話を再生して、自分がバカにされたように感じる人はいないだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "早些时候和我的老板谈过了。很体面的谈话。回到我的办公桌后，我\n开始想，\"为什么我说了那句话？她可能认为我是如此\n怪异\"。\n\n早些时候和我的房东进行了一次谈话。看起来还不错。回到家后，开始\n想，\"我可能听起来很愚蠢，当我...",
      "title": "是否有人会回放自己一整天的对话，觉得自己出丑了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "早些時候和我的老闆談過了。很體面的談話。回到我的辦公桌後，我\n開始想，\"爲什麼我說了那句話？她可能認爲我是如此\n怪異\"。\n\n早些時候和我的房東進行了一次談話。看起來還不錯。回到家後，開始\n想，\"我可能聽起來很愚蠢，當我...",
      "title": "是否有人會回放自己一整天的對話，覺得自己出醜了？"
    }
  ]
}