{
  "author": "urnfieldculture_",
  "original_created_utc": 1645375626,
  "title": "What do you say to people who dismiss crypto as a 'Ponzi Scheme'?",
  "created_utc": 1645418374,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ll be honest, I&amp;#39;m always a bit flustered when this one gets levelled, because I never know where to begin in trying to debunk it. This is mainly because there are absolutely aspects of crypto investing that give off Ponzi vibes to the uninitiated - just look at all those rugged tokens, even the DAO&amp;#39;s that make headlines because of sudden price plummets etc. And no doubt the 2017ish Bitcoin craze where thousands of people bought the top before a very cold winter is still fresh in people&amp;#39;s minds, alongside BTC&amp;#39;s current price situation.&lt;/p&gt;\n\n&lt;p&gt;So my question is: how do you guys address the common accusation that we&amp;#39;re all just crabs trying to claw our way to the tippy-top of a grand digital ponzi? Many thanks.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Edit:&lt;/strong&gt; To those saying &amp;quot;nothing&amp;quot;, I appreciate the pragmaticism - but I&amp;#39;m after retorts that address the core scepticisms that a lot of people display towards crypto. Either way, I always ask myself &lt;em&gt;&amp;quot;am I still early??&amp;quot;&lt;/em&gt; I wonder if the internet&amp;#39;s early days were met with a similar response.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 307,
  "permalink": "/r/CryptoCurrency/comments/sx5fij/what_do_you_say_to_people_who_dismiss_crypto_as_a/",
  "subreddit": "CryptoCurrency",
  "id": "sx5fij",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'll be honest, I'm always a bit flustered when this one gets levelled, because\nI never know where to begin in trying to debunk it. This is mainly because there\nare absolutely aspects of crypto investing that give off Ponzi vibes to the\nuninitiated - just look at all those rugged tokens, even the…"
}