{
  "author": "kiwiphoenix6",
  "original_created_utc": 1627060260,
  "title": "Why did so many nations choose to intervene in the Angolan civil war?",
  "created_utc": 1627092146,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I recently stumbled across the Angolan civil war of &#39;74-&#39;02, and it&#39;s morbidly fascinating.</p>\n\n<p>Although the Cold War pretty much defines ugly great-power proxy conflict, the Angolans seem to have been particularly &#39;blessed&#39; with international attention.</p>\n\n<p>Over ten thousand South African, Cuban, and Russian boots on the ground, plus advisors, guns, and money from the USA, China, India, Portugal, East Germany, France, Brazil, Yugoslavia, Israel, Korea, Egypt, and more... it&#39;s a veritable world fair of countries coming together across colour and creed to declare in one voice, &#39;<em>fuck this particular part of southwest Africa</em>&#39;.</p>\n\n<p>Wikipedia and Google offhandedly mention that these various proxy players were involved, but I can&#39;t find any explanation of <strong><em>why</em></strong> they all ended up piling into Angola specifically. Does there happen to be anyone around this sub who might be able to shed some light on this?</p>\n</div><!-- SC_ON -->",
  "score": 105,
  "permalink": "/r/AskHistorians/comments/oq6uqx/why_did_so_many_nations_choose_to_intervene_in/",
  "subreddit": "AskHistorians",
  "id": "oq6uqx",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "I recently stumbled across the Angolan civil war of '74-'02, and it's morbidly\nfascinating.\n\nAlthough the Cold War pretty much defines ugly great-power proxy conflict, the\nAngolans seem to have been particularly 'blessed' with international attention.\n\nOver ten thousand South African, Cuban, and…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "最近、74年から02年までのアンゴラ内戦を偶然見つけたのですが、病的なほど魅力的でした。\n病的なほど魅力的です。\n\n冷戦は醜い大国の代理戦争を定義していますが、アンゴラの場合は\nアンゴラ人は特に国際的な注目に「恵まれて」いたようです。\n\n1万人以上の南アフリカ人、キューバ人、そして...",
      "title": "なぜ多くの国がアンゴラ内戦への介入を選んだのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我最近偶然发现了74-02年的安哥拉内战，它是病态的。\n迷人的。\n\n尽管冷战几乎定义了丑陋的大国代理冲突，但安哥拉人似乎特别 \"幸运 \"地得到了国际社会的支持。\n安哥拉人似乎特别 \"幸运 \"地受到了国际关注。\n\n超过一万名南非人、古巴人和中国人参加了这次冲突。",
      "title": "为什么这么多国家选择干预安哥拉内战？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我最近偶然發現了74-02年的安哥拉內戰，它是病態的。\n迷人的。\n\n儘管冷戰幾乎定義了醜陋的大國代理衝突，但安哥拉人似乎特別 \"幸運 \"地得到了國際社會的支持。\n安哥拉人似乎特別 \"幸運 \"地受到了國際關注。\n\n超過一萬名南非人、古巴人和中國人蔘加了這次衝突。",
      "title": "爲什麼這麼多國家選擇干預安哥拉內戰？"
    }
  ]
}