{
  "author": "walkinthepark01",
  "the_new_excerpt": "I see it a lot with people shilling their own coin holdings and proceeding to\ntalk down to others with different holdings like they have the secret formula to\ncrypto. We should be happy that there is a diverse array of crypto projects with\ndifferent use cases and functionality. If we were all only…",
  "original_created_utc": 1614791472,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我经常看到有人将自己持有的钱币进行抛售，然后继续进行\n贬低其他持股不同的人，好像他们有秘方一样。\n加密。我们应该高兴的是，有各种各样的加密项目与\n不同的用例和功能。如果我们都只...",
      "title": "我们应该为每个人都能拥有成功的加密事业而欢呼，而不仅仅是那些和你投资相同币种的人。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我經常看到有人將自己持有的錢幣進行拋售，然後繼續進行\n貶低其他持股不同的人，好像他們有祕方一樣。\n加密。我們應該高興的是，有各種各樣的加密項目與\n不同的用例和功能。如果我們都只...",
      "title": "我們應該爲每個人都能擁有成功的加密事業而歡呼，而不僅僅是那些和你投資相同幣種的人。"
    }
  ],
  "title": "We should be cheering for everyone to have a successful crypto career, not just people who are invested in the same coins as you",
  "created_utc": 1614814434,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I see it a lot with people shilling their own coin holdings and proceeding to talk down to others with different holdings like they have the secret formula to crypto. We should be happy that there is a diverse array of crypto projects with different use cases and functionality. If we were all only invested in a handful of cryptos, what good would that do us? There is so much amazing technology in a lot of the protocols out there and we shouldn’t belittle other projects without having a proper understanding of the coin. </p>\n\n<p>Just think about it, we recently entered the era of DeFi, which is a huge game changer in the financial world. Many people didn’t believe in DeFi tokens early on, but to those of you who did, congrats on hodling strong! Technology continues to evolve, and that’s good for cryptocurrency as a whole. Don&#39;t let anyone bring you down with their opinions on certain coins. Of course, be smart and do your own research!</p>\n\n<p>Cheers!</p>\n</div><!-- SC_ON -->",
  "score": 468,
  "permalink": "/r/CryptoCurrency/comments/lwyyb9/we_should_be_cheering_for_everyone_to_have_a/",
  "subreddit": "CryptoCurrency",
  "id": "lwyyb9",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614937739398
}