{
  "author": "Lonewolfing",
  "original_created_utc": 1626849229,
  "title": "Do a lot of people just end up ‘settling’ for an okay relationship rather than waiting for an amazing one?",
  "created_utc": 1626865097,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As a 30 something single who has been in a variety of relationships over the past 10 years, with people who were ‘okay’. </p>\n\n<p>I wasn’t necessarily unhappy with them, but none of them made me particularly happy either, and I couldn’t see myself living the rest of my life this way.</p>\n\n<p>I don’t feel as though I have particularly stringent deal breakers either: no drug use, a stable career (or working towards one), and the desire for a monogamous long term relationship. </p>\n\n<p>When I’ve ended relationships with people in the past due to these sorts of incompatibilities I get the feeling from friends that they think I might be being too harsh. </p>\n\n<p>I started looking around at my friends’ partners. Most of them are lovely people, but many of them also have issues that I would consider red flags: drug or gambling issues, often out of work and no desire to find any, not prepared to help out with anything around the house or with the children… etc</p>\n\n<p>It made me wonder- is this their dream partner who they fell madly in love with so these issues aren’t a problem? Or did they settle?</p>\n\n<p>Obviously I can’t ask them this, so I figured I’d ask reddit instead. </p>\n\n<p>My fear of dying alone is settling in and am starting to think I need to make some tough decisions.</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/ookh7e/do_a_lot_of_people_just_end_up_settling_for_an/",
  "subreddit": "TooAfraidToAsk",
  "id": "ookh7e",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As a 30 something single who has been in a variety of relationships over the\npast 10 years, with people who were ‘okay’.\n\nI wasn’t necessarily unhappy with them, but none of them made me particularly\nhappy either, and I couldn’t see myself living the rest of my life this way.\n\nI don’t feel as though…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "過去10年間で様々な恋愛をしてきた30代の独身者としては\n過去10年間に様々な恋愛をしてきた30代の独身者として、「まあまあ」な人たちと付き合ってきました。\n\n必ずしも不満があったわけではありませんが、特に幸せを感じた人はいませんでした。\nこのまま残りの人生を生きていくことはできないと思っていました。\n\n私はこのようには感じていません...",
      "title": "多くの人は、素晴らしい出会いを待つのではなく、まあまあの関係に「落ち着く」ことになってしまうのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "作为一个30岁左右的单身人士，在过去的10年中经历了各种关系。\n在过去的10年中，与那些 \"还不错 \"的人交往。\n\n我不一定对他们不满意，但他们都没有让我特别开心。\n幸福，而且我无法看到自己的余生是这样度过的。\n\n我并不觉得...",
      "title": "很多人最终只是 \"满足 \"于一段还不错的关系，而不是等待一段令人惊奇的关系吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "作爲一個30歲左右的單身人士，在過去的10年中經歷了各種關係。\n在過去的10年中，與那些 \"還不錯 \"的人交往。\n\n我不一定對他們不滿意，但他們都沒有讓我特別開心。\n幸福，而且我無法看到自己的餘生是這樣度過的。\n\n我並不覺得...",
      "title": "很多人最終只是 \"滿足 \"於一段還不錯的關係，而不是等待一段令人驚奇的關係嗎？"
    }
  ]
}