{
  "author": "BlindProphet_413",
  "the_new_excerpt": "I remember, when I visited the USS Iowa in Los Angeles, they gave us the\ndimensions of the ship and mentioned that the class was designed specifically to\nbe able to fit through the Panama Canal, as being able to quickly move naval\nvessels from coast to coast was naturally very important to the US…",
  "original_created_utc": 1624074927,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "そういえば、ロサンゼルスのUSSアイオワを訪れたとき、船の寸法を教えてくれた。\nこのクラスは、特にパナマ運河を通過できるように設計されています。\nパナマ運河を通過できるように設計されたと言っていましたが、それは海軍の艦艇を海岸から海岸へと迅速に移動できることが\n海軍艦艇を海岸から海岸へと迅速に移動させることは、米国にとって当然ながら非常に重要なことだったからです...。",
      "title": "アメリカ海軍がパナマ運河を通れない船を作ることになったのはいつですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我记得，当我在洛杉矶参观爱荷华号的时候，他们给我们提供了\n舰的尺寸，并提到该级舰的设计是专门为了\n能够通过巴拿马运河，因为它能够快速地将海军舰艇从港口转移到其他地方。\n因为能够快速将海军舰艇从一个海岸运到另一个海岸，对美国来说自然是非常重要的......",
      "title": "美国海军何时决定建造无法通过巴拿马运河的船只？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我記得，當我在洛杉磯參觀愛荷華號的時候，他們給我們提供了\n艦的尺寸，並提到該級艦的設計是專門爲了\n能夠通過巴拿馬運河，因爲它能夠快速地將海軍艦艇從港口轉移到其他地方。\n因爲能夠快速將海軍艦艇從一個海岸運到另一個海岸，對美國來說自然是非常重要的......",
      "title": "美國海軍何時決定建造無法通過巴拿馬運河的船隻？"
    }
  ],
  "title": "When did the US Navy decide to build ships that couldn't fit through the Panama Canal?",
  "created_utc": 1624097496,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I remember, when I visited the <em>USS Iowa</em> in Los Angeles, they gave us the dimensions of the ship and mentioned that the class was designed specifically to be able to fit through the Panama Canal, as being able to quickly move naval vessels from coast to coast was naturally very important to the US Navy and government.  </p>\n\n<p>But today&#39;s supercarriers like the <em>Nimitz</em> class are obviously way too big to fit through the canal; at what point did the USN decide that, for at least some of their ships, fitting through the canal was less important than the other operational abilities gained by large size? Was it a contentious decision, or simply bowing to the increasing size of new technology and new aircraft? Did the Navy consider making anything other than aircraft carriers too big to fit?</p>\n</div><!-- SC_ON -->",
  "score": 113,
  "permalink": "/r/AskHistorians/comments/o37ke4/when_did_the_us_navy_decide_to_build_ships_that/",
  "subreddit": "AskHistorians",
  "id": "o37ke4",
  "is_self": true,
  "media": null,
  "is_video": false
}