{
  "author": "604pleb",
  "original_created_utc": 1636165859,
  "title": "The Different Types Of Crypto You Should Know (For beginners)",
  "created_utc": 1636209246,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Types of Crypto</strong></p>\n\n<ul>\n<li><strong>Storage of value</strong> - A way of storing value in a currency with large volume and market capacity to facilitate growth of the currency.</li>\n<li><strong>Smart Contracts</strong> - A self executing set of parameters that trigger when an action is performed. When said action is performed the smart contract triggers, and verifies the transaction on the blockchain and rewards the action. <em>Example, Coin 1 will distribute 50% of initial supply Via “wager mining” for every 1$ in Crypto wagered on Corresponding partners, Coin 1 will distribute 0.07COIN1 of said Crypto into the Associated Wallet.</em> </li>\n<li><strong>Oracles</strong> - Oracle Cryptos are Cryptocurrencies with a real world tie-in, Allowing for developers to add in real world data that have an effect on the Smart contracts executed. <em>For example, Non-existent Crypto GREENCOIN will reward holders or small businesses with a token if regional/national carbon emissions decrease and perform a different action if emissions increase, this data is imputed by a singular source of truthful data. This data can also be pulled from the real world, like a program grabbing the real time price of eth to usd when you need to cash out or pay for something.</em> </li>\n<li><strong>Payment Method Cryptocurrency</strong> - These are Cryptos created to replace the conventional ways of payment and transactions we usually have, these currencies have very fast transaction speeds and incredibly small to no transaction fee. Included in this category are Bitcoin Cash, Litecoin, and Dashcoin.</li>\n<li><strong>Privacy Coins</strong> - Coins meant to be as anonymous as possible, while it&#39;s easy to track who could possibly be holding the coin if you&#39;re using an exchange with KYC, if you move it off exchange it will be harder to trace. (Monero, Zcash.)</li>\n<li><strong>Memecoins</strong> - Coins with little-no functionality often minted purely relying on speculation and Hype to achieve gains in the crypto space. (Dogecoin, Shiba Inu,)</li>\n<li><strong>Exchange Coins</strong> - Exchange coins are Minted and rewarded to users of an exchange, Usually by means of Yield/Liquidity Staking. (UNISWAP, CAKE, Crypto.com Coin, Binance BEP-20 “BNB”.)</li>\n<li><strong>Stablecoins</strong> - Stable Coins are a great way of storing value as the mission of these coins is to stay with a price equivalent of 1$USD, other uses for these coins include storing your coins in the case of price dip or using them to move money between exchanges.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<p>Please feel free to correct me in the comments if I got something wrong.</p>\n</div><!-- SC_ON -->",
  "score": 159,
  "permalink": "/r/CryptoCurrency/comments/qnqtd7/the_different_types_of_crypto_you_should_know_for/",
  "subreddit": "CryptoCurrency",
  "id": "qnqtd7",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Types of Crypto\n\n * Storage of value - A way of storing value in a currency with large volume and\n   market capacity to facilitate growth of the currency.\n * Smart Contracts - A self executing set of parameters that trigger when an\n   action is performed. When said action is performed the smart…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "暗号の種類\n\n * 価値の貯蔵 - 大規模な量と市場容量を持つ通貨に価値を貯蔵する方法。\n   通貨の成長を促進するための、大量かつ市場規模のある通貨の価値を保管する方法。\n * スマートコントラクト - アクションが実行されたときにトリガーとなる、自己実行可能なパラメータのセット。\n   アクションが実行されたときに起動するパラメータの自己実行セット。アクションが実行されると、スマート...",
      "title": "知っておきたい暗号の種類（初心者向け）"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "加密货币的类型\n\n \n\n   市场容量，以促进该货币的增长。\n * 智能合约 - 一个自我执行的参数集，当一个动作被执行时，会触发\n   行动被执行。当上述行动被执行时，智能...",
      "title": "你应该知道的不同类型的加密货币（针对初学者）"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "加密貨幣的類型\n\n \n\n   市場容量，以促進該貨幣的增長。\n * 智能合約 - 一個自我執行的參數集，當一個動作被執行時，會觸發\n   行動被執行。當上述行動被執行時，智能...",
      "title": "你應該知道的不同類型的加密貨幣（針對初學者）"
    }
  ]
}