{
  "author": "jondavidlay",
  "original_created_utc": 1631456831,
  "title": "I’ve never seen a better reason than this for Bitcoin.",
  "created_utc": 1631486204,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The Biden administration has proposed requiring all community banks and other financial institutions to report to the IRS on all deposits and withdrawals through business and personal accounts regardless of tax liability. This indiscriminate, comprehensive bank account reporting to the IRS can soon be enacted in Congress and will create an unacceptable invasion of privacy.  So, how does this affect you?  If passed, the proposal would require financial institutions to report the inflows (deposits) and outflows (withdrawals) of $600 or more, on personal and business accounts to the IRS regardless of customers’ consent.  </p>\n\n<p><a href=\"https://home.treasury.gov/system/files/136/The-American-Families-Plan-Tax-Compliance-Agenda.pdf?fbclid=IwAR3S0rZg4wnZAvShO2Y64ASfeXYkW6ERwHQtbeHXoFMSBoRasQiIuJ6El7A\">https://home.treasury.gov/system/files/136/The-American-Families-Plan-Tax-Compliance-Agenda.pdf?fbclid=IwAR3S0rZg4wnZAvShO2Y64ASfeXYkW6ERwHQtbeHXoFMSBoRasQiIuJ6El7A</a></p>\n</div><!-- SC_ON -->",
  "score": 172,
  "permalink": "/r/Bitcoin/comments/pmtne0/ive_never_seen_a_better_reason_than_this_for/",
  "subreddit": "Bitcoin",
  "id": "pmtne0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "The Biden administration has proposed requiring all community banks and other\nfinancial institutions to report to the IRS on all deposits and withdrawals\nthrough business and personal accounts regardless of tax liability. This\nindiscriminate, comprehensive bank account reporting to the IRS can soon…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "バイデン政権は、すべてのコミュニティバンクやその他の金融機関に対して\nすべてのコミュニティ銀行やその他の金融機関が、事業用および個人用の口座からのすべての入出金をIRSに報告することを義務付けることを提案しました。\n税務上の責任の有無にかかわらず、企業や個人の口座からのすべての入出金をIRSに報告することを提案しています。この\nこの無差別で包括的な銀行口座のIRSへの報告は、すぐに...",
      "title": "ビットコインについて、これ以上の理由はないと思います。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "拜登政府提议要求所有社区银行和其他\n金融机构向美国国税局报告所有的存款和取款情况\n通过企业和个人账户的所有存款和取款，无论是否有纳税义务。这种\n向国税局不加区分地全面报告银行账户，很快就会...",
      "title": "我从未见过比这更适合比特币的理由。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "拜登政府提議要求所有社區銀行和其他\n金融機構向美國國稅局報告所有的存款和取款情況\n通過企業和個人賬戶的所有存款和取款，無論是否有納稅義務。這種\n向國稅局不加區分地全面報告銀行賬戶，很快就會...",
      "title": "我從未見過比這更適合比特幣的理由。"
    }
  ]
}