{
  "author": "trendarchitect",
  "the_new_excerpt": "A friend just messaged me saying that his portfolio lost 10% of its value\nrecently and that this was complete doomsday. Judging by the futures, the NQ is\ndown 6.8% from its highs (a 1.8% gap down this morning alone). I get that, it's\nfrustrating.\n\nIt is also noteworthy that the sell-off hurts…",
  "original_created_utc": 1614076976,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "刚才有个朋友给我发信息，说他的投资组合损失了10%的价值。\n最近，而且这完全是末日来临。从期货的情况来看，国家质检总局是\n从高点下跌了6.8%（仅今早就下跌了1.8%的缺口）。我明白，这是\n令人沮丧。\n\n值得注意的是，抛售伤...",
      "title": "科技股暴跌--现在怎么办"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "剛纔有個朋友給我發信息，說他的投資組合損失了10%的價值。\n最近，而且這完全是末日來臨。從期貨的情況來看，國家質檢總局是\n從高點下跌了6.8%（僅今早就下跌了1.8%的缺口）。我明白，這是\n令人沮喪。\n\n值得注意的是，拋售傷...",
      "title": "科技股暴跌--現在怎麼辦"
    }
  ],
  "title": "Technology stocks are crashing – what now",
  "created_utc": 1614079720,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>A friend just messaged me saying that his portfolio lost 10% of its value recently and that this was complete doomsday. Judging by the futures, the NQ is down 6.8% from its highs (a 1.8% gap down this morning alone). I get that, it&#39;s frustrating.</p>\n\n<p>It is also noteworthy that the sell-off hurts technology stocks in particular. But mind that they were also the largest beneficiary in recent months:</p>\n\n<ul>\n<li>Nasdaq 100 is 53% above its weekly 200 EMA.</li>\n<li>S&amp;P 500 is 31% above its weekly 200 EMA.</li>\n<li>DJIA is 19% above its weekly 200 EMA.</li>\n</ul>\n\n<p>Which one is going to be hurt first and foremost once a correction is underway? Of course it&#39;s going to be the most stretched industry sector. Information technology is 28% of the S&amp;P 500, and 20% of the DJIA.</p>\n\n<p>If you buy stocks, you&#39;ve got to have conviction in them. You&#39;ve got to know what you are buying. Am I going to dump all my holdings just because they&#39;re &quot;overvalued&quot;. Of course not. I&#39;m going to hang in there with stocks going down 30% and then come back up 80%. Even if that takes another 3 years. It&#39;s the nature of the market and it is great at weeding out the less convinced.</p>\n\n<p>Volatility is the price you pay for your returns.</p>\n\n<p>If you held Apple all these years, you are sitting on a fortune now. Same goes for Amazon and many other megabrands of today. Amazon went top to bottom 60% several times in its history. You&#39;ve got to have conviction in what you&#39;re buying. I also go to the grocery store to pick my favorite marmelade brand. If there&#39;s a 30% discount I&#39;ll pile up. But you cannot ever pile up if you don&#39;t have conviction in your holdings in the first place.</p>\n\n<p>So here&#39;s what I would do. Go through your portfolio name by name. Ask yourself why it&#39;s there in the first place. Start with &quot;I own XYZ because...&quot;. Warren Buffett had also advised it in one of his interviews. If you can&#39;t tell that story, sell it off. It doesn&#39;t belong in your portfolio. Free up that cash so you can pile in when spectacular opportunities arise in future.</p>\n</div><!-- SC_ON -->",
  "score": 3977,
  "permalink": "/r/investing/comments/lqfhuz/technology_stocks_are_crashing_what_now/",
  "subreddit": "investing",
  "id": "lqfhuz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1614332883518
}