{
  "author": "Affectionate-Feed538",
  "original_created_utc": 1628798292,
  "title": "My sister got turned down for a job because she wouldn't give them the names of her social media accounts... is this even a thing?",
  "created_utc": 1628818263,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My sis got through the first two interviews for this job and it seemed to be looking good for her, until the hiring managers asked for the names of her social media accounts. </p>\n\n<p>She politely explained that that she feels uncomfortable with this, and besides, all her accounts are private and friends only, so no one could really see her posts anyway.</p>\n\n<p>A day later, she gets an email from the hiring manager, stating that she &#39;isn&#39;t a good fit for our environment&#39;.</p>\n\n<p>Yeah, I get that maybe employers want to see what an applicant is like before they are hired, but refusing to hire someone based on &#39;you won&#39;t let me see your social media handles!&#39; is unfair. Besides, like I said, all her accounts are private anyway.</p>\n\n<p>Some people prefer privacy.</p>\n</div><!-- SC_ON -->",
  "score": 184,
  "permalink": "/r/NoStupidQuestions/comments/p37j4u/my_sister_got_turned_down_for_a_job_because_she/",
  "subreddit": "NoStupidQuestions",
  "id": "p37j4u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My sis got through the first two interviews for this job and it seemed to be\nlooking good for her, until the hiring managers asked for the names of her\nsocial media accounts.\n\nShe politely explained that that she feels uncomfortable with this, and besides,\nall her accounts are private and friends…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "姉は、この仕事の最初の2回の面接を通過し、順調に進んでいるように見えました。\nたのですが、採用担当者が彼女のソーシャルメディアのアカウント名を尋ねてきました。\nソーシャルメディアのアカウント名を聞かれました。\n\n姉は丁寧に説明して、このようなことをされるのは気が引けると言いました。\n彼女のアカウントはすべてプライベートなものであり、友人でもあります...",
      "title": "私の妹は、ソーシャルメディアのアカウント名を教えないという理由で、仕事を断られました...こんなことがあるんですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我妹妹通过了这份工作的前两次面试，似乎对她很有利。\n她看起来很不错，直到招聘经理要求提供她的\n社会媒体账户的名字。\n\n她礼貌地解释说，她对此感到很不舒服，而且。\n她所有的账户都是私人的，而且是朋友......",
      "title": "我姐姐被拒绝了一份工作，因为她不愿意给他们提供她的社交媒体账户的名字......这甚至是一件事吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我妹妹通過了這份工作的前兩次面試，似乎對她很有利。\n她看起來很不錯，直到招聘經理要求提供她的\n社會媒體賬戶的名字。\n\n她禮貌地解釋說，她對此感到很不舒服，而且。\n她所有的賬戶都是私人的，而且是朋友......",
      "title": "我姐姐被拒絕了一份工作，因爲她不願意給他們提供她的社交媒體賬戶的名字......這甚至是一件事嗎？"
    }
  ]
}