{
  "author": "SituationTight7033",
  "original_created_utc": 1643744340,
  "title": "It took us 5 months and 3 pivots to get our first paying user. Here's what we learned so you don't have to!",
  "created_utc": 1643752074,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Aug 2021, my partner and I are sitting in front of a blank page, after leaving high-paying jobs, with no idea, no research, no customers, but with a clear goal. We are going to build a product for content creators (espri.io).&lt;/p&gt;\n\n&lt;p&gt;In a nutshell, the biggest lessons we’ve learned over the past 5 months:\n&lt;strong&gt;Talk constantly with your target audience, and always choose the simplest idea.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s how we didn&amp;#39;t apply this lesson:&lt;/p&gt;\n\n&lt;h3&gt;Idea # 1&lt;/h3&gt;\n\n&lt;p&gt;Everyone on Twitter says web 3 is the future, we both love blockchain, Loot project is cool, why not every creator can create an NFT for himself with the option to let others build a  SubNFT on their NFT? For sure all creators will understand and want it right away (spoiler: they don’t).&lt;/p&gt;\n\n&lt;p&gt;We started to build without even talking to one creator (!!).\nsmart contracts, UX, UI, a month and a half passed.\nWe sent cold messages on Reddit and uploaded posts where possible.&lt;/p&gt;\n\n&lt;p&gt;No one wanted it, not even close, people didn’t understand what the idea was, how to do it, why they should open a crypto wallet for it. It took us half an hour or more just to explain to creators the idea, not including their questions after that.\n2 months have passed. We failed.&lt;/p&gt;\n\n&lt;h3&gt;Idea # 2&lt;/h3&gt;\n\n&lt;p&gt;We talked to content creators, we realized there&amp;#39;s a lot of interest around collaborations, why not build GitHub for content creators?&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;“Let&amp;#39;s start this time differently, first we will design really beautiful mockups, we will become an all-in-one tool for all the problems we discovered. Edit the content together, publish it from within the system, and automatically split the revenue.”&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;We sent the mockups to content creators, the responses were better.\nBut still, something was missing, people didn’t really want it. It was too complicated for them, they didn’t know if they now want to move their whole world to one product, which they don’t yet know.&lt;/p&gt;\n\n&lt;p&gt;4 months have passed. Still a failure.&lt;/p&gt;\n\n&lt;h3&gt;Idea # 3&lt;/h3&gt;\n\n&lt;p&gt;We went back to talking to content creators, we promised ourselves that now we&amp;#39;re not building, not really designing, and solving &lt;strong&gt;one simple problem.&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;After countless conversations with content creators, the picture became clearer. And it&amp;#39;s pretty simple. How can we help them scale their business without scaling time?&lt;/p&gt;\n\n&lt;p&gt;We focused on the simplest idea that we had:\nA convenient way to see all the interactions of their audience (comments, replies, etc.) in one place.&lt;/p&gt;\n\n&lt;p&gt;My partner previously worked in a startup that analyzes sales calls using AI for enterprises, so he added (in 1-hour) AI model that knows how to analyze all interactions and give insights on who in the audience can become a paying customer of the creator (scaling revenue without scaling time) and what feedback the audience gives about the content (Improve the content without scaling time.)&lt;/p&gt;\n\n&lt;p&gt;We contacted one of the creators we spoke with, we knew he has over 5K/month on YouTube.&lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;” Hey! want an analysis report on your comments?”&lt;/em&gt;\nWe prepared a simple old-fashioned report for him and sent it.\n2 hours after that, he had already paid to get a weekly report and access to the future product.&lt;/p&gt;\n\n&lt;p&gt;5 months. Failure, but with light at the end of the tunnel.&lt;/p&gt;\n\n&lt;h2&gt;Where did we go wrong and how did we fix it?&lt;/h2&gt;\n\n&lt;ol&gt;\n&lt;li&gt;We realized too late that it is better to talk to the target audience first (No shit, Sherlock).&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;We started interviewing content creators, mostly with the help of cold messages on Reddit &amp;quot;Hey, what&amp;#39;s up? We&amp;#39;re building a product for content creators, we&amp;#39;d love to ask some questions, what are your main challenges? How do you solve them today? What frustrates you?&amp;quot;.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;We tried to solve &amp;quot;bigger than life&amp;quot; problems.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;As we concentrated on a simple and annoying problem (how to go through all the comments and messages comfortably without wasting a lot of time?) Things started to clear up.&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;We built and designed because we thought that today it’s impossible to get a paying customer without a product. Mistake.&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;If the problem is real and the solution is really right, they will pay you for something you made in Word.&lt;/p&gt;\n\n&lt;p&gt;Learn from our mistakes - talk to as many users from your target audience as possible, and choose the simplest problem possible. It should be a real but simple problem, at a level where you feel a little uncomfortable charging money for it because it&amp;#39;s so simple. Give it a try (:&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Don’t give up, and learn from (others’) mistakes!&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;I would love to answer more questions!&lt;/p&gt;\n\n&lt;p&gt;P.S.\nWe’re currently in a closed beta, but if you have a decent amount of audience interactions on YouTube / Instagram / Twitter/discord and want to try using AI to analyze it all in seconds,\nfeel free to &lt;a href=\"https://www.espri.io/?utm_source=RE\"&gt;sign up on our site.&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;Or just DM me on Twitter🙂 - &lt;a href=\"https://twitter.com/Ohad_azg\"&gt;https://twitter.com/Ohad_azg&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 5,
  "preview": {
    "images": [
      {
        "source": {
          "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?auto=webp&amp;s=1e1d48e20d39fce42f9652ab924d5853642dcb04",
          "width": 2724,
          "height": 3096
        },
        "resolutions": [
          {
            "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=b1a20e4cdd5a30418320a9dcb76d5ea37796dc71",
            "width": 108,
            "height": 122
          },
          {
            "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=47d80f7ed89cd80a16b150f635d472fcc5a146f8",
            "width": 216,
            "height": 245
          },
          {
            "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=b020dbbd1441876a0d948012c99bc855794a3a1f",
            "width": 320,
            "height": 363
          },
          {
            "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=94de354530f6082658dfeb6a09d98201a4b7199f",
            "width": 640,
            "height": 727
          },
          {
            "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?width=960&amp;crop=smart&amp;auto=webp&amp;s=e7593342525c97893d8187b850961a3c601d2e60",
            "width": 960,
            "height": 1091
          },
          {
            "url": "https://external-preview.redd.it/LM5uao-5ir815kI7BNsk87MvzSJ17vU-i3XzqrQtKcM.jpg?width=1080&amp;crop=smart&amp;auto=webp&amp;s=4c37808b1b87de4b19f609837c8fe78a175c798d",
            "width": 1080,
            "height": 1227
          }
        ],
        "variants": {},
        "id": "3YBzFnv7XSyMsUOeBhX94MkpzWtv2fJ0kjd7ZaYSI8U"
      }
    ],
    "enabled": false
  },
  "permalink": "/r/SideProject/comments/si3j2m/it_took_us_5_months_and_3_pivots_to_get_our_first/",
  "subreddit": "SideProject",
  "id": "si3j2m",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Aug 2021, my partner and I are sitting in front of a blank page, after leaving\nhigh-paying jobs, with no idea, no research, no customers, but with a clear\ngoal. We are going to build a product for content creators (espri.io).\n\nIn a nutshell, the biggest lessons we’ve learned over the past 5 months:…"
}