{
  "author": "ItsYaBoyKevinHere",
  "original_created_utc": 1637328964,
  "title": "Is it a labour law violation for my boss to ask us to stay late for unpaid overtime literally every day?",
  "created_utc": 1637335627,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Like I’m not saying everyday he comes out and asks us, it’s just kind of expected that you stay 20-40 minutes late every shift and if you don’t he’ll call you a clock watcher and accuse you of not showing any effort in your job.</p>\n\n<p>I mentioned to him once that I’m pretty sure it’s a labour law violation because in my contract it says “you are not eligible for overtime pay. We advise you do not work any hours outside of your scheduled time” but he retorted that the contract also says “hours may vary”</p>\n\n<p>Edit: more details; I’m Salary not hourly</p>\n</div><!-- SC_ON -->",
  "score": 440,
  "permalink": "/r/NoStupidQuestions/comments/qxgcdz/is_it_a_labour_law_violation_for_my_boss_to_ask/",
  "subreddit": "NoStupidQuestions",
  "id": "qxgcdz",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Like I’m not saying everyday he comes out and asks us, it’s just kind of\nexpected that you stay 20-40 minutes late every shift and if you don’t he’ll\ncall you a clock watcher and accuse you of not showing any effort in your job.\n\nI mentioned to him once that I’m pretty sure it’s a labour law…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "毎日のように彼が出てきて私たちに尋ねるわけではありませんが、ただなんとなく\n毎回20～40分遅刻するのが当たり前になっていて、そうしないと彼から「クロックウォッチ」と呼ばれます。\nそうしないと、彼はあなたをクロックウォッチャーと呼び、あなたが仕事に努力していないと非難します。\n\n一度だけ彼に言ったことがあるのですが、それは確か労働法ではないかと...。",
      "title": "上司が文字通り毎日のように未払い残業で残業をお願いするのは労働基準法違反ですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我并不是说他每天都会出来问我们，这只是一种\n如果你不这样做，他就会说你是看钟人，并指责你不努力工作。\n如果你不这样做，他就会说你是看钟人，并指责你在工作中没有表现出任何努力。\n\n我曾经对他说过，我很确定这是一项劳动法...",
      "title": "我的老板要求我们每天无偿加班到很晚，这是否违反了劳动法？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我並不是說他每天都會出來問我們，這只是一種\n如果你不這樣做，他就會說你是看鐘人，並指責你不努力工作。\n如果你不這樣做，他就會說你是看鐘人，並指責你在工作中沒有表現出任何努力。\n\n我曾經對他說過，我很確定這是一項勞動法...",
      "title": "我的老闆要求我們每天無償加班到很晚，這是否違反了勞動法？"
    }
  ]
}