{
  "author": "b1ackfyre",
  "the_new_excerpt": "It's interesting that both are starting to happen at the same time. I wouldn't\nbe surprised if one day there's a time when people budget for their trip to Mars\nusing \"credits\" (a nod to whatever becomes the prominent currency of the\nfuture), over using USD or another fiat currency. I could be wrong,…",
  "original_created_utc": 1617152672,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "有趣的是，这两种情况同时开始发生。我不会\n如果有一天，人们为自己的火星之旅做预算，那才叫奇怪呢\n用 \"信用\"（点睛之笔，不管是什么货币，都要用 \"信用\"）。\n未来），而不是使用美元或其他货币。我可能是错的，...",
      "title": "加密货币的日益普及和太空旅行的进步（SpaceX、Blue Origin、Virgin Galactic等），让我觉得自己好像置身于科幻小说系列的第1章。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "有趣的是，這兩種情況同時開始發生。我不會\n如果有一天，人們爲自己的火星之旅做預算，那才叫奇怪呢\n用 \"信用\"（點睛之筆，不管是什麼貨幣，都要用 \"信用\"）。\n未來），而不是使用美元或其他貨幣。我可能是錯的，...",
      "title": "加密貨幣的日益普及和太空旅行的進步（SpaceX、Blue Origin、Virgin Galactic等），讓我覺得自己好像置身於科幻小說系列的第1章。"
    }
  ],
  "title": "Increasing popularity of cryptocurrencies and advances in space travel (SpaceX, Blue Origin, Virgin Galactic, etc.) make me feel like I'm in the 1st chapter of a science fiction series.",
  "created_utc": 1617186642,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>It&#39;s interesting that both are starting to happen at the same time. I wouldn&#39;t be surprised if one day there&#39;s a time when people budget for their trip to Mars using &quot;credits&quot; (a nod to whatever becomes the prominent currency of the future), over using USD or another fiat currency. I could be wrong, but nation states, institutions, fiat currencies, etc. will look much stranger than now as space travel accelerates in the next 2 centuries.</p>\n</div><!-- SC_ON -->",
  "score": 234,
  "permalink": "/r/CryptoCurrency/comments/mgulyw/increasing_popularity_of_cryptocurrencies_and/",
  "subreddit": "CryptoCurrency",
  "id": "mgulyw",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1617357138673
}