{
  "author": "Flake101",
  "the_new_excerpt": "Let's face it - we've been stuck, destined for a life in the rat race from the\nstart. It's been carefully planned out for us, systems formed over millenia to\nmake sure that hard work never quite pays off enough to break out of the cycle.\n\nSure you can try and escape, maybe put the lottery on, gamble…",
  "original_created_utc": 1620255912,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "正直に言うと、私たちは最初からラットレースの中での人生を運命づけられていて、動けないのです。\n最初から。努力しても報われず、そこから抜け出すことができないように、何千年にもわたって綿密に計画されたシステムがあるのです。\n努力してもなかなか報われず、そのサイクルから抜け出すことができません。\n\n確かに逃げようとすれば、宝くじを買ったり、ギャンブルをしたり...。",
      "title": "CryotoCurrencies（暗号通貨）は、過去最大の富の再分配を引き起こします。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "让我们面对现实吧--我们已经被困住了，从一开始就注定了要过着与老鼠赛跑的生活。\n开始。这是为我们精心策划的，几千年来形成的系统\n确保努力工作永远不会有足够的回报来打破这个循环。\n\n当然，你可以尝试逃脱，也许可以买彩票，赌博......",
      "title": "CryotoCurrencies are causing the biggest redistribution of wealth in a lifetime - and it's only just beginning"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "讓我們面對現實吧--我們已經被困住了，從一開始就註定了要過着與老鼠賽跑的生活。\n開始。這是爲我們精心策劃的，幾千年來形成的系統\n確保努力工作永遠不會有足夠的回報來打破這個循環。\n\n當然，你可以嘗試逃脫，也許可以買彩票，賭博......",
      "title": "CryotoCurrencies are causing the biggest redistribution of wealth in a lifetime - and it's only just beginning"
    }
  ],
  "title": "CryotoCurrencies are causing the biggest redistribution of wealth in a lifetime - and it's only just beginning",
  "created_utc": 1620286235,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Let&#39;s face it - we&#39;ve been stuck, destined for a life in the rat race from the start. It&#39;s been carefully planned out for us, systems formed over millenia to make sure that hard work never quite pays off enough to break out of the cycle. </p>\n\n<p>Sure you can try and escape, maybe put the lottery on, gamble on the side or invest in risky stocks in the hope of winning enough to retire. The reality is though the odds are stacked against us, the bookies always win &amp; institutions are a mile ahead of retail investors when it comes to stocks.</p>\n\n<p>That&#39;s where Crypto comes into the picture.</p>\n\n<p>Out of the hands of the institutions, decentralised &amp; transparent. It wasn&#39;t the Goldman Sachs &amp; Morgan Stanleys of the world who got in first, it was us. Crypto gives real, tangible hope of something better to come</p>\n\n<p>Here&#39;s the best bit: We&#39;re still early to this party. crypto has already changed millions of lives for the better and it will keep doing so. Billions of $s are changing hands, as big money moves more into this space we&#39;ll be here waiting &amp; ready to ride that wave. This time we have the upper hand and I can&#39;t wait to see what the future holds</p>\n</div><!-- SC_ON -->",
  "score": 201,
  "permalink": "/r/CryptoCurrency/comments/n5t842/cryotocurrencies_are_causing_the_biggest/",
  "subreddit": "CryptoCurrency",
  "id": "n5t842",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1620380965854
}