{
  "author": "predawnretrospective",
  "original_created_utc": 1660716928,
  "title": "Does anyone else feel like Bitcoin is their literal last ditch effort to become wealthy in their lifetime?",
  "created_utc": 1660740161,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have absolutely zero skills outside of knowing a bunch of useless facts about crypto thats actually basic and surface level at best. &lt;/p&gt;\n\n&lt;p&gt;Im 25. I have no college education. A VERY modest income. No help from any loved ones or parents to financially help me through a trade school or something like that. And due to unfortunate circumstances and bad decisions i made when i was a teenager I have a lengthy criminal history which doesnt help with finding ways to land a decent job. &lt;/p&gt;\n\n&lt;p&gt;I would bite the bullet and just take student loans from the government but at this point I genuinely dont see the point, id 100% rather put my faith in Bitcoin and just take a small loan as we venture further down and keep DCA until I have a few coins to my name. &lt;/p&gt;\n\n&lt;p&gt;I can’t be the only one who’s been thinking this way. &lt;/p&gt;\n\n&lt;p&gt;Maybe this sounds depressing to most but if diminishing returns proves to be true this could be my last chance to actually own something that could be a safety net for me when im older. &lt;/p&gt;\n\n&lt;p&gt;My 26th is coming soon,l have many worries about my financial future. I really wish i had a mentor for times like this.&lt;/p&gt;\n\n&lt;p&gt;EDIT: \nThanks for all the encouraging words, and also the criticisms! we can all learn something from each other. i know i have learned from all of you. best of luck to everyone!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 316,
  "permalink": "/r/Bitcoin/comments/wqhd58/does_anyone_else_feel_like_bitcoin_is_their/",
  "subreddit": "Bitcoin",
  "id": "wqhd58",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I have absolutely zero skills outside of knowing a bunch of useless facts about\ncrypto thats actually basic and surface level at best.\n\nIm 25. I have no college education. A VERY modest income. No help from any loved\nones or parents to financially help me through a trade school or something…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "に関する無駄な事実を知っている以外のスキルは全くない。\n暗号に関する無駄な事実を知っている以外には、何のスキルもありません。\n\n私は25歳です。大学での教育は受けていません 非常に控えめな収入。愛する人や親からの援助もありません。\n親からの援助もなく、専門学校か何かに通うのが精一杯です。",
      "title": "ビットコインは、生涯で裕福になるための文字通りの最後の手段だと感じている人はいるだろうか。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我除了知道一些无用的事实之外，完全没有任何技能。\n我没有任何技能，只知道一些关于加密货币的无用知识，这些知识实际上是最基本和最表面的。\n\n我25岁。我没有受过大学教育。收入非常少。没有来自任何亲人或父母的帮助\n没有任何亲人或父母在经济上帮助我通过贸易学校或其他方式......",
      "title": "还有人觉得比特币是他们在有生之年为致富所做的最后努力吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我除了知道一些無用的事實之外，完全沒有任何技能。\n我沒有任何技能，只知道一些關於加密貨幣的無用知識，這些知識實際上是最基本和最表面的。\n\n我25歲。我沒有受過大學教育。收入非常少。沒有來自任何親人或父母的幫助\n沒有任何親人或父母在經濟上幫助我通過貿易學校或其他方式......",
      "title": "還有人覺得比特幣是他們在有生之年爲致富所做的最後努力嗎？"
    }
  ]
}