{
  "author": "The___canadian",
  "original_created_utc": 1654025820,
  "title": "Why do movies still not give you the ability to adjust individual volumes (SFX, voices, music,ambient noise)",
  "created_utc": 1654053036,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Is it the medium itself that is restrictive in the method we consume it?&lt;/p&gt;\n\n&lt;p&gt;With all the editing that they do in the studios, audio engineering, along with everything else that goes into movies, is it just not feasible to implement this as a feature?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always wondered this because I&amp;#39;m pretty sure everyone has experienced watching movies, it&amp;#39;s a beautiful scene and music is just BLASTING... Or, people are talking, but the music is so fucking loud you can&amp;#39;t hear them. &lt;/p&gt;\n\n&lt;p&gt;Maybe you just don&amp;#39;t like music and want it lower, maybe you really enjoy the ambiance and voices so you want those higher..&lt;/p&gt;\n\n&lt;p&gt;Why is this still not a feature in movies and tv shows?&lt;/p&gt;\n\n&lt;p&gt;They came out with &amp;quot;Blu-ray&amp;quot; and honestly I got no fucking idea what that is still to this day. I just had Blu-ray with my PlayStation... &lt;/p&gt;\n\n&lt;p&gt;I would unironically spend money on a streaming service that offered this feature. It would be such a massive quality of life increase to the viewers.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 111,
  "permalink": "/r/NoStupidQuestions/comments/v1y4sd/why_do_movies_still_not_give_you_the_ability_to/",
  "subreddit": "NoStupidQuestions",
  "id": "v1y4sd",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "Is it the medium itself that is restrictive in the method we consume it?\n\nWith all the editing that they do in the studios, audio engineering, along with\neverything else that goes into movies, is it just not feasible to implement this\nas a feature?\n\nI've always wondered this because I'm pretty sure…"
}