{
  "author": "BelgianPolitics",
  "the_new_excerpt": "THE CONFERENCE ON THE FUTURE OF EUROPE HAS STARTED! EU CITIZENS CAN NOW\nOFFICIALLY PROPOSE IDEAS AND VOICE THEIR OPINIONS ON REGULATIONS, INCLUDING ON\nCRYPTOCURRENCY AND BLOCKCHAIN.\n\nWHAT IS THE CONFERENCE ON THE FUTURE OF EUROPE?\n\nThe Conference on the Future of Europe is a unique and timely…",
  "original_created_utc": 1618849543,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "欧州の未来に関する会議がスタートしました。EU市民は現在\n暗号通貨やブロックチェーンを含む規制について、公式にアイデアを提案し、意見を述べることができるようになりました。\n暗号通貨やブロックチェーンなどの規制について、EU市民が公式にアイデアを提案し、意見を述べることができるようになりました。\n\n欧州の未来に関する会議」とは？\n\nThe Conference on the Future of Europeは、ユニークでタイムリーなイベントです...",
      "title": "すべてのEU市民にとって重要なことです。団結する時が来ました。今日から、あなたはEUの未来に直接影響を与え、暗号通貨やブロックチェーンの規制について発言することができます。これは実際に大きな問題で、2年前から準備されてきました。この記事をお読みください。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "欧洲未来会议开始了! 欧盟公民现在可以\n正式提出意见，并就各项规章制度，包括对《公约》的影响发表意见。\nCRYPTOCURRENCY AND BLOCKCHAIN.\n\n什么是欧洲未来大会？\n\n欧洲未来会议是一个独特而及时的......",
      "title": "对所有欧盟公民来说非常重要! 是时候齐心协力了。从今天开始，你可以直接影响欧盟的未来，并对加密货币和区块链法规发出声音。这其实是一件大事，已经酝酿了两年。请阅读这篇文章。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "歐洲未來會議開始了! 歐盟公民現在可以\n正式提出意見，並就各項規章制度，包括對《公約》的影響發表意見。\nCRYPTOCURRENCY AND BLOCKCHAIN.\n\n什麼是歐洲未來大會？\n\n歐洲未來會議是一個獨特而及時的......",
      "title": "對所有歐盟公民來說非常重要! 是時候齊心協力了。從今天開始，你可以直接影響歐盟的未來，並對加密貨幣和區塊鏈法規發出聲音。這其實是一件大事，已經醞釀了兩年。請閱讀這篇文章。"
    }
  ],
  "title": "IMPORTANT for all EU citizens! It is time to come together. Since today, you can DIRECTLY influence the future of the European Union and have a voice on cryptocurrency and blockchain regulations. This actually a big deal and has been two years in the making. Please read this post.",
  "created_utc": 1618860863,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h2>The Conference on the Future of Europe has started! EU citizens can now officially propose ideas and voice their opinions on regulations, including on cryptocurrency and blockchain.</h2>\n\n<h4>What is the Conference on the Future of Europe?</h4>\n\n<p>The Conference on the Future of Europe is a unique and timely opportunity for European citizens to debate on Europe’s challenges and priorities. No matter where you are from or what you do, this is the place to think about what future you want for the European Union.</p>\n\n<p>The European Parliament, the Council and the European Commission have committed to listen to Europeans and to follow up, within their sphere of competences, on the recommendations made. </p>\n\n<p>European citizens, from all walks of life and corners of the Union, with young people playing a central role in shaping the future of the European project. </p>\n\n<h4>How to propose ideas?</h4>\n\n<p>You can <strong>propose</strong> ideas, <strong>discuss</strong> ideas and <strong>support</strong> ideas on the online platform (in our case: ideas about cryptocurrency and blockchain): <a href=\"https://futureu.europa.eu/\">https://futureu.europa.eu/</a></p>\n\n<p><strong>If you start a discussion on cryptocurrency or blockchain, post it here:</strong></p>\n\n<ul>\n<li>Digital Transformation Category: <a href=\"https://futureu.europa.eu/processes/Digital\">https://futureu.europa.eu/processes/Digital</a></li>\n<li>A Stronger Economy, Social Justice and Jobs Category: <a href=\"https://futureu.europa.eu/processes/Economy\">https://futureu.europa.eu/processes/Economy</a></li>\n</ul>\n\n<p><em>You can post ideas yourself or support ideas being posted by other EU citizens.</em> </p>\n\n<p>We, as a community, must come together to discuss and push for cryptocurrency and blockchain friendly ideas and regulations. This is a unique opportunity for us all. Since the Conference on the Future of Europe has just started (no one has mentioned cryptocurrency yet) we can set the agenda for the coming months. We would be the first community to get involved. <strong>Our ideas will be heard by the European Parliament, the Council and the European Commission if they gather enough support.</strong> </p>\n\n<p>I am calling upon the community, developers, mods and crypto projects to get involved and spread the word.</p>\n</div><!-- SC_ON -->",
  "score": 1805,
  "permalink": "/r/CryptoCurrency/comments/mu4d6p/important_for_all_eu_citizens_it_is_time_to_come/",
  "subreddit": "CryptoCurrency",
  "id": "mu4d6p",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1619171521486
}