{
  "author": "SuicideIsSoSexyRrrrr",
  "the_new_excerpt": "Bitcoin is a healthy asset.\n\nIt has corrections and dips.\n\nYou know what doesn't correct or dip?\n\nA bubble.\n\nLike the current stock and real estate markets.\n\nStocks and Real Estate prices have been in a 12 year bubble that only survives\nwhile the FED blows hot-air (prints new money in the…",
  "original_created_utc": 1610366857,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "比特币是一种健康的资产。\n\n它有修正和下跌。\n\n你知道什么不对头或不对劲吗？\n\n一杯泡沫。\n\n就像目前的股市和房地产市场。\n\n股票和房地产价格一直在12年的泡沫中只存在\n当美联储吹响热气时(在…印制新钞票",
      "title": "市场下跌是健康的：清除重担"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "比特幣是一種健康的資產。\n\n它有修正和下跌。\n\n你知道什麼不對頭或不對勁嗎？\n\n一杯泡沫。\n\n就像目前的股市和房地產市場。\n\n股票和房地產價格一直在12年的泡沫中只存在\n當美聯儲吹響熱氣時(在…印製新鈔票",
      "title": "市場下跌是健康的：清除重擔"
    }
  ],
  "title": "Market dips are healthy: purging dead-weight",
  "created_utc": 1610389398,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Bitcoin is a healthy asset.</p>\n\n<p>It has corrections and dips.</p>\n\n<p>You know what doesn&#39;t correct or dip?</p>\n\n<p>A bubble.</p>\n\n<p>Like the current stock and real estate markets.</p>\n\n<p>Stocks and Real Estate prices have been in a 12 year bubble that only survives while the FED blows hot-air (prints new money in the trillions).</p>\n\n<p>The FED intervention has prevented the stock and real estate markets from doing what they need to PURGE inefficiency and failed ventures.</p>\n\n<p>Usually these corrections happen when failed business goes bankrupt, and their remaining resources get consolidated into new companies. </p>\n\n<p>Employees that lost jobs get re-distributed to new better performing companies, start new businesses, or shift industries altogether.</p>\n\n<p>Free-markets are the most efficient form of distributing business resources.</p>\n\n<p>But the FED has not allowed this to happen for over 12 years now, by interfering with the free-market corrections.</p>\n\n<p>This created a huge backlog of companies that are on the verge of bankruptcy, and home owners on the verge of losing their property. They only survive with interest-free government loans, like &quot;mortgage deferrals&quot;.</p>\n\n<p>But these businesses and homeowners cannot produce enough value to survive on their own. This is the crux of the issue.</p>\n\n<p>Because of FED intervention, the bubble burst is going to be 100x worse than it would have been in 2008, had it been left to free-market forces to consolidate the losses.</p>\n\n<p>Bitcoin can&#39;t be manipulated.</p>\n\n<p>The price you see is the <em>fair market price</em>.</p>\n\n<p>Bitcoin is the truest representation of a fair-market we have on this planet today.</p>\n\n<p>We take our dips and corrections as they happen, we don&#39;t postpone them for the future.</p>\n\n<p>But as a result, you know that the price you pay is accurate, that this is a healthy market, it isn&#39;t FULL of worthless garbage companies and real estate that are under-water.</p>\n\n<p>Just pure value.</p>\n\n<p>You&#39;re buying into pure value without any of the waste.</p>\n\n<p>The stock and real estate bubbles will pop, there&#39;s no choice, they have to. Just a matter of when and how it will unfold. Or the inefficiencies will bring down the entire system.</p>\n\n<p>When the FED refuses to allow the market to correct, it is saying to big cap companies: &quot;you&#39;re allowed to fail, and we&#39;ll print infinite amounts of money to swallow your losses.&quot; So then the executives are like &quot;great, so that means you can afford to pay me a $500 million bonus!&quot; Without restrictions on the money supply, the corruption will only get worse and worse.</p>\n\n<p>Bitcoin cannot be corrupted. Bitcoin is safe from that non-sense.</p>\n\n<p>HODL strong!</p>\n\n<p>Make them pry the Bitcoin out of your cold dead hands! ☃️</p>\n</div><!-- SC_ON -->",
  "score": 325,
  "permalink": "/r/Bitcoin/comments/kv1ezc/market_dips_are_healthy_purging_deadweight/",
  "subreddit": "Bitcoin",
  "id": "kv1ezc",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1610706371569
}