{
  "author": "pretzelwins",
  "the_new_excerpt": "I don’t know if I can offer much insight because I’m not the ideal Bitcoin\nsuccess story, in fact not successful at all but here it goes. I’m from Canada\nand I’m at the lowest point in my life - I’m overweight, lost my job because of\nthe pandemic and I’m living with my strict ass annoying immigrant…",
  "original_created_utc": 1615101204,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我不知道我是否能提供很多见解，因为我不是理想的比特币。\n成功的故事，其实一点也不成功，但在这里。我来自加拿大\n我在我的生活中的最低点 - 我超重，失去了我的工作因为\n疫情和我的生活 与我的严格的屁股讨厌的移民... ...",
      "title": "把我的刺激物投资到加密技术上，我就起来了--我们一起干这个狗屁事"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我不知道我是否能提供很多見解，因爲我不是理想的比特幣。\n成功的故事，其實一點也不成功，但在這裏。我來自加拿大\n我在我的生活中的最低點 - 我超重，失去了我的工作因爲\n疫情和我的生活 與我的嚴格的屁股討厭的移民... ...",
      "title": "把我的刺激物投資到加密技術上，我就起來了--我們一起幹這個狗屁事"
    }
  ],
  "title": "Invested my stimulus into crypto and I’m up - we’re in this bullshit together",
  "created_utc": 1615142356,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I don’t know if I can offer much insight because I’m not the ideal Bitcoin success story, in fact not successful at all but here it goes. I’m from Canada and I’m at the lowest point in my life - I’m overweight, lost my job because of the pandemic and I’m living with my strict ass annoying immigrant parents until I find something to get me back on my feet. I’ve invested my stimulus checks into crypto because what the fuck do I have to lose? Nothing. I don’t have a lot invested right now but I’ve made solid gains from the time it was valued at 36k USD. Feel free to call me a piece of shit after this, but I found a new passion and crypto is still in its early stages in terms of its potential. If you ever ask yourself ‘is it too late to invest?’ - the answer is hell no. Talk to the average joe, most are not invested. Bitcoin is STILL in its early stages. Investing only 1 dollar puts you ahead of most people. Hopefully I come back to this post a year from now in a better position.</p>\n</div><!-- SC_ON -->",
  "score": 193,
  "permalink": "/r/Bitcoin/comments/lzliop/invested_my_stimulus_into_crypto_and_im_up_were/",
  "subreddit": "Bitcoin",
  "id": "lzliop",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1615542569375
}