{
  "author": "worldofoysters",
  "original_created_utc": 1632399098,
  "title": "Why was the German military not 'Nazified' like the rest of the German state?",
  "created_utc": 1632419986,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>As I understand it, when the Nazis took power they essentially turned every aspect of civil society into Nazi organs - most infamously with the Hitler Youth replacing all youth groups. </p>\n\n<p>However the German military remained under control of essentially Prussian military professionals/aristocrats? I.E. the cadre of people who would go onto take part in the Operation Valkyrie plot in 1944 under Stauffenberg? I get that Hitler couldn&#39;t remove the high command in 1933, but why did he not ensure party members and ideologues were put in charge - IIRC the famous scene in Downfall he regrets not purging the army like Stalin did in the USSR? Why didn&#39;t he?</p>\n</div><!-- SC_ON -->",
  "score": 102,
  "permalink": "/r/AskHistorians/comments/pttu83/why_was_the_german_military_not_nazified_like_the/",
  "subreddit": "AskHistorians",
  "id": "pttu83",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "As I understand it, when the Nazis took power they essentially turned every\naspect of civil society into Nazi organs - most infamously with the Hitler Youth\nreplacing all youth groups.\n\nHowever the German military remained under control of essentially Prussian\nmilitary professionals/aristocrats?…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "私の理解では、ナチスが権力を握ると、基本的に市民社会のあらゆる側面をナチスの機関に変えてしまいました。\n市民社会のあらゆる側面をナチスの機関に変えてしまいました。最も有名なのは、ヒトラー・ユース\n特に有名なのはヒトラー青年団で、すべての青年団に取って代わりました。\n\nしかし、ドイツ軍は基本的にプロイセン人の支配下にありました。\n軍の専門家や貴族が管理していました。",
      "title": "なぜドイツ軍は他のドイツ国家のように「ナチス化」されなかったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "据我所知，当纳粹夺取政权时，他们基本上把民间社会的每一个方面都变成了纳粹的机关。\n民间社会的各个方面都变成了纳粹的机构--最臭名昭著的是希特勒青年团\n取代了所有青年团体。\n\n然而，德国军队仍然在普鲁士人的控制之下。\n军事专家/贵族？",
      "title": "为什么德国军队没有像德国其他国家一样被 \"纳粹化\"？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "據我所知，當納粹奪取政權時，他們基本上把民間社會的每一個方面都變成了納粹的機關。\n民間社會的各個方面都變成了納粹的機構--最臭名昭著的是希特勒青年團\n取代了所有青年團體。\n\n然而，德國軍隊仍然在普魯士人的控制之下。\n軍事專家/貴族？",
      "title": "爲什麼德國軍隊沒有像德國其他國家一樣被 \"納粹化\"？"
    }
  ]
}