{
  "author": "SupperSaiyanBeef",
  "original_created_utc": 1652906486,
  "title": "Why is the man o war jelly fish considered a colony of cells as opposed to one organism?",
  "created_utc": 1652964766,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m trying to understand the functional difference between the various zooids in this siphonophore. It seems as though all zooids branch from the same egg (I think? ) so theoretically they should share the same DNA. If they do share the same DNA and essentially differentiate into a few different functions (i.e. gastric or singing) then why are the zooids considered separate organisms and not just specialized cells or organs in one single organism?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 101,
  "permalink": "/r/askscience/comments/usm9t3/why_is_the_man_o_war_jelly_fish_considered_a/",
  "subreddit": "askscience",
  "id": "usm9t3",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I'm trying to understand the functional difference between the various zooids in\nthis siphonophore. It seems as though all zooids branch from the same egg (I\nthink? ) so theoretically they should share the same DNA. If they do share the\nsame DNA and essentially differentiate into a few different…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "の各種ゾイドの機能的な違いを理解しようとしているのです。\n機能的な違いを理解しようとしている。すべてのゾイドが同じ卵から分岐しているように見える（と思う？\nと思うのですが、どうでしょうか？ということは、理論的には同じDNAを共有しているはずです。もし、同じDNAを共有しているのであれば\nもし、同じDNAを共有していて、本質的にいくつかの異なる...",
      "title": "マンボウは、なぜ1つの生物ではなく、細胞のコロニーと考えられているのですか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我正试图了解《中国》中各种动物群落之间的功能差异。\n虹吸虫的不同功能。似乎所有的滋养体都来自同一个卵（我认为？\n我认为？)，所以理论上它们应该共享相同的DNA。如果它们确实共享\n相同的DNA，并在本质上分化成几个不同的...",
      "title": "为什么战人水母被认为是一个细胞群，而不是一个生物体？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我正試圖瞭解《中國》中各種動物羣落之間的功能差異。\n虹吸蟲的不同功能。似乎所有的滋養體都來自同一個卵（我認爲？\n我認爲？)，所以理論上它們應該共享相同的DNA。如果它們確實共享\n相同的DNA，並在本質上分化成幾個不同的...",
      "title": "爲什麼戰人水母被認爲是一個細胞羣，而不是一個生物體？"
    }
  ]
}