{
  "author": "DevopsCandidate1337",
  "the_new_excerpt": "Honestly not attempting to troll, just kind of baffled. I recently learned that\napparently non-binary people are not necessarily 'in-between' or 'intermediate'\nbut may have multiple genders, either simultaneously, or in series\n[https://gender.wikia.org/wiki/Non-binary] .\n\nI understand the concepts…",
  "original_created_utc": 1613774175,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "说实话，并不是想吐槽，只是有点莫名其妙。我最近才知道\n显然，非双性恋者不一定是 \"中间人 \"或 \"中间人\n但可以有多个性别，可以是同时的，也可以是串联的\n[https://gender.wikia.org/wiki/Non-binary] 。\n\n我理解这些概念...",
      "title": "试图理解 \"非二进制\"。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "說實話，並不是想吐槽，只是有點莫名其妙。我最近才知道\n顯然，非雙性戀者不一定是 \"中間人 \"或 \"中間人\n但可以有多個性別，可以是同時的，也可以是串聯的\n[https://gender.wikia.org/wiki/Non-binary] 。\n\n我理解這些概念...",
      "title": "試圖理解 \"非二進制\"。"
    }
  ],
  "title": "Trying to understand 'Non binary'",
  "created_utc": 1613789255,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Honestly not attempting to troll, just kind of baffled. I recently learned that apparently non-binary people are not necessarily &#39;in-between&#39; or &#39;intermediate&#39; but <a href=\"https://gender.wikia.org/wiki/Non-binary\">may have multiple genders, either simultaneously, or in series</a> .</p>\n\n<p>I understand the concepts of male, female, transgender, heterosexual, homosexual, bisexual, androgynous. If those are categories that people feel they are, that&#39;s up to them. We shouldn&#39;t be treating people differently on the basis of sex or sexuality anyway. What I don&#39;t get is the declaration of &#39;non-binary <em>AND</em>...&#39;, e.g. &#39;non-binary <em>AND</em> male&#39;; &#39;non-binary <em>AND</em> female&#39; ; &#39;non-binary <em>AND</em> female <em>AND</em> male&#39; etc. So you&#39;re saying that you are both &#39;x&#39; <em>AND</em> &#39;not-x&#39;? Or that it may change by the day? If I compare that to sexuality then an individual would simply be considered bisexual, perhaps serially monogamous, polyamourous, or promiscuous, but still simply &#39;bisexual&#39;. There are <a href=\"https://gender.wikia.org/wiki/Category:Gender_Identities\">many gender identities one may find listed</a>. We might suppose that not all of these labels are sincere, but regardless I can&#39;t imagine that many people will have heard of many of these, still less be able to negotiate them. There&#39;s 219 categories on that page, so 47961 possible combinations of any 2 individuals. It does seem from the outside a little like children saying &#39;I&#39;m an angel! I&#39;m an eagle!&#39;.</p>\n\n<p>Can someone offer an explanation that makes sense in the context of fully adult life, not simply academia or student-hood where we all like to set the world to rights, but where we work 40 hour weeks, have a family etc, aren&#39;t trying to judge or be unkind but simply don&#39;t have several years to do a pHD in gender studies?</p>\n</div><!-- SC_ON -->",
  "score": 103,
  "permalink": "/r/NoStupidQuestions/comments/lnsbhk/trying_to_understand_non_binary/",
  "subreddit": "NoStupidQuestions",
  "id": "lnsbhk",
  "is_self": true,
  "media": null,
  "is_video": false
}