{
  "author": "xmm14",
  "the_new_excerpt": "So my son's 6th birthday was this weekend. This last year has been a little\nrough as my wife took a lesser paying job to focus on getting her teacher's\nlicense and I haven't been able to work as long of hours to take care of my son.\nBut one thing i got into was to throw extra money into some crypto…",
  "original_created_utc": 1621125808,
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "今週末、息子の6歳の誕生日がありました。この1年はちょっと大変でした。\n妻は教員免許取得に専念するために給料の安い仕事に就き、私は息子の面倒を見るために長時間働くことができなかったからです。\n私は息子の面倒を見るために長時間働くことができませんでした。\nしかし、私が夢中になったことの1つに、いくつかの暗号に余分なお金を投じることがありました...",
      "title": "私の息子は、暗号のおかげで素晴らしい誕生日を迎えました。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "这个周末是我儿子的6岁生日。过去的一年有点\n因为我的妻子找了一份薪水较低的工作，专注于考取教师资格证。\n而我为了照顾我的儿子，没能工作那么长时间。\n但我有一件事是把多余的钱投入到一些加密货币中。",
      "title": "我的儿子因为加密货币过了一个很好的生日。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "這個週末是我兒子的6歲生日。過去的一年有點\n因爲我的妻子找了一份薪水較低的工作，專注於考取教師資格證。\n而我爲了照顧我的兒子，沒能工作那麼長時間。\n但我有一件事是把多餘的錢投入到一些加密貨幣中。",
      "title": "我的兒子因爲加密貨幣過了一個很好的生日。"
    }
  ],
  "title": "My son had a great birthday because of crypto.",
  "created_utc": 1621140173,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So my son&#39;s 6th birthday was this weekend.  This last year has been a little rough as my wife took a lesser paying job to focus on getting her teacher&#39;s license and I haven&#39;t been able to work as long of hours to take care of my son. But one thing i got into was to throw extra money into some crypto every week.</p>\n\n<p>I diversified my portfolio as much as possible, made a ton of rookie mistakes. (Chasing that green!, Doge!) But thanks to some luck, a bull market, and minor help from this sub I was able to make a nice little gain for us.  </p>\n\n<p>So i looked at what i put in and said you know what?  Lets do something great, I took him and five of his friends to a bounce gym and to a arcade where everyone was able to grab a prize. All in total i spent about 800 dollars on the day. </p>\n\n<p>I realize that 800 is not a ton, but it is more than we would have been willing to do because of our fairly structured budget. So im happy for this bull market and i can&#39;t wait for the bear, because my low contributions will stretch further. And maybe just maybe as we get a longer time in the market greater things will come. </p>\n\n<p>I just want anyone reading this to enjoy your journey and use your gains as necessary. My son enjoyed his day and even though we probably could&#39;ve done less and he&#39;d still be happy i am pleased he got something out of the deal.</p>\n\n<p>Edit:  Thanks to everyone for the birthday wishes from my son.</p>\n</div><!-- SC_ON -->",
  "score": 940,
  "permalink": "/r/CryptoCurrency/comments/ndcou0/my_son_had_a_great_birthday_because_of_crypto/",
  "subreddit": "CryptoCurrency",
  "id": "ndcou0",
  "is_self": true,
  "media": null,
  "is_video": false,
  "source_updated_at": 1621590798345
}