{
  "author": "MadstopSnow",
  "original_created_utc": 1653580301,
  "title": "how did the water disappear on Mars?",
  "created_utc": 1653589884,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So, I know it didn&amp;#39;t disappear per say, it likely in some aquifer.. but..&lt;/p&gt;\n\n&lt;p&gt;I would assume:&lt;/p&gt;\n\n&lt;p&gt;1) since we know water was formed by stars and came to earth through meteors or dust, I would assume the distribution of water across planets is roughly proportional to the planet&amp;#39;s size. Since mars is smaller than earth, I would assume it would have less than earth, but in portion all the same. &lt;/p&gt;\n\n&lt;p&gt;2) water doesn&amp;#39;t leave a planet. So it&amp;#39;s not like it evaporates into space 🤪&lt;/p&gt;\n\n&lt;p&gt;3) and I guess I assume that Mars and earth formed at roughly the same time. I guess I would assume that Mars and earth have similar starting chemical compositions. Similar rock to some degree? Right?&lt;/p&gt;\n\n&lt;p&gt;So how is it the water disappears from the surface of one planet and not the other? Is it really all about the proximity to the sun and the size of the planet? &lt;/p&gt;\n\n&lt;p&gt;What do I have wrong here?&lt;/p&gt;\n\n&lt;p&gt;Edit: second kind of question. My mental model (that is probably wrong) basically assumes venus should have captured about the same amount of H2O as earth being similar sizes. Could we assume the water is all there but has been obsorbed into Venus&amp;#39;s crazy atmosphere. Like besides being full of whatever it&amp;#39;s also humid? Or steam due to the temp?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 153,
  "permalink": "/r/askscience/comments/uyaogu/how_did_the_water_disappear_on_mars/",
  "subreddit": "askscience",
  "id": "uyaogu",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "So, I know it didn't disappear per say, it likely in some aquifer.. but..\n\nI would assume:\n\n1) since we know water was formed by stars and came to earth through meteors or\ndust, I would assume the distribution of water across planets is roughly\nproportional to the planet's size. Since mars is…"
}