{
  "author": "Doveen",
  "original_created_utc": 1629271291,
  "title": "In the 3rd century BC, crossing the Alps earned Hannibal an Absolute Madlad status. In the 4-5th century AD, Italy and Rome basically had revolving doors for those who wanted to sack them. What changed?",
  "created_utc": 1629347386,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Granted, 600 years is a long time, but... the Alps are a pretty permament feature of North Italy. How come They went from uncrossable, insourmountable natural barrier to &quot;Oh we passed some hills, I didn&#39;t even notice&quot; level annoyance for armies going to Italy?</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/p6manv/in_the_3rd_century_bc_crossing_the_alps_earned/",
  "subreddit": "AskHistorians",
  "id": "p6manv",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Granted, 600 years is a long time, but... the Alps are a pretty permament\nfeature of North Italy. How come They went from uncrossable, insourmountable\nnatural barrier to \"Oh we passed some hills, I didn't even notice\" level\nannoyance for armies going to Italy?",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "確かに600年は長いですが...アルプスは北イタリアの特徴の一つです。\n北イタリアの特徴です。越えられない自然の障壁が、どうして「ああ、丘を越えた」になったのか。\n越えられない自然の障壁が、イタリアに向かう軍隊にとって、「ああ、丘を越えたな、気づかなかった」程度の\nになってしまったのでしょうか？",
      "title": "紀元前3世紀、アルプス山脈を越えたことで、ハンニバルはAbsolute Madladの地位を得た。紀元4〜5世紀のイタリアとローマは、基本的に略奪したい人のための回転ドアを持っていました。何が変わったのか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "诚然，600年是一个很长的时间，但是......阿尔卑斯山是一个相当持久的\n北意大利的特征。它们怎么会从不可逾越的、不可逾越的\n的天然屏障变成了 \"哦，我们经过了一些山丘，我甚至都没有注意到 \"的水平\n对前往意大利的军队来说是个麻烦事？",
      "title": "在公元前3世纪，跨越阿尔卑斯山为汉尼拔赢得了绝对疯狂的地位。在公元4-5世纪，意大利和罗马基本上对那些想洗劫他们的人有旋转门。是什么改变了？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "誠然，600年是一個很長的時間，但是......阿爾卑斯山是一個相當持久的\n北意大利的特徵。它們怎麼會從不可逾越的、不可逾越的\n的天然屏障變成了 \"哦，我們經過了一些山丘，我甚至都沒有注意到 \"的水平\n對前往意大利的軍隊來說是個麻煩事？",
      "title": "在公元前3世紀，跨越阿爾卑斯山爲漢尼拔贏得了絕對瘋狂的地位。在公元4-5世紀，意大利和羅馬基本上對那些想洗劫他們的人有旋轉門。是什麼改變了？"
    }
  ]
}