{
  "author": "GeneralLeeBlount",
  "the_new_excerpt": "Greetings /r/askhistorians participants! I am Banastre Tarleton!\n\nFor years my dear friends and even rare acquaintances have suggested that I\npartake in viewing a moving picture titled The Patriot by Roland Emmerich. They\nmade me aware that there is a likeness to my own self with a character…",
  "original_created_utc": 1617282113,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "问候/r/askhistorians的参与者! 我是Banastre Tarleton!\n\n多年来，我亲爱的朋友们，甚至是难得一见的熟人都建议我\n参加观看由罗兰-艾默里奇拍摄的名为《爱国者》的电影。他们\n让我意识到，与我自己有相似之处的人物... ...",
      "title": "评论]Banastre Tarleton对Roland Emmerich的电影《爱国者》(2001)的看法。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "問候/r/askhistorians的參與者! 我是Banastre Tarleton!\n\n多年來，我親愛的朋友們，甚至是難得一見的熟人都建議我\n參加觀看由羅蘭-艾默裏奇拍攝的名爲《愛國者》的電影。他們\n讓我意識到，與我自己有相似之處的人物... ...",
      "title": "評論]Banastre Tarleton對Roland Emmerich的電影《愛國者》(2001)的看法。"
    },
    {
      "locale": "ja-JA",
      "the_new_excerpt": "r/askhistoriansの参加者の皆さん、こんにちは。私はバナストル・タールトンです。\n\n何年も前から、私の親愛なる友人や稀な知人が、ローランド・エメリッヒ監督の「愛国者」という映画を見るように勧めてきました。\nローランド・エメリッヒ監督の『The Patriot』という映画を見てみないかと誘われました。彼らは\n登場人物が私自身に似ていることに気づかせてくれたのです。",
      "title": "レビュー】ローランド・エメリッヒ監督作品『The Patriot』（2001年）に対するバナストル・タルトンの感想"
    },
    {
      "locale": "ja",
      "the_new_excerpt": "r/askhistoriansの参加者の皆さん、こんにちは。私はバナストル・タールトンです。\n\n何年も前から、私の親愛なる友人や稀な知人が、ローランド・エメリッヒ監督の「愛国者」という映画を見るように勧めてきました。\nローランド・エメリッヒ監督の『The Patriot』という映画を見てみないかと誘われました。彼らは\n登場人物が私自身に似ていることに気づかせてくれたのです。",
      "title": "レビュー】ローランド・エメリッヒ監督作品『The Patriot』（2001年）に対するバナストル・タルトンの感想"
    }
  ],
  "title": "[Review] Banastre Tarleton's thoughts on the film The Patriot (2001) by Roland Emmerich",
  "created_utc": 1617308981,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Greetings <a href=\"/r/askhistorians\">/r/askhistorians</a> participants! I am Banastre Tarleton!</p>\n\n<p>For years my dear friends and even rare acquaintances have suggested that I partake in viewing a moving picture titled <em>The Patriot</em> by Roland Emmerich. They made me aware that there is a likeness to my own self with a character named Tavington? I have to say the name is nothing like mine, so I have doubted the assumption since the idea’s inception. Upon some research I discovered that Mel Gibson played the main character, Benjamin Martin, and is the star Patriot of the movie. I was shocked to learn that Gibson hails from the future penal colony of Australia. A brigand on stage! </p>\n\n<p>Martin begins as a man of noble soul, a man who served his time in His Majesty’s army in the late war against the French, and hesitant to take up the musket once more. Only few can understand the resistance to pick up arms again after war ends. It is a shortly after this introduction that this Tavington fellow is brought into the fold. I ought to end my relations with my friends for thinking of me when they first witnessed this character. I am above insulted! I bear no likeness to this brute who has no genteel morals and scruples. Commissioned officers of His Majesty’s Britannic army have standards to uphold and save for that Fannings fellow, they were upheld throughout the war. Who will these authors base their next fictional villain on next? Perhaps another gentleman such as John Graves Simcoe. Oh, how disgusting that would be.</p>\n\n<p>The Tavington character’s likeness to me must be based on falsehoods. I never committed atrocities such as these. Never put a torch near a church nor harmed the hair on a prisoner. The authors ought to have researched my journal on the campaign! They would have found that I acted wholly as a gentleman. I ensured protection of prisoners of war shortly after the battle near Camden when the American army routed for safety. My drive for victory against them was never personally but purely professional on a military level. During the war I held no sympathy for the rebel but I also held no hatred to him. I also wish to bring to light that the Earl Cornwallis never held ill will against me nor I to him. He became a mentor to me during the war and I had his constant support while in the Carolinas. Never did once lash out at me in the manners that the film suggests. </p>\n\n<p>I found no surprise that the viewpoint of the picture focused on Martin as the reluctant hero of the American cause. I suppose over the years after the war ended I found some small inkling of sympathy for these rebellious Americans. May be not patriotic to the British government, but to their cause and future experiment in sovereignty. The authors of this entertainment left out any possibly sympathy or understanding of loyalist cause. It created a rather one-sided picture of fighting a war against a faceless and heartless enemy, which was not the case. Hearts and bodies bled on both sides for their cause. The Captain Wilkin’s character soured any attempt for the audience to gain sympathy for the loyalist cause. I have no iota of an idea what person he could be based on, other than the ancient and eternal ruffian who will do his master’s bidding of staining one’s hands with blood. His guilt over the atrocities on civilians led to no change in character and mattered not one bit. It left no effect on the plot and might as well never had appeared. </p>\n\n<p>If possible, I must make a slight comment on the dress of the characters within. The clothing seemed a poor facsimile of what we wore then and nary a hat on most of the men. Of course, I attempted to enjoy the feature without these presumptuous nitpicks, but when they portray these costumes as the fashions of the era it must be protested – however, protested lightly. I scoffed at the author’s choice of giving the dragoons redcoats due to the possible confusion it may cause American audiences upon seeing green coats. I shall tell you from my own experience that Americans gave no confusion in differentiating my troops from their own in battle from the many times they pointed their weapons at me. Bah! Green jackets were a pride in my unit as well as our counterparts in the Queen’s Rangers. They will be a rather <em>sharpe</em> addition to the British army when fully established.</p>\n\n<p>Martin is a likeable character and possibly reminds me of the certain figures I chased after in the Carolinas during the war. I admit that at certain times I cheered at some of his antics with delight, even if I thought they were too clever to be realistic. I cannot think of any deceitful acts that occurred in the war that in any part resembled Martin’s trickery. I do not discount his style of warfare as irregular and beneath the tactics of the British army as we certainly learned the craft in the previous war and is likely when Martin learned as well. Without guilt, I also admit a feeling of redemption witnessing Martin kill Tavington at the battle of…somewhere in the Carolina backcountry? Considering that I lived after the war for a few decades and this brute did not, I take it as the biggest degree of separation from my own person. However, I must critique Martin’s purpose in the war and the war itself. Martin held no motivation for war other than a burning revenge for loss. He exuberated much less spirit of the American cause than a patriot ought to show. The feature is not titled <em>A Patriot</em> but <em>THE</em> Patriot and Martin lacked any fervor or zeal for the much contested reasons for the war. Perhaps it was a mistake to give this film that title. May be <em>A BackCountry Revenge: A Family Man’s War in the Carolinas during the late American War against the British</em> would have been more appropriate for the film. This work of fantasy is out of bounds with the notions of the history and the understandings of the war. I surely hope they do not attempt a fantastical sequel to this refuse pile.</p>\n\n<p>With the real truth, I am your obedient and humble servant,</p>\n\n<p>Banastre Tarleton</p>\n</div><!-- SC_ON -->",
  "score": 101,
  "permalink": "/r/AskHistorians/comments/mhusvb/review_banastre_tarletons_thoughts_on_the_film/",
  "subreddit": "AskHistorians",
  "id": "mhusvb",
  "is_self": true,
  "media": null,
  "is_video": false
}