{
  "author": "mamalalatata",
  "original_created_utc": 1635653394,
  "title": "I don't have the time to try and convince you",
  "created_utc": 1635661845,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>My family was in town and we were having dinner. My brother asked if I saw the new FTX banner while watching the World Series. That sent my sister in to a soap box. </p>\n\n<p>&quot;Crypto is bad for the environment.&quot; &quot;It&#39;s too late to earn any money.&quot; &quot;Only banks and institutional investors are buying right now.&quot; &quot;It&#39;s really just an immoral investment.&quot; </p>\n\n<p>My sister has become quite outspoken about her political leanings recently in the past few years and usually is outspoken and looking to debate. It felt like bait so I just decided just to ignore it.</p>\n\n<p>I was reminded of the quote &quot;If you don&#39;t believe it or don&#39;t get it, I don&#39;t have the time to try to convince you, sorry.&quot; </p>\n\n<p>There is so much positive energy in this space I just didn&#39;t feel the need to try to convince someone who had already made up their mind. I had better things to do.</p>\n</div><!-- SC_ON -->",
  "score": 163,
  "permalink": "/r/CryptoCurrency/comments/qjhrsf/i_dont_have_the_time_to_try_and_convince_you/",
  "subreddit": "CryptoCurrency",
  "id": "qjhrsf",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "My family was in town and we were having dinner. My brother asked if I saw the\nnew FTX banner while watching the World Series. That sent my sister in to a soap\nbox.\n\n\"Crypto is bad for the environment.\" \"It's too late to earn any money.\" \"Only\nbanks and institutional investors are buying right now.\"…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "家族が来ていたので、夕食を食べていた。弟が、FTXの新しいバナーを見たかと聞いてきました。\nワールドシリーズを見ているときに、新しいFTXのバナーを見たかと聞いてきました。それを聞いた姉は\nをしていました。\n\n\"暗号は環境に悪い\" \"稼げるようになるには遅すぎる\" \"今買っているのは\n銀行や機関投資家だけが買っている」...。",
      "title": "説得している暇はありません。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我的家人在城里，我们正在吃晚饭。我哥哥问我是否看到了\n我哥哥问我在看世界大赛时是否看到了新的FTX旗帜。这让我的妹妹很生气\n了。\n\n\"加密货币对环境不好。\" \"现在挣钱已经太晚了。\" \"只有\n现在只有银行和机构投资者在购买。\" ...",
      "title": "我没有时间试图说服你"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我的家人在城裏，我們正在喫晚飯。我哥哥問我是否看到了\n我哥哥問我在看世界大賽時是否看到了新的FTX旗幟。這讓我的妹妹很生氣\n了。\n\n\"加密貨幣對環境不好。\" \"現在掙錢已經太晚了。\" \"只有\n現在只有銀行和機構投資者在購買。\" ...",
      "title": "我沒有時間試圖說服你"
    }
  ]
}