{
  "author": "Ikhtilaf",
  "the_new_excerpt": "I thought it's just how the book frames its discussion, but I just finished a\nshort class on Japanese philosophy and they too barely discuss political\nphilosophy before the Meiji period (in Meiji we have Kyoto School). Unless we\ncount the mythological story of the founding of \"Japanese nation\"…",
  "original_created_utc": 1614438945,
  "localize": [
    {
      "locale": "zh",
      "the_new_excerpt": "我以为这只是书中的讨论框架，但我刚看完一本《》。\n日本哲学的短课，而他们也几乎不讨论政治。\n明治以前的哲学（在明治我们有京都学派）。除非我们\n细数 \"日本民族 \"成立的神话故事...",
      "title": "我一直在读日本哲学。明治时期之前的政治哲学明显缺失了 为什么这样说呢？日本有政治哲学吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我以爲這只是書中的討論框架，但我剛看完一本《》。\n日本哲學的短課，而他們也幾乎不討論政治。\n明治以前的哲學（在明治我們有京都學派）。除非我們\n細數 \"日本民族 \"成立的神話故事...",
      "title": "我一直在讀日本哲學。明治時期之前的政治哲學明顯缺失了 爲什麼這樣說呢？日本有政治哲學嗎？"
    }
  ],
  "title": "I've been reading Japanese Philosophy: A Sourcebook and there's a notable absence of political philosophy prior to Meiji period. Why? Is there a Japanese political philosophy?",
  "created_utc": 1614477310,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I thought it&#39;s just how the book frames its discussion, but I just finished a short class on Japanese philosophy and they too barely discuss political philosophy <strong>before</strong> the Meiji period (in Meiji we have Kyoto School). Unless we count the mythological story of the founding of &quot;Japanese nation&quot; (wa).</p>\n\n<p>Considering that the Emperor is considered sacred in Japanese history, I thought it would&#39;ve inspired a discussion of political theology of some sort. Perhaps like Ibn Taimiyya in Islamic philosophy? Japan also has long history of political feud between daimyo and shogunate families, which IMHO should have given birth to some kind of Japanese Thomas Hobbes.</p>\n\n<p>(sorry for the Eurocentric analogy)</p>\n\n<p>The discussion in the book and the class mostly revolves around ethics.</p>\n\n<p>Why is this? I believe there should be political philosophies written before Meiji Japan - if so, what are they?</p>\n</div><!-- SC_ON -->",
  "score": 117,
  "permalink": "/r/askphilosophy/comments/ltq5q1/ive_been_reading_japanese_philosophy_a_sourcebook/",
  "subreddit": "askphilosophy",
  "id": "ltq5q1",
  "is_self": true,
  "media": null,
  "is_video": false
}