{
  "author": "drewgarr",
  "original_created_utc": 1636623817,
  "title": "I did it. I was able to regain my wallet",
  "created_utc": 1636652231,
  "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hello you beautiful crypto investors. </p>\n\n<p>For the last 2 days, ive been really down because well, my trust wallet became completely compromised. </p>\n\n<p>Coins were being transferred out without me knowing or being sold on the exchange or being routed to another wallet. </p>\n\n<p>I couldn’t remove 8 bad contracts via BSC revoke tool, or beefy. FYI, please run your wallet through those tools. It will save your wallet. </p>\n\n<p>I couldn’t transfer out my funds because all transfers were stuck on pending and wouldn’t show up. By luck the wallet had changed network or something. </p>\n\n<p>My solution was to find a wallet that had access to unrekt. I created a new wallet there and was able to capture the URL of unrekt. I than took out my SIM card and blacklisted everything on my router except for this very special URL. In this new wallet I imported the tokens I was going to need to transfer. </p>\n\n<p>I imported my hacked wallet and with the fastest fingers you’ve ever seen, I was able to run the dApp and got all the shit contracts off my BSC. From there, I sent all the assets to the other, new safe wallet. </p>\n\n<p>Yeah I lost a lot in taxes (about 10%) but here I am, relived and somewhat humbled. Ive learned my lesson to follow the contract and learned how to identify honey pots and rug pulls on the BSC. </p>\n\n<p>TL:DR : With some luck and clever work arounds, I was able to recover 90% of my wallet assets.</p>\n</div><!-- SC_ON -->",
  "score": 156,
  "permalink": "/r/CryptoCurrency/comments/qrhq0u/i_did_it_i_was_able_to_regain_my_wallet/",
  "subreddit": "CryptoCurrency",
  "id": "qrhq0u",
  "is_self": true,
  "media": null,
  "is_video": false,
  "the_new_excerpt": "Hello you beautiful crypto investors.\n\nFor the last 2 days, ive been really down because well, my trust wallet became\ncompletely compromised.\n\nCoins were being transferred out without me knowing or being sold on the\nexchange or being routed to another wallet.\n\nI couldn’t remove 8 bad contracts via…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "美しい暗号投資家の皆さん、こんにちは。\n\nこの2日間、本当に落ち込んでいました。というのも、私のトラストウォレットが\n完全に壊れてしまったからです。\n\nコインが知らない間に送金されたり、取引所で売られたり、別のウォレットに転送されたりしていました。\n取引所で売られたり、別のウォレットに転送されたりしていました。\n\n私は8つの不良契約を削除できませんでした...",
      "title": "やりました。私は財布を取り戻すことができました"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "你们好，美丽的加密货币投资者。\n\n在过去的2天里，我一直很沮丧，因为我的信托钱包变得\n完全被破坏了。\n\n硬币在我不知情的情况下被转移出去，或在交易所被卖掉，或被转移到另一个钱包。\n交易所或被转到另一个钱包里。\n\n我无法删除8个坏的合同，通过...",
      "title": "我做到了。我能够重新获得我的钱包"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "你們好，美麗的加密貨幣投資者。\n\n在過去的2天裏，我一直很沮喪，因爲我的信託錢包變得\n完全被破壞了。\n\n硬幣在我不知情的情況下被轉移出去，或在交易所被賣掉，或被轉移到另一個錢包。\n交易所或被轉到另一個錢包裏。\n\n我無法刪除8個壞的合同，通過...",
      "title": "我做到了。我能夠重新獲得我的錢包"
    }
  ]
}