{
  "author": "busterrulezzz",
  "original_created_utc": 1654611125,
  "title": "A data scientist claims that only 64 individuals controlled Bitcoin mining during the 2009-2011 period, and that those miners could have easily done a 51% attack but chose not to do so",
  "created_utc": 1654630339,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;An American data scientist unveiled in the mainstream media yesterday the results of an investigation she conducted on the early days of Bitcoin during the 2009 to 2011 period. It&amp;#39;s fascinating: according to her, 64 individuals controlled virtually all of the mining at that time, and they could easily have attacked the network, but chose not to.&lt;/p&gt;\n\n&lt;p&gt;This study raises questions about the decentralization of Bitcoin in its early years. We know that the community was much smaller back then, but it&amp;#39;s impressive how tiny it was. &lt;/p&gt;\n\n&lt;p&gt;The scientist, Alyssa Blackburn, used &amp;quot;leakage information&amp;quot; to come up with this result. Here&amp;#39;s how &lt;em&gt;The New York Times&lt;/em&gt; reported her methods :&lt;/p&gt;\n\n&lt;p&gt;&amp;#x200B;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Aggregating multiple leakages, Ms. Blackburn consolidated many Bitcoin addresses, which might have seemed to represent many miners, into few. She pieced together a catalog of agents and concluded that, in those first two years, 64 key players — some of whom were the community’s “founders,” as the researchers called them — mined most of the Bitcoin that existed at the time.  &lt;/p&gt;\n\n&lt;p&gt;“What they figured out, just how concentrated early mining and use of Bitcoin was, that’s a scientific discovery,” said Eric Budish, an economist at the University of Chicago.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Some might think this is bad news, but I disagree. For one thing, it proves that serious scientific researchers are interested in blockchain and its usefulness (by the way, Alyssa Blackburn herself says that she is cryptocurrency agnostic, and she says that her research can help make the network more decentralized).&lt;/p&gt;\n\n&lt;p&gt;It also shows how far we&amp;#39;ve come since 2009. Today, it would be unthinkable that a single person - or a small group of people - could carry out a 51% attack against Bitcoin. &lt;/p&gt;\n\n&lt;p&gt;Finally, it proves that the early adopters cared about the health of the network.&lt;/p&gt;\n\n&lt;p&gt;Contrary to what no-coiners love to think, cryptocurrency and blockchain is a new and fascinating technology, and that study proves it. Real scientific progress is being achieved because of it. “The techniques used to extract information are interesting&amp;quot;, said Jaron Lanier, a computer scientist. Studying blockchains lead to new techniques, which is a scientific progress.&lt;/p&gt;\n\n&lt;p&gt;What do you think about this discovery?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 453,
  "permalink": "/r/CryptoCurrency/comments/v6wpi8/a_data_scientist_claims_that_only_64_individuals/",
  "subreddit": "CryptoCurrency",
  "id": "v6wpi8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "An American data scientist unveiled in the mainstream media yesterday the\nresults of an investigation she conducted on the early days of Bitcoin during\nthe 2009 to 2011 period. It's fascinating: according to her, 64 individuals\ncontrolled virtually all of the mining at that time, and they could…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "アメリカのデータサイエンティストが昨日、主要メディアで発表した\nビットコインの初期である2009年から2011年にかけて行った調査の結果を発表しました。\n調査結果を発表しました。彼女によると、64人の個人が\n当時の採掘のほとんどを支配しており、彼らは...",
      "title": "あるデータサイエンティストの主張によると、2009年から2011年の間にビットコインの採掘をコントロールしたのはわずか64人であり、それらのマイナーは51％攻撃を容易に行うことができたが、そうしないことを選択したという。"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "一位美国数据科学家昨天在主流媒体上公布了\n她在2009年至2011年期间对比特币的早期进行的调查的结果。\n2009年至2011年期间，她对比特币早期进行了调查。这很吸引人：据她说，当时有64个人\n控制了当时几乎所有的采矿，而且他们可以...",
      "title": "一位数据科学家声称，在2009-2011年期间，只有64个人控制了比特币挖矿，这些矿工本可以轻松完成51%的攻击，但却选择不这样做。"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "一位美國數據科學家昨天在主流媒體上公佈了\n她在2009年至2011年期間對比特幣的早期進行的調查的結果。\n2009年至2011年期間，她對比特幣早期進行了調查。這很吸引人：據她說，當時有64個人\n控制了當時幾乎所有的採礦，而且他們可以...",
      "title": "一位數據科學家聲稱，在2009-2011年期間，只有64個人控制了比特幣挖礦，這些礦工本可以輕鬆完成51%的攻擊，但卻選擇不這樣做。"
    }
  ]
}