{
  "author": "teeth_03",
  "original_created_utc": 1650944076,
  "title": "Do people in the r/FuckCars movement not understand rural life?",
  "created_utc": 1650965713,
  "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I keep seeing this sub pop up in my feed despite not being subscribed to it, and it makes me feel like the whole movement is a bunch of city dweelers with great access to public transportation.&lt;/p&gt;\n\n&lt;p&gt;Which I get it, they want to see improvements to public transport. But is it feasible for every road in rural counties to have a bus stop? Do they really expect people to walk miles to get to one? What if I want to buy a bunch of groceries, am I supposed to carry them on a bus? What if I want to use my Truck to buy some lumber to build something? Its hard to take 4x8 sheets of plywood on a bus I think.&lt;/p&gt;\n\n&lt;p&gt;It just seems like this movement is geared towards people in populated areas who live in highrises who only need to ride a bus a few blocks to get to stores and work. I just cant see how not having a car would work for people who live on dirt roads in cow country.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
  "score": 102,
  "permalink": "/r/TooAfraidToAsk/comments/uc3el8/do_people_in_the_rfuckcars_movement_not/",
  "subreddit": "TooAfraidToAsk",
  "id": "uc3el8",
  "is_self": true,
  "media": null,
  "is_video": false,
  "sensitive": false,
  "the_new_excerpt": "I keep seeing this sub pop up in my feed despite not being subscribed to it, and\nit makes me feel like the whole movement is a bunch of city dweelers with great\naccess to public transportation.\n\nWhich I get it, they want to see improvements to public transport. But is it\nfeasible for every road in…",
  "localize": [
    {
      "locale": "ja",
      "the_new_excerpt": "購読していないにもかかわらず、私のフィードにこのサブがポップアップするのをずっと見ています。\nこのムーブメントが、公共交通機関を使いこなす都会人の集まりであるように感じられるからです。\nを利用する都会人の集まりのような気がします。\n\n公共交通機関の整備を望んでいるのはわかります。しかし、それは\nすべての道路で実現可能なのか...",
      "title": "r/FuckCars運動の人たちは、田舎の生活を理解していないのでしょうか？"
    },
    {
      "locale": "zh",
      "the_new_excerpt": "我一直看到这个子在我的饲料中出现，尽管我没有订阅它。\n这让我觉得整个运动是一群城市里的人，有很好的公共交通。\n乘坐公共交通工具。\n\n我明白，他们希望看到公共交通的改善。但是，这是否\n但是，对于每条道路来说，是否可行？",
      "title": "r/FuckCars运动中的人们不了解农村生活吗？"
    },
    {
      "locale": "zh-Hant",
      "the_new_excerpt": "我一直看到這個子在我的飼料中出現，儘管我沒有訂閱它。\n這讓我覺得整個運動是一羣城市裏的人，有很好的公共交通。\n乘坐公共交通工具。\n\n我明白，他們希望看到公共交通的改善。但是，這是否\n但是，對於每條道路來說，是否可行？",
      "title": "r/FuckCars運動中的人們不瞭解農村生活嗎？"
    }
  ]
}